{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130201-238421-cook-the-book-lemongrass-beef-stew.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Vietnamese", "keywords": ["Charles Phan", "Cook the Book", "lemongrass", "star anise", "The Slanted Door", "Vietnamese Home Cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Charles Phan's Lemongrass Beef Stew", "link": "https://www.seriouseats.com/recipes/2013/02/charles-phans-lemongrass-beef-stew.html", "description": "Braised short ribs are one of those no-brainer wintertime comfort foods. Easy to prep, slow to cook, and luscious to eat, the well-marbled cut of beef tastes great simmered in just about anything--from tomato-based Italian broths to beer and beef broth. In <strong><a href=\"http://charlesphan.com/index.html\">Charles Phan's</a></strong> <em><a href=\"http://www.amazon.com/Vietnamese-Home-Cooking-Charles-Phan/dp/1607740532/?tag=serieats-20\">Vietnamese Home Cooking</a></em>, Phan presents a French-influenced stew laced with lemongrass, ginger, star anise, and Thai chiles. Alongside the short ribs, he braises (not-surprising) carrots and (more curious) daikon radish to add sweetness and texture to the beef. And a bonus? The brothy, rich sauce is wonderful on its own should you \"accidentally\" eat all of the beef out of the stew first", "totalTime": "2 hours and 45 minutes", "recipeYield": "serves 6", "recipeCategory": ["Beef", "Braising and Stewing", "Cook the Book", "Ginger", "Mains", "Vietnamese"], "recipeIngredient": ["3 pounds boneless beef short ribs, cut into 1 1/2-inch cubes", "4 tablespoons canola oil", "1 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "2 cups diced yellow onion", "2 teaspoons minced garlic", "1/4 cup finely minced lemongrass", "3 tablespoons tomato paste", "2 by 1-inch piece fresh ginger, peeled and smashed", "2 whole star anise pods", "1 or 2 Thai chiles, stemmed, plus 1 teaspoon minced, for garnish", "6 cups beef stock", "3 carrots, peeled and cut into 2-inch lengths", "8 ounces daikon radish, peeled and cut into 1-inch lengths", "about 2 tablespoons fish sauce", "1/4 cup finely sliced fresh Thai basil, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the beef in a bowl. Drizzle with 1 tablespoon of the oil, sprinkle with the salt and pepper, and stir to coat. Let stand while you prepare all of the other ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven or heavy-bottomed pot, heat the remaining 3 tablespoons oil over high heat. When the oil is hot, working in batches, add the beef and cook, turning as needed, for about 8 minutes, until browned on all side. As each batch is ready, transfer it to a rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Decrease the heat to medium and add the onion to the now-empty pot. Cook, stirring frequently, for about 10 minutes, until the onion is a deep golden brown. Stir in the garlic and cook, stirring, for 30 seconds more. Add the lemongrass, tomato paste, ginger, star anise, and whole chile to taste and stir to combine. Transfer the mixture to a large clay pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the beef and any accumulated juices to the clay pot and pour in the stock. Bring the liquid to a boil over medium heat, decrease the heat so the liquid is at a gentle simmer, cover, and cook, stirring occasionally, for 1 1/2 hours, until the meet is just tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the carrots and daikon, re-cover, and cook for 30 minutes longer, until the vegetables are cooked through and the meat is very tender. Remove from the heat and stir in the fish sauce, 1 tablespoon at a time, to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the stew directly from the clay pot. Top each serving with some of the basil and minced chile.</p>"}]}