{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/082713-264020-cook-the-book-braised-beet-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["beet", "Cook the Book", "indian food", "raisin", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Braised Beet Salad with Golden Raisin Vinaigrette from 'Indian Cooking Unfolded'", "link": "https://www.seriouseats.com/recipes/2013/08/cook-the-book-braised-beet-salad-with-golden-raisin-vinaigrette-from-indian-cooking-unfolded.html", "description": "In <em><a href=\"http://www.amazon.com/Indian-Cooking-Unfolded-Recipes-Ingredients/dp/0761165215/?tag=serieats-20\">Indian Cooking Unfolded</a></em>, Iyer offers seven Indian-esque salad recipes that blend Western-style raw greens with robust Indian spice. This beet salad is a perfect example of Indian-American fusion, with heat from ginger balanced by grassy cilantro and candy-sweet golden raisins.", "totalTime": "35 to 40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Gluten-Free", "Salads", "Sides", "Vegetarian"], "recipeIngredient": ["<strong>Braised Beets</strong>", "1 1/2 pounds beets with their green tops", "2 tablespoons canola oil", "1 teaspoon black or yellow mustard seeds", "3 pieces fresh ginger (each about the size and thickness of a 25-cent coin; no need to peel the skin), cut into matchstick-thin shreds", "1 to 2 fresh green serrano chiles, stems discarded, finely chopped (do not remove the seeds)", "1 teaspoon coarse kosher or sea salt", "&nbsp", "<strong>Golden Raisin Vinaigrette</strong>", "1 teaspoon cumin seeds", "1/4 cup canola oil", "1/4 cup cider vinegar", "1/2 cup golden raisins", "1/4 cup firmly packed fresh cilantro leaves and tender stems", "3 pieces (each about the size and thickness of a 25-cent coin) fresh ginger (no need to peel the skin)", "1 fresh green serrano chile, stem discarded", "&nbsp", "8 ounces mixed salad greens (like mesclun)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the beets:</strong> Twist off the green tops of the beets. These look very similar to chard leaves and more likely than not will be gritty with sand and mud. Cut the tender ribs and leaves crosswise into thin slices and place them in a colander. Thoroughly rinse the beet tops to rid them of the gritty material. Transfer them to a salad spinner and spin them dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the beets and cut them into 1-inch cubes. Rinse the cubes as well in the colander (the gush of blood-red water gives you a clue to the power of the natural dye the vegetable has within its sugary sweetness). There’s no need to spin them dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a medium-size saucepan over medium-high heat. Once the oil appears to shimmer, add the mustard seeds, cover the pan, and cook until the seeds have stopped popping (not unlike popcorn), about 30 seconds. Add the ginger and chiles and stir-fry until the ginger is lightly browned and the chiles are much more pungent, 1 to 2 minutes. Add the beet greens, the cubed beets, and salt and stir well to coat them with the mustard seeds. The liquid in the beet greens will start to pool at the bottom of the pan and boil instantly, loosening the stuck-on bits of ginger and chiles, effectively deglazing the pan and releasing those flavors into the beets. Reduce the heat to medium, cover the pan, and cook, stirring occasionally, until the beets are tender when pierced with a fork, 10 to 15 minutes (the beets also will sweat, releasing some liquid, in which they will braise).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>While the beets cook, make the vinaigrette dressing:</strong> Heat a small skillet over medium-high heat. Once the skillet is hot (when you hold your palm close to the bottom of the skillet you will feel the heat), usually after 2 to 4 minutes, add the cumin seeds and toast them, shaking the pan every few seconds, until they start to crackle, turn reddish-brown, and smell nutty, 30 seconds to 1 minute. Immediately transfer the cumin seeds to a blender or they will start to burn in the hot skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the oil and the vinegar into the blender along with the raisins, cilantro, ginger, and whole chile and blend them into a smooth puree that is light greenish brown and sweet, sour, pleasantly hot, and highly aromatic (trust me, you will stick a finger in it, taste it, and go wow!).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Once the beets and greens are done, make the salad:</strong> Place the mixed salad greens in a large bowl. Pour the vinaigrette dressing over the salad greens and toss to coat; I use my hands (clean) to do this. Pile the dressed salad greens onto a platter, spoon the still-warm beets and greens over them, and serve.</p>"}]}