{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20120114-bakethebook-lemontarts.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Bouchon Bakery", "individual desserts", "lemon", "meringue", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bouchon Bakery's Lemon Meringue Tarts", "link": "https://www.seriouseats.com/recipes/2013/01/bouchon-bakery-lemon-meringue-tarts-recipe.html", "description": "There's something special about having your very own dessert. Larger than petits fours, but just as precious, the surprising layer of madeleine cake push these tarts past pleasant and towards perfection.", "totalTime": "overnight, for setting/cooling", "recipeYield": "makes 6 tarts", "recipeCategory": ["Bake the Book", "Desserts", "Lemon", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1/2 recipe Pâte Sucrée (see below)", "Egg whites", "Granulated sugar", "Madeleine Cake, frozen", "Lemon Curd", "&nbsp;", "<strong>Pâte Sucrée</strong>", "  2 2/3 cups (375 grams) all-purpose flour", "1/4 cup + 2 ½ tablespoons (46 grams) powdered sugar", "3/4 cup + 1 tablespoon (94 grams) powdered sugar", "1/4 cup  + 3 tablespoons (47 grams) almond flour/meal ", "8 ounces (225 grams) unsalted butter, at room temperature", "1/2 vanilla bean, split lengthwise", "3 1/2 tablespoons (56 grams) eggs", "&nbsp;", "<strong>Madeleine Cake</strong>", "1/4 cup + 1 1/2 tablespoons (47 grams) all-purpose flour", "3/8 teaspoon (1.5 grams) baking powder", "3 tablespoons + 1 teaspoon (50 grams) eggs", "3 tablespoons + 2 1/2 teaspoons (45 grams) granulated sugar", "1 tablespoon + 1 teaspoon (28 grams) glucose syrup", "0.6 ounce (19 grams) unsalted butter", "2 teaspoons (9 grams) whole milk", "1 tablespoon + 1 teaspoon (19 grams) fresh lemon juice", "&nbsp;", "<strong>Lemon Curd</strong>", "3/4 sheet (1.8 grams) silver leaf gelatin", "1/4 cup + 3 tablespoons (108 grams) eggs", "1/2 cup + 2 teaspoons (108 grams) granulated sugar", "1/4 cup + 3 tablespoons (108 grams) strained fresh lemon or lime juice", "5 ounces (140 grams) Unsalted butter, cut into 1/2-inch pieces, at room temperature", "Grated zest of 1/2 small lemon or 1/2 lime (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pâte Sucrée:</strong> Place the all-purpose flour in a medium bowl. Sift the 46 grams plus 2 1/2 tablespoons powdered sugar and the almond flour into the bowl; break up any lumps of almond flour remaining in the sieve, add them to the bowl, and whisk to combine.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the butter in the bowl of a stand mixer fitted with the paddle attachment and cream on medium-low speed, warming \tthe bowl as needed, until the butter is the consistency of mayonnaise and holds a peak when the paddle is lifted. Sift in the remaining 94 grams/3/4 cup plus 1 tablespoon powdered sugar and pulse to begin incorporating the sugar, then increase the speed to medium-low and mix for about 1 minute, until the mixture is fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape down the sides and bottom of the bowl. Scrape the seeds from the vanilla bean, add them to the butter mixture, and mix on low speed for about 30 seconds to distribute the seeds evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the dry ingredients in 2 additions, mixing for 15 to 30 seconds after each, or until just combined. Scrape the bottom of the bowl to incorporate any dry ingredients that have settled there. Add the eggs and mix on low speed until just combined, 15 to 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to the work surface. Use the heel of your hand to smear the dough and work it together (fraiser). Divide the dough in half and form each half into a 4-by-6-inch-rectangle, about 1 inch thick.</p>\n\n<p>*You will use only one of these rectangles to make the tarts. The other half can be used in future recipes, for any tart with a semi-sweet filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap each piece in a double layer of plastic wrap. Refrigerate until firm, about 2 hours, but preferably overnight. The dough can be refrigerated for up to 2 days or frozen for up to 1 month.\t<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Madeleine Cake:</strong> Preheat the oven to 350F. Line a sheet pan with Silpat or spray lightly with nonstick spray, line with parchment paper, and spray the parchment. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour and baking powder into a medium bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the eggs and sugar in the bowl of a stand mixer fitted with the whisk attachment and mix on medium-low speed for about 1 minute. Increase the speed to medium and whip for about 5 minutes, until the mixture is thick and pale yellow. Scrape down the sides and bottom of the bowl, then whip on medium-high speed for 5 minutes, or until the mixture has thickened but is still light and airy. Remove the bowl from the mixture stand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the glucose and butter in a medium saucepan, set over medium heat, and whisk to combine as they melt. Remove from the heat and whisk in the milk, then pour into a bowl and let cool until just warm to the touch. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk about one-quarter of the egg mixture into the glucose mixture. Whisk in the lemon juice. Fold the dry ingredients into the remaining egg mixture in 2 additions. Fold in the glucose mixture one-quarter at a time, completely incorporating each addition before adding the next. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the batter in a thin layer and bake for 10 to 12 minutes; the layer should not take on any color. Let cool, then place the pan in the freezer until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lemon Curd:</strong> Place the gelatin in a bowl of ice water to soften.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk the eggs and sugar together in a medium saucepan. Slowly whisk in the lemon or lime juice. Place the pan over medium heat and whisk slowly, until the mixture begins to simmer. Simmer for 3 to 5 minutes, whisking constantly, until thickened. Remove the pan from the heat and whisk gently for 1 to 2 minutes to release steam and cool the curd slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the gelatin from the water, squeezing out the excess water, and whisk it into the hot curd. Strain the curd through a fine-mesh strainer set over the container of a Vitamix and blend on low speed for a few seconds, then add the butter 2 or 3 pieces at a time, blending until incorporated. Add the zest, if using, and blend to incorporate. Let the curd cool to room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The curd can be used at this point or transferred to a covered container. Press a piece of plastic wrap against the surface to prevent a skin from forming and refrigerate for up to 4 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the curd has been refrigerated and has stiffened, transfer it to the bowl of a stand mixer fitted with the paddle attachment and mix slowly until it reaches a creamy consistency. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> For the tart shell: Preheat the oven to 325°F. Line a sheet pan with a Silpat or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out half the dough, line the tart rings, and fill with rice. Bake for 8 minutes, then rotate the pan and bake for another 8 minutes, or until the dough is set and no longer sticks to the parchment paper. Remove the parchment and rice (store the rice for future use), return the pan to the oven, and bake for another 12 minutes, or until the dough is cooked through and golden brown. Set the pan on a cooling rack and cool completely. Run the tip of a paring knife between the top of the crust and the ring to loosen the crust, then lift off the ring.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make a Swiss meringue: Place the egg whites and sugar in the bowl of a stand mixer and set over a saucepan of simmering water. Whisk until the mixture reaches 160°F/71.1°C, then immediately put the bowl on the mixer, attach the whisk attachment, and whip at medium-high speed for about 5 minutes, until the whites hold stiff peaks and are cool. Transfer to the pastry bag fitted with the 1-inch tip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use the round cutter to cut the frozen madeleine layer into 6 rounds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the pastry bag fitted with the 1/2-inch plain tip with the lemon curd.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill the tart shells with curd to 1/2 inch from the rim of the shells (50 grams/1/3 cup each). Place the cake rounds on top. Hold the pastry bag vertically over the center of each cake, about 1 inch from the surface, and pipe the meringue to cover about two-thirds of the surface (20 grams each), then pull the bag up to form a dome with as much additional meringue as you’d like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hold a small offset spatula at the tip of the domed meringue and pull it to the edges of the crust, forming a smooth line from the tip to the outside of the shell. Wipe off the spatula and continue around the tart to form a cone shape, then use the spatula to form irregular peaks in the meringue. Using the propane torch, brown the top of the meringue.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The tarts are best the same day they are assembled. They can be refrigerated for 4 to 6 hours; remove them from the refrigerator 20 minutes before serving.</p>"}]}