{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130808-262300-savory-tomato-pork-stew.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["easy", "pork", "slow cooker", "stew", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Savory Tomato Pork Stew", "link": "https://www.seriouseats.com/recipes/2013/08/savory-pork-tomato-stew-slow-cooker-recipe.html", "description": "Super rich and tart, this stew is perfect for the end of summer when tomatoes season is coming to a close.", "totalTime": "3 1/2 hours (or 6 to 8 hours in a slow cooker)", "recipeYield": "serves 4", "recipeCategory": ["Mains", "Pork", "Slow Cooker", "Tomato"], "recipeIngredient": ["2 tablespoons butter", "1 small onion, chopped (about 3/4 cup)", "1 medium clove garlic, minced (about 1 teaspoon)", "1 teaspoon vegetable oil", "1 pound pork shoulder, cut into 1-inch cubes", "1 cup dry white wine", "2 pounds tomatoes, peele, deseeded, and roughly chopped or 1 (28-ounce) and 1 (14-ounce) can whole peeled tomatoes, drained and roughly crushed by hand", "2 cups homemade or store-bought low sodium chicken stock", "1 bay leaf", "1 teaspoon fresh oregano leaves", "Kosher salt and freshly ground black pepper", "2 teaspoon cornstarch", "1/4 cup cold water", "2 tablespoons chopped fresh parsley leaves."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 225°F. Heat butter in a small saucepan over medium-low heat until melted. Add onions and cook, stirring occasionally, until they are tender and just beginning to brown, about 10 minutes. Add garlic and cook, stirring, until fragrant, about 1 minute. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a Dutch oven on high heat until shimmering. Sear pork cubes on all sides. Remove pork from the Dutch oven and add white wine. Lower heat to medium-low and cook for 1 minute, scraping up all the browned bits with a wooden spoon or stiff spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return onions and pork to Dutch oven, then add tomatoes, chicken stock, bay leaf, cilantro, oregano, 1/2 teaspoon salt, and 1/2 teaspoon pepper. Stir well. Bring to a boil, cover, and transfer to the oven. Cook until pork is completely tender, about 3 hours. Alternatively, transfer mixture to a slow cooker and cook on low heat for 6 to 8 hours (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven. Set the Dutch oven on the stove over medium heat (if using slow cooker, transfer contents to Dutch oven). Stir together cornstarch and cold water in a cup until completely mixed. Pour cornstarch into stew and cook, stirring constantly, until the liquid in the stew has thickened, about 5 minutes. Stir half of parsley into stew, sprinkle with remaining parsley, and serve.</p>"}]}