{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20120114-bakethebook-marshmalloweggs.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "Bouchon Bakery", "candy", "marshmallow"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Bouchon Bakery Marshmallow Eggs", "link": "https://www.seriouseats.com/recipes/2013/01/bouchon-bakery-marshmallow-eggs-recipe.html", "description": "We know it's still January. But these pretty little lighter-than-air eggs give us something to look forward to. Namely, spring. Nothing more complex than marshmallows and decorating sugar, but they're worlds better than anything store-bought.", "totalTime": "2 nights, due to drying time", "recipeYield": "makes 8 eggs", "recipeCategory": ["Bake the Book", "Candy", "Desserts", "Easter"], "recipeIngredient": ["<strong>Vanilla Marshmallows</strong>", "4 sheets (9.6 grams) silver leaf gelatin", "1/4 cup + 2 tablespoons (87 grams) egg whites", "1/4 vanilla bean, split lengthwise", "1 cup + 2 tablespoons (225 grams) granulated sugar", "1/2 cup (112 grams) water", "2 1/2 tablespoons (50 grams) light corn syrup", "1/4 cup + 1 tablespoon (90 grams) decorating sugar (ingredients follow)", "&nbsp;", "<strong>For Raspberry Sugar</strong>", "1/2 cup + 1 1/2 tablespoons (100 grams) large-crystal sparkling sugar", "6 drops diluted citric acid (To make diluted citric acid, combine 3/8 teaspoon (2 grams) citric acid and 3/4 teaspoon (2 grams) water in a small cup and stir to dissolve the citric acid.)", "1/2 teaspoons (1 gram) dehydrated raspberry powder, or as needed", "Powdered oil-soluble red food coloring", "&nbsp;", "<strong>For Lemon Sugar</strong>", "1/2 cup + 1 1/2 tablespoons (100 grams) large-crystal sparkling sugar", "6 drops diluted citric acid", "3/4 teaspoons (1 1/2 grams) grated zest of 1/2 lemon (use a rasp grater)", "Powdered oil-soluble yellow food coloring"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Raspberry or Lemon Icing Sugar:</strong> Place the sugar in a small bowl. Stir in the citric acid, raspberry powder or lemon zest, and just the amount of food coloring that fits on the tip of a small paring knife (less than a pinch), then use your hands to work the mixture together. If you’d like, add a little additional powder and/or food coloring. Spread the sugar on a baking sheet and let it dry overnight at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Marshmallows:</strong> You’ll need a Thermapen or other candy thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the gelatin in a bowl of ice water to soften. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the gelatin from the water and squeeze out excess water. Place the gelatin in a small metal bowl set over a small pot of simmering water and melt it (do not let it simmer), then reduce the heat and keep it warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the egg whites in the bowl of a stand mixer fitted with the whisk attachment. Scrape the seeds from the vanilla bean and add the seeds to the egg whites.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the granulated sugar, water, and corn syrup in a large saucepan and bring to a simmer over medium-high heat, stirring to dissolve the sugar, then simmer for about 5 minutes, until the syrup reaches 250°F/121.1°C, according to the candy thermometer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Letting the syrup continue to cook, turn the mixer to medium speed. The goal is to have the whites at medium peaks when the syrup reaches 281° to 284°F/138° to 140°C. Should the whites reach stiff peaks before the syrup reaches the proper temperature, reduce the mixer speed to the lowest setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the syrup reaches 281° to 284°F/138° to 140°C, remove it from the heat. Turn the mixer to medium speed and slowly add the syrup to the egg whites, pouring it between the side of the bowl and the whisk. Pour in the gelatin, increase the speed to medium-high, and mix for about 5 minutes, until the mixture is thickened, glossy, and warm but not hot. Put aside, to be piped into plastic egg molds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Preparing the Eggs:</strong> You’ll need twelve two-piece plastic eggs, a clean egg carton, and a pastry bag with a ½-inch plain tip.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the plastic eggs are new, open them, wash them, and dry thoroughly. Spray the inside of both halves of each egg with nonstick spray and set them in the egg carton. Fill the pastry bag with the warm marshmallow mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Holding the tip close to the bottom of an egg half, slowly pull up as you fill the half completely; try not to leave any air pockets. Fill the other half and fit the top and bottom together—there will be some resistance, but they must be secure to form a perfectly shaped egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe off the excess marshmallow that oozes from the egg with a damp paper towel. Repeat with the remaining eggs. Stand the filled eggs in the egg carton and let them sit at room temperature overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the decorating sugar in a small bowl. Remove the eggs from the molds. Toss the eggs in the sugar and then stand them in the egg carton.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If they will be served within a few hours, let the eggs sit at room temperature. For longer storage, place the egg carton in a large covered container for up to 2 weeks.<br />\n</p>"}]}