{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130707-257187-sunday-brunch-egg-baked-on-grits.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["brunch", "egg", "grit", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Eggs Baked on Grits With Bacon and Tomatoes", "link": "https://www.seriouseats.com/recipes/2013/07/grits-eggs-bacon-tomato-recipe.html", "description": "Grits are a breakfast staple, and this simple baked egg dish takes this creamy comfort food and adds a quick sauté of tomatoes and bacon to bring some brightness to this quick and easy brunch.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Tomato", "Vegetarian"], "recipeIngredient": ["6 strips bacon", "1 medium onion, finely chopped (about 1 cup)", "2 medium tomatoes, finely chopped (about 1 cup)", "Kosher salt and freshly ground black pepper", "Pinch red pepper flakes", "1 cup quick cooking grits", "1 tablespoon butter", "4 eggs", "1 tablespoon finely sliced chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 425[&deg;]. Heat a medium skillet over medium high heat and cook bacon until fat is rendered and bacon is crisp. Remove bacon from skillet and drain on paper towels. Return pan to heat and add onion, cook until onion begins to brown, about 5 minutes. Add chopped tomato and cook until the juices from the tomato have been reduced, remove from heat and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 cups of water to a boil. Add red pepper flakes and grits. Cook, covered, stirring occasionally until grits are cooked, 3 to 5 minutes. Remove from heat and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 9- by 13-inch pyrex dish and add grits. Make a few wells in the surface of the grits and pour tomato mixture into wells. Break each egg over the a section of tomato mixture, season with salt and pepper, and place in the oven. Bake until the whites of the eggs have set but the yolks are still runny, about 14 minutes. Sprinkle with chives.</p>"}]}