{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131121-very-small-anna-goat-cheese-cheesecake.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["almond flour", "cheesecake", "cream cheese", "fig", "gluten free", "goat cheese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Goat Cheese Cheesecake With Fig Jam", "link": "https://www.seriouseats.com/recipes/2013/11/goat-cheese-cheesecake-with-fig-jam.html", "description": "Serving tiny wedges of this cheesecake is an elegant and very grown up way to end a dinner party or holiday meal.", "totalTime": "1 day", "recipeYield": "Makes 12 servings of cheesecake, 1 pint of jam", "recipeCategory": ["Cakes", "Cheese", "Gluten-Free", "Thanksgiving", "Very Small Anna"], "recipeIngredient": ["<strong>For Crust</strong>", "3/4 cup almond flour", "2 tablespoons brown sugar", "Pinch salt", "2 1/2 tablespoons unsalted butter", " ", "<strong>For Cheesecake</strong>", "4 ounces cream cheese, room temperature", "4 ounces chèvre, room temperature", "1/4 cup sugar", "1 egg", "1/3 cup heavy cream", "2 teaspoons lemon juice", "1/4 teaspoon vanilla extract", " ", "<strong>For Jam</strong>", "1 1/2 cup sugar", "1 1/2 cup water", "1 tablespoon yellow mustard seed", "8 ounces dried figs", "1/4 teaspoon lemon zest", "Pinch black pepper", "2 teaspoons apple cider vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Crust</strong>: Place rack in center of oven and preheat to 350&deg;F. In small mixing bowl, mix together all ingredients but butter. Melt butter in small saucepan on stovetop or in microwave-safe bowl. Mix butter into dry ingredients with fingertips, then press evenly in bottoms of pans. Bake for 5 minutes, then turn and bake another 2-3 minutes, until almond flour is toasted. Butter may cause crust to actively bubble while baking, do not panic, crust will settle once cool. Allow crust to cool completely before adding filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Filling</strong>: Lower oven temperature to 300&deg;F. In bowl of stand mixer fitted with paddle attachment or in medium mixing bowl with handheld electric mixer, cream together cream cheese, goat cheese and sugar. Do not turn mixer past the first two speeds as you do not want to incorporate excess air. Scrape bowl often. Once mixture is completely creamed, add egg and mix until fully incorporated, scraping bowl as needed. Add cream and mix fully, then add lemon juice and vanilla and mix until completely smooth, scraping bowl as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tear pieces of foil at least four inches longer than diameter of pans. Place pans in center of foil and gently fold foil tightly up sides, crimping closed at top. Divide batter evenly between pans, then place pans in baking vessel and fill vessel with an inch of hot water. Bake for 15 minutes, then turn and bake another 15. Check and turn every 5 minutes after that, 5-10 minutes should be sufficient. Cakes are done when jiggly but no longer liquidy. Remove vessel from oven and allow cakes to come to room temperature before removing foil and allowing to set in refrigerator overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Jam</strong>: Place sugar, water, and mustard seeds in medium saucepan over high heat and bring to boil. Lower to simmer and cook until all sugar is dissolved, stirring occasionally. Meanwhile, remove stems from figs and cut into quarters. Add figs to syrup and cook over medium-high heat until syrup is very thick and bubbles slow and turn to foam, about 30 minutes. Remove from heat and add lemon zest, pepper and vinegar, stirring to incorporate fully, then blend chunks of fig roughly with immersion blender or on low setting in regular blender. Place over ice bath or uncovered in refrigerator to chill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve</strong>: Warm a paring knife blade in hot water and wipe dry. Carefully run knife around inside edge of pans, reheating and wiping knife blade as needed. Release springform and open fully, then carefully lift straight up to remove. Use paring knife to cut each cake into six wedges, heating and wiping blade between each cut. Top each wedge of cake with a spoonful of jam and garnish with toasted flaked almonds, if desired.</p>"}]}