{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130821-skillet-suppers-eggplant-tomato-primary.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["easy", "eggplant", "feta", "one pot", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Eggplant with Spicy Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2013/08/eggplant-with-spicy-tomato-sauce.html", "description": "Tender eggplant slices slow cooked until deeply browned, served in a rich tomato sauce with feta cheese and parsley.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Eggplant", "Mains", "One-Pot Wonders", "Tomato", "Vegetarian"], "recipeIngredient": ["6 tablespoons olive oil ", "1 Italian eggplant, halved and cut into 1/2-inch half moons ", "Kosher salt and freshly ground black pepper", "2 medium cloves garlic, minced or grated with a microplane (about 2 teaspoons)", "2 tablespoon harissa", "1 (28-ounce) can whole peeled tomatoes or 8 to 10 medium tomatoes, quartered", "½ cup crumbled feta cheese", "½ cup chopped fresh parsley leaves", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of oil in a 12-inch skillet over medium heat until shimmering. Add as much eggplant as will fit in a single layer and cook, shaking the pan occasionally, until well browned on both sides, about 10 minutes total. Season to taste with salt and pepper. Repeat with the remaining eggplant and 2 more tablespoons of oil. Remove from the pan and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same skillet over medium heat, add the remaining 2 tablespoons oil and heat until shimmering. Add the garlic and cook until fragrant, about 30 seconds. Add the harissa and mix together until combined. Add the tomatoes and adjust the heat until it maintains a vigorous simmer, seasoning with salt and pepper, and breaking apart the tomatoes with a potato masher or wooden spoon once they’ve softened. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow to cook until the tomatoes have broken down, roughly 10 to 12 minutes for canned and 18 to 20 for fresh, seasoning as needed. When the sauce has thickened, add the eggplants back in and stir so that they warm up, then pour into a serving dish or serve out of the pan, top with the feta and parsley. Serve with the lemon wedges. </p>"}]}