{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130805-grill-roasted-bison-ribeye-final-7.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bison", "Bison Council", "grill"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grill-Roasted Whole Bison Boneless Rib Roast", "link": "https://www.seriouseats.com/recipes/2013/09/grill-roasted-whole-bison-boneless-prime-rib-roast.html", "description": "A whole grill-roasted boneless bison ribeye with plenty of smoky flavor and some nice char.", "totalTime": "4 hours", "recipeYield": "serves 12 to 16", "recipeCategory": ["Mains"], "recipeIngredient": ["1 whole boneless bison rib roast, about 8 pounds", "Kosher salt and freshly ground black pepper", "2 cups wood chips, soaked in water (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 3/4 of a chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, spread evenly over one side of coal grate. Alternatively, set one set of burners on a gas grill to medium-low heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Loosely wrap soaked wood chips in an aluminum foil pouch and poke a few holes in it with a wooden or metal skewer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Gas Grill:</strong> Season bison generously with salt and pepper. Place over cooler side of grill with the fat cap facing up. Place foil pouch directly over hot side of grill. Cover and cook until roast registers 125 to 130°F in the center for medium-rare or 135 to 140°F for medium, 3 to 3 1/2 hours. (Grill should maintain a temperature of 225°F to 250°F for duration of cooking. Adjust flame to maintain temperature as necessary). Transfer bison to a large plate and increase heat on all burners to maximum. Close cover and allow grill to preheat for 10 minutes. Return bison to grill and cook, turning occasionally, until all sides are well browned, about 8 minutes total. Transfer to a cutting board, allow to rest 15 minutes, carve, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Coal Grill:</strong> Season bison generously with salt and pepper. Place foil pouch directly on top of coals. Place over cooler side of grill with the fat cap facing up. Cover grill with vents over meat partially opened to draw smoke across meat, and cook until roast registers 125 to 130°F in the center for medium-rare or 135 to 140°F for medium, 3 1/2 to 4 hours, adding 5 to 6 coals to the fire every half hour (grill should maintain a temperature of 225°F to 250°F for duration of cooking). Transfer bison to a large plate and add 1 quart fresh coals to the fire. Allow grill to preheat until all the coals are strongly lit, about 15 minutes. Return bison to grill and cook, turning occasionally, until all sides are well browned, about 8 minutes total. Transfer to a cutting board, allow to rest 15 minutes, carve, and serve.</p>"}]}