{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130811-262575-tomato-margarita.jpg", "author": {"@type": "Person", "name": "Autumn Giles"}, "recipeCuisine": "", "keywords": ["cocktail", "tequila", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tomato Margarita With Fennel Salt", "link": "https://www.seriouseats.com/recipes/2013/08/fresh-tomato-margarita-fennel-salt-cocktail-recipe.html", "description": "Ripe tomatoes are delicious with slightly herbal tequila and a fennel salt rim.", "totalTime": "1 hour", "recipeYield": "makes 1 cocktail, makes enough tomato tequila for about 4 cocktails", "recipeCategory": ["Tequila", "Tomato"], "recipeIngredient": ["<strong>For the Tomato Tequila</strong>:", "16 ounces (about one large) beefsteak tomato, cut into large chunks", "1 cup tequila", " ", "<strong>For the Fennel Salt</strong>:", "2 teaspoons fennel seeds", "2 tablespoons kosher salt", " ", "<strong>For the Tomato Margarita</strong>:", "3 ounces tomato tequila", "2 teaspoons agave nectar", "2 teaspoons lime juice from 1 lime", "Lime wedges, for garnish", "Fennel salt, for rim"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tomato Tequila</strong>: Combine the tomato and tequila in a blender. Pulse a few times on medium to break up the tomato then /blend for about 5 more seconds to form a pulpy puree. Strain the puree through a very fine mesh strainer or a less fine one lined with a double layer of cheesecloth. Stir it gently a few times as it strains, but do not press. Strain until it stops dripping on its own, about 15 minutes. Store in the fridge if not using immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fennel Salt</strong>: Toast the fennel seeds in a medium skillet over medium heat until fragrant, about 2 minutes. Place toasted fennel seeds in a spice grinder or a clean coffee grinder and pulse until the seeds are about the same texture as the kosher salt, about 10 pulses. Combine the ground fennel with the kosher salt. Store in a small jar until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tomato Margarita</strong>: Moisten the rim of a cocktail glass with lime juice, rim with fennel salt, and set aside. Add ice to prepared glass. Pour tomato tequila, agave, and lime juice into a cocktail shaker and fill with ice. Shake until well chilled, about 20 seconds. Strain into prepared glass and serve immediately.</p>"}]}