{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/062813-256877-cook-the-book-favorite-buttermilk-skillet-fried-chicken-edit.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["buttermilk", "chicken", "Cook the Book", "fried chicken", "mastering the art of southern cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Favorite Buttermilk Skillet-Fried Chicken from 'Mastering the Art of Southern Cooking", "link": "https://www.seriouseats.com/recipes/2013/06/cook-the-book-buttermilk-skillet-fried-chicken-from-mastering-the-art-of-southern-cooking.html", "description": "Before last week, I had never made real fried chicken. Between the perceived mess and my worry of serving burnt-but-still-raw chicken, I knew I'd need a commanding voice to guide me through my fears and persuade me to give it a shot.\r\n\r\nThe buttermilk skillet-fried chicken recipe in <strong>Nathalie Dupree</strong> and <strong>Cynthia Graubart</strong>'s <em><a href=\"http://www.amazon.com/books/dp/1423602757/?tag=serieats-20\">Mastering the Art of Southern Cooking</a></em> offered just the direction I was looking for.", "totalTime": "2 to 3 hours", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Deep Frying", "Fried Chicken", "Mains"], "recipeIngredient": ["3 cups buttermilk or whole milk", "1/4 cup salt", "1 whole chicken (2 1/2–3 pounds), cut into 8 frying pieces ", "1–1 1/2 cups shortening", "1/2 cup butter", "Freshly ground black pepper", "Finely ground hot red pepper", "1–1 1/2 cups all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the buttermilk and salt into a nonreactive container or a plastic ziplock bag. Add the chicken pieces. Close the bag and refrigerate for 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the buttermilk brine, lightly shake, and move to a colander over a bowl or sink so that the excess buttermilk drains off yet leaves the skin moist enough for the flour to adhere. Larger chickens take longer to cook, so they should be rinsed to prevent burning. If there is not time to brine, sprinkle the damp chicken lightly with salt, then add salt, freshly ground pepper, and hot red pepper to the flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt shortening in a 9- to 10-inch heavy-bottomed or cast-iron skillet. Add the butter in increments to the melted fat, making sure that the melted mixture will go only halfway up the chicken and that the skillet is no more than half full. While the fat is heating, pepper the chicken on both sides with the two peppers. Spread flour on a rimmed baking sheet and lightly add a bit of black pepper. Pat the still damp chicken in the flour on both sides. Knock off any excess flour by lightly tapping the bone-edge of the chicken on the counter and arrange around the sides of the colander in a single layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>A bit before the fat registers 375 degrees on a deep-fat thermometer (or sizzles when the exposed end of the leg bone is inserted in the fat), flour the individual chicken pieces again, tapping the bone-edge of the chicken pieces on the counter to remove excess flour as desired. After each piece is floured, start adding the largest pieces to the hot fat, usually the dark meat, skin side down, to the hottest spot in the skillet, reserving the white meat for cooler spots, small pieces in last. It is helpful to add them in a pattern, such as clockwise, so removal is guess-free, with first pieces in/first pieces out. Try not to crowd the chicken in the skillet, as too much chicken in ratio to the fat will cool down the fat. The pieces may touch but not overlap. The rule of thumb is that the bottom of the pan should be visible in places. Keep a watch on the chicken, moving the pan as necessary over the heat so that all the pieces of the chicken are browned evenly. This is particularly important if the pan and burner are different sizes, as they usually are, and the heat is concentrated in one area.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully maintain the heat of the fat while chicken is being added to the pan, preferably with the help of a deep-fat thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Partially cover the pan with a lid for 6 minutes. The temperature of the fat should be at least 325 degrees; remove the lid and continue to cook 3 to 4 minutes more, until the pieces are deep golden brown on the bottom. Turn the browned chicken with tongs and cook uncovered to brown the second side for 8 to 10 minutes more. Listen and look for the sizzle around the chicken pieces. Smaller pieces will finish cooking before larger pieces, so remove these from the pan as needed. The internal temperature of the chicken should register 165 degrees when an instant-read thermometer is inserted into the flesh of the chicken, not touching the bone. The juices of the chicken will run clear and the sizzling sound will have greatly diminished.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the chicken on crumpled paper towels on a rack. Perfect fried chicken is divine either hot or cold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation:</strong> Add a chunk of bacon or other pork fat to the oil for more flavor, removing it if it seems to be burning.</p>"}]}