{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131004-pork-rabe-broccoli-provolone-sandwich-recipe-18.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["broccoli rabe", "pork", "provolone", "sandwich", "slider"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roast Pork and Broccoli Rabe Sandwiches", "link": "https://www.seriouseats.com/recipes/2013/10/game-day-roast-pork-broccoli-rabe-sandwich-recipe.html", "description": "These little sandwiches are time consuming, but super-simple to make, with only about 30 minutes of actual work involved. The rest is all about waiting for the slow-cooked pork to fully tenderize. It's a long wait, but it's worth it.", "totalTime": "9 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Pork", "Sandwiches"], "recipeIngredient": ["1 whole bone-in, skin-on pork shoulder, 8 to 12 pounds total", "Kosher salt and freshly ground black pepper", "1 pound broccoli rabe, tough stems trimmed", "2 tablespoons extra-virgin olive oil", "6 medium cloves garlic, thinly sliced", "4 anchovy filets, mashed", "1/2 teaspoon red pepper flakes, plus more to taste, divided", "1/4 cup cider vinegar", "36 slider-sized soft rolls, such as <a href=\"http://potatorolls.com/products/martins-rolls/\">Martin's Party-Sized Potato Rolls</a>, split in half and toasted lightly", "18 slices sharp Provolone cheese", "1 quart store-bought or <a href=\"http://www.seriouseats.com/recipes/2012/09/pickled-banana-peppers-recipe.html\">homemade</a> pickled cherry peppers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pork according to our <a href=\"http://www.seriouseats.com/recipes/2011/12/ultra-crispy-slow-roasted-pork-shoulder-recipe.html\">Ultra-Crispy Slow-Cooked Pork Recipe</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pork cooks, bring a large pot of salted water to a rolling boil. Add broccoli rabe and cook, stirring occasionally, until bright green but still crunchy, about 2 minutes. Remove broccoli rabe and run under cool water to chill. Spin in a salad spinner to dry. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large saucepan over medium heat until shimmering. Add garlic, anchovies, and red pepper flakes and cook, stirring, until fragrant, about 1 minute. Add broccoli rabe and stir to coat with oil. Continue cooking until broccoli rabe is fully tender, about 2 minutes. Transfer to a large bowl and set aside or refrigerate until ready to construct sandwiches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When pork is cooked, remove skin (if present) and chop into fine pieces. Shred meat from bones and discard bones. Combine meat and skin in a large bowl, add vinegar, and season with salt, pepper, and red pepper flakes to taste, gently shredding meat with your fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Preheat broiler to high. Place a dozen toasted bun bottoms on a rimmed baking sheet. Top with pulled pork, broccoli rabe, and a slice of cheese. Broil until cheese is melted, about 1 1/2 minutes. Top with pickled pepper slices and top buns and serve immediately. Repeat with remaining buns and fillings.</p>"}]}