{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/031313-243846-cook-the-book-irish-stew.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "irish stew", "lamb", "potatoes", "rachel allen", "rachel's irish family food", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rachel Allen's Irish Stew", "link": "https://www.seriouseats.com/recipes/2013/03/rachel-allens-irish-stew.html", "description": "As <strong><a href=\"http://www.rachelallen.co.uk/biog.html\">Rachel Allen</a></strong> explains in her new book, <em><a href=\"http://www.amazon.com/Rachels-Irish-Family-Food-classic/dp/0007462581/?tag=serieats-20\">Rachel's Irish Family Food</a></em>, there is no definitive recipe for Irish stew. The meat and vegetable stew is often a household specialty with its own family tricks and tweaks. Allen's take is a no-frills version with a short ingredient list. Her technique, however, builds a good amount of flavor and body with so few components: She picks bone-in lamb shoulder chops for the bulk of the stew, which contributes extra body to the broth and keeps the lamb succulent. In addition to browning the chops, Allen also browns the vegetables to build extra fond and give the usually wan roots more color. The stew is finished with a generous sprinkling of both chives and parsley to give a final burst of freshness.", "totalTime": "2 to 2 1/2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Cook the Book", "Lamb", "Mains", "Potato", "Soups and Stews"], "recipeIngredient": ["3 1/3 pounds (1.5kg) mutton or lamb chops from the neck or shoulder, still on the bone, cut about 3/4 inch (1.5cm) thick ", "3 tablespoons extra virgin olive oil ", "3 carrots, cut into thick slices at an angle, or 12 small baby carrots, scrubbed and left whole", "12 baby onions, or 3 to 4 medium onions, cut into quarters through the root, which should keep the wedges intact ", "Salt and freshly ground black pepper", "1 2/3 cups (400ml) lamb stock, chicken stock, or water ", "8 to 12 potatoes, peeled, and halved if very large", "Sprig of thyme", "1 tablespoon chopped fresh parsley", "1 tablespoon snipped fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F (160°C). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the chops in half, but keep the bones intact as they will give great flavor. Heat the olive oil in a medium to large Dutch oven or flameproof casserole. Toss in the meat and cook for a minute on both sides, until nice and brown. Remove the meat and set aside. Add the carrots and onions to the hot oil and cook for a couple of minutes, seasoning with salt and pepper. Return the meat to the pot. Add the stock and bring to a boil. Put the potatoes in, season again with salt and pepper, and place a sprig of thyme on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and bake in the oven for 1 1/2 to 2 hours, until the meat is very tender. When it is cooked, pour off the cooking liquid and allow it to sit for a minute until the fat floats to the top; adding a cube of ice will help speed this up. Spoon off the fat and pour the juices back over the stew. Add the chopped herbs and serve. </p>"}]}