{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/053113-253570-cook-the-book-baby-beet-tarte-tatin.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["beets", "Cook the Book", "hugh fearnley-whittingstall", "puff pastry", "river cottage veg", "tarte tatin", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baby Beet Tarte Tatin from 'River Cottage Veg'", "link": "https://www.seriouseats.com/recipes/2013/05/baby-beet-tarte-tatin-from-river-cottage-veg-recipe.html", "description": "This savory tarte tatin is the first recipe I bookmarked when I got my copy of <em><a href=\"http://www.amazon.com/River-Cottage-Veg-Inspired-Vegetable/dp/1607744724/?tag=serieats-20\" target=\"_blank\">River Cottage Veg</a></em> and the dish I most anticipated cooking and eating. <strong><a href=\"http://www.rivercottage.net/about/team/meet-hugh/\" target=\"_blank\">Hugh Fearnley-Whittingstall's</a></strong> take on the French dessert is the perfect example of the wonders of vegetable cookery. Beets&mdash;the candy of the vegetable world&mdash;are excellent in the role of apples in this tart. Paired with buttery puff pastry and pungent shallot-parsley vinaigrette, they are sweet and savory all at once. Each bite is a treat.", "totalTime": "2 hours", "recipeYield": "", "recipeCategory": ["Cook the Book", "Mains", "Vegetarian"], "recipeIngredient": ["<strong>For the rough puff pastry:</strong>", "2 1/3 cups (300g) all-purpose flour", "A pinch of sea salt", "1/2 cup plus 2 1/2 tablespoons (150g) chilled unsalted butter, cut into small cubes", "Ice water", " ", "<strong>For the tarte:</strong>", "8 ounces (250g) rough puff pastry (see above) or all-butter puff pastry (ready-made)", "A knob of butter", "1 tablespoon canola \u2028or olive oil", "2 teaspoons cider vinegar", "2 teaspoons brown sugar", "Sea salt and freshly ground black pepper", "10 to 14 ounces (300 to 400g) baby beets (the size of a golf ball or no bigger than a small apple), scrubbed and halved", " ", "<strong>For the vinaigrette:</strong>", "1 or 2 shallots or 3 or 4 green onions, trimmed and very finely chopped", "1 teaspoon English mustard", "1 tablespoon cider vinegar", "1/4 cup (60ml) canola oil", "A pinch of sugar", "A handful of parsley leaves, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pastry:</strong> Mix the flour with the salt, then add the cubed butter and toss until the pieces are coated in the flour. Stir in just enough ice water (about 2/3 cup or 150 ml) to bring the mixture together into a fairly firm dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a well-floured surface, shape the dough into a rectangle with your hands and then roll it out in one direction, away from you, so you end up with a rectangle about 1/2 inch (1 cm) thick. Fold the far third towards you, then fold the nearest third over that (rather like folding a business letter), so that you now have a rectangle made up of 3 equal layers. Give the pastry a quarter turn, then repeat the rolling, folding, and turning process 5 more times. Wrap the pastry in plastic wrap and rest in the fridge for about 30 minutes or up to an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the tarte:</strong> Preheat the oven to 375°F / 190°C. Roll out the pastry on a lightly floured surface to a thickness of about 1/4 inch / 5mm. Take an ovenproof frying pan (or a tarte tatin dish) roughly 8 inches / 20cm \u2028in diameter, place it upside down on the pastry, and cut around it. Wrap the pastry disk and place it in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter with the oil in the frying pan (or tarte tatin dish). Add the cider vinegar, sugar, and some salt and pepper, stir well, then \u2028add the halved beets and toss to coat. You want the beets to fill the pan snugly, so add a few more if you need to. Cover the pan with foil, transfer to the oven, and roast for 30 to 40 minutes, until the beets are tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the pan from the oven and rearrange the beet halves neatly, placing them cut side up. Lay the pastry disk over the beets, patting it down and tucking in the edges down the side of the pan. Return to the oven and bake for 20 minutes, until the pastry is fully puffed up and golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Leave the tarte to cool in its pan for about 15 minutes, then turn it out by putting a plate over the top and inverting it. Pour any juices left in the pan back over the beets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the ingredients for the vinaigrette into a screw-topped jar, season well with salt and pepper, and shake to combine. Trickle over the tarte tatin and serve.</p>"}]}