{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130828-bakethebook-creambo.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Balaboosta", "chocolate", "cookie", "marshmallow"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cream-Bo (Chocolate-covered Cream-topped Cookie)", "link": "https://www.seriouseats.com/recipes/2013/09/cream-bo-chocolate-covered-cream-cookie-balaboosta.html", "description": "A cream-bo is a chocolate-covered cream-topped cookie, based on an Israeli treat with a similar name. Those of us born and raised in the US might be reminded of Mallomars. In either case, they're infinitely better homemade.", "totalTime": "overnight, for setting/cooling", "recipeYield": "makes about 16 pieces", "recipeCategory": ["Bake the Book", "Chocolate", "Cookies"], "recipeIngredient": ["<strong>Homemade Cookies</strong>", "2 cups graham cracker crumbs (about 10 cookies)", "8 tablespoons (1 stick) cold unsalted butter, cut into small cubes", "1/4 cup finely chopped pecans", " ", "<strong>Cream Filling</strong>", "1 cup sugar", "1⁄3 cup water", "1⁄2 teaspoon fresh lemon juice", "4 egg whites", "Pinch of cream of tartar", " ", "<strong>Ganache</strong>", "11 ounces 72% cacao chocolate", "3 tablespoons canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cookies:</strong> Preheat the oven to 350°F.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the graham crackers, butter, and pecans in a food processor. Pulse until the ingredients are well combined and the texture is like grainy sand.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper and form 2-inch disks directly on the sheet. I usually grab the cookie cutter and pack in a little bit of the graham cracker mixture inside, then pat it down. This gives my cookies a nice uniform shape, but if you don’t have anything on hand, there are no strict rules against making them freehand. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in the oven until the cookies are crisp, about 20 minutes. Place them on a rack and cool completely before handling. Reserve the baking sheet and parchment paper to use for assembling the cream-bo.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cream Filling: </strong> Place the sugar, water, and lemon juice in a small saucepan and dissolve completely over low heat. Simmer just until a candy thermometer reads 235°F; alternatively, to check whether the sugar is ready, old-school style, simply scoop a teeny tiny amount of syrup onto a spoon and drop it into an ice bath. If the syrup congeals, it’s ready.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the sugar is heating, whip the egg whites with an electric mixer until foamy. Add the cream of tartar and keep whipping over medium speed. Once the syrup is ready, carefully and slowly drizzle the syrup into the mixing bowl with the egg whites while the mixer is running. Keep whipping the whites until the mixing bowl is cool to the touch and the mixture is stiff and glossy, 5 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the cream filling into a pastry bag fitted with a 1/2-inch round tip. Place the cookies back on the baking sheet lined with the parchment paper. Carefully pipe a 3-inch mound of cream filling onto each cookie, covering the entire surface area and finishing it off with a peak at the top. Place the almost-finished cream-bo in the freezer overnight or for at least 5 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the cream-bo is finished hanging out in the freezer, you can start on the ganache. Bring a medium pot of water to a simmer. Combine the chocolate and oil in a large bowl, then place it over the simmering water. Melt the chocolate and stir occasionally with a rubber spatula until thoroughly combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next step is a bit messy because it requires you to cover each cookie entirely in chocolate. Delicious but messy. The simplest way is to place a rack on top of the baking sheet lined with parchment paper and then place the cream-bo right on top of that rack. When you pour the ganache over the cream-bo, the ganache will drip past the cooling rack and onto the parchment paper. The ganache should harden almost on contact with the frozen cream-bo, creating a nice chocolate shell. Use a spatula to lift the cookies from the cooling rack and onto a serving platter. Crumple up the parchment paper for an easy cleanup so you can have more time to enjoy these gooey treats.</p>"}]}