{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/238199-20130203-sunday-brunch-smoked-salmon-cod-cakes-edit.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cod", "salmon", "Sunday Brunch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoked Salmon and Cod Cakes", "link": "https://www.seriouseats.com/recipes/2013/02/smoked-salmon-and-cod-cakes.html", "description": "These cakes take the brunch staple of smoked salmon and turns it into a filling dish best served on lemony greens.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Salmon"], "recipeIngredient": ["1 medium russet potato (about 6 ounces)", "8 ounces hot smoked salmon, skin removed if necessary", "8 ounces fresh cod filet", "2 bay leaves", "2 sprigs thyme", "2 tablespoons chopped chives", "2 tablespoons mayonnaise", "3 egg yolks", "Kosher salt and cracked black pepper", "1, egg beaten", "1 cup panko bread crumbs", "1/4 cup vegetable oil", "1 lemon, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pierce potato with a fork all over, then place in a microwave and cook for 2 minutes. Flip potato over and cook for an additional 2 minutes. Continue this process until the potato is soft (with most russet potatoes this takes between 6 and 8 minutes.) Remove from oven and let sit until cool enough to handle, then gently peel away skin with a knife. Place potato in a separate bowl and mash with a fork until soft and fluffy. Flake the smoked salmon into bite sized pieces and place in the bowl with the potato. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put cod, bay leaves, and thyme in a medium skillet and cover with water. Bring water to a gentle simmer then turn off the heat and let the fish stand for 10 minutes. After 10 minutes, gently remove cod and place in the bowl with the salmon and potato. Discard water and herbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hands gently toss potato and fish trying to break the fish up as little as possible, but achieving a fairly homogenous mixture. Add the chives and the mayonnaise, then season to taste with salt and pepper. Add the egg yolks. Fold just until mixture holds together, then form mixture into 8 evenly sized cakes. Put cakes on a plate and cover with plastic wrap. Refrigerate for at least 1 hour and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cakes have chilled, place beaten egg in one bowl, and breadcrumbs in another. Working one at a time, dip cake in egg, turning to coat, then in bread crumbs, turning to coat. Transfer to a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 to 3 tablespoons vegetable oil In a large non-stick or cast iron skillet over medium high heat until shimmering. Add 4 cakes to the skillet and cook, swirling pan occasionally, until golden brown, about 3 minutes. Flip cake and continue cooking until second side is golden, about 3 minutes longer. Transfer to a paper towel-lined plate and season with salt. Keep warm while you cook remaining cakes, using additional oil as necessary. Serve immediately with lemon wedges.</p>"}]}