{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130703-258158-dinner-tonight-flank-steak-shiitake-pumpkin-seed-pesto-2-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Dinner Tonight", "flank steak", "mushrooms", "one pot", "pesto", "skillet"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan-Seared Flank Steak with Shiitake Mushrooms and Pumpkin Seed Sauce", "link": "https://www.seriouseats.com/recipes/2013/07/pan-seared-flank-steak-shiitake-mushroom-pumpkin-seed-sauce-recipe.html", "description": "Whenever I'm looking for a side dish to pair with steak, my mind tends to gravitate toward mushrooms, since the two are such a fantastic pair. The only problem is a visual one: both are brown, making for a monochromatic dish. Steakhouses solve this problem by adding a completely unnecessary sprig of parsley; I decided to go all in and add as much green as possible, in the form of a lime-heavy pumpkin seed pesto.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Dinner Tonight", "Mains", "Mushrooms", "Pesto", "Pumpkin", "Stovetop"], "recipeIngredient": ["1/2 cup pumpkin seeds ", "3/4 cup fresh cilantro leaves", "1 medium garlic clove, chopped (about 1 teaspoon)", "1/2 cup olive oil ", "3 to 4 tablespoons fresh juice from 3 to 4 limes ", "Kosher salt and freshly ground black pepper", "1 pound flank steak ", "2 tablespoons canola oil ", "8 ounces shiitake mushrooms, wiped clean, ends trimmed "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large 12-inch cast-iron skillet over medium heat. Add pumpkin seeds and toast, stirring often with a wooden spoon, until lightly browned, but not burnt. Transfer pumpkin seeds to a blender, turn off the heat, and wipe out the skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cilantro, garlic, and olive oil to the blender and process until pumpkin seeds are well chopped. Transfer to a medium bowl and add 3 tablespoons of lime juice and season to taste with salt and pepper. Taste, and add another tablespoon of lime juice if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season flank steak with a generous pinch of salt and pepper on both sides. Heat canola oil in the cast-iron skillet over medium-high heat until shimmering. Carefully set steak in the skillet and cook, flipping every 2 minutes, until browned on the outside and center registers 130&deg;F on an instant-read thermometer for medium-rare, about 8 minutes total. Transfer steak to a large plate and let rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once skillet has cooled slightly, remove all but 1 tablespoon of fat in the skillet, and turn heat to medium. Add the mushrooms and stir well. Cook, stirring often and scraping up any browned bits, until mushrooms have released their water and are tender, about 8 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice flank steak thinly against the grain. Spoon some of the pesto onto a plate and top with the slices of steak. Serve immediately with mushrooms.</p>"}]}