{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130517-tater-tot-nachos-totchos.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["nachos", "snacks", "tater tots", "totchos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Totchos (Tater Tot Nachos) With Cheese Sauce, Charred-Tomato Salsa, Chorizo, and Pickled Jalapeños", "link": "https://www.seriouseats.com/recipes/2013/08/totchos-tater-tots-nachos-cheese-sauce-tomato-salsa-chorizo-pickled-jalapenos.html", "description": "The ultimate nachos made with Tater Tots in place of corn chips, topped with gooey cheese sauce, charred-tomato salsa, crisp chorizo, and fresh vegetables.", "totalTime": "1 hour", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Sides", "Snacks"], "recipeIngredient": ["6 medium tomatoes, divided", "Kosher salt and freshly ground black pepper", "4 cloves garlic", "1 small white or yellow onion, peeled and split", "1 jalapeño pepper, split in half", "2 cups fresh cilantro leaves and fine stems, divided", "1 tablespoon juice from 1 lime", "4 ounces Spanish or Mexican chorizo, finely diced", "2 quarts peanut oil", "1 (28 ounce) package Tater Tots or mini Tater Tots", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2010/09/cheese-sauce-for-cheese-fries-and-nachos.html\">Gooey Cheese Sauce</a>", "1 small red onion, finely diced", "4 scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high. Finely dice 1 tomato and toss with a pinch of salt and pepper. Place in a fine mesh strainer set over to a bowl to drain. Set aside while you prepare the salsa.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split remaining tomatoes in half and place on a foil-lined broiler pan or rimmed baking sheet. Add garlic, onion, and jalapeño. Broil until completely tender and well blackened on top side, about 25 minutes. Transfer all vegetables to a blender or food processor and add 1 1/2 cups of fresh cilantro and lime juice. Blend until smooth. Season to taste with salt and pepper and allow to cool. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chorizo in a small skillet and place over medium heat. Cook, stirring occasionally, until browned and crisp, about 4 minutes. Transfer to a paper towel-lined plate to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat peanut oil in a deep fryer, wok, or Dutch oven and cook Tater Tots according to package directions, working in batches and keeping them warm in a 200°F oven if necessary. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place half of Tater Tots on a large serving platter and top with half of salsa, cheese sauce, chorizo, drained tomatoes, red onions, scallions, and remaining cilantro. Top with remaining tots and remaining toppings. Serve immediately</p>"}]}