{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/30120619-255680-british-bites-rarebit-bacon-roast-tomatoes.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["cheese sauce", "mornay", "quick", "rarebit", "sandwich", "toast", "tomato", "welsh rarebit"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Welsh Rarebit and Bacon-Roasted Tomatoes on Cheddar Beer Bread", "link": "https://www.seriouseats.com/recipes/2013/06/welsh-rarebit-bacon-cheddar-bread-bacon-roasted-tomato-recipe.html", "description": "A few softly blistered cherry tomatoes roasted with bacon and thyme make the ideal accompaniment to this savory rarebit. If you're looking for a more filling meal, try topping the rarebit with a runny fried egg, and, as always, serve this light lunch with a cold pint of whatever beer you use to make the dish.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "British Bites", "Cheese", "Mains", "Sandwiches", "Tomato"], "recipeIngredient": ["2 pints cherry tomatoes", "5 strips bacon, chopped", "3 teaspoons picked fresh thyme leaves, divided", "Kosher salt and freshly ground black pepper", "1 cup beer", "1 medium garlic clove, finely chopped (about 1 teaspoon)", "Pinch red pepper flakes", "1 teaspoon whole grain mustard", "8 ounces shredded cheddar cheese (about 3 cups)", "3 tablespoons all-purpose flour", "1 teaspoon Worcestershire sauce", "4 slices <a href=\"http://www.seriouseats.com/recipes/2013/06/bacon-onion-cheddar-beer-bread-recipe.html\">Bacon Cheddar Onion Beer Bread</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bacon Roasted Tomatoes</strong>: Adjust the oven rack to middle position and preheat to 425[&deg;]. In a roasting pan, combine tomatoes, bacon, and 2 teaspoons thyme. Season with salt and pepper. Place in the oven and roast until bacon has begun to crisp and the skins on the tomatoes have begun to blister and burst, about 20 minutes. Remove from the oven and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Rarebit</strong>: Heat beer, garlic, remaining teaspoon thyme, red pepper flakes, and mustard in a medium sauce pan over medium high heat until simmering. Toss cheddar cheese and flour together then add to the pan. Cook, stirring constantly, until the cheese is melted. Remove from heat and add Worcestershire sauce. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high. Place bread on a broiler pan and broil until the edges have begun to brown, about 2 minutes then remove from oven. Carefully flip each piece of bread over then coat each piece of bread with the cheese mixture. Place back under the broiler until cheese is bubbly and brown, about 4 minutes. Remove from oven and serve immediately with roasted tomatoes.</p>"}]}