{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130718--preserved-raspberry-rose-jam-1.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["Jam"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Raspberry Rose Jam", "link": "https://www.seriouseats.com/recipes/2013/07/raspberry-rose-jam-recipe.html", "description": "Raspberry and rose are a natural combination, and not just in grandma's yard. Dried petals from rose tea soften in the juice of red raspberries. The result is this jewel-toned jam, a balance of sweet, tart, and floral flavors perfectly suited to your next batch of scones or shortbread for afternoon tea.", "totalTime": "1 1/2 hours", "recipeYield": "makes four and a half (1/2 pint) jars", "recipeCategory": ["Breakfast and Brunch", "Condiments and Sauces", "Fruit Desserts", "Preserved"], "recipeIngredient": ["1/4 cup Chinese rose tea", "3 cups granulated sugar", "2 pints of raspberries (about 4 cups, 1 ½ pounds), gently washed", "2 tablespoons juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small glass plate in the freezer. Prepare boiling water canner and sterilize 5 half-pint jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids and rings to sit in hot water until you need them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pinch the petals from the buds of the Chinese rose tea. Collect the petals and leave behind the green leaves and the fibrous center of each flower. You'll need about 5 tablespoons of petals, total. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a non-reactive saucepan, stir together the sugar, berries, lemon juice, and rose petals and allow to macerate until the petals have absorbed some liquid and no longer feel dry. About 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the mixture to a boil over medium-high heat. Continue to cook until it registers 220&deg;F on a candy or instant read thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the jam has reached 220&deg;F, turn the heat down to low and test the set by placing a teaspoon of jam on the chilled plate from the freezer. If, as the jam cools it forms a surface skin and develops a degree of solidity, proceed. If it still seems quite runny, turn heat back up to medium-high and cook for a few more moments to allow more moisture to evaporate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When jam has reached desired consistency, turn off heat and skim any foam with a spoon. Ladle jam into prepared jars, leaving a quarter inch of head space. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary, and, over high heat, bring the water back up to a boil. Once the water boils, set a timer for ten minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After ten minutes, turn off heat, and allow jars to sit in water for five additional minutes. Then, using a jar lifter, remove the jars to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once jars have reached room temperature, remove rings and test that all lids have sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight. </p>"}]}