{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130828-bakethebook-blackberrymint.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["blackberry", "cake", "layer cake", "mint"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Blackberry Mint Cake", "link": "https://www.seriouseats.com/recipes/2013/09/blackberry-mint-cake.html", "description": "Piles of blackberries rest on cool clouds of mint whipped cream. <em><strong><a href=\"http://www.amazon.com/Say-It-With-Cake-Celebrate/dp/190686893X/?tag=serieats-20\" target=\"_blank\">Say It With Cake</a></strong></em> makes a refreshing fruit-filled cake suitable for summer's end.", "totalTime": "2 hours", "recipeYield": "serves 12", "recipeCategory": ["Bake the Book", "Cakes", "Fruit Desserts"], "recipeIngredient": ["1 cup unsalted butter at room temperature, plus extra for greasing", "1 3/4 cups self-rising flour", "2 tsp baking powder", "1 cup plus 2 tbsp superfine sugar", "4 large eggs, lightly beaten", "1–2 tablespoon milk, if needed", "3 tablespoon blackberry or blackcurrant liqueur (optional)", "1 1/4 cups blackberries", " ", "<strong>Mint Frosting</strong>", "3/4 cup unsalted butter at room temperature", "1/3 cup heavy cream", "3 1/3 cups confectioners' sugar", "a pinch of salt", "1/4–1/2 teaspoon peppermint extract", "green food coloring (optional)", " ", "<strong>Decoration</strong>", "3 1/2oz dark chocolate (about 70% cocoa solids), finely chopped", "leaves from 1 bunch of mint", "1/4 cup blackberry jam", "1 1/4 cups blackberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Lightly grease and line two 8in cake pans with parchment paper, greasing the parchment too. In a medium bowl whisk the flour and baking powder together, then set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the butter and sugar in a large bowl and, using an electric mixer, beat together until light and fluffy, about 5 minutes. Add the eggs, a little at a time, beating until fully combined. With the mixer on low, sift in the flour mixture in three additions, mixing until just combined.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The cake batter should be a “dropping consistency,” which means that if you take a spoonful of batter out of the bowl it should be soft enough to fall easily from the spoon. If the batter is sticking to the spoon for too long, mix in 1–2 tablespoons milk to soften the batter. Add the liqueur and blackberries and gently mix into the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the cake batter evenly between the two prepared cake pans and gently level out. Bake for 25–30 minutes or until golden brown and coming away from the edge of the pan; a toothpick inserted into the center of a cake should come out clean. Let cool in the pan for 10 minutes before turning onto a wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cakes are cooling, make the frosting. Put the butter in a large bowl and, using an electric mixer, beat until light and creamy, about 3 minutes. Slowly incorporate the cream and beat until fully combined. Add the confectioners' sugar, a little at a time, and once fully combined add the salt. Beat on high speed until the frosting is light and fluffy. Add the peppermint extract and coloring, if using, and beat to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the decoration, melt the chocolate in a heatproof bowl set over a pan of gently simmering water, making sure the bottom of the bowl doesn’t touch the water. Put the mint leaves on a parchment-lined baking sheet. Using a pastry brush, paint one side of each leaf with the melted chocolate. Put the tray in the fridge until the chocolate is set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the cake, put one of the cake layers on a cardboard cake round or a serving plate. Top with half the frosting and spread evenly across the cake. Top with a thin layer of blackberry jam and then put the second cake layer on top. Spread the remaining buttercream over the top of the cake and sprinkle with the blackberries. Remove the mint leaves from the fridge and carefully peel off the leaves, leaving you with chocolate mint leaves. Put these randomly over the top of the cake.</p>"}]}