{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130820-glazed-doughnuts.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["caramel", "Glazed Filled Sugared &amp; Dipped", "passionfruit", "whiskey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Whiskey Glazed Cake Doughnuts with Passionfruit Caramel", "link": "https://www.seriouseats.com/recipes/2013/08/whiskey-glazed-cake-doughnuts-with-passionfru.html", "description": "We're going to defer to <em><strong><a href=\"http://www.amazon.com/?tag=serieats-20\" target=\"_blank\">Glazed, Filled, Sugared, &amp; Dipped</a></strong></em> author Chef Collucci to describe this one: \"First you taste the warmth of the whiskey, followed by the tropical tartness of the passionfruit, and finally the smoothness of the caramel and earthy cocoa on the finish.\" Precisely.", "totalTime": "2 hours", "recipeYield": "makes about 1 dozen 3-inch doughnuts", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Doughnuts", "Pastry"], "recipeIngredient": ["<strong>Cake Doughnuts</strong>", "3 cups cake flour (all-purpose flour can be substituted)", "3/4 cup sugar", "1/2 teaspoon baking soda", "1 teaspoon baking powder", "1 1/2 teaspoons salt", "Zest of 1/2 lemon", "1 large egg", "1/2 cup buttermilk", "4 tablespoons (1/2 stick) unsalted butter, melted and cooled", "2 large egg yolks", "1/2 teaspoon vanilla extract", "Vegetable oil, for frying", " ", "<strong>Whiskey Glaze</strong>", "1 cup confectioners’ sugar", "2 tablespoons unsweetened cocoa powder", "1 tablespoon plus 1 teaspoon whiskey", " ", "<strong>Passionfruit Caramel</strong>", "1/4 cup heavy cream", "1/4 cup fresh passionfruit juice (from 3 to 4 ripe passionfruits), or frozen puree or store-bought juice", "3/4 teaspoon vanilla extract", "3/4 teaspoon salt", "1 cup sugar", "2 tablespoons light corn syrup", "4 tablespoons (1/2 stick) unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the glaze:</strong> In a small bowl, mix the sugar, cocoa, and whiskey with 2 tablespoons water and whisk until smooth. Use at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the caramel:</strong> In a medium bowl, whisk together the cream, passionfruit juice, vanilla, and salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine the sugar, corn syrup, and about 2 teaspoons water (just enough to give the mixture the consistency of wet sand). Put the saucepan over medium-high heat and bring the mixture to a boil. Cook until the sugar turns a medium amber color, another 3 to 5 minutes. Lower the heat to medium and carefully pour in the passionfruit mixture. The caramel will sputter and seize up, but then gradually dissolve as the temperature rises. Continue to stir it with a wooden spoon until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the heat, add the butter, and stir until it’s melted and blended. Strain the caramel through a fine-mesh sieve. Use immediately, or store in the refrigerator for up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Doughnuts:</strong> In the bowl of a stand mixer fitted with the paddle attachment, mix the flour, sugar, baking soda, baking powder, salt, and lemon zest. Add the egg and mix for a few seconds. Add the buttermilk, butter, egg yolks, and vanilla, and mix until just barely combined into a stiffish dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the dough onto a sheet of parchment paper and put another sheet of parchment paper on top. Using a rolling pin, flatten and roll the dough until it’s 3/8 to 1/2 inch thick. Refrigerate the dough for 30 minutes to 1 hour, until it no longer clings when you try to peel off the parchment paper.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat at least 2 inches of oil in a heavy-bottomed pot fitted with a deep-fry thermometer until the oil reaches 350°F. Prepare two baking sheets: one lined with paper towels, and the other dusted with flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel off the top sheet of parchment paper and flip the dough onto a floured work surface. Remove the second sheet of parchment paper and dust the dough with flour. Using a floured biscuit or doughnut cutter, cut the dough into 2½  - to 3-inch tubular rounds and put them on the flour-dusted baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the doughnuts in batches, taking care not to crowd the pot, until golden brown all over, 1 to 2 minutes per side. Drain on the paper-towel-lined baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip the doughnuts one at a time in the glaze, submerging just one side, and put them on a wire rack to set.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once dry, serve them immediately alongside a dish of warm passionfruit caramel for dipping.</p>"}]}