{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/061713-255999-cook-the-book-flour-too-cover.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "flour too", "focaccia bread", "joanne chang"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Flour Focaccia from 'Flour, Too'", "link": "https://www.seriouseats.com/recipes/2013/06/joanne-changs-flour-focaccia.html", "description": "Use <strong><a href=\"http://flourbakery.com/team/joanne-chang\">Joanne Chang's</a></strong> focaccia bread in the <a href=\"http://www.seriouseats.com/recipes/2013/06/joanne-changs-roast-lamb-sandwich-with-tomato.html\">lamb sandwich recipe</a> out of her new cookbook, <em><a href=\"http://www.amazon.com/Flour-Too-Indispensable-Recipes-Savories/dp/1452106142/?tag=serieats-20\">Flour, Too</a></em>. Extra slices should, of couse, be used for snacking at all hours of the day.", "totalTime": "4-5 hours", "recipeYield": "makes 1 large sandwich loaf", "recipeCategory": ["Cook the Book", "Sandwiches", "Yeast Bread"], "recipeIngredient": ["1 teaspoon active dry yeast, or 0.2 ounces (5 grams) fresh cake yeast", "3 cups (420 grams) all-purpose flour", "1 cup (150 grams) bread flour", "5 teaspoons granulated sugar", "2 teaspoons kosher salt", "1/2 cup (120 ml) olive oil", "Small handful of cornmeal for sprinkling on the baking sheet"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of the stand mixer, combine 1 1/2 cups (360 ml) tepid water and the yeast and let sit for 20 to 30 seconds to allow the yeast to dissolve and activate. Dump the all-purpose flour, bread flour, sugar, and salt into the water. Carefully turn the mixer on to low speed and mix for about 10 seconds. (To prevent the flour from flying out of the bowl, turn the mixer on and off several times until the flour is mixed into the liquid, and then keep it on low speed.) When the dough is still shaggy looking, drizzle in the olive oil, aiming it along the side of the bowl to keep it from splashing and making a mess.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer still on low speed, knead the dough for 4 to 5 minutes, or until it is smooth and supple. The dough should be somewhat sticky but still smooth and have an elastic, stretchy texture. (If it is much stiffer than this, mix 1 to 2 tablespoons water; if it is much looser than this, mix in 2 to 3 tablespoons all-purpose flour.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a large bowl. Transfer the dough to the oiled bowl, cover with an oiled piece of plastic wrap or a damp lint-free cloth, and place in a draft-free, warm (78° to 82°F (25° to 27°C) is ideal) area for 2 to 3 hours. An area near the stove or in the oven with only the oven light on is good. The dough should rise until it is about double in bulk. (This is called proofing the dough.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the dough has risen, flour your hands and the work surface and turn the dough out onto the work surface. Press the dough into an 8-inch (20-cm) square and fold the top edge of the square down to the center of the dough. Fold the bottom of the square up to the center of the dough and press the seam firmly with your fingers. Now fold the right side of the square into the center and the left side into the center, and again press the seam firmly. Turn the dough over, seam-side down, and shape the dough with a tucking motion so that it is about 6 inches (15 cm) square. Transfer the dough to the prepared baking sheet, generously flour the top of the dough, and then cover the dough loosely but completely with a damp lint-free cloth or a piece of plastic wrap. Place in a warm area (78° to 82°F (25° to 27°C)) for another hour or so, or until the dough rises a bit and gets puffy and pillowy. (This is proofing, again.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F (200°C), and place a rack in the center of the oven. Sprinkle the baking sheet with the cornmeal and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough is ready, remove the cloth or plastic wrap. Using all ten fingers, press and poke and elongate the dough three or four times along its length so that you press and stretch it into an almost-square log that is about 10 inches (25 cm) long, 8 inches (20 cm) wide, and about 2 inches (5 cm) tall. Bake for 35 to 45 minutes, or until completely golden brown on the top and bottom. Lift the loaf and make sure the underside is browned before pulling it out of the oven, or you will end up with a soggy loaf. Let cool on the pan on a wire rack for about 30 minutes, or until cool enough to handle, then cut into slices 3/4 inch (2 cm) thick for sandwiches. The focaccia loaf will keep in a closed paper bag at room temperature for up to 3 days, or tightly wrapped in two layers of plastic wrap in the freezer for up to 2 weeks. If using day-old bread kept at room temperature, I suggest toasting it in a toaster to refresh it. If using bread that has been previously frozen, thaw it at room temperature for 3 to 4 hours and then refresh it in a 300°F (150°C) oven for about 5 minutes.</p>"}]}