{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/090513-264848-cook-the-book-smashed-green-beans-and-potatoes-with-pancetta.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "Domenica Marchetti", "green bean", "pancetta", "potato", "side", "the glorious vegetables of italy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smashed Green Beans and Potatoes with Pancetta from 'The Glorious Vegetables of Italy'", "link": "https://www.seriouseats.com/recipes/2013/09/smashed-green-beans-and-potatoes-with-pancetta-the-glorious-vegetables-of-italy.html", "description": "Dumping green beans in a pot with potatoes and boiling them for 25 minutes, as <strong><a href=\"http://www.domenicacooks.com/about/\">Domenica Marchetti</a></strong> instructs in <em><a href=\"http://www.amazon.com/Glorious-Vegetables-Italy-Domenica-Marchetti/dp/1452108862/?tag=serieats-20\" target=\"_blank\">The Glorious Vegetables of Italy</a></em>, sounded like a pretty crazy idea. But I tried it anyway. Once the beans and potatoes were totally tender, I drained them and smashed them up, slowly drizzling in olive oil along the way. Towards the end, I added a pan-ful of crispy pancetta. Somewhere between the first smash and the last, the mushy beans and potatoes transformed into a soft green bowl of creamy comfort food.", "totalTime": "45 minutes", "recipeYield": "serves 6", "recipeCategory": ["Cook the Book", "Gluten-Free", "Legumes", "Potato", "Sides"], "recipeIngredient": ["1 pound (455 g) medium-size yellow potatoes, such as Yukon Gold, peeled and cut in half crosswise", "1 pound (455 g) fresh young green beans, ends trimmed", "4 ounces (115 g) pancetta, diced", "1/3 cup (75 ml) good-quality extra-virgin olive oil, plus more for drizzling", "Fine sea salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes and green beans in a large pot and fill with cold water to cover. Set the pot over high heat and salt generously. Bring the water to a boil and reduce the heat to medium-high to maintain a lively (but not violent) simmer. Boil the vegetables until they are very tender, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes and green beans are cooking, place the pancetta in a medium skillet (I use a well-seasoned cast-iron skillet) and set over medium heat. Sauté the pancetta, turning it frequently, for about 10 minutes, until it has rendered some of its fat and has just begun to crisp and turn brown. Remove from the heat and cover to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the vegetables are tender, drain them in a colander. Return them to the pot and slowly drizzle in the olive oil. Use a potato masher to mash the potatoes and green beans together as you drizzle. What you’re aiming for is a somewhat lumpy, textured mash—no need to purée completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a spatula or wooden spoon, scrape the pancetta and drippings into the pot and stir to combine with the potato-bean mash. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the mixture into a serving bowl and drizzle with a little more olive oil if you like. Serve warm or at room temperature.</p>"}]}