{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131026-new-potatoes-roasted-crispy-thanksgiving-26.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "potato", "roasted potato", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Ultra-Crispy New Potatoes With Garlic, Herbs, and Lemon", "link": "https://www.seriouseats.com/recipes/2013/11/ultra-crispy-new-potatoes-garlic-herbs-lemon-recipe-thanksgiving.html", "description": "When I say crispy potatoes, I want potatoes crunchier than the best of french fries; a thick, craggy, crunchy crust that <em>stays</em> crunchy even after it's made its way through a couple circuits around the table. Here's how to get it right every time.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Christmas", "Dairy-Free", "Potato", "Sides", "Thanksgiving", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["4 1/2 pounds red or yellow new potatoes, scrubbed clean, sliced in half", "1 tablespoon white vinegar", "Kosher salt", "1/4 cup canola oil (see note)", "Freshly ground black pepper", "2 large shallots, thinly sliced (about 1 cup)", "2 tablespoons chopped fresh parsley leaves", "2 tablespoons slived chives", "2 teaspoons zest from 1 lemon", "3 medium cloves garlic, finely minced (about 1 tablespoon)", "3 tablespoons extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower and upper position and preheat oven to 500°F. Line two rimmed baking sheets with foil and place in oven. Place potatoes in a large saucepot and cover with cold water by 1-inch. Add 2 tablespoons salt and vinegar. Bring to a boil over high heat, reduce to a simmer, and cook until exteriors are tender, about 5 minutes. Potatoes should show a slight resistance when poked with a paring knife or a cake tester. Drain potatoes and transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons oil to bowl with potatoes. Season with pepper and more salt to taste then toss until exteriors are slightly bashed up and coated in a thin layer of potato/oil paste. Spread remaining canola oil evenly over surfaces of hot foil-lined baking sheets, then divide potatoes evenly between them, using a thin spatula to arrange them cut-side down and using oven mitts or kitchen towels to maneuver the hot pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer baking sheets to the oven and roast until the bottoms of the potatoes are crisp and golden brown and can be easily lifted from the foil, about 30 minutes total, swapping top the trays top for bottom and rotating them once half way through roasting. Using a thin metal spatula, loosen all of the potatoes from the pan and toss. Return to oven and continue roasting until pale golden brown all over, about 15 minutes longer. Add shallots to pans and toss to coat in oil. Return to oven and roast until potatoes and shallots are deep golden brown, about 10 minutes longer. Remove from oven and transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add parsley, chives, lemon zest, garlic, and olive oil to potatoes and toss to coat. Season to taste with salt and pepper. Serve immediately.</p>"}]}