{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131219-277746-Apple-Cinnamon-Kringle.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["apple", "breakfast sweet", "cinnamon", "kringle", "pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple Cinnamon Kringle", "link": "https://www.seriouseats.com/recipes/2013/12/apple-cinnamon-kringle.html", "description": "This tender, buttery, fruit or nut-filled pastry takes its name from the Danish word for pretzel. But make no mistake, it's not your supermarket Danish.", "totalTime": "3 hours", "recipeYield": "Serves 6", "recipeCategory": ["American Classics", "Apple", "Breakfast Sweets", "Pastry"], "recipeIngredient": ["<strong>For the Kringle:</strong>", "1/2 cup sour cream", "3/4 teaspoon vanilla", "1 cup (4.5 ounces) all-purpose flour", "8 tablespoons unsalted butter, chilled and cut into 1 tablespoon chunks", "1 egg", "1 tablespoon sugar", " ", "<strong>For the Kringle Filling:</strong>", "4 tablespoons unsalted butter", "2 medium apples, diced", "2 tablespoons sugar", "1/2 teaspoon ground cinnamon", "1 teaspoon vanilla extract", "1 teaspoon cornstarch", " ", "<strong>For the Kringle Icing:</strong>", "1/2 cup powdered sugar", "1/2 tablespoon milk", "1/2 teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl mix together sour cream and vanilla. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pastry blender or several pulses with a food processor cut together flour and butter so butter is reduced to small pea-sized bits. Stir in sour cream mixture. Blend well to form a dough. Shape into a disk. Flatten disk slightly, cover and chill at least 2 hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pastry is chilling, prepare the kringle filling. In a small saucepan, brown the butter for the icing in a saucepan over medium heat, swirling the pan every so often. Once the butter has browned, add the apples, sugar, cinnamon and vanilla. Cook until apples have softened then quickly whisk in corn starch. Cook until mixture has thickened, about 5 minutes more. Remove from heat and transfer filling into a bowl. Cover and refrigerate until completely chilled, about 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move oven rack to the center position. Preheat oven to 450&deg;F. In a small bowl whisk together egg and sugar for the egg wash. Set aside. On a floured work surface, roll out the dough disk into a 12 by 6 inch rectangle. Spread filling down center in a thin strip leaving two inches clear on each side and an inch and a half at both ends. Fold sides over center then fold ends up, press lightly to seal. Brush with egg wash. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake on a parchment lined cookie sheet for 10 to 15 minutes or until golden brown. Just before kringle finishes baking whisk together confectioners sugar, milk and vanilla in a small bowl for the icing. Drizzle icing over warm kringle. Cool on wire rack. Store in a covered container. Best within a day.</p>"}]}