{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131210-276198-cook-the-book-vegetable-tempura.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "Cook the Book", "frying", "Japanese", "japanese soul cooking", "tempura", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vegetable Tempura From 'Japanese Soul Cooking'", "link": "https://www.seriouseats.com/recipes/2013/12/vegetable-tempura-from-japanese-soul-cooking.html", "description": "Tempura is likely the most familiar dish in <strong><a href=\"http://www.maisononyc.com/\" target=\"_blank\">Tadashi Ono</a></strong> and <strong><a href=\"http://www.harrissalat.com/about.html\" target=\"_blank\">Harris Salat</a></strong>'s new cookbook, <em><a href=\"http://www.amazon.com/Japanese-Soul-Cooking-Tonkatsu-Kitchens/dp/1607743523/?tag=serieats-20\">Japanese Soul Cooking</a></em>. The veggies get a quick dip in cake flour before being battered and fried&mdash;the extra coat of flour ensures that the loose batter doesn't slip away into the hot oil. Finally, the tempura is served with a subtle, salty sauce thickened with grated daikon and ginger.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Deep Frying", "Japanese", "Sides", "Snacks", "Vegetarian"], "recipeIngredient": ["<strong>Tempura Batter</strong>", "2 egg yolks", "2 cups cold water", "1/4 cup ice cubes", "2 cups cake flour", "&nbsp", "<strong>Tempura</strong>", "1 pound vegetables, sliced on an angle into bite-size pieces ", "1/2 cup cake flour", "2 quarts vegetable oil", "1/4 cup toasted sesame oil", "<a href=\"http://www.seriouseats.com/recipes/2013/12/tempura-dipping-sauce-ten-tsuyu-from-japanese-soul-cooking.html\">Tempura Dipping Sauce</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Begin the tempura batter:</strong> Combine the yolks and water in a bowl, mixing until they're incorporated, then add the ice cubes (the \"wet\" part of the batter).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare a tempura cooking station:</strong> beside your burner, arrange the vegetables, a plate with the cake flour, and the wet and dry parts of the batter. Also, ready a tray lined with paper towels or newspaper to absorb the excess oil from the cooked vegetables, and the tools you’ll need: chopsticks, a metal strainer, and a candy thermometer, if you have one. Place a cooking vessel on the burner; use one with a uniform size to heat oil evenly, like a large cast-iron skillet or Dutch oven (don’t use a wok). Add the vegetable oil and sesame oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil to 360°F over high heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>While the oil is heating, prepare the tempura batter:</strong> Quickly add the 2 cups flour to the liquid, in one shot. Hold 4 chopsticks together, the tips pointed down, like you're grabbing a bottle. Stab at the batter with the chopsticks, mashing down again and again to combine the dry and wet parts. Do not stir; you barely want to mix the batter. Mix for about 30 seconds, or until the batter becomes loose and liquidy, with the consistency of heavy cream. It should be lumpy, with visible globs of dry flour floating in the liquid, and with unmixed flour sticking to the sides of the bowl. Remember, if you overmix the batter, you'll ruin it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oil has reached 360°F, prepare to cook the vegetables in batches. Be careful not to overfill the skillet, which will lower the cooking temperature; use, at most, half of the surface area of the oil to cook. While the tempura is cooking, check the oil temperature with a candy thermometer. Regulate the heat to maintain a constant 360°F oil temperature. If the oil is too hot, the tempura will burn; if too low, the tempura will come out soggy and greasy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dredge the vegetables in the flour, then dip into the batter. Immediately lay the vegetables in the hot oil. Working in batches, deep-fry the harder vegetables like sweet potato, carrot, or lotus root first, for about 3 minutes, until the vegetables turn golden brown. Transfer the vegetables to the prepared tray to drain excess oil. Repeat with the other vegetables. Cook softer vegetables like asparagus, broccoli, and pumpkin for about 2 minutes. For shiso leaves, dredge only one side of the leaf with flour, and cook for about 1 minute.</p>\r\n\r\n<p>Serve the vegetable tempura with the dipping sauce on the side. <br />\r\n</p>"}]}