{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131022-almond-joy-ice-cream.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["almond", "chocolate", "coconut", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Almond Joy (Toasted Coconut with Dark Chocolate and Almonds) Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/10/almond-joy-toasted-coconut-with-dark-chocolat.html", "description": "Like an Almond Joy candy bar, but better.", "totalTime": "About two days", "recipeYield": "makes 3 1/2 quarts", "recipeCategory": ["Coconut", "Ice Cream and Frozen Treats", "Nuts", "Scooped"], "recipeIngredient": ["2 cups sweetened coconut flakes, packed (about 6 ounces)", "2 cups heavy cream", "1 cup whole milk", "6 egg yolks", "1/2 cup sugar", "1/4 to 1/2 teaspoon kosher salt, to taste", "2 ounces dark chocolate, chopped fine (a mix of chunks and fine shavings is ideal), chilled in freezer", "2 ounces roasted almonds, chopped fine, toasted then chilled in freezer"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350°F with an oven rack positioned in the middle. Spread coconut thinly and very evenly across a half sheet pan and toast just until coconut edges begin to brown and turn aromatic, 2 to 4 minutes. Do not overbake coconut or ice cream will taste burnt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer coconut to a medium saucepan and cover with cream and milk. Bring to a boil, stir to combine, and remove from heat. Cover, transfer to refrigerator, and let steep overnight or about 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, strain dairy through a fine mesh strainer into a large measuring cup or a bowl with a pouring spout. Press very firmly on coconut shreds to strain as much liquid out as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy medium saucepan, whisk together egg yolks and sugar until lighter in color and slightly thickened. Pour dairy into saucepan with eggs and whisk until fully combined. Cook on medium heat, stirring frequently, until a custard forms on the back of a spoon and a swiped finger leaves a clean line. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain custard into an ice bath or airtight container and chill until ice cream base falls below 40&deg;F. Churn according to manufacturer's instructions. In last minute of churning, add chocolate and almonds. Transfer ice cream to airtight container and chill for at least 4 hours in freezer before serving.</p>"}]}