{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131023-roasted-cauliflower-soup.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["cauliflower", "fall", "parsley", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Cauliflower Soup With Bacon and Parsley Oil", "link": "https://www.seriouseats.com/recipes/2013/10/meat-lite-roasted-cauliflower-soup-with-bacon-and-parsely-oil-recipe.html", "description": "This creamy, nutty-tasting soup gets an extra punch of flavor from crumbled bacon and bright parsley oil.", "totalTime": "50 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Bacon", "Cauliflower", "Christmas", "Meat Lite", "Soups and Stews", "Thanksgiving"], "recipeIngredient": ["2 medium heads cauliflower, separated into large florets", "1/2 cup plus 6 tablespoons extra-virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "6 slices bacon", "1 large white or yellow onion, peeled and finely chopped (about 1 1/2 cups)", "6 cups homemade or store-bought low-sodium vegetable or chicken stock", "1/4 cup half and half", "1/2 cup chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to middle positions and preheat oven to 400&deg;F. Toss cauliflower with 4 tablespoons olive oil and salt and pepper to taste. Divide between 2 rimmed baking sheets and roast, stirring occasionally, until deeply browned and tender, about 25 minutes. Remove from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, lay bacon slices in a cold cast-iron skillet, then set over medium heat. Cook, flipping once, until browned and crispy, about 6 minutes. Drain bacon on a paper towel, then chop or crumble into bite-sized pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a large, heavy-bottomed Dutch oven set over medium heat. Add onion and cook, stirring occasionally, until onions are translucent but not browned, about 6 minutes. Add roasted cauliflower and stock, bring to a boil, reduce heat, and simmer for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let soup cool slightly, about 10 minutes. Add half and half and use a hand blender to blend soup until smooth. Alternatively, blend soup in a blender in two batches. Season to taste with more salt and pepper. Keep soup warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine remaining 1/2 cup olive oil and parsley in blender and blend until smooth, about 1 minute. Pass oil through a fine-meshed sieve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, ladle soup into bowls, garnish with parsley oil, and sprinkle with chopped bacon. Serve immediately. </p>"}]}