{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130206-239251-cook-the-book-smoked-fish-chowder-market-restaurant.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Amelia OReilly", "America's Greatest New Cooks", "Cook the Book", "Food and Wine Magazine", "Nico Monday", "smoked fish chowder", "soup", "The Market Restaurant"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Nico Monday and Amelia O'Reilly's Smoked Fish Chowder (The Market Restaurant)", "link": "https://www.seriouseats.com/recipes/2013/02/nico-monday-and-amelia-oreillys-smoked-fish-c.html", "description": "Laced with fennel, leeks, and bay leaf, <a href=\"http://www.themarketrestaurant.com/chefs.php\">Nico Monday and Amelia O'Reilly's</a> <strong>Smoked Fish Chowder</strong> from <a href=\"http://www.foodandwine.com/\">Food and Wine's</a> new cookbook <em><a href=\"http://www.amazon.com/FOOD-WINE-Americas-Greatest-Cooks/dp/1932624562/?tag=serieats-20\">America's Greatest New Cooks</a></em> is a complex, fragrant take on the classic even before adding its namesake ingredient. But it is the flaked smoked fish that truly takes this chowder to another level. The smoke's aroma is the first thing to hit when ladling a bowl, and it certainly permeates the soup. However, since it is added so late in the cooking, this smoke gives way to the sweet corn, fennel, and potatoes.", "totalTime": "50 minutes", "recipeYield": "serves 6 to 8", "recipeCategory": ["Cook the Book", "Fish", "Gluten-Free", "Mains", "Soups and Stews"], "recipeIngredient": ["2 ears of corn, kernels cut from the cobs", "1 1/2 pounds large red-skinned potatoes, peeled and cut into 1/2-inch dice", "3 tablespoons unsalted butter", "2 fennel bulbs, cored and thinly sliced, fronds reserved and chopped", "2 large leeks, white and pale green parts only, cut into 1/4-inch dice", "1 large onion, thinly sliced", "2 thyme sprigs", "1 bay leaf", "Salt and freshly ground pepper", "1 quart plus 3 cups milk", "1 cup heavy cream", "1 pound smoked fish, such as haddock, mackerel, bluefish or trout, skinned and flaked"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan of salted boiling water, cook the corn until just tender,<br />\r\nabout 1 minute. With a slotted spoon, transfer the corn to a bowl. Add the potatoes to the boiling water and cook until tender, about 6 minutes. Drain the potatoes and add to the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, melt the butter. Add the fennel slices, leeks, onion, thyme and bay leaf and season with salt and pepper. Cover and cook over low heat, stirring occasionally, until the vegetables are softened, about 10 minutes. Add the milk, cream, corn and potatoes and simmer for about 3 minutes, smashing some of the potatoes to thicken the soup. Discard the thyme sprigs and bay leaf. Add the fish and simmer until heated through, about 2 minutes. Season lightly with salt and pepper. Ladle the chowder into bowls, garnish with fennel fronds and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Wine Pairing:</strong> Minerally northern Italian white: 2011 Kellerei Cantina Terlan Pinot Bianco</p>"}]}