{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130131-238416-cook-the-book-roasted-eggplant-and-leek-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Vietnamese", "keywords": ["Charles Phan", "Cook the Book", "eggplant", "grill", "grilling", "salad", "The Slanted Door", "vegetarian", "Vietnamese", "Vietnamese Home Cooking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Charles Phan's Roasted Eggplant and Leek Salad", "link": "https://www.seriouseats.com/recipes/2013/01/charles-phans-roasted-eggplant-and-leek-salad-recipe.html", "description": "The name \"Roasted Eggplant and Leek Salad\" in <strong><a href=\"http://charlesphan.com/index.html\">Charles Phan's</a></strong> <em><a href=\"http://www.amazon.com/Vietnamese-Home-Cooking-Charles-Phan/dp/1607740532/?tag=serieats-20\">Vietnamese Home Cooking</a></em> is a bit of a misnomer. Yes, this dish has eggplant and leeks, but no, it is not a roasted salad. (Unless, of course, you count grilling as roasting.) If you happen to live in a wondrous state with no real winter (cough, California, cough), grilling in January is a non-issue. In other parts of the country, however, it may be necessary to bring the dish indoors and under a broiler. Either way, this silky smokey salad should go on your to-make list, stat--soft eggplant meets pleasantly squeaky leeks in a vibrant sauce of soy, chiles, and cilantro. What's not to love?", "totalTime": "1 hour and 45 minutes", "recipeYield": "serves 6 as a side dish", "recipeCategory": ["Cook the Book", "Dairy-Free", "Eggplant", "Salads", "Sides", "Vegan", "Vegetarian", "Vietnamese"], "recipeIngredient": ["4 Rosa Bianca or globe eggplants (about 3 1/2 pounds total)", "Kosher salt", "12 baby leeks, white and light green parts only, halved lengthwise", "4 tablespoons canola oil", "Freshly ground black pepper", "1 1/2 cups loosely packed fresh cilantro leaves, coarsely chopped", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2013/01/charles-phans-spicy-soy-sauce-recipe.html\">spicy soy sauce</a>", "1 tablespoon freshly squeezed lime juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the stem end of each eggplant, peel and slice lengthwise into 1-inch slices. Sprinkle with salt and set aside to drain, 1 hour. After an hour, pat slices dry with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the eggplant slices are draining, prepare a medium fire for direct heat grilling in a charcoal grill (you should be able to hold your hand 1 inch above the grate for only 4 to 5 seconds).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the coals are ready, drizzle the leeks with 2 tablespoons of the oil and sprinkle with salt and pepper. Place the leeks on the grate and cook, turning as needed, for about 15 minutes, until soft and charred in spots. Transfer to a plate, cover with plastic wrap, and let steam while you cook the eggplant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle the eggplant slices on both sides with the remaining 2 tablespoons oil, then sprinkle on both sides with salt and pepper. Grill the slices, turning occasionally, for about 20 minutes, until very soft and browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the eggplant slices from the grill. When cool enough to handle, cut into 1/2-inch cubes and transfer to a serving bowl. Cut the leeks crosswise into 1-inch-thick slices and add to the eggplant. Add the cilantro and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the spicy soy sauce and lime juice. Pour<br />\r\nover the eggplant-leek mixture and toss to coat evenly. Season with additional salt and pepper and serve.</p>"}]}