{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130210-240326-sandwiched-steak-chimichurri-sandwiches-edit.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["argentinean", "chimichurri", "quick", "sandwiched", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Steak and Chimichurri Sandwiches", "link": "https://www.seriouseats.com/recipes/2013/02/steak-and-chimichurri-sandwich-recipe.html", "description": "Broiled skirt steak, bread, and chimichurri sauce is really all you need for this simple sandwich&mdash;you'll find yourself plunging the sandwich into the chimichurri before every bite.", "totalTime": "45 minutes", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Beef", "Chimichurri", "Sandwiches"], "recipeIngredient": ["<strong>For the chimichurri sauce</strong>", "1 cup chopped fresh parsley leaves", "1/2 cup chopped fresh cilantro leaves and tender stems", "1 tablespoon chopped fresh oregano leaves", "1 green onion, thinly sliced", "5 medium cloves garlic, minced (about 5 teaspoons)", "1 teaspoon lemon zest from 1 lemon", "3/4 cup extra virgin olive oil", "1/4 cup red wine vinegar", "1/2 teaspoon Kosher salt, plus more to taste", " ", "<strong>For the sandwich</strong>", "1 pound skirt steak or flank steak", "Freshly ground black pepper, to taste", "2 sandwich or hoagie rolls, each 6 to 7 inches in length"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the chimichurri sauce, combine the parsley, cilantro, green onion, oregano, garlic and lemon zest in a medium bowl. Add the olive oil, red wine vinegar, and 1/2 teaspoon of salt and whisk to combine. Season with more salt if needed. Place 1/4 cup of the chimichurri sauce in a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the steak on a foil-lined sheet pan. Season the steak on all sides with salt and freshly ground black pepper. Pour the 1/4 cup reserved chimichurri sauce over the steak, flipping the steak over to ensure even coverage. Marinate the steak at room temperature, for at least 20 minutes, or up to an hour. Adjust broiler rack to 6 inches below element and preheat broiler to high for 10 minutes before cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Broil steaks, turning over once, until nicely browned and charred on each side and center registers 125 to 135°F on an instant read thermometer, 5 to 6 minutes per side. Remove the steak from the broiler, tent loosely with foil, and allow to rest for 10 minutes. Meanwhile, toast sandwich rolls lightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the steak against the grain into 1/4-inch slices. Split the sandwich rolls open, then spoon and slather some of the remaining chimichurri sauce on the inside of the bread. Divide the sliced steak among the rolls, then spoon on more of the chimichurri sauce over the meat. Serve the sandwiches with the remaining chimichurri sauce on the side, for dipping.</p>"}]}