{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130626-pastaclams1.jpg", "author": {"@type": "Person", "name": "Deborah Mele"}, "recipeCuisine": "Italian", "keywords": ["cherry tomatoes", "clam", "clams", "Italian", "italian easy", "mussel", "mussels", "quick", "spaghetti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Spaghetti with Clams, Mussels, and Tomatoes", "link": "https://www.seriouseats.com/recipes/2013/07/italian-easy-spaghetti-clams-mussels-tomatoes-recipe.html", "description": "This quick and easy seafood pasta recipe combines both fresh clams and mussels along with sweet cherry tomatoes and includes tips to ensure your seafood is fresh and prepared properly.", "totalTime": "25 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Clams, Mussels, and Oysters", "Italian", "Mains", "Pasta"], "recipeIngredient": ["4 tablespoons olive oil", "3 medium cloves garlic, thinly sliced", "1/4 cup dry white wine ", "1 pound fresh mussels, scrubbed", "1 pound small clams, scrubbed", "1 pound spaghetti or long pasta of choice (see note)", "2 cups halved ripe cherry tomatoes (see note)", "1/2 teaspoon red chili flakes", "Kosher salt and black pepper to taste", "1/4 cup chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy saucepan, heat the oil over medium-high heat until lightly smoking. Add garlic and cook, stirring, until fragrant, 30 seconds to 1 minute. Add the wine and bring to a boil. Add the clams and mussels, cover, and cook, shaking the pan often until they open. Transfer the shells to a bowl; once cool, remove the meat from the shells, leaving about a quarter of clams and mussels in their shells to garnish the bowls for serving.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of salted water to a boil for the pasta. Once boiling, cook the pasta according to the package instructions until it is \"al dente.\" While the pasta is cooking, add the tomatoes and chili flakes to the seafood pot and cook over medium high heat, stirring often until the tomatoes begin to break down, 5 to 6 minutes. Season with salt and pepper, and stir in the parsley. Return the clams and mussels to the pot and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the pasta, then return it to the pot. Add the seafood sauce and cook for a minute or two over high heat, stirring constantly until it is piping hot. Serve immediately in individual bowls, with the clams and mussels still in their shells on top as a garnish.<br />\r\n</p>"}]}