{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/092613-267153-cook-the-book-water-kefir.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "diy", "kefir", "mary karlin", "mastering fermentation"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Water Kefir from 'Mastering Fermentation'", "link": "https://www.seriouseats.com/recipes/2013/09/water-kefir-from-mastering-fermentation.html", "description": "Milk kefir is a pretty common sight in the dairy aisle these days&mdash;or at least it is in California. Much more mysterious is its lactose-free cousin, water kefir. Both drinks are fermented with similar SCOBYs (symbiotic colonies of bacteria and yeast), but milk kefir grains feed on the natural sugars in the milk while water kefir needs additional sugar or fruit juice to get going. <strong><a href=\"http://marykarlin.com/\" target=\"_blank\">Mary Karlin</a></strong> provides recipes for both in her new cookbook, <em><a href=\"http://www.amazon.com/Mastering-Fermentation-Recipes-Cooking-Fermented/dp/1607744384/?tag=serieats-20\" target=\"_blank\">Mastering Fermentatio</a></em>. Today, we're trying our hand at the water-based version.", "totalTime": "7 to 8 days", "recipeYield": "Makes 2 quarts", "recipeCategory": ["Cook the Book", "Drinks", "Gluten-Free", "Non-Alcoholic", "Other Drinks"], "recipeIngredient": ["12 cups nonchlorinated water, at room temperature (see note)", "3/4 cup raw unrefined cane sugar or Sucanat", "2 teaspoons dehydrated water kefir grains"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To hydrate the grains:</strong> The first time you use the dehydrated grains (or if they have been stored for an extended period of time), they need to be hydrated to become active. In a small pan, heat 2 cups of the water over medium-high heat to just boiling. Place 1/4 cup of the raw sugar in a 1-quart glass jar and cover with the hot water. Stir to thoroughly dissolve the sugar. Add enough room-temperature water to bring the level of the liquid to the shoulder of the jar. Cool the mixture to room temperature and then add the grains. Cover the opening with fine-weave cheesecloth or a kitchen towel and secure with a rubber band. Allow the mixture to sit at room temperature for 3 to 4 days until the grains are plump. You are taking a risk if you let them sit any longer than 5 days, as the grains may start to lose their potency from lack of food (sugar).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the kefir:</strong> In a small pan, heat 2 more cups of the water over medium-high heat to just boiling. Divide the remaining 1/2 cup sugar between two 1-quart glass jars and cover evenly with the hot water. Stir to thoroughly dissolve the sugar. Add enough room-temperature water to bring the level of the liquid to the shoulder of the jar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the mixture to room temperature, and then add equal amounts of the loose plump grains in each jar. Cover the jar opening with fine-weave cheesecloth or a kitchen towel and secure with a rubber band.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the mixture to sit at room temperature for 24 to 48 hours, depending on the level of sweetness you want. Shorter time will result in a sweeter kefir; longer will be less so. Do not exceed 72 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 12 hours before you are ready to strain the kefir, start a new batch of sugar water to prepare for the next batch of kefir. This sugar water will need to be ready to receive the grains once you have strained the kefir.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once it has reached the desired level of sweetness, use a dedicated fine-mesh nylon strainer to strain off the liquid into a spouted glass measuring vessel. Using a funnel, fill two 1-liter swing-top bottles. Place the captured grains in the new batch of sugar water to store.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Secure the caps on the bottles and leave at room temperature until ready to consume. In a day or so, tiny bubbles of carbonation will appear. This will increase as time passes and if you add fruit to the kefir. Water kefir does not need to be refrigerated unless you want it chilled. It’s best to consume within 10 days after opening a bottle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unused grains can be fed and stored, covered, in sugar water (1/4 cup sugar to 1 quart water), and refrigerated for up to 2 weeks. Bring the mixture to room temperature before using the grains for a new batch of kefir. For longer periods of storage, the grains should be laid out to dehydrate, stored in an airtight container, and refrigerated. This process returns the grains to their original state. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: Kefir grains require minerals to thrive. Hard, mineral-rich water such as well water or spring water is best. Do not use filtered water because too many of the minerals will have been removed. If using tap water, first bring it to a boil to remove any possible chlorine, and then cool it to room temperature before using. Supplementing with Trace Mineral Drops (1/8 teaspoon per quart of water) is a good security measure. These can be purchased from the same source as your grains.</p>"}]}