{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131117-foraged-icecream.jpg", "author": {"@type": "Person", "name": "Tama Matsuoka Wong"}, "recipeCuisine": "", "keywords": ["hickory", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hickory Bark Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/11/hickory-bark-ice-cream-recipe.html", "description": "Egg-free ice cream flavored with foraged hickory bark and nuts.", "totalTime": "1 day", "recipeYield": "Makes 2 1/2 pints", "recipeCategory": ["Ice Cream and Frozen Treats"], "recipeIngredient": ["1/2 pound shagbark hickory bark, broken in to pieces small enough to fit in a large pot (see note)", "1 cup smashed hickory nuts or shells (see note)", "4 cups whole milk", "¼ cup cornstarch", "1 cup heavy cream", "1 cup sugar", "pinch salt", "4 ounces (1/2 brick) cream cheese, softened"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to center position and preheat oven to 325°F. Spread the hickory bark and shells apart on a baking sheet with parchment paper and toast until fragrant, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk and toasted hickory bark and shells in a large pot. Heat over medium-high heat, stirring frequently, until simmering. Adjust heat to maintain a bare simmer and cook for 15 minutes, stirring often. Remove from heat, let cool for 1 hour at room temperature, then cover and transfer to refrigerator for at least 4 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain milk through a fine mesh strainer lined with cheesecloth and discard solids.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk 2 cups of hickory milk with the cornstarch in a medium bowl and set aside. Combine remaining 2 cups hickory milk, cream, sugar, and salt in a large saucepan and bring to a boil over medium-high heat, stirring frequently to prevent scorching. Whisk milk/cornstarch mixture, then pour into boiling milk. Reduce heat to a bare simmer and cook, stirring constantly, until thickened, 2 to 3 minutes,</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat, let cool slightly, then combine with cream cheese. Transfer to a blender in two batches and blend until thoroughly. Transfer to sealable containers and let cool at room temperature with no lids for 1 hour. Cover and transfer to refrigerator. Refrigerate about 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process in an ice cream machine according to manufacturer’s instructions. Remove to freezer-safe container and harden in the freezer for at least 4 hours before serving.</p>"}]}