{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130316-244734-orange-tomatillo-salsa-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Mexican", "keywords": ["cinco de mayo", "Mexican", "orange", "salsa", "tomatillo"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orange-Tomatillo Salsa", "link": "https://www.seriouseats.com/recipes/2013/05/orange-tomatillo-salsa-recipe.html", "description": "Sick of tomatoes but still craving salsa? This sweet and tangy orange-tomatillo salsa will do you just right.", "totalTime": "20 minutes", "recipeYield": "makes about 2 cups", "recipeCategory": ["Mexican", "Orange", "Salsa", "Sauced"], "recipeIngredient": ["1 pound (about 8 medium) tomatillos, husked, rinsed, and halved  ", "3/4 cup finely chopped white onion (about 1 medium onion)", "1 tablespoon finely chopped chipotles in adobo", "2 medium seedless oranges, segmented, pith removed, and cut into 1/2-inch pieces", "1/4 cup finely chopped fresh cilantro leaves and tender stems", "1 tablespoon lime juice", "Kosher salt, to taste", "Sugar, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust a rack about 4 inches below broiler element and heat broiler to high. Place half of tomatillos, cut side down, on a rimmed baking sheet lined with aluminum foil. Place in broiler and cook until tomatillos are charred and fully softened, about 5 minutes. Transfer to a workbowl of a food processor fitted with steel blade. Add fresh tomatillos and pulse until finely chopped, 10 to 12 short pulses. Transfer to a medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion, chipotles, oranges, cilantro, and lime juice to tomatillos; stir to combine. Thin with water to desired consistency. Season with salt and sugar to taste. Transfer to an airtight container and place in refrigerator for at least one hour before using. Store in refrigerator for up to a week.</p>"}]}