{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130514-251457-GFTues-SpinachOnionTart.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["onion", "quiche", "spinach", "tart", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Spinach and Onion Tart", "link": "https://www.seriouseats.com/recipes/2013/05/gluten-free-spinach-and-onion-tart-recipe.html", "description": "A simple, elegant tart for those nights you have a handful of random ingredients at home.", "totalTime": "about 2 hours", "recipeYield": "serves 4", "recipeCategory": ["Gluten-Free", "Gluten-Free Tuesday", "Mains", "Onion", "Quiche", "Spinach", "Vegetarian"], "recipeIngredient": ["<strong> For the Crust</strong> ", "1 1/4  cups (about 6.5 ounces) sorghum flour", "1/4 cup (about 1 ounce) tapioca starch", "1/2 teaspoon salt", "2 ounces (1/2 stick) butter, chilled and cut into small pieces", "1/4 cup (2 ounces) ice water, plus more as needed", "1 large egg", " ", "<strong> For the Filling</strong>", "3 tablespoons olive oil, divided", "2 large sweet onions, halved and sliced into 1/4-inch thick pieces", "5 ounces baby spinach", "4 large eggs", "1/2 cup half and half", "1/2 teaspoon salt", "1/4 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the crust:</strong> In bowl of food processor, combine sorghum flour, tapioca starch, and salt. Pulse to combine. Add butter. Pulse until pieces are no larger than 1/4-inch. Whisk together 1/4 cup water and egg. Add egg mixture. Run food processor until a dough ball forms, about 45 seconds. If dough is dry, add an additional tablespoon of water until dough comes together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly spray a 10-inch tart pan with cooking spray. Pinch off one-tablespoon pieces of dough. Place dough balls, about 1/2 inch apart, around edge of pan. Place remaining dough balls into center of pan, also spaced about 1/2-inch apart. Using your hand, press dough into bottom of pan. Then press dough around edge to form a crust. Use a measuring cup to press dough firmly into pan. Trim excess dough from edges using a sharp knife. Prick bottom of dough with fork. Lightly cover pan with plastic wrap and freeze tart for 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> Prepare the filling</strong>: Heat 2 tablespoons olive oil over medium-high heat in a large cast iron skillet until shimmering. Add sliced onions and cook, stirring often, until softened but not browned, about 5 minutes. Reduce heat to medium-low. Continue cooking, stirring occasionally, until onions are soft and brown, about 50 minutes. Remove onions from the pan and place in a large bowl to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to high heat and add remaining tablespoon olive oil. Heat until shimmering. Add spinach and cook, stirring frequently until wilted and tender, about 2 minutes. Transfer to bowl with onions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position. Preheat oven to 425 &deg;F. Remove plastic wrap from tart pan and bake until lightly golden brown, about 25 minutes. Remove tart pan from oven and place on wire rack. Spread onions and spinach evenly over the bottom of the baked tart shell. In medium bowl, whisk together eggs, half and half, salt, and pepper. Pour into tart. Return tart pan to oven. Bake until filling is set, about 20 minutes. Remove from oven, allow to cool for 5 minutes, and serve. </p>"}]}