{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130313-244092-grasshopper-squares-small.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["chocolate dessert", "grasshopper", "icebox cake", "mint desserts", "no bake", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grasshopper Squares", "link": "https://www.seriouseats.com/recipes/2013/03/no-bake-grasshopper-squares-chocolate-mint-meringe-pudding-cake-recipe.html", "description": "This retro-inspired no-bake dessert is perfect for when you want a chocolate and minty treat without spending a ton of time in the kitchen.", "totalTime": "9 hours", "recipeYield": "Serves 8", "recipeCategory": ["American Classics", "Chocolate", "Ice Cream and Frozen Treats", "No-Cook", "Puddings and Custards", "St. Patrick's Day"], "recipeIngredient": ["3 tablespoons cornstarch", "3 tablespoons sugar", "1/4 teaspoon salt", "2 cups 1% milk", "1 ounce green crème de menthe", "1 tablespoon crème de cacao", "2 teaspoons vanilla extract", "13 1/2 (27 squares) chocolate graham crackers", "3 tablespoons unsalted butter, slightly softened", "1/2 cup confectioner's sugar", "3 ounces 72% cacao dark chocolate, melted in the microwave or on the stovetop", "3/4 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan whisk together cornstarch, sugar, salt and milk. Bring to a light boil over medium heat while whisking constantly. Cook, whisking constantly, until pudding is thick with slow bubbles breaking the surface (about 2 minutes). Remove from heat and pour immediately into a large bowl. Quickly whisk in crème de menthe, crème de cacao, and vanilla. Set bowl over an ice bath and whisk continuously to cool to room temperature (about 10 to 15 minutes). Place a piece of waxed paper or plastic wrap on top of the pudding to prevent pudding skin from forming. Refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an electric stand mixer fitted with the paddle attachment, cream together butter and confectioner's sugar on medium speed until light and fluffy, about 2 minutes. Add melted chocolate and beat until thoroughly combined, about 30 seconds longer. Transfer to a bowl and set aside. Wash stand mixer bowl and dry carefully.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cream to the bowl of an electric stand mixer fitted with a whisk attachment. Whip on medium high speed until soft peaks form, about 1 minute. Fold whipped cream into chilled pudding. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bottom of an 8 x 8 pan with chocolate graham crackers (you'll need 4 1/2 cracker \"sheets\" or 9 graham squares per layer). Cover the graham crackers with half of the pudding mixture, top with another layer of graham crackers then cover with remaining pudding. Add final layer of graham crackers to the top and cover with chocolate frosting. Refrigerate overnight. Serve chilled.</p>"}]}