{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/061713-256001-cook-the-book-flour-lamb-sandwich.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "flour too", "herb goat cheese", "joanne chang", "lamb sandwich", "tomato chutney"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roast Lamb Sandwich with Tomato Chutney and Rosemary Goat Cheese from 'Flour, Too'", "link": "https://www.seriouseats.com/recipes/2013/06/roast-lamb-sandwich-with-tomato-chutney-and-goat-cheese-flour-too.html", "description": "<strong><a href=\"http://flourbakery.com/team/joanne-chang\">Joanne Chang</a></strong> begins her recipe for <a href=\"http://flourbakery.com/\">Flour Bakery's</a> lamb sandwich with a series of quotes from customers, like \"I have dreams about your lamb sandwich\" and, \"I want to marry your lamb sandwich.\" While I'm pretty sure I'd never attempt to run off with a stack of her sandwiches, I can understand the sentiment: This sandwich is a commitment, but well worth it.", "totalTime": "5-6 hours, plus an overnight rest (including bread baking)", "recipeYield": "Makes 4 sandwiches", "recipeCategory": ["Cook the Book", "Lamb", "Mains", "Sandwiches"], "recipeIngredient": ["<strong>Lamb</strong>", "1 1/2 to 2-pound (680- to 910-gram) lamb top round or boneless leg of lamb", "4 teaspoons kosher salt", "1 teaspoon freshly ground black pepper", "2 garlic cloves, smashed and minced", "2 teaspoons finely chopped fresh rosemary", "2 tablespoons extra-virgin olive oil", "&nbsp", "<strong>Tomato Chuntey</strong>", "2 teaspoons vegetable oil", "1/4 small onion, cut into 1/4-inch (6-mm) pieces", "2 tablespoons granulated sugar", "2 tablespoons red wine vinegar", "One 14 1/2-ounce (415-gram) can “no salt added” diced tomatoes, with juice", "2 tablespoons golden raisins", "2 tablespoons dried currants", "1/8 teaspoon kosher salt", "1/8 teaspoon freshly ground black pepper", "1/4 cup (15 grams) minced fresh flat-leaf parsley", "&nbsp", "<strong>Rosemary Goat Cheese</strong>", "8 ounces (225 grams) soft fresh goat cheese, at room temperature", "1/2 teaspoon finely chopped fresh rosemary", "1/2 teaspoon finely chopped fresh flat-leaf parsley", "1/2 teaspoon finely chopped fresh thyme", "1/4 teaspoon kosher salt", "1/8 teaspoon freshly ground black pepper", "&nbsp", "<strong>Sandwiches</strong>", "8 slices <a href=\"http://www.seriouseats.com/recipes/2013/06/joanne-changs-flour-focaccia.html\">Flour Focaccia</a> or other good-quality white or wheat bread", "4 cups (85 grams) loosely packed mesclun greens or other mild lettuce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The night before, rub the lamb all over with the salt and pepper, cover with plastic wrap or place in a container with a tight-fitting lid, and let rest overnight in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, take the lamb out of the fridge. If using leg of lamb, roll the lamb into a bundle and tie together tightly with kitchen twine. Rub the surface of the lamb with the garlic, rosemary, and olive oil. Let rest for about 1 hour at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 20 minutes before you are ready to roast the lamb, preheat the oven to 300°F (150°C), and place a rack in the center of the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the roasting rack on the baking sheet, and put the roast on the rack. Roast for 50 to 60 minutes for a 1 1/2-pound (680-gram) roast or 65 to 75 minutes for a 2-pound (910-gram) lamb top, or until the thermometer inserted into the center of the roast registers 130°F (54°C). Start checking the lamb after 45 minutes. Once it hits 100°F (38°C), the cooking goes quickly, so check every 5 minutes or so. When the internal temperature reaches 130°F (54°C), remove the roast from the oven and let cool. Let the roast rest in the fridge for at least 3 hours or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, make the tomato chutney:</strong> In a medium skillet, heat the vegetable oil over medium-high heat. Add the onion and cook, stirring constantly, for about 2 minutes, or until softened a bit. Add the sugar and vinegar and stir for 1 minute until the sugar starts to dissolve. Add the tomatoes, raisins, and currants and bring to a simmer. Reduce the heat to low and simmer, stirring occasionally and using the back of a wooden spoon to press down on the tomato pieces to break them up. The chutney should darken and the liquid will eventually evaporate. Let reduce and thicken for 10 to 15 minutes. Stir in the salt, pepper, and parsley; remove from the heat; and let cool. The chutney can be stored in an airtight container in the fridge for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the rosemary goat cheese:</strong> In a small bowl, combine the goat cheese, rosemary, parsley, thyme, salt, and pepper and mix with a wooden spoon until well blended. The rosemary cheese can be stored in an airtight container in the fridge for up to 1 week; bring to room temperature before using so it spreads easily.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the well-chilled lamb of any fat and slice it against the grain as thinly as possible. Set the slices aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the bread slices out on a clean, dry counter and spread four of the slices with the chutney, dividing it evenly. Spread the remaining four slices with the goat cheese, again dividing it evenly. Top each of the chutney-spread slices with an equal amount of the greens. Top each of the goat cheese–spread slices with 5 to 6 ounces (140 to 170 grams) of the sliced lamb. Close each sandwich, then cut in half and serve.</p>"}]}