{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131010-very-small-anna-sticky-pumpkin-cake.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["cake", "caramel", "cider", "fall"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Sticky Pumpkin Cake With Hard Cider Caramel", "link": "https://www.seriouseats.com/recipes/2013/10/sticky-pumpkin-cake-with-hard-cider-caramel-d.html", "description": "These steamed pumpkin cakes with a rich hard cider caramel sauce are a unique way to celebrate fall and would make a lovely Halloween dinner party dessert.", "totalTime": "1 hour", "recipeYield": "Makes 8-12 cakes", "recipeCategory": ["Cakes", "Pumpkin", "Very Small Anna"], "recipeIngredient": ["<strong>For the Cakes</strong>", "2 eggs", "1 1/2 teaspoon vanilla extract", "1 tablespoon Crop Spiced Pumpkin Vodka (see note)", "3/4 cup plus 2 tablespoons granulated sugar", "1/2 cup plus 1 tablespoon unsalted butter, melted", "1 cup all purpose flour", "Pinch salt", "1 cup packed pumpkin puree", "1/4-1/2 teaspoon pumpkin spice (see note)", "2 teaspoons baking soda", "2 tablespoons boiling water (see note in recipe)", " ", "<strong>For the Caramel Sauce</strong>", "1 1/3 cup sugar", "Generous pinch salt", "1/4 cup water", "1/2 cup hard cider (I used Woodchuck pumpkin)", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cakes</strong>: Place a rack in center of oven and preheat oven to 350&deg;F. Lightly grease 8 4-ounce aluminum cups or all 12 cups of a standard muffin tin, then place the cups in a large roasting pan or other baking vessel with ample room and sides that are at least 2 inches high.  Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place eggs, vanilla, and liquor in a medium mixing bowl and whisk together. Whisk in sugar, followed by butter, then flour and salt, fully incorporating each ingredient before adding the next. Whisk in the puree and spice. In separate small bowl, add boiling water to baking soda and stir gently to fully dissolve, then add to batter and whisk in immediately.</p>\r\n\r\n<p><strong>Note</strong>: Bring at least 1/2 cup water to a boil, then measure 2 tablespoons into small mixing bowl containing baking soda. Water must be boiling so that it fully activates and dissolves the baking soda.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter evenly between prepared cups and add an inch of hot water to pan. Bake for 30 minutes, then rotate pan and add more water if necessary. Bake for another 20 minutes, then check for doneness with cake tester, skewer or paring knife inserted in center of a cake. If tester comes out clean, remove from oven and allow to cool slightly, then remove cups to a rack. If cakes are not done, continue to bake and check in 5 minute intervals.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Caramel Sauce</strong>: Combine sugar and salt in medium saucepan and add water to moisten. Place over medium-high heat and cook until it begins to caramelize. Alternately move off and on the heat, swirling the pan gently, until caramel is a uniform amber color, somewhere between color of honey and maple syrup. With caramel off the heat, slowly pour in cider and cream, being careful as it will sputter. Return to heat, lowering it to medium-low, and allow to simmer, stirring occasionally, until all seized caramel is melted. Remove from saucepan to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve</strong>: Gently loosen tops of cakes from cups with a paring knife, then turn out onto plates. If cakes are significantly domed, trim until flat enough to rest on plates upside down. Pour warm caramel sauce over warm cakes and serve immediately, with whipped cream or ice cream if desired.</p>"}]}