{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20131026-turkey-two-ways-recipe-04.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["braise", "low carb", "stew", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7272727272727", "ratingCount": "11"}, "name": "Red Wine&ndash;Braised Turkey Legs", "link": "https://www.seriouseats.com/recipes/2013/11/red-wine-braised-turkey-legs.html", "description": "Tender braised turkey legs with crispy skin and a savory red wine gravy.", "totalTime": "3 hours", "recipeYield": "Serves 4 to 5", "recipeCategory": ["Braising and Stewing", "Christmas", "Fall", "Mains", "Stovetop", "Thanksgiving", "The Food Lab", "Turkey"], "recipeIngredient": ["2 whole turkey legs", "Kosher salt and freshly ground black pepper", "2 tablespoons (30ml) canola oil", "1 large onion, roughly chopped", "1 large carrot, roughly chopped", "2 ribs celery, roughly chopped", "2 medium cloves garlic, smashed", "4 thyme sprigs (about 3 inches each)", "2 rosemary sprigs (about 5 inches each)", "2 cups (480ml) dry red wine", "1 quart (900ml) <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 bay leaves", "2 tablespoons (30g) butter", "2 tablespoons flour", "1 tablespoon sliced chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 275°F (135&deg;C). Season turkey legs generously with salt and pepper on all sides. Heat oil in a large straight-sided sauté pan over high heat until shimmering. Add turkey legs, skin side down. Cook, without moving, until turkey is deep golden brown, about 8 minutes. Flip legs and cook until second side is browned, about 5 minutes longer, reducing heat as necessary if oil smokes excessively. Transfer turkey to a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return sauté pan to heat and add onion, carrot, celery, garlic, thyme, and rosemary. Cook, stirring frequently, until vegetables are well browned, about 8 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine, bring to a boil, and cook until reduced by half, about 5 minutes. Add stock and bay leaves and bring to a boil. Nestle turkey legs into pan, letting them rest on the vegetables so that only their skin is exposed. Transfer to oven and cook, uncovered, until legs are fall-apart tender, sauce is reduced, and skin is deep mahogany, about 2 hours. Carefully remove from oven and transfer turkey legs to a plate using a slotted spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain liquid through a fine-mesh strainer into a large bowl or medium saucepan. Discard solids. Skim excess fat from surface and discard. Set liquid aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan over medium-high heat, melt butter. Add flour and cook, whisking constantly, until golden brown, about 2 minutes. Slowly whisk in hot turkey-cooking liquid until fully incorporated. Bring to a boil to thicken and season to taste with salt and pepper. (You may not need any salt, depending on how salty your broth was to begin with.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve each turkey leg between the thigh and the drumstick, removing thigh bone if desired. Transfer to a serving platter. Sprinkle with chives and serve with hot gravy.</p>"}]}