{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131215-277286-Melt_pumpkin.JPG", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["cheese", "mac and cheese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin Mac 'n' Cheese From 'Melt: The Art of Macaroni &amp; Cheese'", "link": "https://www.seriouseats.com/recipes/2013/12/pumpkin-mac-n-cheese-from-melt-the-art-of-mac-and-cheese.html", "description": "This recipe, baked inside the pumpkin&mdash;a trick inspired by Dorie Greenspan and Ruth Reichl, both famous for their stuffed-pumpkin recipes (among other things)&mdash;simply knocked our socks off with flavor and a stylish yet homey presentation.", "totalTime": "2 1/2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cheese", "Pumpkin"], "recipeIngredient": ["1 sugar pumpkin, or other sweet variety (not a carving pumpkin), about 5 pounds", "Sea salt", "Freshly ground black pepper", "1 tablespoon olive oil", "1/4 pound mild Italian pork sausage", "4 ounces elbow macaroni", "5 ounces Fontina, cut into 1/4-inch cubes", "2 ounces Gruyère, cut into 1/4-inch cubes", "3 scallions, diced", "1 teaspoon chopped fresh rosemary", "1 teaspoon chopped fresh thyme", "1 teaspoon chopped fresh sage", "1 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Cut a circle from the top of the pumpkin at a 45-degree angle, the way you would cut open a pumpkin to make a jack-o’-lantern, and set aside. Scoop out the seeds and strings as best you can. Generously salt and pepper the inside of the pumpkin, pop the top back on it, place it on a rimmed baking dish (since the pumpkin may leak or weep a bit), and bake for 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat the olive oil in a sauté pan over medium heat. If the sausages are in their casings, remove the meat and discard the casings. Crumble the sausage meat into small chunks and cook until lightly browned. Remove the sausage from the pan with a slotted spoon and set aside to cool. Discard the drippings, or save for gravy or what have you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Also while the pumpkin bakes, cook the pasta in a large pot of salted boiling water until al dente. Drain through a colander and rinse with cool water to stop the cooking process.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, toss together the Fontina, Gruyère, sausage, pasta, scallions, and herbs. Once the pumpkin is done baking, take it out of the oven and fill it with the macaroni and cheese. Pour the cream over the filling. Place the top back on the pumpkin and bake for 1 hour, taking the top off for the last 15 minutes so the cheese on top of the filling can properly brown. If the top cream still seems a bit too wobbly and liquid, give it another 10 minutes in the oven. The cream may bubble over a bit, which is fine.<br />\r\nIf the pumpkin splits while baking, as occasionally happens, be thankful you set it in a rimmed baking dish and continue to bake as normal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the pumpkin to rest for 10 minutes before serving. Be careful moving the dish, as the pumpkin may be fragile. You can serve this dish two ways: Cut it into sections and serve them, or just scoop out the insides with scrapings of the pumpkin flesh for each serving. Either way is just dandy. Salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wine pairings: white Rhône Valley blends, Viognier, oaky Chardonnay, champagne</p>"}]}