{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130111-235760-peaches-n-cream-pie-610x458-1.jpg", "author": {"@type": "Person", "name": "Lauren Weisenthal"}, "recipeCuisine": "", "keywords": ["cream pies", "peaches", "pie of the week", "pies", "whipped cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "2"}, "name": "Peaches n' Cream Mousse Pie", "link": "https://www.seriouseats.com/recipes/2013/01/peaches-n-cream-pie-recipe.html", "description": "Wintertime can wear out its welcome right about now, still months away from the growing season for berries and stone fruit. When I pine for the flavors of warmer months, I turn to frozen fruit to satisfy my cravings. The light, airy peach mousse in this pie utilizes frozen peaches for flavor that's summery, any time of year.", "totalTime": "6 hours", "recipeYield": "serves 8", "recipeCategory": ["Desserts", "Fruit Desserts", "Peach", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">One half recipe Easy Pie Dough</a>, shaped and chilled in a pie plate", "3 ounces cold water", "1 1/2 teaspoons powdered gelatin", "16 ounces sliced frozen peaches, thawed", "7 ounces sugar", "10 ounces heavy cream, cold and whipped to soft peaks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 425&deg;F. When oven is ready, line chilled pie shell with foil or parchment paper and fill with weights (I reuse dried beans for this), and bake on the lowest rack of the oven for 15 minutes. Remove weights and liner, turn pie, and bake until the bottom crust is a golden brown, about 10 minutes. Remove pie shell from oven and allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cold water in a small bowl and sprinkle the gelatin slowly over the top. Stir to ensure that the gelatin is fully hydrated and there are no lumps. Set aside to bloom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the peaches (including any juice from thawing out) and sugar and stir over medium heat, stirring occasionally. Bring the peaches to a simmer and allow them to continue cooking until they are fork tender, about 20 minutes. Remove the pot from the heat. Add the gelatin mixture and cook, stirring, until completely dissolved, about 1 minute. Pour the contents of the pot into a blender and blend until completely smooth, about 1 minute. Press the puree through a fine mesh strainer and discard solids. Set the puree aside and allow it to cool to room temperature or cool it over an ice bath, whisking as it cools to prevent the gelatin from setting up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the puree is at room temperature, stir one quarter of the whipped cream into the puree to lighten it. Add all but 2 ounces of the remaining whipped cream (reserve the rest for decoration) and fold it into the puree mixture. Pour the mousse into the cooled pie shell. Refrigerate for at least 2 hours to allow the gelatin to set up. Pipe remaining whipped cream on the top just before serving.</p>"}]}