{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20120206-vegan-pizza-potatoes-zucchini-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["foolproof pan pizza", "pan pizza", "red onions", "squash", "The Food Lab", "the pizza lab", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easy Pan Pizza With Zucchini, Red Onion, and Pistachios (Vegan)", "link": "https://www.seriouseats.com/recipes/2013/02/easy-pan-pizza-zucchini-red-onion-pistachio-vegan.html", "description": "Foolproof no-knead pan pizza dough topped with zucchini and summer squash along with red onions, thyme, and pistachios.", "totalTime": "1 day (including time for dough to rise)", "recipeYield": "Serves 4 (makes two 10-inch pizzas)", "recipeCategory": ["Bread", "Dairy-Free", "Mains", "Pizza", "Squash", "The Pizza Lab", "Vegan", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/01/foolproof-pan-pizza-recipe.html\">Foolproof Pan Pizza</a> (dough only), or 1 1/2 pounds store-bought pizza dough", "1/4 cup plus 2 tablespoons extra virgin olive oil", "1 small zucchini, sliced into 1/4-inch rounds", "1 small summer squash, sliced into 1/4-inch rounds", "1/2 a small red onion, thinly sliced", "2 teaspoons picked fresh thyme leaves", "Kosher salt and freshly ground black pepper", "1/4 cup pistachios"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into two equal balls. Pour 2 tablespoons of oil in the bottom of each of two 10-inch cast iron skillet or round cake pans. Place 1 ball of dough in each pan and turn to coat evenly with oil. Using a flat palm, press the dough around the pan, flattening it slightly and spreading oil around the entire bottom and edges of the pan. Cover tightly with plastic wrap and let the dough sit at room temperature for two hours. After the first hour, adjust an oven rack to the lower middle position and preheat oven to 550°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After two hours, dough should be mostly filling in the pan up to the edges. Use your fingertips to press it around until it fills in every corner, popping any large bubbles that appear. Lift up one edge of the dough to let any air bubbles underneath escape and repeat, moving around the dough until there are no air bubbles left underneath and the dough is evenly spread around the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss zucchini, squash, red onion, and thyme leaves with remaining 2 tablespoons oil. Season to taste with salt and pepper. Shingle zucchini and squash pieces over tops of pizzas, alternating to create a pattern. Spread onion slices even over top, then add any thyme or olive oil left in the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pizzas to oven and back until well browned on top and bottom of pizzas are golden brown and crisp when you peek under them with a thin metal spatula. If necessary, pizzas in cast iron pans can be further browned directly on stovetop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle pizzas with pistachios and serve immediately.</p>"}]}