{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/051713-251844-cook-the-book-tapioca-pearls-with-coconut-milk-mango.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["coconut milk", "Cook the Book", "mango", "marvin gapultos", "rice balls", "tapioca porridge", "the adobo road cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tapioca Pearls with Coconut Milk and Mango (Tambo-Tambo) from 'The Adobo Road Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/05/tapioca-pearls-with-coconut-milk-and-mango-ta.html", "description": "As a kid, I turned my nose up at the mere mention of tapioca pudding, despite the fact that I had never even come close to trying the stuff. I'm sure I'm not alone here. But for <strong><a href=\"http://burntlumpiablog.com/about\">Marvin Gapultos</a></strong>, a warm Filipino tapioca porridge called <em>tambo-tambo</em> remains a favorite dessert. And why not? The tapioca pearls glimmer in a rich coconut milk broth, studded with fat, chewy rice balls and small pieces of sweet fruit. His version in <em><a href=\"http://www.amazon.com/The-Adobo-Road-Cookbook-Journey-From/dp/0804842574/?tag=serieats-20\">The Adobo Road Cookbook</a></em> is easy and fun to make (rice balls dough = tasty playdough), and his use of mango as a topping guarantees sweet success.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cook the Book", "Desserts", "Fruit Desserts", "Mango", "Puddings and Custards", "Vegetarian"], "recipeIngredient": ["<strong>Tapioca</strong>", "1/2 cup (75 g) small dried tapioca pearls", "1 cup (250 ml) water", "&nbsp", "<strong>Rice Flour Balls</strong>", "1 cup (150 g) glutinous rice ﬂour", "1/2 cup (125 ml) water, plus more as needed", "&nbsp", "<strong>Porridge</strong>", "1 3/4 cup (400 ml) unsweetened coconut milk", "1/2 cup (125 ml) water", "1/4 teaspoon salt", "1/2 cup (100 g) sugar", "2 ripe mangoes, peeled, deseeded and diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the tapioca in the 1 cup (250 ml) of water in a small bowl for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tapioca is soaking, make the rice balls. Combine the rice ﬂour with the 1/2 cup (125 ml) of water in a large bowl and mix until a dough comes together. The dough should be slightly tacky and you should be able to form the dough into a large sphere. If the dough is too dry and crumbly, slowly add more water, one tablespoon at a time, until the dough can hold its shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form the rice ﬂour balls by pinching off about a teaspoon of the dough and rolling it between your palms to form a small sphere about 1/2 in (1.25 cm) in diameter. You should be able to make about 20 small rice balls from the dough. Cover the rice balls with a damp paper towel and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the tapioca in a ﬁne-mesh sieve set over the sink and rinse with cold running water. Allow the tapioca to continue draining over the sink.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the porridge, combine the coconut milk with the remaining 1/2 cup (125 ml) of water in a large saucepan. Stir in the salt and the sugar and bring the mixture to a boil over high heat. Reduce the heat to low, and then add the rice balls to the saucepan and gently simmer, stirring to ensure the rice balls don’t stick to each other. Continue simmering the rice balls until they are cooked through and become pleasantly chewy, 3–5 minutes. As the rice balls simmer, they will become ﬁrmer and expand slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the heat to high and return the liquid to a boil. As soon as the liquid boils, turn off the heat and stir in the drained tapioca pearls. Continue to stir until the tapioca becomes tender and translucent, 2–3 minutes. If the porridge becomes too thick for your liking, you can thin it out with more water or coconut milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the mangoes and serve the porridge warm.</p>"}]}