{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/2013-bakethebook-sweet%20benne%20wafers.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["benne wafers", "Cookies", "Lee Bros.", "sesame seeds", "southern sweets"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweet Benne Wafers", "link": "https://www.seriouseats.com/recipes/2013/02/lee-bros-sweet-benne-wafers-recipe.html", "description": "Addictively chewy, slightly caramelized and full of toasted sesame flavor, these sweet 'benne' wafer cookies <em><strong>Lee Bros. Charleston Kitchen</strong></em> will disappear as fast as you can turn them out.", "totalTime": "50 minutes", "recipeYield": "makes about 120 cookies", "recipeCategory": ["Bake the Book", "Cookies"], "recipeIngredient": ["1/2 cup sesame seeds", "1/4 cup plus 1 tablespoon all-purpose flour", "3/4 cup tightly packed light brown sugar", "1/2 teaspoon salt", "1/4 teaspoon baking soda", "2 tablespoons unsalted butter, cold", "1 large egg", "1/2 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Line a cookie sheet with parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a cast-iron skillet, toast the sesame seeds over medium-high heat, stirring them frequently in the pan with a wooden spoon, until they are the color of unpopped popcorn, about 5 minutes. Keep stirring for a minute more after removing from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour with the sugar, salt, and baking soda twice. Cut the butter into the dry ingredients with your fingertips or with a pastry blender until the mixture resembles coarse crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an electric mixer, beat the egg on medium until it stiffens, about 2 minutes. Add the dry flour mixture in three parts, beating until the batter is consistently smooth and lustrous, about 2 minutes. Add the toasted sesame seeds and vanilla, and beat on low speed just until the seeds are evenly incorporated. Transfer the batter to a pastry bag fitted with a small round tip or to a plastic bag with a tiny piece of its corner cut out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches of 30, pipe the batter in very small, ¼ teaspoon–size drops about 2 inches apart onto the cookie sheet. Bake until the cookies turn noticeably chestnut-brown and lacy, 4 to 6 minutes. Transfer the cookie sheet to a rack and cool until the cookies have stiffened, about 10 minutes, then transfer to a plate or open container to dry further. Repeat until all the cookies are baked, and let them cool completely before sealing the container. If the first batch isn’t crisp enough after 15 minutes of cooling time (they should be slightly chewy), pipe subsequent batches with slightly more batter and bake slightly longer to stiffen them. (Cookies will keep in a sealed container at room temperature about 4 days.)</p>"}]}