{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130122-237936-strawberry-almond-cheesecake.jpg", "author": {"@type": "Person", "name": "Stephanie Stiavetti"}, "recipeCuisine": "", "keywords": ["almond", "cake", "cheesecake", "let them eat", "strawberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Strawberry Almond Cheesecake", "link": "https://www.seriouseats.com/recipes/2013/01/strawberry-almond-cheesecake-recipe.html", "description": "This cheesecake is soft moist, and full of strawberry-almond flavor. A touch of crème fraîche makes for a gently tart kick.", "totalTime": "2 hours", "recipeYield": "serves 8 to 12", "recipeCategory": ["Cakes", "Fruit Desserts", "Let Them Eat...", "Nuts", "Strawberry"], "recipeIngredient": ["1 pound strawberries, halved (if using frozen, defrost them)", "1 1/2 cups sugar, divided", "1 1/2 cups almond flour", "6 tablespoons unsalted butter, 3 tablespoons melted, 3 tablespoons at room temperature", "2 pounds cream cheese, at room temperature", "1 cup crème fraîche, at room temperature", "3 eggs, at room temperature", "3 egg yolks, at room temperature", "2 teaspoons almond extract", "3 tablespoons flour", "1/2 teaspoon salt", "2 tablespoons lemon zest, from 1 lemon", "Chopped, toasted almonds for garnish", " ", "<strong>For the Topping</strong>", "1/2 pound strawberries, chopped coarsely ", "3 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the oven rack in the middle of your oven and preheat to 275°F. Spread berries on a baking sheet and sprinkle them with 3 tablespoons of sugar. Bake until the berries and sugar start to caramelize, about 1 hour. Watch them carefully after the first 30 minutes, removing them from the oven at any signs of burning (use your nose!). Once the berries are done, allow them to cool. Transfer the berries and all of their syrup to a food processor. Pulse until they have a coarsely chopped texture and set aside. Increase oven to 325°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine almond flour with 3 tablespoons melted butter and 1 tablespoon sugar, mixing well. Press firmly into the bottom of a 9-inch springform pan and bake for 10 minutes. Remove from oven and allow to cool while preparing the rest of the cheesecake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a large pot of water to boil on the stovetop. Add cream cheese, crème fraîche, and 3 tablespoons room temperature butter to the bowl of a stand mixer fitted with the paddle attachment. Beat on low speed until creamy and well mixed, about 1 minute. With the mixer running, slowly pour in the remaining sugar, beating until smooth and creamy, about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase mixer speed to medium-low. Add the eggs one at a time, beating until each is fully incorporated before adding the next one. Add egg yolks all at once, again beating until completely mixed. Add almond extract, flour, salt, and lemon zest, beating for another 30 seconds. Stop the mixer and fold in the strawberries with a spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan. Firmly rap the pan on a counter a few times to release any air bubbles. Allow the batter to rest for 5 minutes, then rap a few more times to force out any bubbles that were hiding deeper in the batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are using a cake pan with a removable bottom, securely wrap the bottom and sides of the pan in aluminum foil&mdash;large sheets of commercial foil work well for this, as they enrobe the entire pan with one sheet, preventing anything from leaking in or out. Place the cake pan in a large roasting pan and fill the roasting pan with enough boiling water to come 3/4 of the way up the sides of the cake pan. Slide the roasting pan into the oven and bake until center is barely set but still jiggles when shaken, about 90 minutes. Carefully remove the cake pan from the roasting pan and set it on a cooling rack. Allow the cake to cool in the pan for 3 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Topping:</strong> Combine chopped strawberries with sugar and toss until well mixed. Let sit for 30 minutes. If you want a smoother sauce, pulse a few times in the food processor. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cake is cool, release it from the sides of the springform pan. Slide the cake into the refrigerator and chill for 2 to 3 hours. Slice and serve, garnished with a spoonful of strawberry topping and a sprinkling of chopped toasted almonds.</p>"}]}