{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/20130709-258932-cherry-hand-pies.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "cherries", "cherry pie", "fruit desserts", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cherry Hand Pies", "link": "https://www.seriouseats.com/recipes/2013/07/cherry-hand-pies-recipe.html", "description": "These hand held cherry pies make for perfect take along picnic or barbecue fare.", "totalTime": "4 hours", "recipeYield": "Serves 8", "recipeCategory": ["American Classics", "Cherry", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["2 cups, stemmed and pitted cherries, roughly chopped (approximately 1 pound of cherries)", "1/4 cup plus 3 tablespoons sugar, divided", "2 teaspoons zest and 3 tablespoons juice from about 2 lemons", "3 tablespoons corn starch", "2 teaspoons vanilla extract", "1 large egg, lightly beaten", "One half recipe <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">Easy Pie Dough</a> (or your favorite butter pie crust)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium sauce pan combine cherries, 1/4 cup sugar, and lemon zest. In a small bowl whisk together lemon juice, corn starch, and vanilla. Pour mixture over cherries and stir to incorporate. Heat cherries over medium high heat, stirring frequently until juices come together to form thick sauce. Remove from heat, cover and refrigerate until cool, at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cut out eight 6-inch squares of parchment paper. Divide pie dough into eight equal balls. On a well floured surface, roll out the dough balls into 5-inch rounds. Place each round on a piece of parchment paper, stacking them together so they don't stick. Refrigerate pie rounds for 30 minutes to 1 hour to allow them to firm up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large baking sheet with parchment paper. Remove the dough from the refrigerator. Place 2 to 2 1/2 tablespoons cooled cherry filling in the center of each round, then fold in half to enclose and crimp the edges to seal. Brush the outside of the pies with egg and sprinkle with remaining 3 tablespoons sugar. Make 3 small cuts on the top of the pies to vent. Refrigerate prepared pies for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set rack to the middle position and preheat oven to 350°F. Bake pies until golden brown, 25 to 30 minutes. Remove from oven and let cool in the pan for 2 minutes then transfer to a wire rack to cool completely.</p>"}]}