{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131016-preserved-cidersyrup-overhead.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["apple", "cider", "preserve", "syrup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Boiled Cider Syrup", "link": "https://www.seriouseats.com/recipes/2013/10/boiled-cider-syrup.html", "description": "Once a New England staple, this simple cider syrup is a versatile addition to any pantry of home-canned goodies.", "totalTime": "10-12 hours", "recipeYield": "five 12 ounce jars", "recipeCategory": ["Apple", "Condiments and Sauces", "Preserved"], "recipeIngredient": ["3 gallons minimally-processed apple cider"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare boiling water canner and sterilize 5 12-ounce jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids and rings to sit in hot water until you need them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour cider into your largest heavy-bottomed, non-reactive pot. Insert chopstick into cider until it touches the bottom of the pot. Using a pen or a paring knife, mark or notch the chopstick at the level of the cider. Then, removing the chopstick from the pot, measure from your first mark (the cider level at the start) and the end of the chopstick (the bottom of the pot) and make a second mark or notch at the halfway point. Make a mark/notch at the 1/3 point as well. The marks on the chopstick will serve as visual cues to help you see how much your cider has reduced. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring cider to a boil over high heat and then reduce to medium-low. Simmer, uncovered, stirring occasionally until thoroughly reduced, 5-8 hours, depending on your stove. Check the cider level against your chopstick measurements regularly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cider is finished when it has reduced to one third of its original volume, and it coats the back of a spoon. When cider is finished, remove from heat and strain, in batches, through a paper coffee filter or a fine sieve lined with a clean, dampened dishtowel.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour cider into prepared jars, leaving a quarter inch of headspace. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary, and, over high heat, bring the water back up to a boil. Once the water boils, set a timer for five minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After ten minutes, turn off heat, and allow jars to sit in water for five additional minutes. Then, using a jar lifter, remove the jars to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once jars have reached room temperature, remove rings and test that all lids have sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight.</p>"}]}