{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131120-274507-dinner-tonight-sauteed-scallops-indian-spinach.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["scallop", "seafood", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seared Scallops With Indian Spinach", "link": "https://www.seriouseats.com/recipes/2013/12/seared-scallops-indian-spinach-recipe.html", "description": "Think of this recipe as part Indian and part classic steakhouse. At the base is a fairly traditional Indian spinach recipe, like one for saag paneer&mdash;just, you know, without the paneer. On top are sautéed scallops that are buttery but still supple, with a slight sweetness.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dinner Tonight", "Mains", "Other Seafood", "Sides", "Spinach"], "recipeIngredient": ["4 tablespoons canola oil, divided ", "1 teaspoon cumin seeds ", "1 medium red onion, chopped (about 1 cup)", "2-inch piece fresh ginger, peeled, minced (about 2 tablepoons)", "3 medium garlic cloves, minced (about 1 tablespoon)", "1/4 teaspoon cayenne pepper", "3 teaspoons garam masala, divided  ", "1/2 teaspoon ground turmeric ", "1/2 teaspoon salt, plus more to season scallops  ", "1 1/2 pounds fresh spinach leaves, roughly chopped", "12 large scallops", "Freshly ground black pepper", "2 tablespoons heavy cream "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of canola oil in a medium-saucepan over medium heat until shimmering. Add cumin seeds and stir constantly with a wooden spoon until they start to change color, about 15 seconds. Add red onion, ginger, and garlic and cook, stirring occasionally, until onion starts to brown, about 7 minutes. Stir in the cayenne, 2 teaspoons garam masala, turmeric, and salt, and cook until fragrant, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a handful of spinach leaves and stir until wilted and bright green. Continue adding a handful at a time until all the spinach has been added. Reduce heat to medium-low, and simmer until spinach releases its liquid to form a sauce, 5 to 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, dry the scallops on paper towels and season both sides with salt and pepper. Heat remaining two tablespoons of oil in a large non-stick skillet over medium-high heat. When shimmering, add the scallops and cook until golden brown on the bottom, about three minutes. Flip each and cook until brown on the other sides, about 2 minutes. When done, set scallops aside on a plate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat for the spinach, and stir in the remaining teaspoon of garam masala and then heavy cream. Divide spinach mixture between four plates. Top each with 3 scallops. Serve immediately. </p>"}]}