{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20120201-bakethebook-almondcrunchies1.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["almond", "Back in The Day Bakery Cookbook", "Bake the Book", "cardamom", "Cookies", "meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Almond Crunchies", "link": "https://www.seriouseats.com/recipes/2013/02/almond-crunchies-cardamom-meringue-cookies-recipe.html", "description": "Almond crunchies are a cross between biscotti and meringue cookies, flavored with aniseed and cardamom. Thick, whipped egg whites give them an addictively crunchy, chewy texture that shatters and melts in your mouth.", "totalTime": "40 minutes", "recipeYield": "makes 24 cookies", "recipeCategory": ["Bake the Book", "Cookies", "Nuts"], "recipeIngredient": ["3 large eggs", "1 teaspoon pure almond extract", "One 1-pound box (4 cups) confectioners’ sugar", "2 cups unbleached all-purpose flour", "2 teaspoons baking powder, preferably aluminum-free", "1 teaspoon ground cinnamon", "1/2  teaspoon aniseeds, crushed", "1/4 teaspoon ground cardamom", "3/4 cup blanched almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two cookie sheets with parchment paper.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the whisk attachment (or in a large mixing bowl, using a handheld mixer), beat the eggs on high speed until thick and frothy, 8 to 10 minutes. Add the almond extract. If using a stand mixer, transfer the egg mixture to a medium bowl, and clean and dry the mixer bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of the stand mixer fitted with the paddle attachment (or in another large bowl, if using a handheld mixer), combine the confectioners’ sugar, flour, baking powder, cinnamon, aniseeds, and cardamom and mix on low speed until blended. Add the egg mixture, increase the speed to medium, and beat, scraping the sides of the bowl as necessary, until combined. Reduce the speed to low and mix in the almonds until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a large ice cream scoop or a 1/4-cup measuring cup to form the cookies and place on the prepared cookie sheets about 2 inches apart. Lightly press each cookie into a flattened disk. Cover the sheets with plastic wrap and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To bake, position a rack in the lower third of the oven and preheat the oven to 325°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cookies from the refrigerator and remove the plastic wrap. Bake the cookies, one sheet at a time, for 15 to 20 minutes, until the edges of the cookies are golden; rotate the pan halfway through the baking time. Cool the cookies completely on wire racks. Store in an airtight container for up to 3 days at room temperature.</p>"}]}