{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130611-burger-week-grilled-burger-variations-13.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "burger", "burger recipes", "burger week", "cheeseburger", "cherry peppers", "sandwich", "The Burger Lab", "The Food Lab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Hot and Smoky Cheeseburgers With Bacon and Pickled Cherry Pepper Relish", "link": "https://www.seriouseats.com/recipes/2013/06/hot-and-smoky-cheeseburgers-bacon-pickled-cherry-pepper-relish-recipe.html", "description": "An homage to the Smoke Stack burger from Shake Shack, this big, fat, grilled burger gets topped with American cheese, crisp bacon, grilled onions, and a spicy and tangy bacon and pickled cherry pepper relish.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Bacon", "Beef", "Burger", "Mains", "Sandwiches", "The Burger Lab", "The Food Lab"], "recipeIngredient": ["1 1/2 cups pickled cherry peppers, seeds and stems removed, roughly chopped", "1 pound sliced bacon, divided", "1/2 cup sugar", "20 ounces freshly ground beef, divided into four 5-ounce patties", "Kosher salt and freshly ground black pepper", "4 thick slices yellow or white onion", "4 slices American or cheddar cheese", "Shredded iceberg lettuce and pickles (if desired)", "4 toasted hamburger buns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400°F. Arrange half of bacon on a rimmed baking sheet and cook in oven until crisp and well browned, about 15 minutes. Drain on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place cherry peppers in the work bowl of a food processor. Pulse until finely chopped, 8 to 10 short pulses. Cut remaining half of bacon into 1/2-inch pieces. Heat bacon in a 12-inch non-stick or cast iron skillet over medium heat. Cook, stirring, until crisp, about 8 minutes. Add sugar and chopped cherry peppers and their juices. Cook until juices are mostly evaporated and pepper-bacon mixture has a chunky, relish-like texture, about 8 minutes. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, season burger patties generously with salt and pepper and cook burgers to desired doneness on a hot grill or in a skillet on the stovetop, 125°F for medium rare or 135°F for medium, topping with cheese for last minute of cooking. Let burger patties rest for 5 minutes off heat. While burgers are resting, season onions with salt and pepper and cook on hot grill or in a lightly oiled skillet until tender and well browned on both sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place shredded lettuce on bottom buns and top with burger patties. Top with bacon-cherry pepper relish, cooked onion slices, and bacon. Close burgers and serve immediately.</p>"}]}