{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130319-244480-GFTues-OatmealCookies.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["Cookies", "gluten free"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Whole Grain Gluten-Free Oatmeal Cookies", "link": "https://www.seriouseats.com/recipes/2013/03/whole-grain-gluten-free-oatmeal-cookies-recipe.html", "description": "Thin and crunchy whole grain oatmeal cookies.", "totalTime": "90 minutes", "recipeYield": "makes 48 cookies", "recipeCategory": ["Cookies", "Gluten-Free", "Gluten-Free Tuesday"], "recipeIngredient": ["3/4 cup (3 ounces) sorghum flour", "1/4 cup (about 3/4 ounce) oat flour*", "2 tablespoons ground flax", "1 teaspoon salt", "1 teaspoon baking powder", "3/4 teaspoon ground cinnamon", "1/4 teaspoon ground nutmeg", "1/8 teaspoon ground cloves", "1 cup (8 ounces) butter, softened", "1 cup (8 ounces) dark brown sugar", "1/2 cup (3.5 ounces) turbinado sugar", "1 large egg", "2 teaspoons vanilla extract", "3 cups gluten-free oats", "1 1/2 cups chocolate chips, raisins, chopped dried fruits, or nuts (or a combination) ", "*To make oat flour, blend whole oats in a food processor until fine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position. Preheat oven to 325&deg;F. Line two baking sheets with parchment paper. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, whisk together sorghum flour, oat flour, ground flax, salt, baking powder, ground cinnamon, ground nutmeg, and ground cloves. In bowl of stand mixer fitted with paddle attachment, combine butter and sugars. Cream on medium speed until thick paste forms, about 2 minutes. Stop mixer and scrape down sides and bottom of bowl. Add egg and vanilla. Turn mixer on to medium speed and blend until light and fluffy, about 1 minute. Stop mixer. Scrape down bottom and side of mixer. Mix for 1 additional minute. Stop mixer. Add whisked dry ingredients and oats. Mix until thick dough forms, about 1 minute. Turn off mixer. Add chocolate chips. Turn mixer on to low. Mix until combined, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a tablespoon measure, drop heaping tablespoons of dough onto prepared baking sheet, 24 per sheet. Lightly press down dough with palm on your hand but don’t flatten cookies. Bake 1 tray at a time until golden brown, about 20 minutes. Cool for five minutes on baking pan. Transfer cookies to wire rack to cool completely. Repeat, baking second batch on cool baking sheet, until all dough is used. Store cooled cookies in sealed container for up to 1 week. </p>"}]}