{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131109-273045-TurkeyEggStrata2.JPG", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["brunch", "egg", "strata", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Turkey and Egg Strata", "link": "https://www.seriouseats.com/recipes/2013/11/make-ahead-turkey-and-egg-strata-leftover-recipe.html", "description": "This recipe is both a chef and crowd pleaser; little work for you, and lots of delicious eggy brunch for your guests. Somewhere between a bread pudding and a frittata, the custardy casserole gets layers of bread, meat, vegetables and cheese, lasagna-style.", "totalTime": "9 hours 15 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Mains"], "recipeIngredient": ["Unsalted butter or nonstick spray, for greasing", "4 cups 1-inch crustless bread cubes (day or two old Italian bread is ideal)", "About 1 1/2 cups cooked greens, such as spinach, chard or kale", "About 1 1/2 cups cooked mushrooms or other vegetable of choice", "About 1 1/2 cups shredded or diced roasted turkey meat", "1 1/2 cups shredded Gruyere or other cheese ", "1 cup milk", "1 1/2 tablespoons fresh minced chives", "1 1/2 tablespoons Dijon mustard", "6 eggs", "Kosher salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a medium baking dish, 2-quart casserole dish or 2 smaller loaf pans. If using something shallow, layer twice; if deeper, layer three times if possible. Spread loose layer of bread cubes down and sprinkle greens, mushrooms, turkey, then cheese evenly over. Repeat 1 or 2 more times. Keep in mind strata will puff up so don't overfill vessel. Whisk together milk, chives, mustard, eggs, 1/2 teaspoon salt and 1/4 teaspoon black pepper. Pour evenly over bread and vegetables; the bread and vegetables should not be submerged. Wrap tightly in plastic and refrigerate for 8 hours or up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees F. Let strata come to room temperature, then set on baking sheet to catch any drips and bake until risen like a frittata and lightly golden on top, 50 to 60 minutes. </p>"}]}