{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131204-275875-dinner-tonight-spaghetti-with-tomato-sauce-and-eggplant.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Italian", "keywords": ["easy", "eggplant", "Italian", "pasta alla norma", "quick", "spaghetti", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spaghetti With Tomato Sauce and Pan-Fried Eggplant", "link": "https://www.seriouseats.com/recipes/2013/12/spaghetti-tomato-pan-fried-eggplant-recipe.html", "description": "At its base, this is just a simple spaghetti and tomato sauce recipe&mdash;a satisfying classic for sure, but not exactly the most exciting dinner of the week. But if you add a handful of crispy slices of pan-fried eggplants on top, along with a shower of parmesan cheese, and you have a meal with a variety of textures and some real heft.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dinner Tonight", "Eggplant", "Italian", "Mains", "Pasta", "Tomato", "Vegetarian"], "recipeIngredient": ["2 tablespoons plus 1/2 cup extra-virgin olive oil, divided", "1 medium onion, chopped (about 1 cup)", "2 medium cloves garlic, minced (about 2 teaspoons)", "1 (28-ounce) can plum tomatoes", "1 teaspoon sugar ", "Kosher salt and freshly ground black pepper", "1 pound spaghetti", "4 medium Japanese eggplants (about 1 pound) ends trimmed, thinly sliced ", "Grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil over high heat. Meanwhile, heat 2 tablespoons olive oil in a medium-sized saucepan over medium heat until shimmering. Add onion and cook, stirring until soft, 3 to 4 minutes. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add tomatoes and their juices, and use a potato masher or the back of a wooden spoon to break up the tomatoes into small pieces. Cook, stirring occasionally, until tomatoes have reduced into a thick sauce, 15 to 20 minutes. Remove from heat. Blend with an immersion blender or a countertop blender in batches. Add sugar, and season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While tomato sauce cooks, heat 1/2 cup of olive oil in a large 12-inch non-stick skillet over medium heat until shimmering. Spread the eggplant slices out in the skillet. The pieces will immediately soak up most of the oil, but will eventually expel the oil and start to brown. Stir occasionally until eggplants slices are browned on all sides, and just starting to crisp, 8 to 10 minutes. Remove slices with a slotted spoon and drain on paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook spaghetti in boiling water according to package directions. When almost done, reserve 1/4 cup of pasta water. Drain pasta in a colander, and immediately transfer to the pot with the tomato sauce. Turn heat to medium, add the pasta water, and toss pasta until it is evenly coated with the sauce. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide pasta between four plates. Top each with a quarter of the fried eggplant slices and sprinkle generously with freshly grated parmesan. Serve immediately</p>"}]}