{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/092713-267157-cook-the-book-farmhouse-cream-cheese.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["cheese", "Cook the Book", "cream", "cream cheese", "dairy", "mary karlin", "milk"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Farmhouse Cream Cheese from 'Mastering Fermentation'", "link": "https://www.seriouseats.com/recipes/2013/09/farmhouse-cream-cheese-from-mastering-fermentation.html", "description": "If you have never made your own cream cheese, this week is the week to start. And you should do so with <strong><a href=\"http://marykarlin.com/\" target=\"_blank\">Mary Karlin</a></strong>'s recipe in <em><a href=\"http://www.amazon.com/Mastering-Fermentation-Recipes-Cooking-Fermented/dp/1607744384/?tag=serieats-20\">Mastering Fermentation</a></em>. Made with a one-to-one ratio of cream to whole milk, this creamy spread is unabashedly rich and totally worth every bite.", "totalTime": "About 24 hours", "recipeYield": "About 1 pound", "recipeCategory": ["Cheese", "Condiments and Sauces", "Cook the Book"], "recipeIngredient": ["1 quart pasteurized whole, 2 percent, or 1 percent cow milk, at room temperature for 1 hour", "1 quart pasteurized heavy cream, at room temperature for 1 hour", "1/4 teaspoon mesophilic starter (preferably MA 4001)", "2 drops calcium chloride, diluted in 2 tablespoons cool nonchlorinated water", "3 drops rennet, diluted in 2 tablespoons cool nonchlorinated water", "1 teaspoon kosher salt (preferably Diamond Crystal)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a water-bath system by nesting a 4-quart pot inside a 6-quart pot and pour water into the large pot to come about halfway up the side of the smaller pot. Remove the smaller pot and place the large pot over low heat. When the water reaches about 85 degrees, put the smaller pot back in the water to warm slightly, then pour the milk and cream into the smaller pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly heat the milk mixture to 75 degrees over low heat. This should take 10 to 15 minutes. Take the entire water bath off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the starter over the milk and let it hydrate for 5 minutes. Whisk the starter into the milk, using an up-and-down motion to distribute thoroughly. Add the diluted calcium chloride and gently whisk in, using an up-and-down motion, for 1 minute, then add the rennet in the same way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the smaller pot and leave in the water bath. Leave at room temperature until the curds are firm, about 12 hours. The milk protein will coagulate into solid curds; the liquid whey will be almost clear and light green in color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a strainer with dampened fine-weave butter muslin or cheesecloth, leaving excess cloth hanging over the sides of the strainer. Gently ladle the creamy curds into the prepared strainer. Tie the corners of the cloth together to create a draining sack, slip a wooden spoon handle through the knot, and hang over a deep cooking pot or bucket to drain until the desired consistency is achieved, 6 to 8 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the curds from the sack, place in a bowl, and toss with the salt. Stir or knead to combine. Form into a brick or roll into a log, wrap with plastic wrap or store in a covered container, and keep refrigerated for up to 2 weeks.</p>"}]}