{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130808-indian-chole-masala-edit.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["chickpea", "curry", "Indian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "5"}, "name": "Indian Spiced Chickpea Gravy (Chole)", "link": "https://www.seriouseats.com/recipes/2013/08/indian-spiced-chickpea-gravy-chole.html", "description": "Chole, Indian chickpea curry, is a wonderful side or main. It's usually eaten with deep fried bread or with a steaming hot plateful of white rice.", "totalTime": "12 hours 20 minutes", "recipeYield": "serves 2", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Beyond Curry", "Indian", "Legumes", "Mains", "Vegetarian"], "recipeIngredient": ["1 cup dried chickpeas (or two 15-ounce cans chickpeas, drained and rinsed, see note)", "1 black cardamom pod", "1 inch piece cinnamon ", "1 bay leaf", "6 peppercorns", "2 teaspoons cumin seeds", "3 teaspoons coriander seeds", "1 teaspoon fennel seeds", "2 dry kashmiri chillis", "2 tablespoons vegetable oil", "1 medium onion, finely chopped (about 1 cup)", "1 teaspoon ginger-garlic paste (see note)", "2 large tomatoes", "1 teaspoon amchur or dry mango powder", "2 small Indian or Thai green chilies, split in half", "Kosher salt", "2 tablespoons minced fresh cilantro leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chickpeas in a medium bowl and cover with warm water by 2 inches. Let soak for 12 hours. Transfer soaked chickpeas and their liquid to a pressure cooker. Seal and heat over medium-low heat to low pressure. Cook until chickpeas easily break down, about 25 minutes after they come to pressure. Release pressure and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat a large cast iron skillet over medium heat. Add black cardamom, cinnamon, bay leaf, peppercorns, cumin seeds, coriander seeds, fennel seeds, and Kashmiri chillies. Cook, stirring, until fragrant, about 5 minutes. Allow to cool and then grind in a coffee grinder till completely powdered. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in the same pan on medium heat until shimmering. Add the onions and cook, stirring, until translucent, about 5 minutes. Add the ginger-garlic paste and stir until the raw smell of the paste disappears, about 2 minutes. Add the tomatoes and cook, stirring, until the tomatoes break down and the oil separates, about 10 minutes. Add dry mango powder and green chillies. Stir until fragrant, about 1 minute. Add the powdered spice blend and stir until fragrant. At this stage, add a few teaspoons of water in case the spices stick to the bottom of the pan as they tend to burn easily. Cook, stirring frequently, about 5 minutes. Add the boiled chickpeas with the water they were boiled in, stir, and simmer for 10 minutes so that the chickpeas absorb the spices. Garnish with coriander leaves, onion rings and serve with rotis, bhaturas (deep fried bread), or rice.</p>"}]}