{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130131-239055-SBowl-BBQChickenBiscuit.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["barbecue", "chicken", "party recipes", "sandwich", "Super Bowl"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Barbecue Chicken Biscuit Pull-Apart with Buttermilk Ranch", "link": "https://www.seriouseats.com/recipes/2013/02/barbecue-biscuit-pull-apart-sandwich-recipe.html", "description": "What's better than buffalo wings? All the wing fixin's--saucy chicken, cool ranch dressing and celery sticks--eaten between two buttermilk biscuits. The homemade buttermilk ranch dressing is well worth the minimal extra effort.", "totalTime": "2 hours 15 minutes", "recipeYield": "serves 8 to 12", "recipeCategory": ["Chicken", "Sandwiches"], "recipeIngredient": ["2 pounds premade biscuit dough", "2 1/2 teaspoons paprika", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon cayenne pepper ", "2 1/2 to 3 pounds skinless bone-in chicken thighs (about 8 thighs), washed and patted dry ", "2 tablespoons canola oil", "1 medium yellow onion, diced", "3 medium cloves garlic, minced", "3/4 cup beer", "1/4 cup cider vinegar", "1 cup prepared BBQ sauce", " ", "<strong>For the Buttermilk Ranch</strong>", "3/4 cup mayonnaise", "1/4 cup sour cream", "2 tablespoons fresh chopped chives", "1 medium clove garlic, diced, mashed into paste with knife or fork", "1/4 cup buttermilk", "1/4 cup celery leaves, roughly chopped", "Kosher salt and freshly ground black pepper ", " ", "2 stalks celery, sliced (about 3/4 cup) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unroll biscuit dough. If not precut, cut into 16 circles. Smoosh together 2 sets of 8 circles on a baking sheet into 2 rows so they are smash up against each other. Bake as directed, until golden brown. Biscuits should be well done for maximum sturdiness. Let cool 5 minutes on baking sheet, then carefully transfer to wire rack to cool completely, before carefully slicing horizontally with serrated knife. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325 degrees F. Mix together paprika, salt, black pepper and cayenne. Sprinkle evenly on both sides of chicken. Heat 1 tablespoon oil in large Dutch oven or heavy-bottomed high-sided skillet over high heat until oil shimmers. Add half the chicken, bone-side up, and sear, without touching, until browned, 3 minutes. Flip and sear for 1 minute on bone side. Transfer to a plate. Repeat with remaining oil and chicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn heat to medium. Add onions and saute until softened, 3 minutes. Add garlic and saute 1 minute. Deglaze with beer and vinegar, scraping up browned bits on bottom of pan. Simmer a few minutes to cook down liquid. Return all chicken to pan, overlapping if needed. Add BBQ sauce; it should come about halfway up chicken. Bring back to a simmer; cover and transfer to the oven. Braise until chicken is tender and falling away from bone, about 1 hour 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk together mayonnaise, sour cream, chives and garlic. Pour in buttermilk and whisk to combine. Season with salt and pepper; fold in celery leaves. Refrigerate until ready to use. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is tender, remove from sauce. Return sauce to high heat, and simmer until thickened, about 10 minutes. When chicken is cool enough to handle, shred using 2 forks or tongs. Mix chicken into sauce and cook for 1 minute to heat through. To serve, spoon buttermilk ranch onto bottoms and tops of biscuits. Top bottom halves with chicken, and sprinkle celery over. Serve topped with top biscuit sheet so biscuits can be pulled out to eat. </p>"}]}