{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130104-nasty-bits-chicharrones-guisados-primary.jpg", "author": {"@type": "Person", "name": "Chichi Wang"}, "recipeCuisine": "Latin American", "keywords": ["chicharrones", "Chicharrones Guisado", "cinco de mayo", "cracklings", "latin", "pork", "pork rinds", "The Nasty Bits"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicharrones Guisados (Stewed Fried Pork Rinds)", "link": "https://www.seriouseats.com/recipes/2013/01/chicharrones-guisados-stewed-fried-pork-rinds-recipe.html", "description": "Deep fried pork rinds get simmered in a tomatillo and tomato-based sauce.", "totalTime": "2 1/2 hours", "recipeYield": "serves 4 to 6 as a main course", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Latin American", "Pork", "The Nasty Bits"], "recipeIngredient": ["2 tablespoons neutral cooking oil such as vegetable or canola", "1 medium onion, chopped medium (about 1 cup)", "4 medium cloves of garlic, minced (about 4 teaspoons)", "2 teaspoons dried Mexican oregano", "1 teaspoon ground cumin", "1 1/2 pounds tomatillos (8 to 10 small), husks removed, quartered", "3 medium canned or fresh plum tomatoes (such as Roma or San Marzano), cut into quarters", "1 serrano pepper, roughly chopped", "2 canned chipotle pepper in adobo sauce", "1 cup of chopped fresh cilantro leaves and fine stems, plus more to garnish", "1 quart (4 cups) homemade or store-bought low-sodium chicken stock (or water)", "Kosher salt and freshly ground black pepper", "Queso fresco to garnish", "Mexican-style crema to garnish (optional)", "5 ounces store-bought fried pork rinds (chicharrones)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a medium pot over medium-high heat until shimmering. Add onions and cook, stirring occasionally, until onions are starting to brown, about 8 minutes. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add oregano and cumin and cook, stirring constantly, until fragrant, about 30 seconds. Add tomatillos, tomatoes, serrano pepper, and chipotle pepper. Scrape up any browned bits from bottom of pan and reduce heat to medium. Continue to cook, stirring occasionally, until tomatillos and tomatoes are softened and their juices have reduced to a thick sauce-like consistency. Add 2 cups chicken stock (or water), bring to a simmer, and simmer for 5 minutes. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mixture to a food processor. Add cilantro and process until mostly smooth, with an oatmeal-like consistency. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the puréed sauce back to the pot. Add chicharrones and bring sauce to a simmer. Simmer until the chicharrones are tender, 10 to 15 minutes, adding additional stock or water as necessary to adjust the consistency of the liquid. Serve with choice of garnishes and staple (such as tortillas, rice, or sopes).</p>"}]}