{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130912-preserved-plumverbena-toast.JPG", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["Jam", "Plum", "verbena"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Plum and Lemon Verbena Jam", "link": "https://www.seriouseats.com/recipes/2013/09/roasted-plum-lemon-verbena-jam-recipe.html", "description": "Take advantage of cooling temperatures by roasting plums for this late-summer jam.", "totalTime": "1 1/2 hours", "recipeYield": "Makes 5 to 6 half-pint jars", "recipeCategory": ["Condiments and Sauces", "Plum", "Preserved"], "recipeIngredient": ["2 to 3 sprigs fresh lemon verbena", "2 cups granulated sugar, divided", "20 to 25 plums (about 5 1/2 pounds, whole)", "2 tablespoons low-sugar pectin", "2 tablespoons juice from 1 to 2 lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strip verbena leaves from stems and place leaves in a tight-sealing container with 1 cup of sugar. Allow to sit at least overnight and up to several weeks to infuse flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F and prepare boiling water canner. Sterilize 6 half-pint jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids and rings to sit in hot water until you need them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and quarter plums, removing pits. Toss plum quarters with infused sugar and verbena leaves and spread in a single layer on a sheet pan. Roast, uncovered, until plums have softened and begun to release juice, about 30 minutes..</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When plums and verbena are finished roasting, place them in a heavy-bottomed saucepan or Dutch oven, along with lemon juice. Bring to a boil over high heat. Stir together remaining sugar and pectin in a small bowl, then stir mixture into Dutch oven and return to a boil. Cook until the mixture registers 220&deg;F on a candy or instant read thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off heat and skim any foam with a spoon. Ladle jam into prepared jars, leaving a quarter inch of head space. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary, and, over high heat, bring the water back up to a boil. Once the water boils, set a timer for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 10 minutes, turn off heat, and allow jars to sit in water for f5additional minutes. Then, using a jar lifter, remove the jars to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once jars have reached room temperature, remove rings and test that all lids have sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight.</p>"}]}