{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/04/041813-248874-SeriousEats-Sunday-Supper-TurkishMeatballsB.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["beef", "cucumber", "kofte", "meatballs", "skewer", "Sunday Supper", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Grilled Beef Kebabs With Yogurt-Mint Sauce and Onion Salad", "link": "https://www.seriouseats.com/recipes/2013/04/grilled-beef-meatballs-yogurt-mint-sauce-onion-salad-recipe.html", "description": "Grilled ground beef kebabs are served with traditional cucumber yogurt and onion salad accompaniments.", "totalTime": "2 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Beef", "Cucumber", "Mains", "Sunday Supper"], "recipeIngredient": ["<strong>For the Kebabs:</strong>", "2 large white onions, divided", "1 pound ground beef", "3 medium cloves minced garlic (about 1 tablespoon), divided", "1 large egg, lightly beaten", "5 1/2 tablespoons minced flat-leaf parsley, divided", "1 teaspoon ground cumin", "1 1/2 tablespoons ground sumac (see note), divided", "1/2 teaspoon ground allspice", "1/8 teaspoon ground cinnamon", "1 teaspoon dried mint", "1 teaspoon ground hot pepper, such as Aleppo", "Kosher salt and freshly ground black pepper", "1 jar pickled banana peppers", "Middle Eastern chili sauce or Sriracha", "1 package pita", "&nbsp;", "<strong>For the Yogurt Sauce:</strong>", "1 1/2 cups Greek yogurt", "1 medium cucumber, peeled, grated and squeezed to remove excess liquid", "1 1/2 tablespoons olive oil", "3 1/2 tablespoons lemon juice from about 2 lemons, divided", "2 tablespoons minced fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Kebabs</strong>: Grate one onion using the large side of a box grater. Add grated onion, beef, 2 cloves garlic and egg to the bowl of a food processor and pulse to combine. Add 2 1/2 tablespoons parsley, cumin, 1 tablespoon sumac, allspice, cinnamon, mint and 1 teaspoon hot pepper. Season with 1/2 teaspoon each kosher salt and black pepper. Blend until meat mixture appears sticky and smooth and all spices are evenly distributed. Place a small amount on a plate and microwave for 10 seconds. Taste and add more salt to mixture to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium bowl with warm water. Divide the meat mixture into 6 portions. Wetting your hands with water as necessary to prevent sticking, form meat into cigars about 4 inches long. Thread each kebab onto a skewer, pinching the sides and flattening the meat and as you go. (This will help meat adhere to the skewer.) Chill meat in the refrigerator, covered, for at least an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Combine yogurt, cucumber, remaining garlic clove, olive oil, 1 1/2 tablespoons lemon juice and fresh mint to a medium bowl. Season with salt and black pepper. Stir to combine, cover and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice remaining onion and combine it with remaining 3 tablespoons of parsley, remaining 2 tablespoons of lemon juice and remaining 1/2 tablespoon sumac in a small bowl. Season with a generous pinch of salt. Stir to combine. Taste and adjust seasonings if needed. Cover and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the grill and cook, turning the skewers, until the meat is cooked through, about 8 or 9 minutes, until an instant read thermometer registers 155°F. When meat is almost finished cooking, place pita on the grill, flipping after 30 seconds, until warmed through. Remove skewers and pita from the grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve meatballs immediately with warm pita, peppers, yogurt sauce and onion salad. Pass hot sauce as a condiment.</p>"}]}