{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130611-steak-multiple-flip-tomato-cucumber-salad-recipe-09.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "cucumber", "grill", "olive oil", "steak", "tomato", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Strip Steak With Creamy Yogurt Sauce and Tomato-Cucumber Salad", "link": "https://www.seriouseats.com/recipes/2013/07/grilled-steak-creamy-yogurt-sauce-tomato-cucumber-salad-recipe.html", "description": "Thick-cut New York strip steaks grilled and served with a bright and crunchy tomato and cucumber salad with yogurt sauce.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Cucumber", "Father's Day", "Mains", "Quick Dinners", "The Food Lab", "Tomato"], "recipeIngredient": ["2 (2-inch thick) New York strip steaks, about 1 pound each (see note)", "1/2 pound cherry tomatoes, quartered", "1 cucumber, seeded, cut into 3/4-inch chunks", "Kosher salt and freshly ground black pepper", "1/2 cup fresh parsley leaves, divided", "1 cup Greek-style yogurt", "1 tablespoon juice from 1 lemon, divided", "3 tablespoons extra-virgin olive oil, plus more for serving", "Coarse sea salt, such as Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split each steak in half crosswise to form four 8-ounce steaks. Carefully press dry with paper towels and set aside on a plate. Combine tomatoes and cucumbers in a colander and season with salt and pepper. Set in sink or bowl to drain while you prepare the yogurt sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop 3/4 of the parsley and reserve remaining leaves. Combine chopped parsley, yogurt, 2 teaspoons lemon juice, and 2 tablespoons olive oil in a bowl. Stir to combine and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Season steaks generously with salt and pepper and place on cooler side of grill, cover, and cook with all of the vents open flipping and taking temperature every few minutes until steaks register 115°F for medium-rare or 125°F for medium on an instant read thermometer, 10 to 15 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer steaks to hot side of grill and cook, flipping frequently until a deep char has developed and internal temperature registers 125°F for medium-rare or 135°F for medium, about 2 minutes total. Transfer steaks to a cutting board and allow to rest for at least 5 minutes and up to 10. Proceed to step 6.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Alternatively, to finish indoors:</strong> Season steaks generously with salt and pepper. Heat 2 tablespoons vegetable or canola oil in a large stainless steel or cast iron skillet over high heat until shimmering. Add steak and cook, turning frequently, until an instant-read thermometer registers 120 to 125°F for medium-rare, reducing heat as necessary if steak smokes excessively or starts to burn. Transfer to a wire rack set in a rimmed baking sheet and allow to rest 5 to 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While steaks are resting, toss tomatoes, cucumbers, and remaining parsley leaves with remaining teaspoon lemon juice and tablespoon olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice steak, sprinkle with coarse sea salt, and serve immediately with yogurt sauce and cucumber-tomato salad. Drizzle with extra virgin olive oil just before serving.</p>"}]}