{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/237171-20130123-british-bites-scotch-broth.jpg", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["barley", "carrot", "lamb", "scotch broth", "soup", "stews"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Scotch Broth", "link": "https://www.seriouseats.com/recipes/2013/01/scotch-broth-recipe.html", "description": "Rich broth filled with bite-sized pieces of root vegetable and tender lamb, this hearty soup is much more than the name 'broth' implies. The essential elements of a scotch broth are lamb, barley, and root vegetables of various kinds, although many will include cabbage in that list as well. To me, Scotch broth is a root vegetable-based dish, with enough chunks of tender lamb to make it exciting, and a broth that is rich and flavorful.", "totalTime": "3 hours, or up to overnight", "recipeYield": "Serves 4 as a main course", "recipeCategory": ["British Bites", "Lamb", "Mains", "Soups and Stews"], "recipeIngredient": ["1 pound lamb shanks (about 2 medium shanks)", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable oil ", "2 bay leaves ", "3 medium cloves garlic ", "1 medium onion, finely chopped (about 1 cup)", "8 cups homemade or store-bought low sodium chicken broth", "2 medium carrots, finely diced (about 1 1/2 cups)", "1 medium parsnip, finely diced (about 3/4 cup)", "1 medium russet potato, finely diced (about 1 1/4 cups) ", "1/3 cup pearl barley ", "2 tablespoons finely chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season lamb shank with salt and pepper. Heat oil in a Dutch oven over high heat until lightly smoking. Add lamb shanks and cook, turning occasionally, until well browned on all sides, about 10 minutes total. Remove shanks and set aside. Add onions and cook, stirring constantly, until lightly softened, about 2 minutes. Add garlic and bay leaves and cook, stirring constantly, until fragrant, about 30 seconds. Add broth and return shanks to pot. Bring to a boil, reduce to a bare simmer, cover, and cook until lamb shanks are tender and meat is pulling away from the bone, about 2 hours. For best results, let broth cool completely overnight in refrigerator, scrape off fat, and return to heat the next day. Otherwise, skim fat with a ladle or large spoon and continue to step 2.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the shanks from the stock, and once cool enough to handle gently remove the meat from the bones and tear into bite-sized pieces. Reserve. Bring stock back to a simmer and add carrot, parsnip, potato, and pearl barley. Cook until barley is tender, about 25 minutes then return shredded meat to the pot. Season to taste with salt and pepper, stir in parlsey, and serve.</p>"}]}