{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/040113-246489-cook-the-book-rodrigo-style-fish.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "fish tacos", "fried fish", "pati jinich", "pati's mexican table", "rodrigo sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rodrigo-Style Fish (Pescado Rodrigo) from 'Pati's Mexican Table'", "link": "https://www.seriouseats.com/recipes/2013/04/rodrigo-style-fish-pescado-rodrigo-from-patis.html", "description": "Dredged in flour and pan-fried, the fish fillets in these tacos are nothing out of the ordinary. But add a generous drizzle of her citrusy-salty-herby sauce and you'll quickly be in fish taco heaven.", "totalTime": "20 minutes", "recipeYield": "serves 6", "recipeCategory": ["Cook the Book", "Deep Frying", "Mains"], "recipeIngredient": ["<strong>Sauce</strong>", "1/2 cup thinly sliced scallions (white and light green parts only)", "1/2 cup chopped cilantro leaves", "1/4 cup freshly squeezed lime juice", "1/4 cup olive oil", "2 tablespoons seeded (if desired) and chopped jalapeño or serrano chile, or to taste", "1 tablespoon Maggi sauce or soy sauce", "Kosher or coarse sea salt", "&nbsp", "6 tilapia fillets (about 6 ounces each), or other mild white fish fillets, such as sea bass, grouper, red snapper, or rockfish, rinsed and patted dry", "1/4 teaspoon kosher or coarse sea salt, or to taste", "Pinch of freshly ground black pepper, or to taste", "All-purpose flour", "Vegetable oil", "12 corn tortillas, warmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the sauce:</strong> In a small bowl, combine the scallions, cilantro, lime juice, olive oil, jalapeño, and Maggi sauce, and stir to mix well. Set aside for at least 15 minutes. Season with salt if necessary to taste before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the fish:</strong> Sprinkle the fish fillets with the salt and pepper. Spread flour on a large plate and coat each fillet thoroughly on both sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/4 inch of vegetable oil in a 12-inch skillet over medium-high heat until hot but not smoking. Add the fish, in batches to avoid crowding, and sear for about 3 minutes, until thoroughly browned on the bottom. Don’t fiddle with the fillets; let them brown completely so they release easily from the pan. Turn and sear for about 3 minutes on the second side. The fish is ready when the thickest part is cooked through and it flakes easily with a fork. Put the fish on a paper-towel-lined baking sheet and keep warm in a low (250°F) oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the fish to a platter and pour the sauce on top. Or you can do as I do and flake the fish and serve it drizzled with the sauce, ready to make tacos. Serve with corn tortillas.</p>"}]}