{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130110-235901-cook-the-book-beet-blini-salmon-mascarpone.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["appetizers", "blinis", "Cook the Book", "home made winter", "mascarpone", "pomegranate seeds", "salmon", "seafood", "smoked salmon", "yvette van boven"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Beet Blinis with Salmon Marinated in Star Anise Syrup from 'Home Made Winter'", "link": "https://www.seriouseats.com/recipes/2013/01/beet-blinis-with-salmon-marinated-in-star-anise-syrup-from-home-made-winter-recipe.html", "description": "Blinis make for an excellent nibble before dinner; the yeasty mini pancakes can cradle just about anything from cheeses to jams to luxe caviar. A sliver of smoked salmon and a dollop of mascarpone cheese may be at the very top of that list. Add roasted beets, star anise, and pomegranate seeds as <strong><a href=\"http://yvettevanboven.com/\">Yvette van Boven</a></strong> does in <em><a href=\"http://www.amazon.com/Home-Made-Winter-Yvette-Boven/dp/161769004X/?tag=serieats-20\">Home Made Winter</a></em>, and you'll have a gem of a dish on your table.", "totalTime": "24 hours", "recipeYield": "makes about 25 blinis", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Salmon"], "recipeIngredient": ["<strong>For the Salmon:</strong>", "1 tablespoon freshly ground black pepper", "2 tablespoons salt", "1/2 cup plus 1 tablespoon (200 g) honey", "6 star anise", "2 tablespoons soy sauce", "2 tablespoons white wine vinegar", "14 to 18 ounces (400 to 500 g) smoked salmon fillet with skin ", " ", "<strong>For the Blinis:</strong>", "1 envelope active dry yeast (1/3 ounce / 7 g)", "1 teaspoon sugar", "1 small cooked beet, peeled", "1 cup (125 g) all-purpose flour", "1/2 cup (125 ml) milk", "Pinch of salt", "2 eggs", "2 tablespoons (25 g) butter, melted, plus extra for the pan", " ", "<strong>And further:</strong>", "1/2 cup (100 g) mascarpone", "3 tablespoons pomegranate seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First, marinate the salmon:</strong> This should be done at least 1 day and ideally 2 days in advance. In a small saucepan over high heat, bring 1/2 cup (125 ml) water, the pepper, salt, honey, and star anise to a boil. Reduce the heat to low and simmer for about 15 minutes. Let cool, then stir in the soy sauce and vinegar. Pour the marinade into a bowl and add the salmon. Press so that the salmon is well covered. Cover the bowl and let the fish marinate in the fridge for at least 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The next day, make the blini batter:</strong> Combine the yeast and sugar with 3 tablespoons (50 ml) warm water and set aside for a few minutes. Chop the beet and collect 1 to 2 tablespoons of the pink liquid. Set the liquid aside. Purée the beet in a food processor, add the flour, and process to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the milk to lukewarm, then pour it into the yeast mixture. Turn on the food processor again and pour the milk mixture through the feed tube into the beet mixture. Add the salt, eggs, and melted butter. Set aside for at least 1 hour in a warm place to rise. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the pink liquid from the beets into the mascarpone and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, rinse the marinade from the salmon. Pat it completely dry and use a long thin knife to slice it diagonally into thin slices. Heat a nonstick sauté pan over medium heat. Melt 1 teaspoon butter in the pan and spoon about 2 tablespoons blini batter into the pan. Fry about 4 blinis at a time. Flip them with two forks when the holes form on top. Let drain on paper towels. Cover with a swirl of salmon, spread with a bit of pink mascarpone, and sprinkle with the pomegranate seeds.</p>"}]}