{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130327-245285-brisith-bites-braised-rabbit-parsnips.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["braise", "british bites", "parsnips", "rabbit"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Braised Rabbit with Parsnips", "link": "https://www.seriouseats.com/recipes/2013/03/british-bites-braised-rabbit-parsnips-recipe.html", "description": "Rabbit is a lovely, delicate meat that takes well to braising in a gently seasoned cooking liquid.  A mixture of just a few aromatics and mild herbs is the perfect thing to let the inherent flavor of rabbit shine.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Braising and Stewing", "British Bites", "Mains", "Other Meats"], "recipeIngredient": ["One whole rabbit (about 3 pounds) cut into pieces (or 3 pounds skinless chicken legs)", "Kosher salt and freshly ground black pepper", "5 tablespoons vegetable oil, divided", "2 medium onions, finely chopped (about 1 1/2 cups)", "2 medium cloves garlic, minced (about 2 teaspoons)", "8 sprigs thyme, divided", "2 bay leaves", "6 cups low sodium store-bought or homemade chicken stock", "1 pound parsnips, peeled and cut into pieces (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 325°F. Season rabbit (or chicken legs) generously with salt and pepper. Heat 3 tablespoons vegetable oil in a dutch oven or braising dish over medium-high heat until shimmering. Add meat and cook until browned on all sides, about 8 minutes total (cook in batches if meat does not fit in a single layer).  Remove from pan and reserve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion, garlic, and 4 sprigs thyme. Scraped brown bits off the bottom of the pan. Cook, stirring often, until the onion are translucent. Place meat back in the pan, then add bay leaves and stock.  Bring to a simmer then place in the oven and cook until the meat is tender, about 45 minutes. Remove from oven and increase oven temperature to 425°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick leaves off of remaining thyme. Toss the parsnips with remaining two tablespoons vegetable oil and thyme. Season with salt and papper. Transfer to a baking dish or rimmed baking sheet and roast until well browned, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, remove the meat from the braising liquid, then place braising dish on the stove over medium high heat. Simmer until the liquid is reduced by half, about 20 minutes. Strain out the aromatics and season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the meat from the bones and moisten with a few spoonfuls of reduced liquid. Serve meat with parsnips and remaining braising liquid passed tableside.</p>"}]}