{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130313-244129-chicken-hash-edit.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["brunch", "chicken", "chicken dinners", "harissa", "hash", "potatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Hash", "link": "https://www.seriouseats.com/recipes/2013/03/chicken-hash-recipe.html", "description": "Chunks of chicken and creamy Yukon Gold potatoes are stir fried with za'atar and spicy harissa.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Breakfast and Brunch", "Chicken", "Chicken Dinners", "Mains", "Potato"], "recipeIngredient": ["2 1/2 cups homemade or store-bought low-sodium chicken stock, divided", "1 pound skinless, boneless chicken breast or thighs, trimmed of visible fat", "4 Yukon Gold potatoes (18 to 22 ounces), peeled, cut into 1/2-inch cubes", "5 tablespoons olive oil, divided", "1 large onion, finely chopped (1 cup)", "Kosher salt and freshly ground black pepper", "3 medium cloves garlic, minced (about 3 teaspoons)", "2 tablespoons za'atar spice", "1/2 teaspoon paprika", "1/2 teaspoon tumeric", "1 teaspoon harissa, plus extra to serve on side", "1/3 cup chopped fresh parsley leaves", "4 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using chicken breasts, slice breasts on the bias so that they are of equal thickness. Heat 2 cups broth over medium heat in medium saucepan to simmer. Add chicken and gently simmer until cooked through, about 5 minutes. Transfer to plate. When cool, cut into 1/2-inch cubes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add potatoes to broth and add water (if necessary) to just cover. Bring to boil over medium high heat. Reduce heat to medium and simmer until potatoes are easily pierced with knife, about 10 minutes. Drain potatoes and reserve (discard any remaining potato-cooking liquid)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large non-stick skillet, heat 2 tablespoons oil over medium heat to shimmering. Add onion and 1/2 teaspoon salt. Cook, stirring, until onions have softened and are beginning to turn golden, 6 to 8 minutes. Add 1/2 teaspoon ground black pepper, garlic, za-atar, paprika, and tumeric, and cook until fragrant, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoon oil to pan. Stir in potatoes. Cook, stirring, until potatoes have browned, about 8 minutes. Stir in chicken, harissa, and remaining 1/2 cup broth. Cook, stirring, until broth has evaporated. Season to taste and stir in parsley.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In separate pan, heat remaining tablespoon oil to shimmering, and fry eggs. Serve with hash with extra harissa on the side.</p>"}]}