{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20130930-268035-apple-braised-chicken-edit2.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["apple", "chicken", "fall", "sage", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cider-Braised Chicken with Apples, Bacon, and Sage", "link": "https://www.seriouseats.com/recipes/2013/10/cider-braised-chicken-apples-bacon-sage.html", "description": "The flavors of hard apple cider, bacon, sage, and soft caramelized apples make this a winning dish for fall. The chicken is falling-off-the-bone tender and the stovetop braise keeps it simple.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Apple", "Chicken", "Chicken Dinners", "Mains", "Soups and Stews"], "recipeIngredient": ["4 whole chicken legs (about 2 pounds)", "2 tablespoons olive oil", "3 Granny Smith apples, peeled, cored, cut into 1/8-inch thick slices", "3 slices bacon, finely chopped", "2 shallots, minced (about 3 tablespoons)", "2 cups hard apple cider (see note)", "2 tablespoons whole grain mustard", "Kosher salt and freshly ground black pepper", "3 sprigs plus 1 tablespoon fresh sage leaves, divided", "1 tablespoon heavy cream", "1 tablespoon flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken legs dry with paper towel and season with salt and pepper. Heat oil in Dutch oven over over medium high heat until just smoking. Place chicken into pot, skin side down, and cook until well browned, about 5 minutes (use oil screen if splattering). Turn over and cook another 3 minutes. Transfer chicken to plate and pour off all but 2 tablespoons fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add apples and cook, stirring, until just softened and caramelized, about 5 minutes. Transfer apples to bowl and reserve. Add bacon and shallots to pot and cook until shallots have softened and bacon has rendered but not crisped, about 3 minutes (reduce heat if browning too quickly).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk in cider, scraping up browned bits on bottom of pot. Whisk in mustard, 3/4 teaspoon salt, and 1/2 teaspoon fresh ground black pepper. Nestle chicken (skin side up) and sage sprigs into liquid, and bring to a simmer. Cover, reduce heat to low, and gently simmer until chicken is cooked through and very tender, about 40 minutes (adjust heat to keep at gentle simmer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to serving plate. Whisk cream into cooking liquid and simmer 1 minute. Transfer 1/2 cup of the cooking liquid to a small bowl and whisk in flour, then return to pot. Bring to a boil to thicken. Stir in apples and chopped sage, and season to taste. Serve with mashed potatoes or egg noodles.</p>"}]}