{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130624-257009-chicken-rice-set-edit.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "Chinese", "keywords": ["chicken", "Chinese", "Hainanese chicken rice", "poultry", "rice", "singapore", "singapore stories", "singaporean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hainanese Chicken Rice Set", "link": "https://www.seriouseats.com/recipes/2013/08/hainanese-chicken-rice-set-recipe.html", "description": "Using homemade chicken stock as a soup as well as to cook your rice and veggies ties together this light and flavorful meal that is a true Singapore staple.", "totalTime": "2 hours 30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Chinese", "Mains", "Rice", "Singapore Stories"], "recipeIngredient": ["<strong>For the Chicken:</strong>", "3 pounds whole chicken, cut into 4 pieces (see note)", "2 tablespoons rice wine", "3 tablespoons soy sauce, divided", "Kosher salt", "1/8 teaspoon ground white pepper", "3-inch knob ginger, peeled and sliced", "3 scallions, roughly chopped", "2 pandan leaves, tied into knots, (optional, see note)", "1 tablespoon sesame oil", " ", "<strong>For the Rice:</strong>", "2 cups long grain rice, rinsed", " ", "<strong>For the Bok Choy:</strong>", "3 tablespoons vegetable oil", "4 medium shallots, peeled, sliced into thin rings (about 1 cup)", "1 pound baby bok choy, washed, trimmed, halved vertically", "Chili sauce to serve on the side", "Kecap manis to serve on the side (see note)", "1 cucumber, sliced", "1 bunch cilantro, stems and leaves chopped, to serve on the side"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chicken:</strong> Place chicken in large stock pot and add rice wine, 2 tablespoons soy sauce, 2 teaspoons salt, white pepper, ginger, green onions, and pandan leaves (if using). Cover chicken with water (10 to 12 cups).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat over medium-high heat to simmer. Reduce heat to a bare simmer and poach the chicken until just cooked through (155&deg;F) for breasts, (165&deg;F for legs), 35 to 50 minutes. Transfer chicken to plate. Stir sesame oil and remaining tablespoon soy sauce in a small bowl. When chicken is cool enough to handle, rub sesame sauce onto chicken. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain broth and continue to simmer over medium-low heat until reduced to approximately 9 cups (do not skim fat). Season to taste and let cool 15 minutes to allow the fat to rice to the surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Rice:</strong> Place 2 cups rice and 3 1/2 cups broth (use as much of the fat as possible from the broth) into rice cooker and cook rice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the bok choy:</strong> Heat oil and shallots in medium saucepan over medium heat, stirring, until deep golden brown, 3 to 5 minutes. Using slotted spoon, transfer shallots to small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3/4 cup broth to simmer over medium-high heat in 10-inch straight sided skillet with lid. Add bok choy and cover. Cook until just tender but still green, 8 to 10 minutes. Transfer to serving dish and sprinkle with shallots.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat remaining broth and ladle into bowls. Slice chicken meat into bite size portions and arrange on plate, spooning a small amount of broth over the top. Serve with rice, bok choy, sliced cucumber, cilantro, chili sauce, and kecap manis. </p>"}]}