{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130116-236658-cook-the-book-pan-fried-kimchi-dumplings.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["beef", "Cook the Book", "dumplings", "kimchi", "Lauryn Chun", "The Kimchi Cookbook", "tof"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pan-fried Kimchi Dumplings (Mandu) from 'The Kimchi Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/01/pan-fried-kimchi-dumplings-mandu-from-the-kim.html", "description": "Preparing homemade dumplings can often seem like a daunting task, and when the filling is a simple mixture of ground beef or potatoes, the one-note result makes the project seem less worthwhile. Not so with <strong>Lauryn Chun's</strong> Pan-fried Kimchi Dumplings from <em><a href=\"http://www.amazon.com/The-Kimchi-Cookbook-Traditional-Modern/dp/1607743353/?tag=serieats-20\">The Kimchi Cookbook</a></em>. Loaded with bright, crunchy kimchi; tofu, beef, and sesame oil, these dumplings are worth every minute spent filling and crimping.", "totalTime": "3 hours", "recipeYield": "serves 8 to 10", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Beef", "Cook the Book", "Sides"], "recipeIngredient": ["<strong>Dumplings</strong>", "1 (14-ounce) package firm tofu", "3 1/2 teaspoons kosher salt", "1/2 head (about 1 pound) green cabbage, cored and quartered", "1/2 pound mung bean sprouts (omit if unavailable)", "2 cups any napa cabbage kimchi, finely chopped", "1/2 pound ground beef, preferably sirloin ", "2 large eggs", "2 tablespoons toasted sesame oil", "Freshly ground black pepper", "Dumpling or gyoza wrappers", "1 large egg white", "Neutral cooking oil, for frying", "Water, for steaming", "&nbsp", "<strong>Dipping Sauce</strong>", "1 tablespoon unseasoned rice vinegar", "2 tablespoons soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tofu in cheesecloth and squeeze the tofu into a ball to remove as much moisture as possible. Transfer the tofu to a large bowl and set aside. Set aside the cheesecloth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot over high heat, bring 3 inches of water and 1 teaspoon of the salt to a boil. Add the cabbage and boil for 6 minutes, until limp. Drain the cabbage in a colander set over a sink, and rinse under cold running water to cool completely. Chop the cabbage finely and, using cheesecloth, squeeze out as much moisture as you can. You want the tofu and all the filling components to be as dry as possible. Transfer the chopped cabbage to the bowl with the tofu.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring another batch of water to a boil and add the bean sprouts and 1 teaspoon of the salt. Cook for about 3 minutes, until the sprouts are soft. Remove the pot from the heat and drain in a colander set over a sink; rinse the sprouts under cold running water to cool completely. Chop the sprouts finely and, using cheesecloth, squeeze out as much moisture as you can. Transfer the chopped sprouts to the bowl with the tofu and cabbage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the kimchi, beef, eggs, sesame oil, pepper, and the remaining salt to the bowl with the tofu and cabbage. Mix until thoroughly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/2 tablespoon of the mixture in the center of a dumpling wrapper. Using your fingers, moisten the edges of the wrapper with the egg white, and fold the wrapper over, making a semicircle. Press down gently on the edges to seal them. Repeat until no filling remains. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over medium-high heat, warm 2 tablespoons of the cooking oil in a large cast-iron skillet until the oil is shimmering. Add 10 to \u202812 dumplings to the skillet and cook, making sure they are well coated in oil, until they are nicely browned, 2 to 3 minutes per side. Lower the heat to medium and add 1/4 cup water to the skillet. Cover and steam the dumplings for 4 to 5 minutes, until they are plump and lightly browned with a crust on the outside. Monitor the skillet carefully to make sure that you do not burn off all the water, as it is easy to burn the dumplings at this stage. Repeat the process until all the of dumplings are cooked. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the dipping sauce. In a small bowl, stir together the rice vinegar and soy sauce. When the dumplings are ready, serve them hot, along with the dipping sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>On Freezing Dumplings:</strong> If you don’t want to cook all of the dumplings at once, you can freeze the remaining filling. Alternatively, you can make all the dumplings with the filling and wrappers, and freeze the extra dumplings by placing them on a baking tray (make sure they don’t touch and freeze together) and flash freezing them for 20 minutes. After that, you can place them loosely into a container or a plastic bag to store in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry frozen dumplings for 4 to 6 minutes per side. Be careful when frying frozen dumplings, as the oil might sputter and sizzle. It’s critical to make sure that each dumpling is well coated in oil as the oil will create a “seal” for the steaming phase when you cover the skillet. When you get to the steaming stage, add 1/3 cup water and steam for 7 to 9 minutes to get the desired results.</p>"}]}