{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130317-244857-sandwiched-mascarpone-strawberry-basil-grilled-cheese-sandwich.jpg", "author": {"@type": "Person", "name": "Marvin Gapultos"}, "recipeCuisine": "", "keywords": ["mascarpone", "quick", "sandwiched", "strawberries"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mascarpone, Strawberry, and Basil Grilled Cheese Sandwiches", "link": "https://www.seriouseats.com/recipes/2013/03/mascarpone-strawberry-basil-grilled-cheese-recipe.html", "description": "After purchasing my first batch of early-season strawberries, I decided to combine them with some cream and basil in a rather unconventional way&mdash;in a grilled cheese sandwich.", "totalTime": "15 minutes", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Sandwiches", "Strawberry"], "recipeIngredient": ["4 slices honey wheat bread", "2 tablespoons softened mascarpone cheese", "Honey, for drizzling", "4 to 6 large ripe strawberries, hulled and thinly sliced", "2 large basil leaves, cut into thin ribbons", "2 tablespoons butter, divided", "Powdered sugar, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the mascarpone onto one side of each of the bread slices. Drizzle honey onto each of the bread slices. Evenly divide and shingle the strawberry slices amongst 2 of the bread slices, then evenly divide the basil onto the strawberries. Top each bottom half of the sandwich with the remaining bread slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 tablespoon of the butter in a large non-stick skillet over medium heat, tilting the pan to ensure the bottom is coated in butter. Place 1 of the sandwiches into the pan and cook just until the first side is golden brown, 1 to 2 minutes. Flip the sandwich over and cook until second side is golden brown, 1 to 2 minutes longer. Transfer the sandwich to a large plate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the remaining 1 tablespoon of butter in the same skillet, tilting the pan to ensure the bottom is coated in butter. Place the second sandwich into the pan and cook just until the first side is toasted, 1 to 2 minutes. Flip the sandwich over and cook until second side is golden brown, 1 to 2 minutes longer. Transfer the sandwich to a large plate. Sprinkle both sandwiches with powdered sugar and serve immediately.</p>"}]}