{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/031113-243841-cook-the-book-homemade-pork-sausages-colcannon-applesauce.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["applesauce", "bangers and mash", "colcannon", "Cook the Book", "pork sausage", "rachel allen", "rachel's irish family food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rachel Allen's Homemade Pork Sausages with Colcannon and Applesauce", "link": "https://www.seriouseats.com/recipes/2013/03/rachel-allens-homemade-pork-sausages-with-col.html", "description": "I'll admit it: I have a hard time saying the name \"bangers and mash.\" It comes in a close second to that other British speciality, \"spotted dick,\" in the list of foods I can't even begin to picture without giggling. Yet <strong><a href=\"http://www.rachelallen.co.uk/biog.html\">Rachel Allen's</a></strong> take on bangers and mash in her new book <em><a href=\"http://www.amazon.com/Rachels-Irish-Family-Food-classic/dp/0007462581/?tag=serieats-20\">Rachel's Irish Family Food</a></em> is sophisticated enough to warrant my serious attention. Her simple pork sausages are bound lightly with egg, bread crumbs, and a bit of garlic and parsley to season. Instead of going through with the trouble of casing the mixture, she simply rolls them into small, breakfast-sized links and gives them a slow brown on the stovetop. And in lieu of ordinary potatoes to serve alongside, Allen advocates for a verdant colcannon mash made velvety soft green cabbage buttery mashed russets. A dollop of quick stovetop applesauce adds a contrasting sweet-tart tang to each bite.", "totalTime": "1 hour", "recipeYield": "serves 4", "recipeCategory": ["Apple", "Cook the Book", "Mains", "Pork"], "recipeIngredient": ["<strong>Sausages</strong>", "1 pound (450g) fatty ground (minced) pork ", "1 cup (50g) fresh bread crumbs ", "1 egg, lightly beaten ", "1 clove garlic, crushed ", "1 tablespoon chopped fresh parsley or marjoram ", "Salt and freshly ground black pepper", "3 tablespoons olive oil or sunflower oil ", "&nbsp", "<strong>Colcannon</strong>", "3 pounds (1.5kg) baking or russet (floury) potatoes, scrubbed ", "1/2 cup (100g) butter ", "1 pound, 2 ounces (500g) green cabbage, outer leaves removed", "2 tablespoons water", "1 cup (250ml) milk, heated", "2 tablespoons chopped fresh parsley", "Salt and freshly ground black pepper", "<strong>Applesauce:</strong>", "1 large cooking apple (12 ounces /350g), peeled, cored, and coarsely chopped ", "1 tablespoon water", "2 to 4 tablespoons (25–50g) sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the sausages:</strong> Mix together the pork, bread crumbs, egg, garlic, and parsley. Season with salt and pepper. Fry a tiny bit of the mixture in a pan with a little olive or sunflower oil to see if the seasoning is good. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the mixture into twelve portions and shape each one into a sausage. Place on a baking sheet or plate and set aside until you want to cook them. (Chilling them for a day in the fridge is fine, or you can freeze them.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the colcannon:</strong> Cook the potatoes, covered, in boiling salted water for 10 minutes. Then drain three-quarters of the water and continue to cook over low heat with the lid on for another 20 to 30 minutes until cooked. Test using a skewer or feel with your fingers; avoid stabbing the potatoes with a knife because this will make them break up. When cooked, drain all the remaining water, peel, and mash with 1/4 cup of the butter while hot. I usually hold the potato on a fork and peel with a knife if they are hot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook the cabbage. Cut the cabbage into quarters, then cut out the core. Thinly slice the cabbage across the grain. Heat a saucepan, add the remaining 1/4 cup butter, water, and the sliced cabbage. Toss over medium heat for 5 to 7 minutes, until just cooked. Add to the potatoes, then add most of the hot milk and the parsley, keeping some of the milk back in case you do not need it all. <br />\r\nSeason to taste and beat until creamy and smooth, adding more milk if necessary. While the potatoes are cooking, make the applesauce and sausage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the applesauce:</strong> Put the apple in a small saucepan with the water. Cover and cook over a gentle heat (stir every now and then) until the apple has broken down to a mush. Add sugar to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To cook the sausages:</strong> Heat a frying pan on a low to medium heat, add 2 tablespoons of the olive oil, and gently fry the sausages for 12 to 15 minutes, until golden on all sides and cooked on the inside. Serve with the colcannon and applesauce.</p>"}]}