{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/01/20130108-235815-Chicken-Kebab-edit.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["carrot", "chicken", "chicken kebab", "lunch box", "raisin", "skewer", "tzatziki"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Kebab with Carrot-Raisin Salad and Greek Yogurt Sauce (Tzatziki)", "link": "https://www.seriouseats.com/recipes/2013/01/chicken-kebab-carrot-raisin-salad-greek-yogurt-recipe.html", "description": "Vibrant tzatziki and tangy carrot salad improve overnight, making this the ideal DIY work lunch. Throw it together the night before and you're done. Start counting down until your lunch hour.", "totalTime": "8 hours 30 minutes (includes overnight refrigeration)", "recipeYield": "serves 1", "recipeCategory": ["Chicken", "Lunch Box", "Mains"], "recipeIngredient": ["3 tablespoons raisins", "2 medium carrots, shredded on the large holes of a box grater (about 1 1/4 cups shredded carrot)", "3 teaspoons orange juice, plus 2 tablespoons grated zest from 1 orange ", "2 1/2 teaspoons apple cider vinegar or white wine vinegar", "1 teaspoon honey", "Kosher salt and freshly ground black pepper", "1/2 small cucumber, seeded, grated on the large holes of a box grater", "1 cup Greek yogurt", "2 tablespoons fresh juice from 1 lemon", "1 1/2 tablespoons chopped fresh dill", "1 teaspoon chopped fresh oregano or marjoram, optional", "1/2 medium clove garlic, finely minced (about 1/2 teaspoon)", "1 boneless skinless chicken breast, cut into 1-inch cubes, about 8 ounces", "1 tablespoon canola oil, to brush grill pan", "Pita bread, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine raisins and carrots in a small bowl. Whisk together orange juice, zest, and vinegar in a separate bowl. Season with salt and pepper. Pour dressing over raisins and carrots, gently mix together, then cover with plastic and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cucumbers into a fine mesh sieve set over a bowl. Sprinkle with salt, and let sit to drain for 10 minutes. Whisk together yogurt, lemon juice, dill, oregano and garlic in a small bowl. Season with salt and pepper. Discard cucumber liquid, and squeeze cucumbers in a paper towel to wring out any remaining liquid. Whisk cucumbers into the sauce, then cover with plastic and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a grill pan to high heat. Skewer chicken, 4 to 5 pieces per skewer, and sprinkle liberally with salt and pepper. Lightly brush pan with oil. Grill skewers, rotating to cook evenly on all sides, until chicken is cooked through, about 12 minutes total. Let cool, refrigerate, and then pack in a plastic container with carrot salad, tzatziki, and pita wedges.</p>"}]}