{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130312-steak-salad-recipe-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["make ahead", "salad", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Steak Salad With Cucumber, Peppers, and Spicy Fish Sauce Vinaigrette", "link": "https://www.seriouseats.com/recipes/2013/03/steak-salad-with-cucumber-peppers-and-spicy-f.html", "description": "A fresh and crunchy steak salad with a sweet-hot fish sauce-based dressing. It can be made ahead and stored overnight to pack for a next-day lunch.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Mains", "Salads", "Steak"], "recipeIngredient": ["1 pound flank, skirt, or boneless ribeye steak (about 1-inch thick)", "Kosher salt and freshly ground black pepper", "1 tablespoon vegetable oil", "3 tablespoons juice from about 3 limes", "1 tablespoon fish sauce (plus more to taste)", "2 teaspoons dried Thai chilies (or red pepper flakes)", "2 tablespoons sugar", "1 medium clove garlic, finely minced (about 1 teaspoon)", "1 large cucumber, peeled, split in half lengthwise, de-seeded, and cut into 1/4-inch pieces on the bias", "1 large red pepper, seeds and stem removed, cut into 1/4-inch strips", "2 medium shallots, thinly sliced", "1/2 cup toasted peanuts", "handful fresh cilantro leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season beef on all sides with salt and pepper. Heat oil in a medium skillet over high heat until smoking. Add meat and cook, turning regularly, until well-browned on both sides and the center registers 125°F on an instand read thermometer, about 6 minutes total. (Reduce heat while cooking if necessary). Transfer steak to a cutting board and let rest for 5 minutes. slice into thin strips against the grain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine lime juice, fish sauce, dried chili, sugar, and garlic in a large bowl and whisk until sugar is dissolved. Taste and add more fish sauce if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cucumber, red pepper, shallots, peanuts, cilantro, and steak, and toss to combine. Serve immediately, or store in a sealed container in the refrigerator overnight and serve the next day.</p>"}]}