{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/images/2017/11/20170920-green-bean-casserole-reshoot-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["condiment", "fried shallot", "shallot", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Thai-Style Fried Shallots", "link": "https://www.seriouseats.com/recipes/2013/02/thai-style-fried-shallots.html", "description": "These crispy, crunchy, golden fried shallots make a great sweet-and-savory condiment for a whole host of dishes.", "totalTime": "25 minutes", "recipeYield": "Makes about 1 1/2 cups (100g) fried shallots and about 1 3/4 cups (415ml) fried-shallot oil", "recipeCategory": ["Condiments and Sauces", "Gluten-Free", "Thai"], "recipeIngredient": ["1 pound (450g) shallots, peeled", "2 cups (475ml) vegetable oil", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mandoline, slice shallots into 1/16-inch-thick rounds. Line a rimmed baking sheet with 4 layers of paper towels. Set a fine-mesh strainer over a large heatproof bowl or medium saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine shallots and oil in a medium saucepan or wok. Place over high heat and cook, stirring frequently, until shallots begin to bubble, 2 to 3 minutes. Continue cooking, stirring constantly as the shallots fry to ensure even cooking, until shallots turn pale golden brown, 8 to 10 minutes longer. Working quickly, pour contents of saucepan into strainer set over bowl. (Shallots will continue cooking for a brief period after draining, so do not allow them to get too dark.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately transfer shallots to prepared baking sheet, spread them out into an even layer, and season with salt. Allow shallots to drain, then carefully lift the top layer of paper towels and roll shallots onto second layer, blotting gently with the first. Repeat until shallots are on the last layer of paper towels and mostly grease-free. Allow shallots and oil to cool to room temperature, then store separately in airtight containers."}]}