{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130306-242491-british-bites-queen-of-puddings.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british bites", "custard", "meringue", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Queen of Puddings", "link": "https://www.seriouseats.com/recipes/2013/03/queen-of-puddings-recipe.html", "description": "A dish fit for a Queen, this pudding has roots that can be traced back as far as the seventeenth century. With peaks of soft meringue with a softly toasted crust, covering a sweet center of jam and a base of custard, this pudding is a true British classic that has stood the test of time.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["British Bites", "Puddings and Custards"], "recipeIngredient": ["2 tablespoons (1 ounce) butter, plus more for buttering casserole dish", "2 cups (16 ounces) milk", "1 teaspoon lemon zest, from 1 lemon", "1 cup sugar, divided", "1/3 cup breadcrumbs", "3 eggs, divided", "1/2 cup jam, such as strawberry, raspberry, or apricot"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 2 quart high-sided casserole dish. Adjust oven rack to center position and preheat oven to 325°F. Bring a large kettle of water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat milk, butter, lemon zest, and 1/4 cup sugar in a medium saucepan over medium heat.  Stir constantly until milk is hot, but not simmering, butter is melted, and sugar has dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk egg yolks in a large bowl then slowly add milk, whisking the entire time. Spread breadcrumbs evenly inside buttered casserole dish, then pour milk mixture over breadcrumbs.  Place casserole in a roasting pan, then add boiled water until it goes halfway up the sides of the casserole.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place roasting pan in the oven and cook until custard is set but still jiggles in the center, about 25 minutes.  Remove from the oven and let cool to room temperature. Once the custard is set, spread the jam evenly over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a standing or hand mixer, beat the egg whites until frothy. Continue beating, while adding remaining 3/4 cup sugar. Continue to beat until the whites hold soft peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pastry bag or a small spatula, spread meringue evenly over top of custard. Refrigerate until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve adjust oven rack to the lowest position and preheat broiler to high.  Toast the meringue until  golden brown and serve immediately.</p>"}]}