{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130318-245861-dinner-tonight-broiled-salmon-guajillo-1-primary.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["asparagus", "Dinner Tonight", "guajillo", "salmon", "salsa", "tomatillo"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Broiled Salmon and Asparagus with Guajillo-Tomatillo Sauce", "link": "https://www.seriouseats.com/recipes/2013/04/broiled-salmon-asparagus-guajillo-tomatillo-sauce-recipe.html", "description": "A quick meal of broiled salmon in a tart tomattillo-guajillo chili sauce served with broiled asparagus.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Dinner Tonight", "Mains", "Salmon"], "recipeIngredient": ["4 tablespoons vegetable oil, divided ", "2 dried guajillo chilies, stems and seeds removed", "2 medium garlic cloves, peeled ", "1/2 pound tomatillos (about 4), husks removed, rinsed, sliced in half ", "Kosher salt", "4 salmon fillets, about 6 ounces each", "1 bunch asparagus, ends trimmed "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split the guajillos along one side, so they can be laid out flat. Heat two tablespoons vegetable oil in a 10-inch skillet set over medium heat until shimmering. Add one of the chilies with a pair of tongs, and press it until the oil. Flip every couple of seconds until the chili has turned dark red and is very fragrant, 20 to 30 seconds. Remove chili, letting any oil drip back into the pan, and transfer to a blender. Repeat with remaining chili. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard the oil but do not rinse the pan. Turn the heat to medium-high and add the garlic and the tomatillos, cut-side down. Cook until charred on the bottom, about 3 minutes. Flip garlic and tomatillos and let char on the other side, another 3 minutes. Transfer chilies, garlic, and tomatillos to the blender, along with 1/2 cup water. Blend until smooth and season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust top oven rack to 6 inches below the broiler. Preheat broiler to high. Line a large baking sheet with aluminum foil. Using your hands or a pair of tongs, toss asparagus with one tablespoon oil and a pinch of salt, then arrange the asparagus stalks on one side of the baking sheet. Drizzle another tablespoon of oil on the other side, add the salmon fillets, and coat them in the oil. Set the fillets skin-side down and sprinkle with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the baking sheet underneath the broiler, with the asparagus directly underneath the flame. Cook until the asparagus stalks are bright green and tender, flipping after a couple minutes, about five minutes total. Rotate baking sheet so that the salmon fillets are directly underneath the flame and continue to cook until they have browned on top and an instant read thermometer inserted into the deepest part registers about 130°F, about 5 minutes longer. (Note: If your broiler is large enough for both to cook at the same time, cook for five minutes, then transfer baking sheet to a lower rack to continue cooking for another five minutes.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the asparagus between four plates. Spoon some of the sauce on each plate, and then set a salmon fillet on top. Serve immediately.</p>"}]}