{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/239845-20130213-british-bites-kidney-souffle.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["british", "british bites", "downton abbey", "kidney", "savory souffle", "souffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kidney Soufflé", "link": "https://www.seriouseats.com/recipes/2013/02/kidney-souffle-recipe.html", "description": "The soufflé should be cooked and then served immediately. This recipe is inspired by Downton Abbey and Ethel's attempt at a similar dish. Soufflé is temperamental by nature but if you follow the instructions and don't drop the finished dish, you should have better luck than she did.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "British Bites", "Eggs", "Offal", "Pork"], "recipeIngredient": ["4 tablespoons butter, divided", "1 small shallot, finely chopped (about 1/4 cup)", "1/2 pound ground pork or veal", "1 pound veal or beef kidney, cleaned and finely chopped", "2 tablespoons flour", "1 cup homemade or store-bought low sodium chicken broth", "1 teaspoon marmite", "Kosher salt and freshly ground black pepper", "5 eggs, separated", "Steamed asparagus and <a href=\"http://www.seriouseats.com/recipes/2011/09/sauced-hollandaise-recipe.html?ref=search\">Hollandaise sauce</a> for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 350°F. Butter a 3 cup soufflé dish or 4 (1/2-cup) ramekins. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet over medium high heat melt 2 tablespoons butter. When butter has melted add shallot and cook until soft, about 4 minutes. Add ground pork or veal and chopped kidney and cook, using a spatula or wooden spoon to break up any large chunks. Continue to cook, stirring occasionally, until meat and kidney are fully cooked, about 5 minutes longer. Transfer mixture to a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining butter to the skillet, and when melted add flour and cook, stirring constantly, until flour begins is golden brown with a biscuit-like aroma, about 2 minutes. Slowly whisk in stock, then whisk in marmite. Cook, stirring occasionally, until mixture has thickened, about 5 minutes. Add stock mixture to meat mixture and fold to combine. Allow to cool ten minutes, then whisk in egg yolks one at a time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a mixer or a whisk beat egg whites until stiff peaks form, then gently fold egg whites into meat mixture in two additions, being careful not to allow mixture to deflate. Transfer mixture to soufflé dish or divide between ramekins. Bake until soufflé has risen and begun to brown, 15 to 20 mintues for individual ramekins, up to 30 minutes for a larger souffle dish. Serve soufflé with a side of steamed asparagus drizzled with hollandaise.</p>"}]}