{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/20130506-ramp-risotto-14.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["Italian", "ramps", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Extra-Rampy Ramp Risotto", "link": "https://www.seriouseats.com/recipes/2013/05/extra-rampy-ramp-risotto-recipe.html", "description": "An ultra-ramp-flavored, bright green risotto flavored with blanched ramp greens and whites, topped with herb ricotta and sautéed ramps.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Italian", "Mains", "Rice", "Vegetarian"], "recipeIngredient": ["1/2 cup fresh ricotta cheese, preferably <a href=\"http://www.seriouseats.com/2010/02/how-to-make-fresh-ricotta-fast-easy-homemade-cheese-the-food-lab.html\">homemade</a>", "2 tablespoons chopped fresh chives", "1 tablespoon chopped fresh parsley leaves", "Kosher salt and freshly ground black pepper", "24 ramps, rinsed and trimmed", "6 tablespoons unsalted butter", "2 tablespoons extra-virgin olive oil", "1 cup dry white wine", "5 cups vegetable stock or water, divided", "1 1/2 cups (about 13 1/2 ounces) risotto-style rice (see note)", "2 ounces finely grated parmesan cheese (about 1 cup)", "1 teaspoon grated zest and 1 teaspoon juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil. Meanwhile, combine ricotta with half of chives and half of parsley in a small bowl. Season to taste with salt and pepper. Refrigerate until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set aside 8 ramps. Divide remaining ramps into whites and greens. Thinly slice whites and set aside. Blanch greens in boiling water until bright green, about 45 seconds. Transfer to a fine mesh strainer and run under cold water until completely chilled. Transfer to a blender. Blend on high speed, adding water as necessary, until a smooth, bright green puree is formed. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 4 tablespoons butter and olive oil in a large saucepan over medium-high heat until foaming subsides. Add chopped ramp whites and cook, stirring frequently, until lightly browned, about 3 minutes. Add rice and cook, stirring and tossing frequently until all liquid is evaporated, fat is bubbling, and rice has begun to take on a pale golden blond color and nutty aroma, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and cook, stirring constantly with a wooden spoon until mostly absorbed. Add half of stock and cook, stirring occasionally, until mostly absorbed. Add 2 more cups stock, 1 cup at a time, stirring until mostly absorbed after each addition, until rice is nearly done but still slightly chalky in center. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons butter in a large skillet over medium-high heat until foaming subsides. Add reserved ramps and cook, turning occasionally, until lightly browned and tender. Transfer to a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return risotto to heat and add remaining half cup stock, parmesan cheese, lemon zest and juice, and ramp green puree. Cook, stirring constantly, until rice is cooked through and risotto is very creamy and loose. Season to taste with salt and pepper. Stir in remaining parsley and chives.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve risotto in warm bowls, topped with sautéed ramps and herb ricotta. Serve immediately.</p>"}]}