{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130522-253262-hot-pepper-relish-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["condiments", "hot dogs", "onions", "peppers", "sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hot Pepper Relish", "link": "https://www.seriouseats.com/recipes/2013/05/hot-pepper-relish-recipe.html", "description": "Whether you remove the seeds from the hot peppers for a sweeter heat, or leave them in for some fiery intensity, this relish will bring new meaning to the \"hot\" in hot dog.", "totalTime": "2 hours 20 minutes", "recipeYield": "makes about 1 1/2 cups", "recipeCategory": ["Condiments and Sauces", "Sauced"], "recipeIngredient": ["1/2 pound hot green peppers (such as jalapeños or serranos), stemmed, seeds removed for a more mild relish", "1/2 pound hot red peppers (such as fresnos or cherry peppers), stemmed, seeds removed for a more mild relish", "1/2 pound yellow onions, roughly chopped", "1 tablespoon kosher salt", "1/2 cup cider vinegar", "1/4 cup white sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place peppers and onions in workbowl of a food processor fitted with steel blade. Pulse until peppers and onion are finely chopped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pepper mixture to a fine mesh strainer set inside a bowl. Stir in salt and let sit for 2-3 hours. Rinse under cold water and strain, pushing vegetables against side of the strainer using a rubber spatula to remove as much water as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, bring vinegar and sugar to a boil over medium high heat, stirring to dissolve to sugar. Add in pepper mixture, reduce heat to medium-low, and simmer for 10 minutes, stirring occasionally. Remove from heat and let cool to room temperature. Transfer relish to an airtight container and store in refrigerator up to a month.</p>"}]}