{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/20130603-cape-cod-salt-and-vinegar-spanish-tortilla-potato-chip-6.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["aioli", "allioli", "egg", "omelette", "potato chip", "quick", "salt-and-vinegar", "spanish", "tortilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5555555555556", "ratingCount": "9"}, "name": "Salt-and-Vinegar Spanish Tortilla With Quick Cheaty Allioli", "link": "https://www.seriouseats.com/recipes/2013/06/salt-and-vinegar-spanish-tortilla-recipe.html", "description": "Need an ultra-quick light lunch or appetizer when all you've got on hand is an onion, some eggs, some olive oil, and a bag of chips? This Spanish tortilla does the trick, especially when the chips are salt-and-vinegar-flavored.", "totalTime": "15 minutes", "recipeYield": "Makes one 10-inch tortilla, serving 6 to 8 as an appetizer or 4 as a light meal", "recipeCategory": ["Mains", "Omelettes", "Sides", "Snacks", "Spanish", "The Food Lab", "Vegetarian"], "recipeIngredient": ["<strong>For the Cheaty Allioli:</strong>", "1/2 cup (120ml) mayonnaise", "2 medium garlic cloves, finely minced or grated on a Microplane grater (about 2 teaspoons; 10g)", "3 tablespoons (45ml) extra-virgin olive oil", "2 teaspoons (10ml) water", "Kosher salt and freshly ground black pepper", " ", "<strong>For the Tortilla:</strong>", "Up to 1/4 cup (60ml) extra-virgin olive oil, divided", "1 small onion, finely sliced (about 3/4 cup; 170g)", "5 large eggs", "1 tablespoon (15ml) sherry or white wine vinegar (optional)", "3 cups (about 2 1/2 ounces) kettle-style salt-and-vinegar chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cheaty Allioli:</strong> Combine mayonnaise and garlic in a medium bowl. Whisking constantly, slowly drizzle in extra-virgin olive oil. Whisk in water. Season to taste with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tortilla:</strong> If using onion, heat 2 tablespoons (30ml) olive oil in a 10-inch nonstick or cast iron skillet over medium-high heat until shimmering. Add onion and cook, stirring frequently, until softened and just starting to brown. Transfer onion and oil to a large bowl. Add eggs and vinegar (if using) and whisk to combine. Season with 1/2 teaspoon salt and a few grinds of black pepper. Fold in potato chips until they are well coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet and add 2 more tablespoons (30ml) olive oil. Return to medium heat until oil is shimmering. Add egg/potato chip mixture and cook, stirring with a rubber spatula, for 10 seconds. Shake pan to evenly distribute mixture, then even out top with spatula. Cook, shaking pan occasionally, until tortilla is mostly set but still wet on top, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large metal or glass pot lid over tortilla. Using kitchen towels to grip lid and pan handle, carefully invert entire tortilla so that it's resting on top of pan lid. Slide tortilla back into skillet so that the cooked side is now facing up. Use spatula to tuck down edges and create an even disk shape. Continue to cook, shaking occasionally, until tortilla is golden brown on second side and barely cooked through, about 2 minutes longer. Slide tortilla out onto a cutting board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut into squares or wedges and serve immediately with allioli, or allow to cool and serve at room temperature.</p>"}]}