{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131120-273946-cook-the-book-legacy-cornbread-dressing.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["choosing sides", "Cook the Book", "cornbread", "sausage", "stuffing", "tara mataraza desmond", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Legacy Cornbread Dressing From 'Choosing Sides'", "link": "https://www.seriouseats.com/recipes/2013/11/legacy-cornbread-dressing-stuffing-from-choosing-sides.html", "description": "<strong><a href=\"http://taramdesmond.com/\" target=\"_blank\">Tara Mataraza Desmond</a></strong>'s cornbread dressing from her new cookbook, <em><a href=\"http://www.amazon.com/Choosing-Sides-Holidays-Delicious-Recipes/dp/1449427111/?tag=serieats-20\">Choosing Sides</a></em>, has been in her husband's family for a couple of generations. In it, she interweaves Southern-style all-cornmeal croutons with rich, savory breakfast sausage, sweet Rome apples, and a plethora of herbs and aromatics.", "totalTime": "1 hour and 45 minutes, plus overnight to stale cornbread", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Cook the Book", "Cornbread", "Pork", "Sides"], "recipeIngredient": ["<strong>Heritage Cornbread</strong>", "2 cups stone-ground yellow or white cornmeal", "1/4 cup sugar", "1 teaspoon kosher salt", "1/2 teaspoon baking powder", "1 large egg", "1 1/2 cups buttermilk (whole-fat if you can find it)", " 4 tablespoons melted bacon grease or butter", "&nbsp", "<strong>Dressing</strong>", "1/2 pound pork breakfast sausage (about 4 links)", "1 cup 1/4-inch pieces onion (1/2 medium Vidalia onion or large yellow onion)", "1 cup 1/4-inch pieces celery (about 2 large stalks)", "4 cloves garlic, minced (about 2 tablespoons)", "1 teaspoon chopped fresh sage leaves (5 leaves)", "1 teaspoon chopped fresh marjoram (about 10 leaves)", "1 teaspoon chopped fresh thyme leaves (about 5 sprigs)", "1/4 teaspoon kosher salt", "1/4 teaspoon cayenne", "1 loaf Heritage Cornbread (above), cut into 1-inch cubes and staled overnight", "2 cups chicken stock (homemade or low-sodium store-bought) or homemade giblet stock", "2 cups 1/4-inch cubed unpeeled Rome apple (2 medium apples)", "1 teaspoon bacon grease, butter, or oil for the baking dish "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the cornbread:</strong> Place a 10- or 12-inch cast-iron skillet or cake pan in the oven and preheat the oven to 400 degrees. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, whisk together the cornmeal, sugar, salt, and baking powder. In a pouted measuring cup or small mixing bowl, beat the egg lightly and then add the buttermilk. Whisk together to combine. Dig a little well in the center of the cornmeal and pour in the egg and buttermilk. Use a large rubber spatula or wooden spoon to fold the wet ingredients into the dry ingredients until just combined. Drizzle 2 tablespoons of the bacon grease or butter into the batter and gently fold it in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the hot skillet from the oven, add the remaining 2 tablespoons of bacon grease or butter, and brush the entire inside of the pan to coat with the fat. Pour the batter into the pan and bake for 25 to 25 minutes (longer for the smaller pan, shorter for the larger), until the bread feels completely set when tapped lightly with your fingers and the top is just starting to speckle brown. Let cool completely before slicing into 1-inch cubes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the dressing:</strong> Preheat the oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large deep sauté pan or cast-iron skillet over medium heat. Push the sausage out of the casings and discard the casings. Bread the sausage bits with your fingertips and add them to the hot pan. Cook for 5 minutes, stirring with a wooden spoon and breaking the sausage into smaller bits as it cooks and just starts to brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the onion and celery to the sausage in the pan. Stir to coat them in the fat rendered from the sausage. Scrape up any browned bits from the bottom of the pan as the onions and celery release their water. Cook for 5 minutes as they soften. Add the garlic and decrease the heat to medium-low. Sweat the garlic and the vegetables in the pan until softened and very fragrant, about 5 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn off the heat. Add the herbs, salt, and cayenne and stir to incorporate them into the rest of the ingredients. If your pan is big enough to accommodate the broken cornbread bits and crumbs, add them now. Otherwise, put them in a large mixing bowl and scrape the sausage mixture into it. Gently fold it all together using a big spatula or wooden spoon. Drizzle the chicken stock over everything, stirring halfway through to be sure of even distribution. The cornbread should be moistened, not drenched. Add the apple chunks and fold them in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pain a 2 1/2-quart oval casserole dish with the grease, butter, or oil. Scrape the cornbread mixture into it and even it out with a spatula or with your hands. Cover the dish with aluminum foil and bake until hot all the way through, about 30 to 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Tip:</strong> If you're making this for a holiday meal and have to consider cooking times and oven space, you can bake the dressing at whatever temperature your oven is set to for roasting meat (i.e. the turkey). Adjust the total time up or down accordingly. If you cook your turkey low and slow, at 325 degrees or less, then add 20 to 30 minutes to the total baking time for the dressing. If your oven is set above 350 for other dishes, bake the dressing for fewer minutes, checking to be sure it doesn't dry out in the higher temps. You can also work through the first few steps a day ahead, refrigerating until ready to proceed. Add the cornbread, stock, and apples just before baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Alongside:</strong><br />\r\nApple and herb stuffed roast turkey<br />\r\nBaked honey ham <br />\r\nOven-fried buttermilk herb chicken<br />\r\nSage and thyme rubbed pork loin <br />\r\nFried catfish filets<br />\r\n</p>"}]}