{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130131-pastelon-fried-plantains.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["mains", "pastelon", "plantains", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pastelón (Sweet Plantain 'Lasagna') with Radish Salsa", "link": "https://www.seriouseats.com/recipes/2013/02/pastelon-vegetarian-sweet-plantain-lasagna-recipe.html", "description": "Traditional pastelón is kind of like a Latin American lasagna, layering fried plantains with a spiced ground beef filling and melty white cheese. This version is vegetarian-friendly, using spicy red beans for the filling and served with a crunchy, refreshing radish salsa.", "totalTime": "1 hour 40 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Mains", "Vegetarian"], "recipeIngredient": ["1 quart vegetable oil", "5 moderately ripe plaintains (yellow with some black spots), peeled and quartered lengthwise", "Kosher salt", "1 medium onion, finely diced (about 1 cup)", "1/2 green bell pepper, seeds and ribs removed, finely diced (about 1/2 cup)", "1 jalapeño pepper, seeds and ribs removed, minced, divided", "5 medium cloves garlic, minced (about 5 teaspoons), divided", "1 cup chopped fresh cilantro leaves and fine stems, divided", "2 teaspoons ground cumin", "1 teaspoon ground coriander", "1 teaspoon dried oregano", "2 tablespoons canned chipotles en adobo, peppers and liquid, peppers chopped", "2 (15.5-ounce) cans red kidney beans, drained", "1 small (8-ounce) can tomato sauce", "2 cups water", "1 bay leaf", "1/2 cup raisins", "1/2 cup chopped green olives", "One small bunch radishes, greens and radishes divided, both chopped fine", "Nonstick cooking spray", "1 (12-ounce) block queso blanco, shredded", "3 eggs, beaten", "1/2 cup milk", "3 tablespoons apple cider vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 inch of vegetable oil in a large Dutch oven over medium-high heat until oil shimmers. Working in batches, fry plantains until lightly browned on each side, 3 to 4 minutes per side. Drain plantains on paper towels, salting each batch to taste. Repeat with all plantains, adding oil to pan as necessary. Discard all but 3 tablespoons oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position and preheat oven to 375°F. Return dutch oven to medium-high heat until oil is shimmering. Add onion, bell pepper, half of jalapeño pepper, half of garlic, and half of cilantro and cook, stirring occasionally, until vegetables begin to sweat but do not brown, about 4 minutes. Add cumin, coriander, oregano, and chipotles and cook, stirring, for 2 minutes. Add kidney beans, tomato sauce, water, bay leaf, raisins, olives, and radish greens. Add 1 teaspoon salt. Simmer beans until most of the liquid is absorbed, about 25 minutes. Season to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When beans are cooked, use the potato masher to mash about half the beans, leaving about half whole, then assemble the pastelón: spray a glass casserole dish with nonstick cooking spray. Place one layer of fried plantains in the bottom, breaking into halves if necessary. Spoon half the bean mixture over the plantains, then sprinkle half the cheese over the beans. Repeat with one additional layer of plantains, then remaining beans. Finish with a final layer of plantains, then top with remaining cheese. Beat eggs with milk and pour over top of casserole. Bake pastelón until cheese is melted and browned, about 40 minutes. Let cool for about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pastelón bakes, make radish salsa. Combine chopped radishes, remaining chopped garlic, jalapeño, cilantro, and vinegar in a small both and stir to combine. Season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut pastelón into squares and serve with radish salsa.</p>"}]}