{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130323-anna-apple-pie-vanilla-ice-cream-slice.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["apple pie", "from the pastry dungeon", "ice cream", "pie", "vanilla ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Superlative Apple Pie with Homemade Vanilla Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/03/flakey-crust-apple-pie-with-homemade-vanilla-icecream-recipe.html", "description": "This pie has a filling that's sweet, bitter, and just a little savory, a crust that shows off technical skill and a love for good old butter, and something classic yet subtly original melting all over everything.", "totalTime": "24 hours", "recipeYield": "serves 8", "recipeCategory": ["Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Crust</strong>:", "1 pound unsalted butter, cut in 1/4 inch pieces, frozen", "4 cups all-purpose flour", "6 tablespoons sugar", "1 1/2 teaspoons salt", "Cold water", " ", "<strong>For the Ice Cream</strong>:", "2 cups milk", "2 cups cream", "1 1/2 cups sugar", "2 vanilla beans", "6 egg yolks", "1 tablespoon whiskey/bourbon or dark rum", " ", "<strong>For the Filling</strong>:", "5 pounds granny Smith apples", "1 cup sugar", "1/4 cup unsalted butter", "1 tablespoon whiskey/bourbon", "2 teaspoons cinnamon", "1/2 teaspoon fresh ground black pepper", "1/4 teaspoon applewood smoked salt", " ", "<strong>To Finish</strong>:", "1 egg yolk", "Splash of water", "1/4 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough</strong>: Cut the butter into 1/2 inch pieces and freeze. Combine flour, sugar, and salt in bowl of stand mixer and mix for 5 seconds on lowest speed to incorporate. Add butter and continue mixing on lowest speed until butter is broken into roughly pea-sized pieces. Gradually add cold water until dough just comes together. pat into tightly-packed disc, wrap and chill for at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ice Cream</strong>: Combine milk, cream and sugar in large saucepan. Split and scrape vanilla beans and add to pan. Heat on medium, stirring occasionally, until sugar is dissolved and mixture is steaming but not boiling. Meanwhile, separate yolks into a medium mixing bowl. Once liquid mixture is hot, gradually pour into yolks, whisking constantly. You don't have to add all the hot mixture; just add enough so your yolks are also steaming hot. Scrape yolk mixture into pan and cook over medium-low heat, stirring constantly, until mixture coats the back of a spoon. Strain, reserving beans. Place beans and about 1/2 cup liquid into blender and blend on high for about 1 minute, until beans are mostly blended and mixture has taken on a grayish-brown hue from the beans. Strain blended mixture into rest of base and whisk to incorporate. Chill thoroughly, preferably overnight, before churning. Churn in ice cream maker according to manufacturer's instructions. Allow to set up in freezer for at least an hour before scooping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Apples</strong>: Peel, core and quarter apples. Cut quarters into roughly 1/2 inch thick slices. Place a large heavy-bottomed stockpot (or a rondeau if you happen to have one) on the stove and add sugar. Cook over high heat, stirring occasionally at first and constantly once sugar begins to caramelize. Don't worry about chunks of unmelted or crystallized sugar. Continue to cook until caramel is dark amber, almost the color of maple syrup. Reduce heat to medium and carefully add butter, stirring it in (it will foam up a little, be careful). Carefully add liquor from a safe distance (caramel will foam and sputter more). Carefully add about 2/3 of apple slices, being careful not to splash caramel. Stir to coat with caramel. Turn heat back to high and cook, stirring often, until apples are just slightly beginning to soften, about 5 minutes. Add remaining apple slices, cinnamon, pepper and salt and continue to cook, stirring constantly, until all apples are cooked to some degree, about 5-10 minutes. Remove from heat and strain apples into medium bowl to cool. Return pot with caramel liquid to medium heat and allow to reduce for about 5 minutes. Remove from heat, allow to cool slightly and scrape into a heat-proof measuring cup or ramekin, it should yield about 1/2 cup of syrup.</p>\r\n\r\n<p><strong>Note</strong>: The syrup will congeal into a jelly when cool due to the pectin from the apples. Don't panic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble Pie</strong>: Take dough out of refrigerator to thaw slightly before rolling, at least 10 minutes. Place a rack in center of oven. Preheat oven to 400&deg;F. On a generously floured surface, roll dough to less than 1/4 inch thick, but not all the way to 1/8 inch, turning often to keep the dough circular. Drape dough over rolling pin and transfer into pie tin, smoothing into corners. Trim excess dough all around the plate and reserve. Chill bottom crust until needed. Fold scraps over each other and roll out to same thickness as bottom crust on floured surface. Retrieve bottom crust and add strained apples - it will look like they won't fit, but pack them in there, they will. Pour reduction over apples, warming slightly if it's completely set up. Draping top crust over rolling pin, gently center it over pie. Smooth over surface of apples and around edges of plate, pressing out any air bubbles around the edge. Cut excess dough around edge of pie plate, leaving about 1/8 inch of dough all the way around edge. Fold top crust under bottom crust around edge and gently press together. In a small bowl or cup, whisk together egg yolk and water, then brush lightly all over top and edges of pie. Generously sprinkle with sugar, then cut a couple slits in top to allow steam to escape.</p>\r\n\r\n<p><strong>Note</strong>: By rolling the scraps right away, the gluten in the dough is slightly overworked and the top crust will shrink, which is why it's important to cut the top crust a little bigger and tuck it under the edge of the bottom crust. The top crust will not be tough and it should shrink to the same circumference as the pie plate if you take this precaution.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pie on a medium rimmed baking sheet. Bake pie for 20 minutes, then turn and bake for another 10-15. Crust should be puffed around edges and golden-brown from egg wash. Lower temperature to 375&deg;F and bake for another 5 minutes, then remove to cool for at least 10 minutes before slicing.</p>"}]}