{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130904-263111-Serious-Eats-Sunday-Supper-Greek-Meatloaf-edit.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["feta", "greek", "grill", "loukaniko", "meatloaf", "pork", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Grilled Greek-Style Meatloaf with Herbed Potatoes and Grilled Lemon", "link": "https://www.seriouseats.com/recipes/2013/08/sunday-supper-grilled-greek-meatloaf-herbed-potatoes-recipe.html", "description": "Grilled Greek meatloaf, inspired by loukaniko sausage, is plated with herb-y potatoes, wheels of grilled onion and grilled lemon halves.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Pork", "Potato", "Sunday Supper"], "recipeIngredient": ["<strong>For the Meatloaf:</strong>", "2 pounds ground pork", "Kosher salt and freshly ground black pepper", "1/2 teaspoon ground hot red pepper, such as cayenne", "1/2 teaspoon dry oregano, preferably Mediterranean", "1/4 teaspoon ground fennel seed", "3 medium cloves garlic, minced (about 1 tablespoon)", "3/4 teaspoon zest from 1 orange", "1/2 cup dry breadcrumbs", "1 egg, lightly beaten", "3 lemons, halved, divided", "1 large red onion, thickly sliced", "1/3 cup crumbled feta cheese", " ", "<strong>For the Potatoes:</strong>", "10 sprigs fresh thyme", "10 sprigs fresh oregano", "2 pounds small potatoes, scrubbed clean", "2 strips of orange zest, about 3 inches long", "3 strips of lemon zest, about 3 inches long", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pork, 3/4 teaspoon kosher salt, 1/2 teaspoon black pepper, ground red pepper, oregano, fennel, garlic, orange zest, breadcrumbs and egg in a large bowl. Divide meat evenly into four portions and shape into oblong, individual meatloaves. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a large, covered microwave-safe bowl and cook on high for until almost tender, 8 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate, the other area empty for the corn. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large piece of foil on a work surface. Place thyme and oregano in the center of the foil and top with potatoes. Add orange and lemon zest and drizzle evenly with olive oil and 2 tablespoons juice from 1 lemon (2 halves). Season with salt and pepper and seal into a completely enclosed packet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill meatloaf, onion slices and foil packet of potatoes over direct heat. Flip onion after about 7 minutes. When onion slices have a good char on both sides, remove from heat (about 15 minutes total)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Check the meatloaf and potato packet periodically. When potatoes are completely tender (about 20 minutes), remove from grill and keep warm. During the last few minutes of cooking, place remaining lemon halves (4) on the grill, cut side down, to char. Remove meatloaf from the grill when an instant read thermometer inserted into the center registers 155&deg;F, 20 to 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tear open foil packet and evenly divide contents between four plates. Finish plates with onion slices, meatloaf and a shower of feta. Serve immediately with grilled lemons.</p>"}]}