{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130323-245598-mole-verde-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Mexican", "keywords": ["Mexican", "mole", "mole verde", "sauced", "sauces"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mole Verde", "link": "https://www.seriouseats.com/recipes/2013/04/mole-verde-recipe.html", "description": "Mole verde retains a rich complexity, but trades the deep and earthy flavors of mole poblano for a bright and fresh profile and can be put together in about an hour.", "totalTime": "60 minutes", "recipeYield": "makes about 5 cups", "recipeCategory": ["Condiments and Sauces", "Mexican", "Sauced"], "recipeIngredient": ["1 cup pepitas (hulled pumpkin seeds)", "1/2 pound tomatillos, husked and halved", "3 cups homemade or store-bought low sodium chicken stock", "1 cup roughly chopped white onion (about 1 small)", "2 medium jalapeño peppers, stemmed and roughly chopped (seeds removed for a milder sauce)", "1 cup packed coarsely chopped fresh cilantro leaves and tender stems", "1/2 cup packed coarsely chopped fresh epazote (see note)", "1/2 cup packed coarsely chopped romaine lettuce leaves", "1 tablespoon minced garlic (about 3 medium cloves)", "1 tablespoon lard or olive oil", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium cast iron skillet over medium-high heat, toast pepitas until they start to pop and turn a light golden brown, about 5 minutes. Transfer to a spice grinder or blender and process until finely ground.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place ground pepitas, tomatillos, 1 cup chicken stock, onion, jalapeños, cilantro, epazote, lettuce, and garlic in the jar of a blender. Puree until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat lard or oil in a medium saucepan over medium-high heat until shimmering. Add in pureed paste and cook, stirring constantly, until thickened almost to the consistency of tomato paste, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in remaining 2 cups of chicken broth and bring to a boil. Reduce heat and simmer for 10 minutes. Use immediately or transfer to an airtight container and store in refrigerator for up to 3 days, reheating before use. </p>"}]}