{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130313-btb-cherrytomatoes.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "candy", "Cook Fight", "salty and sweet snacks", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Candied Cherry Tomatoes", "link": "https://www.seriouseats.com/recipes/2013/03/candied-cherry-tomatoes-recipe.html", "description": "Crunchy, salty, sweet, and single-serving, candied cherry tomatoes taste as good as they look. Not surprisingly, the idea for these <em>Cookfight</em> cuties comes from Serious Eats.", "totalTime": "30 minutes", "recipeYield": "makes 24 tomatoes", "recipeCategory": ["Bake the Book", "Candy", "Dairy-Free", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1/4 cup white and black sesame seeds, toasted (about 2 tablespoons each)", "1 teaspoon salt", "2 cups sugar", "2/3 cup balsamic vinegar", "1 cup light corn syrup", "24 firm ripe cherry tomatoes, stems removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with parchment. Put the sesame seeds and salt in a small bowl, mix, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clip a candy thermometer to the side of a deep 3- to 4-quart saucepan. Combine the sugar and balsamic vinegar in the pan and boil over medium-high heat, swirling the pan occasionally, until the sugar is dissolved. Stir in the corn syrup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to cook, brushing down the sides of the pan with a moistened pastry brush to prevent crystallization and adjusting the heat as needed so the syrup doesn’t boil over, until the syrup registers 305 degrees (hard-crack stage) on the thermometer. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a toothpick into the stem end of a tomato, then dip the tomato into the syrup, allowing the syrup to go a little over halfway up the tomato. Twirl gently and carefully over the pan to let the excess drip off, then immediately dip the bottom half of the tomato into the sesame seeds and stand, seed end down, on the lined baking sheet. Repeat with the remaining tomatoes, reheating the sugar syrup over low heat as needed to restore fluidity</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool for 10 minutes at room temperature before serving.</p>"}]}