{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130910-breakfast-tacos-recipes-8.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["breakfast", "breakfast taco", "chorizo", "cinco de mayo", "easy", "egg", "Mexican", "potato", "quick", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Breakfast Tacos With Crispy Potatoes, Chorizo, and Fried Egg", "link": "https://www.seriouseats.com/recipes/2013/09/breakfast-tacos-crispy-potatoes-chorizo-egg.html", "description": "Breakfast tacos with crispy potatoes fried in chorizo fat and a soft fried egg on top.", "totalTime": "30 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Father's Day", "Mains", "Mexican", "Mother's Day", "Potato", "The Food Lab"], "recipeIngredient": ["1 large russet potato (about 10 ounces), cut into 1/2-inch cubes", "Kosher Salt", "1 tablespoon distilled white vinegar", "1 tablespoon vegetable oil, divided", "3 ounces Mexican-style raw chorizo (see note)", "2 scallions, thinly sliced, whites and greens reserved separately", "1 serrano pepper, thinly sliced", "Freshly ground black pepper", "4 eggs", "4 soft flour or corn tortillas, warm", "1 cup <a href=\"http://www.seriouseats.com/recipes/2012/05/roasted-tomato-salsa.html\">homemade</a> or store-bought roasted tomato salsa", "Chopped cilantro, sour cream or Mexican crema, and lime wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a small saucepan and cover with cold water by 1-inch. Add 1 tablespoon kosher salt and the vinegar. Bring to a boil over high heat, reduce to a simmer, and cook until potatoes are softed, about 8 minutes. Drain and let rest for 5 minutes to dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While potatoes cook, heat 2 teaspoons of vegetable oil in a medium non-stick or cast iron skillet over medium-high heat until shimmering. Add chorizo and cook, breaking it up with a wooden spoon, until cooked through. Transfer chorizo to a small bowl, leaving oil behind.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When potatoes have dried, reheat chorizo oil over high heat until shimmering. Add potatoes and cook, tossing occasionally, until crisp and golden brown all over, about 15 minutes. Add scallion whites and serranos and continue to cook, tossing, until softened and aromatic, about 1 minute longer. Stir in chorizo and season to taste with salt and pepper. Transfer to a plate and keep warm. Wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining teaspoon oil and heat over medium-high heat until shimmering. Add eggs, season with salt and pepper, and cook until whites are set but yolks are still runny, about 1 1/2 minutes. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide potato mixture between tortillas. Top each with a fried egg and some salsa. Serve immediately with chopped cilantro, scallion greens, sour cream or Mexican crema, and lime wedges.</p>"}]}