{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130220-portobello-carpaccio-recipe-vegan-5.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["arugula", "lemon", "mushroom", "pistachio", "portobello", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Miso-Marinated Portobello Carpaccio (Vegan)", "link": "https://www.seriouseats.com/recipes/2013/02/miso-marinated-portobello-carpaccio-pistachio-recipe.html", "description": "Miso-marinated mushrooms slow roasted until dense and meaty, sliced thin, and served with extra-virgin olive oil and lemon, carpaccio-style. Toasted pistachios add richness and nutty crunch.", "totalTime": "2 hours or up to overnight", "recipeYield": "Serves 3 to 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Leafy Greens", "Lemon", "Mushrooms", "Nuts", "Vegan", "Vegetarian"], "recipeIngredient": ["2 tablespoons red or white miso paste", "2 tablespoons brown sugar", "1 tablespoon soy sauce", "3 tablespoons vegetable oil", "2 tablespoons juice plus 2 tablespoons thinly sliced zest from 1 lemon, plus 1 extra whole lemon, cut into wedges", "4 portobello mushroom caps, stems and dark gills removed", "4 teaspoons extra virgin olive oil", "2 ounces arugula or other spicy greens", "2 tablespoons toasted pistachios, roughly chopped or pressed in a mortar and pestle", "Coarse sea salt such as fleur de sel or Maldon", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine miso paste, brown sugar, soy sauce, vegetable oil, and lemon juice in a medium bowl and whisk to combine. Rub evenly over surfaces of mushrooms and transfer to a gallon-sized zipper lock bag. Gently press air out from bag, seal, and transfer to refrigerator for at least 1 hour and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to proceed, adjust oven rack to center position and preheat oven to 350°F. Remove mushroom caps from bag and wipe off excess marinade with paper towels. Place on a foil-lined rimmed baking sheet gill-side-down and roast until top surface is dry and mushroom is tender throughout, about 30 minutes. Transfer to a cutting board and let rest 5 minutes to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a very sharp knife, cut mushrooms on a sharp bias into thin slices. Transfer slices to a serving platter or individual platters, fanning them as you go. Drizzle with 1 tablespoon extra-virgin olive oil. Sprinkle with lemon zest, pistachios, black pepper, and coarse sea salt. Toss arugula with remaining 1 teaspoon olive oil, squeezing one of the reserved lemon wedges over the greens. Top mushrooms with arugula and serve, passing remaining wedges tableside.</p>"}]}