{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/20130320-veg-kale-and-cabbage-gratin.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["cabbage", "gratin", "kale", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7142857142857", "ratingCount": "7"}, "name": "Kale and Cabbage Gratin", "link": "https://www.seriouseats.com/recipes/2013/03/kale-and-cabbage-gratin-recipe.html", "description": "This recipe is a great example of a rich, comforting vegetarian dish. Sure, it's loaded with healthy cabbage and its dark green cousin, kale. But it's also topped with cheese and butter. Vegetarian? Yes. Meager? Certainly not.", "totalTime": "1 hour", "recipeYield": "Serves 6", "recipeCategory": ["Cabbage", "Kale", "Mains", "Vegetarian"], "recipeIngredient": ["Nonstick cooking spray", "3 tablespoons extra virgin olive oil", "1 medium onion, finely chopped (about 1 cup)", "2 medium cloves garlic, minced (about 2 teaspoons)", "1 teaspoon chopped fresh thyme leaves", "1/2 teaspoon red pepper flakes", "Kosher salt and freshly ground black pepper", "1 pound (about 1 small head) cabbage, preferably savoy or Napa, quartered, cored and sliced thinly", "1 pound (about 2 bunches) kale of any type, stemmed, washed and sliced thinly", "2 eggs, lightly beaten", "1 cup cooked rice, white or brown, preferably short grain (about 1/2 raw rice)", "1 cup grated Gruyere cheese, tightly packed", "1/2 cup fresh breadcrumbs", "1 tablespoon butter, cut into tiny cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375°F. Spray a two-quart baking dish with nonstick cooking spray. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large Dutch oven over medium heat until shimmering. Add onion, garlic, thyme and red pepper and cook, stirring occasionally, until onion sweats but does not brown, about 4 minutes. Add cabbage and cook, stirring, until it wilts slightly, about 3 minutes. Add kale and cook, stirring, until all vegetables have softened but retain color and texture, about 10 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly stir eggs, rice and half of the Gruyere cheese into the cooked vegetables. Transfer to greased baking pan, packing down tightly. Top gratin with breadcrumbs and remaining cheese, then dot surface with butter cubes. Bake 40 to 45 minutes, until firm and browned on the top. Allow to sit for 10 to 15 minutes before serving. Serve hot or warm. </p>"}]}