{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130207-239976-beignets.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["american classics", "beignets", "fried dessert", "mardi gras", "New Orleans"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beignets", "link": "https://www.seriouseats.com/recipes/2013/02/beignets-new-orleans-doughnut-donut-how-to-recipe.html", "description": "For folks outside of New Orleans, the square, fried fritters which are covered (perhaps buried) in powdered sugar are probably most closely associated with the French Quarter's famed <strong>Cafe Du Monde</strong>, a coffee shop established back in 1862.", "totalTime": "1 1/2 hours plus overnight rise", "recipeYield": "Makes 32 beignets", "recipeCategory": ["American Classics", "Deep Frying", "Doughnuts", "Mardi Gras", "Pastry"], "recipeIngredient": ["3/4 cup whole milk", "1 1/2 tablespoons instant yeast", "1/2 cup plus 1 tablespoon sugar", "4 cups bread flour plus extra for flouring work surface", "4 tablespoons buttermilk powder", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1 cup water", "2 teaspoons vanilla extract", "Vegetable oil spray for greasing bowl", "2 quarts vegetable oil for frying", "2 cups powdered sugar for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, heat the milk over medium-high heat until small bubbles form along the edges and temperature is between 105 and 110°F. Transfer warm milk to the bowl of an electric stand mixer. Whisk in the yeast and 1 tablespoon sugar. Cover tightly with plastic wrap and set aside for 5 minutes. Mixture should be bubbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl whisk together remaining sugar, flour, buttermilk powder, baking soda and salt. Attach the dough hook to the mixer and add the flour mixture to the yeast mixture while mixing on low speed to moisten ingredients. Slowly add in the water and vanilla then increase the mixer speed to medium and mix until dough comes together in a ball.  Dough will still be wet and tacky. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a large bowl with cooking spray and transfer the dough. Cover the bowl tightly with plastic wrap and refrigerate overnight. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a generously floured work surface, sprinkle the top with flour and roll out into a large rectangle that's approximately  1/3-inch. Use a sharp knife or pizza wheel to cut the dough into 32 approximately 1 1/2-inch squares.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a Dutch oven or deep fryer with 2 inches of oil. Heat oil over medium heat to 350°F. Using a heat-resistant spatula or shallow, heat resistant strainer, carefully drop beignets in the oil. Be careful not to crowd the beignets in the pan (no more than 2 to 3 beignets at a time). After about a minute the dough will begin to puff up, use wooden chopsticks to turn the beignets and fry until deep golden brown on both sides (about 1-2 minutes per side, use the color as your guide keeping a close eye on keeping the oil temperature as constant as possible).  Remove doughnuts immediately from the pan using a heat resistant strainer or tongs. Set on paper towel lined baking racks to cool. Once cooled slightly, heavily dust with confectioner's sugar and serve immediately.</p>"}]}