{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/073013-260771-cook-the-book-limburger-mac-and-cheese-edit.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["cheese", "Cook the Book", "di bruno bros", "limburger", "mac and cheese", "pumpernickel", "tenaya darlington"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Limburger Mac and Cheese from 'Di Bruno Bros. House of Cheese'", "link": "https://www.seriouseats.com/recipes/2013/07/cook-the-book-limburger-mac-and-cheese-from-di-bruno-bros-house-of-cheese.html", "description": "Limburger cheese carries with it many false assumptions and wrinkled noses. It is often avoided based on reputation alone. But Limburger fans know that if you're willing to get past its strong odor, you'll be greeted with a soft grassy cheese with background notes of funky mushrooms. Such fans will often be seen eating Limburger on sandwiches with onions or sardines, but a much better use is in <strong><a href=\"http://madamefromageblog.com/about-me/\">Tenaya Darlington's</a></strong> Limburger mac and cheese from <em><a href=\"http://www.amazon.com/Bruno-Bros-House-Cheese-Darlington/dp/B00COM6OKM/?tag=serieats-20\">Di Bruno Bros. House of Cheese</a></em>.", "totalTime": "1 hour and 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Cook the Book", "Mains", "Pasta", "Vegetarian"], "recipeIngredient": ["3 tablespoons unsalted butter, plus extra for buttering the pan", "4 slices stale pumpernickel bread", "1 large yellow onion, diced", "2 to 3 tablespoons olive oil", "2 cups dry macaroni (8 ounces)", "1/4 cup all-purpose flour", "2 cups whole milk, warmed", "1 (8-ounce) brick Limburger cheese, cubed (with rind)", "1 tablespoon brown mustard", "1 teaspoon salt", "1/4 teaspoon black pepper", "1/2 cup grated Parmigiano Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350° F and butter a 1.5-quart casserole dish or 8 x 8 inch square pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the oven is preheating, set the pumpernickel bread on your oven rack (you can use a cookie sheet, but it’s not necessary) to dry it out. If the bread is already very stale, just give it a good toast. Meanwhile, in a skillet, sauté the chopped onion in olive oil over high heat. Once the edges turn brown, after about 5 minutes, set the onions aside in a bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pumpernickel toast from the oven, and cube it. Then use the sauté pan from the onions to brown the bread cubes. You may need to add a little more oil. Sauté until the bread is very crisp, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stockpot, bring 2 quarts of water to a boil, and add the dry macaroni. Follow the cooking instructions on the package, but cook it about 2 minutes less than required so that the pasta is just approaching al dente; check it after 5 minutes—it should stick to your teeth. Drain the pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cheese sauce, melt the butter in a medium saucepan. Once the butter melts, turn down the heat and whisk in the flour. This will create a thick paste for a roux. Stir constantly for 1 to 2 minutes as the raw flour taste cooks off: it should smell toasty.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually add the warm milk, whisking constantly to prevent lumps from forming. Stir the mixture over medium heat for 10 to 12 minutes, or until the sauce has thickened and coats the back of a wooden spoon. Remove the sauce from heat and stir in the Limburger, brown mustard, sautéed onions, salt, and ground pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sauce over the macaroni and spread the mixture into a prepared casserole dish. Top with a layer of grated Parmigiano, followed by the pumpernickel croutons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 30 minutes or until the sauce around the edges bubbles. Serve with crisp beer and pickles.</p>"}]}