{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/07/07152013-bakethebook-custardysuite.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "custard", "ice cream", "The icecreamists"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Italian Crema Ice Cream", "link": "https://www.seriouseats.com/recipes/2013/07/traditional-italian-crema-ice-cream.html", "description": "Made of nothing more than sugar, cream and eggs, <strong><em>The Ice Creamists</em></strong> present a traditional Italian crema ice cream comprised of an irresistibly rich, eggcellent custard that's good enough to write bad puns.", "totalTime": "overnight, for chilling", "recipeYield": "serves 4", "recipeCategory": ["Bake the Book", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 cup whole milk", " 1/2 cup heavy cream", "4 egg yolks", "1/3 cup plus 1 tablespoon sugar", "Pinch of sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the milk and cream into a large saucepan and heat gently, stirring occasionally, until the mixture begins to steam but not boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk the egg yolks in a heatproof bowl until smooth. Add the sugar and salt and whisk until pale and slightly fluffy. Gradually and slowly, pour the hot milk into the egg mixture while whisking continuously to prevent the eggs from scrambling. Return the mixture to the saucepan and place over low heat, stirring frequently until the custard thinly coats the back of a wooden spoon. Do not let boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour back into the bowl and set aside for about 30 minutes, stirring occasionally, until cooled to room temperature. For more rapid chilling, fill a sink halfway with cold water and ice and place the bowl of mixture in it for 20 minutes. Never put the hot mixture into the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cooled, cover the mixture and refrigerate, ideally <br />\r\novernight, but at least for 6 hours, until thoroughly chilled <br />\r\n(at least 40°F). Pour the chilled mixture into an ice cream <br />\r\nmachine and churn according to the manufacturer’s instructions. If making by hand, see the instructions in previous post. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the churning is completed, use a spoon or spatula <br />\r\nto scrape the ice cream into a freezer-proof container with <br />\r\na lid. Freeze until it reaches the correct scooping texture (at <br />\r\nleast 2 hours). </p>"}]}