{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/032513-245489-cook-the-book-scallion-pancakes.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Chinese", "keywords": ["Cook the Book", "diana kuan", "scallion pancakes", "the chinese takeout cookbook", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Scallion Pancakes from 'The Chinese Takeout Cookbook'", "link": "https://www.seriouseats.com/recipes/2013/03/scallion-pancakes-from-the-chinese-takeout-co.html", "description": "Scallion pancakes are definitely in that category of \"easier-to-make-than-you-think\" foods. All those flaky layers point towards hours of work and folding (like homemade croissants or puff pastry), but in reality these babies can come together in no time. <strong><a href=\"http://appetiteforchina.com/about/diana-kuan\">Diana Kuan's</a></strong> scallion pancakes in <em><a href=\"http://www.amazon.com/The-Chinese-Takeout-Cookbook-Prepare/dp/034552912X/?tag=serieats-20\">The Chinese Takeout Cookbook</a></em> are a prime example.", "totalTime": "1 hour and 15 minutes", "recipeYield": "serves 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bread", "Chinese", "Cook the Book", "Vegetarian"], "recipeIngredient": ["1 1/2 cups all-purpose flour, plus more if necessary", "1/2 cup warm water", "3 tablespoons peanut or vegetable oil, plus more as needed", "3 scallions, thinly sliced", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Oil a large mixing bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate large bowl, mix together the flour and water until a smooth dough forms. If the dough seems sticky, as it tends to do in humid weather, add a little more flour (starting with 1 tablespoon and up to 1/4 cup total, if needed) and mix again until the dough is no longer sticky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the dough on a lightly floured work surface and knead for 5 minutes. Place the dough in the greased mixing bowl and turn until it is lightly covered with oil all around. Cover the dough with a barely damp towel and let it rest for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your work surface again and roll out the rested dough. Divide the dough in half, then roll each half into a 1-inch­ thick cylinder. With a pastry scraper or butter knife, slice the dough into 2-inch-long segments. Dust your rolling pin with flour and roll out each segment into a 5-inch circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly brush the top of each circle with peanut oil, about 2 tablespoons total for all the pancakes. Sprinkle with the scallions and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll up each circle into another cylinder, making sure the scallions stay in place. Coil the dough so that it resembles a snail.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a rolling pin, flatten again into disks 1/4 inch thick. The pancakes will get a little oily from the scallions popping  through the dough. Place the rolled-out pancakes on a plate and repeat with the remaining dough. If you stack the pancakes, put a piece of parchment paper between each layer to prevent sticking. (Whatever you don't cook immedi­ately can be frozen for future use.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a nonstick flat-bottomed skillet or cast-iron skillet over medium-high  heat and add the remaining 1 tablespoon oil. Working in batches, pan-fry the pancakes until golden brown, 2 to 3 minutes on each side. If the sides or middle puff up during cooking, press them down with a spatula to ensure even cooking. (You may also need another tablespoon of oil between batches.) Transfer the pancakes to a plate, cut into wedges, and serve.</p>"}]}