{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/10/20131023-brussels-sprouts-kale-potato-hash-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "brunch", "brussels sprout", "easy", "egg", "hash", "kale", "potato", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Crispy Kale, Brussels Sprouts, and Potato Hash", "link": "https://www.seriouseats.com/recipes/2013/10/crispy-kale-brussels-sprouts-potato-hash.html", "description": "Fall flavors come together in this super quick and easy vegetarian hash made with kale, brussels sprouts, and crispy Yukon gold potatoes.", "totalTime": "25 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Eggs", "Kale", "Mother's Day", "Potato", "Vegetarian"], "recipeIngredient": ["3/4 pound Yukon gold potatoes, cut into 3/4-inch chunks", "Kosher salt and freshly ground black pepper", "3 tablespoons vegetable or canola oil, divided", "12 medium brussels sprouts, finely sliced (about 1 1/2 cups)", "2 cups chopped, tightly packed kale leaves (about 1/2 bunch)", "1 teaspoon hot sauce such as Frank's Red Hot", "1 small onion, finely sliced", "2 tablespoons minced fresh parsley leaves, divided", "2 eggs", "1 tablespoon extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 450°F. In a medium saucepan, cover potatoes with cold salted water and bring to a boil over high heat. Reduce to a simmer and cook until barely tender, about 5 minutes after coming to a boil. Drain potatoes in a colander and let drain for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While potatoes drain, heat 2 tablespoon vegetable or canola oil in a medium non-stick or cast iron skillet over high heat until shimmering. Add potatoes, season with salt and pepper and cook, stirring and tossing occasionally, until well-browned on most sides, about 5 minutes. Add remaining vegetable or canola oil, brussels sprouts, and kale leaves and cook, folding occasionally, until kale and sprouts are starting to wilt. Add onions and continue to cook, stirring and folding occasionally, until all vegetables are softened and starting to crisp. Stir in hot sauce and half of parsley, season to taste with salt and pepper, and remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make two wells in the vegetables and drizzle each with a few drops of olive oil. Add 1 egg to each. Sprinkle with salt and pepper and drizzle with remaining olive oil. Transfer to oven and cook until eggs are barely set, about 5 minutes. Sprinkle with remaining parsley and serve immediately.</p>"}]}