{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/08/20130829-very-small-anna-caramel-apple-flan.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["apple", "caramel", "flan", "pepita"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Caramel Apple Flan with Toasted Pepitas", "link": "https://www.seriouseats.com/recipes/2013/09/caramel-apple-flan-with-toasted-pepitas-924.html", "description": "Cooking apples in a rich buttery caramel and adding a scattering of toasted pepitas ensures this dessert really screams out \"autumn\" on the plate.", "totalTime": "24 hours", "recipeYield": "Serves 10 to 15", "recipeCategory": ["Apple", "Puddings and Custards", "Very Small Anna"], "recipeIngredient": ["<strong>For the Apples</strong>", "2 Granny Smith apples", "3/4 cup sugar", "2 tablespoons butter", "1/2 cup heavy cream", "1 cinnamon stick", "1 vanilla bean, split and scraped", " ", "<strong>For the Flan</strong>", "1 3/4 cup sugar, divided", "1/2 teaspoon salt", "2 tablespoons water", "2 cups milk", "1 cup cream", "1/2 teaspoon ground cinnamon", "1/4 teaspoon ground ginger", "1/4 teaspoon ground cloves", "1/4 teaspoon ground nutmeg", "5 eggs", " ", "<strong>For the Pepitas</strong>", "1 cup pepitas", "Applewood smoked salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the apples</strong>: Peel, core and quarter apples. Cut each quarter crosswise into 1/4 inch thick slices. Combine apples, sugar, butter, cream, cinnamon stick and vanilla bean in a large frying pan and place over medium-high heat. Cook, stirring gently and often, until sugar caramelizes and apples are thoroughly cooked yet still hold their shape. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Flan</strong>: Set 9-inch pie plate or 10 to 15 small cups on a level surface. Place 1 cup sugar in a medium saucepan and add salt and water. Set over medium-high heat and allow to cook until slightly caramelized. Remove from heat and gently swirl until caramel reaches an amber color, somewhere between honey and maple syrup. Pour caramel into baking vessel(s) just to coat the bottom. While caramel is still soft, carefully arrange apple slices evenly on top of it and press down slightly to stick them in place, then top with any caramel left in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a rack in center of oven and preheat to 325°F. Set prepared pan(s) in a large rectangular cake pan, Dutch oven or other larger vessel.  Combine milk, cream, sugar and spices in a medium saucepan and heat over medium, stirring occasionally. Place eggs in a medium mixing bowl and whisk to scramble. Once liquid is hot and sugar is dissolved, gradually pour into eggs, whisking constantly. Immediately pass through a fine mesh strainer into a pitcher or other container from which you can pour comfortably. Open oven and set large baking pan holding smaller vessel(s) in center of rack, then carefully pour hot water about halfway up the sides of flan vessel(s). Cover tightly with aluminum foil and poke several large holes in foil. If baking smaller individual flans, check and rotate after 10 minutes, then continue to rotate every 5 minutes. If baking one large flan, check and rotate after 30 minutes, then continue to rotate every 10 minutes, reducing time to every 5 minutes once flan begins to set around edges. Flan is done when edges are set but center is still quite jiggly, but not liquid. Remove from oven and immediately (and carefully) remove flan(s) from hot water to cool on rack. Once cooled to room temperature, loosely wrap with plastic and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pepitas</strong>: Place rack in center of oven and preheat to 325°F. Evenly spread pepitas on a baking sheet and toast for about 5 minutes&mdash;you will hear them popping in the oven and they will continue to do so once removed. While still hot, toss with salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve</strong>: If you made a large flan, get a serving platter or large plate with a bigger diameter than the pan you used. If you made individual flans, get as many plates as flans you will be serving. Run a paring knife around the edge of the baking vessel, being sure to scrape along the vessel so the flan edge isn't jagged. Invert platter or plate over flan and quickly but carefully flip the whole thing over so the flan rests upside down on the platter or plate. For a large flan, you can help it shimmy out by holding both the pan and the platter and giving it a couple firm shakes; for aluminum cups you can poke a tiny slit in the top to release it. You can tell it's out when caramel gushes out around the flan. Lift the pan or cup straight up. If any apple sticks to the pan, use a paring knife to gently pry it out and replace on flan(s). Garnish each slice or individual flan with pepitas.</p>"}]}