{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/03/2013-baked-pasta-with-sausage.jpg", "author": {"@type": "Person", "name": "Deborah Mele"}, "recipeCuisine": "Italian", "keywords": ["baked pasta", "everyday italian. sausage", "Italian", "mascarpone", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Baked Pasta With Sausage, Mushrooms and Mascarpone", "link": "https://www.seriouseats.com/recipes/2013/04/baked-pasta-sausage-mushroom-mascarpone-recipe.html", "description": "A creamy baked pasta dish combining sausage and mushrooms that is elegant enough to serve guests yet easy enough for a mid-week family meal.", "totalTime": "45 minutes", "recipeYield": "serves 6", "recipeCategory": ["Italian", "Mains", "Pasta"], "recipeIngredient": ["5 tablespoons olive oil , divided", "3 links Italian sausage (about 3/4 pound total), casings removed (see note)", "8 ounces fresh Baby Bella mushrooms, sliced (see note)", "1/3 cup finely chopped onion (about 1/2 medium)", "3 medium cloves garlic, minced (about 1 tablespoon)", "1 1/2 cups mascarpone cheese", "1/2 cup whole milk", "1/4 cup finely chopped fresh parsley leaves ", "Kosher salt and freshly ground black pepper", "1 pound pasta of choice such as penne, rigatoni, fusilli, or pasta shells, (see note)", "1/3 cup coarse breadcrumbs ", "1 1/2 tablespoons finely chopped fresh parsley leaves", "1/4 cup grated Parmesan cheese (about 1/2 ounce)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Meanwhile, heat 2 tablespoons olive oil in a large skillet over medium heat until slightly smoking, and add the sausage meat. Cook until the meat is no longer pink, about 5 minutes, breaking it up with a fork as it cooks. Add the onions, mushrooms, and garlic and cook, stirring often, until the onions are translucent and the mushrooms are lightly browned, about 6 minutes. Reduce the heat to low and add the mascarpone cheese, milk, and chopped parsley. Stir to mix well, and continue to cook until the mixture is thick, about five minutes. Season with salt and pepper, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to the center position and preheat oven to 375&deg;F. Cook the pasta in the boiling water, removing it two to three minutes less than the recommended cooking time. It should still retain a slightly raw bite in the center. Reserve a small cup of pasta water, drain, and return pasta to the pot. Toss the pasta with the mushroom and sausage sauce. If the sauce is very thick add about 1/4 cup of the pasta water to loosen.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine breadcrumbs, parsley, parmesan, and remaining 3 tablespoons olive oil, rubbing the oil into the crumbs with your fingertips.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pasta to a 13- by 9-inch casserole dish (or 6 smaller ones) and sprinkle the crumb topping over the pasta. Bake until the pasta is bubbly and top is golden brown, 20 to 25 minutes. Serve immediately.<br />\r\n</p>"}]}