{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/09/20130917-266770-steak-hazelnutgremolata-primary.jpg", "author": {"@type": "Person", "name": "Suzanne Lehrer"}, "recipeCuisine": "", "keywords": ["cauliflower", "easy", "gremolata", "hazelnut", "make ahead", "quick", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Make-Ahead Steak with Hazelnut Gremolata and Cauliflower", "link": "https://www.seriouseats.com/recipes/2013/09/make-ahead-steak-hazelnut-gremolata-cauliflower.html", "description": "This week's Lunch Box ushers in fall with warm, nutty flavors. Fried hazelnuts serve double duty by acting as a crunchy topping when mixed with parsley and lemon zest, and infusing oil to be slicked on both the steak and the roasted cauliflower.", "totalTime": "30 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Beef", "Cauliflower", "Lunch Box", "Mains", "Nuts"], "recipeIngredient": ["2 tablespoons olive oil", "1/4 cup crushed hazelnuts", "1 small head cauliflower, cut into small florets (about 3 cups florets)", "Kosher salt and freshly ground black pepper", "1 (12 ounce) hanger, skirt, flank, or sirloin tip (flap meat) steak", "1 tablespoon canola, vegetable, or light olive oil", "2 tablespoons chopped fresh parsley", "2 teaspoons grated zest from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425°F. Heat olive oil in small pan over medium-high heat until just shimmering. Add hazelnuts, turn off the heat, and swirl until just golden brown, about 1 minute. Strain oil and reserve hazelnuts. Spoon 1 tablespoon of hazelnut oil over cauliflower and season with salt and pepper. Transfer to a rimmed baking sheet and roast until lightly browned, 20 to 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, season steak with salt and pepper and heat canola, vegetable, or light olive oil in a large skillet over high heat until lightly smoking. Cook steak, turning occasionally, until well browned and center registers 120 to 125°F on an instant read thermometer for medium rare, 130°F for medium, 8 to 10 minutes total. Transfer to a cutting board and allow to rest 10 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine parsley, lemon zest, hazelnuts, and remaining tablespoon hazelnut oil in a small bowl. Season to taste with salt and pepper. Add to cauliflower and toss to coat. Slice steak. Serve, or refrigerate and serve cold or at room temperature.</p>"}]}