{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/06/061413-255157-cook-the-book-chicken-namban.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chicken namban", "Cook the Book", "curry", "hiroko shimbo", "hiroko's american kitchen", "super sauce", "sweet potato", "vinegar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Namban from 'Hiroko's American Kitchen'", "link": "https://www.seriouseats.com/recipes/2013/06/chicken-namban-from-hirokos-american-kitchen.html", "description": "In the spirit of continuing to adapt traditional Japanese dishes to contemporary American palates, <strong><a href=\"http://www.hirokoskitchen.com/bio\">Hiroko Shimbo</a></strong> has created a twist on the Japanese cooking technique known as <em>namban</em>. Here, she infuses sweet curry flavor into boneless, skinless chicken thighs that are pan-seared and then baked.", "totalTime": "About 1 hour, plus 4 hours soaking time for the sauce", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Mains", "Sweet Potatoes and Yams"], "recipeIngredient": ["<strong>Super Sauce</strong>", "1 cup mirin (sweet cooking wine)", "1 cup shoyu (soy sauce)", "3 cups tightly packed katsuobushi (skipjack tuna fish flakes)", "1 ounce kombu (kelp) (about two 4 by 7-inch pieces), cut into 4-inch-long pieces with scissors", "&nbsp", "<strong>Chicken Namban</strong>", "1/4 cup rice vinegar", "3 tablespoons Super Sauce (above)", "2 tablespoons water", "2 tablespoons sugar", "6 tablespoons all-purpose flour", "2 teaspoons Japanese curry powder or Madras curry powder", "1 teaspoon paprika", "8 boneless, skinless chicken thighs (2 pounds)", "1 large Japanese sweet potato or other variety (12 ounces)", "Sea salt", "Canola oil or vegetable oil, for frying", "2 tablespoons thinly sliced scallion (green part only)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Super Sauce:</strong> Place the mirin in a small saucepan over medium heat and bring it to a simmer. Add the soy sauce and bring the mixture to a gentle simmer again. Add and submerge the fish flakes and turn off the heat. Let the sauce sit for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the sauce through a fine-mesh strainer, and discard the fish flakes. Transfer the sauce to a clean glass jar and add the kelp. Refrigerate the sauce, covered with plastic wrap, for 4 hours, then remove and discard the kelp. (Extra sauce can be frozen for up to 3 months.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the chicken namban:</strong> In a bowl, combine the vinegar, Super Sauce, water, and sugar, and set aside. In another bowl, combine the flour, curry powder, and paprika. Dredge the chicken in the flour mixture and let it stand for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the sweet potato into 1 by 3-inch matchsticks. Place the potatoes in a medium pot and cover with cold water. Bring to a simmer over medium heat and cook for 2 minutes. Drain the potatoes in a colander and air-dry. Transfer the potatoes to a paper towel-lined platter to remove any excess water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 inches of canola oil in a deep ovenproof skillet over medium heat to 350°F. Add the potatoes and cook them for 2 minutes or until golden, stirring from time to time. Transfer the potatoes to a wire rack set over a baking sheet to drain and sprinkle with a pinch or two of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Remove most of the oil from the skillet, reserving 2 tablespoons in the skillet. Heat the oil over medium heat, add the chicken, and cook for 3 minutes, or until the bottom is golden. Turn the chicken over and transfer the skillet to the oven. Cook the chicken for 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the skillet from the oven and discard the excess oil from the skillet, reserving the chicken in the skillet. Put the skillet back over medium heat on the stovetop and add the vinegar sauce. Cook for 2 minutes. During cooking, baste the chicken in the skillet with the sauce. The sauce should reduce and become thick, coating the chicken with a velvety layer of sauce. Divide the chicken and sweet potatoes among plates. Garnish with the scallions and serve.</p>"}]}