{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131211-276240-cook-the-book-osaka-style-okonomiyaki.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "bonito", "cabbage", "Cook the Book", "Japanese", "japanese soul cooking", "kewpie", "okonomiyaki", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Osaka-Style Okonomiyaki From 'Japanese Soul Cooking'", "link": "https://www.seriouseats.com/recipes/2013/12/osaka-style-okonomiyaki-from-japanese-soul-coooking.html", "description": "Okonomiyaki are Japanese pancakes, but they're nothing like American flapjacks. Think scallion pancakes, but add cabbage, pork, bonito, nori, fried eggs, and even mayonnaise. The name, loosely translated, means \"what you like, cooked,\" so expect anything and everything when you hear \"okonomiyaki.\"", "totalTime": "15 minutes, plus 10 minutes cooking per pancake", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cabbage", "Cook the Book", "Eggs", "Japanese", "Mains", "Pork", "Snacks"], "recipeIngredient": ["2 cups flour", "1 cup <a href=\"http://www.seriouseats.com/recipes/2009/10/how-to-make-dashi-asian-miso-soup-bonito-flakes-kelp-kombu.html\">dashi</a> or water, cold or at room temperature", "1 teaspoon salt", "1 teaspoon baking powder", "2 teaspoons sugar", "1 pound cabbage, coarsely chopped (about 10 cups) ", "4 eggs", "1/4 cup toasted sesame oil", "8 ounces fresh pork belly, thinly sliced", "&nbsp", "<strong>Toppings</strong>", "Okonomiyaki sauce", "Kewpie mayonnaise or other mayonnaise", "Aonori (powdered nori seaweed)", "Dried, shaved bonito (katsuobushi)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the batter, mix together the flour, dashi, salt, baking powder, and sugar in a large bowl. Add the cabbage to the batter and mix well for at least 30 seconds, until all the cabbage is coated. Add the eggs and mix, lightly this time, for about 15 seconds, or until the eggs are just combined with the cabbage. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a nonstick or cast-iron skillet for at least 5 minutes on medium-low heat. Add 1 tablespoon of the sesame oil, making sure to coat the entire surface of the skillet. Cook the okonomiyaki in batches. Spoon the cabbage and batter mixture into the skillet to form a pancake about 6 inches in diameter and about 1 inch thick. Don’t push down on the cabbage; you want a fluffy pancake. Gently lay about one-fourth of the pork belly slices on top of the pancake, trying not to overlap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the pancake for about 3 minutes. Use a long spatula (a fish spatula is ideal) to carefully flip the pancake, so the side with the pork belly is now facing down. Gently press down on the pancake with the spatula (don’t push too hard, you don’t want batter spilling from the sides). Cook for about 5 more minutes, then flip the pancake again, so the side with the pork belly is now facing up. (If the okonomiyaki comes apart when you flip it, don’t worry; use a spatula to tuck any stray ingredients back into the pancake.) Cook for about 2 more minutes. When it’s ready, the pancake should be lightly browned on both sides, the pork cooked through, and the cabbage inside tender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pancake to a plate, pork side up, and add the toppings. Squeeze about 1 tablespoon of okonomiyaki sauce onto the pancake, in long ribbons. Squeeze about 1 tablespoon of mayonnaise onto the pancake, also in long ribbons. Sprinkle about 1 tablespoon of aonori over the pancake. Sprinkle about 1 tablespoon of dried, shaved bonito over the pancake. (Add more or less of any topping, to taste.) Cut the pancake into quarters and serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the remaining 3 tablespoons oil and pancake batter.</p>"}]}