{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/02/20130215-240230-cook-the-book-polish-country-house-piergoi.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Anne Applebaum", "Cook the Book", "Danielle Crittenden", "From A Polish Country House Kitchen", "peas", "pierogi", "potato", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "From a Polish Country House Kitchen's Pierogi with Potato, Cheese, Bacon, and Peas Filling", "link": "https://www.seriouseats.com/recipes/2013/02/from-a-polish-country-house-kitchens-pierogi.html", "description": "From soup-filled to soup-simmered, I have never met a dumpling I did not like. So it was with great excitement that I flipped open <em><a href=\"http://www.amazon.com/From-Polish-Country-House-Kitchen/dp/1452110557/?tag=serieats-20\">From A Polish Country House Kitchen</a></em> to find not one, not two, but three different recipes for <strong>pierogi</strong>. Pierogi are boiled and then pan fried half-moon dumplings usually filled with some kind of meat, cheese, or potato filling. Pierogi are usually made en masse as a celebratory meal, since all of the kneading, rolling, filling, and boiling can take the better part of a day. <a href=\"http://www.anneapplebaum.com/\">Anne Applebaum</a> and <a href=\"http://www.daniellecrittenden.com/\">Danielle Crittenden's</a> recipe, however, is scaled back to make just enough pierogi for 4 people, so the challenge is a little less formidable. Their classic \"Ruskie\" filling of potatoes, ricotta, bacon, and peas is a humble one, but it is nonetheless delightful.", "totalTime": "2 hours", "recipeYield": "makes 16 to 20 pierogi", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon", "Cook the Book", "Legumes", "Mains", "Pork", "Potato"], "recipeIngredient": ["<strong>Pierogi Dough</strong>", "3 cups (390 g) all-purpose flour, plus additional for kneading", "1 large egg", "2 teaspoons vegetable oil", "1 teaspoon salt, plus more for the boiling water", "1/2 to 3/4 cup (120 to 180 ml) warm water", "&nbsp", "<strong>Filling</strong>", "2 medium potatoes (white, baking, or Yukon gold—whatever you prefer), peeled and cut into chunks", "6 strips bacon", "3 large onions, peeled—1 minced and 2 sliced", "1 cup (130 g) frozen baby peas, defrosted", "9 oz (255 g) ricotta cheese", "Salt and freshly ground pepper", "5 tablespoons unsalted butter, plus more as needed", "1 to 2 cups/240 to 480 ml light sour cream (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pierogi dough:</strong> On a clean work surface, mound the flour and make a well in the center. Add the egg, vegetable oil, and salt to the well and carefully beat together with a fork without incorporating the flour. Continue stirring with a wooden spoon, adding small amounts of the warm water, and gradually incorporating the flour. Only add the next bit of water when the last has been thoroughly blended with the flour and the mixture has become dry. Once the dough has begun to form, lose the spoon and knead the dough with your hands. Stop adding water once all the flour has been incorporated and a soft dough has formed (it should not feel wet or sticky—if it does, add a little more flour).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grab a kitchen timer and set it for 8 minutes. Continue to knead the dough until the timer goes off, dusting the work surface with flour as needed to keep the dough from sticking. It should be smooth and elastic. Invert a bowl over the dough and let it rest at room temperature for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the filling:</strong> Put the potatoes in a large saucepan filled with water, bring to a boil, and continue boiling until soft. Drain and place in a large mixing bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes are cooking, fry the bacon in a large frying pan over medium-high heat until crispy. Remove the cooked bacon and drain on paper towels, but keep 1 or 2 tablespoons of the fat in the pan. Add the minced onion and cook in the bacon fat until it is soft and lightly browned. Add the peas and continue to cook until the peas are just cooked, about 2 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble the bacon and add it to the bowl with the potatoes, along with the cheese. Season generously with salt and pepper, and mash the ingredients together. We use a hand mixer set at a low speed. You can use a food processor if you wish, but be careful not to overprocess: The mixture should be somewhat lumpy—not creamy smooth. Fold in the peas and minced onions. Taste and correct for seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To fill and cook the pierogi:</strong> Bring a large pot of salted to water to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the dough on a lightly floured work surface until about 1/8 inch (3 mm) thick. Cut circles 2 to 3 inches (5 to 7.5 cm) in diameter with either the rim of a glass or a cookie cutter. Spoon about 1 tbsp of filling in the center of each one, and fold the dough over the filling to make a half circle. (Don’t overfill, or the pierogi will become difficult to seal.) Crimp the edges with your fingers or the tines of a fork so they are well sealed (dampen the edges first if necessary).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 2 tablespoons butter over medium heat in the same frying pan you used for the minced onion. Cook the sliced onions until soft and brown. Do not cook them too quickly; this should take 20 minutes or so. Reduce the heat to low if necessary. When done, set aside and keep them warm. You can cover them with foil and place in a warming oven, or an oven set on low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil the pierogi in batches, for 5 minutes after they have floated to the surface of the water. Remove from the water with a slotted spoon and set aside on a large plate or platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large frying pan, melt the remaining 3 tablespoons butter over medium-high heat and lightly brown the cooked pierogi in batches—as many as will fit in the pan without crowding, turning once and adding more butter to the pan if necessary between batches. Transfer to a warm platter. Pour the cooked onions over the tops of the fried pierogi and serve with a bowl of the sour cream on the side for those who would like to dollop some of that on, too.</p>"}]}