{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/11/20131105-272124-cook-the-book-stir-fried-brussels-sprouts.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Thai", "keywords": ["andy ricker", "brussels sprout", "Cook the Book", "pok pok", "stir fry", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andy Ricker's Phat Khanaeng (Stir-Fried Brussels Sprouts) From 'Pok Pok'", "link": "https://www.seriouseats.com/recipes/2013/11/andy-ricker-thai-stir-fried-brussels-sprouts-from-pok-pok-cookbook.html", "description": "I was surprised to see a recipe calling for Brussels sprouts in <strong><a href=\"http://newyork.seriouseats.com/2012/03/we-chat-with-andy-ricker-of-pok-pok.html\">Andy Ricker</a></strong>'s new <em><a href=\"http://www.amazon.com/Pok-Stories-Roadside-Restaurants-Thailand/dp/1607742888/?tag=serieats-20\">Pok Pok</a></em> cookbook. As it turns out, Ricker has spotted a similar vegetable (a cross between Brussels sprouts and bok choy) in stir fries in Northern Thailand. He prepares them simply, in a Chinese-Thai hybrid of a sauce made with oyster and fish sauces, for a sweet, salty, and spicy dish that'd fit in with just about any spread of seasonal dishes&mdash;Thai or otherwise.", "totalTime": "30 minutes", "recipeYield": "Serves 2 to 6", "recipeCategory": ["Cook the Book", "Sides", "Stir Frying", "Thai"], "recipeIngredient": ["10 ounces Brussels sprouts, bottoms trimmed, outer leaves removed, halved lengthwise (about 2 cups)", "Kosher salt", "2 tablespoons Thai oyster sauce", "1 teaspoon Thai fish sauce", "1 teaspoon Thai thin soy sauce", "Small pinch ground white pepper", "2 tablespoons vegetable oil", "11 grams peeled garlic cloves, halved lengthwise and lightly crushed into small pieces in a mortar (about 1 tablespoon)", "6 grams fresh Thai chiles (about 4), preferably red, thinly sliced", "1/4 cup Sup Kraduuk Muu (Pork stock) or water", "1 teaspoon granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Briefly cook the Brussels sprouts:</strong> Bring a large pot of water to a boil, and add enough salt to make it taste slightly salty. Add the Brussels sprouts and cook just until they’re no longer raw but still crunchy, 30 seconds to 1 minute, depending on their size. Drain them well. If you’re not stir-frying them right away, shock them in ice water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Stir-fry and serve the dish:</strong> Combine the oyster sauce, fish sauce, soy sauce, and white pepper in a small bowl and stir well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a wok over very high heat, add the oil, and swirl it in the wok to coat the sides. When it begins to smoke lightly, add the garlic, take the wok off the heat, and let the garlic sizzle, stirring often, until it’s fragrant but not colored, about 15 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the wok back on the heat, and add the Brussels sprouts and chiles. Stir-fry (constantly stirring, scooping, and flipping the ingredients) for 30 seconds to infuse the sprouts with the garlic flavor. Add the oyster sauce mixture (plus a splash of water, if necessary, to make sure nothing’s left behind in the bowl), and stir-fry until the Brussels sprouts are tender but still crunchy and the liquid in the pan has almost completely evaporated, about 45 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock, then add the sugar and stir-fry until the Brussels sprouts are tender with a slight crunch and the sauce has thickened slightly but is still very liquidy, about 30 seconds. Transfer the vegetables and sauce to a plate in a low mound, and serve.</p>"}]}