{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/05/261_TOBACCO%20COOKIES-001.JPG", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "coconut", "Cookies", "Smoke and Pickles"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tobacco Cookies", "link": "https://www.seriouseats.com/recipes/2013/05/tobacco-cookies-recipe.html", "description": "Cigar aficionados, take note: this recipe makes serious use of your favorite indulgence. <strong><em>Smoke &amp; Pickles</em></strong> flavors soft sugar cookie dough with chopped leaves, and the topping is a boiled down mix of molasses, coconut, and tobacco water.", "totalTime": "1 hour", "recipeYield": "makes about 24 cookies", "recipeCategory": ["Bake the Book", "Coconut", "Cookies"], "recipeIngredient": ["<strong>Tobacco Coconut Flakes</strong>", "1 cup firmly packed sweetened coconut flakes", "1 1/2 cups brewed coffee", "3/4 cup cola", "2 teaspoons molasses", "2 tablespoons sugar", "2 tablespoons Tobacco Water (recipe follows)", " ", "<strong>Cookies</strong>", "1 1/4 cups all-purpose flour", "1/4 teaspoon baking powder", "Pinch of salt", "14 ounces semisweet chocolate, chopped", "2 tablespoons unsalted butter", "2 large eggs", "1/3 cup sugar", "1 tablespoon buttermilk", "1 teaspoon vanilla extract", "2 teaspoons chopped tobacco leaves (reserved from cigar used to make Tobacco Water)", " ", "<strong>Tobacco Water</strong>", "1 good cigar", "3 cups warm water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 355°F. Line a baking sheet with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the tobacco water: Peel half of the layers off the cigar and discard. Separate the inner tobacco leaves. Reserve 2 tablespoons' worth of chopped leaves to use in cookies; set aside. Rinse remaining leaves under warm water for 3 minutes. Fill a small bowl with the 3 cups warm water and steep the tobacco leaves in the water for 10 minutes. Strain the water and discard the tobacco leaves. The tobacco water will be quite strong, with a nicotine sting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the coconut flakes: In a medium saucepan, combine the coconut, coffee, cola, molasses, sugar, and tobacco water. Bring to a boil over high heat and boil for about 20 minutes, until all the liquid has been cooked off. Transfer the coconut flakes to a baking sheet and allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cookies: In a small bowl, combine the flour, baking powder, and salt and stir together with a fork. Melt the chocolate and butter over a double boiler. Allow to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, whisk together the eggs, sugar, buttermilk, vanilla, and tobacco. Stir into the chocolate mixture, then stir the flour mixture into this batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the dough 1 tablespoon at a time onto the prepared baking sheet. Leave room in between for the cookies to spread while baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top each cookie with a little of the tobacco coconut flakes. Bake for 10 to 12 minutes, until the cookie tops crack but the cookies are still soft in the center. Let cool for 3 minutes before handling. Lift with a spatula and transfer the cookies to a wire rack. Or let cool completely and store in an airtight container for up to a week.</p>"}]}