{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140427-287990-dinner-tonight-cod-and-kale.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["Asian", "cod", "easy", "fish", "kale", "one pot", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "One-Skillet Cod and Kale With Ginger and Garlic", "link": "https://www.seriouseats.com/recipes/2014/03/one-skillet-cod-kale-ginger-recipe.html", "description": "Cod and kale may seem like an unlikely combination, but, when cooked until tender, the robust green actually makes a fantastic backdrop to the delicate, white-fleshed fish. In this quick and easy one-skillet dinner, we braise dinosaur kale (also known as Tuscan kale) in an aromatic mixture of rice wine, sesame oil, garlic, and ginger, then steam fillets of codfish on top.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dinner Tonight", "Fish", "Kale", "Mains"], "recipeIngredient": ["2 tablespoons sesame oil, divided ", "2 medium garlic cloves, minced (about 2 teaspoons)", "One (1-inch) piece fresh ginger, peeled, minced (about 1 tablespoon)", "1 large bunch dinosaur kale (about 1 pound), thick stems discarded and leaves roughly chopped (about 2 1/2 quarts)", "1/2 cup rice wine ", "Four (6- to 8-ounce) cod fillets (or other firm white fish)", "2 tablespoons soy sauce", "1 tablespoon toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon sesame oil in a large skillet over medium heat until shimmering. Add garlic and ginger and cook, stirring, until aromatic, about 30 seconds. Add kale, and, using tongs, toss to coat. Add rice wine. Bring to a simmer, cover and cook until kale leaves are tender, 8 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cover and set the fish fillets on top of the kale. Drizzle soy sauce and the remaining 1 tablespoon sesame oil over the fish and kale. Cover and cook until fish is just cooked through, 5 to 7 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the fish and kale between four plates and sprinkle toasted sesame seeds on top. Serve.</p>"}]}