{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140226-284257-cook-the-book-salt-cod-orange-and-olive-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Spanish", "keywords": ["cod", "Cook the Book", "fish", "olive", "orange", "salad", "seafood", "spain", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salt Cod, Orange, and Olive Salad (Remojón de Naranja) From 'Spain'", "link": "https://www.seriouseats.com/recipes/2014/02/salt-cod-orange-and-olive-salad-remojon-de-na.html", "description": "Salt cod makes several appearances in <a href=\"http://jeff-koehler.com/?page_id=2\" target=\"_blank\">Jeff Koehler</a>'s new cookbook, <em><a href=\"http://www.amazon.com/Spain-Recipes-Traditions-Verdant-Andaluc%C3%ADa/dp/0811875016/?tag=serieats-20\" target=\"_blank\">Spain</a></em>. Some recipes use it for seasoning rather than a centerpiece, while others offer it on a plate with little more than olive oil. I wanted to strike a balance between the two, and chose to prepare a simple salad of salt cod, orange, and black olives.", "totalTime": "20 minutes, plus 36 to 48 hours to soak the cod", "recipeYield": "serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Eggs", "Fish", "Olives", "Orange", "Salads", "Sides", "Spanish"], "recipeIngredient": ["6 ounces (170 g) salt cod, preferably from a single thick center-cut loin piece", "1/4 cup (60 ml) extra-virgin olive oil, plus more for the pan", "2 ripe large valencia oranges", "1 scallion, thinly sliced", "12 to 20 black olives, pitted and sliced", "2 hard-boiled eggs, peeled and quartered lengthwise (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin desalting the salt cod 2 to 3 days before (depending on the cut): Dry salt cod—<em>bacalao</em>—needs to be desalted before using. Soaking in water removes the salt, rehydrates the cod, and softens the flesh. The process takes at least 36 hours to 2 days, changing the water at least four to six times; fatter loin pieces can take as long as 4 days; the thickest loin pieces can take even longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the cod under cool running water. Place skin-side up (to keep the salt from concentrating here) in a bowl and cover with fresh water. Change the water immediately, rinse out the bowl, and refill with cool water. Arrange the pieces in the bowl skin-side up. Place the bowl in the refrigerator and let the cod soak for 12 hours. Drain, rinse out the bowl, change the water, and soak for another 12 hours. Change the water every 6 to 8 hours or so for the next 24 hours. Place the pieces skin-side down during the final 12 hours. Drain the cod, rinse, and gently squeeze out some of the excess water. Place in a strainer—with the skin side up again—and let drain for at least 30 minutes. (For certain recipes where you don’t want any salty moisture running into the sauce, I recommend draining for significantly longer.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To check if it is ready, take a pinch of the fish and taste. It should be slightly salty but not disagreeably so. (If it is too salty, change the water and continue to soak.) Drain, rinse, gently squeeze out excess moisture, and pat dry with paper towels. Carefully debone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a skillet over high heat and lightly oil it. Lay on the cod and cook only until it can be flaked apart, 4 to 6 minutes depending on the thickness. Transfer to a plate. Remove the skin and gently flake apart, carefully checking for any bones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Section the orange segments. To do this, peel the oranges and then trim any white pith with a sharp knife. Carefully cut along the membranes and remove the individual segments. Set the segments in a bowl along with any juices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cod to the bowl along with the scallion and olives. Drizzle over the olive oil and gently toss. Divide the salad among plates and garnish each with hard-boiled egg, if desired.</p>"}]}