{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140425-bake-the-book-teenys-tour-of-pies-straw-rhubarb.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["fruit", "pie", "rhubarb", "strawberry", "Teeny's Tour of Pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Teeny Lamothe's Strawberry Rhubarb Pie", "link": "https://www.seriouseats.com/recipes/2014/04/teeny-lamothes-strawberry-rhubarb-pie.html", "description": "What better way to celebrate the change of seasons than with the sweet-and-tart combination of berries and rhubarb? This old standby contains just fruit, sugar, and a little something to thicken it up, all wrapped up in a whole wheat crust.", "totalTime": "1 hour", "recipeYield": "makes 1 9-inch or 4 5-inch pies", "recipeCategory": ["Bake the Book", "Desserts", "Fruit Desserts", "Pies, Tarts, and Crumbles", "Rhubarb", "Strawberry"], "recipeIngredient": ["1 to 1.5 pints strawberries, hulled and cut into 1/4-inch-thick slices (2 1/2 cups)", "2 to 3 stalks rhubarb, diced (.5-inch to 1-inch pieces, equal to 2 cups)", "1 tablespoon freshly squeezed lemon juice", "1/4 cup granulated sugar", "1/4 cup packed light brown sugar", "1/2 cup quick-cooking tapioca, finely ground", "2 disks dough from Whole Wheat Crust (ingredients below)", "Up to 1/4 cup all-purpose flour, for rolling out the crust", "&nbsp;", "<strong>Whole Wheat Crust</strong>", "1 1/2 cups all-purpose flour ", "1 cup white whole wheat or whole wheat flour", "2 teaspoons salt", "2 tablespoons granulated sugar", "3/4 cup (1 1/2 sticks) cold unsalted butter, cut into small pieces", "1/2 cup (4 tablespoons) cold vegetable shortening", "1/4 cup (4 tablespoons) cold vodka ", "1/2 cup (8 tablespoons) cold water, plus extra as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pie crust:</strong> In a large bowl, stir together the flour, salt, and sugar until everything is thoroughly combined. Add the butter and shortening and cut the mixture together using a pastry cutter until it forms small pea-size crumbs coated in flour. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the vodka evenly over the dry ingredients, a few tablespoons at a time, using a rubber spatula to press the dough together. Similarly, add the water, and continue to press the dough together to form a large ball. The dough should be fairly wet and sticky; if for some reason it seems particularly dry, add a little extra ice water a tablespoon at a time until everything comes together easily. (Be careful to work the dough as little as possible; otherwise the crust may be tough.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into two equal balls, press each into a disk, wrap each in plastic, and refrigerate for at least an hour or up to 2 days before rolling out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F with a rack in the middle position.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the strawberries, rhubarb, and lemon juice in a medium bowl and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the sugars and tapioca in a small bowl. Sprinkle the sugar mixture over the fruit, tossing gently with your hands or a spoon to coat evenly. Set aside while you roll out the crust; the fruit will begin to juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the bottom crust: Place one disk of the dough on a floured work surface, and with a floured rolling pin, roll it into a rough 11-inch circle about 1/8 inch thick. Lay the crust into a 9-inch pie plate, gently press it in, and trim any excess dough from the edge with a paring knife, being sure to leave a 3/4-inch overhang.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Give the filling one final stir to make sure the fruit is evenly coated, then spoon the mixture into the crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the top crust: On a floured work surface with a floured rolling pin, roll out the remaining dough disk into a rough 11-inch circle about 1/8 inch thick. Carefully lay the crust on top of the filling, and trim any excess dough from the edge, leaving a 3/4-inch overhang. Tuck the overhanging dough under the overhanging edge of the bottom crust, and crimp the two crusts together. Cut a few small slits in the top crust with a sharp knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the pie on a rimmed baking sheet and bake until the filling is thickly bubbling and the crust is golden brown (cover it with foil if it begins to brown too quickly), 40 to 50 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make ’Em Teeny Pies</strong> In step 7, divide one disk of the dough into four equal balls and roll out each into a rough 6-inch circle about 1/8 inch thick. Lay each into a 5-inch pie tin, and trim any excess dough from the edge, being sure to leave a 1/2-inch overhang.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Give the filling one final stir and spoon an equal amount into each crust-lined teeny tin (roughly 1 cup each).<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In step 9, divide the remaining dough into four equal pieces and roll out each into a rough 7-inch circle, about 1/8 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully lay the crusts over the filling, and trim any excess dough from the edge, leaving a 1/2-inch overhang. Tuck the overhanging dough under the bottom crust and crimp the two crusts together, pressing to seal. Cut a 1/2-inch slit in the top of each pie to allow steam to escape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the Teeny Pies on a rimmed baking sheet and bake until the crusts are golden brown, 40 to 45 minutes.</p>"}]}