{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140901-Short-Rib-Gouda-Caramelized-Onion-Grilled-Cheese-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["beef", "cheese", "onion", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Short Rib, Caramelized Onion, and Gouda Grilled Cheese", "link": "https://www.seriouseats.com/recipes/2014/09/grilled-cheese-beef-short-rib-sandwich-gouda-onion-recipe.html", "description": "This insanely delicious sandwich requires a little more prep work than most but it is absolutely worth it: Filled with juicy, shredded beef short rib, sweet and tender caramelized onions, melted Gouda cheese, and a sharp mustard sauce, then tucked into griddled marbled rye bread, they're far more than just an easy snack. This is an indulgent meal unto itself.", "totalTime": "4 hours", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Cheese", "Mains", "Onion", "Sandwiches", "Sunday Supper"], "recipeIngredient": ["<strong>For the Short Ribs:</strong>", "1 1/2 tablespoons extra-virgin olive oil", "3 1/2 pounds bone-in beef short ribs", "Kosher salt and freshly ground black pepper", "1 large yellow onion, quartered", "2 carrots, peeled and cut into large chunks", "1 stalk celery, cut into large chunks", "2 medium cloves garlic, smashed", "1 3/4 cups dry red wine", "1 cup beef stok or low-sodium broth", "1 1/2 tablespoons Worcestershire sauce", "1 1/2 teaspoons soy sauce", "4 sprigs fresh thyme", "2 bay leaves", "<strong>For the Onions:</strong>", "1 tablespoon unstalted butter", "1 tablespoon extra-virgin olive oil ", "1 large sweet onion, such as Vidalia, thinly sliced (about 2 cups)", "3 sprigs fresh thyme", "1 teaspoon sugar", "Kosher salt and freshly ground black pepper", "<strong>For the Mustard Sauce:</strong>", "1/4 cup whole-grain mustard", "2 tablespoons sour cream", "<strong>For the Sandwiches:</strong>", "4 tablespoons unsalted butter", "8 slices seeded marbled or regular rye bread", "8 thick slices Gouda cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Short Ribs:</strong> Adjust oven rack to lower-middle position and preheat oven to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large Dutch oven over medium-high heat until shimmering. Season short ribs with salt and pepper. Working in batches, brown short ribs on all sides, about 8 minutes per batch. Transfer ribs to a platter and reduce heat to medium. Add onion, carrots, celery, and garlic and cook, stirring, until the vegetables begin to soften, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return meat to Dutch oven and add wine. Bring to a boil, then reduce heat and simmer for 3 minutes, scraping up any browned bits from the bottom of the pan. Add broth, Worcestershire sauce, soy sauce, thyme, and bay leaves. Season with salt and pepper and return to a simmer. Cover, transfer to the oven and cook until beef is fork-tender, 3 to 3 1/2 hours; add 1/4 to 1/2 cup water halfway through, if necessary, to keep meat halfway submerged in liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer ribs to a clean platter. Pour sauce through a fine strainer into a large heatproof bowl; discard solids. Skim fat from sauce and discard. Pull meat from bones and shred, discarding bones and any large pieces of fat. Season sauce with salt and pepper. Add shredded meat to sauce and toss to combine, allowing meat to absorb the liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, For the Onions:</strong> Heat butter and olive oil in a large skillet over low heat until butter is melted. Add onions and thyme. Cover and cook, stirring periodically, until soft and translucent, about 15 minutes. Remove cover, add sugar and season with salt and pepper. Raise heat to medium-high and cook, stirring often and adding water 1 tablespoon at a time if onions begin to burn, until onions are deep brown, about 15 minutes. Discard thyme.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mustard Sauce:</strong> In a small bowl, mix together mustard and sour cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sandwiches:</strong> Preheat a sandwich grill, panini press, or two heavy skillets until hot but not smoking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread butter on 1 side of each rye bread slice. Spread Mustard Sauce on opposite side of each slice. Set 4 of the bread slices, Mustard Sauce side up, on a work surface, and top each with 1 slice of cheese, then caramelized onions, shredded beef, and finally the remaining slices of cheese. Close sandwiches, butter side up, with the remaining bread slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches if necessary, cook the sandwiches, compressing them within the panini press or 2 skillets (or even in 1 hot skillet while pressing down with a sturdy spatula) until cheese is melted and filling is warmed through, about 5 minutes total; if cooking surface doesn't heat evenly, rotate and flip sandwiches halfway through cooking. Serve immediately.</p>"}]}