{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131213-preserved-pearcaramel-pears-jar.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["caramel", "cardamom", "pear", "preserve", "sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pear-Cardamom Caramel", "link": "https://www.seriouseats.com/recipes/2014/02/pear-cardamom-caramel.html", "description": "This caramel, folded with cooked down pears, has a lush, fudgy texture. Ginger and cardamom lend their herbaceous, spicy flavors which, alongside a generous pinch of salt, make for a sophisticated sweet.", "totalTime": "1 hour", "recipeYield": "4 and 1/2 half-pint jars", "recipeCategory": ["Condiments and Sauces", "Pear", "Preserved"], "recipeIngredient": ["4 very ripe bartlett or anjou pears", "1/2 and 1/4 cup water, divided", "1 pint (2 cups) heavy cream", "6 green cardamom pods", "2 cups sugar", "1/2 cup (1 stick) butter", "1/2 teaspoon salt", "1/8 teaspoon ground ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat heavy cream in a small saucepan. Crush cardamom pods to expose seeds and add pods and seeds to cream.  Just before cream boils (when wisps of steam begin to rise from the surface), remove from heat and cover. Allow to steep while you prepare other ingredients. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roughly chop pears (cores, seeds, and all) and bring to a boil in a small saucepan with 1/4 cup of water. Cover pears and cook over low heat, stirring every few minutes, until very soft and falling apart, about 20-30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle pear mixture into a food mill and turn mill until all that remains are the skins and seeds. Return the pear pulp to the saucepan and continue to cook over low heat, stirring frequently, until reduced by half. You should have about a cup of dense, cooked pear. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you’re ready to proceed, strain cardamom seeds and pods out of cream and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this point you’ll need to give the mixture your undivided attention. In a large, heavy-bottomed saucepan with a volume of at least three quarts, Stir together the sugar and 1/2 cup water over medium heat until just dissolved. Increase heat to the highest setting. Boil sugar and water mixture, undisturbed. At first, it will appear clear. After about 8 minutes it will begin to go golden at the edges of the pot. Swirl the syrup as it cooks to redistribute the caramel. When your caramel has reached your desired level of color (golden brown, or slightly burned and copper colored) take it off the heat and stir in the cream, whisking briskly.  When bubbling has subsided add the butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk in pear puree, ground ginger and salt. Return pot to the stove and cook mixture together over low heat until everything is homogenized. Allow to cool slightly and pour into jars. Caramel must be stored in the refrigerator and will keep well for 2-3 weeks, should it last that long. <br />\r\n</p>"}]}