{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141020-btb-ovenly-stumptown-shorty.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "caramel", "coffee", "dessert", "ovenly", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Stumptown Shorty From 'Ovenly'", "link": "https://www.seriouseats.com/recipes/2014/10/the-stumptown-shorty-from-ovenly.html", "description": "Sure, most shortbread seems the same on the surface. But break one of these babies apart and you'll see glassy hunks of burnt sugar, and a speckling that comes from finely ground espresso. To further the freshly-roasted flavor, this recipe from <em>Ovenly</em> calls for two tablespoons of cold-brew coffee as well.", "totalTime": "45 minutes", "recipeYield": "Makes 24 cookies", "recipeCategory": ["Bake the Book", "Brownies and Bars", "Desserts"], "recipeIngredient": ["1/2 cup burnt sugar bits (ingredients and instructions below)", "Softened butter, for greasing the rimmed sheet pan + 1 1/2 cups (24 tablespoons, 12 ounces) unsalted butter, at room temperature ", "1 cup + 2 tablespoons confectioners’ sugar", "1 teaspoon salt", "2 tablespoons cold-brew coffee (or fresh strong espresso, cooled)", "2 3/4 cups all-purpose flour", "2 tablespoons very finely ground espresso", "Turbinado sugar, for garnish", "<strong>Burnt Sugar</strong>", "1 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the burnt sugar: Spray a 9 x 13-inch rimmed sheet pan with nonstick cooking spray. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sugar into a heavy-bottomed skillet, and heat over medium-high heat. Mix the sugar continuously with a wooden spoon until it has completely melted (no visible granules) and is dark golden-brown. Do not burn the sugar. As you are stirring, break any sugar clumps apart with the wooden spoon. The entire process should take about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pour the melted sugar onto the prepared rimmed sheet pan and, using a rubber spatula, spread it out evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the burnt sugar cool completely at room temperature. Once it has completely hardened, about 30 minutes, turn the hardened sugar out onto a cutting board. Using a knife, chisel or small hammer, crack the sugar into bits about 1/4-inch in size. The burnt sugar bits can be kept indefinitely in an airtight container stored in a cool, dry place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heavily butter the bottom and sides of a 9 x 13-inch rimmed sheet pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with a paddle attachment (or using a hand mixer), mix the 1 1/2 cups butter, confectioners’ sugar and salt together on low speed for 10 seconds, and then increase to medium-high speed and blend until light and fluffy, about 3 minutes. You want the butter mixture to be cold to the touch but not clumpy. Add the cold brew coffee at a low speed. Increase the speed to medium-high and mix until fully incorporated, about 30 seconds. Scrape down the sides of the bowl with a rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate large bowl, whisk together the flour and ground espresso. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, mix 1/4 cup of the flour mixture with the burnt sugar bits. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the machine off, add half of the flour mixture to the butter mixture. Turn on low and mix about 30 seconds. Turn the machine off again, add the remaining half of the flour mixture and mix until just incorporated, another 30 seconds. Add the coated burnt sugar bits and mix on low speed for another 5 seconds, or until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the dough evenly onto the prepared sheet pan. Place a layer of plastic wrap on top, and using a rolling pin, roll the dough to smooth the top and to ensure the dough is spread evenly on the rimmed sheet pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350⁰F. Top the dough with turbinado sugar and place in the oven. Bake, turning halfway through, for 18 to 20 minutes, or until the dough looks puffy and the middle is set. Let the shortbread cool completely before cutting it into 24 approximately 2-inch squares.</p>"}]}