{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140602-294465-cook-the-book-shredded-beef-enchiladas.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "the homesick texan's family table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Shredded Beef Enchiladas With Three-Chile Sauce From 'The Homesick Texan's Family Table'", "link": "https://www.seriouseats.com/recipes/2014/06/shredded-beef-enchiladas-with-three-chile-sau.html", "description": "I didn't grow up in Texas, but I did eat my fair share of Tex-Mex as a kid. Saucy burritos, sizzling fajitas, and giant bowls of cheese dip all hold fond places in my heart, even as I have grown to love a two-bite chorizo taco much. One of my favorite dishes to order at these restaurants was the enchilada platter, drenched in red sauce and smothered in melty Mexican blend cheese.", "totalTime": "about 4 hours", "recipeYield": "serves 4 to 6", "recipeCategory": ["Beef", "Cheese", "Cook the Book", "Gluten-Free", "Mains"], "recipeIngredient": ["<strong>Beef</strong>", "2 pounds chuck roast, cut into 2 equal‐size pieces (make sure there’s some fat on the roast)", "Salt and black pepper", "1 tablespoon bacon grease, lard, or vegetable oil", "1 yellow onion, chopped", "4 cloves garlic, chopped", "1/2 cup brewed coffee", "2 tablespoons Worcestershire sauce", "2 tablespoons apple cider vinegar", "2 canned chipotle chiles in adobo sauce", "2 teaspoons ground cumin", "1/4 teaspoon ground cinnamon", "1 cup water", "&nbsp", "<strong>Sauce</strong>", "2 dried pasilla chiles, rehydrated, stemmed, and seeded", "2 dried ancho chiles, rehydrated, stemmed, and seeded ", "1 cup water", "1 tablespoon vegetable oil", "2 tablespoons masa harina or all‐purpose flour", "1 teaspoon ground cumin", "1 teaspoon dried oregano", "Pinch of ground allspice", "Salt and black pepper", "&nbsp", "<strong>Enchiladas</strong>", "1 tablespoon lard or vegetable oil", "12 corn tortillas", "2 cups (8 ounces) shredded cheddar cheese", "1/4 yellow onion, diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 275°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the roast with salt and pepper. In a large ovenproof pot, heat the bacon grease over medium-low heat, add the meat, and brown on both sides, about 5 minutes per side. remove the roast from the pot and add the onion. Cook, occasionally stirring, until the onion begins to brown, about 5 minutes. Add the garlic and cook for 30 seconds more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>return the roast to the pot along with the coffee, Worcestershire sauce, vinegar, chipotle chiles, cumin, and cinnamon, and water. (The meat will not be completely covered, but don’t worry; it will produce plenty of liquid as it cooks.) Bring the pot to a boil; cover the pot and place in the oven. Cook the roast, covered, for 3 to 3 1/2 hours, or until the roast practically falls apart when you poke it with a fork. (Be careful of escaping steam when removing the pot’s lid.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the meat from the pot, leaving the broth in the pot to cool. Shred the meat with two forks until it’s in long strands. Add salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the sauce, pour the broth from the pot into a blender or food processor, along with the onions, garlic, and chipotle chiles also in the pot. Add the rehydrated pasilla and ancho chiles and water. Blend until smooth, about 1 minute. You should have 2 to 2 1/2 cups of sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pot, heat the oil over medium-low heat. Whisk in the masa harina or flour until it’s well incorporated and fragrant, about 30 seconds. Pour the sauce from the blender into the pot, stirring until it’s well combined. Stir in the cumin, oregano, and allspice, and add salt and pepper to taste. Cook over low heat (be careful, because it will probably splatter out of the pot as it cooks) for 5 to 10 minutes, stirring occasionally, until the sauce is smooth and the flavors are balanced. Taste and adjust the seasonings. Toss the shredded beef with 2 tablespoons of the sauce, leaving the rest for the enchiladas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Grease a large baking dish (9 by 13 inches works well).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the enchiladas, in a medium skillet, heat the lard over medium-low heat. One at a time, heat the tortillas in the hot oil until soft and pliant, and then keep them wrapped in a cloth or tortilla warmer until all the tortillas are heated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a tortilla on a plate or clean surface and add about 1/4 cup of beef. Roll the tortilla and place in the greased baking dish seam-side down. Repeat with the remaining tortillas. Evenly pour the sauce over the enchiladas and top with the grated cheese and diced onion. Bake for 15 minutes, or until cheese is lightly browned and bubbling. Serve immediately.</p>"}]}