{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140723-change-of-appetite-nectarine-salad-laura-edwards.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "Japanese", "keywords": ["a change of appetite", "chicken", "Cook the Book", "cucumber", "Japanese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Japanese Ginger and Garlic Chicken With Smashed Cucumber From 'A Change of Appetite'", "link": "https://www.seriouseats.com/recipes/2014/07/japanese-ginger-and-garlic-chicken-with-smash.html", "description": "This recipe, from Diana Henry's new cookbook, <a href=\"http://www.amazon.com/A-Change-Appetite-Diana-Henry/dp/1845338928/?tag=serieats-20\"><em>A Change of Appetite,</em></a> is not for the faint of heart. A garlicky, slightly sweet marinade with a whopping two-thirds of a cup of spicy grated ginger does not leave the chicken thighs wanting for any flavor, I'll tell you that.", "totalTime": "1 hour 35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Cucumber", "Ginger", "Japanese", "Mains"], "recipeIngredient": ["For the Chicken", "3 1/2 tablespoons soy sauce", "3 tablespoons sake or dry sherry", "3 tablespoons soft dark brown sugar", "1/2 tablespoon brown miso", "2/3 cup peeled and finely grated ginger", "4 garlic cloves, finely grated", "1 teaspoon togarashi seasoning, or 1/2 teaspoon chilli powder", "8 good-size skinless, bone-in chicken thighs, or other bone-in chicken pieces", " ", "For the Cucumber", "1 1/2 cucumbers", "2 garlic cloves, coarsely chopped", "2 teaspoons sea salt", "2 tablespoons pink pickled ginger, very finely shredded", "Small handful of shiso leaves, if available, or mint leaves, torn (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix everything for the chicken (except the chicken itself) to make a marinade. Pierce the chicken on the fleshy sides with a knife, put the pieces into a shallow dish and pour the marinade over. Massage it in well, turning the pieces over. Cover and put in the fridge for 30–60 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you’re ready to cook, preheat the oven to 350°F. Take the pieces out of the marinade and put them in a shallow ovenproof dish in which they can sit snugly in a single layer. Pour over half the marinade. Roast in the oven for 40 minutes, basting every so often with the juices and leftover marinade (don’t add any leftover marinade after 20 minutes, it needs to cook properly as it has had raw chicken in it). Check for doneness: the juices that run out of the chicken when you pierce the flesh with a knife should be clear and not at all pink.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken is halfway through cooking, peel and halve the cucumber and scoop out the seeds. Set on a board and bang the pieces gently with a pestle or rolling pin. This should break them up a little. Now break them into chunks with your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crush the garlic with a pinch of the salt and massage this&mdash;and the rest of the salt&mdash;into the cucumber. Put in a small plastic bag, squeeze out the air and put in the fridge for 10 minutes. When you’re ready to eat, tip the cucumber into a sieve so the juices can drain away. Add the shredded ginger. You can add shiso leaves if you can find them (I can’t, I have no Japanese shop nearby). Nothing else really tastes like it, but I sometimes add mint. Serve the chicken with brown rice or rice vermicelli (the rice vermicelli is good served cold) and the cucumber.</p>"}]}