{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140711-pitt-cue-cookbook-ribs-paul-winch-furness-garrett-ziegler.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["barbecue", "beef", "Cook the Book", "pitt cue co", "rib", "rub"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Beef Ribs From 'Pitt Cue Co.: The Cookbook'", "link": "https://www.seriouseats.com/recipes/2014/07/beef-ribs-from-pitt-cue-co-the-cookbook.html", "description": "The four partners from the London BBQ restaurant Pitt Cue Co. are serious about their meat. In the new (to the U.S.) <a href=\"http://www.amazon.com/Pitt-Cue-Co-Cookbook-Adams/dp/1845337565/?tag=serieats-20\"><em>Pitt Cue Co.: The Cookbook</em></a>, they strongly encourage homecooks to get serious, too. This recipe turned out smoky, unctuous, crazy flavorful ribs. It is one of the simpler preparations in the book, requiring only the ribs and the House Rub; sauce is optional and unnecessary.", "totalTime": "5 to 6 hours", "recipeYield": "Serves 2", "recipeCategory": ["Beef"], "recipeIngredient": ["One 4- to 6-bone beef rib rack, weighing 1 pound 2 ounces to 1 pound 5 ounces                    ", "1/3 cup <a href=\"http://www.seriouseats.com/recipes/2014/07/house-rub-from-pitt-cue-co-the-cookbook.html\">House Rub</a>", "Mother Sauce or Pitt Cue Barbecue Sauce,  (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crucial to the eating of the beef rib is the removal of the membrane on the underside, especially with a well-aged rib. Unlike the pork rib membrane, which is fresh and thin, the membrane on the underside of the beef rib is thick and a bit of a pain. To remove it, score down each side of the individual bones, being careful not to cut into the flesh. Get a proper butcher’s knife with some flexibility and work up the rib, removing the membrane with as little flesh as possible. Try to keep the knife as flat as you can to the flesh, just skinning the membrane from it. The removed membrane should be about\u2028 3/4 inch wide and run the entire length of each rib. All that will remain is a small section of membrane on the rib bone itself, which is a fair compromise. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the rack all over with the rub. Prepare a barbecue for <a href=\"http://www.seriouseats.com/2011/05/guide-to-grilling-smoking-on-a-charcoal-kettle-grill.html\">smoking</a> and set the temperature to 230°F, though anything up to 265°F will produce tasty beef ribs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>There is a huge amount of fat running through the intercostal muscles of the beef rib, which can take a bit of a battering through temperature rises without drying out: 230°F is ideal, but don’t panic if the barbecue peaks and dips in temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smoke the rack for 5 to 6 hours, or until the meat has pulled back from the bone. By then the rack will have the French trim effect, with the bone a little bit exposed. The internal temperature should be about 192° to 197°F, the meat squishy and soft with a thick dark crust. We like the ribs naked, but if you prefer them with sauce, give them a good basting with Mother Sauce or barbecue sauce 30 minutes before removing them. Alternatively adjust the barbecue for direct grilling and paint them constantly with the sauce while turning them over the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The smell of a newly smoked beef rib is unbelievable. Serve immediately, with some <a href=\"http://www.seriouseats.com/recipes/2014/07/crispy-pickled-shiitake-from-pitt-cue-co.html\">Pickled Shiitake</a> to boost that amazing umami beefiness while balancing the richness.</p>"}]}