{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/061114-295149-Serious-Eats-Sunday-Supper-Fennel-Cinnamon-Chicken-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["chicken", "cinnamon", "fennel", "lemon", "potato", "roast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fennel- and Cinnamon-Rubbed Roast Chicken and Lemons With Potato Wedges", "link": "https://www.seriouseats.com/recipes/2014/06/fennel-and-cinnamon-rubbed-roast-chicken-and-lemons-with-potatoes-recipe.html", "description": "Easy enough for a weeknight dinner but impressive enough to serve guests, this \r\nfennel, chili, and cinnamon-rubbed chicken&mdash;inspired by a Michael Chiarello spice rub&mdash;is roasted with lemon and potatoes for a delicious one-dish dinner.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Lemon", "Mains", "Potato", "Roasting", "Sunday Supper"], "recipeIngredient": ["1/4 cup whole fennel seeds, toasted until fragrant", "1 teaspoon whole coriander seeds, toasted until fragrant", "1 teaspoon whole black peppercorns, toasted until fragrant", "2 teaspoons cinnamon", "1 teaspoon kosher salt, plus more for seasoning", "1/4 teaspoon cayenne pepper", "1/4 teaspoon ground allspice", "1 teaspoon ground ancho chile powder", "2 1/2 tablespoons extra-virgin olive oil ", "1 (5-pound) whole roasting chicken", "6 medium red-skin potatoes, scrubbed and cut into wedges", "3 lemons, halved", "1/2 cup dry white wine", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 375&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using spice grinder or mortar and pestle, grind fennel seeds, coriander seeds, and peppercorns. Transfer to a small bowl and stir in cinnamon, salt, cayenne, allspice, and ancho chile powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set chicken in a roasting pan and rub all over with 1 1/2 tablespoons olive oil and a liberal amount of spice mixture. In a large bowl, toss potatoes with remaining 1 tablespoon olive oil and spice rub, then arrange in pan around chicken. Roast chicken, basting chicken and potatoes occasionally, for 30 minutes. Add lemon halves to roasting pan, and continue to cook chicken, basting occasionally, until thickest part of breast close to bone registers 150&deg;F on an instant-read thermometer and joint between thighs and body registers at least 170&deg;F, about 30 minutes longer. Transfer chicken to carving board and let rest 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, skim fat from juices in roasting pan. Set pan on stove top over medium-high heat. Add wine and bring to a boil, then reduce heat and simmer until reduced by half. Swirl in butter and season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve chicken and serve with potatoes, pan gravy, and roasted lemon halves, for squeezing on chicken.</p>"}]}