{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140227-roasted-chickpea-sun-dried-tomato-herb-kale-salad-pine-nut-recipe-vegan-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chickpea", "easy", "herb", "kale salad", "salad", "sun-dried tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Roasted-Chickpea and Kale Salad With Sun-Dried Tomato Vinaigrette", "link": "https://www.seriouseats.com/recipes/2014/02/roasted-chickpea-kale-salad-sun-dried-tomato-vinaigrette-herb.html", "description": "A hearty salad of chickpeas roasted with cumin and paprika until dense and nutty, combined with kale, fresh herbs, pine nuts, and sun-dried tomatoes. This is a salad that gets even better on the second day.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4 to 6 as a side dish or 3 to 4 as a light main course", "recipeCategory": ["Christmas", "Dairy-Free", "Legumes", "Salads", "Thanksgiving", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["1 (28 ounce) can chickpeas, rinsed and drained", "5 tablespoons extra-virgin olive oil", "1/2 teaspoon ground cumin", "1/2 teaspoon paprika", "Kosher salt and freshly ground black pepper", "1 small bunch curly kale, trimmed and thinly sliced (about 1 quart of greens)", "1/2 cup pine nuts", "1/2 cup sun-dried tomatoes, thinly sliced", "4 scallions, white and light green parts only, thinly sliced", "1 medium clove garlic, grated (about 1 teaspoon)", "2 tablespoons juice and 1 teaspoon zest from 1 lemon, plus more juice as desired", "1/2 teaspoon hot sauce, such as Frank's", "2 teaspoons sherry or red wine vinegar", "1 cup fresh cilantro leaves, roughly chopped", "1 cup fresh mint leaves, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower middle positions and preheat oven to 350°F. Line a rimmed baking sheet with paper towels. Spread chickpeas on top and roll around under your hands to thoroughly dry. Transfer chickpeas to a large bowl. Add 1 tablespoon olive oil, cumin, and paprika. Season to taste with salt and pepper. Discard paper towels and line baking sheet with aluminum foil. Spread chickpeas over foil and transfer to oven. Roast on upper rack, shaking pan occasionally, until chickpeas are about 3/4 their original size with a dense, nutty texture, about 1 hour. Remove from oven and let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add kale to now-empty chickpea bowl. Add 1 tablespoon olive oil, season with salt and pepper, and massage kale until well-coated in oil. Set aside at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pine nuts in a skillet and transfer to lower rack of oven. Toast, stirring occasionally, until pine nuts are deep golden brown, about 15 minutes. Remove from oven and transfer to a bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine sun-dried tomatoes, scallions, garlic, lemon juice, zest, hot sauce, vinegar, and remaining 3 tablespoons oil. Season with salt and pepper and stir well with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chickpeas are cooked and slightly cooled, add to bowl with kale. Add pine nuts, sun-dried tomato dressing, cilantro, and mint. Toss with hands until well-combined. Adjust seasoning with more salt, pepper, and/or lemon juice as necessary.</p>"}]}