{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/canasta-tacos-prep-basket.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Mexican", "keywords": ["cinco de mayo", "easy", "Latin American", "make ahead", "Mexican", "party", "potluck", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tacos de Canasta (Basket Tacos for a Party or Potluck)", "link": "https://www.seriouseats.com/recipes/2014/10/tacos-de-canasta-recipe.html", "description": "Tacos may not seem like the kind of food that you should assemble an hour before eating, which is why I've never thought of them as a particularly good potluck dish. But that's because, until recently, I'd never encountered <em>tacos de canasta</em>, a special variety of taco sold by bicycle vendors in Mexico that are made in advance and get better as they sit. This is the potluck taco you've been waiting for.", "totalTime": "1 hour 40 minutes", "recipeYield": "makes 50 tacos", "recipeCategory": ["Latin American", "Mains", "Mexican", "Snacks"], "recipeIngredient": ["50 corn tortillas, portioned into groups of 10, each wrapped well in foil", "2 medium white onions, thinly sliced (about 4 cups), divided", "3 medium cloves garlic", "6 dried guajillo chilies, stemmed, seeded, and torn into 1-inch pieces", "2 cups canola, vegetable, or other neutral oil, divided", "Kosher salt", "Fillings as desired (see note)", "<a href=\"http://www.seriouseats.com/recipes/2013/02/basic-salsa-verde-mexican-tomatillo-recipe.html\">Salsa verde</a> or other salsas, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F. Set foil-wrapped tortillas in oven and allow to warm for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat a dry cast iron skillet over high heat until lightly smoking. Add half of the sliced onion, all of the garlic, and all of the chilies and cook, stirring occasionally, until blackened and charred in spots. Add 1 cup oil and fry over medium-high heat until garlic and onions are browned and softened, about 3 minutes. Transfer to a blender, add remaining 1 cup oil and a large pinch of salt, and blend to a smooth puree. Transfer chili oil to a small saucepan and keep hot, stirring occasionally so solids don't scorch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line basket with a cloth or blanket that's large enough for ample over-hanging fabric. Line cloth with a clean plastic bag. Line plastic with sheets of butcher paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches, remove a packet of tortillas from the oven. Quickly fill each tortilla with beans or barbacoa, fold it in half to seal the filling, and set the tacos in the lined basket. When 1 layer of tacos is complete, scatter with some of the remaining sliced onion and drizzle hot chili oil on top. Repeat with remaining tortillas, fillings, onion, and oil, until basket is full.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold butcher paper over tacos, then twist and seal plastic bag closed, pushing out any excess air. Finally fold overhanging cloth over tacos to create a tidy packed basket. Let stand for 1 hour, then open basket and serve tacos immediately, passing plenty of salsa on the side.</p>"}]}