{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140305-preserved-tamarindcaramel-overhead.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["caramel", "cayenne", "preserve", "sauce", "tamarind"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spicy Tamarind Caramel", "link": "https://www.seriouseats.com/recipes/2014/03/spicy-tamarind-caramel-sauce-with-cayenne.html", "description": "This caramel pairs tangy tamarind with sugar, salt, and cayenne pepper, a twist on flavors found in tamarind candies from Thailand and Central America.", "totalTime": "2 hours", "recipeYield": "makes 1 10-ounce jar", "recipeCategory": ["Condiments and Sauces", "Preserved"], "recipeIngredient": ["1 pound box fresh sweet tamarind", "1 cup granulated sugar", "1/4 - 3/4 teaspoon cayenne pepper (optional)", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the shells from the tamarind and de-vein as much as possible. Discard shells and place pulp in a medium saucepan with 3 cups of water. Bring pulp and water to a boil and then reduce to a simmer. Allow to simmer, covered, 45 minutes to 1 hour, until pods are completely broken down and you can see the glossy tamarind seeds throughout the mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and pour the mixture through a fine sieve into a bowl, stirring to separate the pulp dissolved in the liquid from that still clinging to the seeds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pulpy seeds to the pan and add 1 cup fresh water. Once again, bring the mixture to a boil and then reduce to a simmer, this time for 15-20 minutes. Strain into the bowl with the first round of pulp. You should have about 2 1/4 cups. Discard seeds and rinse out saucepan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread one cup of sugar in an even layer on the bottom of saucepan and place over medium heat Cook undisturbed until sugar begins to melt and takes on a golden color. Carefully, as the mixture will bubble furiously, add the liquid tamarind pulp and whisk together. Cook about ten minutes until the mixture appears glossy and reaches 223&deg;F on a candy thermometer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and stir in cayenne pepper and salt. Allow to cool, pour into a jar and store in the refrigerator. </p>"}]}