{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140512-frangipane-waffle2.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["almond", "frangipane", "puff pastry", "waffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Buttery, Flaky Frangipane Puff Pastry Waffles", "link": "https://www.seriouseats.com/recipes/2014/05/buttery-flaky-frangipane-puff-pastry-waffles-recipe.html", "description": "This simple, insanely addictive dessert is made by filling puff pastry with homemade frangipane (an easy buttery almond paste), then cooking it on a hot waffle iron until crisp, flaky, and utterly delicious.", "totalTime": "15 min", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Desserts", "Nuts"], "recipeIngredient": ["9 tablespoons (about 3 ounces or 75 grams) almond meal (see note)", "4 1/2 tablespoons (about 3 ounces or 75 grams) granulated sugar", "1 tablespoon all-purpose flour, plus more for dusting", "Large pinch kosher salt", "6 tablespoons (about 3 ounces or 75 grams) unsalted butter, softened", "1 large egg", "1 (1/2-pound) sheet frozen puff pastry, thawed", "Powdered sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a Belgian waffle iron according to manufacturer directions. In a stand mixer fitter with the paddle, combine almond meal, granulated sugar, flour, and salt and mix at low speed until blended. Add butter and egg and mix until frangipane is light and fluffy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dust a work surface. Lay out puff pastry sheet, lightly flour top, and roll into an approximate 16- by 16-inch square. Spread frangipane on puff pastry, leaving a 1 inch border on all edges. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll puff pastry sheet away from you like a jelly roll. When completely rolled, pinch seam to seal. Pinch ends of puff pastry to seal, then roll into a disk-shaped spiral. Place spiral in center of preheated waffle iron. Cook until puff pastry is deep golden brown on all surfaces and an instant-read thermometer inserted into the center registers 200°F, about 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a cutting board, cut into wedges, dust with powdered sugar, and serve immediately.</p>"}]}