{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140730-ideas-in-food-Mixing-Roll-Dough.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["baking", "bread", "roll", "salami", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Soft Bread Salami Rolls", "link": "https://www.seriouseats.com/recipes/2014/07/soft-salami-bread-rolls-recipe.html", "description": "These soft rolls are great for sandwiches. They have a moist, tender crumb and thin, crisp exterior. Most of the time spent here is just letting the yeast do it's thing. These rolls are a great way to ease into bread baking, easily mixed in a standing mixer and shaped by hand.", "totalTime": "4 hours", "recipeYield": "Makes 20 rolls", "recipeCategory": ["Rolls", "Sandwiches"], "recipeIngredient": ["320 grams bread flour", "375 grams all-purpose flour", "50 grams oat flour (see note)", "12.5 grams granulated sugar", "15 grams fine sea salt", "12 grams <a href=\"http://www.kingarthurflour.com/shop/items/saf-red-instant-yeast-16-oz\" target=\"_blank\">instant yeast</a>", "325 grams whole milk", "225 grams water", "5 grams (1 teaspoon) extra-virgin olive oil, for greasing", "Rendered beef fat, olive oil, or melted butter, for brushing the rolls (see note)", "20 pieces thinly sliced salami"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitted with the paddle, mix bread flour, all purpose flour, oat flour, sugar, salt, and yeast at low speed until well blended, about 10 seconds. Stop the mixer and add milk and water. Mix at low speed until mixture forms a wet dough and begins to pull away from the side of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Switch to the dough hook mixing at low speed until dough begins to wrap around the hook. Increase speed to medium-low and knead until dough forms a smooth, uniform ball that wraps around the dough hook, 3-4 minutes; it may break apart into a few pieces at first, but will slowly adhere to one another creating a uniform mass. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a medium bowl with 5 grams olive oil. Turn dough out onto a work surface and knead it a few times to form a smooth ball. Put it in the prepared bowl and turn it over so top of dough is lightly coated with oil. Cover with plastic wrap and leave at room temperature for 2 hours, until doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line 2-3 baking sheets with parchment paper. Set slices of salami 4 inches apart on prepared baking sheets pans. Portion dough into 20 smooth balls, approximately 65 grams each. Set each dough ball on a salami round.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush rolls with beef fat, olive oil, or butter and cover loosely with plastic wrap. Let the rolls proof at room temperature for until puffed and doubled in size, about 1 hour to 1 hour 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat oven to 425&deg;F. Bake rolls until they are a deep golden brown and cooked through, about 20-25 minutes (they should feel light when you lift one and sound hollow when tapped with your fingertip). Let cool for 10 minutes and then transfer to a rack to cool completely.</p>"}]}