{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140527-stromboli-recipe-primary.JPG", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["cheese", "Italian sausage", "red peppers", "stromboli", "Sunday Supper", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Italian Sausage, Garlic, and Red Pepper Stromboli", "link": "https://www.seriouseats.com/recipes/2014/05/italian-sausage-garlic-red-pepper-stromboli.html", "description": "Everyone likes pizza. Isn't that a statement of fact? Sometimes, though, it's good to switch things up. That's where stromboli comes into play. Containing all the same ingredients in a different package, it's a customizable crowd-pleaser that can be prepared many ways. Ours is stuffed with sausage, garlic, and red peppers.", "totalTime": "6 hours", "recipeYield": "Serves 8", "recipeCategory": ["Bread", "Cheese", "Mains", "Pizza", "Sunday Supper"], "recipeIngredient": ["<strong>For the Dough:</strong>", "3 cups lukewarm water ", "11/2 tablespoons granulated yeast", "11/2 tablespoons kosher salt", "6 1/2 cups (about 2 pounds) all-purpose flour, plus additional for dusting", "&nbsp", "<strong>For the Filling:</strong>", "1 pound Italian sausage, casings removed", "3 cloves garlic, minced (about 1 tablespoon)", "2 large red peppers, thinly sliced", "1 (14.5 ounce) can crushed tomatoes, preferable San Marzano", "8 ounces scamorza or mozzarella cheese, shredded", "Crushed red pepper", "2 eggs, plus 1 1/2 tablespoons water, lightly beaten", "Italian seasoning or sesame seeds (optional, see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a very large, lidded container, combine water (it should be just a tad warmer than your body temperature), yeast and salt. It’s okay if it doesn’t totally dissolve. Mix in the flour in stages, and stir completely. Cover with a lid and let rise at room temperature for 2 hours. Then, refrigerate for at least 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brown sausage in a large skillet over medium-high heat, breaking it into little bits. Add garlic and peppers and continue to cook until peppers just start to soften, about 3 minutes. Remove from heat and let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split dough into four portions. On a lightly floured surface, roll out the dough into large rectangles, about 12 inches in length, 6 inches wide and 1/4 inch this. Trim edges to create a uniform shape. Spread with tomatoes, leaving a one-inch border. Lightly season with salt. Spread sausage mixture on top of tomatoes and sprinkle with cheese and a shower of crushed red pepper. Using a pastry brush, paint the edges of the dough with the beaten egg. Roll dough into a cylinder, length-wise, and pinch edges to seal. Place stuffed loaves on two baking sheets that have been sprayed with cooking spray, and brush tops with beaten egg. Sprinkle with Italian seasoning (if desired).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to the oven to bake for 15 minutes. Check to make sure the loaves aren’t getting too dark on the bottom and turn them as necessary. Return to the oven to continue cooking until golden brown outside and melted inside, about 10 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and let stand for 7 minutes. Slice into thick slices and serve.</p>"}]}