{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140809-btb-croissantpuddings.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "british", "croissant", "dessert", "pudding", "the ginger &amp; white cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Caramel Croissant Bread and Butter \"Puddings\" From \"The Ginger &amp; White Cookbook\"", "link": "https://www.seriouseats.com/recipes/2014/08/caramel-croissant-bread-butter-puddings-from-the-ginger-and-white-cookbook.html", "description": "At first glance, these bites from the new <em><a href=\"http://http://www.amazon.com/Ginger-White-Cookbook-Tonia-George/dp/1845338758/?tag=serieats-20\" target=\"_blank\">The Ginger &amp; White Cookbook</a></em> may look like popovers. Don't be fooled&mdash;these miniature \"puddings\" have a dense, custardy base infused with a toasted caramel flavor. The beauty of the dish is that each serving is composed of ready-made croissants, so all you have to do is whip up a little caramel.", "totalTime": "2 hours", "recipeYield": "Makes 6 puddings", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Desserts", "Puddings and Custards"], "recipeIngredient": ["Softened butter, for greasing ", "6 croissants, cut widthwise into slices around 1 inch thick", "3 tablespoons chopped toasted walnuts", "<strong>For the caramel</strong>", "1 1/4 cups granulated or superfine sugar", "4 tablespoons water", "1/2 cup heavy cream", "<strong>For the custard</strong>", "4/5 cup heavy cream", "2/3 cup whole milk", "2 free-range eggs, plus 2 yolks "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First make the caramel. Place the sugar and the water in a saucepan and, without stirring, bring to a simmer over a low heat (stirring encourages crystals to form). When the sugar has dissolved, increase the heat and let the mixture become deep brown. Be brave and wait until it is just about to smoke and burn, then take the pan off the heat and carefully pour in the cream—this might hiss and splutter as it hits the caramel. Return the pan to the heat and stir the mixture until smooth. Set aside to cool at room temperature. When cool enough to handle, pour into a pitcher. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the custard. Whisk the cream, milk, and eggs together until combined, then strain into a separate pitcher.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a 6-hole muffin pan or use a silicone muffin pan. Place the ugly croissant ends in the holes, then arrange the neat slices on top so that they protrude a bit above the pan. Pour over the caramel, reserving 1/2 cup for later. Pour the custard over the top and place the puddings in the fridge to soak for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 360ºF. Pour hot water into a large roasting pan to a depth of about 1 in. Place the muffin pan in the water and bake the puddings for 25-35 minutes, until just set in the center. Set aside to cool for 5-10 minutes. Drizzle the remaining caramel over the puddings and sprinkle with the walnuts. Lift out with a blunt knife and transfer to serving plates.</p>"}]}