{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/091414_brown%20rice_fish_cheese_yasminfahr3.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "Caribbean", "keywords": ["avocado", "brown rice", "Caribbean", "easy", "fish", "queso fresco", "quick", "rice", "snapper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Snapper With Brown Rice, Avocado, and Cheese", "link": "https://www.seriouseats.com/recipes/2014/09/snapper-brown-rice-avocado-cheese-recipe.html", "description": "Spiced snapper is seared and served on top of brown rice mixed with black beans and tomatillos. Creamy avocado and queso fresco finish of the dish for a healthy and hearty meal in under an hour.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Avocado", "Caribbean", "Fish", "Mains", "One-Pot Wonders", "Quick Dinners", "Rice"], "recipeIngredient": ["1 tablespoon plus 1 teaspoon ground cumin, divided", "1/2 teaspoon ground cayenne pepper", "1/2 tablespoon plus 1 teaspoon ground coriander seed, divided", "Kosher salt and freshly ground black pepper", "4 skin-on red snapper filets", "2 tablespoons extra-virgin olive oil", "1 medium yellow onion, diced (about 1 cup)", "1 serrano pepper, deseeded and diced", "2 cups long-grain brown rice", "2 1/2 cups homemade or store-bought low-sodium chicken or vegetable stock", "1 (15-oz) can black beans, drained and rinsed", "4 tomatillos, husked and quartered", "1 avocado, diced", "1/2 cup diced queso fresco", "2 limes, sliced, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix 1 teaspoon of cumin, cayenne and 1 teaspoon of coriander together with salt and pepper. Pat fish dry and season on all sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a Dutch oven over medium-high heat until shimmering. Add the fish, skin-side down. Cook until the skin is crisp and browned, about 3 minutes (work in batches if necessary to avoid overcrowding). Flip the fish, cook until the spices are sealed into the fish and a small layer of white has formed on the bottom, about 2 minutes. Remove and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions and Serrano pepper and cook, stirring, until softened, about 4 minutes. Add rice and cook until coated in fat and lightly toasted, about 2 minutes. Add the broth and scrape up the brown bits on the pan. Bring to a boil, then adjust the heat to maintain a simmer. Season with salt.Cover and cook until the rice is almost cooked through, about 35 minutes (about 5 minutes less than the package instructions). Stir in the black beans and tomatillos, then place the fish, skin-side up, on top (it’s okay if they overlap a bit). Cover and cook until the fish has cooked through, about 4 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and serve with the avocado, queso fresco and limes on the side. </p>"}]}