{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140824-Stuffed-aChicken-Butterflying-Process-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["cheese", "chicken", "chorizo", "stuffed chicken breast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chorizo-Stuffed Chicken Breasts With Queso Sauce", "link": "https://www.seriouseats.com/recipes/2014/08/chorizo-stuffed-chicken-breasts-queso-sauce-recipe.html", "description": "A simple yet flavorful mixture of chorizo, jalapeño, and onion serves as the filling for these pounded chicken breasts, which cook in an ultra-creamy, beer-based cheese sauce.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Chicken", "Mains"], "recipeIngredient": ["<strong>For the Chicken and Filling:</strong> ", "1 (6-ounce) link Mexican chorizo, casing removed ", "1 medium jalapeño, stemmed and minced", "1/2 medium white onion, minced (about 1/3 cup)", "Kosher salt and freshly ground black pepper", "4 boneless, skinless chicken breast halves", "<strong>For the Cheese Sauce:</strong> ", "2 tablespoons extra-virgin olive oil", "1 medium white onion, minced", "2 medium cloves garlic, minced", "1 cup light beer, such as pale ale or lager", "3 ounces Velveeta, cut into small cubes", "4 ounces sharp cheddar cheese, cut into small cubes", "4 ounces pepper jack cheese, cut into small cubes", "3/4 cup whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chicken and Filling:</strong>  Cook chorizo in a Dutch oven over medium-high heat, breaking it into small bits until lightly browned, about 5 minutes. Add jalapeño and onion and continue cooking until tender, 6 to 7 minutes. Remove from heat, drain on paper towels and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, butterfly the chicken breast halves: Slice along the length of each breast, and, working parallel to the cutting board, continue slicing until nearly all the way through (but not completely), so that each breast opens like a book. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set each butterflied chicken breast half on a sheet of plastic wrap. Cover with another sheet of plastic wrap and, using a meat pounder, pound each breast to a 1/4-inch thickness. Remove plastic and trim each chicken breast to form an even rectangle. Spread 2 tablespoons of filling over each chicken breast, leaving a 1/4-inch border around the edges. Roll each breast lengthwise and secure at 3/4-inch intervals with kitchen twine. Season chicken all over with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cheese Sauce:</strong> Heat olive oil in a Dutch oven over medium-heat until shimmering. Sear chicken on all sides until brown, about 5 minutes. Transfer meat to a platter and reserve. Reduce heat to medium and add onion and garlic. Cook, stirring, until translucent, 6 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add beer and increase heat to medium-high and bring to a boil, scraping up browned bits from the bottom on the Dutch oven. Add cheeses and cook, stirring, until melted and smooth. Season generously with pepper and stir in milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return chicken to Dutch oven, reduce heat to low and continue to cook until an instant-read thermometer registers 150&deg;F (or 160&deg;F if you want to follow USDA guidelines) when inserted into the center of chicken rolls, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken from to a clean plate. When chicken is cool enough to handle, discard twine and serve immediately, topped with cheese sauce.</p>"}]}