{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141116-salt-roasted-potatoes-recipe-15.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["herb", "new potato", "potato", "roast", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "5"}, "name": "Extra-Crispy Herb-Roasted New Potatoes", "link": "https://www.seriouseats.com/recipes/2014/11/crispy-salty-herb-roasted-new-potatoes-recipe.html", "description": "Simmering potatoes in heavily salted water until the water runs completely dry gives them extremely fragile, wrinkled skins that crisp up when subsequently roasted in a hot oven. The result: extra-crispy new potatoes with buttery, herb-flecked crusts.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Christmas", "Easter", "Potato", "Roasting", "Sides", "Thanksgiving", "The Food Lab", "Vegetarian"], "recipeIngredient": ["4 pounds new potatoes, scrubbed and rinsed", "1/2 cup kosher salt", "2 medium cloves garlic", "2 tablespoons roughly chopped chives", "2 tablespoons fresh parsley leaves", "2 tablespoons fresh sage leaves", "1 tablespoon fresh thyme leaves", "1 small shallot, thinly sliced", "1/2 stick unsalted butter, cut into 1/4-inch slices", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a large saucepan and cover with water. Add salt and stir to dissolve. Bring to a boil over high heat. Reduce to a low boil and cook, stirring occasionally, until liquid has completely evaporated and potatoes are covered in a film of salt, about 45 minutes. Drain and rinse potatoes of excess salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While potatoes simmer, combine garlic, chives, parsley, sage, thyme, and shallot in the bowl of a food processor. Pulse, scraping down sides as necessary, until finely chopped and no large pieces remain. Scatter butter chunks on top. Pulse until homogenous paste is formed. Season generously with salt and pepper and pulse to combine. Potatoes and herb butter can be made ahead to this stage for up to 5 days before continuing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400&deg;F. Line a rimmed baking sheet or broiler pan with aluminum foil. (If potatoes do not all fit on one rack, use two baking sheets, rotating top to bottom half way through cooking.) Heat herb butter in a small saucepan over medium heat until melted. Toss potatoes and half of melted herb butter in a large bowl to coat. Transfer to baking sheet and roast, shaking pan occasionally, until crisp all over, about 20 minutes. Re-melt remaining herb butter. Transfer potatoes to a large bowl and toss with remaining herb butter. Season to taste with salt and pepper (you probably won't need any extra salt). Serve.</p>"}]}