{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140925-boat-whale-walrus-grilled-salmon-jim-henkens.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["a boat a whale &amp; a walrus", "Cook the Book", "fish", "salmon", "walnut"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled King Salmon With Walnut Tarator and Cherry Tomato Salad From 'A Boat, a Whale &amp; a Walrus'", "link": "https://www.seriouseats.com/recipes/2014/10/grilled-king-salmon-with-walnut-tarator-and-tomato-salad-from-a-boat-a-whale-a-walrus.html", "description": "If summer has already left you where you are, bookmark this recipe from chef Renee Erickson's new <a href=\"http://www.amazon.com/Boat-Whale-Walrus-Menus-Stories/dp/1570619263/?tag=serieats-20\"><em>A Boat, a Whale &amp; a Walrus</em></a> for next year; it's worth remembering. She pairs grilled salmon with deeply flavorful tarator, a Turkish sauce made with walnuts, bread, lemon, garlic, and olive oil, and a bright and dilly tomato-and-cucumber salad.", "totalTime": "1 hour 25 minutes", "recipeYield": "Serves 10 as part of a larger meal, or 6 as a main course", "recipeCategory": ["Cook the Book", "Mains", "Nuts", "Salmon"], "recipeIngredient": ["<strong>For the salmon</strong>", "1 (3 1/2- to 4-pound) king salmon fillet, roughly 2 to 2 1/2 inches thick in the center ", "1 tablespoon extra-virgin olive oil ", "Kosher salt, for seasoning ", "Finishing oil, for drizzling ", "Flaky sea salt, such as Maldon or Jacobsen, for finishing", "<strong>For the tarator</strong>", "2 cups whole walnuts, toasted ", "1 cup 1-inch cubes baguette or other artisanal bread (including the crust) ", "1/2 cup freshly squeezed lemon juice (from about 4 medium lemons)", "1 clove garlic, smashed ", "1 teaspoon kosher salt ", "1 cup water ", "1 cup extra-virgin olive oil", " ", "<strong>For the salad</strong>", "2 pints summer cherry tomatoes, halved ", "1 pound lemon cucumbers (or English cucumbers), cut into 1/2-inch cubes ", "1/4 cup roughly chopped fresh dill ", "Julienned peel and juice of 1 large lemon ", "1/4 cup extra-virgin olive oil ", "Flaky sea salt, such as Maldon or Jacobsen, for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the salmon:</strong> Preheat a charcoal or gas grill for cooking over medium heat, about 375 degrees F. Brush the salmon with the olive oil, then season it to taste with kosher salt. Brush the cooking grates clean. Grill the salmon (without turning) until just cooked through at the ends (but still a bit translucent in the center), keeping the lid closed, about 30 minutes for fish 2 to 2 1/2 inches thick at the fattest part. (You can grill the salmon just before serving and serve it warm, but I actually prefer to grill it a bit ahead of time and serve it at room temperature.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, make the tarator:</strong> Place the walnuts, bread cubes, lemon juice, garlic, and kosher salt in the work bowl of a food processor or a heavy-duty blender. Pour the water over the bread, pulse a few times to mix, then whirl on high speed until smooth, adding the oil in a slow, steady stream through the top of the machine with the motor running. Spread the tarator out in a puddle on a large platter and set aside. (The tarator can also be made ahead, refrigerated for up to 3 days, and allowed to come back to room temperature before serving.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the salad:</strong> In a large mixing bowl, combine the tomatoes, cucumbers, dill, lemon peel and juice, and olive oil. Season to taste with the kosher salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the salmon is done, break it apart into serving-size hunks and arrange them on the tarator. Spoon the salad over the salmon, followed by a drizzle of olive oil and a shower of sea salt. Serve at room temperature.</p>"}]}