{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140911-btb-glutenfreedonuts.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "dessert", "gluten free", "the everyday art of gluten-free"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jelly-Filled Donuts From 'The Everyday Art of Gluten-Free'", "link": "https://www.seriouseats.com/recipes/2014/09/jelly-filled-donuts-from-the-everyday-art-of-gluten-free.html", "description": "We've been watching the comments, and it seems a fair number of you wanted a gluten-free version of a donut, or a beignet. A beignet is traditionally made with choux pastry and then deep-fried. These jelly-filled donuts are made with choux pastry and then deep-fried. The difference? No gluten.", "totalTime": "Several hours, including dough chilling", "recipeYield": "Makes 24 doughnuts", "recipeCategory": ["Bake the Book", "Desserts", "Doughnuts", "Gluten-Free"], "recipeIngredient": ["Choux Paste (see below)", "2 cups (480 ml) jam (such as strawberry, raspberry, blueberry, cherry, or a variety) or filling of your choice", "4 cups (960 ml) peanut oil, for frying", "1 cup (200 g) sugar, for coating", "<strong>Choux Paste:</strong>", "4 large eggs", "2 teaspoons baking powder", "8 tablespoons (140g) unsalted butter", "4 tablespoons half-and-half", "4 teaspoons sugar", "1/2 teaspoon kosher salt", "1 cup plus 6 tablespoons Donut & Fritter blend (ingredients below)", "2 teaspoons pure vanilla extract", "<strong>Donut and Fritter Blend</strong> (makes 5 1/2 cups)", "2 1/2 cups plus 1 1/2 tablespoons (320 g) cornstarch", "1 cup plus 2 tablespoons plus 1 teaspoon (128 g) tapioca starch", "1/3 cup plus 2 tablespoons (80 g) potato starch", "1/2 cup plus 1 tablespoon plus 1 teaspoon (64 g) sorghum flour", "8 teaspoons (24 g) guar gum"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the Donut and Fritter blend: Using the spoon-and-sweep method, measure each ingredient into a large bowl. Whisk together and then sift the mixture into a separate large bowl. Repeat several times. Since you are working with so many different starches, you really need to sift and whisk the blend several times to ensure an even distribution of all the ingredients.</p>\n\n<p><br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the choux paste: In a small bowl, crack the eggs; do not whisk them. Pour the baking powder over the eggs and let it stand for at least 5 minutes, so the egg whites activate the baking powder. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed medium saucepan, combine the butter, half-and-half, 2 teaspoons of the sugar, the salt, and 5 tablespoons (75 ml) water over medium heat and heat until the butter has melted and the mixture comes to a gentle boil. Add the 1 cup + 6 tablespoons Donut & Fritter Blend and stir vigorously with a wooden spoon, scraping the bottom of the pot for about 1 minute. Once the dough pulls easily from the sides of the pan and leaves a thin veil of butterfat on the bottom, it's ready to come off the heat. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to a food processor fitted with the S-blade. Pulse the dough for 20 seconds to cool it slightly. Pour in the eggs and baking powder (still unwhisked) and process it all to a thick, sticky paste, about 90 seconds more. Add the vanilla and mix just until incorporated. Transfer the dough to a pastry bag fitted with a 1/2-inch (12-mm) star tip. At this point, the dough can be refrigerated: Wrap the pastry tip in plastic and then place a rubber band over the top of the tip so it's snug and keeps the plastic tight. Using a second rubber band, twist the top of the bag shut and fold the excess pastry bag over, pulling the rubber band over the excess flap. This will keep the dough fresh for up to 3 days before frying. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the donuts: Scoop the prepared choux paste into a lidded container and refrigerate it for 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium saucepan, melt the jam over medium heat until it is liquid. Strain the jam through a fine-mesh strainer into a bowl; discard any solids left in the strainer. Set the jam aside to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the donuts, in a large skillet (or alternatively, in a deep-fryer), heat the oil over medium heat until it registers 375°F (190°C) on a deep-fry thermometer. Line a platter with paper towels, or line a baking sheet with a brown paper bag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the sugar into a shallow dish. Shake the dish slightly to spread the sugar out into an even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches of three or four donuts at a time, spoon tablespoon-size dollops of dough directly into the hot oil. Be sure not to overcrowd the pan or the oil will get cool. Fry until the donuts are golden brown on both sides, about 1 minute on the first side and a bit less than a minute on the second side. Using a slotted spoon or spider, transfer the fried donuts to the lined plate to drain any excess oil. Repeat with the remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the donuts are cool enough to handle, roll them in the sugar. Transfer the cooled strained jam to a pastry bag fitted with a plain round tip. Pierce a donut with the pastry bag tip and pipe about 1 tablespoon of filling into the donut. Repeat to fill the remaining donuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ideally, eat the donuts right away, before the sugar can absorb any of the residual frying oil. If you have any leftovers, store the donuts in a brown paper bag or in a loosely covered container on the counter for a day or two.<br />\n</p>"}]}