{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140506-291799-cook-the-book-earth-and-sea.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["coi", "Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Earth and Sea From 'Coi' (Part 1)", "link": "https://www.seriouseats.com/recipes/2014/05/earth-and-sea-from-coi-part-1.html", "description": "<a href=\"http://www.starchefs.com/cook/chefs/bio/Daniel-Patterson/coi\" target=\"_blank\">Daniel Patterson</a>'s restaurant, <a href=\"http://coirestaurant.com/\" target=\"_blank\">Coi</a>, has developed a series of dishes all called \"Earth and Sea,\" each celebrating the unique flavors that come about when the rocky, western coastal landscape meets the Pacific ocean.", "totalTime": "4 hours", "recipeYield": "makes about 1 quart, plus extra vegetable stock", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Gluten-Free", "Vegetarian"], "recipeIngredient": ["<strong>Vegetable stock</strong>", "500 g onion, charred", "500 g onion dice", "375 g carrot dice", "375 g fennel dice", "300 g celery root dice", "200 g leek dice", "7 g thyme", "12 kg water", "&nbsp", "<strong>Mushroom stock</strong>", "750 g fresh baby shiitakes", "20 g dried porcini and other wild mushrooms", "2 kg water", "&nbsp", "<strong>Mushroom dashi</strong>", "600 g mushroom stock (see above)", "200 g vegetable stock (see above)", "20 g kombu", "16 g katuobushi, shaved or grated", "shiro dashi", "salt", "4 g agar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Vegetable stock:</strong> To char the onions, cut them in half and blacken on a plancha, a flat-top (cook them on aluminum foil so they don't stick to the surface), or a gas burner. By char, I mean blacken the cut side, but not completely, about half to two-thirds of the surface. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The vegetables should be cut in relatively large pieces so they don't break down too much, and so that they release their flavor slowly and completely. Combine all of the ingredients in a stockpot and simmer until the flavor is sweet and concentrated, about 3 hours. If it's too dilute, none of the recipes that use it will work, because they rely on the sweetness of the stock to balance the acidity. If it's too concentrated, the flavor can get overcooked and tired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mushroom stock:</strong> Combine all the ingredients and simmer gently, covered, for 2 hours, until the flavor is clear but not overly concentrated. Strain through cheesecloth set into a strainer and cool in an ice bath.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mushroom dashi</strong> Heat the vegetable and mushroom stocks with the kombu to just below a simmer. Cook for 15 minutes, then add the katsuobushi. Cook for 2 minutes, then pull from the heat and let stand until flavorful. Strain through cheesecloth, then season with salt and shiro dashi to taste. Generally speaking, using more katsuobushi for a shorter time gives a fresher, more delicious flavor. After a while it starts to taste dull and fishy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While still hot, separate half of the liquid and add the agar. Bring to a boil, whisking rapidly. Transfer to a metal bowl sitting in an ice bath. Cool completely, then blend until smooth-this will thicken the broth, causing it to linger on the tongue, making the taste more powerful. Cool the other half of the broth separately. </p>"}]}