{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140822-ideas-in-food-Turkey-Thigh-Pieces.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["mayonnaise", "pork belly", "sandwich", "shawarma", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Turkey Club Shawarma Sandwich With Pork Belly and Enhanced Mayo", "link": "https://www.seriouseats.com/recipes/2014/08/turkey-club-sandwich-bacon-pork-belly-mayo-recipe.html", "description": "This is by no means a traditional turkey club sandwich: It is loaded with deeply roasted turkey-and-pork-belly shawarma, and accented with a flavorful bacon mayonnaise. All those rich ingredients are balanced with fresh tomato slices and peppery baby arugula. And while a classic turkey club has three layers of bread, we ditched the middle layer because we found it makes the sandwich too hard to eat without adding much that the other two bread slices don't already deliver.", "totalTime": "2 hours plus 4 hours marination time", "recipeYield": "Makes 12 sandwiches", "recipeCategory": ["Bacon", "Pork", "Sandwiches", "Turkey"], "recipeIngredient": ["<strong>For the Turkey Shawarma:</strong>", "2 boneless skinless turkey thighs, about 1500 grams (3 pounds 6 ounces) total)", "1000 grams (2 pounds 3 ounces) fresh pork belly, skin removed", "260 grams (about 1 cup plus 1 tablespoon) buttermilk ", "100 grams (about 1/3 cup) brown mustard", "100 grams (about 1/3 cup) ketchup", "100 grams (about 1/3 cup) miso paste, preferably barley miso", "1 medium yellow onion peeled and quartered, plus 2 large yellow onions peeled and left whole", "1 head of garlic peeled", "500 grams (about 2 cups) dry white wine", "<strong>For the Bacon Mayonnaise:</strong>", "250 grams (about 1 cup) rendered bacon fat, from about 1 pound of bacon (reserve cooked bacon for another use)", "200 grams (about 3/4 cup) peanut oil", "2 large egg yolks, plus 1 large egg", "50 grams (about 3 tablespoons) brown mustard", "50 grams (about 3 tablespoons) sherry vinegar", "15 dashes (shakes) hot sauce", "Kosher salt (about 6 grams, or to taste)", "<strong>To Assemble the Turkey Clubs:</strong>", "Sliced Bread, such as potato bread, toasted", "Lightly salted thick tomato slices", "Baby arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Turkey Shawarma:</strong> Cut turkey thighs into roughly 2-inch pieces, following along the natural seams of the meat when possible. Discard any fat and sinew. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut pork belly into 1/2-inch thick slices and then into 3-inch lengths. Set aside. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 4 or 5 pieces of turkey meat into a large zipper-lock bag, press out as much air as possible, and seal the bag. Using a meat pounder, pound turkey to 1/4-inch thickness. Remove flattened turkey pieces from the bag and transfer to a large bowl. Repeat with remaining turkey meat. Pound pork belly the same way and set aside in a separate bowl.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine buttermilk, brown mustard, ketchup, barley miso, quartered onion, and garlic in a blender and blend starting at low speed and gradually increasing speed to high. Puree until it becomes smooth paste, about 30 seconds. Turn the blender off and pour marinade over turkey and pork belly, tossing to coat evenly. Cover each bowl and refrigerate for at least 4 hours and up to 24. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425&deg;F with convection if you have it. If no convection is available, preheat oven to 450°F. Cut the ends off of remaining whole onions to make 2 flat sides on each. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove turkey and pork belly from the refrigerator. In a deep plastic quart-sized deli-style container, alternate layers of turkey and pork belly until half of both meats have been used. Push 4 skewers in a square pattern through the stack of meat. Set 1 onion on a work surface so that it is sitting on a flat side. Push the skewers all the way through the top side of the onion so that the skewered meats stand vertically with the onion as a base. Remove the container so the meat stands on its own. Repeat with remaining turkey, pork belly, and onion. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stand each set of skewers up in a medium roasting pan and pour white wine into the bottom of the pan. Roast turkey shawarma for 30 minutes. Rotate the pan (if the meat has fallen over, turn it over so the bottom side roasts and caramelizes). Continue roasting until browned and crisp, about 30 minutes longer. Let rest for at least 15 minutes before carving. Carve turkey shawarma in vertical slices, discarding skewers, then remove and slice the onion. Combine sliced turkey shawarma and onion in a bowl, add several spoonfuls of roasting juices and gently mix everything together. Season to taste with salt if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bacon Mayonnaise:</strong> While the turkey roasts, combine bacon fat and peanut oil in a pot and heat over low heat just until the bacon fat melts. Pour it into a large heatproof measuring cup. Combine egg yolks, egg, mustard, sherry vinegar, hot sauce, and salt in a blender. Turn blender to low speed and gradually increase speed to medium high until smooth. Turn the blender off and, using a rubber spatula, scrape down the sides. Turn blender to low speed and slowly drizzle in the bacon fat and peanut oil mixture in a thin stream. Increase blender speed to medium and continue to drizzle fat into the blender in a thin stream. As the mayonnaise thickens, increase blender speed while continuing to drizzle in fat. When all the fat has been added and mayonnaise is uniform and creamy, turn off blender. Season to taste with salt if necessary. Bacon Mayonnaise can be refrigerated for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble the Turkey Clubs:</strong> Spread Bacon Mayonnaise on each slice of toast. Layer a generous portion of carved Turkey Shawarma on bottom half of each sandwich. Top with sliced tomato and baby arugula, then close sandwiches. Serve additional Bacon Mayonnaise and hot sauce on the side so each sandwich can be seasoned to taste.</p>"}]}