{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141031-baked-risotto-daniel-gritzer-5-edit.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["fall", "Italian", "make ahead", "rice", "risotto", "saffron", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Baked Saffron Risotto With Mozzarella and Crispy Topping", "link": "https://www.seriouseats.com/recipes/2014/11/baked-risotto-saffron-mozzarella-italian-recipe.html", "description": "Risotto is not exactly a make-ahead food&mdash;no matter what tricks you use, it always requires last-minute finishing right before serving. But by using the tricks we developed for rice balls, it's possible to turn a classically <em>a-la-minute</em> dish into a make-ahead baked casserole. Like baked mac-and-cheese, but with rice.", "totalTime": "1 hour 30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Italian", "Mains", "Pressure Cooker", "Quick Dinners", "Rice"], "recipeIngredient": ["2 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 packets (1/4 ounce) unflavored gelatin (only if using store-bought chicken broth or homemade broth that remains watery when chilled; see note)", "1 tablespoon extra-virgin olive oil", "1/2 medium yellow onion, finely diced (about 1/2 cup)", "1 cup short-grain Asian rice (see note)", "1/2 cup dry white wine", "1 pinch saffron", "Kosher salt and freshly ground black pepper", "1 tablespoon chilled unsalted butter plus 4 tablespoons melted unsalted butter, divided", "1 tablespoon all-purpose flour", "2 tablespoons milk", "1 large egg, beaten", "1/2 pound low-moisture mozzarella, diced", "3/4 cup panko bread crumbs", "2 tablespoons grated Parmigiano-Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using store-bought chicken broth or homemade broth that remains watery when chilled, place stock in a large liquid measuring cup and sprinkle gelatin over the top. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Making Rice in a Pressure Cooker:</strong> Heat oil in Pressure cooker over medium-high heat until shimmering. Add onion and cook, stirring occasionally, until onion is softened and translucent, about 3 minutes. Add rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3 minutes (rice grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center). Add wine and cook, stirring, until raw alcohol smell has cooked off and wine is almost fully evaporated, about 1 minute. Stir in 1 1/2 cups broth and the saffron, scrape any grains of rice or pieces of onion from side of pressure cooker so that they are fully submerged; season with salt. Close pressure cooker and bring up to low pressure (10 psi on most units). Cook at low pressure for 6 minutes, then depressurize cooker either by running it under cold water if it is not electric, or using the steam-release valve if it is electric. Return to heat and stir rice until it forms the texture of a thick porridge. Season with salt and pepper. Let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Making Rice on Stovetop:</strong> Heat oil in large saucier pan or Dutch oven over medium-high heat until shimmering. Add onion and cook, stirring occasionally, until onion is softened and translucent, about 3 minutes. Add rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3 minutes (rice grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center). Add wine and cook, stirring, until raw alcohol smell has cooked off and wine is almost fully evaporated, about 1 minute. Stir in 1 cup stock and saffron, scrape any grains of rice or pieces of onion from side of pressure cooker so that they are fully submerged; season with salt. When liquid has mostly evaporated, stir in 1/2 more cup stock and cook, stirring frequently, until liquid has mostly evaporated. Stir in water 1/4 cup at a time until rice is just tender and has formed the texture of a thick porridge. Season with salt and pepper. Let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small saucier or saucepan, melt 1 tablespoon chilled butter over medium-high heat until foaming. Stir in flour to form a paste, lower heat to medium, and cook, stirring constantly, until raw-flour smell is gone but flour has not browned, 1 to 2 minutes. Whisk in milk and remaining 1/2 cup stock until smooth. Bring to a simmer, and continue to cook, stirring, until bechamel sauce is thick enough to coat the back of a spoon, about 3 minutes. Season with salt and pepper. Let cool slightly, then whisk in egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape rice into large mixing bowl along with bechamel sauce and stir until thoroughly incorporated. Fold in mozzarella cheese. Scrape risotto mixture into baking dish, cover with plastic and refrigerate until ready to re-heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a mixing bowl, toss panko with remaining 4 tablespoons melted butter and Parmesan cheese. Season with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 1 hour before ready to serve, preheat oven to 350&deg;F. Remove plastic from rice and spread bread crumbs in an even layer on top. Bake until bread crumbs are golden and rice is thoroughly heated through, about 30 minutes. Serve right away.</p>"}]}