{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140914-Serious-Eats-Slow-Cooker-Sunday-Gravy-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Italian", "keywords": ["beef", "comfort", "fall", "Italian", "italian american", "meatball", "pasta", "red sauce", "slow cooker", "Sunday", "sunday gravy", "tomato", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Slow-Cooker Sunday Gravy", "link": "https://www.seriouseats.com/recipes/2014/09/slow-cooker-sunday-gravy-italian-red-sauce-recipe.html", "description": "A sacred Italian-American institution, Sunday gravy is a meat-forward, all-day-simmered dish with as many recipes as there are Italian families who make it. My version incorporates flank steak braciole, Italian sausage, tender meatballs, and pork ribs along with onions, carrots, celery, and garlic, all simmered together in a rich red sauce.", "totalTime": "9 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Beef", "Italian", "Mains", "Pasta", "Pork", "Slow Cooker", "Tomato"], "recipeIngredient": ["<strong> For the Meatballs:</strong>", "1 large egg", "1/4 cup homemade or store-bought low-sodium chicken stock", "1/4  teaspoon unflavored gelatin", "1/2 pound ground beef", "1/2  pound ground pork", "1/3 cup finely grated Parmesan cheese", "1/2 cup breadcrumbs", "Kosher salt and freshly ground black pepper", "<strong> For the Braciole, Italian Sausage and Pork Ribs:</strong>", "1/3 cup breadcrumbs", "1/4 cup finely grated Pecorino or Parmesan cheese, plus additional for garnish", "1/4 teaspoon smoked paprika", "1/4 teaspoon red pepper flakes", "2 cloves garlic, minced (about 2 teaspoons)", "2 tablespoons minced fresh flat-leaf parsley leaves", "5 tablespoons olive oil, divided", "1 small flank steak, about 1 1/2 pounds flank steak, cut in half crosswise (against the grain)", "1 pound (about 5 links) Italian sausage, split in half crosswise", "3/4 pound country-style pork ribs", "<strong>For the Sauce:</strong>", "1 large yellow onion, finely chopped (about 1 1/2 cups)", "1 stalk celery, finely chopped (about 3/4 cup)", "1 large carrot, peeled and finely chopped (about 1 cup)", "3 cloves garlic, minced (about 1 tablespoon)", "2 1/2 tablespoons tomato paste", "1/2 cup dry red wine", "2 1/2 cups homemade or store-bought low-sodium chicken stock", "3 bay leaves", "4 sprigs fresh thyme", "1 (28-ounce) can whole peeled tomatoes, crushed in a food processor or with a stick blender to a rough puree", "1/2 tablespoon balsamic vinegar", "1/4 teaspoon red pepper flakes", "1/4 cup chopped fresh basil leaves", "1 pound pasta, either tube-shaped or spaghetti, cooked al dente"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meatballs:</strong> Whisk the egg and chicken stock together in a large bowl. Sprinkle with gelatin and let rest for 5 minutes. Add ground beef, ground pork, Parmesan cheese, and breadcrumbs. Season with salt and pepper and combine using hands, taking care not to over-mix. To taste for seasoning, cook a small portion in a skillet or on a microwave-safe plate in the microwave and adjust salt and pepper to taste. With wet hands, form mixture into 2-inch-size meatballs. Transfer to a platter, cover, and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Braciole, Sausage, and Ribs:</strong> Combine breadcrumbs, Pecorino, paprika, red pepper flakes, garlic, parsley, and 2 tablespoons olive oil in a medium bowl. Sprinkle each piece of flank steak with about 1/4 cup of the breadcrumb mixture. Roll up meat with the grain, and secure at 1/2-inch intervals using kitchen twine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon olive oil in a Dutch oven over medium-high heat until shimmering. Add braciole and sear, turning occasionally, until browned on all sides, 5 to 8 minutes. Transfer to the bowl of a slow cooker. Add 1 more tablespoon olive oil. Sear Italian sausage, turning occasionally, until browned on all sides, 5 8 minutes. Transfer to the slow cooker and repeat with remaining tablespoon olive oil and the pork ribs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Return the Dutch oven to medium heat. Add onion, celery, and carrot, and cook, stirring and scraping up any browned bits off the bottom of the pan, until softened and translucent, about 7 minutes. Add the garlic and continue cooking until fragrant, about 2 minutes. Add tomato paste and cook, stirring, until lightly darkened in color, about 2 minutes. Add red wine, raise heat to medium-high and bring to a boil, scraping browned bits from the bottom of the pan using a spoon. Add chicken stock, bay leaves, thyme, crushed tomatoes, and balsamic vinegar. Season with 3/4 teaspoon salt and return to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer tomato mixture to the slow cooker. Cover and cook on the low setting for 7 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove meat from sauce, discard bay leaves and thyme. Cut string from braciole and discard. Pull pork ribs from bones and discard bones. Cover meat with foil and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently place prepared meatballs in the sauce. Raise the slow cooker heat to high (4-hour setting) and cook meatballs in sauce for about 30 minutes. Return reserved meats to sauce and cook another 30 minutes until warmed through. Taste and adjust seasoning, if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss pasta with a generous amount of gravy in a large bowl. Top with meat, garnish with basil and serve immediately, passing additional Parmesan at the table.</p>"}]}