{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140505-one-pot-wonders-chicken-chickpeas-kale.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["chicken", "chickpeas", "kale", "one pot", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Chicken in Tomato Sauce With Chickpeas and Kale", "link": "https://www.seriouseats.com/recipes/2014/05/chicken-tomato-sauce-chickpeas-kale.html", "description": "In this quick, easy, and delicious one-pot dinner, chicken breasts are seared, then gently cooked in an herb-filled tomato sauce with chickpeas and hearty kale. Topped with crunchy, seasoned breadcrumbs, this rustic meal comes together in 45 minutes.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Kale", "Legumes", "Mains", "One-Pot Wonders"], "recipeIngredient": ["1 cup breadcrumbs", "1 tablespoon plus 1 teaspoon dried oregano, divided", "1 tablespoon plus 1 teaspoon dried thyme, divided", "1 medium garlic clove, minced or grated with a Microplane", "4 skinless boneless chicken breasts (about 1 1/2 pounds)", "Kosher salt and freshly ground black pepper", "3 tablespoons extra-virgin olive oil, divided", "1 shallot, thinly sliced", "Pinch of dried red chili flakes", "1 (28-ounce) can whole peeled tomatoes", "1 cup homemade chicken stock or store-bought, low-sodium chicken broth", "1 (14-ounce) can chickpeas, drained and rinsed", "2 cups lacinato (Tuscan) kale, stems removed and leaves cut into 2-inch ribbons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a 12-inch skillet over medium heat until hot. Add the breadcrumbs and toast them, stirring occasionally, until lightly browned, 2 to 3 minutes. Stir in 1 teaspoon oregano, 1 teaspoon thyme, and the garlic, and cook until fragrant, about 1 minute longer. Transfer breadcrumbs to plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season chicken breasts with salt and pepper. In the same skillet, heat 2 tablespoons oil over medium-high heat until shimmering. Add chicken and sear on both sides until golden-brown, 5 to 6 minutes per side. Transfer chicken to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 1 tablespoon oil to the skillet and heat over medium-high heat until shimmering. Add shallot and a pinch of salt and cook until softened, about 2 minutes. Add chili flakes and remaining 1 tablespoon each oregano and thyme and cook until fragrant, about 30 seconds. Add tomatoes, their liquid and the stock and bring to a simmer, breaking up the tomatoes with a wooden spoon. Simmer until sauce has thicken slightly, about 10 minutes. Add chicken and simmer until cooked through, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in chickpeas and kale and cook until chickpeas are warmed through and kale is wilted, about 2 minutes. Top with the breadcrumbs and serve immediately. </p>"}]}