{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/08112014-apricot-jam-toast-jennifer-latham.jpg", "author": {"@type": "Person", "name": "Jennifer Latham"}, "recipeCuisine": "", "keywords": ["apricot", "condiment", "fruit", "Jam"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Rustic Apricot Jam", "link": "https://www.seriouseats.com/recipes/2014/08/rustic-apricot-jam-recipe.html", "description": "This recipe yields a very chunky, rustic jam that relies entirely on the fruit's natural pectin, in concert with sugar, lemon juice, and heat, to set perfectly. This jam works well with Blenheim apricots, or any other small, freestone apricot (apricots that have pits that pop out easily, rather than clinging to the flesh).", "totalTime": "2 hours", "recipeYield": "makes about 12 half-pint jars", "recipeCategory": ["Apricot", "Condiments and Sauces", "Fruit Desserts", "Vegetarian"], "recipeIngredient": ["6 pounds firm-but-ripe freestone apricots, such as Blenheims, halved and pitted", "2 pounds 10 ounces granualted sugar", "3 ounces (6 tablespoons) fresh lemon juice from 3 lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large stainless steel or glass mixing bowl, combine apricots, sugar, and 1 1/2 ounces (3 tablespoons) lemon juice and mix until all the sugar is moistened; if some sugar remains dry, allow to macerate until fruit has released enough juices to moisten sugar, 5 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape apricot mixture into a wide shallow pot and heat over medium-high heat, stirring regularly, until sugar is melted and mixture starts to bubble, 10 to 15 minutes. Set several metal spoons on a plate in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat apricot mixture over medium-high heat, stirring as needed to prevent scorching, until jam starts to foam, about 15 minutes. Continue to cook, stirring minimally and lowering the heat if necessary to prevent scorching, until foaming has subsided, about 15 minutes longer; scrape any foam off jam surface with a stainless steel spoon as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste jam for tartness: If the jam tastes too sweet without a good balance of tartness, add 1/2 ounce (1 tablespoon) of the remaining lemon juice at a time, stirring well and tasting between additions, until the lemony flavor is just barely perceptible and the balance of sweet and tart has been reached (like good lemonade).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to cook until bubbling has slowed and jam looks glossy and jam appears thickened around the edge, 5 to 15 minutes; lower heat as necessary to prevent scorching. Turn off heat and set a dollop of jam on one of the freezing-cold spoons, then return to freezer for 5 minutes. Jam is ready once it holds together and doesn't run off the spoon when tilted. If jam is too runny, return to heat and cook, stirring frequently and repeating the spoon test every 5 minutes, until jam passes test.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat right away or can, following canning instructions. Canned jams can be stored in a cool, dark place for up to one year.</p>"}]}