{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/201402130-mushroom-onion-sandwich-vegan-recipe-7.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["mushroom", "onion", "panini", "sandwich", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vegan Caramelized Onion and Mushroom Panini With Sun-Dried Tomato Mayonnaise", "link": "https://www.seriouseats.com/recipes/2014/02/vegan-caramelized-onion-mushroom-panini-sun-dried-tomato-mayonnaise.html", "description": "A hearty vegan sandwich with a balance of sweet caramelized onions, savory mushrooms, and a tangy sun-dried tomato mayonnaise.", "totalTime": "45 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Dairy-Free", "Mushrooms", "Onion", "Sandwiches", "Vegan", "Vegetarian"], "recipeIngredient": ["2 tablespoons olive oil, divided", "2 medium onions, thinly sliced (about 3 cups)", "Kosher salt and freshly ground black pepper", "1 pound button, shiitake, cremini, or portabello mushrooms, trimmed and thinly sliced", "2 medium cloves garlic, minced", "1 teaspoon soy sauce", "1 tablespoon fresh lemon juice", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2012/01/how-to-make-vegan-mayo-mayonnaise-recipe.html\">homemade</a> or store-bought vegan mayonnaise", "1/3 cup oil-packed sun-dried tomatoes", "2 small loaves ciabatta or other hearty rolls, split in half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in a large saucepan over medium heat until shimmering. Add onions, season with salt and pepper, and cook, stirring frequently, until lightly browned and a pale brown patina builds up on the bottom of the pan, about 10 minutes. Add 1 tablespoon water and scrape up browned bits. Repeat, cooking, adding water, and scraping up bits until onions are soft and very sweet, about 30 minutes total. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While onions cook, heat remaining oil in a large skillet over high heat until shimmering. Add sliced mushrooms, season lightly with salt and pepper, and cook, stirring occasionally, until mushrooms have released all their liquid, the liquid has evaporated, and the mushrooms have deeply browned, about 15 minutes. Add half of garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add soy sauce and half of lemon juice and stir to combine. Season to taste with salt and pepper. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine mayonnaise, remaining lemon juice, tomatoes, and garlic in a food processor. Process until a rough purée is formed, about 30 seconds, scraping down sides as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a panini press. Spread both sides of rolls with sun-dried tomato mayonnaise, top bottom bun with onions and mushrooms, close sandwiches, place in press, close gently, and cook for 5 minutes. Press more firmly to compress sandwiches and continue cooking until crisp and fully heated through, about 5 minutes longer. Serve immediately.</p>"}]}