{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140731-meat-hook-meat-book-inevitable-pork-chop-with-cheddar-grits-michael-harlan-turkell.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["Cook the Book", "grits", "pork", "the meat hook meat book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Inevitable Pork Chop With Cheddar Grits From 'The Meat Hook Meat Book'", "link": "https://www.seriouseats.com/recipes/2014/08/the-inevitable-pork-chop-with-cheddar-grits-f.html", "description": "This recipe, from Tom Mylan's <a href=\"http://www.amazon.com/Meat-Hook-Book-Butcher-Better/dp/1579655270/?tag=serieats-20\"><em>The Meat Hook Meat Book,</em></a> is actually from Chef Jean Adamson of Vinegar Hill House, the Brooklyn restaurant known for their stellar pork chop. Brooklyn blood runs thick, friends in high places, and all that. However it made it's way to us, thank goodness it did. Insanely flavorful and juicy from a 12-hour brining, the chop is Flinstonian in proportions and, I think it's fair to say, generally epic.", "totalTime": "24 hours", "recipeYield": "Serves 2", "recipeCategory": ["Cook the Book", "Mains", "Pasta", "Pork"], "recipeIngredient": ["For the Brine", "1/2 cup sugar", "1/2 cup kosher salt", "20 juniper berries", "20 black peppercorns", "1 large thyme sprig", "1 head garlic, cut horizontally in half", " ", "2 double-pork-bone shoulder chops, preferably Red Wattle", "2 tablespoons grapeseed or peanut oil", "2 tablespoons unsalted butter", " ", "For the Cheddar Grits", "1 cup coarse grits, preferably Anson Mills", "4 tablespoons unsalted butter", "1 cup shredded cheddar cheese", "Kosher salt", "1 tablespoon roughly chopped drained pickled jalapeños"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You need to start this recipe 2 days ahead of time. You’re OK with that? Start by making the brine: Bring 4 cups of water to a simmer in a medium saucepan over high heat. Add all the ingredients and simmer for a few minutes more as you stir, then pour into a bowl and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next morning, transfer the chilled brine to a gallon Ziploc freezer bag (do not strain out the spices), place your shoulder chops in the brine, press out the excess air, and zip to close. Allow the bag to sit in your refrigerator for 12 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>. About 2 hours before you want to eat, start the grits. Combine 2 1/2 cups water and the grits in a medium saucepan and bring to a simmer over low heat, stirring frequently. As the grits continue to cook, they will thicken and you will have to add about 11/2 cups more water ½½1/4 cup at a time. After about <br />\r\n1 1/2 hours of cooking and stirring, the grits should be almost done. Remove from the heat, cover, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chops from the brine, rinse them, and pat dry with a paper towel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast-iron skillet over high heat, then add the oil and heat until hot. Slide the chops into the pan and cook, turning frequently (as the residual sugar from the brine tends to burn quickly), until the chops are browned and close to done, 8 to 10 minutes. Drain off the fat and add the butter to the pan. Baste and continue to flip the chops as the butter foams and starts to brown. Transfer the chops to a rack set over a platter and let rest for 5 minutes, turning them a few times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, remember those grits? Place the pan over medium heat and stir in the butter. When it has completely melted into the grits, add the cheddar and stir that in as well. Add salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just when the cheese has melted, portion the grits evenly onto two large dinner plates and sprinkle with a spoonful of the pickled jalapeños. Place the pork chops on top and serve. It’s worth all the work. Promise.</p>"}]}