{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/09/easyredsauce.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["easy", "Italian", "italian american", "low carb", "red sauce", "sauce", "tomato", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Quick and Easy Italian-American Red Sauce in 40 Minutes or Less", "link": "https://www.seriouseats.com/recipes/2014/09/easy-italian-amercian-red-sauce-recipe.html", "description": "There are times when you can stand over the stove all day, slowly cooking that red sauce down. Then there are times when you need to put dinner on the table in under an hour. For those moments when convenience trumps patience, this is the red sauce to turn to. Simmered with plenty of garlic, dried oregano, red pepper flakes, and basil, this sauce can be whipped up in no time but still has that deep, rich, long-cooked flavor.", "totalTime": "40 minutes", "recipeYield": "Makes about 5 cups", "recipeCategory": ["Condiments and Sauces", "Dairy-Free", "Italian", "Tomato", "Vegetarian"], "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "4 cloves garlic, crushed", "Generous pinch red pepper flakes", "1 teaspoon dried oregano", "3 tablespoon tomato paste", "2 (28-ounce) cans whole peeled tomatoes", "1 large sprig basil", "Kosher salt", "2 tablespoons unsalted butter (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, combine oil and garlic and heat over moderately low heat until garlic begins to very gently sizzle. Add red pepper flakes and cook, stirring, until garlic just begins to turn a light golden color, about 3 minutes. Add oregano and continue to cook, stirring, for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomato paste and cook, stirring, until paste has softened and blended with the oil, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in canned tomatoes and their juices, increase heat to medium-high, bring to a gentle simmer, then lower heat to maintain. Using an immersion blender, blend tomatoes until sauce is smooth. (Alternatively, blend tomatoes in a standard blender before adding to pot)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add basil and simmer, stirring occasionally, until sauce is reduced slightly and tastes rich, about 30 minutes. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard basil. Stir in butter, if using, until melted. Use sauce right away, or allow to cool to room temperature, transfer to sealed containers and refrigerate for up to 5 days or freeze for up to 6 months.</p>"}]}