{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140422-290398-cook-the-book-sikil-paak.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Mexican", "keywords": ["Cook the Book", "dip", "Mexican", "yucatan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sikil P'aak From 'Yucatán'", "link": "https://www.seriouseats.com/recipes/2014/04/sikil-paak-from-yucatan.html", "description": "For a dip so flavorful, <em>sikil p'aak</em> sure is ugly. A moderately chunky puree of ground pumpkin seeds, tomato puree, chiles, herbs, and onion, the hearty appetizer is a full expression of Yucatecan harvest time. I'll encourage you to ignore the appearance.", "totalTime": "40 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Condiments and Sauces", "Cook the Book", "Gluten-Free", "Mexican", "Pumpkin", "Sides", "Snacks", "Vegetarian"], "recipeIngredient": ["2 cups (250 g) hulled pumpkin seeds", "&nbsp", "<strong>Tomato Puree</strong>", "2 medium Roma tomatoes (7 oz / 200 g), charred", "2 medium cloves garlic (1/2 oz / 12 g), peeled and charred", "1–2 medium chiles habaneros (7–14 g), charred, seeded, and finely chopped", "1/2 cup (125 ml) water", "1/4 cup (62.5 ml) Seville orange juice, or substitute (see above)", "2 teaspoons (12 g) sea salt or powdered chicken or vegetable bouillon, or to taste", "&nbsp", "<strong>Dip</strong>", "1/4 cup (20 g) chives, chopped", "1/2 medium white onion (5 oz / 137.5 g), charred and finely chopped", "3 tablespoons (11 g) fresh cilantro leaves, finely chopped", "Tortilla chips (for serving)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the pepita molida:</strong> Heat a large dry cast-iron skillet over highest heat for 5 minutes. Place the seeds in the hot skillet. As soon as they begin to pop, toss or stir them vigorously and constantly to avoid burning the seeds at the bottom. Continue toasting until the seeds are fragrant and golden brown, about 5 minutes. Immediately transfer the seeds to a metal colander or large sieve (do not leave them in the skillet: residual heat can burn the seeds at the bottom). Outdoors, or in a place where you don't mind making a bit of mess, briskly toss the seeds in the colander to shake off the papery skins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the seeds have cooled, place them in the bowl of a large food processor fitted with the metal blade. Process 3-4 minutes, until the powder begins clumping on the sides of the bowl. Stop the motor and use a spatula to scrape the powder back into the bowl. Process another 2-3 minutes. Scrape the bowl down again and process until you see very little movement of the powder (the clumping action is a result of the oils being released from the seeds). Taste a bit of the powder: it should have a pleasant texture but not be grainy. If it's grainy, process a minute or two more. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the tomato puree:</strong> Place the ingredients in the jar of a blender and process until thoroughly liquefied; set aside. You should have 2 cups of the purée; if not, add water to complete the amount.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish the dip and serve:</strong> Place the pepita molida in a large mixing bowl. Different conditions will cause the ground seeds to absorb the liquid at different rates, so add the tomato purée to the seeds gradually. Start by adding only about 3/4 of the contents of the blender and stir to blend thoroughly. Let the mixture rest for 5–10 minutes; the seeds will absorb the liquid and the dip will thicken. Add more of the liquid if you wish. In cantinas, Sikil p'aak is served in a thinner state, something like yogurt, but I prefer mine to be a thicker paste. You will add between 1 1/2 and 2 cups of the purée. Stir in the chives, chopped onion, and cilantro and check for seasoning; add salt if necessary.</p>"}]}