{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140203-meat-lite-bake-eggs-mushrooms-ham-cheddar.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["breakfast", "easy", "egg", "ham", "mushroom", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baked Eggs With Mushrooms, Cheddar, and Ham", "link": "https://www.seriouseats.com/recipes/2014/02/baked-eggs-in-cream-with-mushrooms-cheddar-and-ham-recipe.html", "description": "These savory eggs bake in the oven in a water bath, ensuring even cooking and a perfect result every time.", "totalTime": "30 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Ham", "Mains", "Meat Lite", "Mother's Day", "Mushrooms"], "recipeIngredient": ["2 tablespoons butter, plus more for greasing ramekins", "2 cups thinly-sliced button mushrooms", "2 slices thick-cut cooked ham, chopped", "1 teaspoons chopped fresh thyme leaves", "1/2 cup grated cheddar cheese", "2 tablespoons heavy cream", "4 eggs, at room temperature", "Kosher salt and freshly ground black pepper", "2 teaspoons chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350°F. Fill a medium pot with water and bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in a large cast-iron skillet over high heat until foaming, then add mushrooms. Cook, stirring occasionally, until mushrooms release their liquid and it boils off, about 12 minutes. Add ham and cook, stirring occasionally, until mushrooms brown, about 6 additional minutes. Add thyme and cook until fragrant, about 30 seconds. Season to taste with salt and pepper and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly butter the inside of 1 gratin dish or 2 small ramekins. Add cream, then add 2/3 of the mushroom mixture, and sprinkle with 2/3 of the cheese, dividing between ramekins if using two. Carefully add eggs to ramekin and season with salt and pepper. Top eggs with remaining mushroom mixture and sprinkle with remaining cheese, again dividing between ramekins as needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open oven and place a rimmed baking pan on the rack. To make a water bath, carefully fill the pan with boiling water until water level reaches about halfway up the sides of the pan. Carefully add egg dishes to water bath, close oven door and bake until egg whites are firm but yolks are still runny, about 12 minutes, or to taste. Sprinkle with parsley and serve. </p>"}]}