{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140421-spaghetti-squash-pesto-crostini-prosciutto.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "Italian", "keywords": ["bruschetta", "crostini", "easy", "Italian", "prosciutto", "sandwich", "snack", "spaghetti squash", "squash", "toast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spaghetti Squash-Pesto Crostini With Prosciutto", "link": "https://www.seriouseats.com/recipes/2014/04/spaghetti-squash-pesto-crostini-with-prosciutto-recipe.html", "description": "Spaghetti squash is fun, but It's never quite hearty enough to satisfy. Here, we toss it with a rich parsley pesto, pair it with meaty prosciutto and serve it on top of toasted bread for a dish that's light enough to serve as an hors d'oeuvres, but hearty enough to eat as a light lunch.", "totalTime": "30 minutes", "recipeYield": "Serves 6 as an appetizer or 2 to 3 as a light meal", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Italian", "Meat Lite", "Sandwiches", "Snacks", "Squash"], "recipeIngredient": ["<strong>For the Squash</strong>:", "1 medium spaghetti squash, halved lengthwise", "&nbsp;", "<strong>For the Pesto</strong>:", "1/2 cup toasted walnuts", "5 medium garlic cloves, peeled and smashed", "2 teaspoons zest from 1 lemon", "2 cups loosely packed fresh parsley leaves from 1 large bunch parsley, roughly chopped (see note)", "3/4 cup extra-virgin olive oil, plus more as necessary", "1 ounce grated Parmesan cheese (about 1/2 loosely packed cup)", "Kosher salt and freshly ground black pepper", "&nbsp;", "<strong>For the Crostini</strong>:", "12 (3/4-inch thick) slices baguette or other crusty bread", "2 tablespoons extra virgin olive oil", "2 ounces sliced prosciutto, roughly torn"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Squash</strong>: Adjust oven rack to middle position and preheat oven to 350°F. Place squash cut-side down on a rimmed baking sheet and add water until water level rises 1/4-inch up the sides of the pan. Bake squash until fork-tender and peeling away from the skin, about 35 minutes. Remove squash from oven, let cool slightly, then use a fork to scrape the inside of the squash, pulling away the spaghetti-like strands from the peel. Place squash flesh in a large bowl and cover to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pesto</strong>: While the squash bakes, combine walnuts, garlic, and lemon zest in the bowl of a food processor. Pulse until mixture is coarsely ground. Add parsley and pulse to combine. With machine running, stream in 3/4 cup olive oil or more, as needed, until pesto is sufficiently loose. Add Parmesan, pulse to combine, and season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crostini</strong>: Place baguette slices on a baking sheet and drizzle with 2 tablespoons olive oil. Bake until lightly browned and crisp, about 8 minutes. Remove from oven and let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1/2 cup pesto to warm squash and toss to combine, adding more pesto as necessary to coat squash. Season to taste with salt and pepper. Heap about 1 tablespoon squash on each crostini, then top each crostini with some torn prosciutto, dividing prosciutto evenly between 12 crostini. Serve immediately.</p>"}]}