{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140422-one-pot-wonders-farro-salad.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["asparagus", "farro", "grain", "one pot", "pea", "salad", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Warm Farro Salad With Asparagus, Peas, and Feta", "link": "https://www.seriouseats.com/recipes/2014/04/farro-salad-asparagus-peas-recipe.html", "description": "This warm one-pot farro salad is loaded with tender spring peas and asparagus, along with heartier ingredients like kale and crunchy almonds. Tossed with a tangy lemon-mustard vinaigrette and briny feta cheese, it's a healthy dish that celebrates of the transition from winter to spring.", "totalTime": "45 minutes", "recipeYield": "serves 4", "recipeCategory": ["Asparagus", "Mains", "Other Grains", "Salads", "Vegetarian"], "recipeIngredient": ["6 tablespoons extra-virgin olive oil, divided", "1 bunch asparagus, ends trimmed and cut into 2-inch pieces (about 2 1/4 cups), divided", "Pinch dried red chili flakes, or more as desired", "Kosher salt and freshly ground black pepper", "1 cup farro", "1 quart homemade vegetable stock or low-sodium vegetable broth", "1 cup fresh or frozen peas", "1 bunch kale, trimmed, washed, and cut into 2-inch ribbons (about 1 1/2 cups)", "2 tablespoons fresh lemon juice from 1 lemon", "1 tablespoon Dijon mustard", "¼ cup slivered almonds", "4 scallions thinly sliced, white and light green parts only", "1/2 cup crumbled feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a Dutch oven or large saucepan until shimmering. Add 2 cups of asparagus and chili flakes, and cook until lightly browned, about 4 minutes. Season with salt and pepper and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same saucepan, add the farro and stock and bring to a simmer. Season with salt and cook until farro is tender, about 30 minutes; add water if necessary to keep farro covered. Drain farro and transfer to a large bowl. Stir in peas and kale and let stand until peas are tender and kale is wilted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium bowl, whisk together the remaining 4 tablespoons olive oil along with the lemon juice and mustard. Season with salt and pepper. Fold vinaigrette into farro, add the cooked asparagus, almonds, scallions, feta, and remaining 1/4 cup raw asparagus. Let stand 5 minutes, then toss and serve.</p>"}]}