{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140303-meat-lite-potato-kale-chicken-casserole.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "Mexican", "keywords": ["breakfast", "brunch", "casserole", "chicken", "cinco de mayo", "comfort", "easy", "kale", "Mexican", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mexican Potato, Kale, and Chicken Casserole", "link": "https://www.seriouseats.com/recipes/2014/03/mexican-potato-kale-chickpea-casserole-meat-lite-recipe.html", "description": "Potatoes, greens, and roasted chicken come together in one spicy, cheesy breakfast bake.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Breakfast and Brunch", "Chicken", "Kale", "Mains", "Meat Lite", "Mexican", "Mother's Day", "Potato"], "recipeIngredient": ["1 pound bone-in, skin-on chicken thighs", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable oil", "1 small onion, peeled and chopped (about 1 cup)", "2 cloves garlic, minced (about 2 teaspoons)", "1 teaspoon dried thyme", "1 teaspoon ground cumin", "1/2 teaspoon ground coriander", "3 canned chipotles en adobo plus 3 tablespoons adobo sauce", "1 (28-ounce) can peeled plum tomatoes", "2 medium bunches curly kale, removed from stem and roughly chopped (about 6 cups)", "3/4 cup homemade or store-bought low-sodium chicken stock", "3 large russet potatoes (about 2 pounds), peeled and very thinly sliced", "1 3/4 cup shredded queso Oaxaca or mozzarella", "1/2 cup sour cream", "1 sliced avocado", "1/2 cup chopped fresh cilantro leaves", "6 lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400°F. Season chicken liberally with salt and pepper, place on a foil-lined rimmed baking sheet and roast, skin-side up, until an instant read thermometer inserted into the meat registers 165 to 170°F, 20 to 30 minutes. Transfer to a bowl, let cool until cool enough to handle, then shred chicken using your hands, discarding bones and skin; set chicken aside. Reduce oven heat to 375°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a Dutch oven over medium heat until shimmering. Add onions and garlic. Cook, stirring, until onions become translucent, about 5 minutes. Add thyme, cumin, and coriander and cook, stirring, until fragrant, about 30 seconds. Add chipotles and stir to combine. Add tomatoes. Bring sauce to a boil, reduce to a simmer, and cook, partially covered, for 15 minutes. Let cool slightly before before blending smooth with a hand blender or a countertop blender. Season to taste with salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place kale in a large pot set over medium heat and add broth. Cover and cook until wilted, stirring occasionally, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble:</strong> Spread 3/4 cup sauce in the bottom of a large rectangular casserole dish, then tile bottom of dish with one layer of sliced potatoes, overlapping slices slightly, using approximately one sliced potato. Cover potatoes with half of the wilted kale, distributing evenly. Sprinkle half the shredded chicken over the kale, then sprinkle 1/2 cup shredded cheese over chicken. Spread 3/4 cup sauce over cheese and repeat layering. Finish the casserole with one more layer of evenly-tiled potato slices, then top with remaining 3/4 cup shredded cheese and cover tightly with tin foil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake casserole until bubbly and heated through, about 30 minutes, then remove foil and bake until top layer of cheese is lightly browned, about 15 minutes. Remove from oven and let rest for 15 minutes before serving. Garnish casserole slices with sour cream, avocado slices, chopped cilantro and lime wedges, if desired.  </p>"}]}