{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141208-battle-of-the-buttercreams-nila-jones-american-primary.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["baking", "buttercream", "frosting", "icing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic American Buttercream", "link": "https://www.seriouseats.com/recipes/2014/12/classic-american-buttercream-recipe.html", "description": "This classic American buttercream is deliciously creamy, super sweet, and incredibly fluffy, and one of the easiest buttercreams to master. It's just a matter of beating softened butter until it's fluffy, adding powdered sugar, cream and a little vanilla and whipping it all together. No cooking required!", "totalTime": "8 minutes", "recipeYield": "Makes about 2 cups of buttercream, enough to generously frost 8 cupcakes", "recipeCategory": ["Desserts"], "recipeIngredient": ["3/4 cup (1 1/2 sticks) unsalted butter, softened to room temperature", "2 1/4 cup plus 1 teaspoon powdered sugar", "3 tablespoons heavy cream", "1 teaspoon vanilla extract", "Pinch of fine table salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to a stand mixer fitted with the whisk or paddle, or a medium mixing bowl if using a handheld mixer. Beat butter at medium speed until creamy, smooth, and lightened in color, about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sugar, cream, vanilla, and salt and mix at low speed until somewhat incorporated. Increase the speed to high and mix until buttercream is smooth and fluffy, 3-5 minutes. (If the buttercream is too thick, add a little more cream, if it’s too thin, add more powdered sugar.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use immediately or refrigerate in an airtight container or a zipper-lock bag for up to 2 weeks or in the freezer for up to 2 months. To use buttercream that has either been refrigerated or frozen, first allow to come to room temperature then beat until smooth and spreadable again. Cakes or cupcakes decorated with buttercream generally keep for up to 3 days, stored in an airtight container in the fridge. Serve buttercream at room temperature.</p>"}]}