{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140123-280926-dinner-tonight-chicken-rice-almonds-cherries.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Indian", "keywords": ["almond", "basmati", "cherry", "chicken", "chicken and rice", "easy", "Indian", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Chicken and Rice With Almonds and Dried Cherries", "link": "https://www.seriouseats.com/recipes/2014/01/chicken-and-rice-almonds-dried-cherries-dinner-tonight-recipe.html", "description": "Originally, this chicken and rice dish, with its mix of cinnamon and almonds, reminded me of Morocco, which isn't such a bad place to be. But then I realized that the spices are just as comfortable in India. In the end, I decided that as long it tasted good I would let the dish remain a bit ambiguous.", "totalTime": "45 minutes to an hour", "recipeYield": "Serves 4", "recipeCategory": ["Cherry", "Chicken", "Dinner Tonight", "Indian", "Mains", "Nuts", "Rice"], "recipeIngredient": ["1 whole chicken, cut into 8 pieces (2 thighs, 2 drumsticks, 4 breast pieces), or 2 pounds mixed chicken pieces", "Kosher salt and freshly ground black pepper", "3 tablespoons butter ", "1 (2-inch) cinnamon stick", "1 medium onion, chopped (about 1 cup)", "1/2 cup slivered almonds ", "1/2 cup dried cherries ", "3 dried hot red chilies (such as chile de arbol)", "2 cups basmati rice (or other long-grain rice), rinsed until water runs clear", "2 2/3 cups low-sodium homemade or store bought chicken broth", "1/2 cup chopped fresh cilantro leaves and fine stems", "1/2 cup chopped fresh mint leaves", "Hot sauce like harissa or mango pickle (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season chicken generously with salt and pepper. Heat butter in a large pot or dutch oven over medium-high heat until foaming subsides, swirling pan gently. Add as much of the chicken as will comfortably fit in one layer, skin-side down. Cook until golden brown, about 4 minutes. Flip and brown on the other side, another 3 minutes. Set browned chicken pieces aside and, if necessary, repeat process with remaining chicken. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove all but 3 tablespoons of fat. Add cinnamon stick and cook until fragrant, about 10 seconds. Add onion and cook, stirring often to dislodge any browned bits, until lightly browned, 4 to 5 minutes. Add almonds and cook until lightly toasted, about 1 minute. Add dried cherries and dried red chilies and cook for 1 minute more, stirring often. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in rice and cook until the grains turn a chalky white, about 1 minute. Add the broth, season with a 1/2 teaspoon of salt, and bring to a boil over high heat. Reduce heat to low, nestle the chicken pieces on top, cover, and cook until the rice is fluffy and the chicken pieces are fully cooked, 20 to 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Garnish chicken and rice with cilantro and mint. Serve with lemon and hot sauce of your choice. </p>"}]}