{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141010-Serious-Eats-Sunday-Supper-Oven-Roasted-Tomato-Sauce-Salami-Olives-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Italian", "keywords": ["anchovy", "caper", "easy", "Italian", "pasta", "sauce", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Oven-Roasted Tomato Sauce With Salami, Olives, and Pecorino", "link": "https://www.seriouseats.com/recipes/2014/10/oven-roasted-tomato-sauce-salami-olive-pecorino-recipe.html", "description": "This no-fuss, fail-safe oven-roasted tomato sauce is loaded with bold ingredients: salami, sherry vinegar, kalamata olives, capers and a smashed anchovy, all tied together with olive oil and a touch of white wine. Its secret ingredient? A bit of maple syrup for sweetness. Then, it's tossed with al dente spaghetti noodles and showered with Pecorino and lemon zest.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Italian", "Mains", "Pasta", "Sunday Supper", "Tomato"], "recipeIngredient": ["1 pound cherry or grape tomatoes, halved if they’re large", "2 1/2 tablespoons olive oil", "1 1/4 tablespoons sherry vinegar", "1 teaspoon maple syrup", "2 sprigs fresh thyme", "Kosher salt and freshly ground black pepper", "4 ounces Genoa salami, diced", "1 medium white onion, finely chopped (about 1 cup)", "1 medium clove garlic, minced (about 1 teaspoon)", "2 teaspoons capers, drained and chopped", "1/4 cup pitted, sliced kalamata olives", "1 anchovy, mashed into a paste", "2 tablespoons dry white wine", "12 ounces to 1 pound dry spaghetti", "1 teaspoon zest from 1 lemon", "2 tablespoon finely grated Pecorino cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 375&deg;F. Add tomatoes, olive oil, vinegar, maple syrup and thyme to an 8- by 13-inch glass baking dish. Season with salt and pepper and toss to combine, taking care not to over-salt since you’ll be adding briny ingredients next. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in oven and roast until tomatoes start to wrinkle, about 30 minutes. Add salami, onion, garlic, capers, olives, anchovy and wine and stir to combine. Return mixture to oven to cook until tomatoes are completely softened and onions are translucent, about 30 minutes. Stir and return to oven until tomatoes are wrinkly and lightly burnished, about 10 minutes longer. Discard thyme sprigs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When sauce is nearly done cooking, bring water to a boil in a medium saucepan. Cook spaghetti according to the package directions, draining pasta 1 minute before the shortest cooking time listed (typically at about 9 1/2 minutes) and reserving 1/2 cup of pasta cooking water. Return pasta to its original saucepan. Add sauce and a splash of pasta water, stir to combine and finish cooking over high heat until pasta is al dente and sauce has coated the strands, about 1 minute. Season to taste with salt and pepper as desired. Transfer to a warm serving bowl, top with lemon zest and Pecorino, and serve immediately.</p>"}]}