{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140505-asparagus-sweet-pea-frittata-cooking.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["asparagus", "breakfast", "egg", "frittata", "mint", "pea", "salad", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Asparagus and Sweet Pea Frittata With Minty Spring Salad", "link": "https://www.seriouseats.com/recipes/2014/05/asparagus-pea-frittata-asparagus-mint-salad-recipe.html", "description": "This simple pea-and-asparagus frittata is a quintessential spring dish that's as perfect for breakfast as it is a light lunch, snack or dinner. Served with a bright, fresh salad that's flavored with fresh mint and shaved asparagus, it becomes a quick and easy meal in its own right.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Asparagus", "Breakfast and Brunch", "Eggs", "Father's Day", "Mains", "Mother's Day", "Salads", "Snacks", "Vegetarian"], "recipeIngredient": ["10 large eggs", "Kosher salt", "1/4 cup plus 1 tablespoon extra-virgin olive oil, divided, plus more for drizzling", "1 small yellow onion, diced", "One (1-pound) bunch asparagus, woody ends trimmed, half cut into 1/4-inch dice (about 1 cup), half stalks shaved with a vegetable peeler and tips halved", "1 cup sweet peas from about 1/2 pound fresh shelling peas or one (10-ounce) bag frozen peas", "Freshly ground black pepper", "2 ounces pea tendrils or other tender lettuce (about 4 lightly packed cups)", "1/2 cup loosely packed torn mint leaves from about 10 sprigs", "1 tablespoon fresh lemon juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust broiler rack to 10 inches from heat source and preheat broiler to high. Beat eggs in a large bowl with 2 generous pinches of salt. Set aside. In a medium oven-proof non-stick skillet, heat 2 tablespoons oil over medium-high heat until shimmering. Add onion and cook, stirring, until just translucent, about 2 minutes. Add diced asparagus and peas, season with salt and pepper, and cook, stirring, until tender but not browned, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add egg and cook, stirring, until moist curds have formed throughout, 1 to 2 minutes. Transfer skillet to broiler and cook until top is set, about 3 minutes. Let frittata cool slightly. Run a thin spatula around and under frittata to detach any spots stuck to skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Invert a large plate over skillet, and in one quick motion turn frittata out onto plate. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine shaved asparagus and halved tips with pea tendrils and mint in a large bowl. Add remaining 3 tablespoons olive oil and the lemon juice, season with salt and pepper, and toss to coat evenly. Cut frittata into wedges and serve with salad on the side.</p>"}]}