{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140129-281093-cook-the-book-honeyed-tangerine-lemon-marmalade.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "whole-grain mornings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Honeyed Tangerine and Lemon Marmalade From 'Whole-Grain Mornings'", "link": "https://www.seriouseats.com/recipes/2014/01/honeyed-tangerine-and-lemon-marmalade-from-whole-grain-mornings.html", "description": "Marmalade might not contain any whole grains, but it certainly makes a great accompaniment to many of the grain-based recipes in <a href=\"http://asweetspoonful.com/about\" target=\"_blank\">Megan Gordon</a>'s new cookbook, <em><a href=\"http://www.amazon.com/Whole-Grain-Mornings-Breakfast-Recipes-Seasons/dp/1607745003/?tag=serieats-20\" target=\"_blank\">Whole-Grain Mornings</a></em>. Spread over buttered toast, drizzled on buckwheat pancakes, or stirred into a bowl of oatmeal, this bright citrusy preserve is a perfect antidote to winter.", "totalTime": "About 1 1/2 hours, plus cooling time", "recipeYield": "Makes about 3 cups", "recipeCategory": ["Breakfast and Brunch", "Condiments and Sauces", "Cook the Book", "Gluten-Free", "Sides", "Vegetarian"], "recipeIngredient": ["1 1/2 pounds / 675 g seedless tangerines or mandarin oranges", "1 lemon", "3 cups / 720 ml water", "2 cups / 370 g granulated white sugar ", "1/4 cup / 60 ml honey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small plate in the freezer to use later for testing the doneness of your marmalade. Wash your jam jars thoroughly and let them dry completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash and dry the citrus well. Trim away the ends of the fruit, then slice each into quarters. Remove the seeds from the lemon. Using a sharp knife, slice away the citrus flesh from the peels (some tangerines peel quite easily&mdash;lemons are a bit more challenging). Slice the lemon and tangerine peels into thin strips, about 1/8 inch wide (or 1/16 inch wide if you like a more delicate marmalade). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a pot with water and bring to a boil over high heat. Add the peels only (not the flesh) and let them simmer for just 2 minutes (to help diminish any bitter flavor from the pith). Remove from the heat, drain, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heavy-bottomed pot over high heat, bring the citrus flesh and peels and the water to a boil. Decrease the heat to medium-low and simmer until the citrus peels are tender, 20 to 25 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the sugar and honey and stir well until both dissolve into the mixture. Increase the heat to medium and return to a boil. If there are big segments of citrus that haven’t yet cooked down, use a wooden spoon to mash them slightly, creating a more even texture. Cook until the marmalade is reduced by half, begins to thicken, and turns an amber color, 35 to 40 minutes (see note, following, on how to gauge doneness). Stir occasionally to ensure it isn’t sticking to the pan. Remove from the heat and pour into the prepared glass jars or heatproof airtight containers. Let the marmalade cool completely, uncovered. Cover and store in the refrigerator for up to 3 weeks or in the freezer for up to 6 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> To test the marmalade for doneness, place a small dab on a plate that’s been chilled in the freezer and freeze for 2 minutes. It is done if a thin film develops on the surface and the marmalade stiffens to appear more jammy than liquid-y. If it simply spreads out and thins, it’s not done and needs further cooking.</p>"}]}