{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140918-jamie-olivers-comfort-food-insanity-burger-david-loftus.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["beef", "burger", "Cook the Book", "jamie oliver's comfort food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Insanity Burger From 'Jamie Oliver's Comfort Food'", "link": "https://www.seriouseats.com/recipes/2014/09/insanity-burger-from-jamie-olivers-comfort-food.html", "description": "There are those of you who might be wondering why you need yet another burger recipe, and there are those who just can't get enough. This burger from <a href=\"http://www.amazon.com/Jamie-Olivers-Comfort-Food-Ultimate/dp/0062305611/?tag=serieats-20\"><em>Jamie Oliver's Comfort Food</em></a> is for both of you: it delivers classic flavor all juiced up and a little weird, in a wonderful way. Oliver takes the traditional components and gets kinda nutty with them, adding slight twists that really do make this a worth-a-try-even-if-you're-sick-of-burgers burger.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Beef", "Burger", "Cook the Book", "Mains", "Sandwiches"], "recipeIngredient": ["1 3/4 lbs ground chuck steak ", "olive oil", "1 large red onion", "1 splash of white wine vinegar", "2 large gherkins", "4 sesame-topped brioche burger buns", "4–8 slices of smoked bacon", "4 teaspoons yellow mustard", "Tabasco Chipotle sauce", "4 thin slices of Red Leicester cheese", "4 teaspoons tomato ketchup", " ", "<strong>Burger Sauce</strong>", "1/4 of an iceberg lettuce", "2 heaping tablespoons mayo", "1 heaping tablespoon tomato ketchup", "1 teaspoon Tabasco Chipotle sauce", "1 teaspoon Worcestershire sauce", "optional: 1 teaspoon brandy or bourbon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the best burger, go to your butcher and ask them to grind 1 3/4 lbs of chuck steak for you. This cut has a really good balance of fat and flavorsome meat. Divide it into 4 and, with wet hands, roll each piece into a ball, then press into flat patties roughly 5 inches wide and about 3/4 inch wider than your buns. Place on an oiled plate and chill in the fridge. Next, finely slice the red onion, then dress in a bowl with the vinegar and a pinch of sea salt. Slice the gherkins and halve the buns. Finely chop the lettuce and mix with the rest of the burger sauce ingredients in a bowl, then season to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I like to cook only 2 burgers at a time to achieve perfection, so get two pans on the go—a large non-stick frying pan on a high heat for your burgers and another on a medium heat for the bacon. Pat your burgers with oil and season them with salt and pepper. Put 2 burgers into the first pan, pressing down on them with a slotted spatula, then put half the bacon into the other pan. After 1 minute, flip the burgers and brush each cooked side with a ½ teaspoon of mustard and a dash of<br />\r\nTabasco. After another minute, flip onto the mustard side and brush again with another 1/2 teaspoon of mustard and a second dash of Tabasco on the other side. Cook for 1 more minute, by which point you can place some crispy bacon on top of each burger with a slice of cheese. Add a tiny splash of water to the pan and place a heatproof bowl over the burgers to melt the cheese—30 seconds should do it. At the same time, toast 2 split buns in the bacon fat in the other pan until lightly golden. Repeat with the remaining 2 burgers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To build each burger, add a quarter of the burger sauce to the bun base, then top with a cheesy bacon burger, a quarter of the onions, and gherkins. Rub the bun top with a teaspoon of ketchup, then gently press together. As the burger rests, juices will soak into the bun, so serve right away, which is great, or for an extra-naughty experience, wrap each one in parchment paper, then give it a minute to go gorgeous and sloppy.</p>"}]}