{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140416-grilled-stuffed-flank-steak-pinwheels-food-lab-recipe-40.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["beef", "flank steak", "grill", "Japanese", "negimaki", "scallion", "steak", "teriyaki"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Grilled Stuffed Flank Steak With Scallions, Ginger, and Teriyaki Glaze", "link": "https://www.seriouseats.com/recipes/2014/05/grilled-stuffed-flank-steak-scallion-ginger-teriyaki-recipe.html", "description": "Negimaki&mdash;grilled beef rolled around scallions and grilled with a sweet and savory teriyaki-style glaze&mdash;is one of my favorite Japanese appetizers. Here we've Super Mario mushroom'd it to full main course-sized proportions, stuffing a butterflied flank steak with an aromatic scallion-ginger oil before grilling it over hot coals and serving with a teriyaki sauce.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Beef", "Japanese", "Mains", "The Food Lab"], "recipeIngredient": ["1/4 cup vegetable oil, plus 2 teaspoons if finishing indoors", "2 cups thinly sliced scallions (about 24 scallions), plus more for garnish", "3 tablespoons minced or grated fresh ginger", "1 whole flank steak, 2 to 2 1/2 pounds, trimmed of excess fat", "Kosher salt and freshly ground black pepper", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/03/teriyaki-sauce-how-to-make-at-home-recipe.html\">Basic Teriyaki Sauce</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a small saucepan over medium-high heat until shimmering (a scingle scallion dropped into it should sizzle immediately. Meanwhile, combine scallions and ginger in a medium bowl and season well with salt. When oil is hot, pour over scallions and ginger. It should sizzle for a few seconds. Allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay steak on a cutting board with grain running parallel to the edge of the counter. Trim left and right edges to form a clean rectangle and reserve scraps for another use. Hold steak flat with your non-knife hand and, with a sharp boning knife, carefully butterfly the steak, leaving the back edge attached by 1/2- to 1/4-inch of meat. Open up steak and flatten the seam gently with your hand to form a large perfect rectangle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season steak on exposed side with salt and pepper. Spread scallion-ginger mixture over steak, leaving a 1-inch border at the top and the bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully roll the steak away from you (the grain should run width-wise), tightening as you go until it is rolled into a cylinder. Let it rest with its seam-side down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tie the beef tightly with twine, spacing the ties evenly every 1 1/2 inches. Insert a skewer through each piece of twine. Using a sharp knife, carefully cut between the ties to make the pinwheels. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on the Grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Place the pinwheels on the hot side of the grill and cook without moving until well charred on first side, about 3 minutes. Flip steaks and char second side, about 3 minutes longer. Transfer to cooler side of grill, brush with 1 to 2 tablespoons teriyaki sauce, cover, and cook until an instant read thermometer inserted into the center registers 120°F for medium-rare or 130°F for medium, flipping once half way through cooking and brushing with more sauce. Transfer to a platter, let rest for five minutes, brush with more sauce, sprinkle with scallions, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Alternatively, to Finish Indoors</strong>: Adjust oven rack to center position and preheat oven to 400°F. Heat 2 teaspoons vegetable oil in a large skillet over high heat until lightly smoking. Add steaks and cook, turning occasionally, until well browned on both sides, about 4 minutes total. Transfer to a wire rack set in a foil-lined rimmed baking sheet. Brush with sauce and transfer to oven. Cook until an instant read thermometer inserted into the center registers 120°F for medium-rare or 130°F for medium, flipping once half way through cooking and brushing with more sauce, about 2 to 5 minutes total. Transfer to a platter, let rest for five minutes, brush with more sauce, sprinkle with scallions, and serve.</p>"}]}