{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140528-293828-cook-the-book-eggplant-meatballs.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "eggplant", "sandwich", "the vb6 cookbook", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eggplant Meatballs From 'The VB6 Cookbook'", "link": "https://www.seriouseats.com/recipes/2014/05/eggplant-meatballs-from-the-vb6-cookbook.html", "description": "Hearty and versatile eggplant has got to be one of the best vegetable substitutes for meat. <strong><a href=\"http://markbittman.com/about-me/\" target=\"_blank\">Mark Bittman</a></strong> uses the nightshade as the base for meat-less meatballs in his new <em><a href=\"http://www.amazon.com/The-VB6-Cookbook-Delicious-Flexitarian/dp/0385344821/?tag=serieats-20\" target=\"_blank\">VB6 Cookbook</a></em>. Once baked, the tender \"meatballs\" are surprisingly flavorful (as long as you don't skimp on the salt), making it easy to forget that you may normally be eating beef.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Dairy-Free", "Eggplant", "Mains", "Sandwiches", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>Eggplant Meatballs</strong>", "3 tablespoons olive oil", "1 pound eggplant, unpeeled, cut into cubes no larger than 1 inch", "1 teaspoon salt", "1/2 teaspoon pepper", "1 onion, chopped", "1 tablespoon minced garlic", "1 cup cooked or canned white beans", "1/4 cup chopped fresh parsley", "1 cup breadcrumbs, preferably whole wheat ", "Pinch red chile flakes ", "&nbsp", "<strong>All-Purpose Tomato Sauce</strong>", "2 tablespoons olive oil", "1 onion, chopped", "2 tablespoons minced garlic", "1 teaspoon salt", "1/2 teaspoon pepper", "Red chile flakes, to taste", "2 (28-ounce) cans diced tomatoes, with their juice", "1 cup chopped fresh basil or 1/2 cup chopped fresh parsley (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the meatballs:</strong> Heat the oven to 375°F. Use 1 tablespoon olive oil to grease a large rimmed baking sheet. Put 1 tablespoon oil in a large skillet over medium-high heat. When it’s hot, add the eggplant and 1/4 cup water. Sprinkle with the salt and pepper and cook, stirring occasionally, until the pieces shrivel a bit and are tender and beginning to color, 10 to 15 minutes. Transfer the eggplant to the bowl of a food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 1 tablespoon oil to the pan along with the onion and garlic and return to the heat. Cook, stirring frequently until they’re soft and translucent, 3 to 5 minutes. Meanwhile, drain the beans; if using canned, rinse the beans also. Add the beans and parsley to the work bowl with the eggplant and pulse until well combined and chopped, but not pureed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the eggplant mixture with the onion and garlic, then add the breadcrumbs and red chile flakes if you’re using them. Taste and adjust the seasoning. Roll the mixture into 12 balls about 2 inches in diameter; transfer them to the prepared pan. Bake, undisturbed, until they’re firm and well browned, 25 to 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, make the tomato sauce:</strong> Put the oil in a large pot over medium heat. When it's hot, add the onion and garlic, 1/2 teaspoon of the salt, the pepper, and the red chile flakes if you're using it. Cook, stirring occasionally, until the vegetables soften, 3 to 5 minutes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the tomatoes and the remaining 1/2 teaspoon salt, and adjust the heat so the mixture bubbles steadily. Cook, stirring occasionally, until the tomatoes break down, the vegetables become very soft, and the mixture thickens, 15 to 20 minutes. If the mixture looks too thick, stir in a splash of water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the herb, if you're using it; taste and adjust the seasoning. You'll need to use about 2 cups along with the meatballs. Store the remaining sauce in the refrigerator for up to several days, or in the freezer for several months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Serve the meatballs hot or at room temperature along with the tomato sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation: Mushroom Meatballs</strong><br />\r\nFor those who don’t fancy eggplant, or just as a change, substitute 1 pound chopped mushrooms of any kind for the eggplant. In Step 1, cook them until the pan is dry and they start to stick a bit, 5 to 10 minutes. Then mix, form, and bake as in the original recipe.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Variation: Cauliflower Meatballs</strong><br />\r\nSubstitute 1 pound chopped cauliflower for the eggplant; core and roughly chop it. In Step 1, cook the pieces until the pan is dry and they start to brown a bit, 10 to 15 minutes. Then mix, form, and bake as in the original recipe.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>More Ideas:</strong> The coarser the breadcrumbs are, the better. If you can’t make your own, use panko (preferably whole wheat if you can find it).</p>"}]}