{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140501-grilled-kale-salad.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["grill", "kale", "kale salad", "salad", "side"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled-Kale Salad With Warm Bacon Vinaigrette", "link": "https://www.seriouseats.com/recipes/2014/05/grilled-kale-salad-with-warm-bacon-vinaigrette-recipe.html", "description": "Kale is one of the trendiest vegetables these days, but it's still possible to serve it in a surprising way: grilled. Smoky and with a touch of crunch, hearty lacinato leaves are a delightful, if unusual, vehicle for a vinaigrette made with crisped bacon, shallots, and apple cider vinegar. It's a killer side dish you'll want to nestle alongside your potato salad and hamburgers at your next BBQ.", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["Bacon", "Christmas", "Kale", "Salads", "Sides", "Thanksgiving"], "recipeIngredient": ["1 large bunch lacinato (a.k.a. Tuscan or dinosaur) kale (about 1 pound)", "3 tablespoons extra-virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "3 ounces (about 3 slices) bacon, chopped", "1 small shallot, peeled and minced (about 3 tablespoons)", "1/4 cup apple cider vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1/2 chimney full of charcoal</a>. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, preheat a gas grill to high, covered, for at least 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean </a>and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil </a>the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove stems from kale: carefully cut out thick portion of kale stem from each leaf, leaving leaves intact otherwise. In a large bowl, toss kale with 2 tablespoons olive oil. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, add kale leaves to grill, cover grill, and cook until bottom sides are lightly charred, about 2 minutes. Flip kale leaves, cover grill, and cook until other side is lightly charred, about 1 minute longer. Remove kale from grill and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat remaining 1 tablespoon olive oil in a small, heavy-bottomed skillet over medium heat until shimmering. Add bacon and, when it begins to sizzle, add shallots and cook, stirring, until bacon is crispy, about 4 minutes. Add vinegar and cook briefly, stirring, just until dressing thickens and becomes glossy, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roughly chop kale and place in a serving bowl. Toss with enough vinaigrette to lightly coat leaves and serve immediately with any remaining dressing on the side. </p>"}]}