{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140718-extra-virgin-pork-loin-eric-wolfinger.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "Italian", "keywords": ["Cook the Book", "extra virgin", "Italian", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Pork Loin From 'Extra Virgin: Recipes and Love From Our Tuscan Kitchen'", "link": "https://www.seriouseats.com/recipes/2014/07/roasted-pork-loin-from-extra-virgin-recipes-a.html", "description": "Debi Mazar and Gabriele Corcos make a fine pork chop, but in this recipe from their new cookbook, <em><a href=\"http://www.amazon.com/Extra-Virgin-Recipes-Tuscan-Kitchen/dp/0385346050//?tag=serieats-20\">Extra Virgin: Recipes and Love from our Tuscan Kitchen</a></em>, it's the sauce that's the star.", "totalTime": "1 hour 45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cook the Book", "Italian", "Mains", "Pork"], "recipeIngredient": ["1/4 cup extra virgin olive oil", "5 garlic cloves, unpeeled", "3 sprigs fresh rosemary", "12 fresh sage leaves", "2 1/2 pounds pork loin", "1 cup dry white wine", "Kosher salt and freshly ground black pepper", "1/2 cup whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven, heat the olive oil over medium-high heat until hot. Add the garlic, rosemary, and sage and sauté for 4 to 5 minutes, until the herbs start to crisp. Add the pork loin, laying it on top of the herbs, and cook for 5 minutes. Turn it over and cook the other side for 5 minutes. Add the wine to the Dutch oven, using a wooden spoon to scrape any browned bits from the bottom. Cook for 1 to 2 minutes, until the scent of alcohol has disappeared.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the heat to medium-low, season with salt and pepper to taste, and partially cover with the lid. Cook for about 1 hour, turning the meat and scraping the bottom of the pot every 15 to 20 minutes. If the sauce reduces too much, add warm water in small increments, 1⁄4 cup at a time. Remove the pot from the heat and place the pork loin on a cutting board to rest for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sauce in the Dutch oven has cooled, add the milk and cook, stirring constantly to prevent curds from forming, over medium-low heat for 2 to 3 minutes, until the sauce is lightly creamy, but not thick. Thinly slice the pork loin and serve with the sauce poured on top.</p>"}]}