{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141210-baking-chez-moi-desert-roses-alan-richardson.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["baking chez moi", "cereal", "chocolate", "Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Desert Roses From 'Baking Chez Moi'", "link": "https://www.seriouseats.com/recipes/2014/12/desert-roses-from-baking-chez-moi.html", "description": "In her new cookbook, <a href=\"http://www.amazon.com/Baking-Chez-Moi-Recipes-Anywhere/dp/0547724241/?tag=serieats-20\"><em>Baking Chez Moi,</em></a> Dorie Greenspan admits she was thrown for a loop by these no-bake clusters of dried fruit, nuts, coconut, and cornflakes&mdash;yup, apparently the French <em>can</em> do low-brow&mdash;suspended in butter-enriched chocolate.", "totalTime": "50 minutes", "recipeYield": "Makes about 40 mini candies", "recipeCategory": ["Chocolate", "Cook the Book", "Cookies"], "recipeIngredient": ["1 stick (8 tablespoons; 4 ounces; 113 grams) unsalted butter, cut into chunks", "12 ounces (340 grams) bittersweet or semisweet chocolate, finely chopped", "4 cups (112 grams) cornflakes", "1/3 cup (40 grams) sweetened shredded coconut", "1/3 cup (53 grams) plump, moist dried cherries or dried cranberries, chopped", "1/3 cup (53 grams) plump, moist dried Turkish apricots, chopped", "1/3 cup (40 grams) toasted slivered almonds or walnuts, coarsely chopped", "Pinch of fleur de sel or fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment or wax paper, a silicone baking mat or aluminum foil. If you’d like to scoop the roses into paper liners or mold them into circles, have the liners or pancake rings at hand. I use a medium cookie scoop (one with a capacity of 1 1/2 tablespoons) to shape the roses, but they’re perfectly spoonable&mdash;neatness and uniformity mean nothing here.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the butter in a heatproof bowl set over a saucepan filled with a few inches of simmering water. Cover the butter with the chopped chocolate and heat, stirring occasionally, until the chocolate and butter are melted, thick and creamy; you don’t want to heat the butter and chocolate so much that they separate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the rest of the ingredients into a large bowl and stir them around, then pour over the hot butter and chocolate. Gently mix everything together. Some of the cornflakes will break, but keep stirring until all is coated in chocolate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop or spoon the mixture onto the prepared baking sheet or into the paper liners. Alternatively, you can press the mixture into pancake rings, so that you’ve got little pucks. Of course, the number of roses you’ll get will depend on the size of your sweets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide the sheet into the refrigerator and chill until set, about 30 minutes.</p>\r\n\r\n<p><strong>Serving:</strong> Roses des sables are the perfect after-school treat, but they’re just as perfect served with coffee after a grown-up meal, plain or fancy; think of them as whimsical truffles. </p>\r\n\r\n<p><strong>Storing:</strong> The roses will keep in the refrigerator for up to 4 days. Once the chocolate is firmly set, you can transfer them to a closed container.</p>\r\n\r\n<p><strong>Bonne Idée:</strong> White Chocolate Desert Roses: Use 3/4 stick (6 tablespoons; 85 grams) butter and 12 ounces best-quality white chocolate.</p>\r\n\r\n<p><strong>Another Bonne Idée:</strong> Crunchy Ice Cream Sandwiches: Scoop the roses des sables mixture into pancake rings (put the rings on a lined baking sheet) or muffin cups, making layer that’s about ¼ inch thick. Chill or freeze the disks until they are set, then sandwich softened ice cream between them. Put the sandwiches on a lined baking sheet and freeze until firm, then wrap them airtight in plastic film and freeze. Let the sandwiches soften just a tad before you serve them&mdash;nuts, raisins and chocolate can get tooth-breakingly hard in the freezer.</p>"}]}