{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140228-284269-cook-the-book-shellfish-paella.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Spanish", "keywords": ["clam", "Cook the Book", "mussel", "paella", "rice", "seafood", "shellfish", "shrimp", "spain", "spanish", "squid"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shellfish Paella (<i>Paella de Mariscos</i>) From 'Spain'", "link": "https://www.seriouseats.com/recipes/2014/02/shellfish-paella-paella-de-marisco-from-spain.html", "description": "<strong><a href=\"http://jeff-koehler.com/?page_id=2\" target=\"_blank\">Jeff Koehler</a></strong> wrote the cookbook on paella. <a href=\"http://www.amazon.com/La-Paella-Deliciously-Authentic-Mediterranean/dp/0811852512/?tag=serieats-20\" target=\"_blank\">Literally</a>. So I was keen to try out the paella recipes in his new cookbook, <em><a href=\"http://www.amazon.com/Spain-Recipes-Traditions-Verdant-Andaluc%C3%ADa/dp/0811875016/?tag=serieats-20\" target=\"_blank\">Spain</a></em>. His shellfish paella is based on a recipe from his mother-in-law, who has been making this particular pan of rice every weekend for close to 50 years; for a paella newbie like myself, it seemed like a well-tested place to start.", "totalTime": "1 1/2 hours, plus 1 hour to purge the clams", "recipeYield": "Serves 6", "recipeCategory": ["Clams, Mussels, and Oysters", "Cook the Book", "Mains", "Other Seafood", "Rice", "Shrimp", "Spanish"], "recipeIngredient": ["8 ounces (225 g) small clams, scrubbed", "8 ounces (225 g) small to medium mussels, clean and debearded", "3 tablespoons extra-virgin olive oil", "6 langoustines with heads and shells", "2 small sweet Italian green peppers or 1 small green bell pepper, cut into 1/2 inch (1.25 cm) pieces", "1 pound (455 g) small cuttlefish or squid, cleaned and cut into 1/2-inch (1.25 cm) pieces", "18 fresh whole large shrimp with heads and shells", "3 ripe medium tomatoes, halved crosswise, seeded, and grated", "1 pinch saffron threads, dry-toasted and ground", "1 teaspoon Spanish pimentón dulche (sweet paprika)", "7 cups (1.7 L) fish stock or water", "3 cups (600 g) Bomba rice or another short- or medium-grain Spanish rice (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Purge the clams of any sand: Discard any clams with cracked or broken shells. Fill a large bowl with cool water. Add 1 teaspoon of salt for every 1 quart/1 L water and dissolve. Set the clams in the water and soak for 30 minutes. Dump out the water, rinse out the bowl, and soak for another 30 minutes in clean, unsalted water. Drain, set in a dry bowl, cover with a damp paper towel, and place in the refrigerator for 15 minutes or so before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan, add the clams, cover with 1 cup/240 ml water, and bring to a boil. Cover the pot and cook, shaking from time to time, until the clams have opened, about 5 minutes. Transfer the clams to a bowl with a slotted spoon. Filter the liquid and reserve. Discard any clams that did not open. Twist off the empty half of each clam and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam the mussels: Place them in a saucepan with ½ cup/60 ml water and bring to a boil over high heat. Lower the heat, cover the pot, and simmer, shaking the pot from time to time, until the mussels have opened, 3 to 5 minutes. Remove from the heat. Drain, reserving the liquid. (Strain and set aside.) Discard any mussels that did not open. Remove the meat from each shell; discard the shells.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 16- to 18-inch/40- to 45-cm paella pan, heat the olive oil over medium heat. Add the langoustines and cook, turning over until pink, about 5 minutes. Transfer to a platter. Add the green peppers and cuttlefish and cook until tender, 8 to 10 minutes. Add the shrimp and cook, turning over once, until opaque, 4 to 5 minutes. (Remove any stray legs or antennae from the pan and discard.) Add the tomatoes and cook until soft and pulpy, about 10 minutes. Tip in some of the reserved liquid from the clams to keep it moist. Stir in the saffron and pimentón.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the stock into the pan and bring the liquid to a boil over high heat. When the liquid comes to a boil, sprinkle the rice around the pan. With a wooden spoon, check that the rice is evenly distributed and that the grains are below the surface of the liquid. Do not stir again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook uncovered for 10 minutes over high heat. Arrange the reserved langoustines across the top of the rice. Reduce the heat to low and cook uncovered for 8 to 10 minutes more, until the liquid is absorbed and the rice grains are tender but still have an al dente bite to them. If all the liquid has evaporated and the rice is still not done, shake the reserved liquid from the clams (and, if needed, from the mussels) tablespoon by tablespoon over the rice where needed and cook for an additional few minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the paella from the heat, cross wooden spoons over top, cover with paper towels, and let rest for 5 minutes to allow the rice—particularly the grains on top—to finish cooking and the starches to firm up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carry the paella to the table and serve from the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> Spanish Bomba rice is a highly absorbent short-grain Spanish variety. It is found at many supermarkets with a decent international section, as well as numerous specialty stores. The best substitute is the Italian rice Carnaroli. Alternatively use CalRiso, Calrose, or Japanese short-grain rice. For moister rice dishes (but not paellas), use the superfine-grade Italian varieties such as Arborio or Vialone Nano.</p>"}]}