{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140918-Gluten%20Free%20Apple%20Fritters-Elizabeth%20Barbone.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["apple", "dessert", "fall", "fritter", "fry", "gluten free", "pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Apple Fritters", "link": "https://www.seriouseats.com/recipes/2014/09/gluten-free-apple-fritter-recipe.html", "description": "Apple fritters should not be jelly doughnuts in which the jam is merely replaced with an apple filling. No, an apple fritter is a nubby affair with crisp bits of chopped apples scattered throughout and just the slightest hint of confectioner's glaze. Gluten-free fritters can be tough to make, but as it turns out, size matters. Our small fritters come out with the ideal ratio of crisp fried exterior to apple-packed crumb.", "totalTime": "About four hours", "recipeYield": "Makes about two dozen fritters", "recipeCategory": ["Apple", "Breakfast Sweets", "Cakes", "Cookies", "Doughnuts", "Gluten-Free", "Gluten-Free Tuesday", "Thanksgiving"], "recipeIngredient": ["<strong>For the Dough</strong>", "1 (7.5 ounce) box Chebe original cheese bread mix (see note)", "1 1/2 cups (6 ounces) white rice flour", "1/2 cup (2 ounces) sweet rice flour", "1/4 cup (1.75 ounces) granulated sugar plus 1 teaspoon, divided", "1 teaspoon ground cinnamon", "1/2 teaspoon xanthan gum", "1/2 teaspoon salt", "1/4 cup water, warm", "1 packet (2 1/4 teaspoons) active dry yeast", "1 cup milk, warm", "1 large egg", "2 tablespoons butter, melted and cooled", "1/2 teaspoon vanilla extract", "Oil or nonstick cooking spray for greasing the bowl", "<strong>For the Apples</strong>", "2 tablespoons butter", "4 tablespoons dark brown sugar", "3 large cooking apples, peeled, cored, and diced (about 3 1/2 cups total) (Granny Smith work best)", "1/2 cup apple cider", "2 1/2 teaspoons corn starch", "<strong>For Frying</strong>", "2 cups vegetable oil", "<strong>For the Glaze</strong>", "2 cups confectioner's sugar", "4 tablespoons half-and-half", "1 teaspoon vanilla extract "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> In large bowl, whisk together Chebe mix, white rice flour, sweet rice flour, 1/4 cup granulated sugar, cinnamon, xanthan gum, and salt. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In small bowl, whisk together warm water and 1 teaspoon sugar until sugar dissolves. Add yeast. Whisk until yeast dissolves. Set aside until doubled in size, about five minutes. (If yeast doesn’t bubble and double in size, it means the yeast is dead. Discard it and start with a new packet of yeast.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add warm milk, egg, melted butter, and vanilla extract to the yeast mixturere. Pour milk-yeast mixture over the whisked dry ingredients. Stir, using a wooden spoon, until a stiff dough ball forms. Generously flour your countertop and turn sticky dough out onto counter. Dust dough with white rice flour and knead dough until smooth, about one minute. Lightly oil a medium bowl. Place dough in oiled bowl. Cover with plastic wrap and allow dough to double in size, about 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Apples:</strong> In large cast iron or stainless steel skillet, combine butter and dark brown sugar. Melt butter and sugar over medium heat, stirring occasionally. Add apples and stir to combine. Cook until apples darken slightly and just begin to soften. In a small bowl, whisk together cider and cornstarch. Pour cider over the apples. Stir. Bring to a boil and cook until thick, about 3 minutes. Transfer apples to a bowl and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When dough doubles in size, punch down or stir with a rice floured wooden spoon. Stir in cooled apple mixture. Cover and allow to rise until dough almost doubles in size, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Fry:</strong> Line a rimmed baking sheet with paper towels. Heat oil in a 12-inch cast iron skillet, Dutch oven, or wok to 350&deg;F. Adjust flame during cooking to maintain temperature. Using two spoons, carefully drop balls of dough about 2 tablespoons each into the oil. Cook until edges turn golden brown. Turn and repeat. Using a wire skimmer, remove fritters from hot oil. Place on prepared baking sheet. Repeat until all the dough is fried.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the glaze:</strong> whisk together confectioner’s sugar, half and half, and vanilla extract. Line a rimmed baking sheet with parchment paper. Place a wire rack over the baking sheet. One by one, dip the fritters into the glaze. Shake excess glaze off and place fritters on wire rack. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fritters are best served the day they are made but may be held overnight. Store leftover fritters on a plate and cover with plastic wrap. </p>"}]}