{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141117-Serious-Eats-Slow-Cooker-Leftover-Turkey-Gumbo-Jennifer-Olvera-edit.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["cajun", "gumbo", "leftover", "louisiana", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Slow-Cooker Leftover Turkey and Andouille Gumbo", "link": "https://www.seriouseats.com/recipes/2014/11/slow-cooker-turkey-leftover-turkey-andouille-gumbo-thanksgiving-recipe.html", "description": "Slow cooker turkey and andouille gumbo starts with sautéed veggies and a simple roux that's cooked until toasty on the stove. After broth is added it's transferred for a long simmer, one where Worcestershire sauce provides umami and depth and Louisiana-style hot sauce offers heat and tang. Meanwhile, background notes come from bay leaves and thyme, and its signature flavor arrives courtesy of smoked sausage, Cajun seasoning, and cayenne.", "totalTime": "4 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Mains", "Slow Cooker", "Soups and Stews", "Turkey"], "recipeIngredient": ["1/4 cup, plus 1 tablespoon, vegetable or light olive oil, divided", "1 stalk celery, finely chopped", "1 medium green bell pepper, seeded finely chopped", "1 medium onion, finely chopped", "4 cloves garlic, minced", "1/2 cup all-purpose flour", "1 quart <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken or turkey stock", "2 cups cooked turkey meat, preferably a mix of dark and light", "1 cup chopped andouille or other smoked sausage", "2 tablespoons Worcestershire sauce", "2 1/2 tablespoons Louisiana-style hot sauce, such as Crystal", "1 teaspoon cayenne pepper", "1 tablespoon Cajun seasoning", "3 sprigs fresh thyme", "2 bay leaves", "Kosher salt and freshly ground black pepper", "2 cups cooked, long-grain white rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in a large saute pan over medium heat. Add celery, pepper and onion and cook, stirring often, until vegetables have begun to soften, about 5 minutes. Add garlic and continue cooking for 2 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer vegetables to the bowl of a slow cooker and return pot to the stove over low heat. Add remaining oil and flour. Cook the mixture, stirring slowly and continuously, until the roux is dark brown and fragrant, about 20 minutes.  Do not allow it to burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise heat to medium-high and gradually whisk in stock, stirring constantly to prevent lumps. When all of the liquid has been added and the liquid starts to thicken, pour it into the slow cooker. Add turkey, andouille, Worcestershire sauce, hot sauce, cayenne, Cajun seasoning, thyme and bay leaves. Season with salt and pepper, to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and cook on the low setting for about 4 hours, stirring periodically. Before serving, discard bay leaves and thyme sprigs and adjust seasoning, if needed. To serve, ladle gumbo over rice.</p>"}]}