{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140609-294902-cook-the-book-cultured-butter-and-buttermilk.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["butter", "Cook the Book", "dairy", "milk", "the nourished kitchen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sweet Cultured Butter and True Buttermilk From 'The Nourished Kitchen'", "link": "https://www.seriouseats.com/recipes/2014/06/sweet-cultured-butter-and-true-buttermilk-fro.html", "description": "The thought of homemade butter conjures images of large wooden butter churns and hours of arm-busting labor. But these days, butter is actually quite easy to make. If you have a stand mixer, you have have it ready to eat in only a few short minutes.", "totalTime": "About 24 hours", "recipeYield": "Makes about 1 cup butter and 2 cups buttermilk", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Gluten-Free", "Vegetarian"], "recipeIngredient": ["4 cups heavy cream", "1/4 cup buttermilk (store-bought or from a previous batch of butter)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the cream and buttermilk together in a large bowl. Cover the bowl loosely with a kitchen towel and tuck it away in a warm spot on your countertop. Let it stand, undisturbed, at room temperature for 18 to 24 hours, or until it tastes pleasantly sour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the bowl to the refrigerator and let the cream chill for about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip the cream vigorously for 8 to 10 minutes in a stand mixer using the paddle attachment, until it moves past soft and firm peaks to its breaking point, when bits of coagulated butter separate from the thin, watery buttermilk. Continue beating until those bits of butter form larger clumps, another 3 to 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a fine-mesh sieve with a double layer of cheesecloth or a single layer of butter muslin and place it over a bowl. Pour the clumpy bits of butter and the cloudy buttermilk into the sieve to strain it. Pour the buttermilk into a jar, cover, and refrigerate. It should keep for about a month.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the butter from the sieve and put it into the bowl that previously held the buttermilk. Add 2 cups cold water, transfer to the refrigerator, and let the butter harden for 5 to 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the butter from the fridge and drain off the water. Working the butter with the back of a wooden spoon or with a butter paddle, knead the butter repeatedly to remove any residual water or buttermilk. When the butter becomes smooth and waxy and yields no more water when pressed, wrap it tightly in parchment paper and then in foil to seal it and prevent oxidation. Place the butter in the refrigerator. It should keep for up to 2 months, or if frozen, for up to a year.</p>"}]}