{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141104-vegan-stuffing-thanksgiving-food-lab-recipe-20.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["dressing", "fall", "holiday", "mushroom", "stuffing", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8571428571429", "ratingCount": "7"}, "name": "The Best Vegan Stuffing", "link": "https://www.seriouseats.com/recipes/2014/11/best-vegan-stuffing-thanksgiving-recipe-vegetarian.html", "description": "I've only ever had one requirement for my vegan recipes (beyond the whole plant-based thing, that is): <strong>They must be good enough that even an avowed meathead would gladly down them.</strong> I wanted a stuffing with deep, complex, savory flavors that bakes up with a moist texture, almost like a savory bread pudding. I wanted stuffing so good that it would be the first side dish to disappear from the table. A stuffing so good that my meat-eating family would attack and devour it with reckless abandon.", "totalTime": "About 2 hours", "recipeYield": "Serves 10 to 14", "recipeCategory": ["Christmas", "Dairy-Free", "Fall", "Mushrooms", "Sides", "Thanksgiving", "The Food Lab", "Vegan", "Vegetarian", "Winter"], "recipeIngredient": ["2 1/2 pounds hearty vegan white bread (about 2 loaves;1.1kg), crusts removed, cut into 3/4-inch pieces (about 5 quarts)", "1 pound (450g) button, cremini, or shiitake mushrooms (or a mix), roughly chopped", "6 ounces (170g) toasted pecan halves", "1/2 cup (120ml) olive oil (see note)", "1/2 cup minced fresh sage leaves (1/2 ounce; 15g), or 1 tablespoon (15g) dried sage leaves", "1 large onion (10 ounces; 275g), finely chopped (about 1 1/2 cups)", "1 large leek (about 8 ounces; 225g), white part only, finely chopped (about 1 cup)", "4 large ribs celery (about 12 ounces; 340g), finely chopped (about 2 cups)", "2 cloves garlic, minced or grated on a Microplane", "1 quart <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">Hearty Vegetable Stock</a> (4 cups; 960ml) (see note)", "1/4 cup (57g) minced fresh parsley leaves, divided", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower-middle and upper-middle positions. Preheat oven to 275&deg;F (135&deg;C). Spread bread evenly over 2 rimmed baking sheets. Stagger trays on oven racks and bake until completely dried, about 50 minutes total, rotating trays and stirring bread cubes several times during baking. Remove from oven and allow to cool. Increase oven heat to 350&deg;F (177&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place half of mushrooms in the bowl of a food processor. Pulse until roughly chopped, about 8 short pulses. Transfer to a large bowl and repeat with remaining mushrooms. Place pecan halves in food processor (do not wipe out bowl) and process until roughly chopped, about 12 short pulses. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large Dutch oven or stockpot over medium-high heat until shimmering. Add chopped mushrooms and cook, stirring frequently, until all moisture has evaporated, about 8 minutes. Add half of sage and continue to cook, stirring, until mushrooms are well browned, about 5 minutes longer. Add onion, leek, celery, garlic, and remaining sage and cook, stirring frequently, until vegetables are softened, about 10 minutes. Add stock, half of parsley, and chopped pecans and bring to a boil. Add bread cubes and fold gently until evenly mixed. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mixture to a greased 9- by 13-inch rectangular baking dish (or 10- by 14-inch oval dish), cover tightly with aluminum foil, and bake until hot throughout, about 30 minutes. Remove foil and continue baking until golden brown and crisp on top, about 10 minutes longer. Remove from oven, let cool for 5 minutes, sprinkle with remaining parsley, and serve.</p>"}]}