{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141110-prune-hamburger-with-cheddar-on-english-muffin-eric-wolfinger.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["beef", "burger", "Cook the Book", "lamb", "prune"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Hamburger With Cheddar Cheese From 'Prune'", "link": "https://www.seriouseats.com/recipes/2014/11/grilled-hamburger-with-cheddar-cheese-on-toast-gabrielle-hamilton-prune.html", "description": "Gabrielle Hamilton's burger from her new cookbook, <em><a href=\"http://www.amazon.com/Prune-Gabrielle-Hamilton/dp/081299409/?tag=serieats-20\"><em>Prune,</em></a></em> is obscenely good and feels quite fancy, despite being so simple. The name really discloses the whole recipe: chubby beef and lamb patties are topped with white cheddar and sandwiched in a Thomas's English muffin, dressed only with the parsley-and-shallot compound butter. The cheese oozes down the sides of the salty, fatty burger, and the bright and potent butter, slathered on the top and bottom of the English muffin, seeps into every 'nook and cranny' of the burger and bun.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Burger", "Cook the Book", "Lamb"], "recipeIngredient": ["1 pound ground chuck", "1/2 pound ground lamb", "4 ounces (4 slices) sharp white cheddar, sliced (use #20 setting on meat slicer for solid 1/4-inch slices)", "2 teaspoons kosher salt", "2 teaspoons freshly ground black pepper", "4 Thomas’s original sandwich-size English muffins", "<a href=\"http://www.seriouseats.com/recipes/2014/11/parsley-shallot-butter-gabrielle-hamilton-prune.html\">Parsley-Shallot Butter</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run your hands under very cold water for a minute, then gently combine the two meats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put parchment or film on the electronic scale before weighing, please. Divide the meat into equal portions (6 ounces each) and then gently form portions into patties that are 1 1/4\" thick and 3\" in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season each burger all over&mdash;top, bottom, and the circumference&mdash;with 1/2 teaspoon salt and 1/2 teaspoon black pepper. Hold your hands high and “rain” the salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Touch the patties as tenderly and as little as possible. The more you manhandle and compact the meat, the tougher it becomes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On the medium-high heat section of the grill, place the burgers 2 inches apart from each other. Cook to accurate temperature. For medium rare, cook for 7 minutes on one side, flip, and cook for 5 more minutes. Do not turn, touch, press down on, or otherwise molest the burgers while they are cooking. Put burger on a sizzle plate, place cheese on top, and drop under the broiler until the cheese is just melted but not liquefied.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split the English muffins by deeply pricking them along the horizontal seam with the tines of a dinner fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast well and generously schmear both the tops and the bottoms with the room-temperature parsley-shallot butter, “wall to wall” as we always say at Prune, so that every bite will be seasoned and not just the center ones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast well and generously schmear both the tops and the bottoms with the room- temperature parsley-shallot butter, “wall to wall” as we always say at Prune, so that every bite will be seasoned and not just the center ones.</p>\n\n<p>* Monday and Friday lunch par is 30 burgers, so order meat accordingly on Sunday andThursday nights. 15 is safe par for midweek. *<br />\n</p>"}]}