{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140703-Grain-Salads-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Thai", "keywords": ["cashew", "fish sauce", "grill", "nut", "rice", "salad", "thai", "vegetable"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Grilled Vegetable and Jasmine Rice Salad With Herbs and Cashews", "link": "https://www.seriouseats.com/recipes/2014/07/grilled-vegetable-jasmine-rice-salad-recipe.html", "description": "Inspired by Thai grilled beef salad (<em>neua nam tok</em>), this salad replaces the meat with grilled vegetables and adds fragrant jasmine rice. It's loaded with fresh herbs and dressed with a bracing, fish sauce-spiked lime vinaigrette. Plus, because the vegetables are grilled, they give the salad a deeper, smoky flavor.", "totalTime": "30 minutes", "recipeYield": "Serves 8", "recipeCategory": ["Nuts", "Rice", "Salads", "Thai"], "recipeIngredient": ["<strong>For the Vinaigrette:</strong>", "1/2 cup fresh lime juice from about 8 to 10 limes", "1 1/2 tablespoons fish sauce", "1 1/2 tablespoons brown sugar", "2 medium cloves garlic, minced", "1 1/2 teaspoons Sriracha", "2 tablespoons vegetable oil", " ", "<strong>For the Salad:</strong>", "2 (3/4-inch-thick) slices from a large red onion", "3 large carrots, peeled and quartered lengthwise", "15 sugar-snap peas", "8 whole tri-color mini bell peppers or 1 large red or yellow bell pepper, quartered", "2 jalapeños", "2 tablespoons vegetable oil", "Kosher salt and freshly gound black pepper", "1/4 cup finely chopped cilantro leaves and tender stems", "1/4 cup finely chopped fresh mint", "1/4 cup finely chopped Thai basil or sweet basil", "2 cups cooked and cooled Jasmine rice (see note)", "1/2 cup lightly toasted cashews"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Vinaigrette:</strong> Whisk ingredients together in a small bowl. Reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salad:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal</a>. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss onion slices, carrots, snap peas, peppers, and jalapeños with oil in a large bowl. Season with salt and pepper. Thread snap peas on one skewer; thread mini bell peppers, if using, and jalapeños on second skewer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill vegetables directly over the flames, turning once, until browned on both sides, about 4 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When snap peas, peppers, and jalapeños are cool enough to handle, remove skewers. Stem and seed peppers and jalapeños, and discard stems and fibrous strings from snap peas. Chop vegetables coarsely, place in a large bowl and toss with 2 tablespoons of vinaigrette. Let stand for 5 minutes. Then, add cilantro, mint, basil, rice, and cashews and toss well. Dress with vinaigrette to taste and toss well again. Serve slightly warm of at room temperature, passing additional vinaigrette at the table.</p>"}]}