{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141023_misobutternoodles_yasminfahr3.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "Japanese", "keywords": ["butter", "chicken", "easy", "Japanese", "miso", "noodle", "one pot", "quick", "soba"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Shredded Chicken With Soba and Miso-Butter Sauce", "link": "https://www.seriouseats.com/recipes/2014/11/crispy-shredded-chicken-with-soba-and-miso-bu.html", "description": "I think there should be a t-shirt or sign that reads: Miso butter just makes it all better. Not soba noodles, shredded chicken, and crunchy vegetables come together in one pot. It take half an hour to make from start to finish, but it'll only take a fraction of that time to slurp it all up whether you use chopsticks or forks.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Japanese", "Noodles", "One-Pot Wonders", "Quick Dinners"], "recipeIngredient": ["1 pound bone-in, skin on chicken thighs (about 3 thighs)", "Kosher salt and freshly ground black pepper", "3 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 tablespoons extra-virgin olive oil", "1/2 stick (4 tablespoons) unsalted butter at room temperature", "1 tablespoon white miso paste", "3 bundles dried soba noodles (about 6 ounces)", "2 scallions, thinly sliced, white and light green parts", "1/2 cup picked cilantro leaves", "1 cup picked bean sprouts", "1 lemon, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken with salt and pepper. Heat the oil in a large pot over medium-high heat until shimmering. Cook the chicken, skin-side down, until crisp, about 7 minutes. Flip and cook until the second side has browned, about 4 minutes more. Add the broth, adjust the heat to maintain a simmer, cover, and cook until the chicken has cooked through, about 12 minutes more. Meanwhile, mix the butter and miso together in a small bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chicken to a plate and shred with a fork and knife. Discard skin and bones. Bring the broth to a hard boil over high heat. Add the noodles and cook according to the package instructions. Drain, reserving broth for another use if desired, and immediately toss in  a serving bowl with the miso-butter. Toss to coat, then add in the chicken. Top with scallions, cilantro and sprouts. Serve immediately with lemon wedges</p>"}]}