{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140925-ideas-in-food-Microwaved-Rocky-Road.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["cake", "chocolate", "dessert", "easy", "marshmallow", "microwave", "Rocky Road", "sponge cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Microwave Rocky Road Sponge Cakes", "link": "https://www.seriouseats.com/recipes/2014/10/microwave-rocky-road-sponge-cakes-recipe.html", "description": "We use the rapid cooking power of a the microwave to make lighter-than-air sponge cakes that pack in the flavor of rocky road ice cream with three forms of chocolate, marshmallows, and toasted walnuts. The best part? They bake in under a minute!", "totalTime": "35 minutes", "recipeYield": "20 small cakes", "recipeCategory": ["Cakes", "Chocolate", "Desserts"], "recipeIngredient": ["100 grams walnut halves", "150 grams 60% dark chocolate chips", "150 grams white chocolate chips", "50 grams dark brown sugar", "50 grams peanut oil or walnut oil", "50 grams all-purpose flour", "50 grams cocoa powder", "18 grams powdered egg whites", "3 grams salt", "3 large eggs, separated", "175 grams whole milk", "30 grams Knob Creek Bourbon, or your favorite", "100 grams powdered sugar", "100 grams miniature marshmallows"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the walnuts in an even layer on a microwave safe plate. Microwave the walnuts for 1 minute. Stir the walnuts on the plate and microwave for 1 minute longer. Stir the walnuts again and continue to microwave the walnuts in 1-minute intervals for a total of 5 minutes. Let the walnuts cool on the plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the dark chocolate, white chocolate, brown sugar, and peanut oil into a food processor. Process until the chocolate melts and the mixture is smooth, about 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour, cocoa powder, powdered egg whites, and salt into the food processor and pulse the mixture 10 times to blend the ingredients, about 12 seconds total. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the 3 egg yolks, milk, and bourbon to the food processor and process until it forms a smooth batter, about 1 minute. Stop and scrape down the sides once during this process. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the walnuts and miniature marshmallows into the food processor and pulse 10 times, about 12 seconds, until they are minced and mixed into the batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip the 3 large egg whites on medium in a stand mixer with the whisk for 2 minutes, until they begin to get frothy. Remove the bowl from the mixer and sift the powdered sugar over the egg whites. Return to the stand mixer and whip the mixture on medium speed until it forms stiff, glossy peaks, about 5 minutes. Remove the bowl from the mixer and knock any egg white that clings to the whisk back into the bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a rubber spatula to scrape the chocolate batter into the bowl of whipped egg whites and then fold them together to form a light, uniform batter. This takes about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a pairing knife to poke a hole in the bottom of each paper cup and 3 holes evenly around the circumference the cup. Reserve the cups. Don’t worry; the batter will not seep out through the holes. Put 2 ounces (4 tablespoons) of batter into each cup. We use an ice-cream scoop to do this. Microwave 1 cake at a time for 45 seconds on high power. Remove the cake from the microwave and immediately invert it onto a heatproof tray. Continue to microwave the remaining cakes until they are all cooked. The cakes can be eaten warm, room temperature, or refrigerated. We think they have the best flavor at room temperature. They will stay fresh for up to 3 days refrigerated inverted. </p>"}]}