{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140115-butternut-squash-lasagna-primary.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["bechamel", "butternut squash", "chard", "kale", "lasagna", "Meat Lite"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "5"}, "name": "Butternut Squash Lasagna With Bacon-Braised Greens and Béchamel", "link": "https://www.seriouseats.com/recipes/2014/01/butternut-squash-lasagna-bacon-braised-chard-kale-bechamel-sauce-recipe.html", "description": "This two-filling, bacon-y, béchamel-laced titan of a lasagna takes some time to prepare, but the result is well worth it.", "totalTime": "1 hour 40 minutes", "recipeYield": "Serves 8", "recipeCategory": ["Bacon", "Kale", "Lasagna", "Mains", "Meat Lite"], "recipeIngredient": ["<strong>For the Squash Filling</strong>:", "1 medium butternut squash, halved lengthwise, seeds removed", "Water", "1 pound ricotta cheese", "2 eggs, lightly beaten", "1 teaspoon finely chopped fresh thyme leaves", "Kosher salt and freshly ground black pepper", " ", "<strong>For the Greens</strong>:", "2 large bunches hearty dark greens such as chard and kale, well rinsed and sliced into wide ribbons", "1 tablespoon olive oil", "3 slices (about 4 ounces) thick-cut bacon, finely chopped", "3 cloves garlic, minced (about 3 teaspoons)", "1/2 teaspoon red pepper flakes", "Kosher salt", " ", "<strong>For the Béchamel Sauce</strong>:", "4 tablespoons unsalted butter", "4 tablespoons flour", "4 cups whole milk", "1/2 cup plus 1/4 cup grated Parmesan cheese, divided", "Kosher salt and freshly ground black pepper", "1/4 teaspoon freshly grated nutmeg", " ", "<strong>Remaining Ingredients</strong>:", "2 (1-pound) boxes oven-ready lasagna noodles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Squash Filling</strong>: Adjust oven rack to middle position and preheat oven to 375°F. Place squash cut-side down on a rimmed baking sheet and add water until water level rises 1/4\" inch up the pan. Bake squash until fork-tender and peeling away from the skin, about 35 minutes. Remove squash from oven, let cool slightly, then use a spoon to peel squash away from skin. Transfer squash to the bowl of a food processor and pulse until smooth. In a mixing bowl, combine 2 cups squash pur&eacute;e, ricotta, eggs and thyme and stir until smooth. Season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Greens</strong>: While squash is baking, prepare the greens. Heat oil in a Dutch oven over medium heat, then add bacon, garlic and red pepper flakes. Cook, stirring, until bacon has rendered some fat, about 5 minutes. Add greens and cover pot for 5 minutes. Remove lid, stir, and cook until most liquid has evaporated, about 10 minutes. Season to taste with salt.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the B&eacute;chamel Sauce</strong>: Heat milk in a saucepan set over medium-low heat. Wipe out Dutch oven and return to medium heat. Add butter; when it melts, add flour and cook, stirring with a wooden spoon, until mixture thickens and smells nutty, about 5 minutes. Add hot milk one cupful at a time, whisking constantly, until no lumps remain. Simmer mixture until smooth and thick, about 7 minutes, then remove from heat and add Parmesan cheese; season to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the Lasagna</strong>: Add 1/4 of the b&eacute;chamel sauce to the bottom of a deep lasagna pan. Add one layer of noodles, breaking into pieces and overlapping as needed to create a uniform layer. Add 1/2 the greens, spreading evenly over noodles, then spoon over another 1/4 of the b&eacute;chamel. Add another layer of noodles. Spoon 1/2 the squash filling on, and smooth with the back of a spoon. Add another layer of noodles. Add the remaining greens and cover them with another 1/4 of the b&eacute;chamel. Add another layer of noodles, and top them with remaining squash filling. Add final layer of noodles, and top with final 1/4 of b&eacute;chamel. Sprinkle remaining 1/4 cup of cheese over the top of the lasagna and cover tightly with aluminum foil. Bake in the 375°F oven for 45 minutes, removing foil after 25 minutes. Remove lasagna from oven, let set for 15 minutes, then cut into pieces and serve immediately. </p>"}]}