{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/2014609-smokedice-cocktail.jpg", "author": {"@type": "Person", "name": "Elana Lepkowski"}, "recipeCuisine": "", "keywords": ["cocktail", "drink", "pineapple", "rum", "smoke"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hazy Sunset (Pineapple-Rum Cocktail With Smoked Ice)", "link": "https://www.seriouseats.com/recipes/2014/06/smoked-ice-rum-cocktail-recipe.html", "description": "Made with smoked iced, this fun tiki-inspired cocktail changes flavor over time.", "totalTime": "40 minutes, plus freezing time", "recipeYield": "1 cocktail plus 1 tray smoked ice cubes (enough for at least 4 cocktails)", "recipeCategory": ["Pineapple", "Rum"], "recipeIngredient": ["<strong>For Smoked Ice:</strong>", "1 tray ice cubes", "Wood chips for smoking", " ", "<strong>For the Cocktail:</strong>", "1 1/2 ounces light rum, such as 10 Cane", "1/2 ounce overproof rum, such as Lemon Hart Demerara", "2 ounces pineapple juice", "1/2 ounce freshly squeezed lime juice from 1 lime", "1/4 ounce simple syrup (see note)", "2 dashes Angostura bitters", "Ice", "Smoked ice cubes", "Fresh cherry, pineapple chunk, and mint sprig, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Smoked Ice:</strong> Place ice cubes in baking dish or pie plate. Following instructions of your smoker, heat wood chips until smoking. Set dish of ice in smoker, cover, and smoke until ice has melted, 10 to 20 minutes. Alternatively, line bottom of roasting pan with aluminum foil and arrange 1/2 cup wood chips on one side of pan. Using a butane torch or long-reach lighter, carefully burn wood chips until smoking but not in flames. Carefully set rack in roasting pan, set dish of ice on rack opposite the wood chips, cover, and smoke until ice has melted, 10 to 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour smoked water into ice-cube tray and freeze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cocktail:</strong> Add both rums, pineapple juice, lime juice, simple syrup, and bitters to a cocktail shaker and fill 2/3 full with non-smoked ice. Shake until well chilled, about 20 seconds. Add smoked ice cubes to a double rocks glass, and strain cocktail into glass. Garnish with a cherry, pineapple chunk, and mint sprig. Serve immediately.</p>"}]}