{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141003-plenty-more-zucchini-baba-ganoush-jonathan-lovekin.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["Cook the Book", "dip", "plenty more", "spread", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Zucchini \"Baba Ghanoush\" From 'Plenty More'", "link": "https://www.seriouseats.com/recipes/2014/10/zucchini-baba-ghanoush-from-plenty-more.html", "description": "As Yotam Ottolenghi says in the introduction to this recipe from his new cookbook,<a href=\"http://www.amazon.com/Plenty-More-Vibrant-Vegetable-Ottolenghi/dp/1607746212/?tag=serieats-20\"><em> Plenty More,</em></a> this is only vaguely reminiscent of baba ghanoush. Garlicky broiled zucchini is topped with a funky and captivating custard sauce made with goat's milk yogurt and Roquefort cheese. Finally, toasted pine nuts and a sprinkle of za'ata finishes off this \"volcanic eruption\" (his words) of a spread.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4 as a starter or as part of a mezze selection", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Sides", "Vegetarian", "Zucchini"], "recipeIngredient": ["5 large zucchini (about 2 3/4 lb/ 1.2 kg)", "1/3 cup/ 80g goat’s milk yogurt", "2 tbsp/ 15g Roquefort, coarsely grated", "1 egg, lightly beaten", "1 tbsp/ 15 g unsalted butter", "2 1/2 tbsp/ 20 g pine nuts", "1/2 tsp Urfa chile flakes, or a pinch of regular chile flakes", "1 tsp lemon juice", "1 clove garlic,  crushed", "1/2 tsp za’atar, to finish ", "salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler. Place the zucchini on a baking sheet lined with parchment paper and broil for about 45 minutes, turning once or twice during the cooking, until the skin crisps and browns nicely. Remove from the oven and, once cool enough to handle, peel off the zucchini skin, discard it, and set the flesh  aside in a colander to drain; you can also scoop out the flesh with a spoon. The zucchini can be served warm or at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the yogurt in a small saucepan with the Roquefort and egg. Heat very gently for about 3 minutes, stirring often. You want the yogurt to heat through but not quite reach the simmering  point. Set aside and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a small sauté pan with the pine nuts over low heat and cook, stirring often, for 3 to 4 minutes, until the nuts turn golden brown. Stir in the chile flakes and lemon juice and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, put the zucchini in a bowl and add the garlic, a scant 1/2 teaspoon salt, and a good grind of black pepper. Gently mash everything together with a fork and then spread the mixture out on a large serving  platter. Spoon the warm yogurt sauce on top, followed by a drizzle of the warm chile butter and the pine nuts. Finish with a sprinkle of za’atar and serve at once.</p>"}]}