{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2013/12/20131203Duck-Burger-01.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "French", "keywords": ["duck", "French in a Flash", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Duck Burgers With Pickled Fennel and Prune Mayonnaise", "link": "https://www.seriouseats.com/recipes/2014/02/duck-burgers-prune-mayonnaise-pickled-fennel.html", "description": "A mustardy burger made with duck breast and topped with lettuce, fresh pickled fennel, and prune mayonnaise.", "totalTime": "30 minutes", "recipeYield": "serves 2", "recipeCategory": ["Duck", "French", "Mains", "Other Meats", "Sandwiches"], "recipeIngredient": ["2 1/2-pound duck breasts", "2 teaspoons whole grain mustard", "1 tablespoon sliced chives, plus extra for stacking on the burger", "Kosher salt and freshly ground black pepper", "3 soft pitted prunes, plus a few extra for garnish", "1/4 cup mayonnaise", "2 brioche or other buns, halved horizontally and lightly toasted", "4 leaves gem or green leaf lettuce", "1 recipes <a href=\"http://www.seriouseats.com/2012/02/in-a-pickle-quick-pickled-fennel-with-orange.html\">Quick Pickled Fennel</a>, or other pickles as desired", "Cornichons, to serve alongside"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the skin from the duck breasts, and roughly chop the duck breast meat, leaving the skins to the side. Add the duck breast meat, mustard, and chives to the work bowl of a food processor. Season with salt and pepper. Pulse until the meat is very roughly ground, 15 to 20 short pulses. Form into two patties about 4-inches wide with a slight dimple in the center of each one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one of the duck skins in a medium nonstick skillet over medium heat (set aside second duck skin for another use or discard). Allow the duck fat to render into the skillet, stirring and flipping occasionally. When you have a nice layer of fat, discard or eat the remaining duck skin. Heat duck fat until shimmering, then add burger patties and cook, flipping occasionally, until desired level of doneness is achieved (about 130°F for medium rare or 140°F for medium.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the duck burgers are cooking, make the prune mayo. Clean out food processor and add prunes and mayonnaise. Blend until smooth, adding 1 to 2 tablespoons of water as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread prune mayo on bottom half of burger buns. Top with lettuce, the cooked burgers, pickled fennel, snipped chives, more mayo, chopped prunes, and the top bun. Serve with cornichons on the side.</p>"}]}