{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140505-291795-cook-the-book-carrots-roasted-in-coffee-beans.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["carrot", "coffee", "coi", "Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Carrots Roasted in Coffee Beans From 'Coi'", "link": "https://www.seriouseats.com/recipes/2014/05/carrots-roasted-in-coffee-beans-from-coi.html", "description": "I once went to a party featuring small bites from <a href=\"http://www.starchefs.com/cook/chefs/bio/Daniel-Patterson/coi\">Daniel Patterson</a>'s <a href=\"http://coirestaurant.com/\" target=\"_blank\">Coi</a> kitchen. (It was quite a party.) One was a version of this dish&mdash;carrots fragrant with coffee, served in a flavorful broth with minuscule herbs scattered on top.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Carrot", "Cook the Book", "Gluten-Free", "Sides", "Vegetarian"], "recipeIngredient": ["<strong>Carrots</strong>", "4–12 carrots, depending on size", "15 g pure olive oil", "250 g whole coffee beans (we use Blue Bottle decaf.)", "Salt", "&nbsp", "<strong>To serve</strong>", "Young carrots", "Rice wine vinegar", "80 g of carrot juice", "80 g of mandarin juice", "2 tablespoons fruity olive oil", "20 roman mint leaves", "12 roman mint flowers", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean the carrots well, but leave the skin on. Use big or small carrots, of any color, just use ones that are sweet. Toss them with a little pure olive oil and salt, and place them on a bed of dark roasted coffee beans in a covered container. Cook in a 350°F (180°C) oven, shaking the pan occasionally, until the carrots are very tender. Don’t undercook the carrots, as their sweetness will not be fully revealed. Remove to a plate or baking sheet and let cool. Cut, as you like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, slice small rounds of young carrots, or the tips of a larger one not-too finely or you will lose the texture-and season with rice wine vinegar and salt, kind of a quick pickle. You will need three slices per dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the cooked carrots in a low oven, covered, until just warm. Combine the carrot juice and mandarin juice. Season with rice wine vinegar and salt until the juice is on the sweeter side, with gentle yet persistent acidity. You might need to add more carrot or more mandarin juice, depending on the taste. Heat until just warm, check seasoning again and spoon some broth in a bowl. Drizzle in half a spoonful of fruity olive oil, and arrange the carrots in the bowl. Top with slices of the pickled carrot, and leaves and flowers of roman mint.</p>"}]}