{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140228-spicy-stir-fried-beef-with-leeks-and-onion-09.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "beef", "Chinese", "easy", "quick", "stir fry", "wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Spicy Stir-Fried Beef With Leeks and Onions", "link": "https://www.seriouseats.com/recipes/2014/03/easy-stir-fried-beef-leeks-onions-recipe.html", "description": "This quick stir-fry combines tender marinated flank steak with onions and leek greens, flavored with a simple but balanced sauce made with soy sauce, fish sauce, and sesame oil.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Chinese", "Mains", "Stir Frying"], "recipeIngredient": ["1/2 pound flank steak, sliced into 1/8th inch slices across the grain", "1/2 teaspoon cornstarch", "1/4 teaspoon ground black pepper", "3/4 teaspoon sugar, divided", "2 teaspoons soy sauce, divided", "2 teaspoons fish sauce, divided", "2 teaspoon Shaoxing wine (or dry sherry, if unavailable), divided", "1 1/2 teaspoons sesame oil, divided", "3 tablespoons peanut or vegetable oil", "10 medium cloves garlic, sliced into 1/8th inch pieces", "12 hot Chinese dry chili peppers, stem removed and each cut into 3 to 4 pieces ", "1 medium onion, cut into 1/2-inch dice (about 1 cup)", "2 young leeks, greens only, split lengthwise and cut into 1/2-inch lengths (about 2 cups)", "Kosher salt", "White rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine beef, cornstarch, black pepper, 1/4 teaspoon sugar, 1 teaspoon Shaoxing wine, 1 teaspoon fish sauce, 1 teaspoon soy sauce, and 1 teaspoon sesame oil in a bowl and toss to combine. cover and refrigerate at least 30 minutes and up to overnight. Combine remaining sugar, soy sauce, fish sauce, Shaoxing wine, and sesame oil, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons oil in a wok over high heat until smoking. Add half of the garlic, half of the hot peppers, and a pinch of salt. Cook, stirring, for 30 seconds, then remove the garlic and chilies to a medium bowl. Reheat the wok until smoking, then add the beef. Cook without moving until browned on first side, about 1 minute. Continue to cook, stirring regularly, until just cooked through to medium-rare, about 1 minute longer. Add to bowl with garlic and chilies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the wok with a paper towel, add remaining tablespoon of oil, and heat until smoking. Add remaining garlic and chilies and season with a pinch of salt. Cook, stirring, until fragrant, about 30 seconds. Add leeks and onions, season with salt, and cook, stirring and tossing constantly until vegetables are tender-crisp, about 2 minutes. Return beef to wok and stir to combine. Add reserved sauce and continue cooking, stirring and tossing constantly, until sauce coats beef and vegetables. Transfer to a serving platter immediately and serve with white rice.</p>"}]}