{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141125-bar-tartine-smoked-potatoes-chad-robertson.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["bar tartine", "Cook the Book", "mayonnaise", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Smoked Potatoes With Ramp Mayonnaise From 'Bar Tartine'", "link": "https://www.seriouseats.com/recipes/2014/12/smoked-potatoes-with-ramp-mayonnaise-from-bar.html", "description": "In Cortney Burns and Nicholaus Balla's new cookbook, <em>Bar Tartine: Techniques and Recipes,</em> they share the recipe for their Smoked Potatoes with Ramp Mayonnaise. This dish has been obsessed over and blogged about, and has a permanent place on their ever-changing menu. There's a lot going on with these spuds: The potatoes themselves are roasted and smoked, then smashed and deep-fried. They're tossed with herbs and a mushroom-infused black garlic vinaigrette&mdash;earthy, sweet, and tangy. The crowning glory is the bright and rich mayonnaise. Individually, each component is brilliant; together, they make you think you've died and gone to umami heaven.", "totalTime": "4 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cook the Book", "Potato", "Sides"], "recipeIngredient": ["<strong>SMOKED POTATOES</strong>", "2 lb/910 g small Yukon gold potatoes (smaller than 1 1/2 in/4 cm in diameter)", "1 tbsp filtered grapeseed oil", "1 tsp kosher salt", "<strong>BLACK GARLIC VINAIGRETTE</strong>", "6 dried mushrooms, such as shiitake or porcini", "1 cup/240 ml <a href=\"http://www.seriouseats.com/recipes/2014/12/rice-vinegar-from-bar-tartine.html\">rice vinegar</a>", "12 <a href=\"http://www.seriouseats.com/recipes/2014/12/black-garlic-from-bar-tartine.html\">black garlic cloves</a>", "3 garlic cloves", "2 tsp light brown sugar", "1 tbsp kosher salt", "2 tbsp unfiltered grapeseed oil", "<strong>RAMP MAYONNAISE</strong>", "2 egg yolks", "1 tsp kosher salt", "1 tbsp fresh lemon juice", "1/2 cup/115 g <a href=\"http://www.seriouseats.com/recipes/2014/12/brined-ramps-from-bar-tartine.html\">brined ramps</a>, brined garlic chives, or capers, drained and chopped", "Freshly ground black pepper", "1 cup/240 ml unfiltered grapeseed oil or other light vegetable oil", "Rice bran oil for deep-frying", "1/2 bunch fresh dill, leaves picked, half chopped and half intact", "1/2 bunch fresh flat-leaf parsley, leaves picked, half chopped and half intact", "1/2 bunch green onions, white and tender green parts, thinly sliced", "6 ramps, thinly sliced", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>TO MAKE THE SMOKED POTATOES:</strong> Soak three generous handfuls of alder or fruitwood chips in water to cover for at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F/180°C. In a large bowl, toss the potatoes with the grapeseed oil and salt.<br />\nTransfer the potatoes to a sheet pan and roast until barely tender, 30 to 40 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using a smoker:</strong> Following the manufacturer’s instructions, set up and smoke the potatoes at 180ºF/80ºC for 2 hours, using two rounds of chips.</p>\n\n<p><strong>If using a gas grill:</strong> Light one burner to medium. Put a smoker box over the lit burner, add some of the soaked wood chips to the box, and close the grill. Adjust the heat as needed to keep the temperature at about 180°F/80°C. The wood chips should begin to smolder and release a steady stream of smoke. Put the potatoes on the grate opposite the lit burner. Cover the grill and smoke the potatoes, adjusting the heat as needed to maintain the temperature, until browned from the smoke and tender to the touch, about 2 hours. Let cool to room temperature.</p>\n\n<p><strong>If using a charcoal grill:</strong> Fill a chimney starter with charcoal. Light it and let burn until the coals are covered with a thin layer of ash. Pour the hot coals on one side of the grill. Put some of the soaked wood chips on the hot coals and put the grate on the grill. Put the potatoes on the grate opposite the fire. Cover the grill, positioning the vent on the lid on the side opposite the fire. Stick a thermometer through the vent and heat the grill to about 180°F/80°C. Smoke the potatoes, adjusting the vents as needed to maintain the temperature, until browned from the smoke and tender to the touch, about 1 hour. Let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>TO MAKE THE BLACK GARLIC VINAIGRETTE:</strong> In a small saucepan over high heat, combine the mushrooms and vinegar. Bring to a boil, cover, remove from the heat, and let steep for 30 minutes. Using a slotted spoon, remove the mushrooms from the vinegar. With your hands, squeeze the vinegar from the mushrooms back into the pan. Reserve the mushrooms for another use. (Slice them into a soup or salad.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a blender, combine the steeped vinegar, black garlic, garlic, brown sugar, salt, and grapeseed oil and purée until smooth. If not using immediately, transfer to an airtight container and refrigerate for up to 1 month. Bring to room temperature before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>TO MAKE THE RAMP MAYONNAISE:</strong> Chill a food processor bowl and blade in the freezer for at least 15 minutes. In the chilled bowl, combine the egg yolks, salt, lemon juice, ramp greens, and plenty of pepper and process until all of the ingredients are fully incorporated, about 1 minute. With the food processor running, slowly pour in the grapeseed oil. The mixture should be quite thick. If not using immediately, transfer to an airtight container and refrigerate for up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fry the potatoes, pour the rice bran oil to a depth of 6 in/15 cm in a cast-iron or other heavy-bottomed saucepan and heat to 350°F/ 180°C. Line a sheet pan with paper towels and set a wire rack on the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently press each potato between your palms to smash it slightly without breaking it up. This helps to ensure crisp edges and allows the vinaigrette to soak into the potatoes. A few at a time, add the potatoes to the hot oil and fry until crisp, about 4 minutes. Transfer the fried potatoes to the wire rack and let drain for about 1 minute. Repeat until all of the potatoes are fried.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the hot potatoes into a large bowl, add the vinaigrette, the chopped dill and parsley, and half of the green onions and toss to combine. Transfer to a serving platter and tear the leaves of dill and parsley over the top. Add the ramps and the remaining green onions. Serve with the ramp mayonnaise and top with pepper.</p>"}]}