{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140926-Braised-Country-Style-Pork-Ribs-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["apple", "braise", "cider", "country style rib", "easy", "fall", "pork", "potato", "stew", "Sunday"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1428571428571", "ratingCount": "7"}, "name": "Cider-Braised Country-Style Pork Ribs With Creamy Mashed Potatoes", "link": "https://www.seriouseats.com/recipes/2014/09/cider-braised-country-style-ribs-recipe.html", "description": "Containing a mix of light and dark meat, country-style pork ribs braise well, yielding tender meat that both flavors and absorbs the liquid they cook in. With that in mind, I built mine from rustically cut nubs of carrot, celery, onion and garlic, plus burnished tomato paste -- prepped in the same Dutch oven that's used to brown the pork. Then, the pan is deglazed with white wine, cider vinegar, chicken stock and apple cider and spiked with Dijon mustard and aromatics. After a time spent in a low oven, the whole shebang is served atop creamy mashed potatoes.", "totalTime": "2 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Apple", "Braising and Stewing", "Mains", "Mashed Potatoes", "Pork", "Sunday Supper"], "recipeIngredient": ["3 tablespoons extra-virgin olive oil, divided", "2 1/2 pounds bone-in, country-style pork ribs", "Kosher salt and freshly ground back pepper", "1 large carrot, peeled and roughly diced (about 1 cup)", "1 stalk celery, roughly diced (about 3/4 cup)", "1 large onion, chopped (about 1 1/2 cups)", "3 cloves garlic, minced (about 1 tablespoon)", "2 tablespoons tomato paste", "1/2 cup dry white wine", "1/4 cup apple cider vinegar", "2 1/2 cups homemade or store-bought low-sodium chicken stock", "1/2 cup apple cider", "1 tablespoon grainy Dijon mustard", "1 teaspoon onion powder", "2 bay leaves", "3 sprigs fresh thyme", "1/2 teaspoon crushed red pepper flakes", "<strong>For the Potatoes:</strong>", "2 pounds Yukon Gold potatoes, peeled and chopped", "1 stick unsalted butter, melted", "3/4 cup heavy cream", "1/2 cup milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 325&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of oil in a large Dutch oven over medium-high heat. Pat ribs dry using paper towels and season with salt and pepper. When oil is shimmering, add as many ribs as fit in one layer. Cook, turning occasionally, until brown all over, about 10 minutes total. Transfer to a large plate and repeat with remaining ribs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 1 tablespoon of oil to the Dutch oven and reduce heat to medium. Add carrot, celery, and onion and cook, stirring often, until softened, about 7 minutes. Add the garlic and continue cooking until fragrant, about 1 minute longer. Add tomato paste and cook, stirring, until it turns a burnished hue, about 2 minutes. Add wine, raise heat to medium-high and scrape up browned bits from the bottom of the pan using a spoon. Add vinegar, chicken stock, cider, Dijon, onion powder, bay leaves, thyme, and crushed red pepper. Season lightly with salt and pepper and stir to combine. Return pork ribs to the pot and bring to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and transfer to the oven to cook until fork-tender, removing lid during the last half-hour of cooking, about 1 hour and 45 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, For the Potatoes:</strong> Place potatoes in a medium stockpot. Cover with cold salted water. Bring to a boil over high heat and reduce to a simmer. Cook until tender when pierced with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain and pass potatoes through ricer or food mill over a large bowl. Add melted butter and half of cream and milk to potatoes. Season with salt and pepper. Whip on low speed using a hand-held mixer until butter, cream and milk are incorporated, about 30 seconds. Increase speed to high and whip until smooth and creamy, about 1 minute. Adjust to desired consistency with more cream and/or milk. Season to taste with salt and pepper. Keep warm until serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When meat is done, remove from oven, discard bay leaves and thyme sprigs and skim fat from the top of sauce. Adjust seasoning, if needed. Serve with mashed potatoes, spooning the sauce on top.</p>"}]}