{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140128-hot-dogs-4505-meats-ryan-farr-63.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["charcuterie", "hot dog"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ryan Farr's New York-Style Hot Dogs", "link": "https://www.seriouseats.com/recipes/2014/03/ryann-farr-new-york-style-hot-dog-recipe.html", "description": "Ryan Farr is the chef and owner of 4505 Meats in San Francisco. These snappy, all-beef, New York-style dogs appear in his book <em>Sausage Making</em>.", "totalTime": "24 hours", "recipeYield": "Makes about 24 hot dogs", "recipeCategory": ["Beef"], "recipeIngredient": ["949 grams boneless lean beef such as neck, plate, or shank, cut into 1-inch cubes", "137 grams beef fat, cut into 1-inch cubes", "23 grams fine sea salt", "10 grams paprika", "5 grams granulated garlic", "4 grams coarsely ground black pepper", "3 grams onion powder", "1 gram <a href=\"http://www.amazon.com/Insta-Cure-No-Prague-Powder/dp/B002L82B2O/?tag=serieats-20\">Cure #1</a>", "230 grams crushed ice", "20 feet of rinsed sheep casings"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the meat and fat on a rimmed baking sheet, transfer to the freezer, and chill until crunchy on the exterior but not frozen solid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, add the salt, paprika, granulated garlic, black pepper, onion powder, and Cure No. 1 and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nest a large mixing bowl in a bowl filled with ice. Grind the meat and fat through the small die of the grinder into the bowl set in ice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the spice mixture to the meat and stir with your hands until well incorporated; the mixture will look homogenous and will begin sticking to the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the meat to the bowl of a food processor, add half the crushed ice and process until all of the ice has dissolved, 1 to<br />\n2 minutes. Add the remaining crushed ice and continue process- ing until the mixture is completely smooth, 4 to 5 minutes more. Note: The temperature of your meat during this mixing step is critically important. Its temperature should never rise about 40°F/4°C; work efficiently during this step of the process.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon 2 tbsp of the meat mixture into a nonstick frying pan and spread into a thin patty. Cook the test patty over low heat until cooked through but not browned. Taste the sausage for seasoning and adjust as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press a sheet of parchment paper or plastic wrap directly on the surface of the meat to prevent oxidation, then cover the bowl tightly with plastic wrap and refrigerate overnight. Alternatively, you can vacuum-seal the farce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stuff the sausage into the sheep casings and twist into links.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smoke the links (see page 43) at 170°F/77°C, until the internal temperature of the sausage reaches 145°F/63°C, 45 to 60 minutes. Remove the sausages from the smoker, let cool slightly, then transfer to the refrigerator and let stand, uncovered, overnight. The hot dogs are then fully cooked, and can be finished on a grill or steamed.</p>"}]}