{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141107-roasted-pepper-cornbread-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["bread", "cast iron", "corn", "cornbread", "pepper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Pepper Cornbread", "link": "https://www.seriouseats.com/recipes/2014/11/roasted-pepper-cornbread-recipe.html", "description": "This Southwestern-style recipe calls for roasted poblano and red bell peppers, corn, and a little cayenne, for a sweet and fruity bread with a slight touch of heat.", "totalTime": "50 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Corn", "Cornbread", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["1 large red bell pepper", "1 large poblano pepper", "1 cup yellow cornmeal", "1 cup all purpose flour", "1/2 cup white sugar", "2 teaspoons baking powder", "1 teaspoon Kosher salt", "1/2 teaspoon baking soda", "1/4 teaspoon cayenne pepper", "3/4 cup sour cream", "1/2 cup buttermilk", "2 large eggs", "3 tablespoons melted butter, cooled slightly, plus 1 additional tablespoon for pan", "2 tablespoons canola oil", "1 cup frozen corn kernels, thawed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a 10-inch cast iron skillet on middle rack in oven and preheat to 425&deg;F. Roast red bell pepper and poblano over an open flame on a gas stove or grill until skins are completely charred. Place in a bowl, cover with plastic wrap, and let sit until cooled, 5 to 10 minutes. Peel off charred skins; remove stems and seeds. Finely copy flesh of peppers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together cornmeal, flour, sugar, baking powder, salt, baking soda, and cayenne pepper. In a separate medium bowl, whisk together sour cream, buttermilk, eggs, 3 tablespoons melted butter, and canola oil. Pour wet ingredients into bowl with dry ingredients and whisk until completely combined. Stir in chopped peppers and corn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using pot holders, carefully remove hot pan from oven. Place 1 tablespoon butter in skillet and swirl to completely melt and coat inside of pan. Pour in cornbread batter and place in oven. Bake until skewer inserted into middle of cornbread comes out clean, about 20 minutes. Let bread cool in pan for 5 minutes, then carefully turn out to wire rack and let cool an additional 10 minutes. Serve immediately. Reheat any leftover cornbread before serving again.\f</p>"}]}