{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140306-285743-dinner-tonight-orecchiette-broccoli-rabe-sausage-pesto.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["easy", "orecchiette", "pasta", "pesto", "quick", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Orecchiette With Broccoli Rabe, Spicy Italian Sausage, and Pesto", "link": "https://www.seriouseats.com/recipes/2014/03/orecchiette-broccoli-rabe-italian-sausage-pesto-recipe-pasta.html", "description": "After years of drinking Negronis, I've grown to love the sensation of bitter broccoli rabe, just so long as it's balanced by something else. In this dish, the foil comes from both spicy sausage and some fresh pesto.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dinner Tonight", "Mains", "Pasta", "Pesto", "Pork"], "recipeIngredient": ["<strong>For the Pesto</strong>:", "2 cups packed fresh basil leaves", "1/4 cup pine nuts", "3 medium garlic cloves, roughly chopped (about 1 tablespoon)", "1/3 cup finely grated fresh Parmesan cheese, plus more for serving", "1/3 cup extra-virgin olive oil", "Kosher salt and freshly ground black pepper", " ", "<strong>For the Pasta</strong>:", "1 pound orecchiette", "1 pound fresh hot Italian sausage (remove casings if necessary) ", "2 tablespoons extra-virgin olive oil", "2 garlic cloves, crushed", "2 pounds broccoli rabe, tough ends trimmed, leaves and stem chopped into 2-inch pieces ", "1 cup homemade or store-bought low-sodium chicken stock", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pesto</strong>: Pulse basil and pine nuts in a food processor until finely chopped, about five 1-second pulses. Scrape down the sides, add garlic, and pulse again until chopped. With the motor running, slowly pour in the olive oil through the top, stopping to scrape down sides as necessary. Transfer to a small bowl. Stir in Parmesan, and season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the pasta</strong>: Bring a large pot of salted water to a boil over high heat. Cook orecchiette according to directions on the packaging. Reserve 1/4 cup of pasta water and drain pasta in a colander. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat olive oil in a large skillet over medium heat. Add sausage and cook, breaking up the meat with a wooden spoon, until browned, 3 to 4 minutes. Stir in garlic, and cook until fragrant, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of the broccoli rabe and stir until leaves wilt, making room from the other half. Once all the broccoli rabe has been added, cover skillet and cook over medium-low heat until stems are bright green, stirring occasionally, 3 to 5 minutes. Season with a pinch of salt. Pour chicken stock into skillet and bring to a boil over medium-high heat. Cook uncovered until liquid reduces to a sauce and broccoli rabe stems are tender, 2 to 4 minutes.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cooked orecchiette and butter to skillet and cook over medium-high heat until the pasta is completely coated in the sauce. If it looks too dry, and some of the pasta water. Season to taste with salt if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve orecchiette with a generous spoonful of the pesto and a sprinkling of grated Parmesan. </p>"}]}