{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140320-286695-cook-the-book-president-obama-chicken-stew.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "my irish table", "poultry", "soup", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "President Obama Stew (Chicken Casserole) From 'My Irish Table'", "link": "https://www.seriouseats.com/recipes/2014/03/president-obama-stew-chicken-casserole-from-my-irish-table.html", "description": "As the story goes, <strong><a href=\"http://www.restauranteve.com/index.cfm/restaurant/an-irish-souls-culinary-passion/\" target=\"_blank\">Cathal Armstrong</a></strong> was cooking a variation of his mother's chicken casserole at home on his day off from working at his flagship <a href=\"http://www.restauranteve.com/index.cfm/home/\" target=\"_blank\">Restaurant Eve</a> when he got a phone call: President Obama was on his way to dine at Armstrong's restaurant. Since that night, he has renamed this simple chicken and vegetable stew \"President Obama Stew.\"", "totalTime": "1 1/2 to 2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Chicken", "Cook the Book", "Mains", "Soups and Stews"], "recipeIngredient": ["1 (3 1/2-pound) chicken", "Kosher salt and freshly ground black pepper", "2 tablespoons canola oil", "1 large yellow onion, very coarsely chopped", "6 carrots, peeled and cut crosswise into 1/2-inch coins", "6 celery stalks, halved lengthwise and cut into 1-inch dice", "20 cloves garlic, crushed and coarsely chopped", "1 (28-ounce) can whole plum tomatoes (preferably San Marzano), coarsely chopped, and their juices", "3 tablespoons all-purpose flour", "3 large fresh bay leaves", "1 serrano chile, coarsely chopped, with seeds", "4 cups chicken stock", "2 tablespoons chopped fresh thyme leaves", "1 tablespoon chopped fresh rosemary leaves", "Leaves from 1 large bunch fresh basil (1 cup loosely packed), coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cut up the chicken:</strong> Cut the chicken into 14 pieces, making 6 breast pieces, 2 drumsticks, 2 thighs, and 4 wing joints. Season them well with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Brown the chicken:</strong> In a large slope-sided sauté pan over high heat, heat the canola oil until it shimmers. Arrange all of the chicken evenly in the pan skin-side down and cook for 5 minutes, until golden brown. The pieces should release easily from the bottom of the pan; if they don’t, let them brown longer until they do. Transfer the pieces to a flameproof casserole, arranging them skin-side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Sweat the vegetables:</strong> Add the onion, carrots, and celery to the sauté pan, stirring to combine them. Sweat the vegetables for 4 to 5 minutes, until they are translucent but still a bit firm. As they cook and water releases from them, use a flat-edged wooden spatula to deglaze the pan by scraping up the brown bits from the bottom. Stir in the garlic and then the tomatoes and flour and cook for 2 minutes. Add the bay leaves, serrano chile, chicken stock, thyme, and rosemary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook the stew:</strong> Transfer the vegetable mixture to the casserole. Bring to a boil, then decrease the heat to low, cover the pot, and let it simmer slowly for 45 to 60 minutes, until the chicken and vegetables are very tender. Remove the stew from the heat. Taste the sauce and season with salt and pepper if you like. Stir in the basil leaves at the last<br />\r\nsecond before serving. The stew can be made a day before and gently<br />\r\nreheated on the stove or in a 300°F oven for 30 to 40 minutes.</p>"}]}