{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140701-vibrant-food-fritters-kimberly-hasselbrink.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["avocado", "Cook the Book", "corn", "fritter", "vegetarian", "vibrant flavor"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sweet Corn and Squash Fritters With Avocado Crema From 'Vibrant Food'", "link": "https://www.seriouseats.com/recipes/2014/07/sweet-corn-and-squash-fritters-from-vibrant-flavor-kimberly-hasselbrink.html", "description": "It's my opinion that fresh, sweet corn should be incorporated into pretty much every meal in the summertime. So as soon as I saw these bodaciously corn-y fritters in Kimberly Hasselbrink's new cookbook, <em><a href=\"http://www.amazon.com/Vibrant-Food-Celebrating-Ingredients-Recipes/dp/1607745410/?tag=serieats-20\" target=\"_blank\">Vibrant Food</a></em>, I knew I'd be making and devouring them as soon as possible.", "totalTime": "", "recipeYield": "Makes 10 Fritters", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Avocado", "Cook the Book", "Corn", "Mains", "Sides", "Vegetarian"], "recipeIngredient": ["2 small ears corn, preferably white, husks and silk removed ", "1/2 cup grated zucchini ", "1/2 cup grated yellow squash (any summer squash will work here) ", "1/2 to 1 small jalapeño, seeded and minced", "5 green onions, white and pale green parts only, thinly sliced", "1/4 cup chopped fresh basil ", "3 tablespoons chopped fresh cilantro", "1 teaspoon fine sea salt", "1 egg, beaten", "1/4 to 1/2 cup all-purpose flour ", "3 tablespoons extra-virgin olive oi", " ", "<strong>Avocado Crema</strong>", "1 avocado, diced ", "1/2 cup plain Greek yogurt", "1 tablespoon freshly squeezed lime juice ", "1/4 teaspoon fine sea salt ", "Basil leaves, cut into thin ribbons (chiffonade)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stand the ears of corn upright in a large bowl. Using a very sharp knife, slowly slice the kernels of corn from the cob and into the bowl. Add the zucchini, yellow squash, jalapeño, green onions, basil, cilantro, and salt. Add the egg and mix until evenly combined. Add 1/4 cup of flour, mixing again until combined. If your batter is on the wet side, continue adding flour in 1 tablespoon increments, using no more than 1/2 cup of flour. The consistency of the batter should be moist, but more vegetable than batter. Set aside to rest for about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the batter rests, make the crema by combining the avocado, yogurt, lime juice, and salt in a bowl. Blend with an immersion blender or in a food processor until creamy. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large heavy skillet over medium heat, heat 1 tablespoon of the olive oil. Working in batches, measure a scant 1/4 cup of the batter for each fritter and drop it into the pan, lightly pressing with a spatula. Cook 3 to 4 fritters at a time, undisturbed, for 4 to 5 minutes, until the edges are lightly browned. Flip and cook the other side for about 4 minutes more. Place the fritters on a paper towel–lined plate. Repeat with the remaining batter, adding another tablespoon of oil to the pan at the start of each batch. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the fritters warm, topped with the crema and basil. </p>"}]}