{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141029-downtown-italian-roasted-mushrooms-with-bacon-and-eggs-tara-donne.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Mushrooms With Bacon and Eggs From 'Downtown Italian'", "link": "https://www.seriouseats.com/recipes/2014/11/roasted-mushrooms-with-bacon-and-eggs-from-downtown-italian.html", "description": "Gabriel Thompson's recipe for Roasted Mushrooms with Bacon and Eggs, from Downtown Italian, written with Katherine Thompson and Joe Campanale, sounds innocent enough, but comes at you guns blazing, all garlicky, salty, and wild.", "totalTime": "50 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Sides"], "recipeIngredient": ["5 tablespoons extra-virgin olive oil", "3 tablespoons unsalted butter", "1 pound shiitake mushrooms, stems removed, sliced or torn into ¾-inch-thick pieces (about 6 cups)", "3/4 teaspoon kosher salt, plus more for seasoning", "Freshly cracked black pepper", "3 1/2 ounces bacon or pancetta, diced", "4 garlic cloves, thinly sliced", "2 tablespoons thinly sliced hot pickled peppers (preferably B&G brand, stems and seeds removed; see Note)", "6 to 8 fresh basil leaves, torn", "Freshly squeezed juice of 1 lemon", "4 large eggs (preferably free range, farm fresh)", "4 ounces ricotta salata or Parmesan cheese, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300°F. Heat a large sauté pan over medium-high heat. When hot, add 1 tablespoon of the olive oil and 1/2 tablespoon of the unsalted butter. Once the butter has melted, add one-third of the mushrooms. Scatter the mushrooms in an even layer in the sauté pan. Cook the mushrooms until caramelized on all sides, 3 to 4 minutes. Season with 1/4 teaspoon of the salt and some pepper. Remove the mushrooms from the sauté pan and drain on paper towels. Repeat this process 2 more times with the remaining mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower the heat to medium, and add 1 tablespoon of the olive oil and 1 tablespoon of the butter to the sauté pan. Add the bacon or pancetta and cook until the fat has rendered and the meat is slightly crispy, 5 to 6 minutes. Add the garlic and cook until the garlic is slightly golden, 1 to 2 minutes longer. Add the pickled peppers and basil; stir to combine. Then add the cooked mushrooms and toss together until the mushrooms are warm. Stir in the lemon juice. Taste and adjust the seasoning as needed; the mixture should be spicy, salty, and lemony. Set aside and keep warm while cooking the eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium ovenproof nonstick sauté pan, heat the remaining 1 tablespoon olive oil and 1/2 tablespoon butter over medium heat. When the butter has melted, crack the eggs and add them to the pan. Season the eggs generously with salt and pepper. When the eggs start to sizzle, place the sauté pan in the oven. Cook the eggs just until the whites are set but the yolks are still runny, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the mushrooms among the serving plates. With a rubber spatula, divide the eggs into individual servings and slide 1 egg onto each serving of mushrooms. Garnish with freshly grated ricotta salata or Parmesan and serve.</p>\n\n<p><br />\n<strong>NOTE:</strong> I grew up in Texas, and spicy or acidic foods appeal to me. So I have a hard time not adding hot pickled peppers to everything I make. My preferred brand is B&G, but any hot pickled pepper will do.</p>"}]}