{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141106-pomelo-salad-issan-thai-recipe-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["easy", "green bean", "Isan", "mint", "pomelo", "quick", "salad", "thai", "winter", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Spicy Thai-Style Pomelo, Green Bean, and Zucchini Salad", "link": "https://www.seriouseats.com/recipes/2014/11/spicy-thai-pomelo-green-bean-zucchini-salad-recipe.html", "description": "Thai pomelos tend to be dryer and less sweet than their American-available counterparts, but that shouldn't stop you from using them in a Thai-inspired salad nonetheless. Heck, even bitter grapefruit would make a great addition to this salad that combines fiery heat, bitterness, and sweetness in perfect balance.", "totalTime": "30 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Legumes", "Salads", "Thai", "Zucchini"], "recipeIngredient": ["Kosher salt", "3 medium cloves garlic", "2 teaspoons Thai red pepper flakes (more or less to taste, see note)", "1 small green Thai chili or 1/2 small Serrano chili, finely chopped", "1 tablespoon brown or palm sugar (more or less to taste)", "1 tablespoon fish sauce (more or less to taste)", "1 tablespoon juice from 1 lime (more or less to taste)", "12 ounces trimmed green or long beans, cut into 1-inch segments", "1 small zucchini, split in half lengthwise and cut into 1/4-inch disks", "1 medium shallot, thinly sliced", "1 pomelo, rind and pith removed, segments cut into 1-inch <a href=\"http://www.seriouseats.com/2014/04/knife-skills-how-to-cut-citrus-fruit-into-wedges-slices-and-supremes.html\">suprèmes</a>", "1/2 cup roughly chopped fresh mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Meanwhile, Combine garlic, pepper flakes, and Thai chilies in a mortar and pestle and pound into a fine paste (see note). Add sugar, fish sauce, and lime juice, and pound until the sugar is dissolved. Taste dressing and add more sugar, fish sauce, lime juice, or pepper flakes to taste. It should be strongly spicy, sweet, salty, and acidic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blanch beans in boiling water until bright green but still extremely crisp, about 1 minute. Drain and run under cold water to chill. Dry well on paper towels or in a salad spinner. Combine beans, zucchini, shallot, pomelo, mint, and dressing in a large bowl and toss to coat. Serve immediately.</p>"}]}