{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140910-tacolicious-tomato-mint-salsa-alex-farnum.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "Mexican", "keywords": ["Cook the Book", "Mexican", "mint", "salsa", "tacolicious", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Roasted Tomato-Mint Salsa From 'Tacolicious'", "link": "https://www.seriouseats.com/recipes/2014/09/roasted-tomato-mint-salsa-recipe-from-tacolicious.html", "description": "When I make salsa at home, it's usually super simple: fresh tomatoes, onions, garlic, cilantro and lime, and a spoon to eat it with. This version, from Sara Deseran and Joe Hargrave's restaurants-cum-cookbook, <a href=\"http://www.amazon.com/Tacolicious-Festive-Recipes-Snacks-Cocktails/dp/1607745623/?tag=serieats-20\"><em>Tacolicious,</em></a> isn't much more complicated, but <em>is</em> much more interesting. It's the salsa that welcomes you on arrival to the Tacolicious restaurants, and will be the standard in my kitchen from now on.", "totalTime": "50 minutes", "recipeYield": "Makes about 2 1/2 cups", "recipeCategory": ["Cook the Book", "Mexican", "Salsa", "Sides", "Tomato", "Vegetarian"], "recipeIngredient": ["6 small Roma tomatoes, halved lengthwise", "1/2 large yellow onion, sliced into 1/2-inch-thick rounds", "1 small jalapeño chile, stemmed ", "1/4 cup rice vinegar", "1/4 cup packed chopped fresh cilantro", "2 tablespoons packed chopped fresh mint", "1 tablespoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack on the top level of the oven, about 4 inches from the broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn on the broiler. Line a rimmed baking sheet with aluminum foil. Place the tomato halves, cut side down; the onion slices; and the chile on the prepared baking sheet and broil for about 10 to 12 minutes, or until the vegetables are soft and a bit charred. Let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, combine the roasted vegetables and any juices from the pan with the vinegar, cilantro, mint, and salt and pulse until the mixture is almost, but not quite, smooth. If necessary, add up to 1/4 cup water to achieve a consistency similar to that of a thick soup. Taste and adjust the seasoning as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve now or store in an airtight container in the refrigerator for up to 3 days.</p>\r\n\r\n<p><strong>To purée or to chop, that is the question</strong><br />\r\nAt the restaurant, we go through so much of this salsa that pureeing it in a food processor is the only way to make enough. But it’s fun to play around with the texture of just about any salsa. At home, try processing your salsas less or more for a chunkier or smoother result. Or, if you’re not making a huge batch, try skipping the food processor altogether, get out the cutting board and chopping knife, and go old-school. A roughly chopped salsa has a completely different personality from a pureed one.</p>"}]}