{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140223-vegan-pasta-dried-tomato-olive-bread-crumb-recipe-12.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["easy", "garlic", "Italian", "olive", "pasta", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "10"}, "name": "Triple Garlic Pasta With Oven-Dried Tomatoes, Olives, and Breadcrumbs", "link": "https://www.seriouseats.com/recipes/2014/02/pasta-oven-dried-tomato-olive-bread-crumb-recipe.html", "description": "A flavor-packed pasta dish made with oven-dried tomatoes, garlic, olives, and crispy seasoned breadcrumbs.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Dairy-Free", "Garlic", "Italian", "Mains", "Olives", "Pasta", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1 quart cherry or plum tomatoes, split in half", "10 cloves garlic (4 thinly sliced, 2 minced, 2 smashed), divided", "6 sprigs fresh thyme", "Kosher salt and freshly ground black pepper", "1/2 cup extra-virgin olive oil, divided", "2 slices hearty white bread, roughly torn", "3 tablespoons chopped fresh parsley leaves", "2 tablespoons tomato paste", "1/2 teaspoon red pepper flakes", "1/2 teaspoon dried oregano", "1/2 cup dry white wine or vermouth", "1 pound penne, ziti, rigatoni, or other thick tubular pasta", "1 cup sliced pitted kalamata or other olives", "1/4 cup thinly sliced scallion whites and pale greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 300°F. Place tomatoes, cut-side up, on a foil-lined rimmed baking sheet. Scatter sliced garlic cloves and thyme sprigs evenly over tomatoes. Season with salt. Drizzle with 3 tablespoons olive oil and place in oven. Cook, rotating occasionally, until tomatoes are shriveled and half dried, and garlic is golden brown, about 1 hour 15 minutes. Discard thyme sprigs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine bread and 1 tablespoon olive oil in the bowl of a food processor. Season with salt and process until broken into fine crumbs, about 10 seconds. Preheat a large skillet over medium heat until hot. Add breadcrumbs and cook, tossing and stirring frequently, until pale golden brown and starting to crisp, about 4 minutes. Add minced garlic and continue tossing until golden brown and completely crisp, a few minutes longer. Transfer to a medium bowl and let cool slightly. Stir in chopped parsley and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet, add remaining 4 tablespoons olive oil and 2 smashed garlic cloves, and place over medium-low heat. Cook, flipping garlic occasionally, until garlic is tender and pale golden brown, about 12 minutes. Transfer garlic to a cutting board, allow to cool, and finely mince. Return garlic to skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomato paste, red pepper flakes, and dried oregano to skillet with garlic oil and cook, stirring with a whisk, until fragrant, about 1 minute. Add white wine, whisk to combine, and simmer until reduced and saucy, about 4 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When tomatoes are cooked, bring a large pot of salted water to a boil over high heat and cook pasta according to package directions. Drain, reserving 1/2 cup of cooking liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cooked pasta to skillet with tomato paste/white wine mixture. Add dried tomatoes/garlic. Add olives, scallions, and pasta cooking liquid. Cook over high heat, tossing and stirring constantly, until sauce evenly coats all of the pasta. Add half of breadcrumbs and toss to combine. Season to taste with salt. Transfer to a serving platter, sprinkle with remaining breadcrumbs, and serve immediately.</p>"}]}