{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140630-smoked-eggplant-ramen-recipe-.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["eggplant", "Japanese", "ramen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoked Eggplant for Ramen", "link": "https://www.seriouseats.com/recipes/2014/08/smoked-eggplant-ramen-topping-recipe.html", "description": "An intensely flavored topping for rice or ramen bowls made of slow-cooked eggplant seasoned with sea kelp, smoked bonito, and soy sauce.", "totalTime": "1 1/2 hours", "recipeYield": "Makes about 1 cup smoky eggplant topping", "recipeCategory": ["Condiments and Sauces", "Eggplant", "Japanese", "The Food Lab"], "recipeIngredient": ["1 large eggplant or 2 smaller Japanese or Italian eggplants", "Kosher salt and freshly ground black pepper", "1 (2-inch) piece <em>kombu</em> (dried sea kelp, see note)", "1/4 cup <em>katsuobushi</em> (shaved smoked bonito, see note)", "2 teaspoons soy sauce, plus more to taste", "1 tablespoon mirin", "1 tablespoon toasted sesame seeds", "<a href=\"http://www.seriouseats.com/2013/09/how-to-make-perfect-tonkotsu-ramen-food-lab-redux.html\">Homemade</a> or high quality store-bought ramen (such as <a href=\"http://www.seriouseats.com/2014/04/the-fresh-ramen-kits-from-sun-noodles-will-knock-your-socks-off.html\">Sun Noodles</a> or <a href=\"http://www.seriouseats.com/2013/09/taste-test-fancy-pants-instant-ramen-from-myo.html\">Myojo Chukazanmai</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To cook on a grill:</strong> Preheat a gas or coal grill to medium heat and place eggplants directly over heat source. Cook, turning occasionally with tongs, until completely tender and well charred on all sides, 30 to 40 minutes. Wrap with foil and let rest 15 minutes. Continue to Step 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To cook indoors:</strong> Adjust rack to 6 inches below broiler element and preheat broiler to high. Place eggplant on a foil-lined rimmed baking sheet. Broil, turning occasionally, until charred on all sides and completely tender, about 1 hour. Eggplants should be very, very tender when cooked. Test near the stem and bottom ends. If a toothpick or skewer meets any resistance, continue cooking. Remove from oven and gather up foil, crimping it around the eggplants to form a sealed package. Let the eggplants rest for 15 minutes. Continue to Step 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a sharp paring knife to slit eggplant open lengthwise. Carefully scoop out soft flesh with a large spoon and transfer to a strainer set in a large bowl. Once all eggplant is scooped, pick out any stray bits of skin and blackened flesh and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer eggplant to a salad spinner, distributing it evenly around the perimeter. Spin gently until all excess moisture is extracted. Transfer drippings to a small pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough water to eggplant drippings to add up to 1 cup of liquid total. Add kombu and bring to a simmer over medium-high heat. Add bonito flakes, return to a simmer, then remove from heat. Let stand 5 minutes. Carefully strain liquid back into a small pot and discard solids.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add soy sauce and mirin to strained liquid. Simmer over medium heat until reduced to 2 tablespoons, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, transfer eggplant to cutting board and finely mince with a sharp chef's knife. Transfer to a bowl. Add reduced cooking liquid and sesame seeds. Stir to combine. Adjust seasoning with extra soy sauce or mirin, if desired. Serve on top of ramen. Eggplant mixture can be stored in a sealed container in the refrigerator for up to 5 days.</p>"}]}