{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141104-creamed-brussels-sprouts-gratin-recipe-thanksgiving-food-lab-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brussels sprout", "casserole", "fall", "gratin", "low carb", "thanksgiving", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "8"}, "name": "Over-the-Top Creamed Brussels Sprout Gratin", "link": "https://www.seriouseats.com/recipes/2014/11/over-the-top-creamy-brussels-sprout-gratin-recipe.html", "description": "Brussels sprouts have come a long way in the days since they were boiled to a stinky, cabbage-y death. Rapid, high-heat cooking has been the game-changer for me, but what if I told you that there's an even <em>better</em> way to cook Brussels sprouts? One that forgoes that quick cooking in lieu of extra-richness and flavor? A method that not only delivers decadently delicious results, but can be made 100% ahead of time with just a short stay in the oven prior to serving? This cheesy casserole packed with bacon and Brussels sprouts is where it's at.", "totalTime": "1 hour", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Bacon", "Brussels Sprouts", "Christmas", "Sides", "Thanksgiving", "The Food Lab"], "recipeIngredient": ["1/2 pound bacon, cut into 1/2-inch lardons", "2 tablespoon unsalted butter", "2 1/2 pounds Brussels sprouts, split in half", "1 medium shallot, finely minced (about 1/4 cup)", "2 cups heavy cream", "Kosher salt and freshly ground black pepper", "6 ounces shredded Gruyère, Comté, or Fontina cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter and bacon over medium-high heat in a large straight-sided sauté pan or Dutch oven. Cook, stirring frequently, until well browned, about 8 minutes. Add Brussels sprouts and cook, stirring, until lightly browned, about 4 minutes. Add shallots and cook, stirring, until softened and fragrant, about 1 minute. Add heavy cream and scrape up any browned bits from the bottom of the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust heat to maintain a bare simmer. Cook, stirring frequently, until cream has reduced by about half and has a consistency that coats each sprout, about 20 minutes. Season to taste with salt and pepper. Transfer mixture to a casserole pan and cover with shredded cheese (for make-ahead instructions, see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 425°F. Transfer casserole to oven and bake uncovered until bubbly around the edges and cheese is melted and spotted brown, about 20 minutes. Serve immediately.</p>"}]}