{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140226-chickpea-cole-slaw-sandwich-recipe-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cabbage", "chickpea", "quick", "slaw", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Crispy Fried Chickpea Cake and Slaw Sandwiches", "link": "https://www.seriouseats.com/recipes/2014/02/crispy-fried-chickpea-cake-cole-slaw-sandwiches-recipe.html", "description": "Hearty and crispy vegan chickpea patties flavored with cumin and coriander, topped with a bright tahini-based slaw.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cabbage", "Dairy-Free", "Legumes", "Mains", "Sandwiches", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Slaw</strong>:", "3 cups finely shredded cabbage (about 1/2 a small head)", "1/2 small red onion, thinly sliced", "1 small carrot, grated on the large holes of a box grater", "1 cup fresh parsley leaves, roughly chopped", "1 tablespoon sugar (see note)", "1/4 cup tahini", "2 tablespoons juice from 1 lemon", "Kosher salt and freshly ground black pepper", "&nbsp;", "<strong>For the Chickpea Patties</strong>:", "1/2 cup bulgur wheat", "1 medium clove garlic, roughly chopped", "1 teaspoon ground cumin", "1 teaspoon ground coriander", "1/4 teaspoon ground cayenne pepper", "1 (15 ounce) can of chickpeas, drained, rinsed, and dried on paper towels", "1/2 cup flour", "1/2 cup water", "1 1/2 cups panko-style breadcrumbs (see note)", "1/2 cup vegetable or canola oil", "4 hamburger buns (see note)", "Sliced pickles and pepperoncini for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Slaw:</strong> Combine cabbage, onion, carrot, half of parsley, and sugar in a large bowl. Combine tahini and lemon juice in a small bowl and stir with a fork until homogenous. Add half of tahini mixture to cabbage. Season to taste with salt and pepper and toss to combine. Massage cabbage until tender then let rest at room temperature while you make the chickpea patties. Set aside remaining tahini mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chickpea Patties</strong>: Bring 2 cups of water to a boil over high heat. Add bulgur wheat and cook until tender, about 10 minutes. Drain carefully. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine remaining parsley, garlic, cumin, coriander, cayenne pepper, and half of chickpeas in the bowl of a food processor. Pulse until a rough puree is formed, scraping down sides as necessary, about 8 to 10 short pulses. Transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining chickpeas to food processor and pulse until roughly chopped, 4 to 6 pulses. Transfer to bowl with chickpea/herb mixture. When bulgur wheat has drained, add to bowl. Season with salt and pepper, then fold mixture together, starting with a rubber spatula, and finishing by hand when cool enough to handle. Form mixture into four patties about 4 inches wide and 1 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour and water in a medium bowl and whisk until smooth. Place breadcrumbs in second medium bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one patty at a time, dip in flour mixture to coat, then carefully transfer to breadcrumbs. Patties will be quite delicate. To move them without breaking, lift them from the batter mixture gently from underneath with your hands or with a slotted metal spatula. Cover with breadcrumbs on all sides, then carefully transfer to a plate. Repeat with remaining patties.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat half of oil in a large cast iron or non-stick skillet over medium-high heat until shimmering. Add the patties cook, swirling pan occasionally, until golden brown on bottoms, about 3 minutes. Carefully flip and cook second side, swirling pan occasionally as they cook, about 3 minutes longer. Transfer patties to a paper towel-lined plate and season well with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast hamburger buns under a broiler. Divide half of the slaw evenly between the bottom buns, top with a chickpea patty, divide the remaining slaw on top of the patties, drizzle with remaining tahini/lemon mixture, add pickles and sliced pepperoncini as desired, and close sandwiches. Serve immediately.</p>"}]}