{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140214-croissantprep2.jpg", "author": {"@type": "Person", "name": "Jenny McCoy"}, "recipeCuisine": "", "keywords": ["banana", "breakfast", "breakfast sweet", "chocolate", "croissant", "french pastry", "pastry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Banana-Chocolate \"Faux-ssants\"", "link": "https://www.seriouseats.com/recipes/2014/03/banana-chocolate-chip-faux-ssants.html", "description": "These banana and chocolate chip croissants are quick and simple to prepare thanks to store-bought puff pastry.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes about 14 croissants", "recipeCategory": ["Banana", "Breakfast and Brunch", "Breakfast Sweets", "Desserts", "Mother's Day", "Pastry"], "recipeIngredient": ["3 eggs, for egg wash", "1 box (2 sheets) all butter frozen puff pastry, thawed", "4 ripe bananas", "32 (1/2- by 3-inch) semisweet chocolate batons", "1/2 cup granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 400&deg;F. Line two baking sheets with parchment paper. In a small bowl, whisk the eggs until evenly combined and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and trim the pointed ends off each banana and discard. Cut 1 banana crosswise into two 3-inch long slices, then cut each slice in half horizontally, to make four 3-inch long pieces. Repeat with the remaining bananas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay one sheet of puff pastry on a dry cutting board or a sheet of parchment paper, with the longer sides of the sheet at the top and bottom of the cutting board, and the shorter sides to the left and right of the cutting board. Using a pizza wheel and a ruler as guide, cut the sheet vertically into eight triangles in a zigzag pattern, each with a 3½-inch base. Repeat with the second sheet of dough. (Note: To be safe, it’s best to measure your triangles before you start cutting.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position one triangle with the wide base closest to you and the point directed away from you, then lightly brush the entire surface of the puff pastry with egg wash. Cut a small notch in the center of the base of the triangle and gently stretch apart (See image for reference). Place two chocolate batons and one piece of banana about 1-inch from the base of the triangle, fold the dough over the banana and chocolate to secure, and continue to roll until you have a spiral of dough. Gently transfer the shaped croissant to the prepared baking sheet, with the point of the triangle placed flat on the baking sheet. (This is often referred to as “seam side down,\" which will prevent your croissant from unrolling as it rises and bakes.) Repeat with the remaining triangles of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly brush the egg wash over the entire surface of each croissant and sprinkle generously with about 1 tablespoon of sugar each.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until well risen and a deep golden brown in color, about 40 minutes, rotating the pan halfway through baking. Let the croissants cool on the baking sheet until warm enough to handle. </p>"}]}