{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/BakedOccasions_BirthdayCake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "baked occasions", "cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "5"}, "name": "Ultimate Birthday Cake From 'Baked Occasions'", "link": "https://www.seriouseats.com/recipes/2014/11/baked-ultimate-birthday-cake-from-baked-occasions.html", "description": "Nearly every cookbook has one crowning jewel of a recipe. One big, beautiful must-try. In the case of <em>Baked Occasions</em>, this is that recipe. Three layers of densely spongy \"very vanilla\" cake are enveloped in layers of bright white frosting and coated with rainbow sprinkles. Cutting into the cake reveals more sprinkles, folded into the cake batter. The effect is childlike and utterly charming, with the innocent sweetness of vanilla providing the perfect backdrop.", "totalTime": "several hours", "recipeYield": "Makes 1 8-inch 3-layer cake", "recipeCategory": ["Bake the Book", "Cakes"], "recipeIngredient": ["<strong>For the Very Vanilla Cake</strong>", "2 1/2 cups (315 g) cake flour", "3/4 cup (90 g) all-purpose flour", "1 tablespoon baking powder", "1 teaspoon baking soda", "3/4 teaspoon kosher salt", "4 ounces (1 stick/115 g) unsalted butter, softened, plus more for the pans", "1/2 cup (100 g) vegetable shortening, at room temperature", "1 3/4 cups (350 g) granulated sugar", "2 tablespoons pure vanilla extract", "1 large egg", "1 cup (240 ml) ice-cold water", "1/2 cup (120 ml) whole milk", "1/2 cup (120 ml) well-shaken buttermilk", "1 cup (190 g) rainbow sprinkles", "3 large egg whites, at room temperature", "1/4 teaspoon cream of tartar", "<strong>For the Very Vanilla Frosting</strong>", "1 1/2 cups (300 g) granulated sugar", "1/3 cup (40 g) all-purpose flour", "11/2 cups (360 ml) whole milk", "1/3 cup (75 ml) heavy cream", "12 ounces (3 sticks/340 g) unsalted butter, softened but cool, cut into small pieces", "1 1/2 teaspoons vanilla paste", "1 teaspoon pure vanilla extract", "<strong>For Décor</strong>", "1 to 1 1/4 cups (190 to 240 g) rainbow sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cake: Preheat the oven to 325F (165C). Butter three 8-inch (20-cm) round cake pans, line the bottoms with parchment paper, and butter the parchment. Dust with flour and knock out the excess flour.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift both flours, the baking powder, baking soda, and salt together into a large bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a standing mixer fitted with the paddle attachment, beat the butter and shortening on medium speed until creamy, 3 to 4 minutes. Add the sugar and vanilla and beat on medium speed until fluffy, about 3 minutes. Scrape down the bowl, add the egg, and beat until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the ice-cold water, milk, and buttermilk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour mixture to the mixer bowl in three separate additions, alternating with the water mixture, beginning and ending with the flour mixture; turn the mixer to low when you add the ingredients, then up to medium for a few seconds to incorporate. Scrape down the bowl, then mix on low speed for a few more seconds. Remove the bowl from the standing mixer, scatter the sprinkles across the top of the batter, and fold them in with a rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the egg whites and cream of tartar just until soft peaks form; do not overbeat. Gently fold the egg whites into the batter with a rubber spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter among the prepared pans and smooth the tops. Bake for 40 to 45 minutes, rotating the pans halfway through the baking time, until a toothpick inserted in the center of each cake comes out clean. Transfer the cakes to a wire rack and let cool for 20 minutes. Invert the cakes onto the rack, remove from the pans, and let cool completely. Remove the parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the frosting: In a medium heavy-bottomed saucepan, whisk the sugar and flour together. Add the milk and cream and cook over medium heat, whisking occasionally, until the mixture comes to a boil and has thickened to the consistency of a light pudding, 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to the bowl of a standing mixer fitted with the paddle attachment. Beat on high speed until cool, at least 7 to 9 minutes (you can speed up the process by pressing bags of frozen berries or corn against the sides and bottom of the mixing bowl). Reduce the speed to low and add the butter a few chunks at a time, every 20 to 30 seconds, while the mixer is constantly stirring; mix until thoroughly incorporated. Increase the speed to medium-high and beat until the frosting is light and fluffy, 1 to 2 minutes. Add the vanilla paste and extract and mix until combined. If the frosting is too soft, place the bowl in the refrigerator to chill slightly, then beat again until it can hold its shape. If the frosting is too firm, set the bowl over a pot of simmering water and beat with a wooden spoon until it is spreadable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble the cake: Place one cooled cake layer on a cake turntable (or a serving platter if you don’t own a cake turntable).<br />\r\nTrim the top to create a flat surface, and evenly spread about 11/4 cups (215 g) of the frosting on top. Add the next layer, trim it, and frost it as before, then add the third layer (trim the final layer for a completely flat top, or feel free to leave it domed for an old-school appearance). Spread a very thin layer of frosting over the sides and top of the cake and place it in the refrigerator for about 15 minutes to firm up. (This is known as crumb coating and will help to keep loose cake crumbs under control when you frost the outside of the cake).<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the turntable on a parchment-lined baking sheet with raised sides. Frost the sides and top with the remaining frosting. Grab a fistful of sprinkles and turn the turntable with your free hand while tossing the sprinkles at the sides of the cake. Using the leftover sprinkles from the parchment (i.e., sprinkles that didn’t stick), continue turning and throwing until the cake (including the top) is covered in sprinkles. Chill the cake for about 5 minutes to set before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This cake will keep beautifully in a cake saver at room temperature (cool and humidity-free) for up to 3 days. If your room is not cool, place the cake in a cake saver and refrigerate for up to 3 days, then let it sit at room temperature for at least 2 hours before serving.</p>"}]}