{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140723-change-of-appetite-roasted-tomatoes-and-lentils-laura-edwards.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "Middle Eastern", "keywords": ["a change of appetite", "Cook the Book", "dukka", "egg", "egyptian", "lentil", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Roasted Tomatoes and Lentils With Dukka-Crumbed Eggs From 'A Change of Appetite'", "link": "https://www.seriouseats.com/recipes/2014/07/roasted-tomatoes-and-lentils-with-dukka-eggs-from-a-change-of-appetite.html", "description": "There's a reason oozing, soft-cooked eggs are arguably overused in food styling. That glistening ovum gold is like icing dripping down a cake, and anything underneath it is transformed into something richer, tastier, and more appealing. I would have been sold on this recipe from Diana Henry's new <a href=\"http://www.amazon.com/A-Change-Appetite-Diana-Henry/dp/1845338928/?tag=serieats-20\"><em>A Change of Appetite</em></a> without that lusty addition, given my fondness for lentils in vinaigrette, but that broken yolk sealed the deal.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 6 for lunch or as a light main course", "recipeCategory": ["Beans and Pulses", "Cook the Book", "Eggs", "Mains", "Middle Eastern", "Tomato"], "recipeIngredient": ["<strong>For the Dukka</strong>", "1/2 cup hazelnuts (skins on)", "1/3 cup sesame seeds", "1 teaspoon nigella seeds", "1 tablespoon sunflower seeds", "3 tablespoons coriander seeds", "1 tablespoon white peppercorns", "1 1/2 tablespoons cumin seeds", "1 teaspoon ground paprika", "1/2 tablespoon sea salt flakes", " ", "<strong>For the Tomatoes and Eggs</strong>", "12 large plum tomatoes, halved", "3 tablespoons olive oil", "2 teaspoons harissa", "1/2 tablespoon sugar", "salt and pepper", "6 large eggs", " ", "<strong>For the Lentils</strong>", "1 tablespoon olive oil", "1/2 onion, finely chopped", "1 celery stick, finely chopped", "1 garlic clove, chopped", "1 1/3 cups Puy lentils", "1 sprig of thyme", "1 bay leaf", "Juice of 1/2 lemon", "1 tablespoon sherry vinegar", "3 1/2 tablespoons extra virgin olive oil", "2 tablespoons chopped cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the dukka, put the hazelnuts in a dry frying pan and toast over a high heat until they smell roasted. Be careful not to go too far, they burn very easily. Tip them on to a plate to cool a little, then crush them in a mortar to a coarsely ground mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the sesame seeds into the dry frying pan with the nigella and toast until the sesame seeds are golden. Follow with the sunflower seeds. Roughly crush all the toasted seeds and add to the nuts. Toast the coriander seeds until they smell toasted, then grind them very roughly. Do the same with the peppercorns, then the cumin seeds. Combine the nuts, seeds and toasted spices with the paprika and salt. Store in a jar or other airtight container until you need it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the tomatoes, preheat the oven to 190°C/375°F/gas mark 5. Lay the tomatoes in a single layer in a roasting tin. Mix the olive oil and harissa together and pour over. Turn to coat, ending cut side up, then sprinkle with sugar and season. Roast in the oven for 45 minutes, or until caramelized in parts and slightly shrunken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook the lentils. Heat the oil in a saucepan and gently sauté the onion, celery and garlic until soft but not coloured. Add the lentils and turn them over in the oil. Chuck in the thyme and bay leaf. Pour in 3 cups of water, season lightly, bring to the boil, reduce the heat and simmer, uncovered, until the lentils are just tender. This could take 15–25 minutes depending on their age, so watch them; they can turn to mush quickly. When they are cooked, they should have absorbed all the liquid (simply drain them if they haven’t). Remove the thyme and bay leaf. Add the lemon juice. Mix the vinegar and extra virgin oil together and stir it into the lentils with the coriander. Taste for seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the eggs in boiling water for six minutes. They should still be a little runny in the middle. Rinse them in cold water and, once cool enough to handle, quickly peel. Roll them lightly in the dukka and set each on top of a serving of lentils and tomatoes, or if you prefer to see the yolk, break the egg in half and sprinkle some dukka on top. Serve immediately.</p>"}]}