{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141113-baking-steel-turkey-recipe-8.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["comfort", "fall", "roast", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1666666666667", "ratingCount": "6"}, "name": "The Best Simple Roast Turkey With Gravy", "link": "https://www.seriouseats.com/recipes/2014/11/the-best-simple-roast-turkey-gravy-recipe.html", "description": "This recipe uses the power of a baking stone or steel to direct heat exactly where it needs to be, delivering a roast turkey that is crisp-skinned, juicy, and evenly cooked, with no flipping, trussing, or fussing.", "totalTime": "5 hours", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Christmas", "Fall", "Mains", "Roasting", "Thanksgiving", "The Food Lab", "Turkey", "Winter"], "recipeIngredient": ["1 whole turkey, neck and giblets reserved, about 10 to 12 pounds (4.5 to 5kg) (see note)", "Kosher salt and freshly ground black pepper", "1 tablespoon (15ml) vegetable oil", "1 large onion, roughly chopped", "1 large carrot, peeled and roughly chopped", "2 ribs celery, roughly chopped", "1 1/2 quarts (about 1.5L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 bay leaves", "1 teaspoon (5ml) soy sauce ", "3 tablespoons (45g) butter ", "1/4 cup (1 1/2 ounces) flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to lowest position and place a baking stone or <a href=\"http://bakingsteel.com/\">Baking Steel</a> on it. Preheat oven to 500&deg;F (260&deg;C). Allow to preheat for at least 45 minutes before adding turkey. Meanwhile, rinse turkey and carefully pat dry with paper towels. Season generously with salt and pepper. (If turkey has been dry-brined, omit rinsing and salting steps; see note.) Set turkey breast side up in a <a href=\"http://www.amazon.com/dp/B00005AL40/?tag=serieats-20\">V-rack</a> over a foil-lined <a href=\"http://www.amazon.com/dp/B000G0KJG4/?tag=serieats-20\">rimmed baking sheet</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer rimmed baking sheet with turkey directly to baking stone. Immediately close oven and reduce oven temperature to 300&deg;F (150&deg;C). Roast until turkey is golden brown and deepest part of breast registers 150&deg;F (66&deg;C) on an instant-read thermometer and legs register at least 165&deg;F (74&deg;C), 3 to 4 hours total. (Check on turkey after 2 hours. If skin looks like it is not browning fast enough, turn on convection or increase oven temperature by 50&deg;F/10&deg;C.) Remove from oven and let rest at least 30 minutes before carving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While turkey is roasting, chop reserved turkey neck into 1-inch chunks with a cleaver. Heat oil in a medium saucepan over medium-high heat until shimmering. Add turkey neck, onion, carrot, and celery and cook, stirring occasionally, until well browned, about 10 minutes total. Add stock, bay leaves, and soy sauce. Bring to a boil, then reduce to a simmer. Simmer for 1 hour, then strain through a fine-mesh strainer. You should have a little over 1 quart of fortified stock; if not, add water or more chicken stock to equal 1 quart. Discard solids and set stock aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop turkey gizzard and liver (if desired). Melt butter in a medium saucepan over medium heat. Add chopped giblets and cook, stirring frequently, until just cooked through, about 1 minute. Add flour and cook, stirring constantly, until golden brown, about 3 minutes. Whisking constantly, add fortified broth in a thin, steady stream. Bring to a boil, reduce to a simmer, and cook until thickened and reduced to about 3 cups. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2012/11/how-to-carve-a-turkey-thanksgiving-slideshow.html\">Carve turkey</a> and serve with gravy.</p>"}]}