{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140828-crystal-skin-shrimp-dumpling-shao-zhong-2.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "dim sum", "dumpling", "har gow", "pork", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crystal Skin Shrimp Dumplings (Har Gow)", "link": "https://www.seriouseats.com/recipes/2014/09/dim-sum-classics-how-to-make-crystal-skin-shrimp-dumplings-har-gow-recipe-from-scratch.html", "description": "Plump and juicy, with chunks of shrimp barely visible through translucent dough, har gow are one of the most widely recognized dim sum classics. Ours enhance the shrimp with bits of pork fat in a stretchy, delicate wrapper.", "totalTime": "1 hour", "recipeYield": "Makes 25 dumplings", "recipeCategory": ["Chinese", "Christmas", "Mains", "Pork", "Shrimp"], "recipeIngredient": ["<strong>For the Dough:</strong>", "1/2 cup water", "3/4 cup wheat starch (see note)", "6 tablespoon tapioca flour or tapioca starch", "1/8 teaspoon salt", "2 teaspoons vegetable or canola oil", "<strong>For the Shrimp Filling:</strong>", "1/2 pound shrimp, shelled and de-veined", "1 teaspoon baking soda", "1 (2- by 3-inch piece) pork fatback, about 2 ounces", "1/2 teaspoon minced ginger", "1/2 teaspoon minced garlic ", "1/2 teaspoon Shaoxing wine", "1/4 teaspoon salt", "1/4 teaspoon sugar", "1/4 teaspoon ground white pepper", "1 teaspoon oil", "1 teaspoon cornstarch", "Black vinegar for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Bring ½ cup of water to boil. In a bowl, add wheat starch, tapioca flour/starch, and salt. Mix the dry ingredients together. Add the oil and the boiling water. With a spatula, mix until a loose dough is form. Turn the dough out onto a table and knead until a smooth ball is formed. Wrap tightly in plastic wrap and set aside at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> In a medium bowl, cover shrimp with cold water and stir in baking soda. Refrigerate for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fill a small pot halfway with water and bring it to a boil. Add fatback and boil for 10 minutes. Drain fatback on paper towels and let cool. When the fatback is cool to the touch, remove the skin (if the skin is attached) and mince the fat. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 30 minutes in the refrigerator, drain and rinse shrimp under cold running water, then pat dry with paper towels. Chop shrimp into 4 to 5 pieces and place in a bowl. Add minced fatback, minced ginger, minced garlic, Shaoxing wine, salt, sugar, ground white pepper, oil, and cornstarch. Mix well and set aside in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the dough in half. Wrap half of the dough in plastic wrap to prevent drying and set aside. Roll the other half into a long rope. Cut the dough into 12 portions, about 1/4 ounce each. Using a small rolling pin on a lightly floured surface, roll each portion of dough into a circle about 2 inches in diameter. Continue with the rest of the portions and the other half of the dough, covering the finished wrappers in plastic wrap as you work. Cover the wrappers with plastic wrap until ready to fill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To fill the wrappers, place 3 to 4 pieces of shrimp with the fatback in the middle of one wrapper. Fold one side of the wrapper onto the other side forming a half moon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a small fork, crimp the edge. Set aside on top of parchment paper. (see note for freezing instructions.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the dumplings, set up a steamer. Make sure to line the steaming surface with parchment paper or cabbage leaves to prevent the dumplings from sticking. Steam each batch of dumplings over high heat for 7 minutes, or 9 minutes if they are coming straight from the freezer. Let the dumplings rest for 1 minute and serve with black vinegar.</p>"}]}