{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/08/20140828-bread-dough-folding-collage-1b.jpg", "author": {"@type": "Person", "name": "Max Bernstein"}, "recipeCuisine": "", "keywords": ["baking", "bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3636363636364", "ratingCount": "22"}, "name": "Simple Crusty White Bread", "link": "https://www.seriouseats.com/recipes/2014/08/simple-crusty-white-bread-recipe.html", "description": "This all-purpose bread recipe produces a crusty plain white loaf that's classic and delicious. The quantities given here yield two crusty hearth loaves with an open crumb, and is a great starting point for learning to bake bread at home.", "totalTime": "About 5 hours", "recipeYield": "Makes 2 large (850g) loaves", "recipeCategory": ["Baking", "Christmas", "Dairy-Free", "Thanksgiving", "Vegan", "Vegetarian", "Yeast Bread"], "recipeIngredient": ["1000 grams all-purpose flour, plus more for dusting", "700 grams room-temperature water, divided if using active dry yeast", "22 grams salt", "4 grams instant yeast, 5 grams active dry yeast, or 10 grams fresh yeast (see note)", "Vegetable, canola, or other neutral oil, for greasing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using instant or fresh yeast, combine flour and all of the water in a stand mixer fitted with the dough hook. If using active dry yeast, combine flour with 650 grams water and combine yeast with 50 grams warm water; let yeast stand until foamy. Mix flour and water at low speed until they are fully incorporated and form a uniform dough. Alternatively, combine flour and water in a mixing bowl and mix using a dough spatula until dough forms. Cover the bowl with a kitchen towel or plastic wrap and let the dough rest for at least 15 minutes and up to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add salt, along with either the instant yeast, fresh yeast, or the active-dry yeast solution, and mix at low speed or by hand until salt and yeast are fully incorporated and dough is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn stand mixer up to medium-high speed and mix until the dough feels elastic and bounces partway back when indented with your thumb, about 3-5 minutes. If mixing by hand, skip this step.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with oiled hands, gently transfer dough, being careful not to tear its surface, to a lightly oiled mixing bowl and cover with plastic wrap. Let dough stand at room temperature for 30 minutes. Uncover dough. Working with wet hands and/or a plastic bench scraper, loosen the dough, then gently lift and pull the dough down towards you, folding it in half. Give the bowl a quarter turn and repeat, folding the dough in half towards you. Now give the bowl a half turn and repeat the fold a final time, being careful not to compress it too much. Lastly, pull the unfolded side of your dough carefully up from the bottom, and pull it up and over to form a neat package. Re-cover with plastic wrap and let stand until dough has increased in volume by half, about 1 hour 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough in one piece to a lightly floured work surface. Using a bench knife, divide dough in half and shape each portion into a ball. Dust the tops of the dough balls with flour, cover with a towel, and let rest for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the dough into rounds once again, gently folding the dough over itself similar to how you did before, but even more carefully now. Now flip the dough ball over so that the seams you just created are on the bottom and a smooth surface is on top. Let dough rest on the work surface, seam-side down, for 5 minutes. Transfer each dough ball, seam-side up, to a bowl or basket lined with a lightly floured linen cloth or plain, not-fuzzy kitchen towel. Refrigerate dough balls or store in a cool place until dough has nearly doubled in size, about 1 hour to 1 hour 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, set a Dutch oven on the oven's bottom rack and preheat oven to 500&deg;F (260&deg;C)(if your oven has a convection setting, do not use it).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove 1 loaf from the refrigerator and gently turn it out, seam-side down, into the preheated Dutch oven. With a razor or paring knife, score the full surface of the dough with 2 parallel lines roughly 3 inches apart. With a spray bottle filled with water, lightly spritz the surface of the dough. Cover and bake for 15 minutes. Lower oven temperature to 450&deg;F (232&deg;C)and bake for 15 minutes longer. Uncover and bake until crust is dark brown, about 15 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer loaf to a wire rack. Allow to cool for at least 1 hour before slicing. Return Dutch oven to oven, and reheat at 500&deg;F (260&deg;C) for 10 minutes. Then repeat with the remaining ball of dough.</p>"}]}