{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140424-290957-boston-cream-doughnuts.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["Boston cream", "breakfast sweet", "chocolate", "pastry", "vanilla bean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Boston Cream Doughnuts", "link": "https://www.seriouseats.com/recipes/2014/04/boston-cream-doughnuts.html", "description": "This homemade version of Boston Cream doughnuts makes sure every component rocks thanks to a dark chocolate glaze, vanilla bean pastry cream, and tender yeasted dough.", "totalTime": "14 hours", "recipeYield": "Makes approximately 18 doughnuts", "recipeCategory": ["American Classics", "Breakfast Sweets", "Chocolate", "Doughnuts", "Pastry"], "recipeIngredient": ["<strong>For the Doughnuts:</strong>", "1 cup whole milk, warmed to between 110 an 115°F", "2/3 cup plus 1 tablespoon sugar", "4 1/2 teaspoons (two packages) instant yeast", "2 large eggs, beaten, at room temperature", "12 tablespons unsalted butter, melted and cooled", "1 tablespoon vanilla extract", "3 cups (12.75 ounces) bread flour", "1 cup (4.5 ounces) all-purpose flour", "1 teaspoon salt", "2 quarts frying fat (lard, crisco, or neutral oil)", " ", "<strong>For the Filling:</strong>", "4 cups vanilla pastry cream (<a href=\"http://www.seriouseats.com/recipes/2011/08/pastry-cream-recipe-for-cakes-eclairs-pastries.html\">I used this recipe</a>)", " ", "<strong>For the Glaze:</strong>", "8 tablespoons unsalted butter", "1/4 cup whole milk", "1 tablespoon light corn syrup", "5 ounces high quality (70% cacao) bittersweet chocolate, finely chopped", "1 teaspoon vanilla extract", "1 3/4 cups confectioners sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour warmed milk into medium bowl. Dissolve yeast in milk. Add one tablespoon sugar. Cover tightly with plastic wrap and let stand for 5 minutes or until mixture is foamy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a separate bowl, stir together the eggs, melted butter, and vanilla and set aside. In the bowl of a stand mixer, combine the flours, remaining sugar, and salt. Fit mixer with a dough hook. Add the milk mixture, mixing on low until the flour is moistened, Add the egg mixture increasing the speed to medium. Once ingredients are thoroughly combined, increase speed to medium-high and beat for approximately 10 minutes, stopping to scrape the dough off the hook and edges of the bowl as needed. As it mixes, the dough will make a slapping sound against the edge of the bowl. The dough will be smooth, stretchy and tacky (not sticky) once finished. Coat a large bowl with cooking oil or cooking spray and place the dough inside. Cover the bowl with plastic wrap and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your favorite vanilla pastry cream recipe as directed (I used <a href=\"http://www.seriouseats.com/recipes/2011/08/pastry-cream-recipe-for-cakes-eclairs-pastries.html\">this recipe</a>). Transfer warm pastry cream into a bowl, place plastic wrap directly over the cream to prevent a skin from forming. Chill overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from the refrigerator and turn it out on to a lightly floured work surface. Dust the surface of the dough with flour use a rolling pin to roll out the dough to 1/2 inch thickness. Line two sheet trays with parchment paper. Use a 3 inch round cookie or biscuit cutter to cut out the doughnut rounds, combine and reroll any scraps. Place doughnuts on prepared baking sheets. Place trays in a warm, moist environment to proof until they have puffed up, about 45 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a Dutch oven or deep fryer with frying oil. Heat oil over medium high heat to 350°F. Doughnuts will be fragile. Carefully transfer, one at a time to a shallow, heat resistant strainer. Use the strainer to gently drop doughnuts in the oil and fry until a deep golden brown on both sides (about 2 minutes per side, use the color as your guide as the oil temperature can very with time). Use wooden chopsticks to turn the doughnuts. Be careful not to crowd the doughnuts in the pan (no more than 2 doughnuts at a time). Remove doughnuts immediately from the pan using a heat resistant strainer or tongs. Let doughnut cool for 5 minutes then tear apart your first doughnut to test for doneness and adjust your cooking time as needed. Set on wire baking racks to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While doughnuts are cooling, prepare your glaze. In a medium saucepan combine butter, milk, and corn syrup. Heat over medium until butter has just melted. Decrease the heat to low, then whisk in chocolate until fully incorporated. Remove pan from heat and whisk in vanilla and confectioners sugar until smooth. Set mixture over a bowl of warm water, stir as needed to keep it from hardening. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chilled pastry cream to the bowl of a stand mixer. Using the whisk attachment, whip the cream until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the doughnuts have completely cooled, use the chopsticks to poke a hole in the center of the side of each doughnut. Fit a pastry bag with a small round tip and fill the bag with the filling. Squirt about a few tablespoons of filling into each doughnut. Dip in chocolate glaze and return to your wired racks to let the glaze set for approximately 30 minutes before serving. Eat within a day.</p>"}]}