{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141207-shortbread-cookie-caramel-chocolate-twix-recipe-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["candy", "candy bar", "caramel", "chocolate", "cookie", "dessert", "shortbread", "Twix"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Chocolate-Covered Caramel-Filled Shortbread Cookies (a.k.a. Homemade Twix)", "link": "https://www.seriouseats.com/recipes/2014/12/chocolate-covered-caramel-filled-shortbread-cookie-recipe.html", "description": "Twix have always been my favorite candy bar, but it's easy to see where there's room for improvement. This recipe replicates the familiar flavors of the chocolate-covered caramel-and-shortbread cookies, but with high quality dark chocolate, buttery homemade caramel, and crisp, flavor-packed shortbread cookies.", "totalTime": "3 hours", "recipeYield": "Makes about 24 cookies", "recipeCategory": ["Candy", "Chocolate", "Christmas", "Cookies", "Desserts", "The Food Lab"], "recipeIngredient": ["<strong>For the Shortbread Cookies:</strong>", "2.5 ounces (1/2 cup) steel-cut oats", "7.5 ounces (1 1/2 cups) all-purpose flour ", "1.5 ounces (1/4 cup) cornstarch", "3 ounces (2/3 cup) confectioner’s sugar", "1/2 teaspoon salt", "7 ounces (14 tablespoons) unsalted butter, cut into tablespoon-sized pats", "<strong>For the Caramel Filling:</strong>", "6 ounces (about 3/4 cup) sweetened condensed milk", "3 ounces (6 tablespoons) unsalted butter", "4 ounces (about 1/2 cup) white granulated sugar", "4 ounces (about 1/2 cup) dark brown sugar ", "4 ounces (about 1/2 cup) corn syrup", "1/4 teaspoon salt", "2 ounces (about 1/4 cup) water", "1/2 teaspoon vanilla extract", "<strong>For the Chocolate Coating:</strong>", "24 ounces bittersweet chocolate disks, chips, or roughly smashed bars", "Coarse sea salt such as Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cookies</strong>: Adjust oven rack to center position and preheat oven to 450°F. Place oats in a spice grinder or blender and process to a fine flour, about 1 minute. Combine oat flour, regular flour, cornstarch, confectioner's sugar, and salt in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed until combined, about 15 seconds. Add butter and beat on low speed until a dough forms and pulls away from the sides of the mixer, about 12 minutes. Transfer dough to a parchment-lined work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hands, form the dough into a ball and flatten slightly. Lay a second sheet of parchment on top. Using a rolling pin, roll dough to an even layer about 3/16th of an inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut out as many circles as you can using a 2 1/2-inch round cookie cutter. Cut a second circle out of the center of half of them using a 2 1/4-inch cookie cutter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the whole circles to a parchment-lined baking sheet with a thin metal spatula (there should be room for about 24 circles on the sheet). Top each circle of dough with one of the punched out rings of dough, pressing down slightly to adhere. Prick the center of each cookie four times with a toothpick or wooden skewer to dock. Gather any dough scraps and repeat rolling, cutting and transferring process until 24 full cookies are formed. Discard or reserve remaining dough for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cookies for 10 minutes, then reduce oven temperature to 300°F and continue baking until cookies are pale golden brown around the edges, about 15 minutes longer, rotating pan half way through cooking. Remove from oven, transfer to a wire rack set in a parchment-lined rimmed baking sheet, and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Caramel:</strong> Combine condensed milk, butter, both sugars, corn syrup, salt, and water in a medium saucepan. Bring to a boil, stirring constantly with a heat-resistant rubber spatula or spoon. When mixture reaches 245°F on an instant-read thermometer, immediately remove from heat and transfer mixture to a 2-cup liquid measure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully spoon caramel into the center of each cookie, letting it rise slightly above the lip of the shortbread ring. Excess caramel can be poured into a lightly buttered baking dish, cooled completely at room temperature, turned out of dish, and cut into individual caramel candies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate:</strong> Allow caramel to cool while you prepare the chocolate. Remove 1/4 up of chocolate and set aside. Place remaining chocolate in a microwave-safe container and microwave in 15 second intervals, stirring after each one, until chocolate is completely melted and registers 115°F on an instant-read thermometer (do not overheat). Add half of reserved chocolate to bowl and stir vigorously with a rubber spatula. Continue stirring and adding reserved chocolate a bit at a time until temperature drops to between 84 and 86°F. Return to microwave and microwave at 10-second intervals, stirring vigorously in between, until chocolate registers 90°F. Be careful not to heat past 94°F. (If chocolate heats past 94°F, reheat to 115°F and repeat this step. <a href=\"http://www.seriouseats.com/2014/12/the-food-lab-best-way-to-temper-chocolate.html\">See here for instructions on how to temper chocolate using a sous-vide cooker or a food processor with a hair dryer</a>.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour or spoon melted chocolate over cookies, letting excess drip through cooling rack. Set aside for 1 minute, then sprinkle a small amounf ot coarse sea salt on the center of each cookie. Let chocolate harden to room temperature for 10 minutes, transfer to refrigerator for 10 minutes, then remove cookies from wire rack using a thin metal spatula. Store in a covered container at room temperature for up to 5 days.</p>"}]}