{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140513-sliced-pork-yellow-chive-recipe-9.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "chive", "easy", "pork", "quick", "stir fry", "wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Stir-Fried Sliced Pork With Yellow Chives", "link": "https://www.seriouseats.com/recipes/2014/05/stir-fried-pork-chives-recipe-chinese-wok.html", "description": "Thin, tender strips of lean marinated pork are tossed with Chinese chives and yellow chives in a light coating of soy sauce and Shaoxing wine seasoned with white pepper. This is a quick and easy dish that goes from fridge to table in about 30 minutes.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Mains", "Pork", "Quick Dinners", "Stir Frying"], "recipeIngredient": ["1 pound pork loin, cut into 2-inch matchsticks less than a quarter inch thick", "1/4 teaspoon sugar", "3/4 teaspoon ground white pepper, divided", "2 tablespoons Shaoxing wine, divided", "2 tablespoon light soy sauce, divided", "1 teaspoon sesame oil", "1/4 teaspoon baking soda", "1/2 teaspoon cornstarch", "3 tablespoons vegetable, canola, or peanut oil", "1/4 pound yellow chives, cut into 2-inch segments", "1/4 pounds Chinese chives, cut into 2-inch segments", "Kosher salt", "2 medium cloves garlic, minced (about 2 teaspoons)", "1 teaspoon minced fresh ginger", "2 scallions, white and pale green parts only, finely minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pork, sugar, 1/4 teaspoon white pepper, 1 teaspoon wine, 1 teaspoon soy sauce, sesame oil, baking soda, and cornstarch in a medium bowl and toss with fingers until thoroughly combined. Set aside for 15 minutes at room temperature or refrigerate for up to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, heat 1 oil in a wok over high heat until heavily smoking. Add yellow chives and Chinese chives and cook, tossing and stirring occasionally, until brightly colored and barely tender, about 1 minute. Season with salt. Transfer to a large bowl and set aside. Wipe out wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add another tablespoon oil to the wok and heat over high heat until smoking. Add half of pork, spread into a single layer, and cook without moving until lightly browned, about 45 seconds. Cook, tossing and stirring frequently until barely cooked through, about 30 seconds longer. Transfer to bowl with chives. Wipe out wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining tablessoon oil to the wok and heat over high heat until smoking. Add remaining pork, spread into a single layer, and cook without moving until lightly browned, about 45 seconds. Cook, tossing and stirring frequently until barely cooked through, about 30 seconds longer. Add garlic, ginger, and scallions, and cook, tossing constantly, until fragrant, about 30 seconds. Return other half of pork and chives to the wok and clear a small space in the center. Add remaining wine and soy sauce. Add white pepper. Toss to combine. Season to taste with more salt if necessary. Transfer to a serving platter and serve immediately.</p>"}]}