{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141027-smoreffle-daniel-shumski.jpg", "author": {"@type": "Person", "name": "Daniel Shumski"}, "recipeCuisine": "", "keywords": ["candy", "dessert", "s'more", "waffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Halloween Waffle-Iron S'mores (S'moreffles)", "link": "https://www.seriouseats.com/recipes/2014/10/waffle-iron-smores-smoreffles-recipe.html", "description": "Can you turn leftover Halloween candy into something that you might serve at the table as dessert? Yes, and this recipe for Halloween S'moreffles (s'mores waffles) is the proof. Based on the idea of s'mores, we start by making waffles designed to taste like graham crackers. Then, instead of filling them with chocolate and marshmallow, we fill it with chopped Halloween candy for similar effect.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Candy", "Chocolate", "Desserts", "Halloween"], "recipeIngredient": ["Nonstick cooking spray", "1/2 cup white whole wheat flour (see note)", "1/2 cup all-purpose flour", "1/4 cup firmly packed dark brown sugar", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "Pinch of cinnamon", "4 tablespoons unsalted butter, melted", "2 tablespoons milk", "1/4 cup honey", "1 tablespoon vanilla extract", "1 cup chopped Halloween candy (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat waffle iron. (If it has temperature controls, set it at medium.) Coat both sides of waffle iron grid with nonstick spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, combine both flours, brown sugar, baking soda, salt, and cinnamon. In a separate bowl, whisk together melted butter, milk, honey, and vanilla. Add wet ingredients to flour mixture and stir until a dough forms. Let mixture stand for 5 minutes. It will be much thicker than ordinary waffle batter, but not as thick as bread dough.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure out about 1/4 cup of batter and place it on one section of waffle iron. Repeat with another 1/4 cup of batter, to give you a top and a bottom for your \"s’moreffle sandwich.\" Close lid and cook until the waffles are still slightly soft but cooked throughout, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove waffles from waffle iron. They will be quite soft, so use care to keep them intact. Allow them to cool slightly. Repeat step 3 with remaining batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top one waffled graham cracker with a layer of chopped candy, leaving room around the edges for candy to melt and spread outward. Allow waffled graham cracker to sit for a minute and candy to melt slightly, then press candy into waffle with the back of a fork to compress it. Top with a second waffle and place the s'moreffle in the waffle iron on the side furthest from hinge. Close waffle iron and cook until candy melts, about 1 minute. Remove the s’moreffle. Repeat with remaining waffles and candy. Slice s'moreffles in half and serve.</p>"}]}