{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141029-downtown-italian-branzino-al-cartoccio-tara-donne.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["branzino", "Cook the Book", "downtown italian", "fish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Branzino Al Cartoccio From 'Downtown Italian'", "link": "https://www.seriouseats.com/recipes/2014/11/branzino-al-cartoccio-from-downtown-italian.html", "description": "Gabriel Thompson's branzino from his new cookbook, <a href=\"http://www.amazon.com/Downtown-Italian-Recipes-Inspired-Created/dp/1449450342/?tag=serieats-20\"><em>Downtown Italian</em></a>, written with Katherine Thompson and Joe Campanale, is as simple as it is sophisticated, and delivers his trademark clean, bold, bright flavor. Branzino fillets are laid over what is essentially a fregola (tiny, toasted balls of semolina pasta) and tomato salad, doused with olive oil, wrapped in parchment packets, and baked.", "totalTime": "50 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Fish", "Mains"], "recipeIngredient": ["4 ounces fregola pasta or Israeli couscous ", "1/2 teaspoon kosher salt, plus more for cooking grains", "3 1/2 tablespoons extra-virgin olive oil", "1 1/3 cups halved grape or cherry tomatoes", "3 tablespoons thinly sliced scallion", "2 tablespoons freshly squeezed lemon juice", "1 1/2 tablespoons minced fresh hot chili (red finger or red jalapeño)", "7 Alfonso or kalamata olives, pitted and roughly chopped", "1 1/2 teaspoons finely grated lemon zest", "4 (3- to 3 1/2-ounce) branzino fillets", "Freshly cracked black pepper", "4 sprigs thyme", "4 lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the fregola, bring a large pot of water to a boil. Season generously with salt. Taste the water and make sure that it tastes salty. Boil the fregola, stirring occasionally, until al dente, 8 to 10 minutes, depending on the size of the fregola. Drain thoroughly.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cooked fregola in a medium bowl and toss with 1 1/2 tablespoons of the olive oil. Add the tomatoes, scallion, lemon juice, chili, olives, lemon zest, and the 1/2 teaspoon salt. Toss together and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Season the fish fillets generously on both sides with salt and pepper. Arrange 4 pieces of parchment paper, each 12 inches by 17 inches, on a work surface. Fold each piece of parchment paper in half so that the sheets are approximately 12 inches by 8 1/2 inches. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open the parchment paper like a book and spoon one-quarter of the fregola salad onto one-half of each piece of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the fish fillets on top of the fregola, skin side up. Drizzle 1 1/2 teaspoons of olive oil over each piece of fish. Place one thyme sprig atop each fillet. Fold the parchment paper over the fish fillets to close the book. Starting at the short side of each book, roll or crimp the edges of the parchment to create a tightly sealed packet (it will look like a half-moon when you’re done). Place 2 fish packets on each of 2 baking sheets, leaving a little space between the packets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the fish packets for 15 minutes. Serve each packet, parchment paper and all, on a plate with a wedge of lemon. Let guests open their own packets by puncturing the top half of the parchment paper with a knife and fork, and drizzling the fish with freshly squeezed lemon juice.</p>"}]}