{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140606-294918-tex-mex-cheese-enchiladas-dried-red-chilies-2.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Tex-Mex", "keywords": ["cheese", "chili", "enchilada", "Mexican", "tex-mex"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Tex-Mex Cheese Enchiladas With Red Chili Gravy", "link": "https://www.seriouseats.com/recipes/2014/06/tex-mex-cheese-enchiladas-with-red-chili-gravy-recipe.html", "description": "Meet the ultimate, upgraded Tex-Mex Enchiladas: Tortillas, rolled up around a cheddar-based filling and completely enveloped by a rich red chili sauce, then topped with even more melted cheese. The sauce is rustic and aromatic, with a haunting cumin aroma and a heat from the chilies that doesn't attack so much as slowly tickle the back of your tongue. We've taken a few liberties, but they're worth it.", "totalTime": "1 to 2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Mains", "Mexican", "Tex-Mex"], "recipeIngredient": ["<strong>For the Chili Gravy:</strong>", "2 ounces dried Ancho chilies, stems and seeds removed", "2 ounces dried Guajillo chilies, stems and seeds removed ", "2 dried Arbol chilies, stems and seeds removed ", "Hot water, for soaking", "1/2 pound ground beef ", "1 medium yellow onion, roughly chopped ", "6 medium garlic cloves, minced ", "2 teaspoons ground cumin ", "1/2 teaspoon dried oregano", "1/2 teaspoon freshly ground black pepper ", "Kosher salt ", "4 cups chicken stock or low-sodium broth", "2 tablespoons vegetable oil", "2 tablespoons all-purpose flour", " ", "<strong>For the Cheese Enchiladas:</strong>", "1/2 cup vegetable oil ", "12 corn tortillas ", "1 pound cheddar cheese, grated, divided", "1 cup chopped yellow onion (from about 1 medium onion)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chili Gravy</strong>: Heat a heavy 12-inch cast iron skillet over medium heat. Cut all the chilies open along one side, so that they can be laid flat. Working in batches, cook chilies in the skillet, pressing down with a spatula, until lightly toasted and fragrant, about 5 seconds on each side; be careful not to let chilies burn. Transfer to a large bowl and cover chilies with hot water, setting a small plate on top to keep them submerged. Let stand 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add ground beef to cast-iron skillet and cook over medium heat, stirring often, until well browned, about 5 minutes. Using slotted spoon, transfer beef to a medium bowl and set aside. Remove all but 2 tablespoons of beef fat from skillet; if there isn’t enough fat leftover in the skillet, add enough oil to make up the difference. Add onions and cook, stirring occasionally, until soft, 4 to 5 minutes. Stir in mined garlic, and cook until fragrant, about 30 seconds. Transfer onion and garlic to a blender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain chilies, discarding all of the soaking liquid. Transfer chilies to the blender with onions and garlic, and add cumin, oregano, black pepper, 2 teaspoons of salt, and 1 cup chicken stock. Blend mixture until smooth, scraping down the sides with a spatula occasionally, about 1 to 2 minutes on high. If the mixture won’t blend, add another 1/2 cup of stock. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a wooden spoon or rubber spatula, press chili mixture through a mesh strainer set over a large bow until only chili skins remain in strainer. Discard skins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in cast-iron skillet over medium heat until shimmering. Add flour and stir immediately with a wire whisk. Continue to stir until roux turns light golden brown. Add chili mixture and stir in remaining broth and ground beef. Bring sauce to a boil, then reduce heat to maintain a slow and steady simmer. Cook, stirring occasionally, until sauce is dark red and thick like a gravy, about 30 minutes. If too thick, add a little water to thin it out. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, For the Cheese Enchiladas</strong>: Adjust oven rack to lower-middle position and preheat to 375&deg;F. Meanwhile, heat oil in a large skillet over medium-high until shimmering. Working 1 tortilla at a time, carefully slide tortillas into oil and cook, turning once, until just starting to look leathery, about 5 to 10 seconds per side; avoid frying too long, as overly crisp tortillas will crack when folded. Transfer the fried tortilla to a paper towel-line plate to drain. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working 1 tortilla at a time, dip fried tortilla into sauce, then transfer to a plate. Arrange 1/4 cup of cheese and 1 tablespoon chopped onions in a line along center of tortilla, then roll up. Set rolled tortilla, seam-side down, in a 9-by-11-inch baking pan and repeat with remaining tortillas, cheese, and onion.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon remaining sauce on top of enchiladas, followed by remaining cheese and onion. Transfer to the oven, and bake until cheese melts and just starts to bubble, 10 to 15 minutes. Serve immediately. </p>"}]}