{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140419-deviled-egg-variations-recipe-01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["appetizer", "deviled egg", "egg", "eggs benedict", "ham", "hollandaise", "hors d'oeuvre", "prosciutto", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Deviled Eggs Benedict (Ham and Brown Butter English Muffin Crumbs)", "link": "https://www.seriouseats.com/recipes/2014/05/deviled-eggs-benedict-recipe.html", "description": "The flavors of classic eggs Benedict&mdash;ham, butter, and toasted bread&mdash;all compressed into a bite-size hors d'oeuvre.", "totalTime": "30 minutes", "recipeYield": "Makes 8 deviled egg halves", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Deviled Eggs", "Eggs Benedict", "Ham", "Snacks"], "recipeIngredient": ["2 ounces thin-sliced prosciutto, pancetta, or jamón Serrano", "2 tablespoons butter", "1/2 cup fresh bread crumb", "Kosher salt and freshly ground black pepper", "6 <a href=\"http://www.seriouseats.com/recipes/2009/10/perfect-boiled-eggs-recipe.html\">hard boiled</a> or <a href=\"http://www.seriouseats.com/recipes/2014/04/steamed-hard-boiled-eggs-recipe.html\">hard steamed eggs</a>, peeled and halved lengthwise", "4 teaspoons juice plus 1/2 teaspoon zest from 1 lemon", "1 tablespoon mayonnaise", "1/4 teaspoon cayenne pepper", "2 tablespoons thinly sliced scallions or chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F. Lay ham between two silicone baking sheet liners or pieces of parchment paper and place on a rimmed baking sheet. Place a second baking sheet on top and place in oven. Cook until ham is well-rendered and golden brown (it will not be completely crisp but will crisp upon cooling), about 20 minutes. Remove from oven and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat butter in a medium skillet over medium-high heat until foaming subsides. Continue to cook, swirling, until nutty brown in color. Immediately add bread crumbs and toss to combine. Reduce heat to medium and cook, tossing frequently, until golden brown and crisp. Season to taste with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add lemon juice and zest mayonnaise, and cayenne pepper to bowl and, using a sturdy whisk, mash and stir together until thoroughly combined. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap). Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Break ham into chips. Garnish deviled eggs with bread crumbs, ham chips, and slice scallions. Serve immediately.</p>"}]}