{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/1_40_A_SoupAuPistou_v1-493.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "French", "keywords": ["basil", "bean", "buvette", "Cook the Book", "French", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Soupe au Pistou From 'Buvette: The Pleasure of Good Food'", "link": "https://www.seriouseats.com/recipes/2014/08/soupe-au-pistou-from-buvette-the-pleasure-of-good-fo.html", "description": "This vegetable soup from Jody Williams' cookbook, <a href=\"http://www.amazon.com/Buvette-The-Pleasure-Good-Food/dp/1455525529/?tag=serieats-20\"><em>Buvette: The Pleasure of Good Food,</em></a> is impeccable&mdash;clean, light, and nourishing. Topped with a spoonful of heady pistou, it's the epitome of the harmony that can happen with a thoughtful collision of fresh ingredients.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Cook the Book", "French", "Mains", "Sides", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["1 cup dried cannellini beans, soaked overnight and drained", "1 cup dried cranberry beans, soaked overnight and drained", "2 celery stalks, diced", "2 large carrots, peeled and diced", "1 medium yellow onion, peeled and diced", "1 fennel bulb, including the light green stems, diced", "One 15-ounce can whole peeled tomatoes, seeded and chopped", "6 large outer escarole leaves, torn into pieces", "1 large handful green beans, trimmed and cut in half crosswise", "1 leek, white and light green parts only, thinly sliced", "2 small zucchini, diced", "Pinch red chili flakes, plus more as needed", "Coarse salt", "2 cups fresh basil leaves, washed and dried", "1/2 cup extra-virgin olive oil, plus more for serving", "1/2 cup grated Parmigiano-Reggiano cheese, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the soaked beans, all of the vegetables, the chili flakes, and 2 teaspoons of salt into a large soup pot and cover with cold water. Add 2 additional cups of water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the mixture to a boil, lower the heat, and allow it to simmer until the beans are tender, about 1 hour, adding more water as the soup cooks if it gets too dry or too thick at any point. Season the soup to taste with additional salt and chili flakes, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place the basil leaves in a mortar and use a pestle to crush them with 2 teaspoons of salt. Work in the Parmigiano-Reggiano and the olive oil to make a coarse paste. Alternatively, you can pulse the basil, salt, and Parmigiano-Reggiano together in a food processor and stream in the olive oil to make the paste. Either way, season the pistou with additional salt, if necessary, and set it aside. A thin layer of olive oil poured on top will prevent the pistou from browning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the soup hot, topped with a generous drizzle of olive oil, a big spoonful of the pistou, and a handful of grated Parmigiano-Reggiano.</p>"}]}