{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140328-macaroni-and-cheese-waffles-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["macaroni and cheese", "waffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4444444444444", "ratingCount": "9"}, "name": "Macaroni and Cheese Waffles", "link": "https://www.seriouseats.com/recipes/2014/04/macaroni-and-cheese-waffles-jkla.html", "description": "Waffled macaroni and cheese might not rank quite as high on the list of \"things you must try before you die\" as, say, a fresh-from-the-water oyster, or a sliver of Parmesan sliced off of a wheel that has just been opened in front of your eyes, or skinny dipping in mixed company, but it's certainly good enough that it should immediately make your list of second-tier priorities. That is, of course, if you do it right.", "totalTime": "1 hour", "recipeYield": "Makes 4 waffles", "recipeCategory": ["Mac and Cheese", "Snacks", "Vegetarian"], "recipeIngredient": ["1 pound dried macaroni", "Kosher salt", "2 tablespoons butter, plus more for greasing baking sheet", "1 tablespoon flour", "1 cups whole milk", "Dash hot sauce, plus more for serving", "1 teaspoon mustard", "1 1/4 pounds grated cheddar cheese", "Maple syrup for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pasta in a large pot and cover with lukewarm water by 2 inches. Add 2 tablespoons salt. Bring to a boil over high heat, stirring occasionally, and cook until pasta is tender, about 6 minutes after coming to a boil. Drain pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pasta cooks, heat butter in a large Dutch oven over medium heat until melted. Add flour and cook, stirring, until pale golden blond. Slowly whisk in whole milk. Whisk in hot sauce and mustard. Bring to a simmer. Reduce heat to low and stir in 3/4 pounds grated cheese. Stir until melted. If smoother texture is desired, transfer to a blender and blend on high speed until glossy and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When pasta is cooked, add cheese sauce and stir to combine. Pour mixture into a greased rimmed baking sheet and flatten with a spatula. Refrigerate until completely set, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a waffle iron. Carefully cut macaroni and cheese into 8 even squares.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a wide spatula, carefully lift one square and plate it on a cutting board. Cover top with 1/4 of remaining cheese. Place another square of macaroni on top of cheese, creating a sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place sandwich in waffle maker. Close and cook until golden brown on both sides and cheese has crisped up, about 6 minutes. Remove from waffle iron and serve with syrup and hot sauce. Repeat steps 4 through 6 for remaining waffles.</p>"}]}