{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140703-ideas-in-food-clam-sauce-CryoShuckedClams.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["clam", "seafood", "shellfish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cryo-Shucked Clams", "link": "https://www.seriouseats.com/recipes/2014/07/cryo-shucked-clams-recipe.html", "description": "Want to cook clams without their shells but don't know how to shuck them? This freezer method is the perfect solution, and requires no special knife- or shucking-skills.", "totalTime": "5 hours plus overnight freezing", "recipeYield": "Makes 50 shucked clams", "recipeCategory": ["Clams, Mussels, and Oysters"], "recipeIngredient": ["13 1/3 cups (3000 grams) water", "5 tablespoons (90 grams) fine sea salt", "50 littleneck clams, rinsed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine water and salt and stir until salt is dissolved. Transfer one-third of brine to another large bowl and add clams. Set clams in refrigerator and let soak for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain clams, then rinse clams and bowl. Return clams to bowl, add half of remaining brine and transfer to refrigerator to soak for 30 more minutes. Drain and repeat once more with remaining brine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange clams in a single layer on a rimmed baking sheet and freeze overnight or up to 1 week, wrapping with plastic wrap once clams are frozen solid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to shuck, transfer clams to refrigerator to thaw; the clams will pop open as they thaw. Using a spoon, pry open clam shells fully and scoop them into a bowl set over another bowl filled with ice; be sure to catch all of the clam juice in the bowl as you shuck the clams. Pour any extra clam liquid in the baking sheet into the bowl of clams.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pair of scissors, trim around the belly and foot sections (the soft, round center area and firm adjacent meat) of each clam. Transfer belly (also known as the visceral mass) and foot to a small bowl, cover with plastic, and refrigerate until ready to use. Add trimmings to the bowl of clam juice; cover and refrigerate until ready to use.</p>"}]}