{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141210-baking-chez-moi-buche-de-noel-alan-richardson.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["baking chez moi", "buche de noel", "cake", "Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gingerbread Buche de Noel From 'Baking Chez Moi'", "link": "https://www.seriouseats.com/recipes/2014/12/gingerbread-buche-de-noel-from-baking-chez-moi-dorie-greenspan.html", "description": "Among the plethora of simple, straightforward French desserts that fill the pages of Dorie Greenspan's new <a href=\"http://www.amazon.com/Baking-Chez-Moi-Recipes-Anywhere/dp/0547724241/?tag=serieats-20\"><em>Baking Chez Moi,</em></a> there is a handful of more involved desserts, and those she reimagines in her own way. Her Gingerbread Buche de Noel is both. Yule logs are a staple of the French holiday season, but this version seems quite American, with it's cream cheese filling and sweet meringue frosting.", "totalTime": "3 hours", "recipeYield": "Serves 12", "recipeCategory": ["Cakes", "Cook the Book", "Desserts"], "recipeIngredient": ["<strong>For the praline</strong>", "1 cup (120 grams) pecan halves or pieces", "1/3 cup (67 grams) sugar", "1/4 cup (60 ml) water", "&nbsp;", "<strong>For the cake</strong>", "3/4 cup (102 grams) all-purpose flour", "1/4 cup (32 grams) cornstarch, sifted", "3/4 teaspoon ground cinnamon", "3/4 teaspoon ground ginger", "1/4 teaspoon fine sea salt", "1/4 teaspoon freshly ground black pepper", "6 large eggs", "3/4 cup (150 grams) packed light brown sugar", "1/2 stick (4 tablespoons; 2 ounces; 57 grams) unsalted butter, melted and cooled", "Confectioners’ sugar, for dusting and rolling", "&nbsp;", "<strong>For the filling</strong>", "8 ounces (227 grams) cream cheese, at room temperature", "1 stick (8 tablespoons; 4 ounces; 113 grams) unsalted butter, at room temperature", "Pinch of fine sea salt", "1/2 teaspoon ground cinnamon", "2 teaspoons pure vanilla extract", "&nbsp;", "<strong>For the frosting</strong>", "1/2 cup (120 ml) egg whites (about 4 large)", "1 cup (200 grams) sugar", "3/4 teaspoon cream of tartar", "1 cup (240 ml) water", "1 tablespoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the praline:</strong> Center a rack in the oven and preheat the oven to 350 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment or a silicone baking mat and spread the pecans out on the baking sheet. Bake the nuts for 3 minutes (you want to heat, not toast, them), stir them around and then put them in a warm spot while you cook the sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the sugar in a small saucepan and pour over the water. Swirl to moisten the sugar, then put the pan over medium-high heat. Cook the sugar, washing down the sides of the pan if needed with a pastry brush dipped in cold water, until the sugar turns a medium amber color. (Stay close; sugar changes color quickly.) Turn off the heat, add the nuts to the saucepan (set the lined baking sheet aside) and stir a few times with a heatproof spatula or a wooden spoon, just to coat the nuts with syrup. Pour the caramelized nuts out onto the baking sheet and use the spatula, spoon or an offset metal spatula to spread them out. If they won’t spread out, no matter&mdash;you’re going to chop them anyway. Let cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>(The praline can be made up to a day ahead, packed in a container and kept in a cool, dry place&mdash;moisture is praline’s nemesis.) Finely chop 1/2 cup of the praline; coarsely chop the remainder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cake:</strong> Center a rack in the oven and preheat the oven to 350 degrees F. Line a 12-×-17-inch rimmed baking sheet with a piece of parchment paper. Butter the paper, dust with flour and tap out the excess.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flour, cornstarch, cinnamon, ginger, salt and pepper together in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have a wide skillet about one-third full of simmering water on the stove. Working in the bowl of a stand mixer, or in a heatproof bowl in which you can use a hand mixer, whisk together the eggs and brown sugar. Set the bowl in the pan of simmering water (pour off some water if you’re concerned that it will slosh over the sides) and whisk nonstop until the mixture is very warm to the touch, about 2 minutes. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’re using a stand mixer, attach the bowl to the stand and fit it with the whisk attachment, or use a hand mixer. Working on high speed, beat the sugared eggs until they are thick and pale, have more than doubled in volume and have reached room temperature, 7 to 10 minutes. Switch to a flexible spatula and fold in the flour mixture in 2 additions. Be as delicate as you can and don’t be overly thorough now&mdash;you’re going to continue to fold when the butter goes in. Put the melted butter in a small bowl, scoop a big spoonful of the batter over it and stir. Turn this mixture out onto the batter in the bowl and fold it in: Cut deep into the center of the bowl and search the bottom for unincorporated flour&mdash;find it and fold it. Scrape the batter out onto the prepared baking sheet and spread it evenly with an offset spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 13 to 15 minutes, or until the cake is golden brown, lightly springy to the touch and starting to pull away from the sides of the baking sheet. Transfer the baking sheet to a cooling rack, but keep it on the rack for no more than 5 minutes; you want to roll the cake while it’s hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a cotton or linen kitchen towel (not terrycloth or microfiber) on the counter and dust it generously with confectioners’ sugar. Run a table knife around the sides of the cake and invert the cake onto the towel. Carefully peel away the parchment. Lightly dust the cake with confectioners’ sugar and replace the parchment, putting the clean side against the cake (or use a new piece). Starting at a short end, roll the cake into a log; this is a preroll, so it doesn’t have to be tight or perfect. If the cake cracks, keep rolling&mdash;the filling and frosting will patch everything. Return the rolled-up cake (still in its towel) to the rack and let it cool, seam side down, to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, make the filling:</strong> Put the softened cream cheese, butter and salt in the bowl of a stand mixer fitted with the paddle attachment, or work in a large bowl with a hand mixer. With the mixer on medium speed, beat until the cream cheese and butter are homogeneous and smooth. Beat in the cinnamon and vanilla. If you’re going to use the filling now, stir in the 1/2 cup finely chopped praline; if not, wait until you’re ready to fill the Yule log. Transfer to a bowl, cover and refrigerate. (You can make the filling&mdash;without the praline&mdash;up to 2 days ahead and keep it well covered in the refrigerator.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To fill the log:</strong> If the filling has been chilled, give it a good whisking to return it to a spreadable consistency; add the praline if you haven’t already done so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unroll the log and carefully remove the parchment; leave the cake on the kitchen towel. Beginning with a short end, gently roll up the cake, peeling away the towel as you go. Unroll the cake onto the towel or a clean piece of parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the filling across the surface of the cake, leaving a scant 1-inch border uncovered on the long sides. Again starting from a short side, roll up the cake, leaving the towel or parchment behind and trying to get as tight a roll as you can. If you’d like, tighten the log using the paper-and-ruler technique. Place the cake on a parchment-lined cutting board, cover it and chill it for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, make the frosting:</strong> Put the egg whites in the clean, dry bowl of a stand mixer fitted with the whisk attachment or in a large bowl that you can use with a hand mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir the sugar, cream of tartar and water together in a small saucepan. Bring to a boil over medium-high heat, then cover and boil for about 3 minutes. Uncover, attach a candy thermometer to the pan and cook until the thermometer reads 242 degrees F (this can take almost 10 minutes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sugar reaches 235 degrees F, begin beating the whites on medium speed. If you get to the point where the whites look like they’re about to form stiff peaks and the syrup isn’t at 242 degrees F yet, lower the mixer speed and keep mixing until the sugar is ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At 242 degrees F, with the mixer on medium speed, stand back and carefully and steadily pour the hot syrup into the bowl. Try to get the syrup between the side of the bowl and the whisk. Perfection is impossible, so ignore any spatters; don’t try to stir them into the frosting. Add the vanilla and keep beating until the frosting cools to room temperature, about 5 minutes. You’ll have a shiny, marshmallow frosting, which you should spread now.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To frost and finish the log:</strong> Remove the cake from the refrigerator. You can frost it on the cutting board and then transfer it to a serving platter or put it on the platter now. To keep the platter clean during frosting, tuck strips of parchment under the log, putting just a sliver of the parchment under the cake and leaving the lion’s share to protect your platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the ends of the log look ragged, trim them. Using an offset spatula, table knife or the back of a spoon, swirl the frosting all over the cake in a thick layer. Refrigerate for at least 1 hour to set the frosting and firm up the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the cake with the remaining coarsely chopped praline before serving.</p>\n\n<p></p>\n\n<p><strong>Serving:</strong> Bringing the cake to the table is its own dramatic event, but there’s no reason not to add to the drama by making it the sole event. Instead of waiting to serve the log après dinner, have an afternoon holiday party and serve just the cake and Champagne. It’s a very chic way to say Merry Christmas!</p>\n\n<p>And just because it’s called a bûche de Noël doesn’t mean you can’t stud it with candles and call it a birthday cake.</p>\n\n<p><strong>Storing:</strong> Covered lightly and kept away from foods with strong odors, the cake will keep in the refrigerator for up to 2 days. Serve it chilled.<br />\n</p>"}]}