{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140818-tomato-sauce-danielgritzer-4.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["essential", "Italian", "pasta", "sauce", "summer", "tomato", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9", "ratingCount": "20"}, "name": "The Best Fresh Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2014/08/the-best-fresh-tomato-sauce-for-pasta-recipe.html", "description": "The key to this amazingly rich yet fresh-tasting sauce, made from perfect summertime tomatoes, is that it's a blend of three different sauces. A homemade oven-baked tomato paste is deeply sweet and rich, a classic tomato sauce provides bulk and flavor, and finally, a splash of barely cooked tomato purée guarantees the bright, fresh, fruity taste of vine-ripened tomatoes. Served on pasta, it's so flavorful you won't even need cheese on top.", "totalTime": "6 hours", "recipeYield": "Makes about 1 to 2 gallons (3.8 to 7.6L) of sauce, depending on the tomatoes", "recipeCategory": ["Baking", "Condiments and Sauces", "Gluten-Free", "Italian", "Stovetop", "Summer", "Tomato", "Vegetables", "Vegetarian"], "recipeIngredient": ["10 pounds (4.5kg) ripe plum tomatoes, preferably mixed varieties (such as Romas, Amish Pastes, and San Marzanos), cut into large chunks, plus 15 pounds (6.8kg) ripe mixed tomatoes, mostly plums with a small portion of other tomatoes (such as beefsteaks), cut into large chunks", "3 tablespoons (45ml) extra-virgin olive oil, plus more for greasing", "1 large yellow onion, minced (see note)", "3 medium cloves garlic, minced (see note)", "2 large sprigs fresh basil", "1 small tomato plant cutting with about 5 leaves (optional)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large stockpot, heat the 10 pounds plum tomatoes, covered, over high heat, stirring occasionally, until tomatoes dump their liquid. Bring to a boil in covered pot, stirring occasionally, and cook until tomatoes are softened, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 275&deg;F (135&deg;C) and grease several rimmed baking sheets and/or baking dishes with oil. Using a food mill or a stand mixer's vegetable strainer attachment, pass cooked plum tomatoes and all their liquid into a large heatproof container. Discard skins and seeds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour plum tomato purée into rimmed baking sheets and/or baking dishes, being careful not to overfill them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully transfer baking sheets and dishes to oven and bake, checking every 15 minutes and stirring once purée begins to thicken, until a thick, spreadable tomato paste forms, at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fill the same large stockpot with remaining 15 pounds mixed tomatoes and cook, covered, over high heat, stirring occasionally, until tomatoes dump their liquid. Bring to a boil in covered pot, stirring occasionally, and cook until tomatoes are softened, about 10 minutes. (Work in batches if your pot can't hold all 15 pounds at once.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using food mill or stand mixer's vegetable strainer attachment, pass cooked mixed tomatoes and all their liquid into a large heatproof container. Discard skins and seeds. Measure out 1 quart (900ml) mixed-tomato purée and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons (45ml) olive oil in a large, wide saucepan over medium heat until shimmering. Add onion and garlic and cook, stirring occasionally, until softened and sweet, about 8 minutes. Add remaining mixed-tomato purée and simmer, stirring occasionally, until reduced to a sauce-like consistency, 35 to 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat; stir in basil and tomato-plant cutting, if using; and let steep for 5 minutes. Discard basil and tomato-plant cutting. Stir in oven-dried tomato paste and reserved tomato purée and season with salt. Use as desired or freeze.</p>"}]}