{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141116-deep-fried-turkey-indoors-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["low carb", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Basic Deep-Fried Turkey", "link": "https://www.seriouseats.com/recipes/2014/11/basic-deep-fried-turkey-recipe.html", "description": "Deep-frying a turkey is a bit of an undertaking, but the result is a juicy bird with potato-chip-crisp skin. Follow closely the instructions provided with your turkey fryer, and use caution: It's risky to work with so much hot oil.", "totalTime": "1 hour", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Deep Frying", "Gluten-Free", "Mains", "Thanksgiving", "Turkey", "Winter"], "recipeIngredient": ["1 turkey, about 12 pounds (5.5kg), giblets removed, patted dry", "2 to 4 gallons (7.8 to 15L) peanut oil", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using an Outdoor Frying Rig:</strong> Place turkey on frying rig according to manufacturer's instructions, with legs pointing down. Add to empty frying vessel. Add water, measuring as you go, until turkey is barely submerged. Remove turkey and dry well with paper towels. Discard water and dry frying pot well, then fill with equivalent amount of oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ignite turkey fryer and heat oil to 350&deg;F (177&deg;C). Turn off gas completely and slowly lower turkey into hot oil (process should take at least 1 1/2 minutes). When turkey is fully submerged, reignite turkey fryer and adjust flame to maintain steady 325 to 350&deg;F (163 to 177&deg;C). Fry until an instant-read thermometer inserted into coolest part of breast registers 145&deg;F (63&deg;C), about 25 minutes. Allow excess oil to drip back into pot, transfer turkey to a clean disposable aluminum tray or rimmed baking sheet, season with salt and pepper, and allow to rest at least 10 minutes before carving and serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using an Indoor Turkey Fryer:</strong> Add oil to fryer, being sure not to surpass maximum fill line. Set fryer to 350&deg;F (177&deg;C) and preheat oil. When oil is heated, follow manufacturer's instructions for frying turkey. Monitor oil temperature during frying. If it drops and stays below 300&deg;F (150&deg;C), remove turkey and allow oil to come back up to 350&deg;F before continuing. Fry until an instant-read thermometer inserted into coolest part of breast registers 145&deg;F, about 25 minutes. Season turkey with salt and pepper and allow to rest for at least 10 minutes before carving and serving.</p>"}]}