{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140916-easy-pan-seared-crispy-fish-food-lab-04.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "fish", "quick", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "The Easiest Crispy Pan-Seared Fish", "link": "https://www.seriouseats.com/recipes/2014/09/the-easiest-crispy-pan-seared-fish-food-lab-recipe.html", "description": "Fish is notoriously tricky to pan-sear. It inevitably ends up sticking to the pan or turning tough and stringy on its surface. This method&mdash;breading it on just one side&mdash;solves both of these problems with one easy stroke, all while adding some textural contrast.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Fish", "Mains", "The Food Lab"], "recipeIngredient": ["4 thick white fish filets or steaks (such as halibut, striped bass, sea bass, or swordfish), 5 to 8 ounces each", "Kosher salt and freshly ground black pepper", "1/2 cup all-purpose flour", "1 large egg, beaten", "1 1/2 cups panko-style bread crumbs (see note)", "3 tablespoons vegetable, canola, or peanut oil", "Lemon wedges or tartar sauce (either <a href=\"http://www.seriouseats.com/2012/08/taste-test-bottled-tartar-sauce.html\">store-bought</a> or <a href=\"http://www.seriouseats.com/recipes/2012/08/tartar-sauce-recipe.html\">homemade</a>) for serving."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 300&deg;F. Pat fish dry on paper towels and season generously with salt and pepper. Place flour, egg, and breadcrumbs in three separate shallow bowls or plates. Season each gently with salt and pepper. Working one piece at at time, lift fish and dip, presentation-side-down, in the flour, followed by the egg, followed by the breadcrumbs, pressing down firmly until a thick layer of breadcrumbs adheres. Place fish breaded-side-up on a clean plate and repeat with remaining fish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large non-stick or cast iron skillet over medium heat until shimmering. Add fish pieces, breaded-side-down and cook, swirling and rotating them around the pan until deep golden brown, about 5 minutes. Carefully flip fish and transfer to oven. Cook until an instant-read thermometer inserted into the deepest part of the fish registers 140&deg;F, about 5 minutes (a knife or a cake tester inserted into the fish should show no resistance). Serve immediately with lemon wedges or tartar sauce.</p>"}]}