{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140522-soft-shell-crab-sandwich-tomato-salsa.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["crab", "sandwich", "seafood", "soft shell crab", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Butter-Sautéed Soft-Shell Crab Sandwiches With Tomato Salsa", "link": "https://www.seriouseats.com/recipes/2014/05/butter-sauteed-soft-shell-crab-sandwiches-recipe.html", "description": "The classic Maryland-style soft-shell crab sandwich usually comes on white sandwich bread with mayo, sliced tomato, and lettuce. In this variation inspired by the original, we add a delicious tomato salsa made from oven-dried tomatoes, olive oil, basil, and red wine vinegar.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Lobster and Crab", "Sandwiches", "Tomato"], "recipeIngredient": ["1 (15-ounce) can whole tomatoes, drained, tomatoes halved and seeds discarded", "1/4 cup loosely packed basil leaves, very thinly sliced", "3 tablespoons extra-virgin olive oil", "1 tablespoon red wine vinegar", "Generous pinch sugar", "Kosher salt and freshly ground black pepper", "1 cup all-purpose flour", "1/2 tablespoon Old Bay Seasoning", "8 large soft-shell crabs, preferably jumbo or “whale” size, <a href=\"http://www.seriouseats.com/2014/05/how-to-clean-soft-shell-crabs.html\">cleaned</a>", "4 tablespoons unsalted butter", "8 (1/2-inch-thick) slices boule or rustic bread", "6 tablespoons mayonnaise", "Sliced tomato, sliced white onion, and Bibb lettuce leaves, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 300&deg;F. Arrange tomato halves on rimmed baking sheet and bake until excess moisture has evaporated and tomatoes are a deeper red color, about 30 minutes. Let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop tomatoes and transfer to a medium mixing bowl. Stir in basil, olive oil, vinegar, and sugar. Season tomato salsa with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow bowl, stir together flour and Old Bay; season with salt and pepper. Lightly dredge crabs in the seasoned flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, wide skillet, melt the butter over medium-high heat until foamy. Add crabs, shell-side down, and cook until browned and crisp, about 3 minutes; be careful, as soft-shell crabs sometimes pop in the pan. Flip crabs and cook until crisp and golden on bottom side, about 3 minutes. Transfer crabs to paper-towel-lined plates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread 4 bread slices with mayonnaise, then top with lettuce leaves, crabs, tomato salsa, sliced tomatoes, and onion. Close sandwiches and serve immediately.</p>"}]}