{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141126-bar-tartine-pickled-mushrooms-chad-robertson.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["bar tartine", "Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Red Wine Vinegar From 'Bar Tartine'", "link": "https://www.seriouseats.com/recipes/2014/12/red-wine-vinegar-from-bar-tartine.html", "description": "This red wine vinegar from Cortney Burns and Nicolaus Balla's new cookbook, <a href=\"http://www.amazon.com/Bar-Tartine-Techniques-Cortney-Burns/dp/1452126461 /?tag=serieats-20\"><em>Bar Tartine: Techniques and Recipes,</em></a> could also be made with white or fortified wine.", "totalTime": "At least 8 months", "recipeYield": "Makes 1 qt/960 ml", "recipeCategory": ["Condiments and Sauces", "Cook the Book"], "recipeIngredient": ["4 cups/960 ml red, white, or fortified wine ", "2 tbsp vinegar starter (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Vinegar always begins with a base of alcohol. There is the option to start with a pre-fermented base of wine, beer, spirits, or sake. Alternatively, the alcoholic base can be made instead of purchased by using juice, sugar, fruit scraps, beer mash, or sake mash and then allowing it to ferment. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To turn an alcoholic base into vinegar, pour the mixture into a wide-mouthed container, filling it three-fourths full. If using a vinegar starter, add it at this stage. Cover the open rim with cheesecloth; oxygen is vital for this part of the fermentation. Leave the top uncapped, as it needs oxygen to sour. Let stand in a dark spot at room temperature, between 68° and 72°F/20° and 22°C, tasting every week or so, until the vinegar is acidified to your liking, 2 to 4 months. When the acidity is where you like it, cap the bottle and continue to age at room temperature to mellow the acidity, about 6 months or so, before using. The vinegar will keep at room temperature indefinitely. If a mass forms, discard it; it is a harmless by-product of the fermentation process. Always start with good-quality ingredients. Bad wine and bland fruit do not make delicious vinegar. The same is true with beer; we avoid hoppy beers as hops can inhibit the fermentation process.</p>"}]}