{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140917-singapore-soft-eggs-kaya-toast-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "coconut", "easy", "egg", "quick", "singapore", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Singapore-Style Soft-Cooked Eggs With <em>Kaya</em> Jam and Toast", "link": "https://www.seriouseats.com/recipes/2014/09/singapore-style-soft-cooked-eggs-with-kaya-jam-and-toast-recipe.html", "description": "For years, one of my favorite late night snacks has been a soft-cooked egg which I break into a bowl, drizzle with soy sauce and pepper, stir up, and slurp down as silently as possible in the dim light of the kitchen, trying not to wake my wife. I always thought I was a little weird in loving it so much. But then I found vindication in one of Singapore's staple breakfasts: kaya toast served with soft boiled eggs and strong coffee sweetened with sugar and evaporated milk (the soy sauce and pepper are added at your own discretion).", "totalTime": "15 minutes (plus 4 hours to make kaya jam if not already made)", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Coconut", "Eggs", "Father's Day", "Mother's Day", "Vegetarian"], "recipeIngredient": ["2 1/2 quarts of water", "9 eggs", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/03/kaya-jam-recipe.html\">Kaya Jam</a>", "8 slices toasted bread", "dark soy sauce, light soy sauce, and white pepper for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring water to a rapid boil in a large saucepan with a tight fitting lid. Remove from heat and immediately and add eggs by gently lowering with a slotted spoon. Cover and cook for 5 minutes. Remove one egg from saucepan and carefully crack into a small bowl. If egg is cooked perfectly with no transparent whites, remove other eggs from saucepan. If necessary, allow other eggs to remain for 1 to 2 minutes longer. When ready, remove eggs from water with a slotted spoon. (See note)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread kaya jam over four slices of toast and close with remaining four slices. Cut into triangles or fingers. Serve toast and kaya jam with eggs, along with dark and light soy sauces and white pepper for seasoning.</p>"}]}