{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140806-Zucchini-Pepperoni-Parmesan-Stacks-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Italian", "keywords": ["cheese", "Italian", "peperoni", "tomato", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Zucchini Stacks in the Style of Eggplant Parmesan", "link": "https://www.seriouseats.com/recipes/2014/08/zucchini-eggplant-parmesan-recipe.html", "description": "This take on eggplant Parmesan uses zucchini in place of the eggplant. Rather than bake the breaded, pan-fried disks as one big layered mass in a baking dish, this version features little individual stacks of alternating layers of pepperoni, a tomato sauce, fresh basil, and a combination of mozzarella and Parmesan cheeses. The result is something both homey and company-worthy at once.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Italian", "Mains", "Sunday Supper", "Tomato", "Zucchini"], "recipeIngredient": ["<strong>For the Sauce:</strong>", "1 tablespoon extra-virgin olive oil", "1 tablespoon minced yellow onion", "2 medium cloves garlic, minced", "1 (14.5-ounce) can crushed tomatoes", "2 tablespoons tomato paste", "1/4 cup dry white wine", "1 1/2 teaspoons balsamic vinegar", "Kosher salt and freshly ground black pepper", "&nbsp;", "<strong>For the Stacks:</strong>", "12 (3/4-inch-thick) zucchini rounds from 2 large zucchini (see note)", "2 large eggs", "2 cups breadcrumbs", "1 cup freshly grated Parmesan cheese", "Extra-virgin olive oil, for frying", "1/4 pound pepperoni, sliced very thin", "2 cups shredded mozzarella", "1/2 cup freshly grated Parmesan cheese", "1/2 cup torn fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Heat oil in a medium skillet over medium heat. When oil is shimmering, add onion and garlic and cook, stirring, until softened and translucent, about 7 minutes. Stir in tomatoes, tomato paste, wine, and vinegar and bring to a simmer. Season with salt and pepper. Reduce heat to low and simmer for 20 minutes, stirring periodically. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Stacks:</strong> Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. Whisk eggs in a shallow wide bowl. Toss together breadcrumbs with Parmesan on a large plate; season breadcrumbs with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a medium saucepan with 1/8 inch oil and heat over medium-high heat until shimmering. Meanwhile, working in batches, dunk zucchini slices in egg wash, shaking off excess, then dredge in breadcrumb mixture. Fry zucchini, turning once, until golden brown on both sides, about 6 minutes total. Drain on a paper-towel-lined plate. Repeat with remaining zucchini rounds, egg wash, and breadcrumbs, adding additional oil to saucepan as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray an 8- by 8-inch baking dish with nonstick cooking spray. Arrange 4 rounds of fried zucchini in dish, spacing them apart evenly. Arrange a single layer of pepperoni slices on top of each zucchini round. Top pepperoni with a dollop of tomato sauce, then sprinkle a small amount of both cheeses and basil on top. Repeat with another layer of fried zucchini, followed by pepperoni, tomato sauce, cheeses, and basil. Finish each stack with the remaining 4 fried zucchini rounds and top with spoonfuls of tomato sauce. Nestle the stacks against one another or against the side of the baking dish so they don’t slide apart while cooking; alternatively, use wads of aluminum foil to help support each stack. Bake zucchini stacks for 12 minutes. Top each stack with the remaining cheeses and bake until just tender, about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn on the broiler and move oven rack to middle position. Broil zucchini stacks until cheese is browned and bubbly on top and the zucchini slices are fully tender, about 5 minutes. Let rest for 5 minutes. Serve immediately, garnished with a shower of the remaining basil.</p>"}]}