{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141007-quick-kimchi-ramen-daniel-gritzer07.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Korean", "keywords": ["Asian", "Japanese", "kimchi", "Korean", "noodle", "ramen", "ramyun", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Quick Kimchi Ramen With Shiitake Mushrooms and Soft-Cooked Egg", "link": "https://www.seriouseats.com/recipes/2014/10/quick-kimchi-ramen-shiitake-mushroom-egg-recipe.html", "description": "Making real-deal ramen is a lengthy project that requires planning in advance. But there are days when you just want a delicious bowl of it, without the fuss. This easy Korean-style kimchi ramen is for those times. It's loaded with flavor, but takes less than an hour to throw together, thanks to several umami-rich ingredients and a cool baking-soda trick that turns angel-hair pasta into ramen-like noodles.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Japanese", "Korean", "Mains", "Ramen", "Soups and Stews"], "recipeIngredient": ["4 tablespoons canola, vegetable, or other neutral oil, divided", "8 ounces shiitake mushrooms, <a href=\"http://www.seriouseats.com/2010/12/knife-skills-how-to-cut-mushrooms.html\">stems removed and caps sliced</a>", "Kosher salt", "1 medium yellow onion, finely diced", "1 (1-inch) piece fresh ginger, peeled and minced", "5 medium cloves garlic, minced (about 5 teaspoons)", "3 quarts <a href=\"http://www.seriouseats.com/2014/10/how-to-make-rich-flavorful-easy-chicken-stock.html\">gelatinous chicken stock</a> (see note)", "1 packed cup kimchi, chopped, plus 6 tablespoons kimchi liquid", "2 tablespoons miso", "2 tablespoons soy sauce", "4 tablespoons baking soda (if using angel hair pasta)", "1 (500-gram) box angel hair pasta or 4 servings ramen-style noodles", "4 <a href=\"http://www.seriouseats.com/recipes/2014/04/steamed-hard-boiled-eggs-recipe.html\">soft-boiled eggs</a>, halved, for serving", "2 scallions, white and light green parts only, <a href=\"http://www.seriouseats.com/2014/05/knife-skills-how-to-slice-scallions.html\">very thinly sliced</a>", "Nori (Japanese seaweed sheets), for serving", "Watercress or other tender leafy green, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan or Dutch oven, heat 2 tablespoons oil over medium-high heat until shimmering. Add shiitake, season with salt, and cook, stirring occasionally, until mushrooms have released their water and are starting to brown all over, about 4 minutes. Transfer shiitake to a plate and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 2 tablespoons oil to saucepan, then add onion, ginger, and garlic. Cook, stirring up any brown bits on bottom of saucepan, until onions are soft and translucent, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add stock and bring to a simmer. Stir in kimchi and its liquid, miso, and soy sauce and return to a simmer. Season with salt, if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, if using angel-hair pasta, add baking soda to 4 quarts of boiling salted water; otherwise, omit baking soda and bring 4 quarts of plain salted water to a boil. Cook noodles until al dente; drain completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer noodles to bowl and spoon kimchi broth on top. Top each bowl with 2 egg halves, reserved shiitakes, scallions, nori, and watercress. Serve right away.</p>"}]}