{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140723-loukaniko-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["greek", "grill", "grilling", "leek", "orange", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Orange and Leek Loukaniko (Greek Sausage)", "link": "https://www.seriouseats.com/recipes/2014/08/orange-leek-loukaniko-recipe.html", "description": "Greek loukaniko with orange and leeks is a brightly flavored sausage that's perfect for summer grilling.", "totalTime": "3 days", "recipeYield": "Makes 5 pounds", "recipeCategory": ["Grilling", "Lamb", "Mains", "Orange", "Pork"], "recipeIngredient": ["3 pounds pork shoulder, cubed", "1 pound boneless leg of lamb, trimmed of silver skin and cubed", "1 pound pork fatback, cubed", "3 tablespoons kosher salt", "1 teaspoon pink curing salt (see note)", "2 tablespoons extra-virgin olive oil", "4 whole leeks (about 3 1/2 pounds total), trimmed of dark leaves, washed thoroughly, and finely chopped", "3 tablespoons minced garlic (about 9 medium cloves)", "2 tablespoons freshly grated orange zest from about 3 oranges", "1 tablespoon coriander seeds, toasted and finely ground", "1 tablespoon freshly ground black pepper", "1 tablespoon dried oregano (preferably Greek)", "1 teaspoon dried thyme", "1/3 cup red wine, chilled", "3 tablespoons red wine vinegar, chilled", "Hog casings, soaked in warm water 30 minutes prior to use", "1 chunk of medium smoking wood, such as oak or pecan (optional)", " ", "<strong>Type of fire: </strong><a href=\"http://www.seriouseats.com/2010/04/grilling-how-to-arrange-place-coals-for-direct-indirect-fire-grilling-cooking.html#direct\">Direct</a>", "<strong>Grill heat: </strong><a href=\"http://www.seriouseats.com/2010/04/grilling-how-hot-heat-fire-temperature-for-food-meat-burgers-chicken-veggies-fish.html#mediumhigh\">medium-high</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork, lamb, and fatback in a large bowl and toss with kosher salt and pink curing salt. Chill in refrigerator for at least 1 hour. Set parts of a meat grinder, including large cutting die, in freezer. Set bowl and paddle of stand mixer in freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat olive oil in a large skillet over medium heat until shimmering. Add leeks and cook, stirring occasionally, until tender and reduced in volume, 10-15 minutes. Let cool completely, then add leeks to bowl with meat and toss to distribute evenly. Chill for an additional 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grind meat and fat mixture through a chilled meat grinder fitted with large cutting die, into a large bowl set in another bowl filled with ice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add garlic, orange zest, coriander, black pepper, oregano, and thyme. Using chilled paddle attachment and chilled bowl of a standing mixer, mix at low speed for 1 minute. Add red wine and vinegar and mix until liquid is incorporated and sausage is uniform and sticky, about 1 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form a small sausage patty; place rest of sausage mixture in refrigerator.  Cook patty in a small frying pan over medium-high heat until cooked through. Taste and adjust seasonings of sausage if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stuff sausage into hog casings and twist into 6-inch links. Place sausages on a large wire rack set on a rimmed baking sheet and refrigerate, uncovered, for 2 to 3 days; rotate sausages daily to allow air to circulate around all of them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If smoking:</strong> In a grill, light 10-15 charcoal briquettes, or small amount of lump charcoal. When charcoal is lit and covered with gray ash, pile coals on one side of the charcoal grate. Place wood chunk on top of charcoal. Set cooking grate in place, place sausages away from fire, and cover, positioning air vent over sausages. Smoke until wood and charcoal are burnt out, 1-2 hours. Remove sausages from grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Grill over medium-high direct heat until sausage registers 160&deg;F when an instant read thermometer is inserted in middle of link. Remove from grill, let rest for 5 minutes. Serve immediately or for extra crispy sausages, split links down middle and place back on the grill, cut side down, and cook until well browned, about 2 minutes.</p>"}]}