{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140217-cabbage-potato-bacon-casserole-primary.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["cabbage", "casserole", "cheese", "easy", "gratin", "polish", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "8"}, "name": "Polish Cabbage, Potato, and Bacon Casserole", "link": "https://www.seriouseats.com/recipes/2014/02/polish-cabbage-potato-bacon-casserole-recipe.html", "description": "This browned, bubbling, soul-satisfying winner of a winter dish brings warmth on a cold winter night.", "totalTime": "1 hour", "recipeYield": "Serves 6", "recipeCategory": ["Bacon", "Cabbage", "Cheese", "Mains", "Meat Lite", "Potato", "Thanksgiving"], "recipeIngredient": ["3 medium russet potatoes (about 1 1/2 pounds), peeled and cut into 1/2-inch cubes", "Kosher salt and freshly ground black pepper", "3 slices (about 4 ounces) thick-cut bacon, diced", "1 small but heavy head green cabbage (about 2 pounds), quartered, cored, and sliced into ribbons", "1 large onion, chopped (about 1 1/2 cups)", "2 cloves garlic, minced (about 2 teaspoons)", "2 tablespoons apple cider vinegar", "1/4 cup chopped fresh parsley leaves", "1/2 cup half-and-half", "1/4 cup fresh breadcrumbs", "Nonstick cooking spray", "3/4 cup grated mild white cheese, such as edam or gouda"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375°F. Add potatoes to a medium pot, add 1 teaspoon kosher salt, and cover with water. Set pot over high heat and bring to a boil, then drop to a simmer. Cook potatoes until they are firm-tender, about 7 minutes. Drain potatoes and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon to a heavy-bottomed Dutch oven and set over medium heat. Cook, stirring, until bacon has rendered most of its fat, about 7 minutes. Using a slotted spoon, transfer bacon to a paper towel-lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If bacon has rendered more than 3 tablespoons of fat,drain fat, reserving 3 tablespoons. Return Dutch oven to medium-high heat and add cabbage, onions, and garlic. Cook, stirring occasionally, and scraping up any browned bits on the bottom of the pan, until vegetables have wilted and begun to brown, about 15 minutes. Add apple cider vinegar and deglaze pan, stirring rapidly and scraping up any browned bits stuck to the bottom. Add potatoes to cabbage mixture and stir to combine. Season thoroughly with salt and pepper, then add reserved bacon, parsley, half-and-half and breadcrumbs. Stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat the bottom of a large casserole dish with cooking spray. Add cabbage mixture and press firmly and evenly into pan. Top casserole with an even layer of grated cheese, then cover pan with a sheet of tin foil. Bake for 20 minutes, then remove foil and bake until casserole is bubbling and cheese has browned, about 20 minutes more. Remove from oven, let rest for 10 minutes, and serve. </p>"}]}