{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140506-292286-homemade-italian-beef-neck-meat-sliced.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["beef", "Chicago", "italian beef", "roast beef", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Homemade Italian Beef", "link": "https://www.seriouseats.com/recipes/2014/05/homemade-italian-beef-sandwich.html", "description": "Recreating an authentic Italian beef at home sounds easy, but it's surprisingly hard to do without an industrial meat slicer. I don't know about you, but that's one piece of kitchen gear that I don't have. Fortunately, if you give up on roasting the beef yourself, there's another way.", "totalTime": "5 hours", "recipeYield": "Serves 8", "recipeCategory": ["Beef", "Sandwiches"], "recipeIngredient": ["3 pounds beef necks, or other meaty beef bones like beef shin", "2 pounds oxtails ", "1 medium onion, chopped (about 1 cup)", "1 medium carrot, chopped (about 3/4 cup)", "4 medium cloves garlic, peeled and left whole ", "2 bay leaves ", "10 black peppercorns ", "4 cloves ", "1/2 to 1 teaspoon salt ", "2 green bell peppers", "8 Italian rolls", "2 pounds thinly sliced roast beef (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat to 450&deg;F. Meanwhile, trim as much of the meat off the beef neck bones and oxtails as you easily can. Slice large pieces of meat into thin, 1/4-inch-wide strips. Add meat and bones to a large, heavy-bottomed roasting pan and toss well with a pair of tongs. Transfer pan to oven. Roast until meat and bones are well browned, stirring every 10 minutes or so, about 45 minutes total. Carefully remove pan from oven and transfer meat and bones to a large pot. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off all but 1 tablespoon fat from roasting pan. Add onion, carrot, and garlic and stir well. Position pan over two burners, and heat over medium. Cook, stirring, until onion starts to brown, 3 to 5 minutes, reducing the heat if necessary to prevent burning. Add 1 cup of water, and dislodge the brown bits on the bottom using a wooden spoon. Turn off the heat and carefully transfer contents of the pan to the pot with the meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough water to almost cover the meat and bones, approximately 8 cups. Add bay leaves, peppercorns, and cloves. Bring to a simmer over medium-high heat, and reduce heat to maintain a very slow simmer. Use a spoon to skim any foam that rises to the surface. Cook until liquid reduces to 4 cups, 4 to 5 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, roast the green peppers. Place peppers in a cast-iron skillet or a medium-sized roasting pan. Transfer to the 450°F oven and cook until lightly blackened all over, flipping every 10 minutes, about 40 minutes total. Carefully remove from the oven and set aside. When cool enough to handle, remove skin, stems, and seeds. Slice into 1/4-inch thick strips. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain beef broth into a medium-sized saucepan, discarding the meat (or saving for another use), bones, and vegetables. Heat over medium-low heat until it reaches 140&deg;F, using a thermometer to constantly check the temperature. Adjust flame to maintain temperature. Season liquid with salt, about 1/2 to 1 teaspoon, and a few more cracks of black pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap the rolls in aluminum foil and place in the 450&deg;F oven. Cook until hot, 8 to 10 minutes. Remove the rolls from the oven, but keep them wrapped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Weigh 1/4-pound of roast beef. Drop the slices into the liquid one at a time. Slowly stir with a fork until warm, about 30 seconds. Unwrap one roll, and carefully slice horizontally most of the way through, making sure top and bottom are still attached. Use a fork to remove the meat from the broth and stuff it in the roll. Top with some giardiniera and roasted peppers. Repeat with remaining beef and bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want the sandwich dipped, use a pair of tongs to dip the finished sandwich back in the broth. Eat at once, with a lot of napkins close by. </p>"}]}