{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140731-meat-hook-meat-book-chili-michael-harlan-turkell.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["bean", "beef", "cheese", "chili", "Cook the Book", "lamb", "pork", "stew", "the meat hook meat book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Meat Hook Chili From 'The Meat Hook Meat Book'", "link": "https://www.seriouseats.com/recipes/2014/08/meat-hook-chili-from-the-meat-hook-meat-book.html", "description": "Coming from a book with 'meat' in the title twice, Tom Mylan's chili in the <a href=\"http://www.amazon.com/Meat-Hook-Book-Butcher-Better/dp/1579655270/?tag=serieats-20\"><em>The Meat Hook Meat Book</em></a> is unsurprisingly brimming with a ton of meat. Okay, not a ton, but an impressive five pounds&mdash;two of beef, two of pork, and one of lamb&mdash;or 20 quarter-pounders, to put things in perspective.", "totalTime": "3 hours 10 minutes", "recipeYield": "Serves 10", "recipeCategory": ["Beef", "Cheese", "Chili", "Cook the Book", "Lamb", "Mains", "Pork", "Sides"], "recipeIngredient": ["10 dried guajillo chiles", "2 pounds ground beef", "2 pounds ground pork", "1 pound ground lamb", "Olive oil", "3 large yellow onions, roughly chopped", "1 head garlic, separated into cloves, peeled, and chopped, or to taste", "Two 16-ounce cans whole tomatoes", "Three 12-ounce cans hominy", "1 cup or so toasted cumin seeds, finely ground", "1/4 cup cayenne pepper, or to taste", "Salt and freshly ground black pepper ", "Cheap beer or beef stock (if needed)", "White wine vinegar or cider vinegar (if needed)", "Sour cream, shredded cheese, onions, scallions, and saltines for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let’s start with the most important part: the dried chiles. Take your chiles, pull off the stems, and shake out the seeds. If you’re both anal and want a milder chili, you can slice open the chiles and remove the white veins too. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once you have your deseeded chiles, you want to boil water equivalent to the volume of the chiles (about 4 cups) in a saucepan and then turn off the heat. Make sure that the pan has a lid, or when you add the chiles you’ll pepper-spray your kitchen with the spicy steam that will result. Add the chiles, punch them down, and put on the lid. Basically, you want to wait until the pan has cooled to the point where you can touch the sides with your hand (45 minutes or so).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now puree the whole thing with an immersion blender until it’s smooth. This might be a good time to run the paste through a China cap (fine strainer) to get any bigger pieces out, but if you’re not trying to impress anyone with your flawless French Laundry chef skills, skip it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next, you want to brown your meat in a large pot, the pot you’re going to be simmering your chili in. Brown over medium heat until, well, brown. I like to sauté the diced onions and garlic separately in some olive oil in a large sauté pan, then add them to the meat, but I don’t think it matters that much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now add your chile paste, tomatoes, hominy, most of the cumin, the cayenne, and salt and pepper to taste to the combination of meat and onions. After it simmers over low heat for a while, say 45 minutes, taste it and correct the seasoning. Usually I find that it needs more garlic, heat (cayenne), cumin, and/or salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Your chili should simmer for another hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now it’s time to hit the pot with the immersion blender, making sure to break up all the clumps of meat and catch any stray tomatoes. This may take a while! You’re shooting for Hormel consistency here. Now give the chili a taste. Is it too thick? Add beer or stock. Too fatty? Add some white wine vinegar or cider vinegar. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with sour cream, shredded cheese, onions, scallions, and saltines.</p>"}]}