{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141031-fried-spare-ribs-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Filipino", "keywords": ["Asian", "deep fry", "Filipino", "pork", "rib", "sparerib"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crispy Filipino Fried Spareribs With Vinegar Dipping Sauce", "link": "https://www.seriouseats.com/recipes/2014/10/filipino-deep-fried-pork-spareribs-recipe.html", "description": "What's better than spareribs? How about Filipino deep-fried spareribs. First marinated with garlic and vinegar, then deep fried until browned and crisp, they're an addictive plate of pork.", "totalTime": "4 hours 30 minutes", "recipeYield": "serves 3-4", "recipeCategory": ["Filipino", "Mains", "Pork"], "recipeIngredient": ["1/2 cup cane or rice vinegar, plus more for serving", "2 tablespoons soy sauce", "2 tablespoons freshly minced garlic (about 6 medium cloves)", "1 1/2 teaspoons freshly ground black pepper", "1 teaspoon oyster sauce", "1 teaspoon yellow mustard", "1 teaspoon kosher salt, plus more for seasoning", "1 rack St. Louis-cut pork spareribs, cut into 1-inch strips across the bone, then cut between each bone into individual portions (see note)", "6 tablespoons cornstarch", "Canola or peanut oil, for deep frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together vinegar, soy sauce, garlic, pepper, oyster sauce, mustard, and 1 teaspoon salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rib pieces in a large zipper-lock bag. Pour in marinade, seal tightly, and toss to distribute marinade evenly. Place in refrigerator and marinate for at least 4 hour or up to overnight, turning bag at least once during that time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a wok or Dutch oven at least 4 inches deep with oil and heat to 375&deg;F over high heat. Working in batches, transfer 1/3 of ribs to a medium bowl (they should be wet and dripping with marinade), add 2 tablespoons cornstarch, and toss until ribs are evenly coated in a sticky, paste-like batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully lower ribs, one at a time, into hot oil and fry until golden brown, about 7 minutes, stirring occasionally for even cooking. Transfer to a paper towel-lined plate and season lightly with salt. Repeat with remaining ribs. Serve immediately with vinegar for dipping.</p>"}]}