{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140519-one-pot-wonders-peas-pasta-pancetta.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["corn", "mint", "one pot", "pancetta", "pasta", "pea", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Whole Wheat Linguine With Pancetta, Peas, Corn, and Mint", "link": "https://www.seriouseats.com/recipes/2014/05/linguine-pancetta-peas-corn-mint-recipe.html", "description": "Taking advantage of late spring and early summer produce, this easy one-pot pasta combines crispy bites of pancetta with peas, corn, and mint for a refreshing and filling weeknight meal. With minimal prep work, this tasty dish can be on the table in less than 30 minutes.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Corn", "One-Pot Wonders", "Pasta"], "recipeIngredient": ["¼ pound pancetta, thinly sliced and cut into 1/2-inch strips lengthwise", "1 medium shallot, thinly sliced", "Pinch dried red chili flakes", "Kosher salt and freshly ground black pepper", "1 quart homemade chicken stock or store-bought low-sodium chicken broth", "1 pound whole-wheat linguini, broken in half", "1 cup fresh or frozen shelled peas", "1 cup fresh or frozen corn kernels", "1 tablespoon freshly squeezed lemon juice from 1 lemon", "1 tablespoon extra-virgin olive oil, plus more as needed", "1 cup loosely packed fresh mint leaves, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a Dutch oven, large pot, or 12-inch skillet, cook pancetta over medium heat until most of the fat has rendered and the pancetta is crispy, about 5 minutes. Using a slotted spoon, transfer pancetta to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same Dutch oven, add shallot and chili flakes and cook over medium heat until shallot is softened, about 2 minutes. Add stock, scraping up any browned bits. Add pasta and season with salt and pepper. Boil, stirring occasionally to prevent sticking, until the pasta is al dente and most of the stock has been absorbed, about 8 minutes. Stir in corn and peas and cook until heated through, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Off the heat, stir in lemon juice, olive oil, and pancetta. Season with salt and pepper, and top with mint. Serve right away. </p>"}]}