{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141205-panettone-max-b-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Max Bernstein"}, "recipeCuisine": "Italian", "keywords": ["Christmas", "holiday", "Italian", "panettone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Slow and Easy Panettone", "link": "https://www.seriouseats.com/recipes/2014/12/slow-and-easy-pannetone-recipe.html", "description": "Of all the holiday breads that pop-up around this time of year, panettone is the stand out. Boozy, sweet, and ubiquitous, it can be found at grocery stores and bakeries everywhere. This year, it's time to start making panettone at home.", "totalTime": "24 to 30 hours", "recipeYield": "Makes 1 large panettone, or 2 small ones", "recipeCategory": ["Bread", "Cakes", "Christmas", "Italian"], "recipeIngredient": ["400 grams All-Purpose Flour (divided)", "175 grams Cultured Buttermilk, divided", "125 grams Egg Yolks", "200 grams Dried Cherries", "100 grams Bourbon", "75 grams Hazelnuts, crushed and toasted", "75 grams Sugar", "12 grams Salt", "10 grams plus a pinch Instant Yeast", "150 grams Butter, cold but softened", "1 egg", "Zest of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Biga</strong>: The night before you plan to bake, combine 200 grams of flour, 125 grams of buttermilk, and a small pinch of yeast in a medium bowl with your hands until all of the flour and yeast is hydrated and no clumps remain. Cover tightly with plastic wrap and let sit at room temperature for 12 to 16 hours. The biga should double in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Soaker</strong>: At least a day before you plan to bake, combine the dried cherries, bourbon and lemon zest. Allow to sit, covered, at room temperature overnight until the fruit absorbs the alcohol. Shake periodically to make sure your cherries hydrate evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough</strong>: Place the remaining 200 grams flour, all of the biga, the egg yolks, the remaining 50 grams buttermilk, and the yeast in the bowl of a stand mixer fitted with a dough hook attachment. Mix on low speed until the dough is fully incorporated and smooth. About 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the initial mix has come fully together into a smooth ball, add the salt and sugar. Continue mixing on slow speed until the dough is once again smooth, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the dough has once again come together, turn the mixer to medium-high speed and knead until the dough forms a slightly stiff, but stretchy and elastic ball, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the mixer to slow speed and add the butter in small pieces. Mix until butter is fully incorporated into dough, scraping down the sides of the work bowl with a spatula as necessary. When the butter is fully incorporated, the dough should feel looser, and stretchier than before, but not greasy. About 10 minutes. If the dough continues to feel greasy but you can't see any pieces of butter in the bowl, allow dough to continue to mix on slow speed until the oily feel has fully dissipated, up to 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the butter is fully incorporated, drain any excess liquid from the soaked cherries. Add the cherries and toasted hazelnuts to the dough. Mix low speed until your dough re-forms into a coherent ball with cherries and nuts evenly distributed throughout. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a dough spatula, transfer dough to a lightly floured work surface, shape into a ball, and place the ball seam-side down into the panettone mold. If you wish to make smaller panettona, divide dough now into the number of pieces you desire and place into appropriately sized molds. The ball of dough should fill somewhere between a quarter and a third of the mold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat egg well and brush over the top of the panettone. Lightly but securely cover your filled panettone mold with plastic wrap. Allow to proof in a warm, slightly humid place until the dough fills the mold roughly 2/3 high, 10 to 12 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 hour before you plan to bake, adjust oven rack to lower-middle position and preheat oven to 350°F (325°F for a convection oven). When the panettone is appropriately risen, apply a second coat of egg wash, place it on a rimmed baking sheet, and place in oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the panettone until the tops are a deep, golden brown, and a pastry tester or knife pushed into the center comes out clean, approximately 45 minutes, rotating the loaf midway through the bake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When done, allow to cool for at least 2 hours and up to overnight. Stored in a plastic bag, the panettone will stay moist and fresh for at least 4 days. </p>"}]}