{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140916-migas-vicky-wasik-eggs.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Tex-Mex", "keywords": ["breakfast", "easy", "egg", "Mexican", "quick", "tex-mex", "tortilla", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Tex-Mex <i>Migas</i> With Scrambled Eggs, Tortilla Chips, and Chilies", "link": "https://www.seriouseats.com/recipes/2014/09/migas-tex-mex-scrambled-eggs-tortilla-recipe.html", "description": "The Tex-Mex version of <em>migas</em>&mdash;scrambled eggs cooked with chili peppers, onion, and tortilla chips, then served on tortillas with hot sauce&mdash;is a hangover killer, but even if you haven't overindulged, it's still a killer breakfast option.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Mains", "Mexican", "Mother's Day", "Onion", "Quick and Easy", "Quick Dinners", "Scrambled Eggs", "Stovetop", "Tex-Mex", "Tomato", "Vegetarian"], "recipeIngredient": ["8 large eggs, beaten", "Kosher salt", "2 plum tomatoes, diced", "Vegetable, canola, or peanut oil, for frying", "16 corn tortillas, 8 cut into 1 1/2– by 3/4-inch strips (see note), 8 left whole and <a href=\"http://www.seriouseats.com/2011/10/video-the-right-way-to-warm-corn-tortillas.html\">warmed in a dry hot skillet just before serving</a>", "1 medium Poblano pepper, stemmed, seeded, and finely chopped", "2 serrano chilies or 1 jalapeño, stemmed and finely chopped", "1 medium yellow onion, finely chopped", "Freshly ground black pepper", "Mexican hot sauce, for serving", "<a href=\"http://www.seriouseats.com/recipes/2014/04/perfect-refried-beans.html\">Refried beans</a> and sliced avocado, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk eggs with 2 generous pinches of salt and set aside. In a medium bowl, toss tomato with a generous pinch of salt, then transfer tomatoes to a strainer and set over bowl to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, heat about 2 inches of oil to 350&deg;F (180&deg;C). Add tortilla strips and cook, agitating and flipping them constantly with a wire mesh spider, until bubbles slow to a trickle and chips are pale golden brown, about 2 minutes. Transfer to a paper towel&ndash;lined plate, season with salt, and set aside (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons (45ml) oil in a large cast iron or nonstick skillet over medium heat until shimmering. Add Poblano, serrano or jalapeño, and onion and cook, stirring, until fully softened but not browned, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower heat to medium-low, add eggs, and cook, stirring constantly, until curds are just starting to form throughout, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 3/4 of the tortilla chips and continue to cook eggs until they are still soft but nearly cooked, about 5 minutes longer. Add tomato and remaining tortilla chips and cook until eggs are softly scrambled and just cooked through, about 2 minutes. Season with salt and pepper. Transfer immediately to a bowl to halt cooking. Serve right away on top of warmed whole tortillas with hot sauce, refried beans, and avocado.</p>"}]}