{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140508-291808-cook-the-book-chicken-and-egg.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chicken", "coi", "Cook the Book", "egg"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken and Egg From 'Coi' (Part 1)", "link": "https://www.seriouseats.com/recipes/2014/05/chicken-and-egg-from-coi-part-1.html", "description": "Like many recipes in <a href=\"http://www.starchefs.com/cook/chefs/bio/Daniel-Patterson/coi\" target=\"_blank\">Daniel Patterson</a>'s <em><a href=\"http://www.amazon.com/Coi-Stories-Recipes-Daniel-Patterson/dp/0714865907/?tag=serieats-20\" target=\"_blank\">Coi</a></em> cookbook, the recipes for Chicken and Egg implores you to start three days ahead. I'd suggest that you ignore the impulse to roll your eyes and skip it, and just accept the nature of the beast. The final dish is just that impressive.", "totalTime": "12 to 24 hours for the stock, 3 days for the powder", "recipeYield": "Makes several quarts stock and about 1/2 cup powder", "recipeCategory": ["Chicken", "Condiments and Sauces", "Cook the Book", "Eggs", "Gluten-Free"], "recipeIngredient": ["<strong>Seaweed Powder</strong>", "200 g dried kombu", "1 kg <a href=\"http://www.seriouseats.com/recipes/2014/05/earth-and-sea-from-coi-part-1.html\">Vegetable Stock</a>", "125 g garum", "25 g brown rice vinegar", "2.5 g shiro dashi", "2.5 g white soy", "&nbsp", "<strong>AP Stock</strong>", "4.5 kg duck carcasses", "4.5 kg veal neck bones", "1 pig's foot, split", "900 g diced carrots", "1 kg diced onions", "15 liters water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the seaweed powder you need 3 days:</strong> Hydrate dried kombu overnight in the liquids, then simmer gently in a small pan over low heat for about 2 hours until the liquid is absorbed, and the seaweed is tender. Dehydrate at warm room temperature for a few days, until completely dry. Grind in a spice mill. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the AP stock:</strong> Roast the veal and duck bones, separately, in roasting pans. Brown deeply, stirring occasionally. When they're done, deglaze with water and scrape up the fond, the stuff at the bottom of the roasting pan. If it's delicious, then put it in the stockpot. If it tastes burnt, then discard it&mdash;at least you've cleaned the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the bones, fond (if usable) and pig's foot to the pot. Start the onions with a little pure olive oil&mdash;no salt!&mdash;in a heavy, covered pot. We use enameled cast iron. Sweat until tender over low-medium heat. The pot should be in between tall and wide, so that the liquid that comes out of the onions as they cook does not burn off right away. When you take off the lid, the onions should be swimming in their own juices. Add the carrots and cook over medium heat, stirring often, until the liquid reduces and caramelizes. The point here is that you want to release the juices containing sugars from the vegetables, and then burn off the liquid and caramelize those sugars. This will give the vegetables a deep, rich flavor. Don't just brown the vegetables and then throw in some water to standardize the color, which will give you something that looks similar, but is nowhere near as tasty. When the vegetables are mahogany brown and sweet, add them to the stockpot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the water and bring to a boil, skimming as it comes up. Throw in a bunch of ice, bring to a boil again and skim. Turn down to a low simmer for at least 12 to 15, and preferably 24 hours. There should be bubbling action on one side of the pot, but not the other. Before straining, throw more ice in and bring it up to a boil again, and skim.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When it's done, carefully scoop out everything except the bottom 4 inches of the contents of the pot. Do NOT simply dump out the stock into another container. Doing it this way will mix the murk on the bottom with the clear elixir on top that you worked so hard to create. Strain the stock through a fine mesh sieve. Cool in a very col ice bath, letting the fat rise to the surface and harden. If you're not using it immediately, then then fat cap will protect the stock. Once the fat cap is broken, it should be vacuum sealed. It freezes very well.</p>"}]}