{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140131-281099-cook-the-book-smoked-salmon-creme-fraiche-tart-cornmeal-millet-crust.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Smoked Salmon Crème Fraîche Tart With a Cornmeal Millet Crust From 'Whole-Grain Mornings'", "link": "https://www.seriouseats.com/recipes/2014/01/smoked-salmon-creme-fraiche-tart-with-cornmeal-millet-crust.html", "description": "Most of use know that salmon, cream cheese, and capers is a killer combination layered atop a bagel. But those flavors aren't necessarily tied to a bagel shop. Filling a buttery cornmeal and millet tart crust with a tangy crème fraîche custard, slices of salmon, flecks of dill, and a handful of salty capers, as <a href=\"http://asweetspoonful.com/about\" target=\"_blank\">Megan Gordon</a> does in <em><a href=\"http://www.amazon.com/Whole-Grain-Mornings-Breakfast-Recipes-Seasons/dp/1607745003/?tag=serieats-20\" target=\"_blank\">Whole-Grain Mornings</a></em>, is just as grand of an idea.", "totalTime": "1 hour and 15 minutes, plus 1 hour to overnight to chill the crust", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Eggs", "Mains", "Salmon"], "recipeIngredient": ["<strong>Crust</strong>", "1/2 cup / 65 g fine-ground cornmeal", "3/4 cup / 90 g white whole wheat flour or standard whole wheat flour", "3/4 teaspoon kosher salt", "6 tablespoons / 85 g cold unsalted  butter, cut into 1/4-inch cubes, plus more for greasing the pan", "3 to 4 tablespoons ice water", "1/4 cup / 45 g millet", "&nbsp", "<strong>Filling</strong>", "1 tablespoon extra-virgin olive oil", "1/2 cup / 50 g minced shallots (about 3 medium shallots) ", "2 cloves garlic, minced", "1 cup / 240 ml whole milk", "1/4 cup / 60 ml crème fraîche", "3 large eggs, beaten", "3 tablespoons capers, drained ", "2 tablespoons chopped fresh dill", "1 teaspoon kosher salt", "Pinch of freshly ground black pepper", "4 ounces / 115 g smoked salmon, cut into small pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare the crust:</strong> Butter a 9-inch tart pan with 1-inch sides and a removable bottom. Using a food processor fitted with the metal blade, pulse together the cornmeal, flour, and salt. Add the butter and pulse until the mixture resembles coarse meal (alternatively, you can use a pastry blender or your fingertips to work the butter into the dry ingredients). Add ice water 1 tablespoon at a time and pulse until the dough starts to look like wet, clumpy sand. It’s ready if a small piece holds together when squeezed between your fingers. If it still seems too crumbly, add more water, 1 teaspoon at a time. Turn the dough out into a large bowl and mix in the millet using a fork. Press the dough evenly into the bottom and up the sides of the prepared pan. Chill in the refrigerator for at least 1 hour and up to 1 day. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F. Place the prepared crust on a small baking sheet for easy transport to and from the oven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the crust for 15 minutes to slightly dry out the top so that it won’t get soggy when you add the wet filling. Meanwhile, prepare the filling. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare the filling:</strong> In a small sauté pan over medium heat, warm the olive oil and sauté the shallots until translucent, 2 to 3 minutes. Add the garlic and sauté for an additional 1 minute. Remove from the heat. In a bowl, whisk together the milk, crème fraîche, eggs, capers, dill, salt, and pepper to make a custard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble and bake the tart:</strong> Spoon the shallot mixture in an even layer on the bottom of the crust; arrange the salmon across the top evenly. Pour in the custard mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake at 375°F until the top is golden brown and the filling is set, 30 to 35 minutes. Let cool for 15 to 20 minutes. Unmold the tart onto a serving platter and serve warm or at room temperature. If you have leftovers, cover and refrigerate for up to 3 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Ahead:</strong> You can bake the crust a day ahead so the next day you simply whisk together the filling, pop the tart in the oven, and serve. If going this route, refrigerate the prebaked crust, covered with plastic wrap. You can also bake the entire tart up to 1 day in advance and allow it to cool, then refrigerate it, covered. To serve, reheat in a 300°F oven until warmed through, 12 to 15 minutes. </p>"}]}