{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140402-pressure-cooker-thai-chicken-squash-eggplant-spinach-curry-08.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Thai", "keywords": ["Asian", "chicken", "coconut", "curry", "quick", "stew", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "12"}, "name": "Pressure Cooker Thai Green Chicken Curry With Eggplant and Kabocha Squash", "link": "https://www.seriouseats.com/recipes/2014/04/pressure-cooker-thai-green-chicken-curry.html", "description": "This fragrant, hearty, Thai-style chicken curry tastes like it took hours to prepare, but it cooks in a pressure cooker in just 20 minutes. Pieces of sweet kabocha squash and eggplant break down into the coconut-milk-based sauce, thickening it and adding layers of flavor.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Coconut", "Gluten-Free", "Mains", "Pressure Cooker", "Quick Dinners", "Soups and Stews", "Thai"], "recipeIngredient": ["2 tablespoons vegetable oil", "3 medium cloves garlic, crushed", "3 Thai green bird's eye chilies, halved", "1-inch piece fresh ginger, peeled and sliced 1/8 inch thick", "1/4 teaspoon ground coriander", "1/8 teaspoon ground cumin", "2 tablespoons Thai green curry paste", "One (14-ounce) can coconut milk", "6 cups cubed skin-on kabocha squash (from about half of one small 4-pound squash)", "1 medium (12-ounce) eggplant, cubed (about 4 cups)", "One (4-pound) whole chicken, cut into 8 pieces, or 4 pounds chicken drumsticks and thighs", "Kosher salt", "1 tablespoon fish sauce", "4 ounces spinach (about 4 packed cups), roughly chopped", "1/2 cup loosely packed fresh cilantro leaves and tender stems (from about 5 sprigs)", "1/2 cup loosely packed fresh Thai basil leaves (from about 5 sprigs)", "Freshly ground black pepper", "Cooked rice, barley, or other grain, for serving", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a pressure cooker over medium-high heat (\"sear\" setting on an electric pressure cooker) until shimmering. Add garlic, chilies, ginger, coriander, and cumin and cook, stirring, until aromatic, about 1 minute. Add curry paste and cook, stirring, until paste has darkened slightly, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in coconut milk, bring to a simmer, and cook for 1 minute. Season chicken pieces with salt. Add half the squash and eggplant and season with salt. Add chicken and top with the remaining squash and eggplant. Season with salt. Seal pressure cooker and cook on high pressure for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Release pressure, remove lid, and stir in fish sauce, spinach, and 1/4 cup each of the cilantro and Thai basil. Season with salt and pepper. Ladle the stew into serving bowls and scatter remaining cilantro and basil on top. Serve with rice and lime wedges.</p>"}]}