{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141111-brown-rice-congee-with-beef-and-shiitake-shao-zhong-09.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["beef", "breakfast", "brown rice", "Chinese", "congee", "easy", "fall", "garlic", "porridge", "rice", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brown Rice Congee With Beef, Shiitake, and Garlic Chips", "link": "https://www.seriouseats.com/recipes/2014/12/brown-rice-congee-shiitake-garlic-chip-beef-recipe.html", "description": "Congee is nothing more than a simple rice porridge, but man can it be comforting! It's an Asian breakfast staple, a dim sum classic, and a blank canvas to add your own flavors. Traditionally white rice is used, but sometimes I like to use brown rice for a heartier, healthier porridge with a subtle nutty flavor. Heartier vegetables such as kale, escarole, shiitakes, leeks, and even Brussels sprouts are perfect in it. One of my favorite combos is this recipe: marinated strips of beef, dried shiitake mushrooms, and garlic chips.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Breakfast and Brunch", "Chinese", "Father's Day", "Garlic", "Mains", "Mother's Day", "Rice", "Soups and Stews"], "recipeIngredient": ["<strong>For the Beef:</strong>", "1/2 pound ground beef", "2 teaspoons cornstarch", "2 teaspoons soy sauce", "2 teaspoons peanut or vegetable oil", "1/2 teaspoon sugar", "1/8 teaspoon salt", "<strong>For the Garlic Chips:</strong>", "1 head of garlic", "1/2 cup olive oil", "1/2 teaspoon salt", "<strong>For the Congee:</strong>", "6 dried shiitake mushrooms", "1 cup brown rice (long grain or short grain)", "2 teaspoons soy sauce", "1/8 teaspoon white pepper", "Scallions and/or chives, chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Beef:</strong> In a large bowl, combine the ground beef, cornstarch, soy sauce, oil, salt, and sugar. Mix well and set aside in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Garlic Chips:</strong> Peel and thinly slice the cloves from a whole head of garlic. Add slices of garlic in a saucepan with olive oil. Turn the flame to medium low and slowly fry the garlic until pale golden brown. Stir the garlic every few minutes, checking to make sure they are not burning. This should take about 15 minutes. When the garlic is done, drain through a fine mesh strainer set in a bowl. Transfer garlic to a small bowl and season with 1/2 teaspoon of salt. Mix and set aside. Reserve the garlic oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Congee:</strong> Rinse dried shiitake mushrooms under running water to remove grit. Place in a bowl and pour enough boiling water to cover the mushrooms. Soak the mushrooms in the hot water for at least 20 minutes. If you are rehydrating the mushrooms the day before, soak mushrooms in cold water overnight. Once the mushrooms are soft, rinse under running water again. Squeeze out any excess water, slice, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To start the congee, rinse brown rice under running water. Drain and place in a pot. Add 5 cups of water to the pot, cover with a lid, and bring it to a boil. Once the water starts boiling, turn down the flame to a simmer and cover the pot. 15 minutes later, stir the rice making sure it’s not sticking to the bottom and cover the pot again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let congee cook for 15 minutes longer, then stir one more time and add the sliced shiitakes. Cover the pot and simmer for 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 20 minutes, add the ground beef in teaspoon-sized chunks with a chopstick or a spoon. Stir and cover the pot until beef is cooked, 5 to 10 minutes. When the congee is done, add 2 teaspoons of soy sauce, white pepper, and season with salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve the congee, spoon it into bowls, sprinkle chopped scallions, chives, and garlic chips on top. Drizzle garlic oil on top and serve hot.</p>"}]}