{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140703-ideas-in-food-clam-sauce-Gochujang.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "Korean", "keywords": ["bourbon", "butter", "chili paste", "ghee", "gochujang", "Korean", "nori", "sesame"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gochujang-Infused Ghee With Toasted Sesame Seeds and Bourbon", "link": "https://www.seriouseats.com/recipes/2014/07/gochujang-ghee-recipe.html", "description": "Infused with <em>gochujang</em> (Korean chili paste), toasted sesame seeds, and bourbon, this unlikely combination of ingredients is shocking delicious. It can be used as part of all kinds of larger recipes, or simply as a poaching liquid and dipping sauce for clams and other seafood.", "totalTime": "20 minutes", "recipeYield": "Makes about 1/2 cup", "recipeCategory": ["Condiments and Sauces", "Korean"], "recipeIngredient": ["1/2 cup plus 3/4 tablespoon (125 grams) unsalted butter", "5 3/4 tablespoons (50 grams) white sesame seeds", "4 1/4 tablespoons (60 grams) bourbon", "3 tablespoons (50 grams) gochujang (Korean red chili paste; see note)", "1/4 ounce (7 grams) teriyaki flavored nori sheets (see note)", "1 tablespoon (15 grams) toasted sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pan, melt butter over medium heat. Add sesame seeds and cook, stirring, until seeds and butter have both browned and become nutty and aromatic, about 10 minutes. Remove from heat and carefully pour in bourbon; it will sizzle and foam. Return pan to medium heat and cook until alcohol burns off, about 2-3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in gochujang and nori. Cook until all the water evaporates and the butter looks like clear red fat with the seeds and nori at the bottom, about 5 minutes. Strain gochujang ghee through a fine mesh sieve, reserving sesame seeds and nori in the refrigerator. Stir sesame oil into gochujang ghee and refrigerate in a covered container until ready to use, up to 2 weeks.</p>"}]}