{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140814-Brat-Stuffed-Cabbage-Smoky-Bacon-Tomato-Sauce-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["bratwurst", "cabbage roll", "sausage", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bratwurst-Stuffed Cabbage Rolls With Smoky Bacon-Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2014/08/bratwurst-stuffed-cabbage-rolls-bacon-tomato-sauce-recipe.html", "description": "In recognition of the transition from summer to fall, this dish takes a summertime staple&mdash;bratwurst&mdash;and turns it into a filling with rice for stuffed cabbage rolls. The rolls are then bathed in a bacon-and-beer-infused tomato sauce and baked until tender.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Bacon", "Mains", "Pork", "Sunday Supper"], "recipeIngredient": ["<strong>For the Cabbage and Filling:</strong>", "1 medium head Savoy cabbage, whole with core removed", "Boiling water", "1 1/2 pounds bratwurst, casings removed", "2 cups cooked white rice", "<strong>For the Rolls and Sauce:</strong>", "3 slices bacon, chopped", "1 medium yellow onion, finely chopped", "1 red bell pepper, stemmed, seeded, and finely chopped", "2 medium cloves garlic, minced", "12 ounces light beer, such as lager or pale ale", "1 (28-ounce) can tomato puree ", "1/2 teaspoon paprika", "1/4 teaspoon ground caraway", "Kosher salt and freshly ground black pepper", "Non-stick cooking spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cabbage and Filling:</strong> Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. Place cabbage in a large heatproof bowl. Cover with boiling water and let stand 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, brown bratwurst in a large skillet over medium-high heat, breaking meat into little bits, about 10 minutes total. Drain, add rice, and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Rolls and Sauce:</strong> Brown bacon in a large saucepan, stirring, over medium-high heat until crisp and rendered, about 5 minutes. Add onion and bell pepper and continue cooking, stirring often, until vegetables start to soften, about 4 minutes. Reduce heat to medium, add garlic and cook for 2 minutes longer. Add beer, bring to a boil, then lower heat and simmer for 5 minutes. Add tomatoes, paprika, and caraway. Season with salt and pepper. Return to a boil, reduce heat to low, and simmer until slightly thickened, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain cabbage, and remove large outer leaves, being careful not to tear them. Cut out and discard the tough rib from each leaf. Pat leaves dry with paper towels. Fill each leaf with about 1/3 cup of bratwurst filling. Roll up as you would a burrito, tucking the sides in first. Continue making rolls until all filling is used up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a 9- by 13-inch baking dish with cooking spray and arrange rolls tightly in the dish. Pour sauce on top. Cover with foil and transfer to the oven to bake until bubbly, 35 to 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven, let stand for 10 minutes, then serve, spooning sauce on top of cabbage rolls.</p>"}]}