{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140106-280172-dinner-tonight-sauteed-salmon-potatoes-anchovy-sauce.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["easy", "quick", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sautéed Salmon With Potatoes and Creamy Anchovy Sauce", "link": "https://www.seriouseats.com/recipes/2014/01/sauteed-salmon-with-potatoes-and-creamy-anchovy-sauce.html", "description": "Consider this a combination of the old and new. The idea came from recipe number 1665 in Escoffier's 1903 tome, <em>Le Guide Culinaire</em>, but the creamy anchovy vinaigrette comes from the much more recently published <em>Modern Sauces</em>.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dinner Tonight", "Salmon"], "recipeIngredient": ["2 pounds Yukon Gold potatoes (about 4 medium) quartered ", "Kosher salt and freshly ground black pepper ", "2 scallions, ends and white parts discarded, green parts thinly sliced", "2 tablespoons fresh parsley, chopped ", "4 (6 ounce)salmon fillets, skin on ", "1/4 cup canola oil ", " ", "<strong>For the Vinaigrette</strong>", "10 anchovy fillets, preferably packed in olive oil, drained ", "2 tablespoons juice from 1 lemon ", "1 tablespoon drained capers", "1 tablespoon chopped fresh parsley leaves", "3 tablespoons extra-virgin olive oil ", "2 tablespoons heavy cream "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add potatoes to a large pot and cover with water. Season generously with salt. Bring to a boil over high heat and simmer until tender and fork slides in easily, 15 to 20 minutes. When done, drain in a colander. Toss in a large bowl with green scallions and 2 tablespoons of parsley. Season with salt and pepper to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season salmon fillets on both sides with salt and pepper. Heat oil in a large non-stick skillet over medium-high heat until shimmering. Add salmon fillets skin side down, and carefully press the fillets down with a spatula or your fingers for a few seconds so that the skin has full contact with the skillet. Cook until browned on the bottom, 4 to 5 minutes. Carefully flip fillets and cook for 1 minute on the other side. Remove fillets and set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the vinaigrette</strong>: Purée the anchovies, lemon juice, capers, and parsley in a food processor. With the blades running, pour in the olive oil and heavy cream until the sauce is smooth and thick, about 20 seconds. Transfer to a bowl and season to taste with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve salmon fillets and potatoes with the creamy vinaigrette on the side. </p>"}]}