{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140922-red-sauce-worth-waiting-for-recipe16.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "Italian", "italian american", "red sauce", "sauce", "tomato sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9347826086957", "ratingCount": "46"}, "name": "The Best Slow-Cooked Tomato Sauce", "link": "https://www.seriouseats.com/recipes/2014/09/the-best-slow-cooked-italian-american-tomato-sauce-red-sauce-recipe.html", "description": "This rich and hearty red sauce tastes like it's been cooked for hours, because it <em>has</em>. The secret to rich, naturally sweet, complex flavors is to cook the sauce in the oven, allowing the surface to brown while the sauce slowly concentrates. The resultant sauce is great on pasta, with meatballs, on your chicken parm, or scooped right out of the pan with a spoon on its own.", "totalTime": "6 hours", "recipeYield": "Makes about 2 quarts", "recipeCategory": ["Condiments and Sauces", "The Food Lab", "Tomato"], "recipeIngredient": ["4 (28-ounce) cans whole peeled tomatoes, preferably imported D.O.P. San Marzano tomatoes (see note)", "1/4 cup extra-virgin olive oil, plus more for finishing.", "4 tablespoons butter", "8 cloves garlic, minced (about 3 tablespoons)", "1 teaspoon red pepper flakes", "1 tablespoon dried oregano", "1 medium carrot, cut into large chunks", "1 medium onion, split in half", "1 large stem fresh basil", "Kosher salt and freshly ground black pepper", "1 tablespoon fish sauce (optional), such as <dorado id=\"red-boat-fish-sauce\" class=\"text\">Red Boat</dorado>", "1/2 cup minced fresh parsley or basil leaves (or a mix of the two)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat oven to 300&deg;F (165&deg;C). Place tomatoes in a large bowl. Using your hands, crush the tomatoes by squeezing them in your fingers until pieces no larger than 1/2-inch remain. Transfer 3 cups of crushed tomatoes to a sealed container and reserve in the refrigerator until step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil and butter over medium heat in a large Dutch oven until butter is melted. Add garlic and cook, stirring, until softened and fragrant but not browned, about 2 minutes. Add pepper flakes and oregano and cook, stirring, until fragrant, about 1 minute. Add tomatoes, carrot, onion, and basil, and stir to combine. Season lightly with salt and pepper. Bring to a simmer over high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover Dutch oven with lid slightly ajar and transfer to oven. Cook, stirring once every 1 to 2 hours, until reduced by about half and darkened to a deep red, 5 to 6 hours (reduce oven temperature if the sauce is bubbling too rapidly or the browned bits begin to turn too dark).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven. Using tongs, discard onion halves, carrots, and basil stems. Add reserved tomatoes to sauce and stir to combine. Add fish sauce, if using. Season generously with salt and pepper and stir in minced herbs along with additional olive oil as desired. Serve immediately, or allow to cool at room temperature, transfer to airtight containers, and refrigerate for up to 1 week. Sauce can also be frozen in sealed containers for up to 6 months. To reheat, warm very gently in a saucepan with 1/2 cup water, stirring until it all melts and heats through.</p>"}]}