{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140929-doritos-migas-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Tex-Mex", "keywords": ["breakfast", "Doritos", "egg", "tex-mex", "tortilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Doritos Migas With Pepper Jack, Tomatoes, and Jalapeño", "link": "https://www.seriouseats.com/recipes/2014/10/tex-mex-doritos-migas-scrambled-eggs-recipe.html", "description": "There are days when you wake up and say, <em>I'm going to painstakingly make the best damn Tex-Mex migas I possibly can</em>. And then there are days when you pry yourself from bed, feel your head swirl and split as you sit up, and remember those last two rounds of shots you got roped into&mdash;after you had already had what was supposed to be your last drink. On those days, you need these quick and easy Doritos migas. Actually, you might need these on all days.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Mother's Day", "Tex-Mex", "Vegetarian"], "recipeIngredient": ["8 large eggs", "Kosher salt", "2 plum tomatoes, diced", "3 tablespoons vegetable, canola, or peanut oil", "1 medium red or yellow onion, diced (about 1 cup)", "2 jalapeños, stemmed, seeded, and diced (about 3 tablespoons)", "1 cup crushed Nacho Cheese-flavored Doritos, plus finely crushed Doritos for granish", "3 ounces pepper jack cheese, grated or diced (about 1/2 cup)", "Freshly ground black pepper", "<a href=\"http://www.seriouseats.com/2011/10/video-the-right-way-to-warm-corn-tortillas.html\">Warmed corn tortillas</a>, for serving (optional)", "Diced avocado, for serving (optional)", "Hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk eggs with 2 generous pinches of salt and set aside. In a medium bowl, toss tomatoes with a generous pinch salt, then transfer tomatoes to a strainer and set over bowl to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large cast iron or non-stick skillet over medium-high heat until shimmering. Add onion and jalapeños and cook, stirring, until softened but not browned, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add eggs and cook, stirring until curds begin to form, 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in 1 cup crushed Doritos and continue to cook until eggs are nearly set, about 2 minutes. Stir in cheese until mostly melted. Add tomatoes and continue to cook, stirring, until tomatoes are warmed through and eggs are just cooked, 1-2 minutes longer. Season with salt and pepper and remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve migas with warm tortillas and avocado, if desired, and top with crushed Doritos and hot sauce.</p>"}]}