{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140306-pressed-muffuletta-sandwich-recipe-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["caramelized onion", "eggplant", "goat cheese", "onion", "pressed sandwich", "red pepper", "roasted red pepper", "sandwich", "shooter's sandwich", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "3"}, "name": "Roasted Vegetable and Goat Cheese Shooter's-Style Sandwich", "link": "https://www.seriouseats.com/recipes/2014/03/roasted-vegetable-goat-cheese-caramelized-onion-eggplant-zucchini-pepper-portobello-shooter-sandwich-food-lab-recipe.html", "description": "Roasted vegetables, caramelized onions, and goat cheese are packed into a hollowed out loaf of bread, wrapped tightly, and then pressed under heavy weights for several hours to pack all the flavors into a perfect, bite-height sandwich.", "totalTime": "5 1/2 and up to overnight", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Eggplant", "Onion", "Sandwiches", "The Food Lab", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 medium eggplant, cut into 1/2-inch slices", "Kosher salt", "2 tablespoons butter", "2 large onions, thinly sliced", "3 to 4 large portobello mushrooms, stems and dark gills removed", "1/4 cup olive oil", "1 medium zucchini, cut into 1/4-inch slices", "6 ounces fresh goat cheese, crumbled", "1 (8 ounce) jar roasted red peppers, or two whole red bell peppers <a href=\"http://www.seriouseats.com/2010/07/how-to-roast-peppers.html\">roasted at home</a>", "1 loaf rustic sesame-crusted bread or ciabatta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 450°F. Place eggplant slices on a rimmed baking sheet lined with a double layer of paper towels. Season well on both sides with kosher salt. Let rest for 30 minutes, turning once half way through, to allow excess moisture to be extracted. Top with a double layer of paper towels and press down very firmly on each slice to compress. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While eggplants drain, cook the onions. Melt butter in a large heavy-bottomed stainless steel or enameled cast iron saucepan over medium-high heat. Add onions and cook, stirring frequently, until bottom of saucepan is glazed in a pale brown fond, about 8 minutes. Add 2 tablespoons water and scrape up fond with wooden spoon. Continue to cook, stirring frequently, until fond has built up again, about 3 minutes longer. Add 2 more tablespoons water and scrape up browned bits. Repeat cooking, adding water, and scraping until onions are completely softened and a deep, dark brown, about 20 minutes total. Season to taste with salt. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When eggplants are drained and compressed, toss in a large bowl with 1 tablespoon oil. Score a faint cross-hatch pattern into the tops of each portobello mushroom. Rub mushrooms with another tablespoon oil and season with salt. Transfer eggplant and mushrooms to a wire rack set in a rimmed baking sheet. Transfer to oven and cook for 10 minutes. Flip eggplant slices and mushrooms and continue cooking until mushrooms are tender and well browned, about 10 minutes longer. Transfer mushrooms to a plate and set aside. Continue cooking eggplant until golden brown but not burnt, about 10 minutes longer. Remove from oven and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons olive oil in a large skillet over medium-high heat until shimmering. Add as many zucchini slices as will fit in one layer, season with salt, and cook, swirling pan occasionally, until golden brown on first side, about 3 minutes. Carefully flip slices using a thin metal spatula, season with salt, and cook until second side is browned, about 3 minutes longer. Transfer to a paper towel-lined plate to drain and repeat with any remaining zucchini slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble Sandwich:</strong> Slice off the top 1 to 1 1/2-inches of the loaf of bread using a bread knife. Cut around the perimeter of the interior crumb, making sure not to break through the bottom crust, then use your hand to lift out the excess bread from the inside, leaving you with a hollow bread boat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread half of the caramelized onions into the bottom of the bread boat. Top with half the roasted red peppers, half the eggplant, half the goat cheese, half the zucchini, and the portobellos. Top with remaining zucchini, goat cheese, eggplant slices, roasted peppers, and caramelized onions. Close sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap sandwich tightly in aluminum foil or burtcher's paper, then place in between two stiff cutting boards. Place a heavy weight on top (about 40 pounds), press down firmly to flatten sandwich, then let rest under the weight at room temperature for at least 4 hours and up to overnight (keep an eye on the sandwich to ensure that it is pressing evenly).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to eat, remove weights, slice sandwich into four to six pieces through paper or foil with a bread knife, unwrap, and serve.</p>"}]}