{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140202-280071-popheart10.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["breakfast sweet", "nutella", "pastry", "pop-tarts", "Valentine's Day"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pop-Hearts (Nutella Filled Hand Pies)", "link": "https://www.seriouseats.com/recipes/2014/02/pop-hearts-nutella-filled-hand-pies-valentine-recipe.html", "description": "In this toothsome homemade take on a commercial classic, a tender, flaky heart shaped crust is filled with Nutella, then baked to crispy-on-the edges, soft-on-the-inside perfection. A healthy dollop of confectioners' sugar glaze with rainbow sprinkles makes these treats as adorable as they are sweet.", "totalTime": "30 minutes", "recipeYield": "Makes 10 approximately 3-inch hearts", "recipeCategory": ["Breakfast Sweets", "Cakespy", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Pastry</strong>", "1 1/2 cups (about 6.375 ounces) all-purpose flour", "1/2 teaspoon salt", "1/2 cup (1 stick, or 4 ounces) cold unsalted butter, cut into pieces", "3 tablespoons cold water", "1 egg, lightly beaten", " ", "<strong>For the Filling</strong>", "1/2 cup (about 4 3/4 ounces) Nutella (or jam, or peanut butter; up to you) ", " ", "<strong>For the Icing</strong>", "1 cup (about 4 ounces) confectioners' sugar, sifted", "3-4 teaspoons milk or cream, to thin "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450°F. Line a baking sheet with parchment paper; set to the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour and salt in a large bowl. Add butter and blend with a fork, pastry cutter, or your impeccably clean hands. Blend until the mixture is fairly coarse. Add the water, bit by bit, gently mixing the dough after each addition, until the dough is cohesive enough to form a ball. If you want to stop here and resume in a few hours or in the morning, flatten the dough into a disk, wrap in plastic wrap, and store in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place dough on a lightly floured surface and roll into a rectangle, about 1/8 inch thick. Using your heart cutter, cut out as many hearts as you can; re-roll the scraps to get a few extra. I ended up with 20 approximately 3-inch hearts. Since it takes two cutouts to make each Pop-Heart, this means I was able to make 10 pastries total. You may end up with a different amount if you use a different sized cutter. This is fine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place half of the heart cutouts on the prepared parchment-lined sheet with at least an inch of space around. Place a small spoonful of Nutella in the center of each heart, leaving space on all sides. I know you love Nutella, but don't add too much, otherwise it will make for an unsightly mound. If you don't love Nutella (non-believer!) use jam, peanut butter, or ganache. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly brush the egg wash around the sides of the pastry, taking care not to touch the Nutella too much. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining heart shaped cutouts of dough on top of the ones with Nutella. The egg wash should help it stick. Crimp all four edges by hand or with a fork to further ensure that your filling won't ooze out. I also poked the top of each with a fork, to vent them. You can brush the tops of the pastries with the egg wash, too, if desired, but I found that unbrushed created a more traditional pop-tart look. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the tarts on your prepared baking sheet, and bake for 7 to 8 minutes, or until light golden on the edges. This can take longer if your cutouts are bigger or thicker; look for a light browning along the edges and a dull finish on top of the tarts. Remove from the oven and let them cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the tarts cool, prepare your icing by mixing the confectioners'  sugar with milk or cream, 1/2 teaspoon at a time, until it is just thin enough to be drizzled, but not too liquid. If desired, stir in a drop or two of food coloring. Drizzle on top of the tarts, and add sprinkles immediately (as the glaze is applied it becomes firm quickly, and the sprinkles won't stick unless added right away). </p>"}]}