{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140608-btb-brooklynblackout.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cake", "chocolate", "cupcake", "dessert", "Robicell's: A Love Story with Cupcakes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Robicelli's Brooklyn Blackout Cupcakes", "link": "https://www.seriouseats.com/recipes/2014/06/robicellis-brooklyn-blackout-cupcakes.html", "description": "Brooklyn Blackout cupcakes from <strong><em><a href=\"http://www.amazon.com/Robicellis-Cupcakes-Decidedly-Grown-Up-Recipes/dp/0670785873/?tag=serieats-20\" target=\"_blank\">Robicelli's: A Love Story, with Cupcakes</a></em></strong> are made with enough chocolate to drown in. A base of chocolate cake is covered with chocolate custard buttercream, then dipped in a fudge glaze and sprinkled with chocolate cake crumbs. Based on the famous Blackout cake from Ebinger's Bakery, the beloved Brooklyn institution.", "totalTime": "2 hours 30 mins", "recipeYield": "makes 23 cupcakes", "recipeCategory": ["Bake the Book", "Cakes", "Chocolate", "Desserts"], "recipeIngredient": ["<strong>Chocolate Cake</strong>", "3/4 cup cocoa powder", "2/3 cup scalding-hot coffee", "2/3 cup buttermilk", "1/3 cup canola or grapeseed oil", "1 teaspoon pure vanilla extract", "1 large egg", "1 large egg yolk", "1/2 teaspoon kosher salt", "1 1/3 cups all-purpose flour", "1 3/4 cups sugar", "3/4 teaspoon baking powder", "1/2 teaspoon baking soda", "&nbsp;", "<strong>Chocolate Custard Base</strong>", "1/2 cup milk", "1/2 cup heavy cream", "1/3 cup sugar", "1/4 cup Dutch-process cocoa powder", "1 large egg", "1 large egg yolk", "1/8 cup cornstarch", "1 tablespoon unsalted butter", "1 1/2 teaspoons pure vanilla extract", "&nbsp;", "<strong>Chocolate Custard Buttercream</strong>", "One recipe French Buttercream (ingredients below)", "Chocolate custard base (ingredients above)", "&nbsp;", "<strong>French Buttercream</strong>", "1 cup water", "2 cups sugar", "2 tablespoons corn syrup", "1/4 teaspoon cream of tartar", "5 egg yolks", "1 whole egg", "1/8 teaspoon xanthan gum", "1 1/2 lbs cold butter, preferably European", "&nbsp;", "<strong>Chocolate Fudge Glaze</strong>", "1 1/2 cups semisweet chocolate, chopped", "4 tablespoons (1/2 stick) unsalted butter", "2 tablespoons corn syrup", "1/2 teaspoon pure vanilla extract", "&nbsp;", "<strong>To Finish</strong>", "Chocolate cake crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Cake</strong>: Preheat the oven to 350°F. Line two cupcake pans with 24 baking cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cocoa powder in the bowl of a stand mixer with the paddle attachment and pour the hot coffee over. Mix on low speed until a thick paste forms and the mixture stops steaming, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the mixer speed to medium. In a 4-cup measuring cup, combine the buttermilk, oil, vanilla, egg, egg yolk, and salt and mix lightly with a fork, ensuring the yolks are broken. Slowly pour into the mixer bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stop the mixer, detach the paddle, and scrape the bottom of the bowl well to loosen any caked-on cocoa. Reattach the paddle and turn the mixer to medium, letting it run for 1 minute. Stop the mixer again.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, sugar, baking powder, and baking soda and add to the batter. Mix on low speed until just combined. Remove the bowl and paddle and use the paddle to scrape down the sides of the bowl, ensuring everything is mixed.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop the batter into the prepared baking cups, filling them two thirds of the way. Bake in the middle of the oven for 20 to 25 minutes, rotating the pans halfway through. The cupcakes are done when the centers spring back when you touch them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cupcakes from the oven. Let cool completely. Set 1 cupcake aside for crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Custard Base:</strong> Set out a mixing bowl, a whisk, a medium heavy-bottomed saucepan, a heatproof spatula, and a strainer.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the milk, cream, and half of the sugar in the saucepan and cook on medium-high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the mixing bowl, combine the remaining sugar, the cocoa powder, egg, egg yolk, and cornstarch. Whisk well until pale yellow.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the milk mixture comes to a boil, immediately remove it from the heat, leaving the stove on. While whisking vigorously, slowly pour the hot milk mixture into the egg mixture. Pour it all back into the saucepan and return to the heat, stirring constantly with the heatproof spatula (make sure you get into those corners!).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the mixture back to a boil. The custard will be very thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in a food processor and process until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the custard base in a small bowl and whisk in the butter and vanilla. Refrigerate until cold and set, 30 to 60 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Custard Buttercream</strong>: In a heavy nonreactive saucepan, add water, then add sugar, corn syrup, and cream of tartar. The last two help keep the sugar from crystallizing. Put the pot on high heat. It's going to be there for a while. Be patient and keep your eye on it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the yolk and eggs in a stand mixer with the whisk attachment and turn to high. Just let it go! Eggs will triple in volume and go to the \"ribbons\" stage. You can't overwhip!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wait on the sugar, looking for 235°F, aka \"soft ball.\" When it happens, be ready to move quickly. Turn off the mixer and add the xanthan gum, turn back up to medium. Remove the thermometer from the hot sugar. Lift with two hands. Rest the lip of the saucepan on the edge of the mixer bowl. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly tilt and pour the sugar in a slow, steady stream down the side of the bowl. Don't go too fast! If you do there will be chunks of scrambled eggs in your buttercream. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the sugar is all in, turn the mixer to high. Beat until cool. Gauge this by putting the inside of your wrist to the outside of the bowl. It's more accurate than your hands. Switch out the whisk for the paddle. Next we're adding the butter. It's too heavy for the whisk and you'll end up breaking your stand mixer if you stay with the whisk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start cutting the butter into thin pieces - you could shave it with a cheese slicer if you'd like. Add the butter piece by piece.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once your butter is added, add the refrigerated chocolate custard base and mix on high to combine. It should be fluffy and make you want to eat it with your fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chocolate Fudge Glaze</strong>: Place the chocolate, butter, and corn syrup in a microwave-safe bowl. Microwave at 60 percent power at 1-minute intervals until the butter and chocolate are completely melted. Add the vanilla and stir until combined. Let sit out at room temperature to cool. Do not refrigerate or the glaze will become solid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assembly:</strong> Fill a pastry bag fitted with a plain tip with the chocolate custard buttercream and pipe onto each chocolate cupcake. Place the cupcakes in the refrigerator and allow to set, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the reserved cupcake, place in a processor, and pulse to make cake crumbs. Alternately, you can rip the cupcake into pieces, then rub them between your hands (though this gets messy).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cupcakes from the refrigerator and dip the tops in the chocolate glaze, letting the excess drip off back into the bowl. Place right side up and sprinkle with chocolate cake crumbs.</p>"}]}