{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140422-290868-dinner-tonight-quesadilla-chicken-zucchini.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["cheese", "chicken", "cinco de mayo", "Mexican", "quesadilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Quick Chicken and Zucchini Quesadillas", "link": "https://www.seriouseats.com/recipes/2014/04/quick-chicken-zucchini-quesadillas-recipe.html", "description": "Basic cheese-and-tortilla quesadillas are a quick snack, but by adding simple ingredients like sweet sautéed zucchini, smoky chipotle chilies, and shredded roast chicken, they become a weeknight meal that still takes almost no time to make.", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["Cheese", "Chicken", "Dinner Tonight", "Mains", "Mexican"], "recipeIngredient": ["4 tablespoons unsalted butter, divided ", "1/2 medium onion, thinly sliced", "2 medium cloves garlic, thinly sliced ", "2 medium zucchini, halved lengthwise, thinly sliced crosswise ", "Kosher salt and freshly ground black pepper ", "1 to 2 chipotles, chopped, plus 2 teaspoons adobo sauce from one (7-ounce) can", "2 cups shredded roast chicken meat (1 pound)", "1/2 pound Mexican melting cheese, such as queso Oaxacan, or Monterrey Jack, grated on a box grater", "8 corn tortillas", "<a href=\"http://www.seriouseats.com/recipes/2012/01/the-best-basic-guacamole-recipe.html\">Guacamole</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 250&deg;F and set a heat-proof plate in it. Melt 2 tablespoons butter in a large cast-iron skillet over medium heat. Stir in onion, garlic, and zucchini and season with salt and pepper. Cook, stirring occasionally, until onion and zucchini slices are tender and starting to brown, about 7 minutes. Stir in chipotle and adobo sauce and cook for 1 minute. Stir in chicken and cook until warm, about 2 minutes. Season with salt and pepper, transfer mixture to a large bowl, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet and heat over medium heat. Working one at a time, warm tortillas in the skillet until pliable, about 10 seconds per side, then transfer to a work surface. Scoop 3 tablespoons of chicken filling and a generous sprinkling of cheese on top, and fold in half over the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 tablespoon of butter in the skillet over medium heat until foaming. Add half of the quesadillas in a single layer, turning to coat both sides in butter. Cook quesadillas until lightly browned and crusty on the bottom, 3 to 4 minutes. Flip and brown on the other side, 3 to 4 minutes longer. Transfer cooked quesadillas to the plate in the oven, and repeat process with remaining quesadillas and butter. Serve with a generous dollop of guacamole on the side. </p>"}]}