{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140402-288249-cook-the-book-braised-artichokes-with-leeks-and-peas.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["artichoke", "braise", "Cook the Book", "leek", "pea", "the new vegetarian cooking for everyone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Braised Artichokes With Leeks and Peas From 'The New Vegetarian Cooking for Everyone'", "link": "https://www.seriouseats.com/recipes/2014/04/braised-artichokes-with-leeks-and-peas-from-t.html", "description": "While <a href=\"http://deborahmadison.com/\" target=\"_blank\">Deborah Madison</a> includes plenty of recipes for starchy or bean-filled dishes in her cookbook, <em><a href=\"http://www.amazon.com/The-New-Vegetarian-Cooking-Everyone/dp/1607745534/?tag=serieats-20\" target=\"_blank\">The New Vegetarian Cooking for Everyone</a></em>, her straightforward vegetable preparations are the true heart of the book.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Braising and Stewing", "Cook the Book", "Gluten-Free", "Mains", "Vegetarian"], "recipeIngredient": ["4 large artichokes", "2 1/2 to 3 cups homemade vegetable stock or water", "2 leeks, including an inch of the greens, sliced into 1/4-inch rounds", "2 fennel bulbs, cut into 1-inch wedges, joined at the root end", "2 tablespoons butter or olive oil", "1/4 cup diced shallot", "1/2 cup white wine", "1 teaspoon sea salt", "12 ounces yellow-fleshed or new red potatoes, scrubbed and cut into quarters", "1/2 or less cup crème fraîche", "1 teaspoon Dijon mustard", "1 cup shelled peas or fava beans", "3 tablespoons chopped fennel greens or parsley", "Freshly milled pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the artichokes by snapping off several layers of the tough outer leaves by pulling them downward so that they break off at the base. Stop when the inner leaves become a lighter yellowish green and look tender. Trim the stem and slice off the top third of the artichoke. With a pairing knife, smooth the rough areas around the base, removing any dark green parts. Cut the trimmed artichoke into quarters and remove the fuzzy chokes with a pairing knife. Slice into sixths, and set them aside in a bowl of acidulated water (water and lemon juice or vinegar) until ready to cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a wide soup pot over medium-high heat. Add the shallot and leeks and cook, stirring frequently, without browning for 3 to 4 minutes. Add the wine, raise the heat, and simmer for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain the artichokes and add them to the pan with the fennel and stock. Season with 1 teaspoon sea salt, then press a piece of crumbled parchment or wax paper directly over the vegetables. Bring the liquid to a boil, then simmer, covered, until the artichokes are tender, about 25 minutes. Meanwhile, steam the potatoes until tender, 10 to 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the artichokes and fennel are tender, remove them with a slotted spoon to a dish. Whisk enough crème fraîche and the mustard into the broth and boil briskly to make a thin sauce, 5 to 10 minutes. Add the peas and cook until tender, then return the vegetables and potatoes to the broth. Add the chopped fennel greens, season with pepper, and serve.</p>"}]}