{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130523-smoked-ribeye-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "grill", "grilling", "porterhouse", "steak", "t-bone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Slow-Smoked Porterhouse Steaks", "link": "https://www.seriouseats.com/recipes/2014/06/slow-smoked-porterhouse-steak-recipe.html", "description": "Smoking is generally a method reserved for long-cooking, tough cuts like pork shoulder, ribs, or beef brisket, intended to deeply flavor and tenderize the meat over the course of a half day of cooking. But with a bit of finesse and a couple hours of free time, it's perfectly possible to get that same smoky flavor into a thick-cut steak and <em>still</em> have it come out perfectly medium-rare and juicy, so long as you play your cards right. Here's how it's done.", "totalTime": "3 hours", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Father's Day", "Mains"], "recipeIngredient": ["2 whole porterhouse steaks, at least 1 1/2 inches thick (30 to 40 ounces each; see note)", "Kosher salt and freshly ground black pepper", "8 chunks hickory or mesquite hardwood"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season steaks generously with salt and pepper on all sides, including edges. Stack steaks on a wooden cutting board, then insert 3 or 4 metal skewers through both steaks to secure them. Turn them on their sides, and spread them out on the skewers. They should stand on their edges without falling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light 8 coals using a chimney starter. Place all the way on one edge of the coal grate in a charcoal grill. Alternatively, set one set of burners on a gas grill to low. Place 2 wood chunks on top of coals, add cooking grate, and place steaks on cooking grate with tenderloins facing upwards and bones pointing towards the coals (see photograph).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover grill and set top and bottom vents to 3/4 closed. Position top vents over steaks. Cook, adding up to 8 more coals and remaining wood chunks to keep temperature under the grill at around 175 to 200&deg;F. Monitor internal temperature of the steaks regularly and cook until steaks register 110 to 115&deg;F for medium-rare or 120&deg;F for medium, 1 1/2 to 2 hours. Remove steaks from grill and set aside on a cutting board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"https://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"https://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"https://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place steaks directly over hot side of grill. Cover and cook for 45 seconds. Flip steaks, cover, and cook for 45 seconds longer (steaks should be well charred on both sides). Remove to a cutting board, carve, and serve.</p>"}]}