{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140425-bake-the-book-teenys-tour-of-pies-grapefruit-pom.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["curd", "grapefruit", "pie", "pomegranate", "Teeny's Tour of Pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Teeny Lamothe's Grapefruit Pomegranate Pie", "link": "https://www.seriouseats.com/recipes/2014/04/teeny-lamothes-grapefruit-pomegranate-pie.html", "description": "There are several fruits in this pie, but not in the way you'd expect. First, an egg yolk-and-cornstarch grapefruit custard is made, into which is added a cup of pomegranate seeds. The entire thing is ensconced in a whole-wheat crust, garnished liberally with whipped cream and, of course, more pomegranate seeds.", "totalTime": "several hours, including baking and cooling", "recipeYield": "makes 1 9-inch single-crust pie", "recipeCategory": ["Bake the Book", "Desserts", "Grapefruit", "Pies, Tarts, and Crumbles", "Pomegranate"], "recipeIngredient": ["1 1/4  cups granulated sugar", "4 tablespoons packed cornstarch", "2 cups freshly squeezed grapefruit juice (from 3 to 4 grapefruits)", "3 large egg yolks", "2 tablespoons unsalted butter", "1/2 teaspoon lemon extract", "1 1/4 cups pomegranate seeds", "1 prebaked 9-inch whole wheat crust (ingredients below)", "&nbsp;", "<strong>Whole Wheat Crust</strong>", "1 1/2 cups all-purpose flour ", "1 cup white whole wheat or whole wheat flour", "2 teaspoons salt", "2 tablespoons granulated sugar ", "3/4 cup (1 1/2 sticks) cold unsalted butter, cut into small pieces", "1/2 cup (4 tablespoons) cold vegetable shortening", "1/4 cup (4 tablespoons) cold vodka ", "1/2 cup (8 tablespoons) cold water, plus extra as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pie crust:</strong> In a large bowl, stir together the flour, salt, and sugar until everything is thoroughly combined. Add the butter and shortening and cut the mixture together using a pastry cutter until it forms small pea-size crumbs coated in flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the vodka evenly over the dry ingredients, a few tablespoons at a time, using a rubber spatula to press the dough together. Similarly, add the water, and continue to press the dough together to form a large ball. The dough should be fairly wet and sticky; if for some reason it seems particularly dry, add a little extra ice water a tablespoon at a time until everything comes together easily. (Be careful to work the dough as little as possible; otherwise the crust may be tough.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into two equal balls, press each into a disk, wrap each in plastic, and refrigerate for at least an hour or up to 2 days before rolling out.</p>\n\n<p>Note: This recipe calls for only one disk of dough; the other can be kept in the freezer up to 3 months. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prebake the shell, place dough in pie plate. Prick the bottom and sides with a fork. Freeze for twenty minutes, until dough is hard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350. Remove frozen dough and line with parchment paper or aluminum foil, taking care to press it up along the sides. Fill the paper or foil with pie beads or dried beans or peas. Bake the crust until it's set, about 15 minutes, then lift out the weighted parchment or foil and let the crust bake until it's golden brown, an additional 10 minutes or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the crust cool on a wire rack or countertop, and fill with grapefruit curd. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the filling:</strong> Whisk together the sugar and cornstarch in a medium saucepan until combined. In a small bowl whisk together the egg yolks with 3/4 cup water. Stir in the grapefruit juice, and pour into the saucepan. Whisk everything together until the mixture is smooth and a little frothy; the sugar and cornstarch should be fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the grapefruit mixture over medium heat, whisking constantly, until it begins to simmer slightly, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue to cook, still whisking constantly, over medium heat until the mixture comes to a full boil, about 1 minute. Let boil for 1 minute, again whisking constantly and scraping the bottom of the pan so the mixture doesn’t scorch. Immediately remove from the heat. The mixture should easily coat the back of a spoon and look smooth and glassy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter and the lemon extract to the grapefruit curd and whisk until smooth. Fold in 1 cup of the pomegranate seeds with a rubber spatula until they are evenly distributed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the hot grapefruit curd into the pie shell and let sit, uncovered, at room temperature to set and cool completely, at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread whipped cream over the cooled pie, scatter with the remaining pomegranate seeds, and serve.<br />\n</p>"}]}