{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140318-286691-cook-the-book-piccalilli-relish.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "irish", "my irish table", "pickle", "relish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Piccalilli From 'My Irish Table'", "link": "https://www.seriouseats.com/recipes/2014/03/piccalilli-from-my-irish-table.html", "description": "Piccalilli is a heavily spiced Irish relish derived from Indian pickles. <a href=\"http://www.restauranteve.com/index.cfm/restaurant/an-irish-souls-culinary-passion/\" target=\"_blank\">Cathal Armstrong</a>'s recipe in his new cookbook, <em><a href=\"http://www.amazon.com/My-Irish-Table-Homeland-Restaurant/dp/1607744309\" target=\"_blank\">My Irish Table</a></em>, blends golden beets, cipollini onions, cauliflower, and radishes with a vinegary paste made with turmeric, mustard, and sugar.", "totalTime": "At least 6 1/2 hours", "recipeYield": "Makes about 5 pints", "recipeCategory": ["Condiments and Sauces", "Cook the Book", "Pickling", "Sides", "Vegetarian"], "recipeIngredient": ["2 pounds large (3-inch-diameter) white or golden beets, unpeeled but trimmed of greens and tips", "6 tablespoons kosher salt", "2 quarts water", "2 cups cauliflower florets (cut into 1-inch pieces, about 10 ounces)", "5 cups whole peeled and trimmed cipollini onions (about 24 ounces)", "2 cups halved radishes (stem and root ends removed, about 12 ounces)", "3/4 cup ground turmeric", "3/4 cup all-purpose flour", "1 cup sugar", "1/2 cup Dijon mustard", "4 cups Champagne vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook the beets:</strong> Cover the beets with cold water in a heavy saucepan and boil until fork tender, about 1 1/2 hours. Drain them in a colander and let them cool just until you can handle them. Peel them warm (the skin slides right off if they’re warm), then cut them into 3/4-inch cubes. You should have about 3 cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Brine the vegetables:</strong> Place the salt and 1 quart of the water in a 2-gallon zip-top bag. Seal the bag and massage it a few times to help dissolve the salt. Add the beets, cauliflower, onions, and radishes to the bag along with the remaining 1 quart of water. Seal the bag again, pressing out any air, so that the vegetables are completely submerged. Place the bag in a large bowl (to stabilize it) and let the vegetables sit on the counter for several hours, or refrigerate overnight. When ready to use, drain the vegetables in a colander, rinse them in cold water, and drain again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the sauce:</strong> In large flameproof casserole, whisk together the turmeric, flour, sugar, mustard, and 1 cup of the vinegar to make a paste. Add the remaining 3 cups of vinegar and whisk until smooth. Over medium heat, bring the sauce to a boil and cook until it thickens, about 3 minutes, whisking continually to keep lumps from forming. Add the vegetables, stirring to coat them, and cook for 5 minutes. Remove from the heat and allow the mixture to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Store the piccalilli:</strong> Refrigerate the piccalilli for up to 2 weeks.</p>"}]}