{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140110-preserved-rosehipcordial-horiz.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["cordial", "mocktail", "nonalcoholic", "rose hip", "syrup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Rose Hip Cordial", "link": "https://www.seriouseats.com/recipes/2014/01/rosehip-cordial-recipe.html", "description": "This is a slightly opaque red-orange syrup. Definitely fruity, a little floral, and with a hint of savory flavor&mdash;not unlike yellow tomatoes. Dilute it with seltzer for a sophisticated spritzer or use it as a sweet base for a winter cocktail.", "totalTime": "2 hours, including foraging", "recipeYield": "Makes 1 liter", "recipeCategory": ["Drinks", "Non-Alcoholic", "Preserved"], "recipeIngredient": ["1 pound rose hips (a heaping quart, see note) ", "5 cups water", "1 cup granulated sugar", "juice of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash rose hips well, and trim off any stems and large (flower) ends. Discard any that are split or seem otherwise compromised. Pulse in a food processor, in batches if necessary, until finely chopped.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rose hips a large sauce pan, and add three cups of water. Bring water to a boil. Once water boils, allow to cook for a minute and then turn off heat, cover and allow the mixture to steep for 15-20 minutes. Then, remove lid and allow mixture to cool slightly, <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour mixture into a jelly bag set over a large bowl and drain until pulp feels relatively dry. Return pulp to the saucepan and repeat the boil-seep-drain process with the remaining two cups of water. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard pulp after it has completely drained for a second time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean saucepan, combine the sugar and the rose hip syrup and bring to a boil. Simmer ten minutes until slightly reduced. Remove from heat, add lemon juice and allow to cool completely. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cool, bottle cordial and store in the fridge. It will keep for several weeks, but it will have the best flavor for only about ten days. </p>"}]}