{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140908-aguachile-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Mexican", "keywords": ["aguachile", "ceviche", "easy", "fish", "Latin American", "Mexican", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Arctic Char Aguachile With Habanero, Jicama, and Lime", "link": "https://www.seriouseats.com/recipes/2014/09/artic-char-aguachile-ceviche-cucmber-recipe.html", "description": "If you love ceviche, then Mexico's <em>aguachile</em> is for you. Traditionally made with raw shrimp, lime juice, chilies, cucumber, and onion, it's served immediately while still totally raw, unlike most other ceviche recipes. In this variation, fresh arctic char is tossed with lime juice, habanero chilies, jicama, coriander seed, and red onion, then served with tostadas and avocado (and if you like, beer or tequila).", "totalTime": "20 minutes plus 1 to 2 hours salting time", "recipeYield": "Serves 4 to 6 as a snack or appetizer", "recipeCategory": ["Fish", "Latin American", "Mexican", "Sides", "Snacks"], "recipeIngredient": ["3/4 pound sashimi-grade arctic char fillet, skinned and trimmed of any dark flesh (see note)", "Sea or kosher salt", "1/2 stemmed and seeded habanero pepper, roughly chopped (see note)", "3 tablespoons water", "5 tablespoons fresh juice from 5 limes", "1/4 cup packed mint leaves (from about 5 large sprigs), roughly chopped", "Freshly ground black pepper", "1/4 cup peeled and diced jicama", "1/4 cup thinly sliced red onion", "2 tablespoons whole coriander seed", "Tostadas and fresh avocado, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split fillet lengthwise along natural division, trimming away center line with any sinew or bones. Then slice the fillet halves crosswise into thin strips. Arrange sliced fish on a large plate and sprinkle all over with salt. Cover with plastic and refrigerate for at least 1 hour and up to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, blend habanero with water in a blender or with an immersion blender until thoroughly blended. Add lime juice and mint and blend until pureed. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, toss arctic char with habanero-lime marinade, jicama, onion, and coriander seed. Season once more with salt and pepper and serve right away with tostadas and avocado.</p>"}]}