{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140410-289474-dinner-tonight-cheesy-grits-sauteed-ham-and-kale.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["grits", "ham", "kale"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "5"}, "name": "Cheesy Grits With Sautéed Ham and Kale", "link": "https://www.seriouseats.com/recipes/2014/04/cheesy-grits-ham-kale-recipe.html", "description": "Cheesy grits may be delicious as a side dish, but top them with kale that's been simmered in chicken stock with smoky ham and they become a flavorful, hearty meal. A dash of vinegary hot sauce, and you may never want to eat them on their own again.", "totalTime": "30 minutes", "recipeYield": "serves 4", "recipeCategory": ["Dinner Tonight", "Ham", "Kale", "Mains", "Other Grains"], "recipeIngredient": ["2 cups whole milk", "2 cups water, plus more as necessary", "1 cup coarse ground grits", "2 teaspoons kosher salt, plus more for seasoning", "6 tablespoons unsalted butter, divided", "4 ounces cheddar cheese, grated", "1 ounce Parmesan cheese, grated", "Freshly ground black pepper", "2 medium garlic cloves, thinly sliced", "4 ounces sliced smoked ham, chopped ", "1 large bunch kale (about 1 pound) tough stems removed, leaves roughly chopped ", "1/2 cup unsalted chicken stock", "Hot sauce, for serving (such as Louisiana Hot Sauce or Frank's Red Hot)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring milk and water to a boil in a medium saucepan over high heat. Stir in grits and the 2 teaspoons of salt, and reduce heat to a bare simmer. Cook, stirring occasionally, until grits are thick and creamy, about 25 minutes. When done, turn off the heat, stir in 4 tablespoons butter and the cheddar and Parmesan cheeses. Season with salt and pepper, and thin with water if the grits have become too thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt remaining 2 tablespoons of butter in a large non-stick skillet over medium heat. Add garlic and cook until fragrant, about 30 seconds. Add ham, and cook, stirring occasionally, until crisp around the edges, about 2 minutes. Add the kale a few handfuls at a time and cook, stirring, until wilted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour stock into skillet, cover, and cook, stirring occasionally, until kale is just tender, about 5 minutes. Season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the grits into bowls and top with the kale and ham. Drizzle with hot sauce and serve. </p>"}]}