{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140605-294475-cook-the-book-buttermilk-bacon-fat-flour-tortillas.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Mexican", "keywords": ["Cook the Book", "Mexican", "Southern", "the homesick texan's family table", "tortilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Buttermilk Bacon-Fat Flour Tortillas From 'The Homesick Texan's Family Table'", "link": "https://www.seriouseats.com/recipes/2014/06/buttermilk-bacon-fat-flour-torillas-from-the.html", "description": "For some reason, homemade flour tortillas have always intimidated me. I've made corn tortillas many times, so I'm not sure where the reluctance came from. But once I saw <a href=\"http://www.homesicktexan.com/\" target=\"_blank\">Lisa Fain</a>'s recipe for buttermilk and bacon-fat filled flour tortillas in her new cookbook, <em><a href=\"http://www.amazon.com/The-Homesick-Texans-Family-Table/dp/1607745046/?tag=serieats-20\" target=\"_blank\">The Homesick Texan's Family Table</a></em>, I could resist no longer.", "totalTime": "1 hour and 45 minutes", "recipeYield": "Makes 8 tortillas", "recipeCategory": ["Bread", "Cook the Book", "Mexican", "Pork"], "recipeIngredient": ["2 tablespoons bacon grease (see note)", "2 tablespoons unsalted butter", "2 cups all‐purpose flour", "1/2 teaspoon baking powder", "1/4 teaspoon kosher salt", "3/4 cup buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the bacon grease and butter in a pot and cook over medium-low heat until bacon grease and butter have melted. remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, stir together the flour, baking powder, and salt. Pour in the melted fat mixture and stir until the flour is crumbly. Pour in the buttermilk and stir until a soft dough forms. Place the dough on a floured surface and knead for 2 minutes until the dough is firm and smooth. Cover the dough and let it rest for an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into eight pieces and roll each piece into a ball. One at a time place a dough ball on a floured surface, pat it out into a 4-inch circle, and then roll with a palote or rolling pin from the center out until the tortilla is thin and about 8 inches in diameter. Keep the rolled-out tortillas covered, side by side, until you are ready to cook. (I usually have one cooking as I roll out another.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a dry cast-iron skillet heated over medium-high heat, cook each tortilla for 30 seconds on one side, flip it, and then cook for 1 minute on the other side. It should start to puff a bit. Flip it again and cook for 30 more seconds. Cover the cooked tortilla with a cloth until you are ready to serve. Repeat with the remaining balls of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> Bacon grease is what’s left over in the skillet after cooking bacon. While our great-grandmothers usually kept theirs in an old coffee can over the stove, to save my bacon grease, I pour it into a glass jar and store it in the refrigerator.</p>"}]}