{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141116-vegan-thanksgiving-roast-recipe-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["carrot", "fall", "mushroom", "phyllo", "roast", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4285714285714", "ratingCount": "14"}, "name": "Vegetables Wellington (The Ultimate Vegan Plant-Based Holiday Roast)", "link": "https://www.seriouseats.com/recipes/2014/11/vegetables-wellington-the-ultimate-plant-based-vegan-holiday-roast-recipe.html", "description": "Coming up with a vegan holiday roast is a daunting task! It can't just take the place of the turkey or the prime rib nutritionally, it's got to cover all of those mental bases as well. Not only does it have to taste spectacular, but it's got to look stunning at the center of the table, with rich, deep flavors that scream fall and winter. What I ended up with was a vegan roast that is so pretty, so mouth-watering, so packed with flavor and texture that even the hardcore carnivores at the table will want to make room on their plate for a slice, perhaps even <em>instead</em> of that turkey. I call it Vegetables Wellington.", "totalTime": "5 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Christmas", "Dairy-Free", "Mains", "Mushrooms", "Roasting", "Thanksgiving", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Roasted Carrots:</strong>", "1 1/2 pounds small carrots or large carrots quartered and cut into 4-inch sticks, scrubbed but unpeeled", "Kosher salt and freshly ground black pepper", "3 sprigs fresh thyme", "2 tablespoons extra-virgin olive oil", "<strong>For the Mushroom Duxelles:</strong>", "12 ounces cremini mushroom, roughly chopped", "3 tablespoons extra-virgin olive oil", "1 medium shallot, finely chopped ", "2 medium cloves garlic, minced", "1 tablespoon soy sauce", "1/4 cup bourbon", "1 cup Japanese-style breadcrumbs", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/02/crispy-smoked-mushroom-bacon-bits-vegan-recipe.html\">Smoked Mushroom Bacon</a>", "2 tablespoons maple syrup", "1/4 cup minced fresh parsley leaves", "1/4 cup minced fresh tarragon leaves", "1/4 cup minced fresh chives", "1/4 cup minced fresh chervil leaves (optional)", "<strong>For the Cashew-Bean Mixture:</strong>", "1 pound raw cashews", "1 quart <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">Hearty Vegetable Stock</a>", "1 (15-ounce) can cannelini beans, drained and rinsed", "3 tablespoons extra-virgin olive oil", "8 ounces shiitake mushrooms, caps only, thinly sliced", "1 medium leek, white and light green parts only, finely chopped", "1 stalk celery, finely diced", "2 medium cloves of garlic, minced", "1/2 cup toasted sunflower seeds", "1/2 cup toasted pumpkin seeds (pepitas)", "<strong>For Assembly:</strong>", "1 (1-pound) package frozen phyllo dough, thawed", "Extra-virgin olive oil as needed", "Coarse sea salt", "<strong>For the Gravy</strong>:", "3 tablespoons extra-virgin olive oil", "3 tablespoons flour", "1 quart <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">Hearty Vegetable Stock</a>", "1 tablespoon soy sauce", "2 sprigs thyme", "2 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Carrots:</strong> Adjust oven rack center position and preheat oven to 400°F. Place carrots in a large skillet and cover with cold water. Season gently with salt. Bring to a boil and cook until carrots are tender and water has mostly evaporated (if there's still lots of water left after the carrots are fully tender, drain). Season cooked carrots with salt and pepper. Add thyme sprigs to pan, drizzle with 2 tablespoons olive oil, toss to coat, and transfer to oven. Roast, turning occasionally, until carrots are lightly caramelized and wrinkled in appearance, about 30 minutes. Remove from oven, discard thyme, and set aside. Reduce oven temperature to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Duxelles:</strong> Place mushrooms in the work bowl of a food processor. Pulse until finely chopped, scraping down sides with a rubber spatula as necessary, 8 to 10 short pulses. Heat 3 tablespoons olive oil in a large skillet over high heat until shimmering. Add mushrooms and cook, stirring occasionally, until moisture has evaporated and mushrooms begin to brown, about 12 minutes. Add shallots and garlic and cook, tossing and stirring, until fragrant and softened, about 1 minute. Add soy sauce and bourbon and cook until almost dry, about 2 minutes. Add bread crumbs and stir to combine. Transfer mixture to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, toss bacon mushrooms with maple syrup until thoroughly coated. Roughly chop mixture and add to bowl with duxelles. Add half of parsley, tarragon, chives, and chervil and fold mixture together until homogenous. Season generously with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cashew-Bean Mixture:</strong> Place cashews in a medium saucepan and add stock. Season very lightly with salt. Bring to a boil and cook, stirring occasionally, until liquid has almost completely evaporated, about 30 minutes. Remove from heat and season to taste with salt and pepper. Transfer cashews to the work bowl of a food processor and pulse until finely chopped, scraping down sides with a rubber spatula as necessary, 8 to 10 short pulses. Transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread beans on a foil or parchment-lined rimmed baking sheet in an even layer. Transfer to oven and roast, stirring occasionally, until beans are mostly split open and outer skins are beginning to get crunchy, about 35 minutes. Transfer mixture to the work bowl of a food processor and set aside. Increase oven temperature to 425°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 3 tablespoons olive oil in a large skillet over medium-high heat until shimmering. Add shiitake mushrooms and cook, stirring frequently, until moisture evaporates and mushrooms are beginning to brown, about 12 minutes. Add leeks and celery and cook, stirring frequently, until softened, about 4 minutes. Add garlic and cook stirring, until fragrant, about 30 seconds. Season with salt and pepper and add to food processor work bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process dried beans and mushroom mixture until roughly chopped, scraping down sides with a rubber spatula as necessary, 8 to 10 short pulses. Transfer to bowl with cashews. Transfer sunflower seeds and pumpkin seeds to work bowl of the food processor and pulse until roughly choped, scraping down sides with a rubber spatula as necessary, 8 to 10 short pulses. Transfer bowl with bean/cashew mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining parsley, tarragon, chives, and chervil to mixture and fold together. Season generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Lay a single sheet of phyllo on a clean work surface and brush with olive oil. (Make sure to keep remaining phyllo covered with plastic wrap to avoid drying out). Layer with about 1 1/2 cup bean/cashew mixture, leaving a 2-inch border all around.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the phyllo and stuffing up like a buritto, tucking in the sides about half way through rolling. Set the cigar-shaped roll aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a clean sheet of phyllo on your work surface and brush with olive oil. Lay two more sheets on top, brushing each with olive oil as you layer them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread half of mushroom duxelles evenly over bottom two thirds of phyllo sheet, leaving a 2-inch border all around. Lay roasted carrots in even, parallel rows in the mushrooms and cover with remaining mushrooms, pressing down with clean hands to form an even layer. Place the cigar-shaped phyllo roll on top of the carrots and mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the phyllo sheet up into a tight cylinder and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with a large piece of parchment paper and place remaining bean/cashew mixture on top of it in a rough 8-inch by 3-inch row. Lay a second sheet of parchment paper on top, followed by a second rimmed baking sheet. Press down firmly all over the baking sheet to spread mixture into a thin, even layer that will roughly fit on a piece of phyllo dough leaving a 2-inch border all around.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove top baking sheet and top layer of parchment paper. Place a single layer of phyllo dough on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush with olive oil, add another sheet of phyllo, and repeat, adding a total of 5 to 6 layers of phyllo and oil (do not oil final sheet of phyllo) Place a sheet of parchment paper on top of last phyllo sheet, place the second baking sheet on top, and holding both baking sheets together, invert the stack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the top baking sheet and the top parchment. You should now have 6 layers of phyllo with a thin, even layer of bean/cashew mixture on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the existing carrot/mushroom roll on top and roll up to secure. Set aside. Lay out a fresh sheet of phyllo and brush with olive oil. Place roll on top and roll up. Repeat, adding more layers of phyllo and olive oil until all of the phyllo is used up. Transfer roll, seam-side down, to a parchment-lined rimmed baking sheet. Brush with more olive oil, sprinkle with coarse sea salt, and score gently with a sharp paring knife at 1-inch intervals all the way across the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until golden brown, crisp, and puffed, about 40 minutes. Remove from oven and let cool for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Gravy:</strong> While roast is baking, make the gravy. Combine 3 tablespoons olive oil and flour in a medium saucepan over medium-high heat and cook, stirring constantly with a whisk until flour is nutty brown, about 3 minutes. Whisking constantly, slowly drizzle in stock. Add soy sauce, thyme sprigs, and bay leaves. Bring to a boil, reduce to a simmer, and cook until thickened and reduced to 3 cups, about 20 minutes. Season to taste with salt and lots of black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Trim ends off of roast and discard. Carve roast at table, passing gravy alongside.</p>"}]}