{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141210-baking-chez-moi-custardy-apple-squares-alan-richardson.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["apple", "baking chez moi", "Cook the Book", "custard"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Custardy Apple Squares From 'Baking Chez Moi'", "link": "https://www.seriouseats.com/recipes/2014/12/custardy-apple-squares-from-baking-chez-moi-dorie-greenspan.html", "description": "In her new book, <a href=\"http://www.amazon.com/Baking-Chez-Moi-Recipes-Anywhere/dp/0547724241/?tag=serieats-20\"><em>Baking Chez Moi,</em></a> Dorie Greenspan calls this satisfying cake her \"back-pocket recipe.\" So easy to throw together, it relies more on the alchemy of a hot oven than on elbow-grease.", "totalTime": "1 hour 25 minutes", "recipeYield": "Serves 8", "recipeCategory": ["Apple", "Cook the Book", "Desserts", "Fruit Desserts", "Puddings and Custards"], "recipeIngredient": ["3 medium juicy, sweet apples, such as Gala or Fuji, peeled", "1/2 cup (68 grams) all-purpose flour", "1 teaspoon baking powder", "2 large eggs, at room temperature", "1/3 cup (67 grams) sugar", "Pinch of fine sea salt", "2 teaspoons pure vanilla extract", "6 tablespoons whole milk, at room temperature", "2 tablespoons (1 ounce; 28 grams) unsalted butter, melted and cooled", "Confectioners’ sugar, for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 400 degrees F. Butter an 8-inch square baking pan and line the bottom with parchment paper.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the apples using a mandoline, Benriner or a sharp knife, turning the fruit as you reach the core. The slices should be about 1/16 th inch thick— elegantly thin, but not so thin that they’re transparent and fragile. Discard the cores.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flour and baking powder together in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in a large bowl with a whisk, beat the eggs, sugar and salt together for about 2 minutes, until the sugar just about dissolves and, more important, the eggs are pale. Whisk in the vanilla, followed by the milk and melted butter. Turn the flour into the bowl and stir with the whisk until the batter is smooth. Add the apples, switch to a flexible spatula and gently fold the apples into the batter, turning everything around until each thin slice is coated in batter. Scrape the batter into the pan and smooth the top as evenly as you can&mdash;it will be bumpy; that’s its nature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 40 to 50 minutes, or until golden brown, uniformly puffed&mdash;make sure the middle of the cake has risen&mdash;and a knife inserted into the center comes out clean. Transfer the pan to a cooling rack and allow to cool for at least 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a long knife, cut the cake into 8 squares (or as many rectangles as you’d like) in the pan (being careful not to damage the pan), or unmold the cake onto a rack, flip it onto a plate and cut into squares. Either way, give the squares a dusting of confectioners’ sugar before serving, if you’d like.</p>\n\n<p><br />\n<strong>Serving:</strong> Most often I serve the squares plain, but whipped cream, crème fraîche or ice cream makes a great partner.</p>\n\n<p><strong>Storing:</strong> The cake, which is good a few minutes out of the oven or at room temperature the day it is made, can also be refrigerated, covered, for up to 2 days and served chilled.</p>\n\n<p><strong>Bonne Idées:</strong> You can add a couple of tablespoons of dark rum, Calvados, applejack or Armagnac or a drop (really just a drop) of pure almond extract to the batter. If you have an orange or a lemon handy, you can grate the zest over the sugar and rub the ingredients together until they’re fragrant. You can also change the fruit. Pears are perfect and a combination of apples and pears even better. Or make the cake with 2 firm mangoes&mdash;the texture will be different, but still good&mdash;or very thinly sliced quinces. Finally, if you want to make this look a little dressier, you can warm some apple jelly in a microwave and spread a thin layer of it over the top with a pastry brush.<br />\n</p>"}]}