{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140404-twasehq-max-making-ice-cream2.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["cereal", "ice cream", "sprinkle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sprinkles Ice Cream", "link": "https://www.seriouseats.com/recipes/2014/04/sprinkles-ice-cream.html", "description": "Most sprinkles ice creams just add colored sprinkles to a plain, unflavored sweet cream base. That's pretty boring. This recipe uses candy-colored, delightfully artificially flavored cereal (Fruity Pebbles, specifically, but Trix and Froot Loops would work well) to make something that's far more fun and deserving of the sprinkles that go into it.", "totalTime": "3 hours to overnight, including chilling time", "recipeYield": "makes 1 quart", "recipeCategory": ["Ice Cream and Frozen Treats", "Scooped"], "recipeIngredient": ["2 2/3 cups heavy cream", "1 1/3 cup whole milk", "2 cups fruit-flavored cereal (recommended: Fruity Pebbles; see head note)", "6 egg yolks", "3/4 cup sugar", "1/2 teaspoon kosher salt", "1 cup colored sprinkles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy saucepan, bring cream and milk to a simmer over medium heat. Turn off heat, stir in cereal, cover, and let steep for 20 minutes. Meanwhile, in a separate heavy-bottomed saucepan, whisk together egg yolks and sugar until the mixture lightens in color and is fully combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour cereal-dairy mixture through a fine mesh strainer into a clean bowl. Push on cereal mush with a spoon to extract as much as much dairy as possible, but don't press flakes of cereal through the strainer. Discard cereal. Strained dairy should yield 3 cups; measure out that amount, adding more cream and milk in a 2 to 1 ratio if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly pour dairy into saucepan with egg yolks and sugar, whisking rapidly to completely combine. Place pot over medium-low heat and cook, whisking frequently, until a custard forms on a spoon and a finger swiped across the back leaves a clean line, or until custard temperature reaches 170&deg;F. Stir in salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain custard through a fine mesh strainer and either chill in ice bath or in refrigerator until it is very cold, about 40&deg;F. Churn in ice cream maker according to manufacturer's instructions, adding in sprinkles during last minute of churn, then transfer to an airtight container and chill in freezer for at least 4 hours.</p>"}]}