{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140826-fried-and-true-hugh-acheson-fried-chicken-salad-evan-sung.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["chicken", "chicken salad", "Cook the Book", "fried and true", "fried chicken"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fried Chicken Salad From 'Fried &amp; True'", "link": "https://www.seriouseats.com/recipes/2014/09/fried-chicken-salad-from-fried-true.html", "description": "Has finding uses for leftover fried chicken ever really been much of a problem? Eat it cold while standing in front of the open refrigerator as you ponder the effort it would take to make a sandwich with it, right? But if you are able to make it past that very satisfying immobility, you should try this recipe from Lee Brian Schrager's <a href=\"http://www.amazon.com/Fried-True-Recipes-Americas-Chicken/dp/077043522X/?tag=serieats-20\"><em>Fried &amp; True: More than 50 Recipes for America's Best Fried Chicken and Sides.</em></a> For his chicken salad, Georgia chef Hugh Acheson mixes chilled, diced fried chicken with mayonnaise, shallots, celery and refreshing herbs, then spikes it with crushed red pepper and hot sauce.", "totalTime": "12 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chicken Salad", "Cook the Book", "Deep Frying", "Fried Chicken", "Mains", "Sandwiches"], "recipeIngredient": ["<strong>For the Brine</strong>", "2½ tablespoons kosher salt ", "1 tablespoon maple syrup ", "1 sprig fresh thyme ", "6 black peppercorns ", "1 teaspoon mustard seeds ", "4 boneless, skin-on chicken thighs ", "<strong>For the Dredge</strong> ", "1¼ cups all-purpose flour ", "¾ cup cornstarch ", "½ teaspoon kosher salt ", "¼ teaspoon freshly ground black pepper ", "3 quarts canola oil, for frying ", "<strong>For the Chicken Salad</strong> ", "½ cup mayonnaise ", "2 large shallots, minced (about ½ cup) ", "1 celery stalk, minced (about 1/3 cup) ", "1 teaspoon Dijon mustard ", "¼ cup chopped fresh mixed herbs, such as parsley, tarragon, and chives ", "1 teaspoon crushed red pepper flakes ", "1 to 2 tablespoons hot pepper vinegar or vinegar-based hot sauce, to taste ", "Kosher salt and freshly ground black pepper ", "Soft rolls, crisp lettuce, and dill pickles, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Brine the chicken:</strong> In a small stockpot, combine 4 cups water with the salt, maple syrup, thyme, peppercorns, and mustard seeds and bring to a boil. Reduce the heat and simmer for 5 minutes. Remove from the heat and cool completely to room temperature. Place the chicken in a nonreactive container and pour the cooled brine over the chicken. Cover and refrigerate for at least 8 hours or up to 12 hours. Drain the chicken, discarding any solids, and pat dry with paper towels. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Fry the chicken:</strong> In a medium bowl, whisk together the flour, cornstarch, salt, and pepper. Dredge the chicken in the flour mixture, generously applying to ensure that the mixture sticks to the chicken. Prepare a deep-fryer or fill a 6-quart pot halfway with the oil and heat to 325°F. Set a wire rack on top of a rimmed baking sheet and set aside. Carefully drop the thighs into the oil and fry until crispy and cooked through, 8 to 9 minutes. Using tongs, transfer the chicken to the rack, cool to room temperature, and then refrigerate until cold, at least 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the salad:</strong> Chop the chicken into small pieces and reserve. In a large bowl, whisk together the mayonnaise, shallots, celery, mustard, herbs, red pepper flakes, and vinegar. Season with salt, pepper, and more vinegar to taste. Gently fold the chicken into the dressing until incorporated. Serve with rolls, lettuce, and pickles.</p>"}]}