{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140429-291057-GFTues-Shortcakes.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["cake", "dessert", "fruit", "gluten free", "strawberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Gluten-Free Strawberry Shortcakes", "link": "https://www.seriouseats.com/recipes/2014/04/gluten-free-strawberry-shortcakes-recipe.html", "description": "This gluten-free recipe makes shortcakes that are light and tender, yet sturdy enough to stand up to spoonfuls of macerated strawberries.", "totalTime": "2 hours", "recipeYield": "Serves 8", "recipeCategory": ["Cakes", "Fruit Desserts", "Gluten-Free", "Gluten-Free Tuesday", "Strawberry"], "recipeIngredient": ["<strong> For the Shortcakes:</strong>", "1 1/3 cups white rice flour, plus more for dusting", "2/3 cup potato starch", "1/4 cup plus 1 tablespoon granulated sugar, divided", "1 tablespoon plus 1/2 teaspoon baking powder", "1/2 teaspoon xanthan gum", "7 tablespoons unsalted butter, 6 tablespoons cut into small cubes and chilled, and 1 tablespon melted", "2 large hard-boiled eggs, yolks pushed through a fine mesh sieve, whites reserved for another use", "3/4 cup cold heavy cream or half-and-half", " ", "<strong>For the Toppings:</strong>", "1 quart strawberries, hulled and sliced", "1/4 cup plus 1 tablespoon granulated sugar, divided", "2 teaspoons vanilla extract, divided", "1 cup cold heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Shortcakes:</strong> In large bowl, whisk together white rice flour, potato starch, 1/4 cup of the sugar, baking powder, and xanthan gum. Add cubed butter and, using either your hands or a pastry cutter, cut into flour mixture until pea-sized pieces form. Add egg yolks and continue cutting until flour mixture resembles coarse crumbs. Stir in heavy cream with a wooden spoon until incorporated. Let dough stand for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously dust work surface with white rice flour. Turn dough onto work surface and dust with more white rice flour. Gently knead the dough a few times, then pat into a large rectangle, about 1 inch thick. Using a 2-inch round cutter, cut out four dough rounds. Gather up dough scraps, pat into a 1-inch-thick rectangle, and cut out 4 more dough rounds; discard remaining dough scraps. Place dough rounds on a parchment-lined baking sheet and brush the tops with remaining 1 tablespoon melted butter. Sprinkle remaining 1 tablespoon granulated sugar on top. Cover with plastic wrap and refrigerate for 1 hour.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Toppings:</strong> Stir together strawberries, 1/4 cup granulated sugar, and 1 teaspoon vanilla extract. Using the back of a fork, gently mash a few of the sliced strawberries. Allow strawberries to stand for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium bowl, whip heavy cream until soft peaks form. Add remaining 1 tablespoon granulated sugar and 1 teaspoon vanilla extract, and beat until stiff peaks form.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350&deg;F. Remove plastic wrap from baking sheet and bake shortcakes until edges just turn golden brown, about 12 minutes. Let shortcakes cool on baking sheet for five minutes, then transfer to a wire rack. Serve shortcakes warm or at room temperature, topping with macerated strawberries and whipped cream.</p>"}]}