{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140321-btb-maltedpie.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chess pie", "chocolate", "First Prize Pies", "malt", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Malted Chess Pie", "link": "https://www.seriouseats.com/recipes/2014/03/malted-chess-pie-recipe-first-prize-pies.html", "description": "This is a simple chess pie with a double dose of malt in the filling, thanks to malt syrup and malt powder. An optional malt-flavored whipped cream topping is suggested, which is a great idea if you plan to eat this pie solo.", "totalTime": "overnight, if making pie crust", "recipeYield": "makes 1 9-inch pie", "recipeCategory": ["Bake the Book", "Chocolate", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Classic Pie Crust</strong>", "3/4 cup (1 1/2 sticks/170 g) unsalted European-style cultured butter", "1/4 cup (55 g) rendered leaf lard OR additional butter", "1/2 cup (120 ml) whole milk", "1 tablespoon apple cider vinegar (or any light colored, mild vinegar)", "12 ounces (340 g/ approximately 3 cups) unbleached all purpose flour (chilled)", "1 tablespoon cornstarch", "2 tablespoons sugar", "1 1/2 teaspoons salt", "&nbsp;", "<strong>Filling</strong>", "1/4 cup (1/2 stick/55 g) unsalted butter, at room temperature", "3/4 cup (150 g) sugar", "1/2 cup (120 ml) barley malt syrup ", " 4 large eggs", "1/2 teaspoon sea salt", "1/2 cup (70 g) malted milk powder", "&nbsp;", "<strong>Topping</strong> (optional)", "1 cup (240 ml) heavy cream ", "1 tablespoon malted milk powder", "1/4 cup (45 g) crushed malt balls"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Making the crust:</strong> Prepare the butter and lard, if using. Cut the butter into 1/2-inch (12-mm) cubes (a bench scraper is perfect for this, but a sharp knife works well too), and cut the lard into small pieces. Return them to the fridge or freezer to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a liquid measuring cup, stir together the milk and vinegar. Refrigerate the mixture until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a clean flat surface or in a large shallow bowl, toss the flour, cornstarch, sugar, and salt together lightly to blend. Add the butter and lard (if using) to the dry ingredients and, using the tool of your choice (see Tools of the Trade, page 20), cut the fat into the flour with speed and patience, until the fat has been reduced to small pea-sized chunks. Try to use a straight up-and-down motion, avoiding twisting your wrists, as the more you press on the flour the more tough gluten will develop in the dough. Avoid using your fingers, as the heat from your hands will melt the fat and further encourage gluten development. Unlike with pasta or bread, gluten is the enemy of pie dough, so be gentle, and be quick!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once your fat has been cut down to size, spread your mixture out gently to expose as much surface area as possible. Gently drizzle about half of your milk mixture over the flour, trying to cover as wide an area as you can. Using bench scrapers or a large spoon, toss the flour over the liquid (don’t stir; just lightly toss), spread everything out again, and repeat the process with the second half of the liquid. You should now have a dough that will just hold together when pressed against the bowl, with visible little chunks of butter. If you need to add more liquid to bind it, do so with more cold milk, adding a tablespoon at a time until you reach the right texture. It’s not an exact science, as everything from the humidity in the air to the dryness of your flour will affect the consistency of your dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once you’ve reached your goal, cover the dough tightly in plastic wrap and refrigerate it for at least 1 hour. The dough can be kept in the fridge for up to 1 week, well wrapped, or in the freezer for up to 2 months. Note: For this recipe, you'll only need half the dough, as it's a single-crust pie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assembling the pie:</strong> Preheat the oven to 425ºF (220ºC). Roll out the dough into a circle about 11 inches (28 cm) in diameter. Transfer it to a 9-inch (23-cm) tart pan or pie plate, trim the overhang to about 1 inch (2.5 cm), tuck the overhang under, and crimp decoratively. Blind-bake the crust until partially baked; set it aside to cool. Lower the oven to 350ºF (175ºC).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the filling: In a stand mixer with the paddle attachment, cream together the butter, sugar, and syrup until fluffy. Add the eggs, one at a time, mixing well after each addition. Whisk in the salt and the malt powder until they are fully blended. Put the pie crust on a baking sheet. Pour the filling in to the crust and bake it for 30 to 40 minutes, until the filling has just set and is still slightly wobbly in the center. Remove the pie to a wire rack to cool completely, at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the topping (if using): In a stand mixer, with a hand mixer, or by hand with a whisk, whip the cream with the remaining malt powder until stiff peaks form. Dollop the whipped cream on top of the cooled pie. Sprinkle the crushed malt balls on top and serve. This pie can be made ahead, without the topping, and refrigerated for up to 1 week, covered in plastic wrap. Add the topping (if using) just before serving.<br />\n</p>"}]}