{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140626-GFPeanut-Butter-Cookies-TwoWays-EBarbone.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["chocolate", "cookie", "dessert", "gluten free", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Gluten-Free Chocolate Cookies With Peanut Butter Chips", "link": "https://www.seriouseats.com/recipes/2014/06/gluten-free-chocolate-cookies-with-peanut-butter-chips-recipe.html", "description": "These rich gluten-free treats puff as they bake and then settle as they cool into flat, crisp cookies.", "totalTime": "2 hours", "recipeYield": "About 3 dozen cookies", "recipeCategory": ["Chocolate", "Cookies", "Gluten-Free", "Gluten-Free Tuesday", "Nuts"], "recipeIngredient": ["3/4 cup (3 ounces) white rice flour", "1/4 cup (1 ounce) sweet rice flour", "1/2 cup (2 ounces) cocoa powder, natural or Dutch-process", "1/2 teaspoon baking soda", "1/2 teaspoon table salt", "1 1/4 cups (10 ounces) granulated sugar", "4 ounces milk or dark chocolate, melted and cooled slightly", "1 stick (4 ounces) unsalted butter, melted and cooled slightly ", "2 large eggs", "1 teaspoon pure vanilla extract", "1 cup peanut butter chips or chopped unsalted peanuts (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together white rice flour, sweet rice flour, cocoa powder, baking soda, and salt in a medium bowl; set aside. In large bowl, combine granulated sugar, melted chocolate, melted butter, eggs, and vanilla extract. Whisk together until combined. Switch to a wooden spoon and stir in dry ingredients. Stir until thick batter forms. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill dough for 20 minutes. Meanwhile, adjust oven rack to middle position and preheat oven to 350&deg;F. Line two rimmed baking sheets with parchment paper. Remove dough from the refrigerator. Stir in peanut butter chips. Dough will be firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in 2 batches, scoop batter using a cookie scoop (about 1 1/2 tablespoons) and drop dough onto 1 of the prepared baking sheets, spacing dough about 2 inches apart. Bake until cookies are set, about 12 minutes. Allow cookies to cool slightly on baking sheets for 10 minutes (cookies will flatten as they cool). Transfer cookies to wire racks to cool completely. Repeat with remaining dough and unused prepared baking sheet. Store cookies in an airtight container at room temperature for up to 4 days. </p>"}]}