{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140617-stir-fry-tripe-with-pickled-mustard-greens-and-fermented-black-beans-shao-zhong-6.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "chinese aromatics 101", "offal", "stir fry", "tripe"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stir-Fried Tripe With Pickled Mustard Greens and Fermented Black Beans", "link": "https://www.seriouseats.com/recipes/2014/07/stir-fried-tripe-pickled-mustard-greens-recipe.html", "description": "This dish, from the Hakka Chinese community, is an offal lover's dream: snappy omasum (bible) tripe stir-fried with tart mustard greens, fermented black beans, and red chilies.", "totalTime": "55 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Chinese", "Mains", "Offal", "Stir Frying"], "recipeIngredient": ["1 pound omasum (bible) tripe", "2 tablespoons cornstarch", "2 tablespoons rice wine or sake", "1 tablespoon dried fermented black beans", "3 tablespoons vegetable or peanut oil, divided", "2 to 4 teaspoons brown sugar", "1 (10.5-ounce) package Chinese pickled mustard greens, drained, squeezed dry, and thinly sliced", "10 slices fresh peeled ginger, about 1/8 inch thick by 1 inch long", "3 scallions, cut into 1-inch lengths, white and dark green parts divided", "10 medium cloves garlic, halved", "1 teaspoon soy sauce", "1 fresh red Fresno chili pepper, sliced thinly (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tripe in a large bowl. Add cornstarch and rice wine. Rub the mixture all over tripe and let stand 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse tripe under cold running water. Fill a large bowl with ice water. Bring a large pot of water to a boil, add tripe and cook for 1 minute. Drain and transfer to ice water bath to chill. Set tripe in colander to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat tripe dry with paper towels and slice into 2 inch strips about 1/4 inch wide.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place fermented black beans in a small bowl and fill with water. Using your fingers, gently rub black beans, then drain, pat dry with paper towels, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of oil in a wok over high heat until lightly smoking. Add sliced pickled mustard greens and stir-fry for 1 minute. Stir in 2 teaspoons brown sugar, adjusting heat to prevent sugar from burning. Taste, adding more sugar, 1 teaspoon at a time, if mustard greens are too tart. Continue to stir-fry until sugar has melted. Transfer pickled mustard greens to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons oil in the wok over high heat until lightly smoking. Add fermented black beans, ginger pieces, white parts of scallion, and garlic cloves and stir-fry for 30 seconds. Add tripe and stir-fry for 1 minute. Add soy sauce, chili pepper, green scallion parts, and pickled mustard greens and stir-fry until everything is combined and very hot, about 1 minute. Transfer to a plate and serve immediately.</p>"}]}