{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140207-281940-cook-the-book-duo-de-boeuf.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "French", "keywords": ["beef", "bone marrow", "Cook the Book", "Daniel Boulud", "daniel: my french cuisine", "French", "short rib"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Duo de Boeuf, Bone Marrow-Crusted Tardivo, Sweet Potato Dauphine From 'Daniel'", "link": "https://www.seriouseats.com/recipes/2014/02/duo-de-boeuf-bone-marrow-crusted-tardivo-swee.html", "description": "This duo of beef is a signature dish at <a href=\"http://www.danielboulud.com/\" target=\"_blank\">Daniel Boulud</a>'s <a href=\"http://www.danielboulud.com/restaurants/\" target=\"_blank\">eponymous restaurant</a>. It changes with the seasons, but the pairing of braised and seared beef stays the same. As could be expected from a high-end signature dish, the recipe is far from simple, but it seriously pays off.", "totalTime": "2 days", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Cook the Book", "French", "Mains"], "recipeIngredient": ["<strong>Seasoning Oil</strong>", "1 teaspoon cracked black pepper (we recommend Pierre Poivre)", "1 teaspooon fleur de sel", "1 tablespoon olive oil", "&nbsp", "<strong>Shallot and Bone Marrow Crust (makes extra)</strong>", "3 (2-inch-long) beef marrow bones, soaked in ice water for at least 12 hours", "1/2 cup (1 stick) butter", "1 cup minced shallot", "3 ounces <a href=\"http://www.seriouseats.com/recipes/2014/02/fine-white-breadcrumbs-from-daniel.html\">Fine White Breadcrumbs</a>", "1/4 teaspoon salt", "1/8 teaspoon piment d’Espelette", "1/8 teaspoon white pepper", "&nbsp", "<strong>Balsamic Braised Tardivo</strong>", "2 heads radicchio di Treviso", "2 tablespoons olive oil", "Salt and freshly ground white pepper", "1/4 cup balsamic vinegar", "1/4 cup chicken stock ", "&nbsp", "<strong>Sweet Potato Puree</strong>", "2 sweet potatoes (about 1 pound peeled)", "4 tablespoons butter", "2 cups milk", "Salt and freshly ground white pepper", "&nbsp", "<strong>Sweet Potato and Black Garlic Dauphine</strong>", "1 large (about 12 ounces) russet potato", "1/2 cup kosher salt", "3 tablespoons butter", "1 3/4 ounces sweet potato, cut into small dice, reserved from above", "3/4 teaspoon salt", "5 tablespoons flour", "1 egg", "Freshly ground white pepper", "2 cloves black garlic, peeled and halved lengthwise", "&nbsp", "<strong>To Finish</strong>", "Canola oil for frying", "4 servings <a href=\"http://www.seriouseats.com/recipes/2014/02/braised-short-ribs-from-daniel.html\">Braised Short Ribs</a>", "1 pound whole filet mignon, trimmed and tied with butcher’s twine at 1/2-inch intervals", "Salt and cracked black pepper (we recommend Pierre Poivre)", "2 tablespoons olive oil", "1 tablespoon butter", "1 sprig thyme", "1 clove garlic, peeled", "1 ounce bresaola, cut into matchsticks", "4 <a href=\"http://www.seriouseats.com/recipes/2014/02/crispy-shallot-rings-from-daniel.html\">Crispy Shallot Rings</a>", "4 parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the seasoning oil:</strong> Combine the ingredients in a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the shallot and bone marrow crust:</strong> Using your thumbs or a small spoon, pop the marrow out of the bones, pushing from the narrow to the wider opening. Store the marrow in ice water if not using immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 tablespoon of the butter in a small saute pan over low heat. Add the shallot and cook, stirring occasionally, until soft but not colored, about 10 minutes; add spoonfuls of water as needed if the shallot sticks to the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat dry and weigh 5 ounces of the marrow; transfer to the bowl of a food processor fitted with a blade with the remaining 7 tablespoons butter and the shallot. Blend until smooth. Stream in the breadcrumbs, salt, piment d’Espelette, and pepper and pulse until well combined. Remove the mixture and pack it into a small container; cover and chill until the butter is hard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the balsamic braised tardivo:</strong> Heat a grill or cast-iron grill pan over high heat. Trim four 1-inch tips from the radicchio and<br />\r\nreserve, chilled, for the garnish. Place the remaining radicchio heads in a bowl and toss with the olive oil; season with salt and pepper. Grill until charred on all sides, about 4 minutes total. Transfer to a small saucepan with the vinegar and chicken stock. Bring to a simmer, cover, and cook over low heat until the leaves are tender, about 15 minutes. Transfer the radicchio to a cutting board and simmer the remaining liquid in a saucepan until reduced to a glaze. Cut the radicchio into 4 approximately 1 1/2-inch-wide x 1-inch-tall square portions. Arrange the portions so that the longer leaves are on top and tucked around the sides like a packet. Transfer the packets to a baking sheet lined with foil and coat with the reduced liquid. Top each portion with a 1/8-inch-thick slice of bone marrow crust. Cover and reserve, chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the sweet potato puree:</strong> Cut 1 3/4 ounces of the sweet potato into a small dice and reserve, submerged in water, for the dauphine; cut the remaining into large dice. In a large saucepan over medium heat, brown the butter and add the large dice of sweet potatoes, the milk, and 1/2 teaspoon salt. Simmer for 30 to 35 minutes, until fork-tender. Using a slotted spoon, scoop the sweet potatoes into a blender, reserving the milk. Blend with enough of the milk to make a smooth, thick puree. Adjust the seasoning with salt and pepper; reserve, chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the sweet potato and black garlic dauphine:</strong> Preheat the oven to 350°F. Wash the russet potato and pierce its skin several times with a fork. Make a bed of the kosher salt on an aluminum foil–lined baking sheet, place the potato on top, and transfer to the oven. In a small saute pan, melt 1/2 tablespoon of the butter over low heat, add the reserved small diced sweet potato, and cook, stirring, until tender, about 3 minutes; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 45 minutes, begin making a pate a choux: Combine the remaining 2 1/2 tablespoons butter, 1/4 cup water, and 1/4 teaspoon of the salt in a small saucepan over high heat and bring to a simmer. Add the flour, reduce the heat to medium, and stir with a wooden spoon for 5 to 10 minutes, until the mixture begins to dry and form a film on the bottom of the pan. Remove from the heat and beat in the egg until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and keep in a warm place until the potato is fork-tender, another 10 to 20 minutes. Cut the potato in half, scoop out the flesh, and pass through a food mill or ricer into a medium saucepan. Place over low heat and cook, stirring, for 2 minutes, to dry. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a medium bowl on a scale and combine 10 1/2 ounces of the warm potato, 4 ounces of the warm pate a choux, and the cooked small diced sweet potato; season with the remaining 1/2 teaspoon salt and pepper to taste, and mix well. With the palms of your hands, form the dough into at least four 2-ounce, approximately 1 1/4-inch-wide x 1-inch-tall squares, and press a half of black garlic, cut side up, into the tops. Reserve, chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To finish:</strong> Preheat the oven to 325°F. Fill one-third of a<br />\r\nmedium saucepan with canola oil and heat to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the short ribs in the oven and reheat gently, covered, occasionally basting the meat with the sauce until heated through, about 30 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the sweet potato puree to a medium saucepan over medium heat and stir until heated through.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rest the filet mignon at room temperature for 15 minutes. Season on all sides with salt and cracked black pepper. Heat the olive oil in a large saute pan over medium-high heat. Add the beef and sear on all sides until browned. Lower the heat to medium; add the butter, thyme, and garlic and continue to roast, while basting, until medium-rare (115°F). If needed, transfer to the oven to finish roasting for a few minutes. Allow it to rest for at least 5 minutes in a warm place before removing the string and slicing into 4 equal portions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the short ribs from the oven and reserve in a warm spot. Increase the oven temperature to broil. Broil the radicchio packets until the crust is crispy and golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fry the pommes dauphine in the canola oil until golden brown, about 4 minutes. Drain onto a paper towel–lined tray and sprinkle with salt.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For each serving, place a spoonful of sweet potato puree on the bottom of a warm dinner plate and place a short rib on top. Top with a radicchio tip, 2 matchsticks of bresaola, a crispy shallot ring, and a leaf of parsley. Arrange 1 packet of crusted radicchio, 1 slice of filet mignon, and 1 sweet potato dauphine on the plate. Top the filet mignon with a streak of the seasoning oil. Spoon extra short rib sauce around.</p>"}]}