{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/041714-290227-Serious-Eats-Sunday-Supper-Mushroom-Stuffed-Chicken-Thighs.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["chicken", "chicken thigh", "olive", "potato", "thyme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Wild Mushroom-Stuffed Chicken Thighs With Fingerling Potatoes and Green Olives", "link": "https://www.seriouseats.com/recipes/2014/04/wild-mushroom-stuffed-chicken-thighs-fingerling-potatoes-olives-recipe.html", "description": "These chicken thighs are stuffed with a mixture of crème fraîche and sautéed wild mushrooms. Seared and roasted along with fingerling potatoes, the whole dish is served in bright sauce made with wine, vinegar, garlic, and olives.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "Olives", "Potato", "Sunday Supper"], "recipeIngredient": ["5 tablespoons olive oil, divided", "1 1/2 pounds fingerling or other small potatoes", "Kosher salt and freshly ground black pepper", "2 1/2 tablespoons red wine vinegar", "8 ounces wild mushrooms such as oyster, maitake, or shiitake, sliced", "4 ounces crème fraîche", "1 1/2 pounds boneless, skinless chicken thighs, pounded to an even thickness", "1 small sweet red pepper, minced (about 2 tablespoons)", "2 medium cloves garlic, minced (about 2 teaspoons)", "1/4 cup chopped green olives", "1/2 cup of dry white wine", "4 sprigs fresh thyme", "1 tablespoon juice from 1 lemon", "1 1/2 tablespoons butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. Place potatoes in a large skillet. Season with salt and pepper. Add three tablespoons of olive oil and red wine vinegar and toss to combine. Transfer to the oven to cook until almost tender, about 40 minutes, stirring half way through cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 1 tablespoon of olive oil over high heat in a medium skillet until shimmering. Add mushrooms and cook, stirring occasionally, until they've released their liquid, the liquid has evaporated, and the mushrooms have browned, 10 to 12 minutes total. Season with salt and pepper. Add crème fraîche and stir to combine. Transfer to a small bowl and let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season chicken pieces on all sides with salt and pepper. Lay them flat with the rough side up and divide the mushroom mixture between them. Roll up meat and tie with kitchen twine to secure filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove skillet with potatoes from oven. Transfer potatoes to a bowl. Add the remaining tablespoon of olive oil to the skillet. When oil is shimmering, add chicken pieces and cook until browned on all sides, turning occasionally, about 6 minutes total. Reduce heat to medium and add red pepper and garlic. Cook, stirring, until fragrant, about 30 seconds. Add olives, wine, and thyme sprigs. Return potatoes to pan, stir to combine, and return skillet to the oven until the chicken reaches an internal temperature of 165&deg;F and the potatoes are crisped yet tender when pierced with a fork, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is done, remove from the oven. Cut, remove and discard string, along with thyme sprigs. Swirl in butter. When butter is melted, add lemon juice and swirl to combine. Season to taste with salt and pepper. Cover with foil and let rest 10 minutes before serving.</p>"}]}