{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140608-blueberry-jam-sugar-coated-jennifer-latham.jpg", "author": {"@type": "Person", "name": "Jennifer Latham"}, "recipeCuisine": "", "keywords": ["blueberry", "fruit", "Jam", "preserve", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Summer Blueberry Jam", "link": "https://www.seriouseats.com/recipes/2014/07/summer-blueberry-jam-recipe.html", "description": "This delicious blueberry jam made from in-season summer blueberries, sugar, and lemon juice couldn't be more simple to make. The key is to select the best berries: Namely, a mixture that includes mostly just-ripe berries with a few under-ripe berries as well.", "totalTime": "1 hour 30 minutes", "recipeYield": "about 12 half-pint jars", "recipeCategory": ["Blueberry", "Condiments and Sauces", "Fruit Desserts"], "recipeIngredient": ["3 pounds 8 ounces blueberries, preferably small, mostly just-ripe berries with some under-ripe berries as well", "1 pound 12 ounces sugar", "1/4 cup fresh juice from 2 lemons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix everything together in a large mixing bowl and scrape into a large pot or jam-making vessel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook berries on medium-high heat, stirring very frequently, until blueberries have released enough liquid to dissolve the sugar, about 8 minutes. Increase heat to high and cook, stirring just enough to prevent scorching on bottom of pot, until berries are foamy, about 10 minutes. Continue to cook, stirring more frequently and lowering temperature as foam begins to subside, 10 to 20 minutes longer. Cook until most of the fruit is disintegrated and bubbles have slowed down and become glossy, about 10 more minutes (times can vary depending on fruit).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Test for doneness: Turn off heat and set a small spoonful of jam in the freezer for 5 minutes. Jam is done once it holds together and doesn't run off the spoon when tilted; if jam is too runny, return to low heat and continue to cook, stirring frequently and repeating doneness test every 5 minutes, until jam passes test. Eat right away, or can following your canning equipment instructions (read more on canning <a href=\"http://www.seriouseats.com/2012/02/how-to-can-canning-pickling-preserving-ball-jars-materials-siphoning-recipes.html\">here</a>). Canned jams can be stored in a cool, dark place for up to 1 year.</p>"}]}