{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140723-Crispin-Cider-Brined-Pork-Chops--Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Crispin Cider-Brined and Glazed, Grilled Pork Chops", "link": "https://www.seriouseats.com/recipes/2014/07/crispin-cider-brined-and-glazed-grilled-pork.html", "description": "Crispin Cider forms the foundation for a brine to keep pork chops moist. Then, a quick, easy glaze made with additional hard cider, orange juice, brown sugar and garlic bastes the olive oil-slathered, peppered chops, which cook on the grill until seared outside and rosy-pink inside.", "totalTime": "2 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Pork"], "recipeIngredient": ["4 thick-cut, bone-in pork chops", "1 1/2 cups Crispin Cider", "1/4 cup sugar", "2 tablespoons brown sugar", "1/2 cup kosher salt", "5 sprigs thyme", "2 bay leaves", "1 teaspoon ground mustard", "1 teaspoon black peppercorns", "1 tablespoon juniper berries", "1 1/2 tablespoons olive oil", "Black pepper", "&nbsp", "<strong>For the Glaze:</strong>", "1 cup Crispin Cider", "2 tablespoons brown sugar", "1/2 cup orange juice", "2 garlic cloves, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork chops in a resealable bag, along with the sugar, brown sugar, salt, thyme, bay leaves, ground mustard and juniper berries. Tightly seal and squish around to combine. Place in the refrigerator for at least 2 hours but no more than 6 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork chops from refrigerator about 30 minutes before you’re ready to cook them. Discard brine and pat meat dry using a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add glaze ingredients to a small saucepan placed over medium heat. Stir to combine and simmer, stirring occasionally, until reduced by about half. Reserve half of the glaze for later use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate, leaving an area without direct heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub chops with olive oil and season with pepper. Brush meat with some of the remaining glaze and place pork chops over hot side of grill and cook until well browned, 3 to 5 minutes per side. Move pork chops to cool side of the grill, situated with bones facing the fire. Cover, basting periodically. Cook until meat registers 135&deg;F on an instant read thermometer when inserted into thickest part of the chop. Remove pork from grill and let rest for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, with remaining reserved glaze.</p>"}]}