{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/011314-281828-Serious-Eats-Sunday-Supper-Balsamic-Brown-Sugar-Short-Ribs-edit.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["balsamic", "beef", "brown sugar", "garlic", "mashed potato", "short rib", "Sunday Supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Balsamic-Brown Sugar Short Ribs With Garlic Mashed Potatoes", "link": "https://www.seriouseats.com/recipes/2014/02/balsamic-brown-sugar-short-ribs-recipe.html", "description": "Short ribs braise in a red wine, balsamic vinegar and brown sugar sauce before they're served atop garlic mashed potatoes.", "totalTime": "4 hours", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Garlic", "Mains", "Sunday Supper"], "recipeIngredient": ["<strong>For the Short Ribs:</strong>", "1 tablespoon olive oil", "Kosher salt and freshly ground black pepper", "4 (6 to 8-ounce) pieces boneless short ribs", "1 medium onion, chopped (about 1 cup)", "2 large cloves garlic, smashed", "1/2 cup red wine", "2 cups low-sodium beef broth", "2 tablespoons Worcestershire sauce", "1 tablespoon balsamic vinegar", "2 tablespoons brown sugar", "2 bay leaves", "1 (1- by 3-inch) strip of orange zest, white pith removed", "<strong>For the Potatoes:</strong>", "2 pounds red-skin potatoes", "4 cloves garlic", "3 tablespoons butter", "1/4 cup milk", "1/2 cup sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 325&deg;F. Coat a large Dutch oven with olive oil and bring to high heat. Season meat with salt and pepper. Working in batches to avoid overcrowding, add short ribs and cook without moving until well browned on first side, about 4 minutes. Flip short ribs and add onions and garlic. Continue cooking, stirring occasionally, until short ribs are browned on second side and onions and garlic are softened but not completely browned, 2 to 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add red wine to pan. Bring to a boil and let it simmer for a minute before adding beef broth, Worcestershire, vinegar, brown sugar, bay leaves, and orange zest. Return to a boil, cover, and transfer to the oven to cook until meat is fork-tender and sauce is rich and full of depth, 2 1/2 to 3 hours total, flipping meat once during cooking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the meat is cooking, bring potatoes and garlic to a boil in a large pot over medium-high heat. Cook until tender when pierced with a fork, 20 to 25 minutes. Drain, return to pot and add butter, milk and sour cream. Season with salt and pepper, and mash with a potato masher or a fork. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When short ribs are done cooking, discard bay leaves and orange zest. Season salt to taste with salt and pepper. To plate, place a mound of mashed potatoes on each of four individual plates. Top with a short rib, and spoon with sauce. Serve immediately.</p>"}]}