{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/201442-JewelOaxaca-drink.jpg", "author": {"@type": "Person", "name": "Elana Lepkowski"}, "recipeCuisine": "", "keywords": ["cocktail", "mango", "mezcal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jewel of Oaxaca", "link": "https://www.seriouseats.com/recipes/2014/04/jewel-of-oaxaca-grilled-mango-mezcal-cocktail-ancho-chili-drink-recipe.html", "description": "Smoky ancho chili peppers and grilled mango sound like the start of a salsa, but here they serve as the base of a deliciously sweet and earthy cocktail made with mezcal.", "totalTime": "1 1/2 hours", "recipeYield": "Makes 2 cocktails", "recipeCategory": ["Mango", "Mezcal"], "recipeIngredient": ["<strong>For the Ancho Chili Syrup:</strong>", "2 dried ancho chili peppers (or 1 teaspoon ancho chili powder)", "1 cup sugar", "1 cup water", " ", "<strong>For the Cocktails:</strong>", "1 Ataulfo mango, skin on, removed from pit", "2 ounces Ancho Chili Syrup", "1 1/2 ounce freshly squeezed lime juice from 1/2 lime", "3 ounces mezcal, such as Del Maguey Vida"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make Ancho Chili Syrup:</strong> Combine chili peppers (or powder), sugar, and water in a medium sauce pan over high heat. Bring to a boil and reduce the temperature to low. Simmer for 10 minutes, stirring occasionally. Remove from heat, cover, and let sit for one hour. Strain into an airtight container. Syrup can be made ahead and stored in the refrigerator for up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For cocktail:</strong> Using a sharp paring knife, score the flesh-side of a mango half at 1/2-inch intervals, being careful not to puncture skin. Rotate 90 degrees and score again to form a cross-hatch pattern. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one half chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to medium-high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Place mango halves cut-side-down over hot side of grill. Grill until mango is charred and tender, about 5 minutes, rotating 90 degrees half way through cooking. Alternatively, cook in a oiled grill pan over medium-high heat. Remove from grill and let cool. Once cool, turn flesh inside out and using a paring knife, cut cubes away from the skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For each cocktail:</strong> In the bottom of a cocktail shaker, combine cubes from one half mango and 1 ounce ancho syrup. Muddle to a purée-like consistency, about 20 seconds. Add 3/4 ounce lime juice and 1 1/2 ounces mezcal. Fill shaker 2/3 full with ice. Shake for 20 seconds until well chilled. Using a Hawthorne strainer, strain into a chilled cocktail coupe. Repeat with remaining ingredients for second cocktail.</p>"}]}