{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140317-one-pot-wonders-curried-chicken-cous-cous.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["chicken", "couscous", "easy", "one pot", "pepita", "quick", "skillet", "swiss chard"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Curried Chicken With Israeli Couscous", "link": "https://www.seriouseats.com/recipes/2014/04/curried-chicken-israeli-couscous-recipe.html", "description": "I'd like to take a moment to introduce you to your next go-to weeknight meal, because that's what this dish has become for me. Shredded poached chicken and couscous&mdash;here flavored with curry and topped with crunchy pepitas and fresh cilantro&mdash;are all cooked in one skillet in under 30 minutes.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "One-Pot Wonders", "Other Grains", "Quick Dinners", "Soups and Stews", "Stovetop"], "recipeIngredient": ["1 pound boneless skinless chicken breast", "Kosher salt and freshly ground black pepper", "6 ounces Israeli (pearled) couscous", "1 tablespoon and 1 teaspoon madras curry powder, divided", "2 packed cups of roughly sliced Swiss chard leaves", "2 tablespoons fresh juice from 1 lemon", "1/2 cup fresh cilantro leaves", "1/2 cup toasted pepitas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken in a medium pot and cover with cold water by three inches. Season with salt, pepper, and 1 teaspoon of curry powder. Bring to a simmer over high heat, remove from heat, and let rest until chicken is cooked through, about 15 minutes. Transfer chicken to a plate and set aside. Reserve poaching liquid in pot.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust the heat to maintain a simmer. Add the couscous and remaining curry powder and season with salt and pepper. Cook until most of the liquid has been absorbed, about 12 minutes, adding a quarter cup of water if needed. As the water boils and the couscous cooks, shred the chicken. Stir in the chard leaves and shredded chicken and cook until leaves are wilted and the chicken is warm, about 3 minutes more. Stir in lemon juice and half of cilantro. Season to taste with salt and pepper. Top with remaining cilantro and pepitas and serve.</p>"}]}