{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140206-282344-dinner-tonight-roasted-lake-trout-broccoli-nuoc-mam.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Vietnamese", "keywords": ["broccoli", "easy", "fish", "quick", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Lake Trout With Nuoc Mam Gung and Broccoli", "link": "https://www.seriouseats.com/recipes/2014/02/lake-trout-nuoc-mam-gung-broccoli-recipe.html", "description": "Roasted fish gets paired with a flavorful Vietnamese dipping sauce called <em>nuoc mam gung</em>&mdash;a potent mixture of ginger, garlic cloves, chilies, lime juice, sugar, and fish sauce&mdash;that tugs at your tongue in all directions. Plus, all you have to do for the sauce is toss everything in a bowl and stir.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Broccoli", "Dinner Tonight", "Fish", "Mains", "Vietnamese"], "recipeIngredient": ["1 pound broccoli", "2 garlic cloves, peeled ", "1/4 cup rice wine vinegar ", "6 tablespoons canola oil, divided", "Kosher salt and freshly ground black pepper", "4 (6-ounce) fish fillets (lake trout, salmon, or other firm-fleshed fish) ", "Handful fresh cilantro leaves, chopped ", " ", "<strong>For the Nuoc Mam Gung</strong>", "2 garlic cloves", "2 hot fresh chilies (jalapeño, serrano, or Thai bird), stemmed, seeded, and minced", "1-inch piece ginger, peeled, minced ", "3 tablespoons sugar ", "6 tablespoon juice from 4 to 6 limes", "4 tablespoons fish sauce "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper middle and lower middle position. Use a vegetable peeler to peel the broccoli stems, then cut the broccoli lengthwise into 2-inch-wide pieces. Transfer broccoli pieces to a roasting pan large enough to fit them in a single layer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Smash garlic and a teaspoon of salt in a mortar and pestle or with the back of a knife until it is a paste. Transfer to a small bowl and whisk in vinegar and 4 tablespoons canola oil. Pour this mixture over the broccoli, season with salt and pepper, and toss until evenly coated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer roasting pan to the bottom rack of oven and cook for 7 minutes. Flip the broccoli pieces with a pair of tongs and continue roasting until the broccoli is tender and a sharp knife easily pierces the stem, about 8 minutes longer. Set aside when done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, season the fish fillets with salt and pepper. Heat remaining 2 tablespoons canola oil in an ovenproof skillet or cast-iron skillet over medium-high heat. When oil starts to shimmer, add the fillets skin-side down and cook until bottom starts to brown, 4 to 5 minutes. Carefully use a spatula to move the fillets to make sure the skin isn’t stuck to the pan, and then transfer pan to top rack in the oven to finish cooking the fish, 5 to 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the nuoc mam gung</strong>: Combine garlic, chilies, ginger, sugar, lime juice, and fish sauce in a small bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the fish and broccoli with the sauce in a small container on the side, or spoon some of the sauce on top of the fish. If you’d like, garnish with some cilantro. </p>"}]}