{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140727-btb-stonedtart.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "dessert", "fruit", "sweet and vicious", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stoned Tart From 'Sweet and Vicious'", "link": "https://www.seriouseats.com/recipes/2014/07/stoned-tart-from-sweet-vicious.html", "description": "What seems like a simple tart is so much more, thanks to the cleverness of this recipe from Libbie Summers' new cookbook, <em><a href=\"http://www.amazon.com/Sweet-Vicious-Attitude-Libbie-Summers/dp/0847841049/?tag=serieats-20\" target=\"_blank\">Sweet and Vicious: Baking with Attitude</a></em>. It bakes up beautifully, a layer of pistachio cream mingling with juice from the mixed selection of fresh fruit. A fat scoop of vanilla ice cream is all that's needed for a finishing touch.", "totalTime": "1 hour 40 minutes", "recipeYield": "Serves 8", "recipeCategory": ["Bake the Book", "Fruit Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["3/4 cup all-purpose flour ", "2 tablespoons yellow cornmeal ", "1/4 cup plus 2 teaspoons vanilla sugar (instructions below)", "4 tablespoons cold butter, cubed ", "2 to 4 tablespoons ice water ", "3/4 cup shelled pistachios ", "1/4 cup heavy cream ", "1/2 teaspoon almond extract", "5 stone fruits (any mixture of apricots, peaches, nectarines, or plums), pitted and sliced, skins on ", "2 tablespoons dark brown sugar ", "2 teaspoons fresh lemon juice ", "1 tablespoon Gosling’s Black Seal rum ", "1/2 teaspoon S&V House Blend Citrus Extract (ingredients below)", "1/4 teaspoon ground cinnamon ", "Pinch of salt ", "Ice cream or whipped cream, for serving (optional)", "&nbsp;", "<strong>Citrus Extract</strong>", "3 teaspoons vanilla extract", "1 1/2 teaspoons orange extract", "1 1/2 teaspoons lemon extract", "<strong>Vanilla Sugar</strong>", "1 fresh vanilla bean", "3 cups sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, whisk together the flour, cornmeal, and 1/4 cup vanilla sugar. Cut in the butter using your fingers or two knives. Add 2 tablespoons ice water to the dough and stir to combine. Continue to add ice water by the tablespoon until the dough comes together (this should take no more than 4 tablespoons). Turn the dough out onto a piece of plastic wrap, wrap well, and refrigerate for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor with the blade attachment, pulse the pistachios until roughly chopped. Add the remaining 2 teaspoons vanilla sugar, heavy cream, and almond extract. Pulse until a thick paste forms. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, stir the fruit slices together with the brown sugar, lemon juice, rum, citrus extract, cinnamon, and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a 9 1/2-inch round, 9-inch square, or 13 3/4-inch rectangular tartpan with removable bottom with nonstick baking spray. Remove the dough from the refrigerator and unwrap it. On a lightly floured work surface, roll out the dough to 1/4- inch thick. Drape and press the dough into the prepared pan, covering the bottom and sides, with some overhang. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll a rolling pin over the edges of the tart pan to cleanly cut off the excess dough. Spread the pistachio mixture over the bottom of the dough and arrange the fruit slices on top. Refrigerate to firm up the dough while the oven is preheating. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400° F. Line a baking sheet with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the tart from the refrigerator to the baking sheet and bake in the lower third of the oven for 40 to 50 minutes, until the fruit begins to bubble. Remove from the oven and let cool completely on a wire rack before slicing. Serve with ice cream or whipped cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make Citrus Extract:</strong> Put the extracts in a small, lidded bottle and shake gently to combine. Label the bottle and store in a cool, dark place for up to 1 year. There is no need to refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make Vanilla Sugar:</strong> Cut a slit down the bean, scrape into the sugar. Set aside for 2 weeks to achieve peak flavor.</p>"}]}