{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141013-white-chicken-chili-food-lab-29.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bean", "chicken", "chili", "comfort", "fall", "low carb", "soup", "stew", "white chili", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "14"}, "name": "The Best White Chili With Chicken", "link": "https://www.seriouseats.com/recipes/2014/10/white-chili-with-chicken-best.html", "description": "To be frank, I'm not 100% certain where this dish of tender chicken and white beans bound in a creamy, fresh green-chili sauce topped with shredded cheese comes from. In fact, I wouldn't be surprised if the recipe actually <em>originated</em> on the back of a wrapper from a can chopped green chilies. But our version is better than that. Much, much better. Tender, creamy, spicy, and bright, this is the stuff even a dyed-in-the-wool <em>chile con carne</em> traditionalist will dip their finger into when they think nobody is watching.", "totalTime": "2 hours 15 minutes, plus overnight soak for beans", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Chicken", "Chili", "Mains", "The Food Lab"], "recipeIngredient": ["1 pound dried small white (Navy) beans, Great Northern beans, or cannellini beans (see note)", "Kosher salt", "2 fresh poblano chilies", "4 fresh Anaheim or Hatch chilies", "2 jalapeño chilies", "1 medium onion, peeled, trimmed, and split in halt from top to bottom", "8 medium cloves garlic", "1 whole pickled jalapeño pepper, plus 2 tablespoons pickling liquid from the can", "3 tablespoons vegetable or canola oil", "1 quart <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 tablespoon ground cumin", "1 teaspoon ground coriander seed", "4 boneless skinless chicken breast halves (about 2 pounds)", "1 pound shredded pepper Jack cheese, divided", "2 tablespoons fresh juice from 2 limes, plus 1 lime cut into wedges for serving", "1 cup roughly chopped fresh cilantro leaves, divided", "4 to 6 scallions, white and light green parts only, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover beans with 1 gallon (4 quarts) water. Add 1/4 cup salt and stir until dissolved. Cover and let rest at room temperature at least 8 hours and up to 24. Drain and rinse beans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust broiler rack to 8 inches below broiler element and preheat broiler to high. Place poblanos, Anaheims, jalapeños, onion, and garlic on a foil-lined rimmed baking sheet. Toss with one tablespoon oil using your hands to coat. Season with salt. Place under broiler and broil, turning peppers and rearranging vegetables occasionally, until peppers are blackened on all sides and skins are wrinkled all over, 15 to 20 minutes total. Gather up foil and form a sealed pouch. Let chilies rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chilies and chicken stock in a large bowl. Peel chilies under the chicken stock, leaving skins and seeds behind. Transfer chili flesh to the cup of a hand blender or a standing blender. Add broiled onion, broiled garlic, and the canned jalapeño (do not add jalapeño pickling liquid). Blend until a smooth purée is formed. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining oil in a large Dutch oven over medium heat until shimmering. Add cumin and coriander and cook, stirring, until fragrant, about 30 seconds. Add chili purée and cook, stirring, until incorporated. Strain chicken stock into pot, pressing on skins and seeds to extract as much liquid as possible. Discard skins and seeds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add soaked beans and chicken breasts to pot, adding water as necessary until beans and chicken are fully submerged. Bring to a boil, reduce to a bare simmer and cook, stirring occasionally, until chicken breasts register 150&deg;F on an instant read thermometer, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken breasts to a bowl and let rest. Continue simmering broth and beans until beans are fully tender, about 1 hour total. Remove 1 1/2 cups of beans and their liquid and transfer to a standing blender or the work cup of an immersion blender. Blend until completely smooth. Stir back into pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shred chicken into bite-sized pieces and stir back into stew. Stir in half of cheese until melted. Stir in jalapeño pickling liquid, lime juice, and half of cilantro. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately with extra shredded cheese, lime wedges, cilantro, and scallions.</p>"}]}