{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140327-287928-hot-cross-buns.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["bread", "bun", "hot cross bun"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Hot Cross Buns", "link": "https://www.seriouseats.com/recipes/2014/03/hot-cross-buns-recipe.html", "description": "These traditional sweet Easter buns are filled with raisins and cherries and topped with a frosting cross.", "totalTime": "4 1/4 hours", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Breakfast and Brunch", "Breakfast Sweets", "Easter", "Yeast Bread"], "recipeIngredient": ["3/4 cup warm water, divided", "2 tablespoons plus 1 teaspoon sugar, divided", "1 tablespoon instant (powdered) yeast", "3 cups (12.75 ounces) bread flour", "2 teaspoons ground cinnamon", "1 teaspoons salt", "1/2 cup golden raisins", "1/3 cup dried cherries, coarsely chopped", "2 1/2 tablespoons honey", "1/3 cup vegetable oil", "2 large eggs", "2 teaspoons vanilla extract", "4 tablespoons shortening", "2 tablespoons unsalted butter, softened", "6 ounces confectioners sugar", "1 tablespoon whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl add 1/2 cup warm water. Stir in sugar and sprinkle yeast on top. Cover with plastic wrap and set aside to proof for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer whisk together remaining sugar, flour, cinnamon, and salt. Stir in raisins and cherries until the dried fruit is fully coated in flour. In a medium bowl whisk together remaining 1/4 cup of warm water, honey, vegetable oil, 1 egg, and vanilla extract.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add yeast mixture to flour, then add egg mixture. Stir with a large spoon until just incorporated, about a 30 seconds to a minute. Fit mixer with the dough hook attachment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat dough on medium for several minutes, adding in a few tablespoons of flour until it pulls away from the sides (it will still be stuck to the bottom). Once dough pulls away from the sides, remove from mixer and transfer to a well floured surface. Knead the dough for five minutes by hand, dusting lightly with flour as needed if it gets too sticky (dough will be slightly tacky, but shouldn't outright stick to your hands). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough to a well oiled large bowl. Cover with plastic wrap and set in a warm place to proof until doubled in size, about 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray an 8- by 8-inch baking dish with cooking oil. Once dough has doubled, remove from bowl to a well floured surface. Pat the dough out into an 8- by 8- inch square. Use a sharp knife or pizza cutter to cut the dough into 12 equal pieces. Shape dough into balls and place in the prepared baking dish. Cover baking dish and set in a warm place to rise for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Move oven rack to the center position. Preheat oven to 350&deg;F. Whisk remaining egg to make an egg wash for the buns. Unwrap the baking dish, brush the tops of the buns with the egg wash and place into the oven. Bake until the top is firm and a deep golden brown, about 25 to 30 minutes. Remove from oven and let the buns cool completely before frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl or the bowl of a stand mixer beat together shortening and butter until thoroughly combined. Add confectioners sugar and continue beating, scraping down the sides as needed, until fully incorporated. Beat in whole milk until mixture is smooth. Transfer frosting to a pastry bag fitted with a large round tip. Pipe frosting in the shape of a cross over each bun once the buns have cooled. Store buns in an airtight container for up to one day (though they will be best when fresh). </p>"}]}