{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140909-ideas-in-food-Finished-White-Chocolate-Peanut-Butter.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["chocolate", "dessert", "ice cream", "peanut", "Snickers", "Snickers pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Ultimate Snickers Pie", "link": "https://www.seriouseats.com/recipes/2014/09/ideas-in-food-snickers-pie-recipe.html", "description": "This ice cream pie takes all of the flavors of our favorite Snickers bar and turns them into a chewy, creamy, peanut-y delight. A crisp, chocolate pie crust base stopped with a layer of chewy bittersweet chocolate caramel sauce, followed by a caramelized condensed milk ice cream studded with white chocolate and peanut butter frozen streusel. Finally, a second layer of fudgy caramel sauce on top and a sprinkling of salted peanuts. Now this is what we call a dessert that really satisfies.", "totalTime": "8 hours", "recipeYield": "Serves 8", "recipeCategory": ["Chocolate", "Desserts", "Ice Cream and Frozen Treats", "Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Pie Dough:</strong>", "150 grams all-purpose flour", "30 grams natural cocoa powder", "12.5 grams sugar", "1.5 grams fine sea salt", "113 grams unsalted butter, cold, diced", "28 grams ice water, more if needed", "<strong>For the White Chocolate Peanut Butter:</strong>", "300 grams white chocolate chips", "290 grams creamy peanut butter", "10 grams vanilla paste or vanilla extract", "150 grams salted, roasted peanuts (we used the classic Planter’s)", "<strong>For the Chocolate Caramel Sauce:</strong>", "250 grams sugar", "50 grams water", "25 grams corn syrup", "300 grams bittersweet chocolate", "300 grams heavy cream", "3 grams salt", "<strong>For the Caramelized Condensed Milk Ice Cream:</strong>", "1 (396-gram) can condensed milk", "970 grams heavy cream", "4 grams salt", "reserved frozen, streuselized White Chocolate Peanut Butter", "<strong>To Finish The Snickers Pie:</strong>", "Reserved Chocolate Caramel Sauce", "50 grams roughly chopped, salted, roasted peanuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pie Dough:</strong> Combine the flour, cocoa, sugar and salt in a food processor and pulse them 4-5 times to blend. Add the butter and pulse 2-3 times to blend, until the mixture looks sandy. Strain the ice water into the food processor and run the processor for 5-10 seconds to bring the mixture together. If it seems a little dry add more ice water 1 tablespoon at time. The dough will resemble small pebbles and hold together when you squeeze a bit in your hand. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a floured counter into a pile. Sprinkle to the top lightly with flour. Starting at one end, use the heel of your hand to smear a small amount of dough against the counter and continue moving through the pile until you have smeared most of it into flakes of dough. Do this quickly, being sure not to work any section of dough more than once.Once all of the dough has been flattened, pile the layers up into a stack and gently press into a flattened disc.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour the countertop and roll the dough out to fit into a 9-inch deep-dish pie pan. Lay the dough in the buttered pie pan and gently press it into the pan. Trim the top edges to 1-inch past the edge of the pie dish. Fold the edge under and crimp the circumference of the dough. Let the pie dough rest in the freezer while the oven preheats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350°F. Line the pie dough with foil or crumpled parchment paper and fill with pie weights. Bake for 20 minutes. Remove the pie weights and return the pie dough to the oven for 10 minutes more. The piecrust should be fully cooked through and just set. Let cool completely at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the White Chocolate Peanut Butter:</strong> Put the white chocolate, peanut butter, and vanilla paste into a food processor. Pulse the machine 5 times to begin blending the ingredients. Once a rough paste forms, turn the food processor on and let it run for 5 minutes until the white chocolate and peanut butter form a smooth, uniform paste. Turn the food processor off and add the salt roasted peanuts. Pulse the machine 10 times to roughly chop the peanuts into the white chocolate peanut butter mixture. Put the mixture into a plastic container, cover and freeze. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the white chocolate peanut butter is frozen divide it in half. Reserve half in a covered container in the refrigerator or freezer. Chop the remaining white chocolate peanut butter into chunks. Put the frozen chunks into a food processor and pulse 5 times so the mixture takes on a coarse streusel-like appearance. Put the sandy white chocolate peanut butter in a covered container in the freezer until ready to assemble the pie. The remaining white chocolate peanut butter may be kept in the refrigerator or freezer depending on what you want to do with it. It will keep for at least 2 weeks in the refrigerator and up to 6 months in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Caramel Sauce:</strong> Put the sugar and water into a medium sized saucepan and stir together until the mixture resembles wet sand. Add the corn syrup and set the pot over medium-high heat. Put a lid on the pot and cook the mixture for 5 minutes. Remove the lid and the sugar mixture should be bubbling. Continue to cook without stirring the mixture until it reaches between 195°C-197°C, about 10 minutes. The sugar will be a medium amber color. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan from the heat and carefully add the heavy cream. The mixture will boil violently. Put the pan back on low heat and stir the mixture together until the caramel is dissolved. Remove the pan from the heat and let the mixture cool until it reaches 55°C. Add the chocolate and the salt and stir the mixture together until the chocolate is fully incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take about ¼ of the sauce and use a pastry brush to spread it evenly over the inside of the cooled piecrust. Sprinkle half of the frozen, streuselized White Chocolate Peanut Butter over the sauce, pressing it gently into the crust if necessary. Reserve the piecrust in the freezer until you are ready to fill it with ice cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserve the remaining chocolate caramel sauce in a covered container at room temperature until you are ready to assemble the pie. If you are not making the pie immediately store the caramel in the refrigerator and let come to room temperature before using to finish the pie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Caramelized Condensed Milk Ice Cream:</strong> Put 2 inches of water in bottom of a pressure cooker and add a small rack (the rack is usually included with every pressure cooker). Put condensed milk on the rack and seal lid. Cook at high pressure for 90 minutes. Alternatively, cook canned condensed milk in a pot of boiling water for 3 hours, topping up the water as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow pressure to release naturally. Prepare an ice bath. Once depressurized, open lid and, using tongs, transfer can of caramelized condensed milk to ice bath. Let chill for at least 1 hour, adding more ice as needed, until completely cool: <strong>Do not open can while hot because a hot can of caramelized condensed milk is still under pressure and can erupt.</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the caramelized condensed milk, half of the heavy cream and the salt into the bowl of a stand mixer with the whisk attachment. Turn the mixer on low and increase the speed to medium. The condensed milk will break apart and become absorbed into the cream. Continue to whisk, about 5 minutes, until the cream begins to thicken and the caramelized condensed milk is dissolved in the cream. Pour in the remaining cream and increase the speed to medium high. Whip the mixture until the cream is at soft peaks. Turn the mixer off and fold in the remaining sandy white chocolate peanut butter. Once the inclusion is folded in pour whipped mixture into the prepared piecrust and freeze, uncovered for at lest 4 hours and preferably overnight, until firm and frozen through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish The Snickers Pie:</strong> Take the ice cream pie out of the freezer once it’s fully frozen and use an offset spatula to spread the remaining chocolate caramel sauce over the top of the pie in a thick layer. When ice cream is fully covered, sprinkle the peanuts over the top. Freeze the pie for another hour to set the frosting. Remove the pie from the freezer and let temper for at least 15 minutes. Slice and serve.</p>"}]}