{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/lotus-seed-buns-shao-zhong-2-12.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "baking", "Chinese", "lotus seed", "pastry", "steaming"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Light and Tender Chinese Lotus Seed Buns", "link": "https://www.seriouseats.com/recipes/2014/08/chinese-lotus-seed-buns-recipe.html", "description": "Fluffy and sweet, lotus seed buns are a popular treat at Chinese bakeries. As the name implies, they're flavored with a paste made from lotus flower seeds, which have a light, chestnut-like flavor. This recipe for homemade buns has been perfected to work with either low-gluten flour, or all-purpose. Hot from the steamer, they're a confection not to be missed. The only thing that could make them even better is a cup of bubble tea.", "totalTime": "6 hours", "recipeYield": "Makes 10 buns", "recipeCategory": ["Breakfast Sweets", "Chinese", "Desserts", "Pastry", "Snacks"], "recipeIngredient": ["<strong>For the Lotus-Seed Paste Filling:</strong>", "11 ounces dried lotus seeds (see note)", "Water", "1/4 cup neutral oil, such as vegetable or canola oil", "1/2 to 3/4 cups sugar", "<strong>For the Buns:</strong>", "1 1/4 cups low-protein flour, such as cake or pastry flour, or 3/4 cup plus 2 tablespoons all-purpose flour mixed with 2 tablespoon cornstarch ", "1 1/2 tablespoon sugar", "1/4 teaspoon active dry yeast", "1/4 teaspoon baking powder", "1 tablespoon glutinous rice flour (see note)", "1/4 cup water", "1 tablespoon heavy cream", "Yellow or pink food coloring (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lotus-Seed Paste Filling:</strong> Rinse lotus seeds and soak in a large bowl of water until softened, at least 4 hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tear each seed in half and remove the small bitter sprout (technically the cotyledon) in the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place lotus seeds in a large pot and add enough water to completely cover. Bring to a boil over high heat, then lower heat and simmer, adding more water if necessary to keep seeds covered, until tender, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reserve 1 cup of lotus-seed cooking water, then drain seeds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer seeds to a food processor or blender, add a splash of reserved lotus-seed cooking water, and process to a smooth paste, adding more reserved cooking water if necessary. For a finer texture, pass lotus-seed paste through a fine sieve, though this step is optional.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add lotus-seed paste and oil to a nonstick skillet and heat over medium heat, stirring with a spatula or wooden spoon until oil is incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1/2 cup sugar and stir until incorporated. Taste, and if you want the paste more sweet, add remaining 1/4 cup sugar, 1 tablespoon at a time, until desired sweetness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and set aside. The lotus-seed paste can be made in advance and refrigerated for up to 3 days, or frozen for up to 6 months.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Buns:</strong> In a large bowl, mix low-protein flour or all-purpose flour mixture with sugar, yeast, baking powder, and glutinous rice flour. Add water and stir until incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cream and mix well until a loose, shaggy dough forms. Transfer dough to a work surface and knead until dough is smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll dough into a 1-inch-thick rope. Cut into 10 portions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working 1 piece at a time, roll out dough pieces using a rolling pin, dowel, or glass bottle, to 3 -inch rounds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set 1 scant tablespoon of lotus-seed paste in the middle of each dough round. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working 1 bun at a time, wrap dough around filling to fully enclose it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set buns seam-side down on a lightly floured or parchment-lined plate or baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pressing gently with a dough scraper or the back of a knife, create an indent on the top side of each bun.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover buns with plastic wrap and let stand for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a steamer insert with parchment paper and set up for steaming.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using food coloring, brush top of each bun with food coloring using a pastry brush.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set buns in the prepared steamer, spacing them 1 1/2 inches apart. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam buns until puffed and cooked through, about 15 minutes. Serve hot or at room temperature. </p>"}]}