{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140306-pressed-muffuletta-sandwich-recipe-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["duck", "Peking duck", "pressed sandwich", "sandwich", "shooter's sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roast Duck Shooter's-Style Sandwich With Pickled Carrots, Daikon, Cucumber, and Hoisin Sauce", "link": "https://www.seriouseats.com/recipes/2014/03/roast-duck-pickled-carrots-daikon-shooter-sandwich-food-lab-recipe.html", "description": "Peking-style roast duck is packed into a sandwich with quick-pickled carrots and daikon radish, sliced cucumbers, and hoisin sauce. The flavors are inspired by Chinese sesame pancakes, but when pressed under heavy weights for several hours, it turns into a neat, flavor-packed meal.", "totalTime": "4 hours 20 minutes or up to overnight", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Carrot", "Chicken", "Duck", "Mains", "Other Meats", "Sandwiches", "The Food Lab"], "recipeIngredient": ["1 large cucumber, thinly sliced", "Kosher salt", "1 loaf rustic country sourdough or ciabatta bread", "2 cups <a href=\"http://www.seriouseats.com/recipes/2013/02/pickled-daikon-and-carrot-do-chua.html\">homemade</a> or store-bought Vietnamese Pickled Daikon and Carrots ", "1/2 cup hoisin sauce", "Picked meat and skin from 1 whole <a href=\"http://www.seriouseats.com/2010/09/the-food-lab-how-to-make-peking-duck-at-home.html\">homemade</a> or store-bought Peking duck, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss cucumbers with a large pinch of kosher salt in a colander and place in the sink to drain. Slice off the top 1 to 1 1/2-inches of the loaf of bread using a bread knife. Cut around the perimeter of the interior crumb, making sure not to break through the bottom crust, then use your hand to lift out the excess bread from the inside, leaving you with a hollow bread boat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cucumbers to a salad spinner and spin to remove excess moisture. Set aside. Repeat with pickled carrots and daikon. Layer half oc cucumbers and half of pickles in the bottom of the bread bowl. Top with half the sauce, using a spoon to spread it around. Top with duck meat and duck skin, followed by the remaining pickled, and remaining cucumbers. Spread remaining sauce on the cut side of the sandwich top and close sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap sandwich tightly in aluminum foil or burtcher's paper, then place in between two stiff cutting boards. Place a heavy weight on top (about 40 pounds), press down firmly to flatten sandwich, then let rest under the weight at room temperature for at least 4 hours and up to overnight (keep an eye on the sandwich to ensure that it is pressing evenly).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to eat, remove weights, slice sandwich into four to six pieces through paper or foil with a bread knife, unwrap, and serve.</p>"}]}