{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140603-portuguese-bread-soup-1.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["bread", "chorizo", "cilantro", "egg", "garlic", "Portuguese", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Portuguese Garlic and Cilantro Bread Soup (Açorda à Alentejana)", "link": "https://www.seriouseats.com/recipes/2014/06/how-to-make-portuguese-garlic-bread-soup-recipe.html", "description": "Sort of like congee, but from Portugal and made with stale bread instead of rice, this deeply satisfying soup (it's really more like a porridge), is rich with garlic, olive oil, cilantro, chorizo, and a softly poached egg.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Bread", "Eggs", "Garlic", "Mains", "Rice", "Soups and Stews"], "recipeIngredient": ["3 tablespoons extra-virgin olive oil, plus more for drizzling", "4 ounces dry-cured Spanish style chorizo, quartered lengthwise and thinly sliced", "1 medium yellow onion, finely diced", "6 medium cloves garlic, crushed", "1 small serrano chili, minced", "3/4 cup loosely packed cilantro leaves and tender stems, minced and divided, plus leaves for garnish", "2 cups chicken stock or store-bought low-sodium chicken broth", "8 cups cubed or torn stale Portuguese bread or baguette, with crust", "Water", "Kosher salt and freshly ground black pepper", "4 <a href=\"http://www.seriouseats.com/recipes/2014/04/foolproof-poached-eggs-food-lab-recipe.html\">foolproof poached eggs</a> or <a href=\"http://www.seriouseats.com/recipes/2013/10/sous-vide-soft-poached-eggs.html\">sous-vide poached eggs</a> (optional)", "<a href=\"http://www.seriouseats.com/2014/05/knife-skills-how-to-slice-scallions.html\">Thinly sliced scallions</a>, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a Dutch oven, heat olive oil over medium-high heat until shimmering. Add chorizo and cook, stirring occasionally, until crisped, about 4 minutes. Using a slotted spoon, transfer chorizo to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion, garlic, and serrano chili to same Dutch oven and cook over medium heat, stirring occasionally, until softened, about 3 minutes. Add two-thirds of cilantro and cook, stirring, until onions are lightly golden, about 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add stock to pot and bring to a simmer. Stir in bread and cook, adding water as needed 1/2 cup at a time and stirring occasionally, until bread has absorbed all liquid and has almost completely broken down into a porridge-like texture, about 30 minutes. Stir in remaining minced cilantro and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon bread soup into bowls, top each with a poached egg, if using, along with sliced scallions, cilantro leaves, and crisped chorizo. Drizzle with olive oil and serve immediately.</p>"}]}