{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140528-sopes-shells-recipe.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "Mexican", "keywords": ["chorizo", "corn", "Latin American", "masa", "Mexican", "potato", "sope"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Potato-Chorizo Sopes With Avocado Crema", "link": "https://www.seriouseats.com/recipes/2014/06/draft-potato-chorizo-sopes-avocado-crema-recipe.html", "description": "One stellar member of the wide, wonderful world of Mexican masa-based dishes is the <em>sope</em>, a thin, shallow shell of corn dough that's fried until just crisp on the outside but hot and tender inside, then piled high with any number of meat-based fillings.", "totalTime": "45 minutes", "recipeYield": "Makes 15 sopes, serving about 4 people", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Corn", "Latin American", "Mains", "Mexican", "Pork", "Potato", "Snacks"], "recipeIngredient": ["4 medium waxy potatoes, peeled and cut into 1/2-inch dice (about 2 cups)", "Kosher salt", "1 pound Mexican chorizo, casing removed", "1 small white onion, peeled and finely chopped (about 1 1/2 cups)", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/05/masa-dough-recipe.html\">masa dough</a>", "Vegetable oil, for frying", "1 ripe avocado", "2 tablespoons Mexican crema", "2 tablespoons fresh juice from 2 limes", "Chopped cilantro leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place potatoes in a medium saucepan, cover with water by one inch, and add 1 teaspoon salt. Bring potatoes to a boil over high heat, then cover partially, reduce heat, and simmer until tender, about 8 minutes. Drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add chorizo to a large cast iron skillet and cook over medium-high heat, breaking it up into small pieces, until fat begins to render, about 1 minute. Add onion and continue cooking, stirring and breaking up chorizo, until chorizo is cooked through and onions are tender, about 12 minutes. Lower heat to medium and add drained potatoes to skillet. Cook, smashing filling down and then scraping it up, until filling is browned and crusty, about 10 minutes. Season with salt and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop avocado into a small bowl and mash until completely smooth. Add crema and lime juice and whisk to combine. Transfer to a small bowl or squeeze bottle and refrigerate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide masa into 15 balls. Press each ball into a disk approximately 4-inches wide and 1/4-inch thick. Use your fingertips to form a slight lip around the edge of each disk. Transfer sope shells to a baking sheet lined with parchment paper and cover with a towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 inch of oil in a large wok or Dutch oven to 350°F. Working in batches, fry sope shells, turning once, until golden brown and just crisped on the outside, about 4 minutes. Transfer fried shells to a paper towel-lined baking sheet and repeat with remaining shells.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange drained sope shells on a platter and heap about two tablespoons chorizo filling on each. Drizzle with avocado crema, garnish with cilantro, and serve immediately.</p>"}]}