{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140908-cold-korean-noodle-soup-daniel-gritzer-9.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Korean", "keywords": ["Asian", "cold", "Korean", "noodle", "soup", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cold Korean Noodle Soup With Asian Pear and Cucumber (Mul Naengmyun)", "link": "https://www.seriouseats.com/recipes/2014/09/cold-korean-noodle-soup-mul-naengmyun-recipe.html", "description": "Gazpacho may be the cold summer soup of choice, but Korea's <em>mul naengmyun</em> should be added to everyone's list of filling hot-weather fare. With a refreshing, lightly sweet-tart broth, slick, chewy noodles, and crisp topping like cucumber and pickled radish, it packs in flavor while beating the heat.", "totalTime": "6 hours", "recipeYield": "serves 4", "recipeCategory": ["Cold Soup", "Korean", "Mains"], "recipeIngredient": ["2 quarts homemade or store-bought low-sodium chicken stock", "3 whole scallion (1 left whole, 2 thinly sliced for garnish)", "1 (1-inch) piece fresh peeled ginger", "4 medium cloves garlic", "1 packet unflavored gelatin softened in 1/4 cup water for 1 minute, if using store-bought broth", "1/2 pound thinly sliced beef brisket", "Kosher salt", "1 (12-ounce) package Korean pickled radish with brine (see note), julienned", "4 portions Korean naengmyun noodles (see note)", "1/2 cup Julienned cucumber, for garnish", "1/2 cup Julienned peeled Asian pear, for garnish", "4 <a href=\"http://www.seriouseats.com/recipes/2014/04/steamed-hard-boiled-eggs-recipe.html\">hard boiled eggs</a>, peeled and halved", "Rice vinegar, for serving", "Mustard or mustard oil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pot, combine stock with whole scallion, ginger, and garlic and simmer, covered, for 20 minutes. If using store-bought broth, stir in softened gelatin until dissolved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently poach brisket slices in simmering broth until just cooked, about 30 seconds to 1 minute. Using a wire mesh spider or a slotted spoon, transfer brisket to a plate and let cool slightly, then cover with plastic wrap and refrigerate. Season broth with salt. Add pickled radish brine to taste (you want the broth very slightly sweet and tart). Strain broth through a fine mesh strainer into a large heatproof container, discarding solids, and refrigerate until chilled, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Skim all fat from surface of chilled broth. Transfer broth to freezer until frozen, at least 3 hours. Before serving, remove broth from freezer and either allow to defrost partially, or microwave in 30-second intervals until partially defrosted. Using a butter knife, break partially frozen broth up into a slushy texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pot of salted boiling water, cook noodles following package instructions. Run under cold water until chilled, then squeeze out excess water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange noodles in deep bowls. Spoon slushy broth all around and top with pickled radishes, cucumber, Asian pear, eggs, chilled poached brisket, and remaining sliced scallions. Serve, passing rice vinegar and mustard or mustard oil at the table for diners to season to taste.</p>"}]}