{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140322-286741-sunday-brunch-eggs-sardou.JPG", "author": {"@type": "Person", "name": "Sydney Oland"}, "recipeCuisine": "", "keywords": ["artichoke", "breakfast", "brunch", "creole", "egg", "eggs sardou", "New Orleans", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Eggs Sardou (New Orleans-Style Poached Eggs With Artichoke Hearts, Spinach, and Hollandaise)", "link": "https://www.seriouseats.com/recipes/2014/03/eggs-sardou-recipe-artichoke-spinach.html", "description": "Creamed spinach topped with artichoke hearts, poached eggs, and Hollandaise sauce is a hearty alternative to eggs Benedict, and a New Orleans classic.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Mother's Day", "Spinach"], "recipeIngredient": ["3 tablespoons butter, divided", "1 clove garlic, finely chopped (about 1 teaspoon)", "1 small shallot, finely chopped (about 1/3 cup)", "2 tablespoons all-purpose flour", "1 1/2 cups whole milk", "10 ounces fresh spinach leaves (about 5 cups), roughly chopped", "Dash hot sauce", "Kosher salt and freshly ground black pepper", "8 whole canned artichoke bottoms (from one 14-ounce can)", "8 eggs", "1 <a href=\"http://www.seriouseats.com/recipes/2013/04/foolproof-2-minute-hollandaise-recipe.html\">recipe Foolproof 2-Minute Hollandaise</a> (seasoned with a dash of hot sauce, such as Tabasco or Frank's)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons butter in a saucepan over medium heat. Add garlic and shallots and cook, stirring, until just softened, about 3 minutes. Add flour and cook stirring constantly until mixture just begins to brown and flour smells toasted, about 4 minutes. Whisking constantly, slowly stir in milk until no lumps remain. Bring to a simmer and cook until thickened, about 5 minutes. Add spinach and stir until wilted. Allow mixture to simmer over low heat, stirring occasionally, until thickened and creamy 15 to 20 minutes. Stir in hot sauce. Season to taste with salt and pepper and keep warm until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While spinach mixture simmers, melt the remaining tablespoon butter in a small skillet over medium heat. Add artichoke bottoms and cook, stirring, until heated but not browned, about 5 minutes. Season with salt and pepper and keep warm until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Poach eggs <a href=\"http://www.seriouseats.com/2013/03/how-to-poach-eggs-easy-way-poached-breakfast-video.html\">according to this video</a> until whites are set but yolks are still runny. Poached eggs can be transferred to a bowl of warm water with a slotted spoon as they cook to hold until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, divide creamed spinach between 4 plates, place 2 warmed artichoke bottoms on top of each portion of spinach, then place one poached in each artichoke. Top with Hollandaise and serve immediately.</p>"}]}