{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/02032014-btb-dulcedelechepudding.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["butterscotch", "dulce de leche", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dulce de Leche Pudding", "link": "https://www.seriouseats.com/recipes/2014/02/dulce-de-leche-pudding.html", "description": "Milk and sugar taste like so much more when you let them simmer slowly. The gorgeous creamy amber of this pudding belies a flavor that's part butterscotch, part caramel, and completely irresistible.", "totalTime": "several hours, if preparing dulce de leche", "recipeYield": "serves 6", "recipeCategory": ["Bake the Book", "Desserts", "Puddings and Custards"], "recipeIngredient": ["1 1/4 cups whole milk", "1 1/4 cups heavy cream", "6 tablespoons cornstarch", "3 egg yolks", "1 tablespoon dark brown sugar", "1/8 teaspoon salt", "2 recipes Dulce de Leche (ingredients and instructions follow)", "&nbsp;", "One 14-ounce can sweetened condensed milk (for this recipe, you'll need two)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, to make the dulce de leche: Place an unopened14-ounce can of sweetened condensed milk in a small saucepan. Fill the saucepan with water until it comes 3/4 of the way up the sides of the can.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the saucepan to a boil over high heat, then turn down to a strong simmer. Let simmer at least 3 hours and up to 5 hours, flipping the can every 30 minutes and adding more water whenever the level drops to the halfway point on the sides of the can. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a jar lifter, tongs, or heatproof oven mitt, remove can from water and let cool at room temperature until easy to handle, 30 minutes.</p>\n\n<p>note: You'll need two cans' worth dulce de leche for this recipe, so either use a saucepan wide enough to accommodate two cans with room, or keep two small saucepans going at the same time. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pudding:</strong> In a medium saucepan vigorously whisk together the milk, heavy cream, cornstarch, egg yolks, brown sugar, and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook over medium-high heat, whisking constantly, until thick, 5-6 minutes. (Once you can lift the whisk from the pudding and it leaves a faint shadow, it's done; this pudding will seem much thicker than others, but once you add the sauce it will thin out.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the pudding through a fine-mesh sieve into a bowl, pressing pudding through sieve with a silicone spatula. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the dulce de leche directly into the hot pudding base until fully incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool at room temperature for 10 minutes. Press a layer of plastic wrap onto the surface of the pudding, and chill completely in refrigerator, 2 hours. </p>"}]}