{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140421-Preserved-Strawberry-Rhubarb-toast.JPG", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["Jam", "preserve", "rhubarb", "strawberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Strawberry Rhubarb Jam", "link": "https://www.seriouseats.com/recipes/2014/04/strawberry-rhubarb-jam.html", "description": "This rosy jam captures all the joy of springtime into what may be the most perfect preserve of the year. This is a low-sugar jam with a loose texture. It's especially nice swirled into plain yogurt or spread over fresh goat cheese on toast.", "totalTime": "2 hours", "recipeYield": "6 half-pint jars", "recipeCategory": ["Condiments and Sauces", "Preserved", "Rhubarb", "Strawberry"], "recipeIngredient": ["1 1/2 to 2 pounds strawberries (about 2 quarts)", "2 pounds rhubarb", "3 tablespoons lemon juice", "1 1/2 cups (0.75 pounds) granulated sugar", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare boiling water canner and sterilize 6 half-pint jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids and rings to sit in hot water until you need them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash, hull, and slice strawberries. In a non-reactive bowl, stir the sugar into the berries and allow to macerate while you prepare the rhubarb. Trim rhubarb and slice into 1 centimeter chunks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rhubarb and lemon juice in a large, non-reactive, heavy-bottomed saucepan or Dutch oven. Bring to a boil, then reduce heat and simmer, partially-covered, for approximately ten minutes, stirring often, until rhubarb melts into an applesauce-like texture. Once rhubarb is completely broken down, add the strawberries and sugar to the saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vanilla extract and bring the entire mixture to a boil. Continue to cook until it reaches 220°F. Turn off heat and skim off any foam with a spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle the hot jam into prepared jars, leaving 1/4 inch head space. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to a boil. Once the water boils, set a timer for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When jars have boiled ten minutes, turn off heat, and allow jars to sit in water for five additional minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a jar lifter, remove the jars to a cooling rack and allow to cool. Once jars have reached room temperature, remove rings and test that the lids have all sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight. </p>"}]}