{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140707-small-house-thai-cooking-school-larb-moo-muang-6.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["easy", "larb", "Northern Thai", "offal", "pork", "quick", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Larb Muang Moo (Northern Thai-Style Chopped Pork Salad)", "link": "https://www.seriouseats.com/recipes/2014/09/larb-muang-moo-northern-thai-style-chopped-pork-salad-recipe.html", "description": "This ain't your grandma's pork larb. Unless your grandma happens to be of Lanna descent and native to Northern Thailand, in which case, this is probably very much like your grandma's pork larb. Unlike Isan larb, this is a darker mince, with tender bits of lean pork mixed together with chunks of fat, chewy bits of intestine, and a rich, thick sauce flavored with crushed spices and pork blood. It's not larb for the faint of heart, but it's one worth seeking out or cooking at home if you've got any interest in offal.", "totalTime": "30 minutes", "recipeYield": "Serve 4", "recipeCategory": ["Mains", "Offal", "Pork", "Thai"], "recipeIngredient": ["2 small dried hot chilies", "1/4 teaspoon whole coriander seed", "1/4 teaspoon whole Sichuan peppercorns", "1 whole long pepper (see note)", "1/4 teaspoon whole cloves", "1 star anise pod", "1 (1/4-inch piece) mace, or 1/4 teaspoon ground nutmeg", "1/2 a cinnamon stick", "4 pods <a href=\"http://www.templeofthai.com/food/spices/cardamom-3101000344.php\">Thai black cardamom</a>, inner seeds only, or 1 pod green cardamom", "1/4 teaspoon whole black peppercorns", "2 tablespoons vegetable or canola oil", "6 small clove garlic, skins on, smashed in a mortar and pestle or under a heavy skillet", "1/2 pound lean pork loin or shoulder, chopped by hand into pieces no larger than 1/4-inch (see note)", "1/4 pound mixed pork offal such as kidney, liver, or tripe, chopped by hand into pieces no larger than 1/4-inch (see note)", "1/4 cup chopped fresh cilantro leaves and fine stems", "1/4 cup fresh pork blood (see note)", "Kosher salt", "Fish sauce", "Sticky rice or regular rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine hot chilies, coriander, Sichuan peppercorn, long pepper, cloves, star anise, mace, cinnamon, cardamom, and black pepper in wok. Heat over medium heat, stirring and tossing constantly, until toasted and fragrant, about 2 minutes. Transfer to a mortar and pestle or a spice grinder and grind into a fine powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out wok and add oil. Heat over medium heat until shimmering. Add smashed garlic and cook, stirring frequently, until golden brown and crisp, about 1 1/2 minutes. Remove garlic with a slotted spoon and set aside on a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat garlic oil over high heat until shimmering. Add pork and pork offal and cook, stirring and tossing constantly, until barely cooked through, about 1 minute. Add spice blend and cilantro and cook, stirring, until fragrant, about 30 seconds. Add pork blood if using and cook, stirring, until thickened, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season mixture to taste with salt and fish sauce. Serve immediately with rice or sticky rice, sprinkled with fried garlic.</p>"}]}