{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140525-btb-macaroons.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["coconut", "cookie", "lime", "macaroon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chewy Coconut Macaroons With A Cheeky Touch of Lime", "link": "https://www.seriouseats.com/recipes/2014/05/chewy-coconut-macaroons-with-a-cheeky-touch-o.html", "description": "Macaroons are sticky and sweet by nature, even when they haven't been dipped in chocolate. <em>A Lighter Way to Bake</em> swaps sweetened coconut for plain, adds a sprinkling of sugar and a kiss of lime to make these chewy, summery sweets.", "totalTime": "30 minutes", "recipeYield": "makes 15 macaroons", "recipeCategory": ["Bake the Book", "Coconut", "Cookies", "Lime"], "recipeIngredient": ["5 egg whites ", "3 tablespoons sugar", "5 ounces (1/2 cup plus 2 tablespoons) desiccated coconut", "2 tablespoons whole wheat flour", "Finely grated zest of 1 lime (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and line a baking sheet with baking parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the egg whites in a large bowl and lightly whisk them until they become frothy (like a bubble bath). Then add the sugar, coconut and flour and mix it all together to give a sticky mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using damp hands, divide the mixture into 15 even-size pieces. The mixture will be sticky but crumbly, but don’t worry too much for now. Then squidge each piece into a pyramid shape, with a flat bottom and pointy top. This will take a bit of time and patience to get a good shape. Rinse your hands as you shape, leaving them damp, which helps avoid the mixture sticking too much to you. Place the macaroons upright on the baking sheet as you go.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15–20 minutes or until the macaroons are going golden brown all over. The sharp edges and top will be a bit darker golden. When they are ready, remove them from the oven and set aside to cool. Once cool, arrange them on a serving plate, scatter the lime zest over (if using) and serve.</p>"}]}