{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141025-skillet-roast-chicken-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brussels sprout", "carrot", "cast iron", "chicken", "fall", "potato", "poultry", "roast", "vegetable", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8888888888889", "ratingCount": "9"}, "name": "Pan-Roasted Chicken With Vegetables and Dijon <i>Jus</i>", "link": "https://www.seriouseats.com/recipes/2014/10/pan-roasted-chicken-vegetables-dijon-jus-recipe.html", "description": "While a simple roast chicken is swell, and fall vegetables are pretty much <em>made</em> for roasting, wouldn't it be nice if there were a recipe that delivered a roast chicken with supremely crisp, crackling skin and juicy meat along with tender, charred roasted vegetables&mdash;all in one go? That's precisely what this recipe does, and it gets you a pitcher full of bright, rich gravy to boot.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "Potato", "Roasting", "The Food Lab"], "recipeIngredient": ["16 fingerling or yellow new potatoes, scrubbed", "3 large carrots, 2 peeled and cut into 1-inch <a href=\"http://www.seriouseats.com/2010/05/knife-skills-how-to-cut-carrots.html\">faux tourné</a> chunks, 1 roughly chopped, divided", "Kosher salt", "16 brussels sprouts, split in half", "Freshly ground black pepper", "4 tablespoons extra-virgin olive oil, divided", "1 whole chicken (about 4 pounds), cut into <a href=\"http://www.seriouseats.com/2010/05/knife-skills-how-to-break-down-a-chicken.html\">8 serving pieces</a>, backbone reserved", "1 cup dry white wine", "1 whole onion, split in half", "1 stalk celery, roughly chopped", "3 to 4 sprigs fresh sage", "2 bay leaves", "2 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 medium shallot, thinly sliced", "2 tablespoons minced fresh parsley leaves", "2 tablespoons unsalted butter", "1 tablespoon Dijon mustard", "1 tablespoon juice from 1 lemon", "2 teaspoons fish sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center positon and preheat oven to 450&deg;F. Place potatoes and faux tourné carrots in a medium saucepan, cover with cold salted water, bring to a boil, and simmer until just tender, about 10 minutes. Drain and transfer to a large bowl. Add brussels sprouts, season with salt and pepper, toss with 2 tablespoons olive oil, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken backbone to now-empty saucepan. Add roughly chopped carrot, onion, celery, sage, and bay leaves. Set aside. Season chicken pieces thoroughly with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in a large cast iron skillet and over high heat until lightly smoking. Add chicken pieces skin side-down and cook, moving chicken as little as possible, until chicken skin is rendered and deep golden brown, 8 to 12 minutes, reducing heat if smoking excessively. Flip pieces as they finish and lightly brown second side, about 3 minutes longer. Transfer browned chicken pieces to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all chicken is browned, add white wine to skillet and scrape up any browned bits with a wooden spoon. Transfer white wine to saucepan with chicken backbone. Pour in any juices that have accumulated on the chicken resting plate and wipe out skillet with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add stock to pot with chicken backbone. Bring to a simmer over high heat, reduce to lowest setting, cover, and let gently bubble while the chicken roasts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining tablespoon oil to skillet and heat over high heat until lightly smoking. Add vegetable mixture. Top with chicken pieces, skin side-up. Transfer to oven. Roast until chicken breast pieces register 150&deg;F and chicken legs register at least 165&deg;F on an instant read thermometer, removing pieces and transferring them to a clean plate as they finish roasting, 20 to 45 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all the chicken pieces have finished roasting, add shallots to skillet with the vegetables and toss to combine. Return to oven and continue roasting, flipping vegetables occasionally, until vegetables and shallots are browned all over, about 10 minutes. Remove skillet from oven, add parsley, toss to coat, then place chicken directly on top of vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain simmering chicken broth mixture into a small saucepan or bowl. Whisk in butter, dijon mustard, lemon juice, and fish sauce. Season jus to taste with salt and pepper. Serve chicken and vegetables immediately, serving jus at the table.</p>"}]}