{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140824-Stuffed-aChicken-Butterflying-Process-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["chicken", "mushroom", "stuffed chicken breast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "7"}, "name": "Mushroom Duxelles-Stuffed Chicken Paprikash", "link": "https://www.seriouseats.com/recipes/2014/08/mushroom-duxelle-stuffed-chicken-paprikash-recipe.html", "description": "This Hungarian-inspired dish centers around a lemony mushroom filling stuffed into boneless chicken breasts. Once the meat is seared in a Dutch oven, the same pot is used to make a rich, creamy paprika sauce.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "Mushrooms"], "recipeIngredient": ["<strong>For the Stuffed Chicken:</strong> ", "2 tablespoons extra-virgin olive oil ", "1 pound button mushrooms, washed, dried, and minced ", "1 medium white onion, minced", "Kosher salt and freshly ground black pepper", "Zest and juice of 1 lemon", "1/3 cup port wine", "4 boneless, skinless chicken breast halves", "<strong>For the Gravy:</strong> ", "2 tablespoons extra-virgin olive oil", "1 medium red bell pepper, stemmed, seeded, and finely chopped", "1 medium yellow onion, finely chopped", "2 medium cloves garlic, minced", "2 plum tomatoes, cored, seeded, and finely chopped", "1/4 cup minced pickled banana peppers", "2 tablespoons sweet paprika, preferably Hungarian", "1/2 teaspoon ground caraway", "2 bay leaves", "4 sprigs thyme", "1/2 cup dry white wine", "1 1/4 cups low-sodium chicken broth", "Kosher salt and freshly ground black pepper", "1/2 cup sour cream", "1 1/2 tablespoons all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Stuffed Chicken:</strong> Heat oil in a large skillet over medium-high heat until shimmering. Add mushrooms and onion and cook, stirring occasionally, until browned, about 12 minutes. Season with salt and pepper and stir in lemon zest and juice. Continue to cook until deeply browned, about 4 minutes longer. Add port and cook until nearly evaporated, about 2 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, butterfly the chicken breast halves: Slice along the length of each breast, and, working parallel to the cutting board, continue slicing until nearly all the way through (but not completely), so that each breast opens like a book.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set each butterflied chicken breast half on a sheet of plastic wrap. Cover with another sheet of plastic wrap and, using a meat pounder, pound each breast to a 1/4-inch thickness. Remove plastic and trim each chicken breast to form an even rectangle. Spread 2 tablespoons of mushroom filling over each chicken breast, leaving a 1/4-inch border around the edges. Roll each breast lengthwise and secure at 3/4-inch intervals with kitchen twine. Season chicken all over with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Gravy:</strong> Heat olive oil in a Dutch oven over medium-heat until shimmering. Sear chicken rolls on all sides until brown, about 5 minutes. Transfer meat to a platter and reserve. Add bell pepper and onion and cook, stirring occasionally, until vegetables soften, 5 to 7 minutes. Reduce heat to medium. Add garlic and continue to cook, stirring, for 2 minutes. Add tomatoes, banana peppers, paprika, caraway, bay leaves, thyme, and wine. Bring to a boil, then simmer until alcohol evaporates, about 5 minutes. Add chicken stock and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together sour cream and flour in a small bowl until there are no lumps. Whisk about 1/4 cup of the hot liquid from the sauce into the sour cream, then whisk sour cream mixture into the sauce. Return to a boil. Return chicken to Dutch oven. Reduce heat to low and cook until an instant-read thermometer registers 150&deg;F (or 160&deg;F if you want to follow USDA guidelines) when inserted into the center of chicken rolls, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard bay leaves and thyme sprigs. Let stand for 5 minutes, then serve chicken rolls with paprika sauce spooned on top.</p>"}]}