{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141210-latke-variations-sweet-potato-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Niki Achitoff-Gray"}, "recipeCuisine": "Kosher", "keywords": ["carrot", "hanukkah", "Jewish", "latke", "pancake", "potato", "squash", "sweet potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spiced Sweet Potato, Carrot, and Acorn Squash Latkes", "link": "https://www.seriouseats.com/recipes/2014/12/hanukkah-sweet-potato-carrot-squash-latkes-with-ginger-recipe.html", "description": "Sweet potatoes, carrots, and acorn squash form a natural partnership in these latkes, while freshly grated ginger delivers a bright heat that cuts right through the vegetable base.", "totalTime": "1 hour", "recipeYield": "Makes about 24 latkes", "recipeCategory": ["Carrot", "Hanukkah", "Kosher", "Potato", "Sides", "Squash", "Stovetop", "Sweet Potatoes and Yams", "Vegetarian"], "recipeIngredient": ["1/2 pound (225g) carrots, shredded on the shredding disk of a <a href=\"https://www.seriouseats.com/2017/10/best-food-processor-equipment-review.html\">food processor</a> (2 cups shredded)", "3/4 pound (340g) acorn squash, trimmed, peeled, and shredded on the shredding disk of a food processor (2 cups shredded)", "3/4 pound (340g) sweet potato, peeled and shredded on the shredding disk of a food processor (2 cups shredded)", "1 pound (450g) russet potatoes, peeled, trimmed, and shredded on the shredding disk of a food processor (3 cups shredded)", "6 cups chopped onion (about 6 medium onions)", "4 teaspoons grated fresh ginger", "1 teaspoon smoked paprika", "1 teaspoon ground coriander", "1/2 teaspoon cumin", "4 large eggs", "1 cup matzo meal, plus more as needed (see note)", "4 teaspoons (16g) kosher salt, plus more if needed", "1 tablespoon freshly ground black pepper, plus more if needed", "Canola or peanut oil, for frying", "Unsweetened applesauce and sour cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in roughly 2-cup batches, wrap carrots, squash, sweet potato, russet potato, and onion in cheesecloth that has been folded over twice. Tie corners around the handle of a wooden spoon and twist bundle until liquid flows out and vegetables are dry. Add squeezed vegetables to a large mixing bowl and toss to combine thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in ginger, paprika, coriander, and cumin. Mix in eggs and matzo meal. You should be able to form patties that just stick together in your hands; if the mixture is too wet, add more matzo meal, 1 tablespoon at a time, until patties can be properly formed. Stir in salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1/2 inch oil in a cast iron skillet over medium-high heat until a shred of potato immediately bubbles when dropped in. Form a small amount of latke mixture into a disk and fry on both sides until golden brown to test for seasoning. Taste and add more salt and pepper if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form patties about 3 inches wide and 1 inch thick in the center and slide into pan (no more than 4 at a time). Fry until a golden-brown crust forms on bottom, then flip using a slotted spatula and fork and fry until golden brown on other side and cooked through, approximately 3 minutes per side. If a darker crust is desired, continue cooking on each side to desired doneness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a baking sheet lined with paper towels and let cool for 2 minutes. Serve with applesauce and sour cream at the table.</p>"}]}