{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140321-meyerlemon-olive-focaccia.JPG", "author": {"@type": "Person", "name": "Carrie Vasios Mullins"}, "recipeCuisine": "", "keywords": ["bread", "focaccia bread", "meyer lemon", "olive"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Meyer Lemon and Olive Focaccia", "link": "https://www.seriouseats.com/recipes/2014/03/meyer-lemon-and-olive-focaccia.html", "description": "This easy focaccia bread gets a tart bite from thin slices of Meyer lemon and a salty hit from Kalamata olives.", "totalTime": "4 hours", "recipeYield": "Makes 1 9- by 13-inch sheet of focaccia", "recipeCategory": ["Olives", "Snacks", "Wake and Bake", "Yeast Bread"], "recipeIngredient": ["1 3/4 cups warm water", "2 1/4 teaspoons active dry yeast", "4 cups all purpose flour", "2 teaspoons salt", "2 tablespoons olive oil, plus more for coating pan", "1 Meyer lemon, wash well and cut into thinnest slices possible", "3/4 cup pitted kalamata olives", "Large flake sea salt, such as Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly oil a large bowl with olive oil; set aside. Combine yeast and warm water in a bowl or measuring cup and let sit until proofed and bubbling, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine flour and salt and pulse three times to combine. Add yeast mixture and 2 tablespoons olive oil. Pulse until dough comes together into a ball. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wet your hands and remove dough from food processor (it will be sticky) and form into a ball. Place dough in oiled bowl and cover with a dish towel. Set in a warm place and let rise until doubled in size, about 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease baking sheet with olive oil. Punch down dough and place on baking sheet. Use your hands to spread dough out to cover baking sheet. Cover with a dish towel and let rise for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375&deg;F. Use your fingers to poke dimples across surface of dough. Sprinkle dough with about 1 tablespoon olive oil, using your fingers to spread it to cover the entire surface. Place lemon slices and olives across top of dough. Sprinkle with as much flakey sea salt as desired (I used about 2 teaspoons). Bake in oven until golden, about 30 minutes. </p>"}]}