{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/09/khaosoigai.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["asia", "coconut", "curry", "khao soi", "laksa", "noodle", "Northern Thai", "soup", "Thailand"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "12"}, "name": "Real-Deal Khao Soi Gai (Northern Thai Coconut Curry Noodle Soup With Chicken)", "link": "https://www.seriouseats.com/recipes/2014/09/khao-soi-gai-northern-thai-coconut-curry-noodle-soup-recipe-laksa.html", "description": "Rich, creamy, and packed with uncompromising flavor from a slew of aromatics and shrimp paste, this classic Northern Thai soup combines tender braised chicken in a coconut-y curry broth with boiled and fried noodles. Our version is the real deal, straight from the streets of Chiang Mai.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Coconut", "Dairy-Free", "Mains", "Noodles", "Soups and Stews", "Thai"], "recipeIngredient": ["1 whole dried Thai bird chili (or 1 whole chile de arbol), more or less to taste", "2 whole small shallots, peeled and split into quarters", "4 whole cloves garlic", "1 stalk lemongrass, bottom 4 inches only, roughly chopped", "1 teaspoon makrut lime zest, or 2 whole makrut lime leaves (see note)", "1 (1-inch) knob fresh turmeric, roughly chopped", "2 thin slices ginger", "1 small bunch cilantro stalks, cut from the very base of the stalks, leaves and thin stems reserved for another use", "1 teaspoon whole coriander seed", "6 pods <a href=\"http://www.templeofthai.com/food/spices/cardamom-3101000344.php\">Thai black cardamom</a> or 1 pod green cardamom, inner seeds only", "Kosher salt", "1 1/2 tablespoons <a href=\"http://www.amazon.com/dp/B000F1LMNS/?tag=serieats-20\">Thai shrimp paste</a>", "1 cup vegetable or canola oil", "1 pound fresh Chinese-style egg noodles, divided", "2 (15-ounce) cans coconut milk, or 2 cups fresh coconut milk (do not shake)", "1 cup homemade or store-bought low-sodium chicken stock", "2 tablespoons palm sugar (see note)", "4 chicken legs, split into drumsticks and thighs", "Fish sauce to taste", "Sliced shallots, lime wedges, and pickled Chinese mustard root (see note) for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chili, shallots, garlic, lemongrass, lime zest, turmeric, ginger, cilantro stalks, coriander seed, and cardamom in the center of a 12- by 12-inch square of heavy duty aluminum foil. Gather edges up to make a tight pouch. Place pouch directly over the flame of a gas burner and cook, turning occasionally, until aromatic and wisps of smoke begin to rise, about 8 minutes. If no gas burner is available, place the pouch in the bottom of a wok or cast iron skillet and heat over high heat, turning occasionally, until smoky, about 10 minutes. Allow contents to cool slightly and transfer to a large mortar and pestle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a large pinch of salt to the aromatics. Pound until a very fine paste is formed, about 10 minutes. Add shrimp paste and pound to incorporate. Set curry paste mixture aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate out 1/4 of the noodles (enough noodles to make a crispy fried-noodle topping for 4 bowls) and set the remaining noodles aside. Heat vegetable oil in a large wok over high heat until shimmering. Working in batches, add noodles to oil and fry, stirring and flipping until golden brown and crisp. Transfer to a paper towel-lined plate. Season with salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard all but 1 tablespoon oil from wok. Using a spoon, skim 2 tablespoons of creamy fat off the top of the coconut milk and add to the wok. Heat wok over high heat and cook, stirring constantly, until coconut milk breaks and oil begins to lightly smoke, about 2 minutes. Add curry paste mixture and cook, stirring and smearing the paste into the oil, until aromatic, about 45 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly whisk in the coconut milk, followed by the chicken stock and palm sugar. Add chicken legs and bring to a simmer. Cook, turning chicken occasionally, until chicken is tender and broth is very flavorful, about 30 minutes. Season to taste with fish sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of salted water to a boil. Add remaining uncooked noodles and cook until al dente, about 1 minute. Drain noodles and divide between four warmed bowls. Top noodles with two pieces of chicken. Divide broth evenly between bowls. Top with fried noodles and serve immediately with sliced shallots, lime wedges, and pickled mustard greens on the side.</p>"}]}