{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140522-soft-shell-crab-sandwich-pickled-veg.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["bánh mì", "crab", "quick", "sandwich", "soft shell crab"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sautéed Soft-Shell Crab Sandwiches With Pickled Vegetables, Cilantro, and Ginger-Chili Mayo", "link": "https://www.seriouseats.com/recipes/2014/05/sauteed-soft-shell-crab-sandwiches-recipe.html", "description": "Inspired by both the Cantonese dish of crabs sautéed with scallions and ginger, and Vietnamese banh mi, these oversized soft-shell crab sandwiches feature lightly toasted soft baguettes packed with three crisp sautéed soft-shell crabs each, along with ginger-chili mayo, quick-pickled carrots and cucumbers, fresh scallions, and cilantro.", "totalTime": "30 minutes", "recipeYield": "Makes 2 large sandwiches, serving 2 to 4", "recipeCategory": ["Lobster and Crab", "Sandwiches"], "recipeIngredient": ["1 medium carrot, peeled and cut into fine matchsticks", "1 medium cucumber, seeds removed, split lengthwise into 1/4-inch spears", "1/2 tablespoon sugar", "1 teaspoon kosher salt, plus more for seasoning", "1/4 cup rice vinegar", "2 tablespoons water", "1/4 cup mayonnaise", "1 1/2 tablespoons <a href=\"http://www.seriouseats.com/2013/04/sauced-sambal-oelek.html\">sambal oelek</a>, <a href=\"http://www.seriouseats.com/2012/02/how-to-make-sriracha-from-scratch-sauces.html\">Sriracha</a>, or other chili paste", "1 (1-inch) piece fresh peeled ginger, finely grated on microplane", "1 medium garlic clove, finely grated on microplane", "1/2 cup cornstarch", "6 large soft-shell crabs, preferably jumbo or \"whale\" size, <a href=\"http://www.seriouseats.com/2014/05/how-to-clean-soft-shell-crabs.html\">cleaned</a>", "4 tablespoons vegetable oil", "2 Vietnamese-style baguettes, split and lightly toasted, or 1 French baguette, halved, split, and lightly toasted", "2 scallions, white and light green parts only, thinly sliced lengthwise", "Cilantro leaves and fine stems from 1 bunch, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine carrot, cucumber, sugar, and salt in a large bowl. Using fingertips, massage salt and sugar into vegetables until dissolved. Add rice vinegar and water and let stand for at least 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small bowl, thoroughly mix together mayonnaise, chili paste, ginger, and garlic. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow bowl, stir together cornstarch with a pinch of salt. Lightly dredge crabs in the seasoned cornstarch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, wide skillet, heat oil over medium-high heat until shimmering. Add crabs, shell-side down, and cook until golden and crisp, about 3 minutes; be careful, as soft-shell crabs sometimes pop in the pan. Flip crabs and cook until golden and crisp on bottom side, about 3 minutes. Transfer crabs to paper-towel-lined plates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain carrot and cucumber. Spread top and bottom halves of baguettes with ginger-chili mayonnaise. Arrange 3 crabs on each of the bottom halves and top with scallions and pickled carrot and cucumber. Top with cilantro sprigs, close sandwiches, and serve immediately.</p>"}]}