{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/05032014-kung-pao-fish-02.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "fish", "sichuan pepper", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kung Pao Fish With Dried Chilies and Sichuan Peppercorns", "link": "https://www.seriouseats.com/recipes/2014/06/kung-pao-fish-dried-chilies-sichuan-peppercorns-recipe.html", "description": "In this variation on Kung Pao chicken, firm white-fleshed fish such as catfish or tillapia is marinated with soy sauce and white pepper, then deep fried until golden. Afterwards, it's stir-fried with classic Sichuan flavors: spicy dried chilies, mouth-numbing Sichuan peppercorns, and garlic.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Fish", "Mains", "Stir Frying"], "recipeIngredient": ["<strong>For the Marinade and Fish:</strong>", "1 pound firm white-fleshed fish fillets, such as catfish or tilapia, cut into 1-inch pieces", "1 tablespoon egg white, lightly beaten", "1 teaspoon soy sauce", "1/4 teaspoon ground white pepper", "2 tablespoons cornstarch", " ", "<strong>For the Sauce:</strong>", "1 tablespoon <em>doubanjiang</em> (see note)", "2 teaspoons rice vinegar", "1 tablespoon soy sauce", "2 teaspoons sugar", "3 tablespoons water", "1 teaspoon cornstarch", " ", "<strong>For the Stir-Fry:</strong>", "2 cups plus 1 tablespoon peanut or vegetable oil, divided", "4 scallions, cut into 1-inch pieces on the bias", "10 to 15 hot Chinese dry chili peppers, halved", "4 medium cloves garlic, finely minced", "2 teaspoons Sichuan peppercorn", "1/4 cup roasted-garlic-flavored peanuts or regular roasted peanuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Marinade and Fish:</strong> Place fish in a large bowl. Add remaining marinade ingredients and, using your hands, gently mix until fish is evenly coated. Let stand 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, For the Sauce:</strong> In a bowl, thoroughly mix together all sauce ingredients and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Stir-Fry:</strong> In a wok, heat 2 cups oil to 300°F. Working in 3 batches, carefully add fish and fry, gently moving fish around to ensure none sticks to the wok and turning once, until fish is golden, about 1 to 2 minutes per side. Using spider, transfer fish to paper-towel-lined plates to drain. Repeat with remaining fish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To clean and prepare the wok for stir-frying, carefully pour out frying oil and add a few cups of water to the wok. Bring to a simmer while scraping down the wok with a metal spatula. Discard water out and wipe out wok with a paper towel, making sure the cooking surface of the wok is completely dry before proceeding.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 1 tablespoon oil in the wok over high heat until lightly smoking. Add scallion, dried chili peppers, garlic, and Sichuan peppercorns, and stir-fry until fragrant and garlic is lightly golden, about 30 seconds. Add the sauce and mix well (the sauce should thicken almost immediately). Carefully add fried fish and gently toss with sauce to combine. Transfer Kung Pao fish to plate, sprinkle with peanuts, and serve immediately.</p>"}]}