{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/050214-taiwaneats-panfriednoodles-finished.jpg", "author": {"@type": "Person", "name": "Cathy Erway"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "noodle", "rice noodle", "stir fry", "taiwan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Taiwanese Pan-Fried Rice Noodles", "link": "https://www.seriouseats.com/recipes/2014/05/pan-fried-rice-noodles-recipe.html", "description": "Perfect for feeding a crowd or fixing a solo meal on the fly, this simple home-style Taiwanese noodle-and-vegetable dish may look bland, but hidden within are layers of flavor, thanks to plenty of white pepper, black vinegar, and broth.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chinese", "Pasta", "Pork", "Stir Frying"], "recipeIngredient": ["½ pound boneless pork shoulder, cut into thin 2-inch strips", "½ teaspoon cornstarch", "¼ cup plus 1 teaspoon soy sauce (or more to taste)", "1 teaspoon sesame oil ", "6 to 8 dried shiitake mushrooms", "½ pound very thin dried rice noodles (see note)", "3 tablespoons vegetable or peanut oil", "1 large carrot, julienned (about 1 cup)", "1 cup bamboo shoots from one (15-ounce) can, rinsed and julienned", "2 cups pork stock (or substitute with chicken or vegetable stock or low-sodium broth), warmed", "¼ teaspoon ground white pepper (or more to taste)", "Kosher salt", "2 tablespoons black vinegar (or more to taste; see note)", "2 to 3 scallions, white and light green parts only, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pork, cornstarch, 1 teaspoon soy sauce, and sesame oil in a medium bowl and mix thoroughly. Cover and chill for at least 20 minutes, or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cover dried shiitake mushrooms with warm water and let stand until soft throughout, about 20 minutes. Squeeze excess water out of mushrooms and trim off their stems. Slice thinly and set aside. (The soaking liquid may be reserved for making soups, stocks, or braises.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook rice noodles according to the instructions on the package. Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 tablespoon vegetable oil to a large wok or skillet and heat over high heat until shimmering. Add pork and cook, stirring, until no longer pink, about 2 minutes. Remove from pan and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 2 tablespoons oil to same wok or skillet and heat over high heat until shimmering. Add mushrooms, carrots, and bamboo shoots, along with a pinch of the salt. Cook, stirring occasionally, for 1 minute. Return the pork to the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in warm stock and remaining ¼ cup of soy sauce and bring to a boil. Add rice noodles and stir to combine. Stir in white pepper, season with salt, and cook, stirring frequently, until stock is mostly absorbed, about 2 minutes. If desired, add extra soy sauce, salt, or white pepper to taste. Remove from heat and sprinkle in black vinegar; toss to combine. Garnish with scallions and serve immediately. </p>"}]}