{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140421-one-pot-wonders-shrimp-pasta.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["mushrooms", "one pot", "pasta", "shrimp", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "One-Skillet Orecchiette With Shrimp, Spinach, and Mushrooms", "link": "https://www.seriouseats.com/recipes/2014/04/shrimp-pasta-spinach-mushrooms-recipe.html", "description": "Earthy, meaty mushrooms, tender shrimp, and silky strands of spinach are the stars of this easy, one-pot pasta dish. A perfect choice for a weeknight dinner, this recipe comes together in less than 30 minutes and makes minimal mess as the action occurs in a single pan.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Mushrooms", "One-Pot Wonders", "Pasta", "Shrimp", "Spinach"], "recipeIngredient": ["2 tablespoons extra-virgin olive oil, divided", "2 cups oyster mushrooms", "Kosher salt and freshly ground black pepper", "1 shallot, thinly sliced", "2 medium cloves garlic, minced or grated with a Microplane", "Pinch of dried red chili flakes", "¼ cup dry white wine", "1 pound dried orecchiette", "1 quart homemade chicken stock or store-bought low-sodium chicken broth", "2 cups spinach, stems trimmed", "1 pound medium shrimp, peeled and deveined", "2 tablespoons lemon juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon olive oil in a pot or 12-inch skillet over medium-high heat until shimmering. Add mushrooms, season with salt, and cook until golden brown, about 3 minutes. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot, add the remaining 1 tablespoon oil and cook until shimmering. Add shallot and a pinch of salt and cook until softened, about 2 minutes. Add garlic and chili flakes and cook until fragrant, about 30 seconds. Then add white wine, scraping up any brown bits in the pan and allow it to reduce slightly, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta and stock, season with salt and bring to a boil. Cook orecchiette, stirring occasionally, until the broth is mostly absorbed and the pasta is al dente, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the spinach and shrimp and cook until the spinach is wilted and the shrimp are pink throughout, about 3 minutes. Stir in the mushrooms and lemon juice, and season with salt and pepper. Serve immediately. </p>"}]}