{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141026_chickenandsquash_yasmin_fahr7.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["carrot", "chicken", "easy", "fall", "one pot", "quick", "squash", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Pan-Seared Chicken Thighs With Butternut Squash and Carrots", "link": "https://www.seriouseats.com/recipes/2014/11/one-pot-pan-seared-chicken-thighs-butternut-squash-carrots-easy-fall-recipe.html", "description": "Fall is <em>the</em> time of year for easy chicken dinners, and this one, made with juicy bone-in chicken thighs, comes with extra crisp skin and its own built-in side dish of roasted squash and carrots, making for a simple all-in-one supper.", "totalTime": "30 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Carrot", "Chicken", "Mains", "One-Pot Wonders", "Quick Dinners", "Squash"], "recipeIngredient": ["6 bone-in skin-on chicken thighs (about 2 pounds total)", "Kosher salt and freshly ground black pepper", "2 tablespoons extra-virgin olive oil", "1 large carrot, cut into 1/2-inch rounds", "1 cup diced butternut squash", "1 small shallot, finely minced", "1/2 teaspoon ground cinnamon", "3/4 cup <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 tablespoon fresh juice from 1 lemon", "1/4 cup roughly chopped fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 450°F. Season chicken generously with salt and pepper. Heat 1 tablespoon oil in a large skillet over high heat until lightly smoking. Add chicken pieces skin side-down and cook, moving chicken as little as possible, until chicken skin is rendered and deep golden brown, 8 to 12 minutes, reducing heat if smoking excessively. Flip pieces as they finish and lightly brown second side, about 3 minutes longer. Transfer browned chicken pieces to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining tablespoon oil to skillet and add carrots and squash. Cook, stirring, until lightly browned, about 4 minutes. Add shallots and cook, stirring, until fragrant, about 1 minute. Add cinnamon and broth. Nestle chicken pieces into pan skin side up and transfer to oven. Roast until chicken registers 165°F on an instant read thermometer, about 30 minutes. Remove from oven. Transfer chicken to a plate. Stir lemon juice and cilantro into vegetables and season to taste with salt and pepper. Return chicken to skillet and serve.</p>"}]}