{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140728-burger-topping-week-cemita-burger-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Mexican", "keywords": ["beef", "burger", "cemita", "Mexican", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cemita Burger With Refried Beans, Chipotle Mayo, Avocado, and Oaxacan Cheese", "link": "https://www.seriouseats.com/recipes/2014/07/cemita-burger-refrieds-avocado-recipe.html", "description": "What do you get when you take Mexico's greatest sandwich and combine it with a good ol' all-beef burger from the U.S. of A.? Why, the <em>cemita</em> burger, <em>claro!</em> Refrieds, chipotle, avocado, shredded cheese, lettuce, tomato, and more come together for this extravaganza of burger toppings.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Burger", "Mexican", "Sandwiches"], "recipeIngredient": ["1/4 cup mayonnaise", "2 tablespoons adobo sauce plus 4 chioptle chiles from 1 (7-ounce) can whole chipotle chiles in adobo, divided", "2 pounds <a href=\"http://aht.seriouseats.com/archives/2011/04/the-burger-lab-whats-the-best-way-to-grind-beef.html\">freshly ground beef chuck</a>, preferably about 80 percent lean, formed into 4 (5 inch wide) patties", "Kosher salt and freshly ground black pepper", "Vegetable oil, for the griddle, grill, or skillets", "4 <em>cemita</em> buns (see note), sesame-seed buns, or brioche buns, halved", "6 tablespoons warm <a href=\"http://www.seriouseats.com/2014/04/how-to-make-great-refried-beans-recipe.html\">Refried Beans</a>", "1/2 cup shredded iceberg lettuce from 1 small head", "20 leaves <em>papalo</em> (see note), or fresh cilantro leaves", "8 thin tomato slices from 2 medium tomatoes", "1 ripe medium Hass avocado, halved, pitted, and sliced", "1 cup shredded Queso Oaxaca from 1 (14-ounce) ball of cheese (see note), or fresh mozzarella"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together mayonnaise and the 2 tablespoons adobo sauce. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season burger patties generously with salt and pepper and cook burgers to desired doneness on an oiled hot griddle, grill, or in 2 large skillets on the stovetop, 125&deg;F for medium rare or 135&deg;F for medium. Transfer to a plate and allow to rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast cut surfaces of buns on the griddle, grill, or skillets, pressing down with a sturdy spatula to compress.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread refried beans on bottom bun halves, then top with shredded iceberg, papalo or cilantro leaves, tomato, and burger patties. Set avocado slices on top of burger patties, top with mounds of shredded cheese, followed by the remaining 4 chipotle peppers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread chipotle mayonnaise on top bun halves and close sandwiches. Serve right away.</p>"}]}