{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140828-braised-chicken-feet-shao-zhong-9.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["chicken", "chicken feet", "Chinese", "dim sum"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Braised Chicken Feet (Phoenix Claws)", "link": "https://www.seriouseats.com/recipes/2014/09/braised-chicken-feet-dim-sum-phoenix-claws-recipe.html", "description": "Though they're a dim sum classic, braised chicken feet (A.K.A. phoenix claws) can be a challenge for those unused to eating them. It takes a little while to get used to the plump claws sticking out of a little bowl, and a bit of work to get at the meat in between the tiny bones, but the flavor-packed rewards are well worth the mental and physical effort.", "totalTime": "5 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Chinese", "Snacks"], "recipeIngredient": ["<strong>For the Brine:</strong>", "1 cup boiling water", "6 whole star anise", "4 slices ginger, about 2 inches long and 1/4 inch thick", "1 cinnamon stick", "6 dried bay leaves", "6 cloves", "Salt", "<strong>For the Chicken Feet:</strong>", "2 pounds chicken feet", "1 quart vegetable or peanut oil", "1/2 cup Shaoxing wine", "1 quart cold water", "<strong>For the Braising Broth:</strong>", "1 quart homemade or store-bought low-sodium chicken stock", "1/2 cup Shaoxing wine", "2 scallions", "2 slices ginger, about 2 inches long and 1/4-inch thick", "2 whole star anise", "<strong>For the Sauce:</strong>", "2 teaspoons vegetable or peanut oil", "1 long hot pepper, sliced", "1 tablespoon minced garlic (about 3 medium cloves", "2 tablespoon fermented black beans, rinsed with water and patted dried", "1 tablespoon oyster sauce", "1 tablespoon sugar", "1 teaspoon soy sauce", "2 tablespoons water", "1 teaspoon cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Brine:</strong> In a 4 quart container, combine 1 cup of boiling water, 6 whole star anise pods, 4 slices of ginger, the cinnamon stick,  6 bay leaves, 6 cloves, and 2 teaspoons of salt. Stir until the salt has dissolve. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chicken Feet:</strong> Using kitchen shears, snip the nails off the chicken feet. Place chicken feet in a large bowl, add 1 tablespoon of salt, rub the salt and the feet together, and snip off any yellow spots or patches on the feet. Rinse the chicken under running water, drain, and thoroughly pat dry with paper towels. Try to get the chicken feet as dry as possible in order to minimize oil splattering when frying.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a large Dutch oven or wok to 350°F. When the oil is hot, hold the pot lid with one hand while using long tongs or long chopsticks in the other hand to carefully add a few chicken feet to the oil. Slightly cover the pot with the lid, leaving a small gap on top. Work in batches and do not overcrowd the pot with too many chicken feet. Fry until the oil stops splattering and the chicken feet are golden, about 5 minutes. Transfer the chicken feet to a paper towel-lined bowl to drain. Continue until all the chicken feet are cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the chicken feet are all fried, transfer to container with brine. Add 1/2 cup of Shaoxing wine and 1 quart of cold water and stir to combine. Refrigerate for 2 hours. After 2 hours, remove chicken feet and drain in a colander. Discard brine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Braising Liquid:</strong> Combine chicken stock, 1/2 cup of Shaoxing wine, 2 scallions, 2 slices of ginger, and 2 whole star anise pods to a large Dutch oven and bring to a boil over high heat. Add the chicken feet, reduce to a bare simmer, cover partially, and cook until chicken feet are fully tender, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> When chicken feet are cooked, remove carefully with a slotted spoon and drain in a colander. Reserve 1 cup of the braising liquid. Discard remaining broth and return pot to stove. In the pot, add vegetable oil, 1 long hot pepper, 1 tablespoon of garlic, and 2 tablespoon of fermented black beans. Cook over medium heat until fragrant, about 1 minute. Add reserved braising liquid, 1 tablespoon of oyster sauce, 1 tablespoon of sugar, and 1 teaspoon of soy sauce. Bring the pot to a boil. In a small bowl, combine 2 tablespoon of water and 1 teaspoon of cornstarch. Mix well with a fork, whisk into the pot, then add the chicken feet. Cook, stirring frequently, until sauce has thickened and clings to the chicken feet, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately or save for later. If serving it later, transfer chicken feet with the sauce to a steam proof plate. Let it cool, cover, and store in the refrigerator. To reheat it, set up your steamer, and steam the chicken feet with the plate until heated through, about 10 minutes.</p>"}]}