{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140328-btb-potsdecreme.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chocolate", "Frenchie", "lychee", "passionfruit", "pot de creme", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate and Passion Fruit Pots de Crème with Lychees and Candied Ginger", "link": "https://www.seriouseats.com/recipes/2014/04/chocolate-and-passion-fruit-pots-de-creme-wit.html", "description": "No doubt you've had chocolate pots de crème, or a rich chocolate custard before. But has it ever been served with a passion fruit caramel, or a spoonful of candied ginger? How about both, as well as fresh lychees? It's the combination of these diverse elements that makes every bite of this dessert so uniquely delicious.", "totalTime": "several hours, for cooling", "recipeYield": "serves 4", "recipeCategory": ["Bake the Book", "Chocolate", "Desserts", "Ginger", "Puddings and Custards"], "recipeIngredient": ["<strong>Passion Fruit Caramel</strong>", "1/2 cup (100 grams) granulated sugar", "2 tablespoons water", "Generous 2 tablespoons heavy cream", "Generous 2 tablespoons unsweetened passion fruit juice", "Scant 2 tablespoons (25 grams) salted butter", "&nbsp;", "<strong>Candied Ginger</strong>", "3 1/2 ounces (100 grams) fresh ginger", "1 1/4 cups (300 ml.) water", "Scant 1/2 cup (110 ml.) honey", "Juice of 1 lemon, or to taste", "&nbsp;", " <strong>Chocolate Pots de Crème</strong>", "4 1/2 ounces (125 grams) ", " 65% bittersweet chocolate ", "3/4 cup plus 1 tablespoon (200 ml.) heavy cream ", "1/2 cup (125 ml.) whole milk", "1/4 cup (50 grams) granulated sugar", "3 large egg yolks, beaten", "12 lychees"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the passion fruit caramel: Combine the sugar with the water in a small heavy nonreactive saucepan and heat over medium heat, stirring just until the sugar dissolves, then cook, swirling the pan for even cooking, until you have a golden brown caramel. Remove from the heat and add the cream and passion fruit juice (be careful—the hot caramel will spatter) and whisk vigorously. Gradually add the butter, whisking until completely incorporated. Let cool, then refrigerate for at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, peel the ginger and dice it into 1⁄8-inch cubes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water and honey to a boil in a small heavy saucepan. Add the ginger and cook over low heat, adding a little water if necessary, until the ginger is translucent and the syrup has reduced to a glaze, about 11⁄2 hours. Stir in the lemon juice, and reserve in the refrigerator. (The ginger will keep for several weeks.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the chocolate pots de crème: Preheat the oven to 300°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop the chocolate and put it in a medium bowl. Combine the cream, milk, and sugar in a small saucepan and bring to a boil, stirring to dissolve the sugar. Pour over the chocolate and let stand for 30 seconds to melt it, then stir with a heatproof spatula until smooth. Let cool slightly, then add the egg yolks and stir until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into four 4-ounce ramekins. Put the ramekins in a baking dish and add enough warm water to come halfway up the sides of the ramekins. Cover the dish with foil and bake for 28 to 30 minutes. The pots are done when they are firm to the touch but still jiggle when gently shaken. Remove from the water bath and let cool. (It is best not to put the pots de crème in the refrigerator: set aside at room temperature and serve the same day.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finishing touches: Peel the lychees and remove the seeds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the pots de crème on serving plates and place a tablespoon of caramel, a teaspoon of candied ginger, and some lychees on each one.</p>"}]}