{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140410-btb-sweetashoney.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Ample Hills", "candy", "honey", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ample Hills' Sweet as Honey Ice Cream", "link": "https://www.seriouseats.com/recipes/2014/04/ample-hills-sweet-as-honey-ice-cream.html", "description": "Sometimes simplest really is best: sweet cream ice cream bulked up with fresh bits of chopped honeycomb candy. It's a strong hit of caramel flavor, with the delicate sweetness of cold, fresh cream.", "totalTime": "several hours, for chilling", "recipeYield": "serves 4", "recipeCategory": ["Bake the Book", "Ice Cream and Frozen Treats"], "recipeIngredient": ["Butter for the baking sheet", "2 cups organic cane sugar", "1/4 cup honey ", "7 tablespoons golden syrup", "1 tablespoon plus 1 teaspoon baking soda", "1 recipe Walt’s Dream (ingredients follow)", "3/4 cup organic cane sugar", "1/2 cup skim milk powder", "1 2/3 cups whole milk", "1 2/3 cups heavy cream", "3 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the honeycomb candy: Butter a 12-by-18-inch rimmed baking sheet and line it with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, combine the sugar, honey, syrup, and 2/3 cup water. Whisk to combine. Clip a candy thermometer to the saucepan and set the pan over medium-high heat. Cook until the syrup reaches 305ºF. (The syrup will bubble and spit, so please be careful.) Remove the pan from the heat and, wearing an oven mitt for protection, whisk in the baking soda. Whisk vigorously for a few moments to make sure you’ve incorporated all the little bits of baking soda, then stand back and watch the honeycomb grow.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the honeycomb stops growing up the sides of the pot, gently pour it onto the prepared baking sheet. Let it cool. Refrigerate the candy for 30 minutes, then chop it into bite-size pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare Walt’s Dream: Prepare an ice bath in your sink or in a large heatproof bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the sugar, skim milk powder, and milk. Stir with a hand mixer or whisk until smooth. Make sure the skim milk powder is wholly dissolved into the mixture and that no lumps remain (any remaining sugar granules will dissolve over the heat). Stir in the cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clip a candy thermometer to the saucepan and set the pan over medium heat. Cook, stirring often with a rubber spatula and scraping the bottom of the pan to prevent sticking and burning, until the mixture reaches 110ºF, 5 to 10 minutes. Remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the egg yolks in a medium bowl. While whisking, slowly pour in 1/2 cup of the hot milk mixture to temper the egg yolks. Continue to whisk slowly until the mixture is an even color and consistency, then whisk the egg-yolk mixture back into the remaining milk mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the stovetop over medium heat and continue cooking the mixture, stirring often, until it reaches 165ºF, 5 to 10 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pan to the prepared ice bath and let cool for 15 to 20 minutes, stirring occasionally. Pour the ice cream base through a wire-mesh strainer into a storage container and place in the refrigerator for 1 to 2 hours, or until completely cool.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now you’re ready to make ice cream! Transfer the cooled base to an ice cream maker and churn it according to the manufacturer’s instructions. Or, if you want, you can keep it in the refrigerator for up to 3 days before churning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the ice cream to a storage container, folding in the pieces of honeycomb candy as you do. Use as much of the candy as you want; you won’t necessarily need the whole batch. Serve immediately or harden in your freezer for 8 to 12 hours for a more scoopable ice cream.<br />\r\n</p>"}]}