{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20130430-281690-dinner-tonight-farro-kale-red-pepper-goat-cheese.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "", "keywords": ["easy", "farro", "kale", "light", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Farro With Sweet Red Bell Peppers, Kale, and Goat Cheese", "link": "https://www.seriouseats.com/recipes/2014/02/farro-sweet-bell-peppers-kale-goat-cheese-recipe.html", "description": "This recipe is not what you think it is. I know it looks like a haphazard affair of roasted vegetables tossed on top of farro, but there is more going on here.", "totalTime": "45 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Dinner Tonight", "Kale", "Mains", "Other Grains", "Vegetarian"], "recipeIngredient": ["1 cup farro", "Kosher salt", "5 1/2 tablespoons olive oil, divided ", "1 bunch kale, stems removed, leaves roughly chopped", "2 red peppers, stemmed, seeded, and sliced 3/4-inch thick ", "3 tablespoons red wine vinegar, divided", "1 1/2 tablespoons sugar, divided", "1 1/2 teaspoons dried oregano, divided ", "2 ounces goat cheese "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine farro, a large pinch of salt, and 4 cups of water in a medium saucepan. Bring to a boil over high heat, reduce heat to maintain a simmer, and cook until farro is tender, 25 to 30 minutes. When done, drain farro in a colander. In a large bowl, whisk together 1 1/2 tablespoons olive oil, 1/2 tablespoon vinegar, 1/2 tablespoon sugar, 1/2 teaspoon oregano, and a pinch of salt. Add farro to bowl and stir until dressed. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 1 tablespoon oil in a medium skillet over medium heat until shimmering. Add a handful of the kale and stir until it turns bright green and wilts, and then add another handful. Continue process until all of the kale has been added. Pour in 1/4 cup of water and bring to a boil. Then reduce heat to a simmer, cover skillet, and cook until kale is tender, but still has some texture, 8 to 10 minutes. Transfer kale to a bowl and set aside. Wipe out skillet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons oil in a medium skillet over medium low heat until shimmering. Add sliced peppers, toss well, and then cover the skillet. Cook, stirring occasionally, until peppers are tender, but still have some crunch, about 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the 2 tablespoons vinegar, 1 tablespoon sugar, 1 teaspoon oregano, and a pinch of salt in a bowl and then pour this into the skillet. Stir well and cook for 2 to 3 minutes. Add the kale to the skillet and stir until combined. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide farro between two large bowls and top each with half of the red pepper and kale mixture and goat cheese. Serve.</p>"}]}