{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140317-286820-hungarian-cabbage-noodle-chicken.1.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["cabbage", "chicken", "easy", "noodle", "one pot", "pasta", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Quick One Pot Hungarian Chicken and Noodles With Cabbage", "link": "https://www.seriouseats.com/recipes/2014/03/one-pot-hungarian-cabbage-noodles-chicken-recipe.html", "description": "Cabbage and noodles flavored with caraway and parsley is a classic Hungarian dish made all the more comforting with the addition of ground chicken. It's soothing and mild like a good chicken soup, and you only need one pan and 20 minutes to finish it off.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cabbage", "Chicken", "Mains", "One-Pot Wonders", "Pasta"], "recipeIngredient": ["3 tablespoons (1 1/2 ounces) unsalted butter", "2 medium onions, finely chopped (about 2 cups)", "Kosher salt and freshly ground black pepper", "1/2 teaspoon caraway seeds", "1 pound ground chicken", "1 small head cabbage (about 1 pound), quartered, cored, sliced into 1-inch strips", "1 1/2 cups low sodium homemade or store-bought low sodium chicken stock", "5 ounces egg noodles", "1/3 cup fresh parsley leaves, chopped", "4 to 6 tablespoons sour cream, optional (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in skillet over medium heat until melted. Add onions and 1 teaspoon salt. Cook, stirring, until onions have softened, 6 to 8 minutes. Stir in caraway seeds and cook until fragrant, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chicken and cook, stirring, until chicken is no longer pink, 2 to 3 minutes. Stir in cabbage and cook until wilted to about half it's volume, about 3 minutes. Stir in chicken broth, another teaspoon salt, and 1/2 teaspoon black pepper. Bring to simmer. Nestle in egg noodles, cover, and gently simmer, stirring occasionally, until noodles are cooked but still quite firm, 5 to 6 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat, stir in parsley, stir in sour cream (if using), season to taste and serve. Broth will thicken slightly upon resting.</p>"}]}