{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140919-fettucini-alfredo-recipe-17.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["easy", "fettuccine", "fettuccine alfredo", "Italian", "italian american", "pasta", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1111111111111", "ratingCount": "9"}, "name": "Lighter Fettuccine Alfredo", "link": "https://www.seriouseats.com/recipes/2014/09/lighter-fettuccine-alfredo-recipe.html", "description": "Don't get me wrong&mdash;I'm not a health nut or a calorie counter. But let's face it: The feeling you get after downing a bowl of creamy, cheesy fettuccine Alfredo ain't the best. Wouldn't it be great to have a quick and easy version that's just as good as the typical cream-packed rendition, but has a cleaner flavor and doesn't leave you in a food coma?", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Eggs", "Father's Day", "Italian", "Mains", "Mother's Day", "Pasta", "Quick and Easy", "Quick Dinners", "Stovetop", "The Food Lab", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["5 ounces (140g) grated Parmigiano Reggiano cheese, plus more for sprinkling", "2 tablespoons (30ml) heavy cream", "1 large egg", "1 teaspoon (3g) cornstarch", "2 tablespoons (30ml) extra-virgin olive oil, plus more for serving", "1/2 teaspoon grated lemon zest (optional)", "Kosher salt and freshly ground black pepper", "1 pound (450g) fresh fettuccine, or 12 ounces (340g) dried fettuccine", "1 teaspoon minced garlic (about 1 medium clove)", "2 tablespoons (30g) unsalted butter", "Minced fresh parsley or chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cheese, heavy cream, egg, cornstarch, olive oil, and lemon zest (if using) in a large bowl. Season lightly with salt and heavily with black pepper and whisk to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of <a href=\"https://www.seriouseats.com/2014/05/how-salty-should-pasta-water-be.html\">salted water</a> to a boil over high heat. Add pasta and cook, stirring frequently to prevent sticking, until cooked but still very firm (not quite al dente), about 45 seconds for fresh pasta or 1 minute less than package directions indicate for dried pasta. Drain pasta into a colander set over a large bowl. Transfer 2 cups (480ml) of cooking water to a liquid measuring cup and discard the rest. Transfer pasta to the now-empty bowl. Add garlic and butter and toss to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisking constantly, slowly add 1 1/2 cups of pasta cooking water to bowl with cheese mixture. Transfer cheese mixture to the now-empty pasta cooking pot, scraping the bottom to make sure you get everything. Cook over medium-high heat, stirring constantly with a rubber spatula, until mixture comes to a boil and thickens, about 45 seconds. Season sauce to taste with more salt and pepper as desired. Transfer pasta to sauce mixture and turn to coat. Just before serving, stir in more pasta water to thin sauce out as necessary. Serve immediately, sprinkled with minced herbs, black pepper, and cheese, and drizzled with additional olive oil.</p>"}]}