{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140423-refried-beans-bowl-primary.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Tex-Mex", "keywords": ["bean", "comfort", "Latin American", "Mexican", "tex-mex"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "8"}, "name": "Perfect Refried Beans (Frijoles Refritos)", "link": "https://www.seriouseats.com/recipes/2014/04/perfect-refried-beans.html", "description": "Refried beans are like the mashed potatoes of Mexican and Tex-Mex cooking: they're a versatile, addictive, and delicious side dish. While a relatively simple dish, this master recipe allows you to choose exactly how you want to make them, whether chunky or smooth, cooked with pork fat or vegetable oil, or made with pinto or black beans.", "totalTime": "2 hours 20 minutes", "recipeYield": "Makes about 4 cups", "recipeCategory": ["Beans and Pulses", "Cinco de Mayo", "Dairy-Free", "Gluten-Free", "Latin American", "Mexican", "Sides", "Stovetop", "Tex-Mex"], "recipeIngredient": ["1/2 pound dried pinto or black beans", "Water", "2 sprigs fresh epazote or oregano (see note) ", "1 medium white onion, 1/2 minced (about 1/2 cup), 1/2 left whole", "2 medium cloves garlic", "Kosher salt", "6 tablespoons lard, bacon drippings, vegetable oil, or butter (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, cover the beans with cold water by at least 2 inches. Add herb sprigs, the whole onion half, and garlic cloves and bring to a boil over high heat. Reduce heat to simmer and cook until beans are very tender, about 1 to 2 hours. Season with salt. Drain beans, reserving bean-cooking liquid. You should have about 3 cups of cooked beans; if you have more, measure out 3 cups of beans and reserve the rest for another use. Discard herb sprigs, onion, and garlic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat lard, bacon drippings, or oil until shimmering, or butter until foaming, over medium-high heat. Add minced onion and cook, stirring occasionally, until translucent and lightly golden, about 7 minutes. Stir in beans and cook for 2 minutes. Add 1 cup of reserved bean-cooking liquid. Using bean masher, potato masher, or back of a wooden spoon, smash the beans to form a chunky purée; alternatively, use a stick blender to make a smoother purée. Reduce heat to medium and cook, stirring, until desired consistency is reached; if refried beans are too dry, add more bean-cooking liquid, 1 tablespoon at a time, as needed. Season with salt and serve.</p>"}]}