{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141014-chicke-saffron-potatoes-recipe.JPG", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["braise", "chicken", "easy", "one pot", "potato", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Thighs With Saffron, Lemon, and Red Potatoes", "link": "https://www.seriouseats.com/recipes/2014/10/chicken-thighs-saffron-lemon-red-potatoes-recipe.html", "description": "This one-skillet chicken dish starts with thighs that are seared in the pan for super crispy skin and then get finished in the oven with a flavorful cooking liquid seasoned with saffron and lemon. Red potatoes are cooked alongside the chicken so that they soak up the lemon-saffron juice and soften.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Braising and Stewing", "Chicken", "Mains", "Potato"], "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "4 skin-on chicken thighs (about a pound and a half)", "Kosher salt and freshly ground black pepper", "2 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "6 red potatoes, quartered", "Pinch of saffron", "6 tablespoons fresh juice from 3 lemons", "1 tablespoon whole black peppercorns", "Warm pita bread or rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 350&deg;F. Heat oil in a large straight-sided sauté pan over high heat until shimmering. Season chicken with salt and pepper and place in pan skin side-down. Cook without moving until well browned on first side, about 6 minutes. Flip and brown lightly on second side, about 4 minutes longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chicken stock to skillet. Nestle in potatoes. Add saffron, lemon juice, and whole black peppercorns, and season lightly with salt. Transfer to oven and cook uncovered, stirring and flipping potatoes occasionally, until the chicken and potatoes are tender, about 45 minutes. Season to taste with salt and pepper if necessary and serve immediately with pita bread or rice.</p>"}]}