{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140918-jamie-olivers-comfort-food-butter-sage-gnudi-david-loftus.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["cheese", "Cook the Book", "gnudi", "jamie oliver's comfort food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Butter and Sage Gnudi From 'Jamie Oliver's Comfort Food'", "link": "https://www.seriouseats.com/recipes/2014/09/butter-and-sage-gnudi-from-jamie-olivers-comfort-food.html", "description": "I, like so many others, fell head-over-pillowy-balls-of-cheese in love with <a href=\"http://www.seriouseats.com/2012/04/april-bloomfields-ricotta-gnudi.html\">gnudi at the Spotted Pig</a> in NYC, where Chef April Bloomfield made them famous. Jamie Oliver's version in his new book, <a href=\"http://www.amazon.com/Jamie-Olivers-Comfort-Food-Ultimate/dp/0062305611/?tag=serieats-20\" target=\"_blank\"><em>Jamie Oliver's Comfort Food,</em></a> is much like his friend Bloomfield's, but with a few personal touches.", "totalTime": "8 hours 45 minutes", "recipeYield": "Serves 6-8", "recipeCategory": ["Cheese", "Cook the Book", "Mains", "Other Grains"], "recipeIngredient": ["<strong>Gnudi</strong>", "2 lbs best-quality ricotta", "3 1/2 oz Parmesan cheese", "1 whole nutmeg, for grating", "Fine semolina, for dusting", "<strong>To Serve</strong>", "Good-quality unsalted butter", "1 bunch of fresh sage (1 oz)", "Parmesan cheese, for grating", "1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the ricotta into a bowl with a pinch of sea salt and black pepper, then finely grate in the Parmesan and a few scrapings of nutmeg. Beat it together, then have a taste to check that the balance of seasoning is right—you want the nutmeg to be very subtle. Generously cover a large tray with semolina, then roll the ricotta mixture into 1-inch balls, rolling them in the tray of semolina as you go until very well coated. You should get around 40 gnudi from this amount of mixture. Shake and cover very well with the semolina and leave for 8 hours, or preferably overnight, in the fridge (don’t cover the tray)—the semolina will dehydrate the ricotta, giving the gnudi a lovely fine coating.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The gnudi will only take 3 minutes to cook, and I like to cook them in two-portion batches to take care of them. So, shake the excess semolina off two portions’ worth of gnudi and cook them in boiling salted water while you melt a large pat of butter in a frying pan on a medium heat and pick in about 20 sage leaves to crisp up. Remove the crispy leaves to a plate and scoop the gnudi directly from the water into the frying pan, adding a spoonful of the cooking water. When the butter and water have emulsified, take off the heat and grate over a layer of Parmesan, add just a few drops of lemon juice, then toss together. Serve in warm bowls straightaway, with an extra grating of nutmeg and Parmesan and the crispy sage leaves, while you get on with the next batch, wiping the frying pan clean between batches. Welcome to the naked club.</p>\r\n\r\n<p><br />\r\n<strong>Note</strong><br />\r\nGnudi can be easily transformed with the addition of one seasonal ingredient. Asparagus tips, podded peas, wild mushrooms, or a few fresh tomatoes—any of these with that sage butter will rock the party. In summer, some smashed fresh basil leaves in the ricotta mixture are lovely; or in winter, a splash of quality red wine used to deglaze the frying pan adds much deliciousness.<br />\r\n</p>"}]}