{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140506-skirt-steak-polenta-cherry-tomato-easy-6.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["easy", "Italian", "polenta", "steak", "summer", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Seared Skirt Steak With Blistered Cherry Tomatoes and Polenta", "link": "https://www.seriouseats.com/recipes/2014/06/seared-skirt-steak-blistered-cherry-tomato-polenta-recipe.html", "description": "Polenta is the kind of stuff that's just <em>begging</em> for a flavorful sauce to be spooned into it. But pan-seared steak doesn't really provide much sauce of its own. The solution: Toss some juicy cherry tomatoes and chilies into the skillet as the steak finishes cooking. Their natural juices pick up the flavorful pan drippings and&mdash;with just a touch of olive oil&mdash;emulsify into a rich, flavor-packed pan sauce.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Italian", "Mains", "Other Grains", "Tomato"], "recipeIngredient": ["1 1/2 pounds skirt or flank steak (see note)", "Kosher salt and freshly ground black pepper", "6 cloves garlic, minced (about 2 tablespoons), divided", "3 tablespoons extra-virgin olive oil, divided", "4 tablespoons unsalted butter, divided", "1 cup coarse-ground polenta (corn meal)", "1 quart homemade or store-bought low-sodium chicken stock", "1/4 cup heavy cream", "2 ounces Parmesan cheese, grated", "1 quart cherry tomatoes", "2 small red chilies such as Fresno or Thai bird, thinly sliced", "3 scallions, white and pale green parts only, thinly sliced", "1 teaspoon juice from 1 lemon", "1 teaspoon soy sauce", "Chopped chives, scallion greens, or parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season steak generously with salt and pepper. Rub with 2 minced cloves garlic and 1 tablespoon olive oil. Set aside at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon olive oil and 2 tablespoons butter over medium-high heat until butter is foaming. Add 2 minced cloves garlic and cook, stirring, until garlic is fragrant, about 1 minute. Add chicken stock and bring to a boil over high heat. Whisking constantly, slowly add polenta in a thin stream. Reduce heat to a bare simmer. Cover and cook, stirring frequently, until polenta is completely tender and creamy, about 40 minutes, adding water as necessary to keep it loose.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When polenta is fully cooked, stir in heavy cream, Parmesan cheese, and remaining 2 tablespoons butter. Season to taste with salt and pepper. Cover and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining tablespoon olive oil in a large cast iron or stainless steel skillet over high heat until lightly smoking. Add steak in a single layer and cook, turning frequently, until well browned on both sides and center of steak registers 110°F for medium-rare or 115°F for medium, 6 to 8 minutes total. 1 minute before steak is done, add tomatoes to pan. Remove steaks and set aside. Add chilies, scallions, and remaining 2 minced cloves garlic to pan. Add 1/4 cup water and scrape up browned bits. Continue cooking, stirring frequently, until tomatoes burst and release their juices. Season to taste with salt and pepper. Stir in lemon juice and soy sauce off heat, adding water as necessary to reach a creamy sauce-like consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, transfer polenta to a pre-heated plate. Slice steak thinly against the grain. Transfer to polenta, top with blistered tomatoes and pan sauce, sprinkle with herbs, and serve.</p>"}]}