{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140419-deviled-egg-variations-recipe-24.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["appetizer", "deviled egg", "egg", "hors d'oeuvre", "smoked salmon", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Everything Bagel Deviled Eggs (Smoked Salmon, Sesame and Caraway Seeds, and Dried Onion)", "link": "https://www.seriouseats.com/recipes/2014/05/everything-bagel-deviled-eggs-smoked-salmon-recipe.html", "description": "Inspired by everything bagels, these deviled eggs have onion, sesame seed, and caraway seed, along with cream cheese and smoked salmon.", "totalTime": "15 minutes", "recipeYield": "makes 8 deviled egg halves", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Deviled Eggs", "Snacks"], "recipeIngredient": ["6 <a href=\"http://www.seriouseats.com/recipes/2009/10/perfect-boiled-eggs-recipe.html\">hard boiled</a> or <a href=\"http://www.seriouseats.com/recipes/2014/04/steamed-hard-boiled-eggs-recipe.html\">hard steamed eggs</a>, peeled and halved lengthwise", "2 tablespoons cream cheese", "2 tablespoons mayonnaise", "1 tablespoon fresh lemon juice from 1 lemon", "1 teaspoon toasted sesame seeds, plus more for garnish", "1 teaspoon toasted dehydrated minced onion, plus more for garnish", "1/4 teaspoon toasted caraway seeds, plus more for garnish", "1/4 cup plus 2 tablespoons minced smoked salmon, plus more for garnish (from about 4 ounces)", "Kosher Salt", "Thinly sliced scallions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add cream cheese, mayonnaise, lemon juice, sesame seeds, dehydrated onion, caraway seeds, and smoked salmon to yolks and, using a sturdy whisk, mash and stir together until thoroughly combined. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap). Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Garnish deviled eggs with sesame seeds, dehydrated onion, caraway seeds, smoked salmon, and scallions. Serve immediately.</p>"}]}