{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140910-tacolicious-lone-star-breakfast-taco-alex-farnum.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "Tex-Mex", "keywords": ["Cook the Book", "Mexican", "taco", "tacolicious", "tex-mex"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lone Star Breakfast Taco From 'Tacolicious'", "link": "https://www.seriouseats.com/recipes/2014/09/lone-star-breakfast-taco-from-tacolicious.html", "description": "This breakfast (or lunch, or dinner, or midnight snack) taco from Sara Deseran and Joe Hargrave's new book, <a href=\"http://www.amazon.com/Tacolicious-Festive-Recipes-Snacks-Cocktails/dp/1607745623/?tag=serieats-20\"><em>Tacolicious,</em></a> is a spot-on version of the Texan tradition, with strips of roasted poblano peppers, good-sized bites of bacon, and tiny cubes of potatoes cooked with onion in that bacon fat, all scrambled with eggs and just the right amount of cheese.", "totalTime": "45 minutes", "recipeYield": "Makes 6 filling tacos; serves 6", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Mains", "Mexican", "Tex-Mex"], "recipeIngredient": ["2 small poblano chile peppers", "3 slices thick-cut bacon, cut into 1-inch pieces", "5 small new potatoes (about 8 ounces total), cut into 1/4-inch cubes", "3/4 cup chopped yellow onion", "6 eggs, whisked", "1 cup shredded Monterey Jack cheese", "Kosher salt", "6 small flour tortillas", "Chopped fresh cilantro and hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the poblano chiles directly over the flame of a gas burner and turn with tongs for about 3 minutes, until charred and blistered all over. Alternatively, place the chiles in a dry, heavy skillet over high heat and turn with tongs for about 3 minutes, until charred and blistered all over. Transfer the chiles to a bowl, cover with plastic wrap, and let steam for 10 minutes. Remove the chiles and gently peel or scrape away the skin. Slice each chile in half lengthwise, remove the stem and seeds, and cut into strips 1 inch long by 1/8 inch wide. Measure out 1/3 cup. Set the rest aside for another day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the bacon in a large, heavy skillet over medium heat and leave to cook for a few minutes, until some of the fat has rendered. Using a slotted spoon, transfer the bacon to a plate. Add the potatoes to the pan and cook, stirring occasionally, for about 10 minutes, until cooked through. Add the onion and return the bacon to the pan. Cook, stirring occasionally, for another few minutes, until the bacon is cooked and the onion is soft.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn down the heat to low. Add the eggs, chiles, and cheese and stir for a few minutes until the eggs are gently scrambled (taking care not to overcook) and the cheese is melted. Season with salt. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One at a time, warm the flour tortillas directly over the low flame of a gas burner for 10 to 15 seconds on each side, until puffed. Alternatively, warm them in a heavy, dry skillet over low heat on both sides for about the same amount of time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve the eggs with the tortillas, cilantro, and hot sauce.</p>"}]}