{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/05032014-sour-and-spicy-cabbage-07.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "cabbage", "Chinese", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chinese Spicy and Sour Stir-Fried Cabbage With Bacon", "link": "https://www.seriouseats.com/recipes/2014/06/spicy-sour-stir-fried-cabbage-bacon-recipe.html", "description": "Hunanese food is famous for its fiery, chili-spiked dishes, and this quick and easy one with hand-torn cabbage, fresh red chilies, garlic, scallions, and bacon, is no exception. In fact, by Hunan standards, this dish is fairly tame. Slightly sour, thanks to the addition of black rice vinegar, the dish is great as part of a multi-course meal where the other dishes are even more intensely flavored and spicy.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Cabbage", "Chinese", "Mains", "Pork", "Stir Frying"], "recipeIngredient": ["1 (1-pound) head of green cabbage, halved, cored, and torn into bite-size pieces", "2 tablespoon Chinkiang vinegar (see note)", "1 teaspoon soy sauce", "3 strips thick-cut bacon, cut into 1/4-inch strips", "2 to 3 fresh cayenne chili peppers or other fresh red chili, thinly sliced on the bias with seeds", "3 medium cloves garlic, thinly sliced lengthwise", "2 scallions, cut into 1-inch pieces on the bias"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a wok or a large pot with water and bring to boil. Add cabbage and cook until crisp-tender, about 1 minute. Drain in a colander and rinse with cold running water; press cabbage to expel any excess water. In a small bowl, combine Chinkiang vinegar and soy sauce together. Mix and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wok, cook bacon over high heat until golden brown, about 3 minutes. Using a slotted spoon or spider, transfer bacon to paper-towel-lined plate. Pour off all but 1 tablespoon of rendered bacon fat from wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat wok over high heat until bacon fat is lightly smoking. Add chilies, garlic, and scallions and stir-fry until garlic is golden, about 30 seconds. Toss in cabbage and stir-fry until warmed through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vinegar mixture and and bacon and continue to stir-fry until cabbage is tender, about 2 minutes. Transfer to a serving plate and serve immediately.</p>"}]}