{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141022-chickpea-carrot-dill-salad-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["carrot", "chickpea", "dill", "easy", "make ahead", "quick", "salad", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Easy Make-Ahead Carrot and Chickpea Salad With Dill and Pumpkin Seeds", "link": "https://www.seriouseats.com/recipes/2014/10/easy-make-ahead-chickpea-carrot-salad-pumpkin-seed-recipe.html", "description": "You could say I've been on a bit of a chickpea kick recently, but only because they're so easy to love! They make the kind of dishes that are not just delicious when first thrown together, but actually improve with time. It's really the ideal food for a packed lunch, whether it's at school, the office, or on the road. This version combines chickpeas with grated carrots, pumpkin seeds, and plenty of dill.", "totalTime": "15 minutes if using canned chickpeas, 1 1/2 hours plus overnight if using dried", "recipeYield": "serves 4", "recipeCategory": ["Carrot", "Christmas", "Dairy-Free", "Legumes", "Mains", "Pumpkin", "Salads", "Sides", "Thanksgiving", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 pound dried chickpeas (garbanzo beans), soaked overnight in cold salted water at room temperature", "1 bay leaf", "1 carrot, cut into 3-inch segments", "1 onion, split in half", "1 stalk celery, cut into 3-inch segments", "Kosher Salt", "1/2 cup pepitas", "1 large carrot, peeled and grated on the large holes of a box grater or in a food processor fitted with a grating attachment", "1 medium clove garlic, finely minced", "1/4 cup extra-virgin olive oil", "1 1/2 tablespoons sherry vinegar", "1/2 cup chopped fresh dill leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain chickpeas and place in a large pot with bay leaf, carrot, onion, and the segmented celery stalk. Cover with cold water by 2 inches, season with salt, bring to a boil, reduce to a simmer, and cook until the chickpeas are tender but still hold their shape, about 1 hour. Discard bay leaf, carrot, onion, and celery. Drain and rinse under cold running water until chilled. Let drain in a colander set in the sink while you prepare the rest of the salad.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pepitas on a large plate and microwave on high power for 2 minutes. Stir and microwave for a further 2 minutes. Continue stirring and microwaving at 30 second intervals until lightly toasted and fragrant. Alternatively, toast in a dry skillet over medium heat, stirring constantly, until lightly toasted and fragrant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chickpeas, carrots, toasted pumpkin seeds, garlic, olive oil, vinegar, and dill in a large bowl and toss to coat. Season to taste with salt and pepper. Serve immediately, or for better results, store overnight in a covered container in the refrigerator. Salad will keep for up to 3 days.</p>"}]}