{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/12/bolognese-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["beef", "bolognese", "fall", "Italian", "lamb", "meat sauce", "northern italian", "pasta", "pasta sauce", "pork", "ragu", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3548387096774", "ratingCount": "31"}, "name": "The Best Slow-Cooked Bolognese Sauce", "link": "https://www.seriouseats.com/recipes/2014/12/the-best-slow-cooked-bolognese-sauce-recipe.html", "description": "When it comes to meat sauces, <em>ragù bolognese</em> is the undisputed heavyweight champion of the world. To arrive at this version, I started with Barbara Lynch's great recipe, adding a few tweaks here and there to enhance meatiness and texture (hello, pancetta, gelatin, and fish sauce!) and employing a unique oven-based cooking technique that develops rich browned flavors, all while maintaining the tender, silky texture that the best sauces have. This is the kind of sauce that will leave you and your loved ones weak in the knees.", "totalTime": "4 to 5 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Beef", "Braising and Stewing", "Condiments and Sauces", "Fall", "Father's Day", "Italian", "Lamb", "Mains", "Mother's Day", "Pasta", "Pork", "Stovetop", "The Food Lab", "Valentine's Day", "Winter"], "recipeIngredient": ["1 quart  (1L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 to 1 1/2 ounces powdered gelatin (4 to 6 packets; 30 to 45g), such as Knox (see note)", "1 (28-ounce; 800g) can peeled whole tomatoes, preferably San Marzano", "1/2 pound (225g) finely minced chicken livers", "1/4 cup (60ml) extra-virgin olive oil", "1 pound (450g) ground beef chuck (about 20% fat)", "1 pound (450g) ground pork shoulder (about 20% fat)", "1 pound (450g) ground lamb shoulder (about 20% fat)", "Kosher salt and freshly ground black pepper", "4 tablespoons (60g) unsalted butter", "1/2 pound (225g) finely diced pancetta", "1 large onion, finely minced (about 8 ounces; 225g)", "2 carrots, finely chopped (about 8 ounces; 225g)", "4 ribs celery, finely chopped (about 8 ounces; 225g)", "4 medium cloves garlic, minced", "1/4 cup (about 25g) minced fresh sage leaves", "1/2 cup (about 50g) minced fresh parsley leaves, divided", "2 cups (475ml) dry white or red wine", "1 cup (235ml) whole milk", "2 bay leaves", "1 cup (235ml) heavy cream", "3 ounces (85g) finely grated Parmesan cheese", "2 tablespoons (30ml) Vietnamese or Thai fish sauce, such as Red Boat", "<strong>To Serve:</strong>", "Dried or fresh pasta, preferably pappardelle, tagliatelle, or penne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 300&deg;F (150&deg;C). Place stock in a medium bowl or 1-quart liquid measure and sprinkle with gelatin. Set aside. Purée tomatoes in the can using an immersion blender or transfer to the bowl of a countertop blender and purée until smooth. Transfer chicken livers to a cup that just fits head of immersion blender and purée until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large Dutch oven over high heat until shimmering. Add ground beef, pork, and lamb; season with salt and pepper; and cook, stirring and breaking up with a wooden spoon or potato masher, until no longer pink, about 10 minutes. Remove from heat and stir in puréed chicken livers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat butter and pancetta in a large skillet over medium-high heat and cook, stirring frequently, until fat has mostly rendered but butter and pancetta have not yet started to brown, about 8 minutes. Add onion, carrots, celery, garlic, sage, and half of parsley and cook, stirring and tossing, until vegetables are completely softened but not browned, about 8 minutes. Transfer mixture to Dutch oven with meat mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return Dutch oven to high heat and cook, stirring, until most of the liquid has evaporated from the pan, about 10 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and cook, stirring, until mostly evaporated. Add reserved stock, tomatoes, milk, and bay leaves. Season gently with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring sauce to a simmer, then transfer to oven, uncovered. Cook, stirring and scraping down sides of pot occasionally, until liquid has almost completely reduced and sauce is rich and thick underneath a heavy layer of fat, 3 to 4 hours. If sauce still looks liquid or fat has not separated and formed a thick layer after 4 hours, transfer to stovetop and finish cooking at a brisk simmer, stirring frequently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully skim off most of the fat, leaving behind about 1 cup total. (For more precise measurement, skim completely, then add back 1 cup of fat.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in heavy cream, Parmesan, fish sauce, and remaining parsley. Bring to a boil on stovetop, stirring constantly to emulsify. Season to taste with salt and pepper. Bolognese can be cooled and stored in sealed containers in the refrigerator for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Heat sauce in a large pot until just simmering. Set aside. Cook pasta in a large pot of well-salted water until just barely al dente. Drain, reserving 1/2 cup cooking liquid. Return pasta to pot and add just enough sauce to coat, along with some of the cooking liquid. Cook over high heat, tossing and stirring gently, until sauce is thick and pasta is coated, about 30 seconds. Transfer to a serving bowl and serve immediately, passing Parmesan at the table.</p>"}]}