{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140425-290408-cook-the-book-papadzules.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Mexican", "keywords": ["Cook the Book", "egg", "Mexican", "tortilla", "yucatan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Papadzules From 'Yucatán'", "link": "https://www.seriouseats.com/recipes/2014/04/papadzules-from-yucatan.html", "description": "A dish of egg-filled tortillas smothered in a smooth, rich pumpkin seed and epazote broth, papadzules are fixtures of cantinas and restaurants throughout the region. Papadzules are not totally unlike enchiladas moles, but, lacking the cheese and chilies of the more recognizable sauce, the dish is far more delicate.", "totalTime": "1 hour", "recipeYield": "Serves 10", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Cook the Book", "Eggs", "Mains", "Mexican", "Pumpkin", "Vegetarian"], "recipeIngredient": ["<strong>Recado para papadzul<strong>", "4 cups (500 g) <em>pepita verde</em> (raw, unsalted, hulled green squash or pumpkin seeds)", "&nbsp", "<strong>Squash Seed Sauce</strong>", "3 cups (750 ml) water", "3 large sprigs fresh epazote (1/4 oz / 8 g)", "2 tablespoons (24 g) white onion, coarsely chopped", "2 tablespoons (10 g) powdered chicken or vegetable bouillon or sea salt", "&nbsp", "<strong>Papadzules</strong>", "20 fresh, warm corn tortillas (homemade or storebought)", "10 hard-boiled eggs, peeled and coarsely chopped", "<strong>For Serving</strong>", "<a href=\"http://www.seriouseats.com/recipes/2014/04/tomate-frito-from-yucatan.html\">Tomate Frito</a>", "Fresh epazote leaves for garnish (or a mix of whole flat-leaf parsley and cilantro leaves)", "2 tablespoons (30 ml) squash or pumpkinseed oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the seeds in a large, dry cast-iron skillet. Turn the heat to high and wait a few minutes until you hear the seeds begin to pop. Immediately start vigorously and constantly stirring them with a wooden spoon or tossing them in the skillet. The seeds should inflate and change to a slightly richer green color in 2-3 minutes; do not allow them to brown. Immediately transfer the seeds to a colander or large sieve and shake vigorously to remove as much of the papery skin as possible. Allow the seeds to cool 4-5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the seeds to the bowl of a food processor and begin to process. After about 30 seconds, the seeds will have turned into a fine powder. Continue processing 2-3 minutes, or until the powder starts to clump on the sides of the bowl. This is a sign that the natural oils have started to be released. Scrape the powder off the sides of the bowl and resume processing. Repeat these steps for 20-25 minutes, scraping the bowl every few minutes as needed. After 10-12 minutes, the powder will begin to clump into a crumbly dough; after 15 minutes the clumping should be more evident and even audible; after 20 minutes or so, the crumbly dough will miraculously coalesce into a mass of green clay. Scrape down the bowl again and continue processing until the dough becomes creamy and pourable. Turn off the processor and wait a few minutes. If shiny oil begins accumulating on the surface, the recado is ready; otherwise, process a few minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the squash seed sauce:</strong> Place the water, epazote, onion, and bouillon or salt in a saucepan and bring to a boil. Reduce to a simmer, cover, and cook 5 minutes. Remove the pan from the heat and allow the broth to steep at least 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the epazote broth. You should have about 2 1/2 cups (625 ml). If not, add water to complete the measure. Place the recado para papadzul in a broad, deep skillet. In a saucepan, return the broth to a boil. Add the hot broth to the squash-seed paste and blend. For best results, use an immersion blender to break up the paste and thoroughly emulsify it with the liquid. Alternatively, you may use a spatula or wooden spoon to break up the paste, then a whisk to blend until smooth. The final consistency should be like pancake batter. Add a bit more water or stock as needed to keep the batter-like consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the papadzules:</strong> Warm a large serving platter. If the green sauce has cooled, warm it gently over very low heat. (Note: Do not allow the sauce to boil or it may curdle and separate. Also, as it heats it will continue to thicken; stir and scrape the bottom of the skillet frequently.) Working very quickly so that the ingredients stay warm, use a pair of tongs or your fingers to dip one side of a tortilla into the sauce, coating completely. Flip and repeat on the other side. Place the sauced tortilla to one side of the platter and spoon about 2 tablespoons (30 g) of the chopped egg down the center of the tortilla. Roll into a flute shape; repeat until you have 20 Papadzules lined up in neat rows.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, pour the remaining squash-seed sauce over the Papadzules. Spoon on the Tomate frito in one or two strips perpendicular to the Papadzules, then decorate with the epazote leaves. Immediately before carrying to the table, use a small spoon to sprinkle droplets of the optional pumpkinseed oil over all, making sure that each Papadzul gets its fair share. Serve immediately.</p>"}]}