{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141125-sweet-potato-soup-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["orange", "pistachio", "soup", "sweet potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted Sweet Potato Soup With Pistachio, Orange, and Mint Salsa", "link": "https://www.seriouseats.com/recipes/2014/12/sweet-potato-soup-orange-pistachio-salsa-recipe.html", "description": "This simple, warming soup is made with sweet roasted sweet potatoes and a splash of orange juice, and topped with a sauce made from crushed pistachios, olive oil, mint, scallions, and orange zest.", "totalTime": "2 hours 15 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Nuts", "Orange", "Soups and Stews", "Sweet Potatoes and Yams", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["4 pounds sweet potato, peeled and cut into 1/2-inch dice", "6 tablespoons vegetable, canola, or grapeseed oil, divided", "Kosher salt", "4 medium carrots, peeled and diced", "1 medium onion, chopped", "5 cloves garlic, crushed", "2 sprigs sage (optional)", "2 quarts homemade or store-bought low-sodium <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">chicken stock</a> or <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">vegetable stock</a>", "1/4 cup fresh juice and 1 tablespoon freshly grated zest from 1 medium orange, divided", "3/4 cup shelled roasted pistachios, crushed in a mortar and pestle or food processor", "2 scallions, thinly sliced, white and light green parts only", "2 tablespoons very thinly sliced fresh mint leaves (from about 5 sprigs)", "Pinch cayenne pepper", "1/2 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F. Toss sweet potato with 4 tablespoons vegetable oil and salt. Spread sweet potato on 2 rimmed baking sheets and bake for 1 hour, rotating pans front to back and top to bottom halfway through cooking. Increase oven temperature to 375&deg;F and cook until sweet potatoes are tender and lightly browned around the edges, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, heat remaining 2 tablespoons vegetable oil over medium-high heat until shimmering. Add carrot, onion, garlic, sage (if using), and a generous pinch of salt and cook, stirring, until vegetables are just tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sweet potatoes and stock and bring to a simmer. Cook for 10 minutes until vegetables are very tender. Discard sage, if using. Add orange juice. Using an immersion blender or standing blender, blend soup until smooth. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, pass soup through a fine mesh strainer using a rubber spatula to plunge and scrape it through (it may not seem like it at first, but almost all of the soup will pass through). If necessary, thin soup to desired consistency with extra stock or water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, stir together pistachios, orange zest, scallions, mint, and cayenne pepper. Fold in olive oil and season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve soup, spooning pistachio salsa on top.</p>"}]}