{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/090914_eggplant_chickpeas_yasmin_fahr5.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["chickpea", "easy", "eggplant", "harissa", "one pot", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stovetop Eggplant With Harissa, Chickpeas, and Cumin Yogurt", "link": "https://www.seriouseats.com/recipes/2014/09/stovetop-eggplant-with-harissa-chickpeas-cumin-yogurt-recipe.html", "description": "Eggplants have always been a difficult vegetable for me. They come in different shapes, sizes, colors, and stripes and are surrounded by dos and don'ts. But with enough delicious recipes under your belt, it's pretty easy to overlook the post-cooking appearance and realize that all those dos and don'ts are really more suggestions than hard-and-fast rules. This recipe, which combines small Italian eggplants cooked whole in olive oil along with harissa, chickpeas, and tomatoes, is one such preparation.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Eggplant", "Legumes", "Mains", "One-Pot Wonders", "Quick Dinners", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["4 tablespoons extra-virgin olive oil, plus more for drizzling", "5 to 6 small Italian eggplants, peeled and trimmed", "Kosher salt and freshly ground black pepper", "½ tablespoon <a href=\"https://www.seriouseats.com/recipes/2018/04/fresh-chili-harissa.html\">harissa</a>, plus more as desired", "1 (15-oz) can chickpeas, drained and rinsed", "2 cups halved cherry tomatoes", "1 1/2 cups 2% Greek yogurt", "1 tablespoon ground cumin", "½ cup picked parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a 12-inch skillet over high heat until shimmering. Add the eggplants and lower the heat to medium. Season with salt and pepper as you rotate the eggplants, browning them on all sides. Continue to cook, turning regularly, until a fork inserted into the eggplant meets no resistance (you may have to stand them up on their fat end to finish cooking the thickest parts), about 20 minutes, lowering the heat and sprinkling water into the pan as necessary if the eggplants threaten to burn or smoke excessively.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the harissa, chickpeas and tomatoes together, then add to the eggplants. Cook until the tomatoes have blistered and broken down, about 5 minutes more. Season with salt and pepper and add water as necessary to thin to a saucy consistency. Meanwhile, combine the yogurt and cumin in a serving bowl. Season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top the eggplant mixture with the parsley, drizzle with more extra virgin olive oil, and serve with the yogurt on the side.</p>"}]}