{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141026-mussels-how-to-food-lab-saffron2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "French", "keywords": ["bouillabaisse", "easy", "French", "mussel", "quick", "seafood", "shellfish", "wine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mussels With Fennel-Saffron Broth", "link": "https://www.seriouseats.com/recipes/2014/11/mussels-fennel-saffron-broth-recipe.html", "description": "I've gone on record as saying that mussels are the easiest choose-your-own-adventure one-pot meal around, and I intend to prove it to you. This version uses my standard steamed mussel technique and combines it with the classic flavors of a French bouillabaisse. Fennel, saffron, and tomatoes are cooked together with a little pastis and orange zest to form an aromatic, briny broth for dipping bread into.", "totalTime": "15 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Clams, Mussels, and Oysters", "French", "Mains", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["2 tablepsoons extra-virgin olive oil", "4 ounces hard dry fennel salami (see note), diced", "1 small bulb fennel, thinly sliced (about 1 cup)", "1 small onion, thinly sliced (about 1 cup)", "4 medium cloves garlic, thinly sliced", "Kosher salt and freshly ground black pepper", "Pinch saffron", "Pinch red pepper flakes", "1/4 cup pastis or Pernod", "1 (2-inch) piece orange zest, white pith removed", "1/2 cup crushed tomatoes", "2 pounds mussels (see note)", "1/4 cup minced fresh parsley leaves", "1 tablespoon butter", "1 tablespoon juice from 1 lemon", "1 loaf rustic sourdough bread, thickly sliced, drizzled with olive oil, and broiled until heavily toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large saucepan over high heat until shimmering. Add salami and cook, stirring, for 30 seconds. Add fennel, onion, and garlic. Reduce heat to medium, season with salt and pepper, and cook, stirring, until vegetables are softened but not browned, about 5 minutes. Add saffron and pepper flakes and cook until fragrant, about 30 seconds. Add pastis, orange zest, and tomatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to high and bring to a boil. Add mussels, stir, cover, and cook, shaking pan constantly and peeking every 30 seconds to stir. As soon as all the mussels are open, transfer mussels to a bowl using tongs. Place pan lid over bowl to keep mussels warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and whisk in parsley, butter, and lemon juice. Return mussels to pot, stir to combine, then transfer to a warm serving bowl. Serve immediately with broiled bread.</p>"}]}