{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140408-Preserved-Mango-Chutney-spoon.jpg", "author": {"@type": "Person", "name": "Emily Teel"}, "recipeCuisine": "", "keywords": ["chutney", "mango", "mustard seed", "preserve"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Spiced Mango Chutney", "link": "https://www.seriouseats.com/recipes/2014/04/spiced-mango-chutney.html", "description": "A tangy treat to can during the brief, but wonderful, champagne mango season. Toss some with carrots before roasting or add a spoonful to a bowl of rice to make the quickest of meals.", "totalTime": "2 hours", "recipeYield": "Makes 6 half-pint jars", "recipeCategory": ["Condiments and Sauces", "Ginger", "Mango", "Preserved"], "recipeIngredient": ["4-5 large champagne (ataulfo) mangoes", "1/3 cup fresh ginger, peeled and minced (1.5 ounces)", "3 medium chili peppers, seeds and ribs removed", "1 small onion, minced (about 3/4 cup)", "2 cloves garlic, peeled and grated", "1 teaspoon salt", "1 teaspoon yellow mustard seeds", "1 teaspoon red mustard seeds", "1 cup sugar", "1 cup apple cider vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare boiling water canner and sterilize 6 half-pint jars by boiling them for ten minutes. Wash lids and rings and bring to a simmer in a separate, small saucepan of water. Turn off heat and allow jars, lids, and rings to sit in hot water until you need them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Julienne peppers and then peel, seed, and cube mangoes until you have 4 cups (2 pounds) of cubed fruit. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Next, build the brine that will form the base of your chutney. In a large, heavy-bottomed, non-reactive pot, bring sugar, vinegar, mustard seeds, garlic, and salt to a simmer and stir to dissolve sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once sugar has dissolved, add onion, chili, ginger, and mango. Stir to coat. Increase heat and allow mixture to come to a boil, then lower heat and allow mixture to simmer, uncovered, 20 minutes or until mixture appears somewhat thickened. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle into prepared jars, leaving a half inch of headspace. Wipe the rims of the jar lids with a clean kitchen or paper towel and seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the sealed jars back into the canning kettle. When all jars are added, make sure that the water level clears the jar lids by at least one inch. Add more water if necessary, and, over high heat, bring the water back up to a boil. Once the water boils, set a timer for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After ten minutes, turn off heat, and allow jars to sit in water for five additional minutes. Then, using a jar lifter, remove the jars to a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once jars have reached room temperature, remove rings and test that all lids have sealed properly. If any have not sealed, store them in the refrigerator. Label and store sealed jars in a cool place out of direct sunlight.</p>"}]}