{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141113-chicken-liver-pate-cranberry-gelee-bourbon-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["appetizer", "chicken liver", "holiday", "pâté", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Liver Pâté With Bourbon and Cranberry Gelée", "link": "https://www.seriouseats.com/recipes/2014/11/chicken-liver-pate-bourbon-cranberry-recipe.html", "description": "Designed for the Thanksgiving table, this chicken liver pâté is flavored with bourbon and apple cider, then topped with a cranberry gelée. It's silky, smooth, and perfect for a holiday gathering.", "totalTime": "5 hours", "recipeYield": "Makes 1 terrine", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Christmas", "Offal", "Sides", "Snacks"], "recipeIngredient": ["2 pounds chicken livers, trimmed of sinew and fat", "Kosher salt and freshly ground black pepper", "4 tablespoons vegetable oil", "2 shallots, minced", "1/2 teaspoon minced fresh thyme leaves", "2 ounces bourbon or American whiskey", "2 ounces apple cider", "1 1/2 sticks (12 tablespoons) unsalted butter", "1/2 envelope unflavored gelatin", "1 cup unsweetened cranberry juice (see note)", "2 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat livers dry and season with salt and pepper. Heat 2 tablespoons oil in a large skillet until smoking. Cook half of the livers, turning, until browned on both sides and pink in the middle, about 4 minutes. Transfer livers to the bowl of a food processor. Add 1 more tablespoon oil, heat until smoking and repeat with remaining livers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 1 tablespoon oil to skillet, add shallots and thyme and cook, stirring until softened, about 2 minutes. Add bourbon and cook, scraping up browned bits from bottom of skillet, until almost evaporated (you can flame the bourbon, but use caution as flames can leap high from the skillet). Add cider and cook until slightly reduced. Scrape shallots and any remaining liquid into food-processor bowl with livers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter and process, stopping to scrape down sides, until a smooth puree forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a fine mesh strainer over a large mixing bowl and, using a wooden spoon or ladle, press and plunge liver puree through it. Season liver puree with salt and pepper and scrape into a large ramekin or terrine, tapping against counter to remove air pockets. Smooth surface, then press plastic wrap directly against surface and chill in refrigerator until set, at least 2 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a glass measuring cup, sprinkle gelatin on top of cranberry juice and let stand for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cranberry juice and gelatin to a small saucepan and stir in sugar. Heat over medium-high heat, stirring, until sugar is dissolved and juice is simmering. Remove from heat and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently pour cooled cranberry juice on top. Cover with plastic and refrigerate until cranberry juice sets, at least 2 hours. Pâté can be refrigerated for up to 5 days before serving.</p>"}]}