{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141110-thanksgiving-cocktails-michael-dietsch-10.jpg", "author": {"@type": "Person", "name": "Michael Dietsch"}, "recipeCuisine": "", "keywords": ["cocktail", "drink", "fall", "nonalcoholic", "shrub"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin Shrub", "link": "https://www.seriouseats.com/recipes/2014/11/pumpkin-shrub-fall-drinking-vinegar-for-mixing-cocktails.html", "description": "I've paired pumpkin with a natural fall partner: apple cider vinegar. The flavors are pumpkiny with a hint of cinnamon and ginger to very gently remind you of pie season, without hitting you over the head with the Pumpkin Pie Spice flavors that are so common at this time of year.", "totalTime": "1 hour", "recipeYield": "makes 1 pint", "recipeCategory": ["Cocktails", "Drinks", "Non-Alcoholic", "Pumpkin"], "recipeIngredient": ["1 small pie pumpkin such as sugar pumpkin or kabocha squash, about 3 pounds", "1 1/2 cups turbinado sugar", "1 1/2 cups apple cider vinegar", "1/4 cup fresh ginger, grated", "1 tablespoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350°F. Cut stem from pumpkin and slice pumpkin in half. Scoop and remove seeds. Place cut side down on a foil-lined rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast pumpkin until easily pierced with a fork near the stem end, 45 minutes to an hour. Remove from oven, set aside until cool enough to handle, then scoop out flesh with a spoon, discarding skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add pumpkin flesh to a glass or plastic container. Add sugar, vinegar, ginger, and cinnamon. Stir to combine. Place in refrigerator overnight or for up to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass pumpkin mixture through a food mill or sieve, pressing the liquid into a bowl. Mostly, you're trying to capture the liquid, a combination of pumpkin juice and vinegar, but don't worry if a little of the pumpkin puree passes through the sieve. Discard the remaining solids. Return liquid to a jar and refrigerate. Shrub will keep for several months in the refrigerator. </p>"}]}