{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141208-battle-of-the-buttercreams-nila-jones-german-primary.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["baking", "buttercream", "dessert", "frosting", "icing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "German Buttercream", "link": "https://www.seriouseats.com/recipes/2014/12/german-vanilla-buttercream-frosting-recipe.html", "description": "This German buttercream is incredibly smooth and delicious. It's made with a custard base, which gives it a natural yellow color. And although this buttercream contains a fair amount of butter and three egg yolks, it is surprisingly light, both in texture and taste.", "totalTime": "45 minutes", "recipeYield": "Makes about 2 cups, enough to generously frost 8 cupcakes", "recipeCategory": ["Desserts"], "recipeIngredient": ["1/2 cup plus 2 tablespoons whole milk", "1/2 cup granulated sugar, divided", "3 large egg yolks (about 3 tablespoons)", "1 teaspoon cornstarch", "3/4 cup plus 2 tablespoons (1 1/2 sticks plus 2 tablespoons) unsalted butter, softened to room temperature ", "1/2 teaspoon vanilla extract", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk and 1/4 cup of sugar in a medium saucepan. In a medium bowl, whisk together the remaining 1/4 cup of sugar, yolks, cornstarch, and 2 tablespoons of the milk mixture until it looks foamy and smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the saucepan over low heat, stirring to dissolve the sugar. Once the sugar has dissolved, increase heat to medium-high, then remove from heat as soon as the first bubbles appear. While whisking yolk mixture constantly, slowly pour hot milk mixture it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return custard base to the saucepan. Heat over low heat, whisking constantly, until the custard thickens considerably. Be sure not to let the custard boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the custard onto a heatproof plate or shallow container. Immediately cover the custard with plastic wrap, pressing the plastic directly against the surface. Allow the custard to cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the butter in a a stand-mixer fitter with the whisk or paddle, or in a medium bowl if using a handheld mixer, until smooth, fluffy, and lightened in color, about 2 minutes. Add the cooled custard one tablespoon at a time, mixing well after each addition. Add vanilla and salt and mix until the buttercream looks thick, smooth, and creamy, about 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use immediately or refrigerate in an airtight container or a zipper bag in the fridge for up to 2 weeks or in the freezer for up to 2 months. To use buttercream that has either been refrigerated or frozen, first allow to come to room temperature then beat until smooth and spreadable again. Cakes or cupcakes decorated with buttercream generally keep up to 3 days, stored in an airtight container in the fridge. Serve buttercream at room temperature.</p>"}]}