{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141101-queso-fresco-final-slice-jennifer-latham.jpg", "author": {"@type": "Person", "name": "Jennifer Latham"}, "recipeCuisine": "", "keywords": ["cheese", "easy", "farmers cheese", "paneer", "queso fresco", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Easy Queso Fresco or Paneer", "link": "https://www.seriouseats.com/recipes/2014/11/queso-fresco-easy-cheese-recipe.html", "description": "Queso fresco is a delicious, milky, fresh cheese that is a breeze to make. It doesn't melt, so it's a great cheese for grilling in cubes or slices, and is awesome crumbled over soups or salads.", "totalTime": "1 1/2 hours for loose curds, 3 hours for pressed cheese", "recipeYield": "About 1 quart (2 lbs.) cheese curds", "recipeCategory": ["Cheese"], "recipeIngredient": ["1 gallon whole milk, not ultra-pasteurized", "2/3 cup fresh juice from about 5 lemons, or 2/3 cup white vinegar", "Kosher or table salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line colander with four layers of cheesecloth or 2 layers of food-safe paper towels and set over large bowl. Heat milk in a large pot over medium-low heat, stirring frequently, until it registers 165 to 180°F on an instant-read thermometer. Add the lemon juice or vinegar 1 tablespoon at a time, stirring gently after each addition. Stop adding the acid when the curds separate from the whey: you will see white clumps of curd suspended in a pale translucent whey. Let sit uncovered for at least 5 minutes and up to 20 while the separation finishes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using slotted spoon or wire skimmer, transfer curds to prepared colander, cover exposed top with plastic wrap, and allow to drain until desired texture is reached, about 20 minutes if using for pressed cheese (see step 3), or an hour for fresh curds. Gently stir in salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For pressed cheese, gather curds into a ball in the middle of the cloth and press them into a hockey-puck shape. Tie the cloth closed around the cheese. Place the bound cheese back in the colander and place a heavy can or pan on top. Let sit until cheese has reached desired texture, about an hour and a half.</p>"}]}