{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140324-taiwaneats-porkbellybuns-finished.jpg", "author": {"@type": "Person", "name": "Cathy Erway"}, "recipeCuisine": "", "keywords": ["Asian", "pork belly", "steamed bun", "taiwanese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Taiwanese Pork Belly Buns (Gua Bao)", "link": "https://www.seriouseats.com/recipes/2014/04/taiwanese-pork-belly-bun-recipe.html", "description": "True Taiwanese pork belly buns have five defining components: the fluffy steamed bun, tender braised pork belly, pickled mustard greens, fresh cilantro, and powdered peanuts. All combined, it's a messy, colorful, glorious snack of salty, sweet, pungent, and fresh flavors, with multiple textures to boot.", "totalTime": "2 1/2 hours", "recipeYield": "makes 6 buns, serving 2 to 3", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Pork", "Sandwiches", "Snacks"], "recipeIngredient": ["<strong>For the Pork Belly:</Strong>", "2 tablespoons vegetable or peanut oil", "One (1-pound) slab skin-on pork belly, cut into 2-inch strips, then sliced 1/4 inch thick", "2 medium cloves garlic, crushed", "2 (1/8th-inch) slices fresh ginger (unpeeled)", "1 star anise pod (optional)", "1 small fresh red chili, such as Thai chili (optional)", "2 tablespoons rock, brown or raw sugar", "1/4 cup Asian rice wine", "1/2 teaspoon five spice powder (see note)", "1/4 cup dark soy sauce", "1/4 cup light soy sauce", "4 cups water", "&nbsp", "<strong>For the Buns and Toppings:</strong>", "1/2 cup roasted, unsalted peanuts", "1 tablespoon rock, brown, or raw sugar (see note)", "6 fresh or frozen Chinese-style steamed buns (see note)", "6 sprigs fresh cilantro, leaves and tender stems chopped", "4 tablespoons coarsely chopped Asian pickled mustard greens (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pork Belly:</strong> Heat the oil over medium-high heat in a large skillet or wok. Cook pork belly until lightly browned on the bottom, about 3 minutes. Flip pork belly and cook until lightly browned, about 2 minutes longer. Transfer pork belly to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same skillet, add garlic and ginger and cook over medium-high heat, stirring, until fragrant. Add star anise and chili (if using), and sugar and cook, stirring, until the sugar is melted and bubbling, about 2 minutes. Add rice wine and bring to a boil, stirring until sugar dissolves, about 2 minutes. Add five spice powder, dark and light soy sauces, and water and bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pork belly to the skillet and reduce heat to low. Cover skillet and cook until pork belly is very tender, at least 1 hour or preferably 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Buns and Toppings:</strong> Meanwhile, combine peanuts and sugar in a blender or food processor and pulse, stopping to scrape down the sides, until the mixture resembles a coarse powder, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a steamer over a pot of boiling water. Add buns, cover steamer and cook until buns are heated through and fluffy, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Spread pickled mustard greens inside each steamed bun and set a piece of pork belly on top of mustard greens. Top pork belly with a pinch of the chopped cilantro and a sprinkle of the peanut powder. Serve immediately.</p>"}]}