{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20130513-gai-yang-food-lab-recipe-15.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["Asian", "barbecue", "chicken", "fish sauce", "grill", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "9"}, "name": "Thai-Style Grilled Chicken (Gai Yang)", "link": "https://www.seriouseats.com/recipes/2014/07/thai-style-grilled-chicken-recipe.html", "description": "Thai-style grilled chicken, coated in a marinade flavored with cilantro, white pepper, and fish sauce, is one of the tastiest things you'll ever pull off your grill. There's a reason you can't walk more than a few blocks in Bangkok without catching a whiff of its intense aroma. Here's how to make it in your own backyard.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Grilled Chicken", "Grilling, Smoking, and Barbecue", "July 4th", "Labor Day", "Mains", "Memorial Day", "Summer", "Thai", "The Food Lab"], "recipeIngredient": ["6 medium cloves garlic", "12 sprigs cilantro, including thick stalks", "3 tablespoons (45g) palm or light brown sugar", "2 teaspoons (10g) ground white pepper", "1 teaspoon (5g) ground coriander", "2 tablespoons (30ml) fish sauce", "2 teaspoons (10ml) dark soy sauce", "2 (3-inch) segments lemongrass (optional)", "1 whole chicken, spine removed, split in half along the breastbone", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/04/thai-style-sweet-chili-dipping-sauce-recipe.html\">Thai-Style Sweet Chili Dipping Sauce</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine garlic, cilantro, sugar, white pepper, coriander, fish sauce, dark soy sauce, and lemongrass (if using) in the bowl of a food processor. Process until a rough paste is formed. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken halves flat on a cutting board. Insert 2 metal skewers into each chicken half, running parallel through legs and breasts. Transfer chicken to a baking dish that just fits them. Rub on all surfaces with marinade. Cover, transfer to refrigerator, and allow to marinate for at least 2 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">light 1 chimney full of charcoal</a>. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken, skin side up, on cooler side of grill, with legs facing toward hotter side. Cover grill, with vents on lid open and aligned over chicken. Open bottom vents of grill. Cook until an instant-read thermometer inserted into thickest part of breast registers 140&deg;F (60&deg;C), about 45 minutes. Carefully flip chicken and place, skin side down, on hotter side of grill, with breasts pointed toward cooler side. Cover and cook until skin is crisp and an instant-read thermometer inserted into thickest part of breast registers 145 to 150&deg;F (63 to 66&deg;C), about 3 minutes longer. (Be careful, as the skin is very prone to burning.) If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave lid off for longer than it takes to check temperature, or chicken will burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to a cutting board and allow to rest for 5 minutes. Carve and serve with chili dipping sauce.</p>"}]}