{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140616-pupusa-lauren-rothman-1.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "Latin American", "keywords": ["Latin American", "pupusa", "salvadoran", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Cheese and Bean Pupusas (Salvadoran Stuffed, Griddled Tortillas) with Cabbage Slaw", "link": "https://www.seriouseats.com/recipes/2014/06/cheese-bean-pupuses-curtido-recipe.html", "description": "Like its kissing cousin, the Mexican <em>gordita</em>, Salvadoran <em>pupusas</em> are a stellar corn flour pancake stuffed with fillings such as shredded cheese and braised meats, then griddled. Pupusas have the advantage of being stuffed <em>before</em> they're cooked, ensuring an irresistible gooey layer of cheese inside. Our recipe features a simple refried bean filling in addition to melted Oaxacan cheese, and gets topped with <em>curtido</em>, a simple cabbage, carrot and onion slaw.", "totalTime": "1 hour", "recipeYield": "Makes 15 pupusas, serving about 4 people", "recipeCategory": ["Latin American", "Sandwiches"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/05/masa-dough-recipe.html\">masa dough</a>", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/04/perfect-refried-beans.html\">Perfect Refried Beans</a>, cooled", "2 cups shredded <em>queso Oaxaca</em> or mozzarella", "Vegetable oil, for frying", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/05/quick-curtido-mexican-cabbage-slaw-recipe.html\">quick curtido</a>", "Hot sauce and lime wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using wet hands, roll masa dough into 15 golf-ball-sized balls. Place balls on a baking sheet and cover with a moist towel. Working with one ball at a time, use your thumb to press a deep indent into the ball, then use your hands to work it into a small \"bowl\" with a 1/4-inch-thick edge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place about 1 heaping tablespoon refried beans into the bottom of the \"bowl,\" then top with about 1 heaping tablespoon shredded cheese. Using moist fingers, carefully bring dough edge together, enclosing the filling within, and press to seal. Roll the ball in your hands to return it to a uniform ball shape. Carefully pat pupusa down into a flat round about 4 inches wide and about 3/4 inch thick; if edges crack, run a wet finger around them to smooth them. Place pupusas on a baking sheet and keep covered with a towel as you work. Repeat with remaining masa balls and fillings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat a large cast iron skillet with oil and heat over medium heat until shimmering. Working in batches, add pupusas and fry, turning once, until well-browned and crisp, about 4 minutes per side. Drain pupusas on a paper towel-lined plate, than transfer them to plates and top with curtido. Serve with hot sauce and lime wedges, if desired.</p>"}]}