{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140521-293188-cook-the-book-pork-in-spicy-dressing.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Thai", "keywords": ["Asian", "broccoli", "Cook the Book", "pork", "salad", "simple thai food", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork in Spicy Dressing With Iced Broccoli Stems (Mu Manao) From 'Simple Thai Food'", "link": "https://www.seriouseats.com/recipes/2014/05/pork-in-spicy-dressing-with-iced-broccoli-stems-from-simple-thai-food.html", "description": "Most connoisseurs of Southeast Asian food know that Thai salads are not often leafy, vegetable-based dishes. In fact, they are much more likely to be filled with meat and tossed in a funky, fish-sauce laden dressing. This duo of pork and broccoli in <a href=\"http://shesimmers.com/who-is-shesimmers\" target=\"_blank\">Leela Punyaratabandhu</a>'s new cookbook, <em><a href=\"http://www.amazon.com/Simple-Thai-Food-Classic-Recipes/dp/1607745232/?tag=serieats-20\" target=\"_blank\">Simple Thai Food</a></em>, is no exception.", "totalTime": "40 minutes", "recipeYield": "serves 4", "recipeCategory": ["Broccoli", "Cook the Book", "Mains", "Pork", "Salads", "Thai"], "recipeIngredient": ["1 pound lean pork loin or tenderloin or boneless, skinless chicken breasts", "2 teaspoons baking soda", "12 ounces Chinese broccoli or regular broccoli stems", "3 tablespoons freshly squeezed lime juice", "2 tablespoons fish sauce", "1 teaspoon packed grated palm sugar, or 1/2 teaspoon granulated sugar", "4 large cloves garlic, minced", "3 fresh bird’s eye chiles, minced", "8 cups water", "2 teaspoons salt", "1 cup crushed ice", "1/4 cup packed fresh mint leaves (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the pork against the grain and on the diagonal (30- to 40-degree angle) into thin, bite-size pieces. Put the pork in a bowl, sprinkle the baking soda over the top, and mix well (this is best done with your hands). Cover and chill while you ready the other ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using Chinese broccoli, test to see if the stems are tender enough to eat without peeling them. If they are, trim about 1 inch off the bottom of each stalk end and any leaf stems, leaving just the main stem, which will look like an asparagus spear but thicker. If they are not, trim them as directed and then lightly peel them with a<br />\r\nvegetable peeler. If using stems of regular broccoli, peel off the fibrous skin with a vegetable peeler until the inner core is exposed. Cut the Chinese or regular broccoli stems into sticks 5 inches long and 3/4 inch thick. Arrange the stems on a plate, cover, and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, stir together the lime juice, fish sauce, sugar, garlic, and chiles until the sugar dissolves. Place the bowl next to the stove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the water into a 4-quart saucepan and bring to a boil over high heat. Stir in the salt. Lower the heat until the water is barely bubbling. Immediately add the pork to the water and stir. The temperature of the water will drop to the point that it is no longer bubbling; increase the heat just a little so the water is barely bubbling again. Stir the pork gently until it is no longer pink, about 1 to 2 minutes. Using a wire-mesh skimmer or a slotted spoon, lift out the pork, shaking off the excess water, and add it to the dressing in the bowl. Toss the pork with the dressing and transfer the mixture to a serving platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the pork is still warm, remove the plate of broccoli stems from the refrigerator and scatter the crushed ice over the stems. Serve the pork salad and the iced broccoli stems together, instructing diners to enjoy a bite of the pork alternately with a bite of ice-cold broccoli stem. Garnish with mint leaves.</p>"}]}