{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141208-battle-of-the-buttercreams-nila-jones-prep-method-2-5-recipe.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["baking", "buttercream", "dessert", "frosting", "icing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Italian Buttercream", "link": "https://www.seriouseats.com/recipes/2014/12/italian-buttercream-frosting-recipe.html", "description": "Italian buttercream is creamy, velvety, and delicious. Because it's made with Italian meringue, it's a lot lighter in color than most buttercreams and it looks almost pure white against a dark chocolate cake. It also holds up pretty well in warmer temperatures, so if you're planning a summer party outside, this is your go-to buttercream!", "totalTime": "20 minutes", "recipeYield": "makes about 2 1/2 cups, enough to generously frost 10 cupcakes", "recipeCategory": ["Desserts"], "recipeIngredient": ["1 1/4 cups granulated sugar", "1/4 cup water", "4 egg whites (about 1/2 cup)", "1 teaspoon vanilla extract", "1 cup (2 sticks) unsalted butter, cubed and softened at room temperature", "Pinch of salt, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar and water in a medium-sized saucepan. Heat over low heat, stirring with a metal spoon, until the sugar has dissolved and the syrup is clear. Increase heat to medium-high and allow syrup to come to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place egg whites in a stand mixer fitted with a whisk, or in a medium bowl if using a handheld mixer, and beat until whites are almost able to hold soft peaks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook syrup until it reaches 235&deg;F, then immediately remove from heat and slowly drizzle the hot syrup into the bowl with the egg whites, mixing continuously to prevent the eggs from scrambling: don't pour the syrup onto the whisk, or the syrup may splatter against the sides of the bowl; instead, aim for a spot close to the whisk. Once all the syrup has been added, keep mixing until the bottom of the bowl feels cool to the touch and the meringue has cooled down to body temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter one cube at a time, beating well after each addition. Beat in vanilla and salt. The mixture may start to look as if it’s separating, but don't panic: just keep mixing and whipping until the buttercream comes together and becomes smooth and gorgeous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use immediately or refrigerate in an airtight container or a zipper-lock bag in the fridge for up to two weeks or in the freezer for up to two months. To use buttercream that has either been refrigerated or frozen, first allow to come to room temperature then beat until smooth and spreadable again. Cakes or cupcakes decorated with buttercream generally keep up to 3 days, stored in an airtight container in the fridge. Serve buttercream at room temperature.</p>"}]}