{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141015-chickpea-cumin-salad-recipe.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bean", "chickpea", "cumin", "easy", "garbanzo", "lunch", "make ahead", "salad", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Make-Ahead Chickpea Salad With Cumin and Celery", "link": "https://www.seriouseats.com/recipes/2014/10/chickpea-salad-cumin-celery-easy-recipe.html", "description": "A simple salad of chickpeas dressed in a light vinaigrette flavored with cumin, shallots, and olive oil. Crunchy celery and parsley finish it off. This is the kind of salad that gets better as it sits&mdash;Make it one night and pack it for lunch at the office or on a picnic the next day.", "totalTime": "1 1/2 hours (plus overnight soak if using dried chickpeas)", "recipeYield": "Serves 4", "recipeCategory": ["Christmas", "Dairy-Free", "Legumes", "Salads", "Thanksgiving", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 pound dried chickpeas (garbanzo beans), soaked overnight in cold salted water at room temperature", "1 bay leaf", "1 carrot, cut into 3-inch segments", "1 onion, split in half", "2 stalks celery, one thinly sliced crosswise, one cut into 3-inch segments, divided", "Kosher salt", "1/2 teaspoon ground cumin", "2 tablespoon white wine vinegar", "6 tablespoons extra-virgin olive oil", "1 small shallot, thinly sliced", "1/2 cup roughly chopped fresh parsley leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain chickpeas and place in a large pot with bay leaf, carrot, onion, and the segmented celery stalk. Cover with cold water by 2 inches, season with salt, bring to a boil, reduce to a simmer, and cook until the chickpeas are tender but still hold their shape, about 1 hour. Discard bay leaf, carrot, onion, and celery. Drain and rinse under cold running water until chilled. Let drain in a colander set in the sink while you prepare the rest of the salad.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cumin and vinegar in a large bowl. Whisking constantly, slowly drizzle in olive oil. Add shallot, sliced celery, parsley leaves, and drained chickpeas. Toss to coat with dressing and season to taste with salt and pepper. Serve immediately, or for better results, store overnight in a covered container in the refrigerator. Salad will keep for up to three days.</p>"}]}