{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140516-292542-cook-the-book-peruvian-flounder-ceviche-with-sweet-potatoes.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["ceviche", "Cook the Book", "fish", "the new southern table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peruvian-Style Flounder Ceviche From 'The New Southern Table'", "link": "https://www.seriouseats.com/recipes/2014/05/peruvian-style-flounder-ceviche-from-the-new-southern-table.html", "description": "At first, I wasn't really sure what to do with the sweet potato slices that accompany <a href=\"http://www.brysstephens.com/\" target=\"_blank\">Brys Stephens</a>'s Peruvian-style ceviche in his cookbook, <em><a href=\"http://www.amazon.com/The-New-Southern-Table-Ingredients/dp/1592335853/?tag=serieats-20\" target=\"_blank\">The New Southern Table</a></em>. They didn't strike me as particularly compatible with the gently pickled fish. Then I grabbed a slice with my hand, pretending it was a tortilla chip. Genius.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Fish", "Gluten-Free", "Mains"], "recipeIngredient": ["1 pound (455 g) sweet potato (about 1 large", "2 ears fresh sweet corn", "1/4 red onion, thinly sliced, divided", "2 pounds (905 g) flounder fillet, trimmed to make square edges, scraps reserved", "1/2 cup (120 ml) freshly squeezed lime juice", "1/2 teaspoon grated fresh ginger", "1 clove garlic, minced", "1 stalk celery, peeled and thinly sliced", "3 aji limo chiles or 1 habanero chile with seeds and ribs removed for less heat, thinly sliced, divided", "2 teaspoons (12 g) kosher salt, plus more to taste", "1 cup (16 g) sliced fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large saucepan of water to a boil, add the sweet potato, turn down the heat, and gently simmer 30 to 35 minutes, or until just cooked through but still slightly firm. A few minutes before the sweet potato is done, add the corn and simmer 5 to 7 minutes, or until cooked through. Remove the ears, cool, and cut the corn from the cob. Cool, peel, and slice the sweet potato. To mellow the flavor of the sliced onions, soak them in a bowl of ice water for 10 minutes, then drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the <em>leche de tigre</em> (sauce), place the flounder scraps in a large glass bowl along with the lime juice, half of the red onion slices, the ginger, garlic, celery, and two-thirds of the sliced chiles. Set this mixture aside for 20 to 30 minutes, then pass through a fine-mesh strainer into a bowl, pressing firmly on the fish, onion, and aromatics to release their flavorful liquid, then discard everything but the strained liquid. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the fish for the ceviche, cut the squared off flounder pieces into even strips, 2 to 4 inches long and 1/4-inch thick. Cut these strips in half, and place them in a medium-sized glass bowl set in a larger bowl filled with ice. This will keep the fish cold. Sprinkle the fish with the 2 teaspoons (16 g) kosher salt, and stir several times to coat evenly. Let this mixture sit for 20 minutes, gently stirring every few minutes to the salt will penetrate and season the fish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining one-third sliced chile, the remaining one-half red onion, and the cilantro to the fish, and stir to combine. Slowly add the <em>leche de tigre</em>, stirring several times. Pour the ceviche into a serving bowl, and serve with the sweet potato slices and a mound of the corn on the side.</p>"}]}