{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141030-issan-salad-steak-kenji-11.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["beef", "easy", "Isan", "quick", "salad", "steak salad", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Isan-Style Thai Sliced-Steak Salad", "link": "https://www.seriouseats.com/recipes/2014/10/issan-style-thai-sliced-steak-salad-recipe.html", "description": "This salad combines the classic flavors of Northeastern Thailand with ingredients readily available in the average supermarket. Sliced steak, onions, and tomatoes are tossed in a fiery dressing made with pounded garlic and chilies flavored with lime juice and fish sauce. Fried lemongrass adds crunch and lemongrass flavor without the fibrous strands raw lemongrass leaves behind.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Mains", "Salads", "Thai"], "recipeIngredient": ["1/2 cup vegetable oil", "1 stalk lemongrass, tough outer leaves removed, bottom four inches only, sliced as thinly as possible into rounds", "Kosher salt", "2 flat iron, flank, skirt, or hanger steaks, about 12 ounces total (see note)", "Ground white or black pepper", "3 medium cloves garlic", "2 teaspoons Thai red pepper flakes (more or less to taste, see note)", "1 small green thai chili or 1/2 small Serrano chili, finely chopped", "1 tablespoon brown sugar (more or less to taste)", "1 tablespoon fish sauce (more or less to taste)", "1 tablespoon juice from 1 lime (more or less to taste)", "1 pint cherry tomatoes, sliced in half lengthwise", "1/2 small red onion, thinly sliced", "1 cup roughly chopped fresh mint leaves", "1 cup roughly chopped fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine vegetable oil and lemongrass in a small skillet and place over medium heat. Cook, stirring frequently, until lemongrass is golden brown and crisp, about 6 minutes. Strain through a fine mesh strainer set in a small saucepan. Transfer crisp lemongrass to a paper towel-lined plate and season with salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season steak generously with salt and pepper. Transfer 2 teaspoons of reserved lemongrass oil to a large cast iron or stainless steel skillet (reserve remaining lemongrass oil for another use or discard, see note). Heat over high heat until lightly smoking. Cook steak, turning frequently, until well browned and an instant read thermometer inserted into the center registers 125&deg;F for medium, 3 to 8 minutes total depending on thickness. Transfer steak to a cutting board, set aside, and proceed to step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Alternatively, to finish on a grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Season steak generously with salt and pepper. Place steak directly on hot side of grill and cook, turning frequently, until well browned and an instant read thermometer inserted into the center registers 125°F for medium, 3 to 8 minutes total depending on thickness. Transfer steak to a cutting board and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine garlic, pepper flakes, and Thai chilies in a mortar and pestle and pound into a fine paste (see note). Add sugar, fish sauce, and lime juice, and pound until the sugar is dissolved. Taste dressing and add more sugar, fish sauce, lime juice, or pepper flakes to taste. It should be strongly spicy, sweet, salty, and acidic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice steak against the grain and transfer to a large bowl along with any juices that have accumulated on the cutting board. Add fried lemongrass, tomatoes, onion, mint, basil, and dressing. Toss to combine. Serve immediately.</p>"}]}