{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140731-meat-hook-meat-book-chicken-liver-mousse-michael-harlan-turkell.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["chicken liver", "Cook the Book", "mousse", "the meat hook meat book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Twenty-Minute Chicken Liver Mousse From 'The Meat Hook Meat Book'", "link": "https://www.seriouseats.com/recipes/2014/08/twenty-minute-chicken-liver-mousse-from-the-m.html", "description": "Chicken liver mousse always make me think of the sexy, cozy wine bar where I once worked in the West Village. I watched their mousse regularly provoke consummate liver-haters to clean the bowl with their fingers. Chicken liver mousse can do that; it's got everything going for it. It's creamy, fatty, savory, and pureed beyond recognition of anything anatomical. Tom Mylan's version, from <a href=\"http://www.amazon.com/Meat-Hook-Book-Butcher-Better/dp/1579655270/?tag=serieats-20\"><em>The Meat Hook Meat Book,</em></a> is sure to twist some arms: a little funky, a little boozy, and rich enough to be dessert.", "totalTime": "1 hour", "recipeYield": "Serves 8 to 12 as an appetizer or snack", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Condiments and Sauces", "Cook the Book", "Offal"], "recipeIngredient": ["1 large yellow onion, thinly sliced", "2 tablespoons olive oil or chicken fat", "Kosher salt and freshly ground black pepper", "2 thyme sprigs", "2 oregano sprigs", "2 rosemary sprigs", "1/3 cup port or brandy", "6 whole chicken livers (or 12 split pieces), about 1 1/2 pounds, cleaned and rinsed", "1/3 cup dry red wine", "2/3 cup very cold heavy cream", "8 tablespoons (4 ounces) cream cheese, sliced into tablespoon-sized chunks, chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan or cast-iron skillet, cook the onion slices in the olive oil (or chicken fat, if you have some lying around) over medium heat, stirring occasionally, until lightly golden, 5 to 7 minutes. Season with salt and pepper and cook until the onions are caramelized and brown, 3 to 5 minutes longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 sprig each of the thyme, oregano, and rosemary and smash them in with the onions. Deglaze your pan with the port, using a wooden spoon to scrape up the good bits from the bottom of the pan. Cook until all the liquid has evaporated, about 5 minutes. Transfer the onions to a bowl, pulling out the herbs and discarding them, and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out your pan with a paper towel and place over medium-high heat. Add your livers and sauté until browned on both sides but still medium-rare, about <br />\r\n2 minutes on each side. Add the remaining herb sprigs and deglaze the pan with the red wine, scraping up the bits on the bottom of the pan. Cook just until all the liquid has evaporated, about 5 minutes; don’t let the livers start to stick to the bottom of the pan. Transfer the livers to a plate or bowl to cool, discarding the herbs.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the cooled livers and onion into a blender (a food processor will also work, but a blender will yield a smoother texture) and turn it on. After the livers have been spinning for about a minute, slowly add the cream and cream cheese and blend to a puree. Taste for seasoning. The mousse should be slightly salty; if it’s not, add more salt 1/2 teaspoon at a time. You can add more black pepper too, if you wish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass the blended livers through a fine sieve and pour the mousse into the mold(s) of your choice and chill in the refrigerator for at least 30 minutes before serving. The mousse will keep, covered, in the refrigerator for 1 week.</p>"}]}