{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140421-290380-cook-the-book-brazo-de-reina.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Mexican", "keywords": ["Cook the Book", "Mexican", "tamale", "yucatan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brazo de Reina From 'Yucatán'", "link": "https://www.seriouseats.com/recipes/2014/04/brazo-de-reina-from-yucatan.html", "description": "<em>Brazo de reina</em> is a large <em>tamal</em> filled with hardboiled eggs and served in generous slices. The name translates to \"Queen's arm,\" which does little to describe the delightful complexity of the dish. <a href=\"http://www.los-dos.com/welcome/aboutChef.php\" target=\"_blank\">David Sterling</a>'s recipe may be time-consuming, but what emerges at the end of the process is a glorious representation of the flavors of the Yucatán.", "totalTime": "3 hours", "recipeYield": "Serves 12", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Eggs", "Gluten-Free", "Mains", "Mexican"], "recipeIngredient": ["<strong>Masa para tamales</strong>", "2 cups (350 g) fresh corn kernels (4-5 medium ears)", "1 medium clove garlic (1/4 oz/6 g), peeled and charred", "1 3/4 cups (437.5 ml) chicken stock", "3/4 cup (168 g) lard, enriched with bacon fat if possible", "1 tablespoon (12 g) baking powder", "3 cups (400 g) <em>masa harina</em>", "1 teaspoon (6 g) sea salt", "&nbsp", "<strong>For the tamales</strong>", "1 cup (125 g) hulled pumpkin seeds", "8 ounces (250 g) fresh <em>chaya</em> leaves (substitute: chard or kale), tough stems removed and discarded", "Banana leaves, at least 4 pieces cut to measure 10x30 inches, plus extra ribs for ties", "6 eggs, boiled, peeled, and sliced in half lengthwise", "&nbsp", "Chile sauce of your choice", "<a href=\"http://www.seriouseats.com/recipes/2014/04/tomate-frito-from-yucatan.html\">Tomate Frito</a>", "<strong><em>Salpicón</em></strong>", "1 cup (85 grams) green cabbage, finely shredded", "1/2 cup (60 g) radishes, diced or cut into julienne strips", "1/2 cup (80 g) tomatoes (about 1 medium Roma), seeded and cut into medium dice", "1/2 cup (85 g) red onion, cut into medium dice", "1/4 cup (20 g) chives, chopped", "2 medium chiles habaneros (1/2 oz/14 g total), or to taste, stems removed, seeds intact, finely chopped", "1/2 cup (125 ml) Seville orange juice, or substitute (see above)", "1/4 cup (15 g) cilantro, finely chopped", "1 teaspoon (6 g) sea salt), or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the <em>masa</em>: In a large, heavy, dry skillet, roaste the corn kernels until pale golden brown and tender, stirring constantly, 3-4 minutes. Place the garlic and stock in a blender jar and process until well blended. Add the corn and process 3-4 minutes, or until thoroughly liquified; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the lard and baking powder in the bowl of a stand mixer and beat on high until the lard turns fluffy and creamy, about 3 minutes. Add the <em>masa harina</em> and salt to the mixing bowl and beat for about 2 minutes, scraping down the bowl as needed, until the mixture turns into a crumbly mass resembling coarse cornmeal. Slowly add the liquid from the blender to the mixing bowl, beating constantly. Beat 2 minutes, scraping down the sides of the bowl as necessary. Form the <em>masa</em> into a ball, wrap tightly in plastic, and allow to rest at room temperature for 30 minutes to develop flavors.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, grind the pumpkin seeds to make <em>pepita molida</em></strong>: Heat a large dry cast-iron skillet over highest heat for 5 minutes. Place the seeds in the hot skillet. As soon as they begin to pop, toss or stir them vigorously and constantly to avoid burning the seeds at the bottom. Continue toasting until the seeds are fragrant and golden brown, about 5 minutes. Immediately transfer the seeds to a metal colander or large sieve (do not leave them in the skillet: residual heat can burn the seeds at the bottom). Outdoors, or in a place where you don't mind making a bit of mess, briskly toss the seeds in the colander to shake off the papery skins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the seeds have cooled, place them in the bowl of a large food processor fitted with the metal blade. Process 3-4 minutes, until the powder begins clumping on the sides of the bowl. Stop the motor and use a spatula to scrape the powder back into the bowl. Process another 2-3 minutes. Scrape the bowl down again and process until you see very little movement of the powder (the clumping action is a result of the oils being released from the seeds). Taste a bit of the powder: it should have a pleasant texture but not be grainy. If it's grainy, process a minute or two more. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To prepare tamales:</strong> Bring a large pot of salted water to a boil. Plunge the chaya into the boiling water, reduce the heat to medium and cook, uncovered, for 20 minutes. Transfer the chaya to a colander, press out as much liquid as possible (too much moisture will make the masa soggy), and allow it to cool. Coarsely chop the chaya and combine it with the masa in a large mixing bowl. Knead the chaya into the dough until it is thoroughly incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in half and shape into 2 large balls. On a work surface, overlap enough large sections of banana leaf to form a rectangle about 15 inches x 20 inches (38 cm x 50 cm). Place 1 ball of masa in the center of the leaves and pat and extend it into a rectangle about 10 inches x 14 inches (25 cm x 35 cm) and 1/4 inch (6.35 mm) thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle 1/4 cup of the Pepita molida onto the masa, spreading evenly. Arrange half of the boiled eggs tip to tip lengthwise along the center of the masa, leaving a bit of space on either end.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finally, roll the tamal. Using the section of leaf along 1 of the long sides of the masa, lift the masa up and fold it over itself to reach the two-thirds point. Press the masa in place and gently peel away the leaf, allowing it to rest again on the work surface. Lift the opposite side of the leaf and fold the masa to cover the first section. Do not peel away the leaf; rather, continue to roll the tamal into a log shape. Tuck the ends under and pack and compress the log into a tight loaf. (Note: Make sure to check the size of your steamer; if the tamal is too large, you may pack and form the loaf to be smaller without ruining it.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with the remaining components to create 1 more large tamal. Use the reserved ribs from the banana leaves (or kitchen twine) to tie and secure and steam according to instructions in Basic Techniques, for approximately 1 1/2 hours, or until the tamales are firm when pressed with your finger. Allow them to rest at least 15 minutes prior to slicing and serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, prepare the toppings:</strong> If you haven't already done so, cook the <a href=\"http://www.seriouseats.com/recipes/2014/04/tomate-frito-from-yucatan.htm/\">Tomate Frito</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the salpicón, toss the cabbage, radishes, tomatoes, onion, chives, and habaneros together and refrigerate until ready to serve. Immediately before serving, add the remaining orange juice, cilantro, and sea salt and toss to combine. Check the seasonings and adjust to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Slice each \"log\" into 6 equal pieces. For a dramatic party presentation, leave the tamales in the banana leaves and unwrap and slice at the table. Invite diners to spoon on their own salsas and garnishes. Alternatively, unwrap and slice beforehand, plate, and spoon on some of the <em>tomate frito<em>, remaining <em>pepita molida</em>, and <em>salpicón</em>. Diners add chile sauce to taste.</p>"}]}