{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140214-pannacotta-final.jpg", "author": {"@type": "Person", "name": "Jenny McCoy"}, "recipeCuisine": "", "keywords": ["coconut", "hibiscus", "panna cotta", "pomegranate", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Toasted Coconut Panna Cotta with Hibiscus and Pomegranate", "link": "https://www.seriouseats.com/recipes/2014/03/toasted-coconut-panna-cotta-with-hibiscus-and.html", "description": "This recipe for panna cotta takes a bit of advance planning in order to set the layer of hibiscus <em>gelee</em> and pomegranate over the top of the coconut custard, but is well worth the extra time.", "totalTime": "8 hours to overnight", "recipeYield": "Makes 6 to 8 servings", "recipeCategory": ["Coconut", "Desserts", "Pomegranate", "Puddings and Custards"], "recipeIngredient": ["3/4 cup unsweetened shredded coconut", "1 3/4 cups granulated sugar, divided", "1/4 teaspoon plus 1 pinch of fine sea salt, divided", "4 1/2 teaspoons powdered gelatin, divided", "2 1/4 cups whole milk", "1 3/4 cups heavy cream", "1 cup water", "1/4 cup dried hibiscus flowers (or 2 hibiscus tea bags, tags removed)", "1/2 cup pomegranate seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325°F. Place 6 to 8 small glasses or ramekins on a baking sheet. Prepare a large bowl of ice water and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread coconut on a baking sheet and toast until light golden brown, 3 to 5 minutes and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir 3/4 cup sugar, 1/4 teaspoon salt, and 3 1/4 teaspoons gelatin together and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan, bring the milk, cream, and toasted coconut to a boil. Remove from the heat and let stand for 10 minutes to infuse. Return to a boil and while whisking constantly, slowly pour the gelatin mixture into the hot cream; stir until fully dissolved. Strain the mixture through a fine-mesh sieve into a large bowl set over the bowl of ice water, and stir the panna cotta base until just cooled to room temperature, but not thickened. Discard the bowl of ice water. Pour the panna cotta base into a spouted measuring cup or pitcher, then divide evenly among the small glasses. Loosely cover the glasses with a sheet of plastic wrap and carefully transfer to the refrigerator to set for 6 hours to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a large bowl of ice water and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir the remaining 1 cup of sugar, the remaining pinch of salt, and the remaining 1 1/4 teaspoon of gelatin together and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water and the hibiscus to a boil.  Remove from heat and let stand for 5 minutes to infuse. Return to a boil and while whisking constantly, slowly pour the gelatin mixture into the hibiscus tea; stir until fully dissolved. Strain the mixture through a fine-mesh sieve into a spouted measuring cup or pitcher, then gently pour over the set panna cotta to evenly divide among the small glasses. Sprinkle with pomegranate seeds. Loosely cover the glasses with a sheet of plastic wrap and carefully transfer to the refrigerator to set for about 1 hour before serving. </p>"}]}