{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140506-291799-cook-the-book-earth-and-sea.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["coi", "Cook the Book", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Earth and Sea From 'Coi' (Part 2)", "link": "https://www.seriouseats.com/recipes/2014/05/earth-and-sea-from-coi-part-2.html", "description": "This mousseline is a subtle number, a blend of medium and silken tofu, thickened with egg whites and flavored with a hint of ginger and shichimi togarashi. It provides a soft base for the broth, and it grounds the dish with profound earthiness.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Cook the Book", "Eggs", "Gluten-Free", "Sides", "Tofu", "Vegetarian"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2014/05/earth-and-sea-from-coi-part-1.html\">Mushroom Dashi</a>", "<strong>Pickled Turnips</strong>", "20 pieces small Tokyo turnips", "30 g water", "30 g rice wine vinegar", "5 g sugar", "1.5 g salt", "&nbsp", "<strong>Seaweeds</strong>", "Seaweeds, like bull kelp, alaria, sea lettuce, eel grass, purple laver, Turkish towel, sea grapes and giant kelp", "&nbsp", "<strong>Steamed Tofu Mousseline</strong>", "300 g medium tofu", "90 g silken tofu ", "50 g egg white", "1/8 teaspoon finely grated fresh ginger", "10 g white soy", "Salt", "&nbsp", "<strong>To Serve</strong>", "Shichimi togarashi", "24 pieces yuba, cut into ¾ - x 3-inch (1.5- x 8-cm) strips", "Zest of 1 lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To pickle the turnips, cut them in quarters, sixths or eighths, depending on the size, and put them into a metal container. Bring the water, rice wine vinegar, sugar and salt to a boil. Pour over the turnips and let cool to room temperature. Keep the turnips in the liquid for at least a half hour and until you need them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean several kinds of fresh seaweeds, like bull kelp, alaria, sea lettuce, eel grass, purple laver, Turkish towel, sea grapes and giant kelp. Cook the ones that require cooking in unsalted water until tender. Cool and cut into small shapes. Cut the other kinds into similar size pieces. Combine the trimmed cooked and raw seaweeds and soak in cold water, changing the water occasionally and rinsing them each time, to remove the sliminess. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, place the medium tofu, silken tofu, egg white and 1/8 teaspoon finely grated ginger in a blender. Puree and pass through a fine mesh sieve. Season with white soy and salt. Put a large spoonful of mousseline in 4 ovenproof ceramic bowls and dust lightly with shichimi togarashi. Place the bowls into a water bath in the oven at 300°F (150°C) for 15 minutes, until just set. Remove from the oven and add 5 small pieces of drained pickled turnip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p> Warm equal parts plain and thickened dashi (you will need about 400 ml) until warm but not hot (otherwise it will loose its texture). Add the yuba, 4 spoonfuls of seaweeds, and grated lime zest. (Mushroom and lime is a happy combination. The lime is also there to brighten all the deep, dark flavors, so use a decent amount.) Heat through. Spoon the mixture over the baked tofu mousseline. </p>"}]}