{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140218-283488-cook-the-book-speckenwolf-pizza.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "pizza", "prosciutto", "robertas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Speckenwolf Pizza With Mozzarella, Oregano, Onion, Mushroom, and Speck From 'Roberta's'", "link": "https://www.seriouseats.com/recipes/2014/02/speckenwolf-pizza-with-mozzarella-oregano-oni.html", "description": "The <em><a href=\"http://www.amazon.com/Robertas-Cookbook-Carlo-Mirarchi/dp/0770433715/?tag=serieats-20\" target=\"_blank\">Roberta's</a></em> cookbook also begins with pizza, so we too will kick off our week with a pie. The Speckenwolf is a mainstay on their menu. It's a simple white pizza topped with paper-thin slices of smoky cured speck, creamy fresh mozzarella, earthy mushrooms, and sharp red onions. It's the tiny sprinkle of oregano, though, that totally makes the dish.", "totalTime": "1 1/2 hours, plus 24 to 48 hours for the dough", "recipeYield": "Makes 1 (12-inch) pizza", "recipeCategory": ["Bread", "Cheese", "Cook the Book", "Mains", "Pizza", "Pork"], "recipeIngredient": ["<strong>Pizza Dough</strong>", "306 grams (2 1/2 cups) fifty-fifty blend of 00 flour and King Arthur all-purpose flour", "8 grams (scant 2 teaspoons) fine sea salt", "4 grams (scant 1 teaspoon) fresh yeast, or 2 grams (scant 1/2 teaspoon) active dry yeast", "4 grams (scant 1 teaspoon) good olive oil", "202 grams (1 cup minus 1 tablespoon) lukewarm water", "&nbsp", "<strong>Pizza</strong>", "1 (12-inch) round of pizza dough ", "Some good olive oil", "A small handful of cremini mushrooms", "Kosher salt", "A generous pinch of dried oregano", "80 grams (2 3/4 ounces) fresh mozzarella", "3 paper-thin slices of speck", "15 grams (1/2 ounce) red onion, thinly sliced", "Sea salt, preferably Maldon", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong> To make the pizza dough:</strong> In a bowl, thoroughly combine the flour and salt and make a well in the center. In a separate bowl, thoroughly combine the yeast, olive oil, and lukewarm water. Pour the wet mixture into the well in the dry mixture and begin mixing the two together with your hands, gradually incorporating the dry into the wet. This process will be more like mixing than kneading. After about 3 minutes, when the wet and dry are well combined, set the mixture aside and let it rest, uncovered, for 15 minutes. This allows time for the flour to absorb the moisture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your hands and a work surface. Gently but firmly knead the mixture on the work surface for about 3 minutes. Reflour your hands and the surface as needed. The dough will be moist and sticky, but after<br />\r\na few minutes of kneading it should come together into a smooth mass. Divide the dough into 2 pieces, shape them gently into balls, and wrap them in plastic wrap. Refrigerate for at least 24 and up to 48 hours before using. This process, called proofing, allows for the fermentation that gives the dough structure—which means a chewy, pliable crust—and flavor.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pizza:</strong> Preheat the oven to the highest temperature possible. Place a pizza stone or tiles on the middle rack of the oven and let it heat up for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat a large saute pan with olive oil and set it over almost high heat. Add the mushrooms and a pinch of kosher salt, and cook until the mushrooms soften slightly, a few minutes. Remove from the heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove one round of dough from the refrigerator and let it come to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour your hands and work surface. Using your fingertips, push down any bubbles in the dough. Then use your fingertips to push down on the round of dough, from the center out to the perimeter, to encourage it to spread out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Aiming for a round that's no bigger than 12 inches across and no less than 1/8 inch thick in the center, stretch the dough into a round: Pick up the disc of dough and hold your hands parallel to the floor. Then squeeze your fingers together and curve them so that your hands are like paddles. Drape the dough over one hand and flip it over to the other hand in a smooth motion. Continue moving the dough slowly back and forth, rotating it 90 degrees every few seconds so that you end up with a circle. It will start to stretch. After 1 to 2 minutes, you should have a round of dough that's about 12 inches in diameter. Transfer it to a floured pizza peel—preferably a metal one—and gently push out any edges that need pushing to make a better-looking circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scatter the dried oregano over the dough. Break the mozzarella into pieces and distribute them over the pizza. Layer the mushrooms on top of the mozzarella. Tear each speck slice into two pieces and put each piece in a small heap on the pizza. Scatter the red onion and a pinch of sea salt on top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the pizza for 5 to 7 minutes, until the crust is bubbling up and beginning to turn golden. The cooking time will vary depending on your oven and other factors (how much you've been opening the oven, for instance). Keep an eye on it. Then turn on the broiler and broil the pizza for 1 to 2 minutes, checking on it to make sure the cheese doesn't brown, until the crust is golden and just starting to char in a few places. If your oven doesn't have a broiler, just cook the pizza a minute or two longer, until the crust is nice and golden. Give it two grinds of black pepper, and serve.</p>"}]}