{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140304-btb-espressobundtcake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["breakfast sweet", "bundt cake", "cake", "coffee", "coffee cake", "espresso", "The Model Bakery Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Model Bakery's Espresso Bundt Cake", "link": "https://www.seriouseats.com/recipes/2014/03/model-bakery-espresso-bundt-cake-recipe.html", "description": "This bundt cake boasts a caffeinated center as well as an espresso-spiked glaze. The tender crumb works marvelously with the glaze's cool sweetness. Cut a thick slice and eat in place of, or with, your morning coffee.", "totalTime": "1 hour 30 minutes", "recipeYield": "makes 12 servings", "recipeCategory": ["Bake the Book", "Breakfast Sweets", "Cakes", "Desserts"], "recipeIngredient": ["<strong>Cake</strong>", "1 cup/225 g unsalted butter, at room temperature, plus more for the pan ", "Unbleached all-purpose flour for the pan ", "3 cups/390 g cake flour (not self-rising) ", "1 1/2 teaspoons baking powder ", "1 1/2 teaspoon baking soda ", "1/2 teaspoon fine sea salt ", "2 cups/400 g granulated sugar ", "3 large eggs, at room temperature ", "1 teaspoon pure vanilla extract ", "2 cups/480 ml sour cream, at room temperature ", "1/2 cup/120 ml cold brewed espresso or Italian roast coffee (or 1 tablespoon instant espresso dissolved in 1/2 cup/120 ml boiling water) ", "&nbsp;", "<strong>Glaze</strong>", "1 cup/115 g confectioners’ sugar, sifted ", "3 tablespoons brewed espresso (or 1 teaspoon instant espresso dissolved in 3 tablespoons boiling water), as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cake: Position a rack in the center of the oven and preheat to 350°F/180°C/gas 4. Butter the inside of a 12-cup/2.8-L fluted tube pan. Dust with all-purpose flour and tap out the excess. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the cake flour, baking powder, baking soda, and salt together into a bowl. Beat the butter and granulated sugar together in a large bowl with an electric mixer on medium-high speed until light in color and texture, about 3 minutes (or beat by hand with a wooden spoon for about 10 minutes). Beat in the eggs, one at a time, and then the vanilla. Reduce the mixer speed to low. Add the flour mixture in thirds, alternating them with two equal additions of the sour cream, and scraping down the sides of the bowl as needed, mixing until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer one-third of the batter to a medium bowl. Whisk in the cold espresso. Spoon half of the plain batter into the prepared pan. Top with the espresso batter, and then the remaining plain batter. Smooth the batter with a spatula. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until a long bamboo skewer inserted in the center of the cake comes out clean, 50 minutes to 1 hour. Let cool in the pan on a wire cooling rack for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a dinner knife around the inside of the pan to loosen the cake. Invert and unmold onto a wire cooling rack and let cool completely. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the glaze: Put the confectioners’ sugar in a small bowl. Whisk in enough of the espresso to make a glaze about the thickness of heavy cream. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the cake, while still on the cooling rack, over a large plate. Drizzle the glaze over the cake, letting the excess glaze drip down the sides. Let stand until the glaze sets. The cake can be stored, wrapped in plastic wrap, at room temperature for up to 3 days.</p>"}]}