{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140824-Stuffed-aChicken-Butterflying-Process-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["cheese", "chicken", "chicken breast", "grill", "jalapeño", "stuffed chicken breast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Bacon-Wrapped, Jalapeño Popper-Stuffed Grilled Chicken Breasts", "link": "https://www.seriouseats.com/recipes/2014/08/bacon-wrapped-jalapeno-popper-stuffed-grilled-chicken-breast-recipe.html", "description": "A fair question: who doesn't like jalapeno poppers? With that in mind, this dynamite chicken recipe -- part of a week-long celebration of chicken breasts -- offers a drool-worthy alternative to the average, grilled bird. The chicken is filled with a luxe cream cheese and sour cream mix that's specked with canned, roasted jalapenos, garlic and Parmesan cheese. Then, it's wrapped in bacon and grilled over indirect heat.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Cheese", "Grilled Chicken", "Mains"], "recipeIngredient": ["1 (8-ounce) package cream cheese", "1/2 cup sour cream", "1 clove garlic minced (about 1 teaspoon)", "1 (4-ounce) can chopped, canned jalapenos, preferably fire-roasted", "1/2 cup finely shredded Parmesan cheese", "Kosher salt and freshly ground black pepper", "4 boneless, skinless chicken breast halves", "4 slices thick-cut bacon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the cream cheese, sour cream, garlic, jalapenos, and Parmesan cheese in a small bowl. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, butterfly the chicken breast halves: Slice along the length of each breast, and, working parallel to the cutting board, continue slicing until nearly all the way through (but not completely), so that each breast opens like a book. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set each butterflied chicken breast half on a sheet of plastic wrap. Cover with another sheet of plastic wrap and, using a meat pounder, pound each breast to a 1/4-inch thickness. Remove plastic and trim each chicken breast to form an even rectangle. Spread 2 tablespoons of filling over each chicken breast, leaving a 1/4-inch border around the edges. Roll each breast lengthwise, wrap with a strip of bacon, and secure at 3/4-inch intervals with kitchen twine. Season chicken all over with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate, placing a drip pan in an area without direct heat. Set cooking grate in place and cover grill Alternately, if you are using a gas grill, pre-heat to medium- high. Allow to preheat for 5 minutes. Clean and oil the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken directly on the grates on the cool part of the grill, over the drip pan. On a gas grill, place chicken on the upper rack to cook with the drip pan underneath. Watch chicken closely, turning, to avoid flare-ups. When chicken is nearly done cooking, while watching attentively, give it a final sear over direct heat, making it doesn’t catch fire, so the bacon fully crisps. Chicken is done when it reaches an internal temperature of 155&deg;F when checked with an instant read thermometer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from grill and let rest for 5 minutes. Remove twine and serve, passing extra filling for dipping.</p>"}]}