{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/12/chocolatemeringuecake.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["cake", "chocolate", "meringue", "raspberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chocolate Meringue Cake With Whipped Cream and Raspberries", "link": "https://www.seriouseats.com/recipes/2014/12/chocolate-raspberry-meringue-cake-whipped-cream-holiday-dessert.html", "description": "This chocolate meringue cake with whipped cream and fresh raspberries is a surefire crowd pleaser and easy to make. Layers of dense, moist chocolate cake topped with delicate, crispy meringue are sandwiched together with whipped cream and fresh raspberry sauce to make the ultimate holiday dessert.", "totalTime": "3 hours 35 minutes", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Cakes", "Chocolate", "Christmas", "Desserts", "Easter", "Father's Day", "Fruit Desserts", "Mother's Day", "Raspberry", "Valentine's Day"], "recipeIngredient": ["<strong>For the Chocolate Cakes:</strong>", "3/4 cup (about 5 1/2 ounces) granulated sugar", "1/2 cup 1 tablespoon (about 4 ounces) packed light brown sugar", "1/4 cup canola or sunflower oil", "1 large egg", "1/4 teaspoon vanilla extract", "1/2 teaspoon instant coffee granules", "2 tablespoons boiling water", "1/2 cup buttermilk", "3/4 cup plus 2 tablespoons (about 4½ ounces) all-purpose flour", "3/4 cup plus 1 teaspoon Dutch-processed cocoa powder", "3/4 teaspoon baking powder", "3/4 teaspoon baking soda", "1/8 teaspoon table salt", "<strong>For the Raspberry Filling:</strong>", "4 ounces (just shy of 1 cup) frozen raspberries", "5 teaspoons granulated sugar", "1 tablespoon water", "<strong>For the Meringue Layers:</strong>", "2 large egg whites (about 1/4 cup plus 1 teaspoon total)", "1/2 cup granulated sugar", "1/2 teaspoon vanilla extract", "<strong>For the Whipped Cream:</strong>", "3/4 cup heavy cream", "3 tablespoons granulated sugar", "<strong>To Assemble and Serve:</strong>", "1 cup fresh raspberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Cakes:</strong> Adjust oven rack to middle position and preheat oven to 350&deg;F. Line 2 (8-inch) springform pans with baking parchment along the bottom and a collar around the sides (buttering the inside of the pan will help the parchment stick).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the sugars, oil, egg, and vanilla in the bowl of a stand mixer fitted with a whisk attachment. Mix on medium-low speed until the mixture is smooth, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, dissolve the coffee granules in the water, then stir in the buttermilk. Set aside. In a small bowl, stir together the flour, cocoa powder, baking powder, baking soda, and salt. Add the wet and dry ingredients to the egg and sugar mixture. Gently stir the ingredients together, using a rubber spatula or a spoon. Once you’ve incorporated most of the dry ingredients, mix briefly on low speed until batter is smooth, about 15 seconds. Don’t overmix, or the cakes will become chewy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly over the prepared pans. Using the back of a spoon, spread the batter evenly in the pans. Bake until a tester inserted into the centre of the cakes comes out clean, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the cakes to cool to room temperature completely, 30 minutes to 1 hour. The bottom of the springform pans and the top of the cakes should feel cool to the touch before you proceed with the recipe.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>While cakes cool, make the Raspberry Filling:</strong> Add frozen raspberries, sugar, and water to a small saucepan. Heat over low heat, stirring until the sugar has dissolved and the berries have started to release their juices. Increase heat to medium-high and allow to come to a boil, stirring occasionally. Cook for two minutes over low heat, stirring occasionally. Remove from heat and allow the raspberry sauce to cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Once the cakes are cool, make the Meringue Layers:</strong> Adjust oven rack to middle position and preheat oven to 250&deg;F. Carefully clean and dry the bowl of a stand mixer fitted with the whisk attachment. Add the egg whites and whisk on low speed until frothy, about 1 minute. Increase speed to medium high and continue beating until soft peaks form, about 2 minutes. With the mixer still running, gradually add the sugar in a thin, steady stream. Once you’ve added all the sugar, continue mixing until you can no longer feel any sugar crystals when you rub a bit of the meringue between your fingers and the meringue can hold stiff peaks. Add the vanilla and whisk for an additional minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the meringue evenly over the cool cakes. Use the back of a spoon to smooth the meringue in one of the pans and to swirl the meringue in the other pan to form peaks. Bake until dry and crisp but not browned, about 40 minutes. Meringue should sound hollow when tapped gently with a fingernail.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pans from the oven and allow the cakes to cool for 10 minutes in the pans. After 10 minutes, carefully remove the springform collar and peel away the baking parchment from the sides of the cakes. There is no need to remove the bottom part of the pans yet. Allow the cakes to cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Once the cake layers have cooled, make the Whipped Cream:</strong> Beat cream and sugar in a stand mixer fitted with a whisk attachment at high speed until it holds stiff peaks, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble and Serve:</strong> Place the cake layer with the flat meringue top onto a cake stand or serving plate, meringue-side down. Peel off the parchment. Fill a pastry bag fitted with an open tip with the whipped cream and pipe a ring of small mounds or dollops around the outer edge of the chocolate cake layer. Spread the remaining cream onto the center of the cake and spread it smoothly all over the top of the cake layer, out to the inner edges of the ring of whipped cream dollops. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon about three tablespoons of the raspberry sauce onto the center of the whipped cream layer. Smooth over the top, out to the inner edges of the whipped cream dollops. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the baking parchment off the second cake layer and arrange it, cake-side down, on top of the bottom layer. Press down lightly. Strain the remaining raspberry sauce through a fine-meshed sieve and discard the raspberry seeds. If you want to serve the cake immediately or within the hour, drizzle the raspberry sauce over the top of the cake and top with a handful of fresh raspberries. If you want to serve the cake later in the day,<br />\r\n refrigerate for up to eight hours in an airtight cake container. Drizzle with raspberry sauce and garnish with fresh raspberries before serving.</p>"}]}