{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/11/mussels.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "French", "keywords": ["easy", "French", "low carb", "mussel", "quick", "seafood", "shellfish", "wine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7142857142857", "ratingCount": "7"}, "name": "The Best Moules Marinières (Sailor-Style Mussels)", "link": "https://www.seriouseats.com/recipes/2014/11/the-best-moules-mariniere-sailor-style-mussels-recipe.html", "description": "A pot of classic French <em>Moules Marinières</em> is fast food at its best. Made with fresh, inexpensive ingredients that still seem celebratory, this dish comes together in around 15 minutes from start to finish. Make sure to serve it with the rest of the wine left in the bottle and with plenty of toasted bread for dipping into the garlicky, briny broth.", "totalTime": "15 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Clams, Mussels, and Oysters", "Father's Day", "French", "Mains", "Mother's Day", "Quick Dinners", "The Food Lab", "Valentine's Day"], "recipeIngredient": ["2 tablespoons unsalted butter", "1 small leek, white and light green parts only, thinly sliced", "1 small shallot, thinly sliced", "4 medium cloves garlic, thinly sliced", "2 bay leaves", "Kosher salt and freshly ground black pepper", "1 cup hard dry cider or white wine", "2 pounds mussels (see note)", "2 to 3 tablespoons <a href=\"http://www.seriouseats.com/recipes/2011/10/two-minute-mayonnaise.html\">homemade mayonnaise</a> (see note), crème fraîche, or heavy cream (optional)", "1 tablespoon juice and 1 teaspoon grated zest from 1 lemon", "3 tablespoons minced fresh parsley leaves", "Additional <a href=\"http://www.seriouseats.com/recipes/2011/10/two-minute-mayonnaise.html\">homemade mayonnaise</a> for serving (optional, see note)", "1 loaf rustic sourdough bread, thickly sliced, drizzled with olive oil, and broiled until heavily toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 tablespoon butter in a large saucepan over medium-low heat. Add leeks, shallot, garlic, and bay leave. Season lightly with salt and heavily with black pepper and cook, stirring, until vegetables are very soft but not browned, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to high and add cider or wine. Bring to a boil and let reduce by half, about 2 minutes. Add mussels, stir, cover, and cook, shaking pan constantly and peeking every 30 seconds to stir. As soon as all the mussels are open, transfer mussels to a bowl using tongs. Place pan lid over bowl to keep mussels warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and whisk in remaining butter along with mayonnaise or crème fraîche (if using). Return mussels to pot, add parsley, lemon juice, and lemon zest, stir to combine, then transfer to a warm serving bowl. Serve immediately with additional mayonnaise (if using) and broiled bread.</p>"}]}