{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140221-283495-cook-the-book-poulet-rouge.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chicken", "Cook the Book", "grill", "roast", "robertas", "turnip"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Poulet Rouge With Cabbage, Turnip, and Black Radish From 'Roberta's'", "link": "https://www.seriouseats.com/recipes/2014/02/poulet-rouge-with-cabbage-turnip-and-black-ra.html", "description": "<a href=\"http://www.robertaspizza.com/\" target=\"_blank\">Roberta's</a> chef Carlo Mirarchi cooks this chicken in two steps: he starts it whole in a hot oven before separating the legs from the breast and sticking it all on the grill. This (admittedly laborious) process results in perfectly cooked leg and breast meat, infused with smoke from the grill. Around the chicken are pieces of roasted Japanese turnips, buttery Savoy cabbage drizzled with maple syrup, and thin rounds of spicy black radish.", "totalTime": "1 hour and 45 minutes, plus 24 hours to brine the chicken", "recipeYield": "Serves 2 to 4", "recipeCategory": ["Chicken", "Cook the Book", "Mains", "Roasting"], "recipeIngredient": ["3 1/2 kilograms (3 3/4 quarts) water", "175 grams (generous 3/4 cup) kosher salt, plus more as needed", "110 grams (1/2 cup) sugar ", "1 (1.4- to 1.6-kilogram/3- to 3 1/2-pound) Poulet Rouge chicken", "Freshly ground black pepper", "225 grams (8 ounces) Japanese turnips, whole", "2 black radishes", "Half a lemon", "Unsalted butter", "1 head Savoy cabbage, cored and thinly sliced", "10 grams (1 1/2 teaspoons) maple syrup", "White balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot with the water and add the salt and sugar. Place the pot over high heat and bring the liquid to a boil. Boil until the salt and sugar have dissolved, then remove from the heat and let cool. Refrigerate until well chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and discard the organs from the cavity of the bird. Rinse the bird, pat it dry, and put it in a container with the brine, weighting it down if necessary to make sure it’s completely submerged. Refrigerate for 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450°F. Remove the bird from the brine, pat it very dry, and let it come to room temperature. Rub it all over with olive oil and season it very generously with salt and pepper. Put it breast side up in a roasting pan and roast in the oven for 25 to 30 minutes, until the skin is just starting to crisp and a thermometer inserted into the breast reads 108°F. Turn the oven up to 475°F for the turnips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a charcoal grill for medium-high heat or light a gas grill. Remove the legs from the bird and put them skin-side down on the direct-heat side of the grill. Grill, turning once, until the skin is golden brown and crisp, 6 to 8 minutes. Put the breast, still on the crown of the bird, skin-side down on the grill and grill for 5 minutes, until the skin is golden brown and crisp. Remove the chicken pieces from the grill and let them rest for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, toss the turnips with a couple of splashes of olive oil and season with salt and pepper. Put them on a rimmed sheet pan and roast them for about 20 minutes, turning them halfway through, until golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a mandoline or a very sharp knife, slice the radishes paper thin. In a bowl, toss them with a little olive oil, a big squeeze of lemon juice, and salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a couple of tablespoons of butter in large, deep sauté pan and set it over medium-high heat. When the butter is melted, add the cabbage, stirring it with a wooden spoon to coat. Sauté the cabbage until it’s tender and just starting to color, about 5 minutes. Turn off the heat, drizzle the cabbage with the maple syrup, add a big splash of white balsamic and toss it gently. Season it with salt to taste. In a large bowl, gently toss the turnips and cabbage together. Check the seasoning and adjust if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, pull each piece of meat into a few smaller pieces and divide them between two to four plates, making sure to include plenty of skin. Give each plate a helping of turnips and cabbage and scatter the radishes over them. Serve. </p>"}]}