{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/01162014-btb-caribbenatart.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["almond", "bakewell tart", "british dessert", "lime", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Caribbean Bakewell Tart", "link": "https://www.seriouseats.com/recipes/2014/01/caribbean-bakewell-tart.html", "description": "A healthy helping of citrus zest, lime marmalade, and a dash of white rum make up the tropical trifecta of flavors in this easy, breezy tart. A dead-simple pastry crust and hearty sprinkling of toasted almonds are a toothsome, well-suited contrast.", "totalTime": "1 hour", "recipeYield": "makes 1 9-inch tart", "recipeCategory": ["Bake the Book", "Lime", "Nuts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Pastry Crust:</strong>", "85g (3 oz) cold unsalted butter, cut into small pieces", "125g (4 oz) plain flour, plus extra for flouring", "25g (1 oz) caster sugar", "1 free-range egg, separated", "2 tablespoons cold water", " ", "<strong>Filling</strong>", "150g (5 oz) unsalted butter, softened", "150g (5 oz) caster sugar", "3 free-range eggs, beaten, plus 1 yolk", "100g (3 oz) ground almonds", "Finely grated rind of 2 unwaxed limes", "1 tablespoon white rum", "3 tablespoons lime marmalade", " ", "<strong>To finish:</strong>", "Handful of toasted flaked almonds or sweetened coconut shavings", "Icing sugar, for dusting", "Pouring cream, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pastry, put the butter, flour and sugar into a food processor and whizz until the mixture resembles breadcrumbs. Mix the egg yolk with the water and pour into the food processor. Whizz again until the pastry comes together into a ball. (Alternatively, put the butter and flour in a large bowl and rub together with your fingertips until the mixture resembles breadcrumbs. Stir in the sugar, then add the egg yolk and water. Bring the dough together into a ball with your hands.) Wrap it in clingfilm and chill in the refrigerator for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the dough on a lightly floured surface and use it to line a 20cm (8in) diameter, 3.5cm (1in) deep, fluted loose-bottomed flan tin. Put the tin into the freezer for 20 minutes to chill the pastry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile preheat the oven to 400°F. Line the pastry case with nonstick baking paper, fill with baking beans and bake blind for 15 minutes. Remove the paper and beans. Lightly whisk the egg white and paint the dough with it. Return the pastry case to the oven for 5 minutes, then remove. Reduce the heat to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now make the filling. Beat the butter and sugar together until pale and fluffy. Gradually add the beaten eggs plus the extra yolk, beating after each addition. Fold in the almonds, lime rind and rum.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the base of the tart case with the marmalade, then spoon in the almond mixture and spread it out using the back of a spoon. (It will look like you don’t have enough filling, but don’t worry.) Bake for 35 to 40 minutes or until the filling is set and golden on top. Leave to cool, then scatter over the flaked almonds or coconut shavings and dust lightly with icing sugar. Serve with pouring cream. </p>"}]}