{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141119-brassica-salad-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["broccoli", "cauliflower", "fall", "potato", "salad", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Fall Harvest Salad With Roasted Brassicas, Fingerlings, and Radishes", "link": "https://www.seriouseats.com/recipes/2014/11/fall-roasted-brassica-salad-potato-radish-recipe.html", "description": "A fancy Thanksgiving salad that won't add to your holiday stress. Made with roasted brassicas, potatoes, radishes, and sunchokes plus frisee and radicchio, this dish can be prepped ahead with no loss in quality. Plus, it hardly wilts once dressed!", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 6 to 10 as a side", "recipeCategory": ["Broccoli", "Cauliflower", "Christmas", "Dairy-Free", "Potato Salad", "Salads", "Sides", "Thanksgiving", "Vegan", "Vegetarian"], "recipeIngredient": ["5 pounds mixed brassicas, such as broccoli, cauliflower, and romanesco broccoli, cut into florets (see note)", "1 3/4 cups extra-virgin olive oil, divided", "Kosher salt", "3/4 pound radishes (about 15 large radishes), 1/2 pound quartered and 1/4 pound thinly sliced on a mandoline (see note)", "1 1/2 pounds sunchokes, 1 pound cut into 3/4-inch chunks and 1/2 pound peeled and sliced thinly on a mandonline (see note)", "1 1/2 pounds mixed fingerling potatoes (see note)", "2 sprigs rosemary", "5 medium cloves garlic", "1/3 cup apple cider vinegar", "1 small shallot, roughly chopped", "1 tablespoon Dijon mustard", "1/4 cup packed tarragon leaves, chopped", "2 loosely packed cups picked parsley leaves (from one bunch; see note)", "1/2 cup sunflower seeds, toasted (see note)", "2 small heads frisee lettuce, cored and trimmed of damaged leaves (see note)", "1 small head radicchio, halved, cored, and cut into 1-inch strips (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper and lower middle positiona. Preheat oven to 450&deg;F. In a large bowl, toss brassicas with 1/2 cup olive oil, season with salt, and spread in an even layer on 2 rimmed baking sheets. Roast, rotating sheets half way through cooking, until tender and browned, about 35 minutes. Transfer to a large bowl to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When brassica are cooked, toss radish quarters with 2 tablespoons olive oil, season with salt, and arrange in an even layer on one of the now-empty rimmed baking sheets. Toss sunchoke chunks in 2 tablespoons olive oil, season with salt, and arrange in an even layer on the second rimmed baking sheet. Season all vegetables with salt. Roast radishes and sunchokes until each is tender and browned, about 35 minutes. Let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put fingerling potatoes in a Dutch oven, cover with water and season generously with salt. Add rosemary and garlic and heat over medium-high heat until barely simmering. Lower heat and cook at a very gentle simmer until potatoes can be pierced with a fork with no resistance, about 30 minutes. Let cool slightly in cooking water, then drain and discard rosemary and garlic. Cut fingerlings into 1/4-inch thick coins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an immersion blender or standing blender, blend cider vinegar, shallot, Dijon mustard, tarragon, and a large pinch of salt until thoroughly combined and tarragon and shallot are finely chopped. Transfer to a mixing bowl and whisk in remaining 1 cup olive oil. Season with salt, if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large salad bowl, combine roasted brassicas, roasted radishes, and roasted sunchokes with potato slices, radish slices, sunchoke slices, parsley leaves, sunflower seeds, frisee, and radicchio. Add dressing and toss gently with clean hands until salad is evenly coated. Season with salt to taste and serve.</p>"}]}