{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/poundcake2.jpg", "author": {"@type": "Person", "name": "cakespy"}, "recipeCuisine": "", "keywords": ["cadbury creme egg"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cadbury Creme Egg in Hole Toast", "link": "https://www.seriouseats.com/recipes/2014/04/cadbury-creme-egg-in-hole-toast.html", "description": "While it's inspired by the look of \"egg in hole toast\", a morning delicacy made by griddling a slice of bread with a hole cut to fit an egg, this treat is all sweet. It's made with thick slices of pound cake instead of bread, and Cadbury creme egg halves instead of, well, actual eggs. When heated on a griddle with plenty of butter, the fondant-filled eggs get nice and melty in the middle, making for an extra sweet surprise in the middle of your cake slice.", "totalTime": "45 minutes", "recipeYield": "makes 4 servings", "recipeCategory": ["Breakfast Sweets", "Cakespy", "Easter"], "recipeIngredient": ["2 Cadbury Creme Eggs", "4 thick slices of pound cake", "plenty of butter, for the pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unwrap the Cadbury Creme Eggs. Place them on a dish and put them in the refrigerator for about 30 minutes along with the pound cake.This chilling period will help the elements of the recipe remain firm and easier to handle in the next steps.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove everything from the fridge. Using a sharp knife, cut the eggs in half along the \"seam\". Try to make it as clean a cut as possible. Since you chilled the eggs, they should slice cleanly, with the insides somewhat solid. Place the four egg halves to the side for the moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Delicately slice a hole in the center of the pound cake, as close to the size of the creme egg as you can without being larger than the size of the egg. You want it to fit in very snugly. Remove the hole cutout and enjoy it as a snack before proceeding. Repeat with the remaining slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat up your frying pan with a fat dollop of butter in the middle. Let the butter get nice and hot over medium heat. Using a spatula, transfer one or two of the pound cake slices, sans egg, to the pan (as many as will fit comfortably). Let them fry for about 30 seconds, or until lightly toasty on the bottom, then flip the slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now, place the egg half in the holes in the cake, facing yolk side up. Heat for 30 more seconds in the pan, and then turn off the heat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a lid or plate on top of the pan (which is no longer being heated) to capture the heat. Let the residual heat melt the eggs inside. Check them after 3 to 5 minutes. Once they're nice and melty, you're ready to serve. If they're not melty enough, put the pan back on a low heat setting and monitor until the eggs have melted enough for your liking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spatula, transfer the finished slices from the pan to serving plates. Enjoy the Easter magic.</p>"}]}