{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140130-281095-cook-the-book-saucy-tomato-poached-eggs-kale-wheat-berries.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "whole-grain mornings"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Saucy Tomato Poached Eggs with Kale and Wheat Berries From 'Whole-Grain Mornings'", "link": "https://www.seriouseats.com/recipes/2014/01/saucy-tomato-poached-eggs-with-kale-and-wheat-berries-whole-grain-mornings.html", "description": "<a href=\"http://asweetspoonful.com/about\" target=\"_blank\">Megan Gordon</a>'s take on shakshuka in her new cookbook, <em><a href=\"http://www.amazon.com/Whole-Grain-Mornings-Breakfast-Recipes-Seasons/dp/1607745003/?tag=serieats-20\" target=\"_blank\">Whole-Grain Mornings</a></em>, isn't particularly traditional. There are some Anaheim chiles in there for heat, sure, and the gently poached eggs and tomato sauce meld together into a wonderfully comforting rich stew. Yet Gordon bulks up the dish with chewy wheat berries and chopped kale for color and texture.", "totalTime": "about 1 hour, plus time to cook the wheat berries", "recipeYield": "serves 4 to 6", "recipeCategory": ["Breakfast and Brunch", "Cook the Book", "Eggs", "Mains", "Vegetarian"], "recipeIngredient": ["3 tablespoons extra-virgin olive oil, plus more for serving ", "1/2 cup / 60 g diced yellow onion (about 1/2 medium onion) ", "2 Anaheim chiles, stemmed, seeded, and diced", "3 cloves garlic, minced", "1 (28-ounce / 800 g) can crushed tomatoes ", "1 tablespoon tomato paste", "3/4 cup / 85 g cooked wheat berries (see note)", "3 tablespoons capers, drained ", "1/2 teaspoon ground cumin", "1 teaspoon sweet paprika ", "1 tablespoon grated lemon zest", "1 teaspoon kosher salt ", "1/2 bunch kale, stemmed and coarsely chopped (about 2 1/2 cups / 125 g)", "6 large eggs", "1/4 cup / 45 g crumbled feta cheese", "Flaky salt", "Red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 12-inch skillet over medium heat, warm the oil until it shimmers. Add the onion and sauté until just soft, 3 to 4 minutes. Add the chiles and sauté for another 3 to 4 minutes. Then add the garlic and continue sautéing for 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the crushed tomatoes, tomato paste, cooked wheat berries, capers, cumin, paprika, lemon zest, and kosher salt and stir well to combine. Simmer, uncovered, over low heat until the sauce starts to thicken, about 15 minutes. Taste and season with more salt as desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold in the kale and simmer until it begins to soften into the sauce, 1 to 2 minutes. Use a wooden spoon to make 6 little wells in the sauce for the eggs to nestle into. The skillet will be relatively full at this point, so just do your best. Crack the eggs into the wells and cover the skillet. Cook over low heat until the whites are firm but the yolks remain a touch runny, 6 to 8 minutes. Top with the crumbled feta. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop into bowls, sprinkle with flaky salt and red pepper flakes, and drizzle with a dash of olive oil. While I find this best the day it’s made, you can allow leftovers to cool completely, then cover with plastic wrap, and refrigerate for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> To cook the wheat berries, bring 1 cup (170 g) wheat berries and 2 1/2 cups of water to a boil, then decrease the heat to a simmer and cover the pot. Don't peek or stir&mdash;it will disrupt the steaming of the grains. Simmer until tender, 50 to 60 minutes. Cooking time can vary widely depending on the type of wheat berries, so check the package.</p>"}]}