{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140529-292909-GFTues-Fresh%20Pasta%20514.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["gluten free", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2857142857143", "ratingCount": "7"}, "name": "Gluten-Free Fresh Pasta", "link": "https://www.seriouseats.com/recipes/2014/05/gluten-free-fresh-pasta-recipe.html", "description": "Homemade gluten-free pasta is often gummy, gritty, and disappointing. Not this version. Made with brown rice flour, tapioca starch, and xanthan gum, it results in beautiful, tender noodles once cooked. The dough more eggs per cup than traditional wheat-based fresh pasta does: Don't omit that extra egg, it makes a big difference.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Gluten-Free", "Pasta"], "recipeIngredient": ["1 1/2 cups (7 1/2 ounces) brown rice flour, plus more for dusting", "1/2 cup (2 ounces) tapioca starch", "1 teaspoon xanthan gum", "4 large eggs", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In large bowl, whisk together brown rice flour, tapioca starch, and xanthan gum. Add eggs. Switch to a wooden spoon and stir until a dough forms. Generously dust your counter with brown rice flour. Turn dough out onto counter and knead a few times until fairly smooth.   </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into four equal piecesand work with 1 piece at a time, keeping the rest covered. Press the dough to flatten it slightly. Using a pasta machine set at the widest setting, run the dough through 2 times. Continue rolling dough through successively narrower settings until you reach the second-to-last setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut dough sheet in half horizontally and pass each through the fettuccine cutter. (The spaghetti setting is too thin for this gluten-free pasta.) Dust pasta with brown rice flour and place on a rimmed baking sheet. Repeat with remaining dough pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of salted water to a boil. Cook pasta until tender, about 5 minutes. Serve immediately with your choice of sauce.</p>"}]}