{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140410-289531-chicken-schnitzel-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["chicken", "frying"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Schnitzel", "link": "https://www.seriouseats.com/recipes/2014/04/chicken-schnitzel-recipe.html", "description": "It's no coincidence that chicken schnitzel&mdash;pounded chicken breasts that are breaded and fried&mdash;is such a popular dish around the world: Perfectly cooked schnitzel, like the version here, is juicy and tender, with a golden, crunchy exterior that is almost impossible to resist.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Deep Frying", "Mains"], "recipeIngredient": ["2 quarts plus 2 tablespoons cold water, divided", "1/3 cup kosher salt", "4 boneless skinless chicken breast halves, tenders removed, about 8 ounces each", "12 slices white bread", "1 cup all-purpose flour", "2 large eggs", "2 cups canola or peanut oil", "1 tablespoon finely minced parsley, for garnish", "1 lemon, sliced into 4 wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together 2 quarts of water and salt in a large bowl until salt is dissolved. Place the chicken breast halves in brine and refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toast bread until golden brown. Tear toasted bread into large pieces, transfer to a food processor, and pulse until bread is broken down into medium-fine crumbs. Transfer breadcrumbs to a large shallow dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken from brine and pat dry with paper towels. Place one chicken breast half in a resealable plastic bag. Using a meat pounder, rolling pin, or small skillet, pound chicken breast into an even thickness about 1/4-inch in height. Repeat with remaining 3 breasts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set wire rack on a sheet pan. Place flour in a large shallow dish. Place eggs in another large shallow dish and beat with remaining 2 tablespoons water until uniform in color. Coat one chicken cutlet in flour, shaking off any excess. Transfer chicken cutlet to egg wash and coat evenly, letting any excess run off. Transfer to bread crumbs and coat evenly, pressing lightly to ensure bread crumbs adhere. Place chicken on a wire rack. Repeat with remaining 3 chicken breast halves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 12-inch skillet to 375&deg;F. Place one chicken cutlet in oil and fry until golden brown on both sides, about 2 minutes per side, flipping as needed if bread crumbs begin to darken too much. Transfer schnitzel to paper towel-lined plate. Repeat with remaining three chicken breast halves. Garnish with parsley and serve immediately with lemon wedges.</p>"}]}