{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140102-honey-coriander-shortbread.jpg", "author": {"@type": "Person", "name": "Anna Markow"}, "recipeCuisine": "", "keywords": ["citrus", "cookie", "coriander", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Honey Coriander Shortbread", "link": "https://www.seriouseats.com/recipes/2014/01/honey-coriander-shortbread.html", "description": "These cookies feature sunny citrus, floral honey, toasty coriander, and lots and lots of wonderful butter.", "totalTime": "3 hours +", "recipeYield": "Makes 6-7 dozen", "recipeCategory": ["Cookies", "Very Small Anna"], "recipeIngredient": ["2 cups unsalted butter, room temperature", "1/2 cup honey (clover, mixed wildflower or any other basic light honey)", "1 teaspoon vanilla extract", "1 tablespoon zest from any combination of citrus", "5 cups all purpose flour", "2 teaspoons toasted ground coriander", "1/4 teaspoon salt", "Sugar in the raw"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine butter, honey, vanilla, and citrus zest, and beat on high speed with stand mixer or handheld electric mixer until completely smooth, scraping bowl and beater as needed. In separate mixing bowl, whisk or sift together flour, coriander, and salt. With mixer off, add all of dry mixture at once and beat on lowest speed until mostly incorporated, then finish folding it in by hand. Separate into 4 equal portions and pat each into a log and wrap tightly in plastic, rolling the log as you wrap to create an even cylinder. Refrigerate overnight, or, if you're in a hurry, freeze for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rack in center of oven and preheat to 300&deg;F. Line baking sheets with parchment paper or Silpats. Using a sharp knife, slice end from a log and discard, then slice dough into 1/4 inch rounds. To prevent cylinder from warping and flattening, turn it a bit with each slice. Pour sugar in the raw in a shallow bowl and gently but firmly roll edges of each cookie in sugar to coat evenly, then place 1-inch apart on sheets. If dough is excessively soft, refrigerate 5 minutes or until firm before baking. Bake for 10 minutes, then rotate and bake for another 10. Allow to cool fully before removing from sheets and storing. Repeat with remaining dough until all is baked, or store dough logs in freezer until ready to use, up to 1 month.</p>"}]}