{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141215-champagne-cake-roll-with-white-chocolate-nila-jones-recipe-4.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["buche de noel", "cake", "holiday", "jelly roll", "sponge"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Champagne Cake Roll With White Chocolate (White Chocolate Bûche de Noël)", "link": "https://www.seriouseats.com/recipes/2014/12/cahmpagne-roll-cake-white-chocolate-holiday-buche-de-noel-recipe.html", "description": "Filled with Champagne buttercream and decorated with gold chocolate shards and sugar pearls, this cake roll is the pinnacle of festivity. Instead of using ordinary Champagne, I make this cake with Marc de Champagne, a pomace brandy made from Champagne grape skins, seeds, and stalks that pairs beautifully with the cake's creamy buttercream filling and sweet white chocolate ganache coating.", "totalTime": "2 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Cakes", "Christmas", "Desserts"], "recipeIngredient": ["<strong>For the Cake Roll</strong>:", "5 large eggs", "1 cup minus 1 tablespoon granulated sugar", "4 teaspoons sunflower oil, or canola oil", "2 1/2 tablespoons buttermilk", "1 tablespoon Marc de Champagne, or grappa", "5 1/2 ounces (about 1 cup plus 2 tablespoons) all-purpose flour", "1 1/4 teaspoon baking powder", "1/4 teaspoon table salt ", "1/4 cup powdered sugar for sprinkling", "<strong>For the Champagne Syrup</strong>:", "1/4 cup water", "1/4 cup granulated sugar", "1 teaspoon Marc de Champagne or grappa", "<strong>For the Champagne Buttercream</strong>:", "3 large egg whites (about 1/3 cup + 1 tablespoon)", "1 cup minus 2 tablespoons granulated sugar", "1 1/3 sticks (about 11 tablespoons) unsalted butter, cubed and softened at room temperature", "2 teaspoons Marc de Champagne or grappa", "<strong>For the White Chocolate Ganache</strong>:", "6 ounces of good quality white chocolate", "1/4 cup heavy cream", "<strong>For the White Chocolate Shards</strong>:", "5 ounces good quality white chocolate", "Gold luster dust, optional", "Sugar pearls, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Adjust oven rack to lower position and preheat oven to 350&deg;F. Grease a rimmed jelly roll pan with a little butter and line with baking parchment on bottom and sides. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat eggs with an electric mixer until tripled in volume and lightened in color, about 5 minutes. With the mixer running, add the sugar one tablespoon at a time, mixing well after each addition. This should take about 2 minutes. Drizzle in the oil, buttermilk and Marc de Champagne and mix until incorporated.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together the flour, baking powder, and salt. Add dry ingredients to the egg mixture, one tablespoon at a time, mixing continuously until combined. Pour batter into prepared pan and carefully tilt pan to distribute batter in an even layer. Bake for until a tester inserted into the center of the cake comes out clean and top of the cake springs back when pressed with fingers, 12 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cake is in the oven, place a clean, cotton tea towel (preferably one without decorative textures) on counter and sprinkle with powdered sugar, using your hands to rub the sugar into the tea towel. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cake is done, remove from oven and allow to cool for one minute, then immediately turn cake out onto the tea towel, carefully peel off the parchment and roll cake in the tea towel, starting at a short side. Roll slowly and tightly. Place cake roll (wrapped in tea towel) on a wire rack seam-side down until it has cooled completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Champagne syrup:</strong> Combine water and sugar in a small saucepan. Heat over low heat, stirring until the sugar has dissolved and the syrup is clear. Remove from heat, transfer to a mug and allow to cool. <br />\nOnce cool, combine 1/4 cup of syrup with the Marc de Champagne. (Remaining syrup can be stored in a sealed container in the refrigerator for another use.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Champagne Buttercream:</strong> In a medium-sized heatproof bowl, whisk together the egg whites and sugar. Place the bowl over a small pan with simmering water, making sure the water doesn't touch the bowl. Keep whisking the mixture until sugar has dissolved. You can easily check whether the sugar has dissolved by rubbing a bit of the mixture between your fingers; the mixture shouldn't feel grainy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you're not worried about salmonella, you can take the mixture off the heat at this point. If you want to pasteurize the meringue, keep whisking until the mixture reaches a temperature of 71°C/160°F using a candy thermometer. Once the meringue reaches the desired temperature, take it off the heat. Using a hand held or a stand mixer, beat the warm mixture until the meringue holds stiff peaks and the bottom of the bowl feels cool to the touch. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter one cube at a time, beating well with the electric mixer after each addition. The mixture may start to look as if it’s separating during this process but don't panic: just keep beating and the buttercream will come together and become smooth. Once the buttercream is smooth and creamy, add Marc de Champagne and again mix until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the cake has cooled to room temperature, carefully unroll the cake roll and place it on a clean work surface. Allow the tightest rolled end to curl back in to prevent the cake from cracking. Should it crack a little, that’s fine; you won’t see it after you roll it back up. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pastry brush, brush the inside of the cake roll with the champagne syrup. Frost with the Champagne buttercream, leaving a one-inch border uncovered at the uncurled end. Reroll cake starting from the curled end. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the White Chocolate Ganache:</strong> Combine cream and white chocolate in the bowl of a double boiler. Heat over low heat, stirring occasionally, until the chocolate has melted and the ganache is smooth. Remove from heat and allow to cool to body temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cool, beat ganache with a mixer until it lightens in color. It should be thick, but easily spreadable. Frost the cake roll with the white chocolate ganache, using the back of a spoon to create a bark-like pattern. Allow excess ganache to drip down onto the cookie sheet. Place cake (wire rack and all) in the fridge until ganache has set. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the White Chocolate Shards:</strong> place a cookie sheet in the freezer. Carefully melt the chocolate in the bowl of a double boiler, stirring occasionally. Once the chocolate has melted, remove the cookie sheet from the freezer and line it with baking parchment. Pour the melted white chocolate onto the sheet. Using the back of a spoon, spread the chocolate in an even layer. Allow chocolate to set completely in the refrigerator.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once set, use a sharp knife to cut the chocolate into shards. Using a clean, dry paintbrush, brush the chocolate shards with the gold luster dust. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Once the ganache has set, remove the cake from the fridge. Heat a serrated knife by placing the knife in a tall container filled with hot water. Dry the knife and trim ½ inch off both ends of the cake, wiping the knife clean between cuts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a sharp knife along the perimeter of the cake to loosen the ganache from the wire rack. Carefully transfer the cake to a serving plate or cake stand using a large spatula. Decorate with the chocolate shards and sugar pearls as desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the cake to come to room temperate before serving. This should take 2-3 hours. Undecorated cake (finished cake roll without the chocolate shards and sugar pearls) can be stored in an airtight container in the fridge for up to two days. Decorate just before serving. <br />\n</p>"}]}