{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141022-brussels-sprouts-salad-hazelnut-bacon-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brussels sprout", "easy", "fall", "hazelnut", "low carb", "quick", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Warm Brussels Sprout Salad With Bacon and Hazelnut Vinaigrette", "link": "https://www.seriouseats.com/recipes/2014/10/warm-brussels-sprout-salad-bacon-hazelnut-sherry-vinaigretter-recipe.html", "description": "This simple seven-ingredient salad is packed with flavor thanks to a vinaigrette made from warm bacon fat, shallots, hazelnuts, honey, and sherry vinegar, with just a touch of extra-virgin olive oil. The Brussels sprouts leaves are cooked just long enough to give them some sweet, nutty char, but still retain a fresh green bite.", "totalTime": "30 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Bacon", "Christmas", "Nuts", "Salads", "Thanksgiving"], "recipeIngredient": ["12 ounces Brussels sprouts", "3/4 cup hazelnuts", "1 small shallot, finely minced (about 2 tablespoons)", "1 tablespoon honey", "1 tablespoon sherry vinegar", "1 tablespoon extra-virgin olive oil", "3 ounces bacon, cut into 1/2-inch pieces", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim off bottoms of Brussels sprouts and separate the leaves that are released. Transfer leaves to a large bowl. Continue trimming off the bottom and removing released leaves until only the very central core remains.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thinly slice the central core and transfer to the bowl with the released leaves. Discard trimmed bottoms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pound hazelnuts in a mortar and pestle or under a small skillet until roughly chopped then transfer to a medium bowl. Add shallots, honey, vinegar, and olive oil and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread bacon in a medium cast iron or non stick skillet and place over medium-high heat. Cook, stirring frequently, until completely crisp and fat has rendered, about 4 minutes total. Using a slotted spoon, Transfer bacon to a small bowl. Pour two tablespoons bacon fat into bowl with hazelnut mixture and whisk to combine. Season hazelnut mixture to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet with remaining bacon fat to high heat and heat until lightly smoking. Add Brussels sprouts, spread into an even layer, season with salt and pepper, and cook without moving for 1 minute. Stir and continue cooking, shaking and stirring constantly, until leaves are bright green and just starting to turn tender, about 1 minute longer. Transfer to a large bowl. Add bacon and dressing and toss to combine. Serve immediately.</p>"}]}