{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141117-fast-food-thanksgiving-stuffing-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Lily Mirabelle Freedman"}, "recipeCuisine": "", "keywords": ["stuffing", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Popeye's Buttermilk Biscuit Stuffing", "link": "https://www.seriouseats.com/recipes/2014/11/popeyes-buttermilk-biscuit-stuffing-recipe.html", "description": "Since Popeye's makes one of our favorite buttery, tender biscuits in the city, we thought it would have excellent stuffing potential. And sure enough, once dehydrated in the oven, the biscuit-croutons stand up beautifully to the stock, cream, and egg mixture that gives this stuffing its custardy texture. The dish is studded with sweet Italian sausage, onion, celery, carrots, and fennel for a fast food twist on the classic dish.", "totalTime": "2 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Sides", "Thanksgiving"], "recipeIngredient": ["12 Popeye's biscuits, cut into 1/2-inch cubes", "1 tablespoon olive oil", "1 pound sweet Italian sausage, removed from casing", "1 large onion, finely chopped (about 2 cups)", "1 large carrot, finely chopped  (about 1 cup)", "Kosher salt and freshly ground black pepper to taste", "1 fennel bulb, finely chopped (about 1 cup)", "3 stalks celery, finely chopped (about 1 cup)", "3 cloves garlic, minced", "2 teaspoons minced fresh sage leaves", "1 teaspoon fresh thyme leaves, finely chopped", "4 whole eggs, beaten", "3 cups low-sodium chicken or turkey broth", "1/4 cup heavy cream", "1 tablespoon butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F. Spread out the cubed biscuits in an even layer on a large baking sheet. Bake until dried out and begin to toast, rotating halfway through, about 30 minutes total. Remove from oven and set aside to cool. Decrease oven heat to 350&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large skillet over medium heat until shimmering. Add sausage and cook, breaking it up into small pieces with a whisk or potato masher. Cook until beginning to brown, about 15 minutes. Add onions and carrots, season with salt and pepper and cook, stirring frequently, until the carrots begin to soften, about 5 minutes.  Add fennel, celery, garlic, sage, and thyme and cook, stirring frequently, until all the vegetables have softened and are beginning to take on color, about 10 minutes. Transfer mixture to a large bowl.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together eggs, broth, and cream in a medium bowl until fully combined. Season with salt and pepper. Pour mixture over the sausage and vegetable mixture. Add diced biscuits and gently fold until evenly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter a 9- 13-inch rectangular baking dish (or 10- 14-inch oval dish).  Transfer the stuffing mixture and pack it down lightly. Cover tightly with aluminum foil and bake on the middle rack of the oven for 25 minutes.  Remove foil and continue cooking until the top is beginning to brown, 20 to 25 minutes longer.  Increase oven to 425&mdash;F and continue cooking until well browned, about 8 minutes longer. Remove from oven and allow to cool 10 minutes before serving.</p>"}]}