{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140425-bake-the-book-teenys-tour-of-pies-pear-goat.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["goat cheese", "pear", "tart", "Teeny's Tour of Pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Teeny Lamothe's Pear &amp; Goat Cheese Tart", "link": "https://www.seriouseats.com/recipes/2014/05/teeny-lamothes-pear-goat-cheese-tart.html", "description": "Hunks of creamy white goat cheese are scattered like clouds over warm pear slices and a whole wheat crust. Sound good? Go for it&mdash;this delicious tart is easy to make.", "totalTime": "1 hour", "recipeYield": "2 tarts (serves 4 to 6 each)", "recipeCategory": ["Bake the Book", "Desserts", "Pear", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1/4 cup granulated sugar", "1/2 teaspoon ground cinnamon", "2 tablespoons cornstarch", "2 to 3 pears, preferably Bartlett, peeled, cored, and roughly chopped (equal to 2 cups)", "2 ounces fresh goat cheese", "1 disk dough from Whole Wheat Crust (ingredients below)", "Up to 3 tablespoons all-purpose flour, for rolling out the crust", "&nbsp;", "<strong>Whole Wheat Crust</strong>", "1 1/2 cups all-purpose flour ", "1 cup white whole wheat or whole wheat flour", "2 teaspoons salt", "2 tablespoons granulated sugar ", "3/4 cup (1 1/2 sticks) cold unsalted butter, cut into small pieces", "1/2 cup (4 tablespoons) cold vegetable shortening", "1/4 cup (4 tablespoons) cold vodka ", "1/2 cup (8 tablespoons) cold water, plus extra as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the pie crust:</strong> In a large bowl, stir together the flour, salt, and sugar until everything is thoroughly combined. Add the butter and shortening and cut the mixture together using a pastry cutter until it forms small pea-size crumbs coated in flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the vodka evenly over the dry ingredients, a few tablespoons at a time, using a rubber spatula to press the dough together. Similarly, add the water, and continue to press the dough together to form a large ball. The dough should be fairly wet and sticky; if for some reason it seems particularly dry, add a little extra ice water a tablespoon at a time until everything comes together easily. (Be careful to work the dough as little as possible; otherwise the crust may be tough.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into two equal balls, press each into a disk, wrap each in plastic, and refrigerate for at least an hour or up to 2 days before rolling out.</p>\n\n<p>Note: This recipe calls for only one disk of dough; the other can be kept in the freezer up to 3 months. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the tart:</strong> Preheat the oven to 400°F with a rack in the middle position. Line a large baking sheet with aluminum foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together the sugar, cinnamon, and cornstarch in a small bowl until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pears in a large bowl and pour the sugar mixture over them. With your hands or a large spoon, gently toss the fruit to coat evenly. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the crusts: Divide the dough into two equal pieces and form each into a 1-inch-thick disk. On a lightly floured surface with a lightly floured rolling pin, roll one piece of dough into a rough 12-inch circle about 1/8 inch thick. Transfer the dough circle to the baking sheet. Repeat with the remaining dough disk, placing it next to the first dough circle on the baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Give the pear mixture one final stir and arrange 1 cup of pears in the center of the first dough circle, leaving a 1-inch edge all around (if your pears are very juicy, you may wish to strain off half of the liquid first). Crumble half of the goat cheese evenly over the fruit filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Starting on one side, fold the edge of the crust up and over the edge of the filling. Make your way around the circle, folding up the extra crust and pleating it as you go. The crust should not meet in the center; the edges just have to be tucked up toward it. The look you’re going for by the end is a very rustic tart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat the filling, topping, and folding with the remaining pears, goat cheese, and dough circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the crusts are golden brown and the cheese has browned on top, 30 to 40 minutes. Serve warm.</p>"}]}