{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140220-283493-cook-the-book-romaine-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "dressing", "robertas", "salad", "side"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Romaine Salad with Candied Walnuts and Pecorino From 'Roberta's'", "link": "https://www.seriouseats.com/recipes/2014/02/romaine-salad-with-candied-walnuts-and-pecorino-from-robertas.html", "description": "We've made <a href=\"http://www.seriouseats.com/search?term=caesar+salad&amp;site=recipes\">our fair share</a> of Caesar salads here on Serious Eats over the years. Heck, I've made a few of them. So I'm not exactly breaking new ground here. But until I picked up the <em><a href=\"http://www.amazon.com/Robertas-Cookbook-Carlo-Mirarchi/dp/0770433715/?tag=serieats-20\" target=\"_blank\">Roberta's</a></em> cookbook, I had never seen a version so austere in appearance and yet bold in flavor.", "totalTime": "About 2 hours", "recipeYield": "Serves 2", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Salads", "Sides"], "recipeIngredient": ["<strong>Roasted Garlic Dressing</strong>", "1 head of garlic", "175 grams (3/4 cup plus 1 tablespoon) good olive oil, plus a splash for the garlic", "1 garlic clove, peeled", "10 grams (2 teaspoons) Dijon mustard", "21 grams (1 1/2  tablespoons) white wine vinegar", "28 grams (2 tablespoons) sherry vinegar", "2 large egg yolks", "5 anchovy fillets", "Juice of half a lemon, plus more if needed", "Kosher salt", "Freshly ground black pepper", " ", "<strong>Candied Walnuts</strong>", "180 grams (2 cups) walnut halves", "2 large (not extra-large or jumbo) egg whites", "30 grams (3 packed tablespoons) dark brown sugar", "75 grams (1/4 cup) honey", "Freshly ground black pepper", "5 grams (1 teaspoon) kosher salt", " ", "2 romaine hearts, ends trimmed, leaves separated", "60 grams (2 ounces) Pecorino Romano", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the roasted garlic dressing:</strong> Preheat the oven to 350°F. Cut a quarter inch off the head of garlic and place the head, cut side up, on a big square of aluminum foil. Give it a splash of water and a splash of olive oil. Bring the corners of the foil up over the garlic to make a loosely wrapped little package. Bake for a little less than 1 hour. Remove the garlic from the oven and let it cool in the foil. Squeeze the roasted garlic out of 4 or 5 cloves and set the rest aside for another use (it’s really good just spread on grilled bread). Leave the oven on for the walnuts</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the roasted garlic, the raw clove of garlic, mustard, vinegars, egg yolks, anchovies, and lemon juice into a blender or food processor and blend for 30 seconds or until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While blending, add the olive oil in a slow, steady stream until it’s incorporated and the dressing looks smooth. Taste and add salt, pepper, and more lemon juice as desired. The dressing will keep for a week in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the candied walnuts:</strong> Put the nuts on a baking sheet and roast at 350°F for 4 minutes and then turn the sheet 180 degrees and roast for another 4 minutes. Remove them from the oven and let them cool. Turn the oven down to 275°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk the egg whites until they begin to have body but not until they form soft peaks. Add the brown sugar, honey, and about 10 turns of a pepper grinder’s worth of black pepper to the whites, and combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the walnuts to the mixture and mix with a wooden spoon until they’re all well coated. Spread them on a foil-lined baking sheet and sprinkle them evenly with the salt. Put them in the oven and bake for about 12 minutes. Then turn the baking sheet and bake for another 12 minutes; the nuts should be dry, not sticky. Remove them from the oven and let them cool. They’ll stay fresh for up to 2 weeks in a sealed container in a cool, dry place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the salad:</strong> Wash and dry the romaine leaves and put them in a very large bowl—the bigger the better. Pour half the roasted garlic dressing over the leaves, and using your hands, gently scoop the lettuce from the bottom of the bowl up the sides. (We don’t recommend using tongs to dress this salad—or any salad. You’ll damage the leaves and you won’t distribute the dressing evenly.) Gently toss until the leaves are well coated, adding more dressing if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the lettuce between two plates, and using a hand-held fine grater, grate the Pecorino over each plate. Scatter the walnuts over the two plates and give each a grind of black pepper. Serve.</p>"}]}