{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140730-btb-icedyoghurt.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "French", "keywords": ["Bake the Book", "dessert", "French", "fruit", "honey", "mead", "paris pastry club", "peach", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Iced Yogurt With Mead-Baked Peach From 'Paris Pastry Club'", "link": "https://www.seriouseats.com/recipes/2014/08/iced-yogurt-with-mead-baked-peach-from-paris-pastry-club.html", "description": "When fruit is at its peak, it's best served simply; something that <em><a href=\"http://www.amazon.com/Paris-Pastry-Club-Collection-Indulgent/dp/1742704719/?tag=serieats-20\" target=\"_blank\">Paris Pastry Club</a></em> author Fanny Zanotti knows well. This recipe for mead-baked peaches comes from a childhood memory of picking peaches in an orchard, and having them prepared just this way for dessert. The tangy yogurt is a lovely counterpoint to the soft, yielding flesh of the peaches. Crunchy honeycomb candy echoes the notes of honey in the mead, and provides a pleasant crunch.", "totalTime": "overnight, for freezing", "recipeYield": "Serves 6", "recipeCategory": ["Bake the Book", "Desserts", "French", "Fruit Desserts", "Peach"], "recipeIngredient": ["<strong>For the Iced Yoghurt</strong>", "60 g (2 oz) caster (superfine) sugar", "30 g (1 oz) water", "1 egg white", "125 g (4 1/2 oz) thick yoghurt", "125 g (4 1/2 oz) whipping cream, whipped to soft peaks", "<strong>For the Mead-Baked Peaches</strong>", "6 ripe yellow peaches, halved and stoned", "60 g (2 oz) caster (superfine) sugar", "2 tablespoons honey", "250 g (9 oz) mead", "<strong>For the honeycomb</strong>", "150 g (5 oz) caster (superfine) sugar", "60 g (2 oz) glucose syrup", "30 g (1 oz) honey", "30 g (1 oz) water", "1 teaspoon bicarbonate of soda"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the iced yoghurt, first place 2 inch metal rings on a baking tray lined with baking parchment. Line each ring with a strip of baking parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the sugar and water in a small pan set over medium heat to 245F. As the syrup reaches the correct temperature, start whisking the egg whites until soft peaks form. When the syrup is ready. slowly pour it into the side of the bowl, to avoid splatters. Keep on whisking on a high speed until firm and glossy and the bowl feels warm to the touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the yogurt in a large bowl to loosen it, then gently fold in the Italian meringue until almost fully incorporated. Add the cream and fold in until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the yoghurt mousse into a piping bag, cut the tip off and pipe the mousse into the prepared rings so that each is around 1 1/4 inch deep. Freeze for at least 5 hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the meantime, make the honeycomb. Have a baking tray lined with baking paper ready. Place the sugar, glucose syrup, honey and water into a large pan, and cook over low heat until it turns into a light caramel. Off the heat, add the bicarbonate of soda, mixing well using a wooden spoon. Immediately scrape onto the prepared baking tray and allow to cool completely. Then break the slab into pieces and store into an airtight container if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325F. Arrange the peaches cut-side up on a baking tray. Sprinkle with sugar and honey, and drizzle with the mead. Bake for 20 minutes, spooning the juices over the fruits every 4 minutes or so. Transfer the fruits to the plate and keep at room temperature to cool down slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the juices to a boil in a small saucepan over a high heat. Simmer for 6-8 minutes, or until syrupy. Spoon the syrup over the peaches to coat them slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you are ready to serve, unmold the frozen yoghurts onto a large serving plate. Add the roasted peaches and drizzle some more syrup on the plate. Break the honeycomb into small pieces and scatter over. </p>"}]}