{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140626-btb-blackberrycupcakes.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cream cheese", "cupcake", "dessert", "fruitful", "raspberry", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Vanilla Cream Cheese Cupcakes With Black Raspberry Buttercream From 'Fruitful'", "link": "https://www.seriouseats.com/recipes/2014/06/vanilla-cream-cheese-cupcakes-with-black-rasp.html", "description": "This recipe came to <strong><em>Fruitful</em></strong> from Agatha Kulaga and Erin Patinkin, the duo behind Brooklyn's Ovenly, a beloved bakery located in Greenpoint. Light and slightly tangy vanilla cupcakes are topped with a pale purple buttercream, flavored with black raspberries, a berry that's darker and slightly more tart than the familiar red raspberry.", "totalTime": "1 hour", "recipeYield": "Makes 24 cupcakes", "recipeCategory": ["Desserts", "Raspberry"], "recipeIngredient": ["<strong>Vanilla Cream Cheese Cupcakes</strong>", "4 cups / 570 g all-purpose flour", "4 teaspoons baking powder", "1 teaspoon kosher salt", "1 (8-ounce / 230 g) package cream cheese, at room temperature", "1 cup / 225 g unsalted butter, at room temperature", "2 1/2 cups / 500 g granulated sugar", "1/4 cup / 60 ml pure vanilla extract", "4 large eggs, at room temperature", "1/2 cup / 120 ml canola oil", "1/2 cup / 120 ml whole milk", " ", "<strong>Black Raspberry Buttercream</strong>", "3/4 cup / 90 g ripe black raspberries, plus 24 more, for garnish", "3/4 teaspoon finely grated lemon zest", "3/4 cup / 170 g unsalted butter, cubed and at room temperature", "6 cups / 680 g confectioner's sugar, divided", "3 to 6 tablespoons heavy whipping cream, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cupcakes, preheat the oven to 350°F / 180°C. Fill two 12-cup cupcake pans with paper liners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the flour, baking powder, and salt; set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, beat the cream cheese, butter, sugar, and vanilla until light and fluffy, 3 to 4 minutes. Beat in the eggs one at a time, mixing for 30 seconds between each addition; beat in the oil. Gradually beat in the flour mixture in 3 additions, alternating with the milk, and ending with the flour mixture. Do not overmix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter among the cupcake liners (they should be about two-thirds full). Bake until a toothpick inserted in the center of a cupcake emerges clean, 20 to 23 minutes. Transfer the cupcakes to a wire rack to cool completely before frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the buttercream, place the black raspberries and lemon zest in the bowl of a food processor and puree until smooth. Strain the pulp through a fine-mesh strainer into a medium bowl, pressing down on the solids with a spatula to extract as much puree as possible. Discard the seeds and set the puree aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the clean bowl of an electric mixer fitted with the paddle attachment, cream the butter with 1 1/2 / 300 g cups of the sugar and 2 tablespoons of the cream on low speed until combined. Beat in the remaining sugar and the raspberry puree until incorporated. Increase the mixer speed to medium-high and beat until the mixture is very light and fluffy, 3 to 4 minutes, Beat in additional cream, as needed, to achieve the desired consistency.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frost each cupcake generously with the buttercream and garnish each with a raspberry before serving.</p>"}]}