{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141215-waffled-sandwich-cookies-daniel-shumski.jpg", "author": {"@type": "Person", "name": "Daniel Shumski"}, "recipeCuisine": "", "keywords": ["cookie", "sandwich", "waffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Waffled Almond Sandwich Cookies", "link": "https://www.seriouseats.com/recipes/2014/12/waffled-sandwich-cookies-recipe.html", "description": "These buttery, lightly sweet almond cookies take a beautiful shape in the waffle iron. They're delicious filled with chocolate ganache, dulce de leche, jam, or lemon curd.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves about 4 (number of cookies varies depending on waffle iron)", "recipeCategory": ["Christmas", "Cookies", "Desserts", "Sandwiches"], "recipeIngredient": ["1 large egg yolk", "10 tablespoons unsalted butter, softened", "1/3 cup sugar", "1/4 teaspoon salt", "1 teaspoon vanilla extract", "1 1/4 cups all-purpose flour", "1/2 cup almond meal", "About 1 cup chocolate ganache, lemon curd, jam, or dulce de leche (amount will vary according to shape of cookies), for filling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer fitter with the whisk, beat egg yolk, butter, sugar, salt, and vanilla at medium speed until light and fluffy. Add flour and almond meal and mix at low speed until just combined. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the mixture on a sheet of plastic wrap and top with another piece of plastic wrap, pressing the dough into a disk that holds together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill in the refrigerator until firm, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Create a template for shaping the dough: With the waffle iron off, trace your waffle iron’s cooking surface on parchment paper and cut paper to size. (Don't worry if it's not precise.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the waffle iron. If it has temperature controls, set it to medium.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the refrigerator and place it on a very lightly floured surface. Using a rolling pin, roll it out to a rough oval about 1/4 inch thick. Lay the template over the dough and, using a sharp knife, cut out according to the template. Cut another template's worth of dough and then re-roll the scraps of dough and repeat. If there's not enough dough for the full template at the end, roll it to a thickness of 1/4 inch and use it as a test piece or a backup. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take one piece of the dough, brush off any flour clinging to it, place it on the waffle iron and cook until just golden brown, about 3 minutes. The cookies will be crumbly, so remove them carefully: Use a heatproof spatula to break the pieces into the smallest possible cohesive segment (wedge, square, etc.) so you dont have to support any more weight than necessary when removing from the waffle iron. (If small cracks develop, gently press together; the seam will fuse as it cools.) Set cookies on a wire rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat with remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble a cookie sandwich: Place a dollop of filling on one cookie and spread to the edges. Start with roughly 1 tablespoon , adding more if necessary. Top with another cookie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately or store in the refrigerator in an airtight container for up to 2 days. Return to room temperature before serving. </p>"}]}