{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140707-vibrant-food-bahn-mi-kimberly-hasselbrink2.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "Vietnamese", "keywords": ["bánh mì", "Cook the Book", "fish", "salmon", "sandwich", "seafood", "vibrant food", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salmon Banh Mi From 'Vibrant Food'", "link": "https://www.seriouseats.com/recipes/2014/07/salmon-bahn-mi-from-vibrant-food-kimberely-hasselbrink.html", "description": "Kimberley Hasselbrink's eye-catching bahn mi from her new cookbook, <a href=\"http://www.amazon.com/Vibrant-Food-Celebrating-Ingredients-Recipes/dp/1607745410/ /?tag=serieats-20\"><em>Vibrant Food</em></a> is super-appealing: she uses fish-sauce-marinated salmon instead of traditional pork, which lightens the sandwich while still providing a touch of fatty richness. It's a sandwich I can see myself making many more times this summer.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Salmon", "Sandwiches", "Vietnamese"], "recipeIngredient": ["<strong>Pickled Vegetables</strong>", "2 medium carrots ", "2 watermelon radishes (about 4 ounces total), or substitute daikon radish ", "1/3 English cucumber ", "1/2 cup distilled white vinegar ", "1/4 cup natural cane sugar ", "1/2 teaspoon fine sea salt ", " ", "<strong>Aïoli</strong>", "1/2 cup mayonnaise ", "1 small clove garlic, finely minced ", "Zest of 1/2 lemon ", " ", "<strong>Banh Mi</strong>", "1/4 cup boiling water ", "1/4 cup lightly packed brown sugar ", "1 tablespoon Sriracha chili sauce ", "1/4 cup fish sauce ", "1 teaspoon low-sodium tamari ", "3 cloves garlic, finely minced ", "16 ounces skinless wild salmon fillet (preferably thin), pinbones removed, cut into four equal pieces ", "1 French, Vietnamese, or gluten-free baguette, sliced crosswise into four equal pieces (about 5 to 6 inches long) ", "1/4 cup loosely packed fresh cilantro leaves ", "1/4 cup loosely packed fresh Thai basil leaves ", "1 small jalapeño, very thinly sliced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pickled vegetables, using a julienne slicer or a sharp knife, cut the carrots into long matchsticks. With a mandoline or the same sharp knife, slice the radishes as thinly as possible. Cut the cucumber diagonally into slices about 1/8-inch thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the white vinegar, sugar, and salt in a medium bowl, whisking vigorously until the sugar is dissolved, or nearly so. Add the carrots, radishes, and cucumbers. Stir and toss to evenly coat the vegetables. Set aside to pickle for 30 to 60 minutes. Once pickled, drain the vegetables and place them in an airtight container in the refrigerator until you are ready to serve. (You may have pickles left over; they will keep for up to 3 days.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the aïoli, combine the mayonnaise, garlic, and lemon zest in a small bowl. Cover and refrigerate for at least 20 minutes and up to 1 day to allow the flavors to meld. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the salmon, in a bowl, whisk together the boiling water and the brown sugar, stirring until the sugar dissolves. Add the fish sauce, Sriracha, tamari, and garlic and stir to combine. Set aside about 3 tablespoons of the marinade to drizzle over the sandwiches. Transfer the rest of the marinade to a shallow baking dish and let cool to room temperature. Place the salmon slices in the marinade, turning to coat both sides. Cover and refrigerate for about 1 hour, turning the salmon halfway through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the broiler. Remove the salmon from the marinade and place in a shallow dish. Broil 6 inches from the heat source for 6 to 8 minutes, until the salmon is golden brown and crisped at the edges. (Cooking time may be shorter with a thinner fillet.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the sandwiches, split a baguette piece and hollow out some of the bread. Spread both cut sides of the inside of the baguette with some of the aioli. Layer the bottom half of the sandwich with a generous quantity of the pickled vegetables, 1 tablespoon of the cilantro, and 1 tablespoon of the basil. Top with one piece of the salmon, breaking it into chunky pieces, and some of the jalapeño slices. Drizzle the salmon with some of the reserved marinade. Top with the baguette top. Repeat with the remaining ingredients to make three more sandwiches and serve immediately. </p>"}]}