{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140411-beef-and-broccoli-lomein-02.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["beef", "broccoli", "Chinese", "Chinese American", "easy", "noodle", "quick", "stir fry", "wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Stir-Fried Lo Mein With Beef and Broccoli", "link": "https://www.seriouseats.com/recipes/2014/04/stir-fried-lo-mein-beef-broccoli-recipe.html", "description": "Beef and broccoli might only be a classic combination in the American Chinese repertoire, but that doesn't make it any less delicious. In most restaurants, you'll find it served with rice, but I like to stir-fry it with hearty lo mein noodles.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Broccoli", "Chinese", "Mains", "Noodles", "Stir Frying"], "recipeIngredient": ["<strong>For the Beef:</strong>", "1/2 pound flank or skirt steak, <a href=\"http://www.seriouseats.com/2010/11/knife-skills-how-to-cut-beef-for-stir-fries.html\">sliced thin for stir-frying</a>", "1/4 teaspoon salt", "1/4 teaspoon sugar", "1/8 teaspoon ground black pepper", "1/2 teaspoon Shaoxing wine", "1/2 teaspoon light soy sauce", "1 teaspoon oil", "1/2 teaspoon cornstarch", " ", "<strong>For the Sauce:</strong>", "1 tablespoon sesame oil", "2 teaspoon light soy sauce", "2 teaspoon dark soy sauce", "1 tablespoon of oyster sauce", "1/4 teaspoon salt", "1/4 teaspoon sugar", "1 teaspoon Shaoxing wine", "1 tablespoon water", " ", "<strong>For the Noodles:</strong>", "Kosher salt", "1 pound fresh lo mein noodles", "4 tablespoons vegetable oil", "1/2 pound broccoli, cut into bite-sized florets", "3 medium cloves garlic, finely minced (about 1 tablespoon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Beef:</strong> Combine beef, salt, sugar, pepper, wine, soy sauce, oil, and cornstarch in a small bowl and toss with fingers to coat. Set in refrigerator to marinate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> While the beef marinates, combine sesame oil, light and dark soy sauces, oyster sauce, salt, sugar, wine, and water in a small bowl. Stir with a fork and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Noodles:</strong> Bring a large pot of salted water to a boil. Add noodles and cook, stirring with chopsticks, until al dente, about 3 minutes. Drain in a colander and run under cold water until chilled. Drain well and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, heat 2 tablespoons oil in a wok over high heat until smoking. Add beef, spread it out with a spatula, and cook without moving until lightly browned, about 1 minute. Toss and cook, stirring frequently, until almost cooked through, about 2 minutes total. Transfer to a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add another tablespoon oil to the wok and heat over high heat until smoking. Add the broccoli and season with a couple pinches of salt. Cook, stirring, until very lightly browned, about 30 seconds, then add 1/4 cup water. Cook, stirring, until broccoli is steamed and water has evaporated, about 2 minutes. Transfer to bowl with beef.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining tablespoon oil over high heat until smoking. Add the noodles. Using tongs or chopsticks, cook the noodles, stirring and mixing constantly until the noodles are coated in oil, about 1 minute. Add the sauce and continue cooking, stirring constantly, until the sauce coats the noodles, about 1 minutes longer. Add the garlic, broccoli, and beef and continue cooking until combined and fragrant, about 1 minute longer. Serve immediately.</p>"}]}