{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140227-284260-cook-the-book-velvety-menorcan-fish-soup.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "soup", "spain"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Velvety Menorcan Fish Soup (Caldereta de Pescado) From 'Spain'", "link": "https://www.seriouseats.com/recipes/2014/02/velvety-menorcan-fish-soup-caldereta-de-pescado-from-spain.html", "description": "<a href=\"http://jeff-koehler.com/?page_id=2\" target=\"_blank\">Jeff Koehler</a>'s fish soup from his new cookbook, <em><a href=\"http://www.amazon.com/Spain-Recipes-Traditions-Verdant-Andaluc%C3%ADa/dp/0811875016/?tag=serieats-20\" target=\"_blank\">Spain</a></em>, is based on a classic dish from the island of <strong><a href=\"http://en.wikipedia.org/wiki/Minorca\" target=\"_blank\">Menorca</a></strong>. Traditionally prepared in a deep cazuela and enriched with saffron and the roe of spiny lobsters, this style of soup is fragrant and truly velvety. Spiny lobsters are hard to find outside of Spain and they have a sliver of a short season, so Koehler has shared instead a twist on the soup that can be eaten year-round, anywhere in the world.", "totalTime": "About 1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Fish", "Mains", "Soups and Stews"], "recipeIngredient": ["2 pounds (910 g) small soup fish or assorted heads and bones of a firm, white-fleshed non-oily fish", "1 medium bream, sea bass, or red snapper, cleaned", "2 medium leeks, white and tender green parts only, finely chopped", "2 medium onions, finely chopped", "1 celery stalk, finely chopped", "3 tablespoons extra-virgin olive oil", "1 carrot, finely chopped", "2 medium ripe tomatoes, peeled, seeded, and chopped", "1/4 cup (60 ml) dry white wine", "1/2 teaspoon Spanish pimenton dulce (sweet paprika)", "1 small pinch saffron threads, dry-toasted and ground (see note)", "Salt and freshly ground black pepper", "Dense country bread, preferably one or two days old, for garnishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse all the fish and put them in a large stock or soup pot. Add half of the leeks, half of the onions, and the celery; cover with 8 cups/2 L water, and bring to a gentle boil over medium-high heat. Cover the pot, reduce the heat to medium-low, and gently boil for 20 minutes, until the essence of the sea has been poached from the fish. Strain, reserving the liquid. Remove the bream and any larger fish; skin, debone, and flake the meat. Set aside. Discard the vegetables and remaining fish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a deep cazuela, Dutch oven, or large, heavy pot, heat the olive oil over medium heat and prepare a sofrito: Add the remaining leeks and onions and cook until they are pale and tender, about 8 minutes. Add the carrot and cook until it has softened somewhat and turned a yellowish orange color, about 8 minutes. Add the tomatoes and cook until pulpy and darker red, about 10 minutes, adding in a few tablespoons of simmering stock from time to time to keep it moist. Add the wine and cook for 2 minutes to burn off the alcohol. Stir in 1 cup/240 ml of the reserved stock, lower the heat, and simmer until the carrot is very tender and the sauce has concentrated down, about 15 minutes. Pass the sauce through a food mill and return it to the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the remaining 7 cups/1.76 L reserved stock. Add the pimentón and saffron and season with salt and pepper. Bring to a simmer over medium heat and simmer uncovered for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, preheat the broiler. Slice the bread as thinly as possible. Arrange it on a baking sheet, and place under the broiler until golden and toasted. Transfer to a bread basket.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat and sprinkle the reserved flaked fish into the pot. Cover the pot for 1 to 2 minutes before ladling the soup into bowls and serving with the toast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> To dry toast the saffron, heat a small ungreased skillet over medium-low heat, add the saffron threads, and toast for 2 to 3 minutes, or until aromatic and the threads have turned a shade darker in color. Place the toasted threads in a small sheet of paper that has been folded in half, crumble with your fingers—be sure they are dry—from the outside, and then shake the saffron from the paper into the dish (this prevents any saffron from sticking to your fingers). Alternatively, transfer the toasted threads from the skillet to a mortar, pound into a powder, and add to the dish. Swirl 2 tablespoons water in the mortar to get all of the crushed saffron.</p>"}]}