{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140716-smores-BlendedGrahamFlourMixture-ideas-in-food.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["cake", "chocolate", "dessert", "graham cracker", "ideas in food", "marshmallow"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Chocolate Mousse and Marshmallow Icing S'mores Cake", "link": "https://www.seriouseats.com/recipes/2014/07/smores-cake-chocolate-mousse-dulce-de-leche-marshmallow-ideas-in-food-recipe.html", "description": "Borrowing all the classic flavors of a campfire s'more, the Ideas in Food team creates a graham cracker cake that's flavored with browned butter, layered with a dulce de leche-spiked chocolate mousse, and topped with a toasted bourbon-marshmallow icing.", "totalTime": null, "recipeYield": "Makes 1 large 9-inch cake", "recipeCategory": ["Cakes", "Chocolate", "Desserts"], "recipeIngredient": ["<strong>For the Graham Cracker Cake:</strong>", "250 grams unsalted butter (about 2 sticks plus 1 3/4 tablespoons), sliced, plus more for greasing", "150 grams graham crackers (about 10 whole crackers)", "450 grams sugar", "300 grams cake flour", "30 grams baking powder", "3 grams fine sea salt", "260 grams room temperature whole milk", "145 grams buttermilk", "10 large egg yolks, whites reserved for Bourbon Marshmallow (see below)", "12 grams vanilla paste", "&nbsp;", "<strong>For the Caramelized Condensed Milk (AKA Dulce de Leche):</strong>", "1 (396-gram) can condensed milk (see note)", "&nbsp;", "<strong>For the Blender Chocolate Mousse:</strong>", "4 large eggs", "500 grams heavy cream", "1 (396-grams) can Caramelized Condensed Milk, from above", "6 grams fine sea salt", "750 grams bittersweet chocolate chips", "&nbsp;", "<strong>For the Bourbon Marshmallow Topping:</strong>", "10 large egg whites, reserved from above", "2 grams cream of tartar", "2.5 grams salt", "200 grams corn syrup", "50 grams water", "300 grams sugar", "30 grams bourbon", "5 grams vanilla paste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Graham Cracker Cake:</strong> Preheat oven to 350&deg;F. Butter an 18-by-13-inch rimed baking sheet and line it with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, melt butter over medium heat, stirring occasionally, until foamy. Reduce heat to low and cook, stirring constantly, until butter begins to turn golden brown and exudes a nutty aroma. Remove brown butter from heat immediately and set aside to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crumble graham crackers into a food processor. Pulse until they form fine crumbs, about 30 seconds. Add sugar, cake flour, baking powder, and salt and process until smooth, about 20 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together milk, buttermilk, egg yolks, and vanilla in a large bowl until smooth. Combine with graham-cracker crumbs in food processor and process until a smooth batter forms, about 30 seconds. Drizzle in cooled brown butter, scraping in the browned butter solids, and process batter for another 30 seconds. Pour batter into the prepared baking sheet and, using an offset spatula, spread it evenly. Bake until cake springs back lightly when the center is gently pressed with a fingertip or a cake tester inserted in the center of the cake comes out clean, about 30 minutes. Let the cake cool completely at room temperature in the baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Caramelized Condensed Milk:</strong> Put 2 inches of water in bottom of a pressure cooker and add a small rack (the rack is usually included with every pressure cooker). Put condensed milk on the rack and seal lid. Cook at high pressure for 90 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow pressure to release naturally. Prepare an ice bath. Once depressurized, open lid and, using tongs, transfer can of caramelized condensed milk to ice bath. Let chill for at least 1 hour, adding more ice as needed, until completely cool: <strong>Do not open can while hot because a hot can of caramelized condensed milk is still under pressure and can erupt.</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Blender Chocolate Mousse:</strong> Put eggs in a blender. Combine heavy cream, cooled caramelized condensed milk, and salt into a medium pot set over medium heat, stirring to dissolve condensed milk into cream. When cream mixture comes to a boil remove pot from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn blender to low speed and immediately drizzle hot cream mixture into eggs. Increase speed to medium and continue to blend. With the blender still running, add chocolate chips, a few tablespoons at a time, and puree until fully melted; increase blender speed as needed to keep chocolate mousse in motion. Turn blender off and pour chocolate mousse into a large baking dish. Cool chocolate mousse in the refrigerator, uncovered, for at least 4 hours. When cold, cover with plastic wrap, and reserve until you are ready to assemble the cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Pre-Assemble Cake:</strong> Turn cooled Graham Cracker Cake out onto a work surface. Using the bottom of a 9-inch spring-form cake pan as a guide and a knife, trace 2 circles and 2 semicircles into the cake. Cut the traced patterns out. Assemble spring-form pan and tighten the spring. Arrange the two semi-circle cake pieces in the bottom of the pan to form one complete circle of cake, using pieces of cake trim, as needed, to fill any gaps between the semi-circles. Spread  about 1/3 of Chocolate Mousse over the bottom cake layer. Top mousse layer with 1 circle of cake and spread half of the remaining mousse on top. Add the third layer of cake and top with the remaining chocolate mousse; it may come up over the top of the cake pan but will set as it chills. Cover loosely with plastic wrap and refrigerate until set, at least 1 hour and up to 12 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bourbon Marshmallow Topping:</strong> Prepare the Marhsmallow Topping at least 2 hours before you want to serve the cake. Mix egg whites, cream of tartar, and salt at low speed in a stand mixer fitted with the paddle until egg whites break apart. Let the mixer continue to work at low speed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine corn syrup, water, and sugar in a medium saucepan, swirling slightly to fully moisten sugar. Cover saucepan, set over medium-high heat, and cook until sugar is dissolved, about 5 minutes. Uncover saucepan and cook until syrup registers 235&deg;F (113&deg;C) on a candy thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fit stand mixer with whisk, then turn speed to medium and whip egg whites until soft peaks form. Ideally syrup will reach 235&deg;F (113&deg;C) at the same time as egg whites reach soft peak; if whites appear to be going too fast, turn the mixer off until syrup is approach final temperature; if syrup gets too hot too quickly, pull it from the heat and then bring it back to the final temperature when whites are at soft peak.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn stand mixer to low and drizzle hot syrup into egg whites, trying to drizzle directly onto egg whites and not onto whisk or down the side of the bowl. Increase speed to medium-high and pour in bourbon and vanilla paste. Continue to whip meringue until room temperature, about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish Cake Assembly:</strong> Remove cake from refrigerator and release and remove outer ring of spring-form pan. Carefully transfer the cake to a platter. Using a large offset spatula, spread the Bourbon Marshmallow Topping all over top and side of cake. Refrigerate cake for at least 1 hour to allow meringue to set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cake from the refrigerator and, using a butane torch, caramelize topping all over. Slice and serve.</p>"}]}