{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140824-Stuffed-aChicken-Butterflying-Process-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["andouille", "cajun", "chicken", "creole", "rice", "shrimp", "stuffed chicken breast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Andouille- and Rice-Stuffed Chicken Breasts With Creamy Creole Shrimp Sauce", "link": "https://www.seriouseats.com/recipes/2014/08/andouille-rice-stuffed-chicken-breasts-creole-shrimp-sauce-recipe.html", "description": "These plump chicken breasts are stuffed with an andouille-spiked rice and vegetable mixture, then topped with a creamy Creole shrimp sauce.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "Rice", "Shrimp"], "recipeIngredient": ["<strong>For the Chicken and Filling:</strong> ", "1 tablespoon extra-virgin olive oil", "1 stalk celery, finely chopped", "1 medium yellow onion, finely chopped", "6-ounces andouille or other smoked sausage, such as kielbasa, finely chopped", "1/4 roasted red peppers, finely chopped", "1 1/2 teaspoons Creole or Cajun seasoning", "Kosher salt and freshly ground black pepper", "3/4 cup cooked white rice", "4 boneless, skinless chicken breast halves", "<strong>For the Sauce:</strong> ", "1 1/2 tablespoons extra-virgin olive oil", "2 medium cloves garlic, minced", "1/2 cup dry white wine", "1 (14.5-ounce) can pureed tomatoes", "1 cup heavy cream", "2 bay leaves", "2 teaspoons Creole or Cajun seasoning", "1/2 tablespoon Worcestershire sauce", "2 teaspoons Louisiana-style hot sauce", "Kosher salt", "1/2 pound raw shelled and deveined shrimp, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chicken and Filling:</strong> Heat olive oil in a medium skillet over medium-high heat until shimmering. Add celery and onion and cook, stirring often, until nearly softened, 4 to 5 minutes. Add sausage and cook until meat is lightly browned, 3 to 4 minutes. Stir in roasted peppers and Cajun seasoning cook until warmed through. Season with salt and pepper. Divide sausage mixture in 2 equal portions, reserving 1 portion for later use. Add rice to remaining portion, stir to combine, and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, butterfly the chicken breast halves: Slice along the length of each breast, and, working parallel to the cutting board, continue slicing until nearly all the way through (but not completely), so that each breast opens like a book. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set each butterflied chicken breast half on a sheet of plastic wrap. Cover with another sheet of plastic wrap and, using a meat pounder, pound each breast to a 1/4-inch thickness. Remove plastic and trim each chicken breast to form an even rectangle. Spread 2 tablespoons of sausage-rice filling over each chicken breast, leaving a 1/4-inch border around the edges. Roll each breast lengthwise and secure at 3/4-inch intervals with kitchen twine. Season chicken all over with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Heat olive oil in a Dutch oven over medium-heat until shimmering. Sear chicken rolls on all sides until brown, about 5 minutes. Transfer meat to a platter and reserve. Reduce heat to medium and add reserved sausage mixture and garlic and cook for 2 minutes. Add wine, scraping the bottom of the Dutch oven with a wooden spoon to loosen any browned bits, and bring sauce to a boil. Reduce heat and simmer for 3 minutes. Stir in tomatoes, heavy cream, bay leaves, Cajun seasoning, and Worcestershire and hot sauces. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return chicken to Dutch oven. Reduce heat to low and continue to cook until an instant-read thermometer registers 150&deg;F (or 160&deg;F if you want to follow USDA guidelines) when inserted into the center of chicken rolls, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to a clean plate and let rest. Add shrimp to sauce and cook until just cooked through, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cool enough to handle, cut and discard twine. Discard bay leaves. Serve chicken immediately, topped with shrimp sauce.</p>"}]}