{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140201-vegan-mushroom-soup-creamy-food-lab-13.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["mushroom", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Vegan Cream of Mushroom Soup With Crispy Shiitake Chips", "link": "https://www.seriouseats.com/recipes/2014/02/vegan-cream-of-mushroom-soup-food-lab-recipe.html", "description": "100% vegan cream of mushroom soup that's every bit as rich and satisfying as a cream-based version, with brighter flavor and a more mushroomy intensity.", "totalTime": "50 minutes", "recipeYield": "Makes about 1 1/2 quarts, serving 4 to 6", "recipeCategory": ["Dairy-Free", "Mushrooms", "Soups and Stews", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 ounce dried porcini or morel mushrooms (optional)", "1 quart <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">Hearty Vegan Stock</a> or store-bought vegetable broth", "7 tablespoons olive oil, divided, plus more for serving", "1 large leek, white and light green parts only, thinly sliced (about 3/4 cup)", "1 small onions, thinly sliced (about 3/4 cup)", "3 medium cloves garlic, thinly sliced (about 1 tablespoon)", "1 pound white button mushrooms, thinly sliced", "12 ounces shiitake mushrooms, thinly sliced, divided", "1 tablespoon all-purpose flour", "1 tablespoon soy sauce", "1 tablespoon miso paste", "1 cup dry sherry or white wine", "6 sprigs fresh thyme", "2 bay leaves", "2 slices vegan white sandwich bread, crusts removed, bread torn into pieces", "2 tablespoons vegetable or canola oil", "Kosher salt and freshly ground black pepper", "1/4 cup thinly sliced scallions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using dried mushrooms, place in a large bowl and add vegetable stock. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons olive oil in a large saucepan over medium-low heat until shimmering. Add leeks, onions, and garlic and cook, stirring frequently, until softened but not browned, about 8 minutes. Add button mushrooms and 8 ounces of shiitake mushrooms and cook, stirring frequently, until excess liquid evaporates and mushrooms start to sizzle, about 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add flour and stir to incorporate. Cook for 30 seconds. Add sherry or white wine and cook, stirring constantly and scraping bottom of pan, until thick and syrupy, about 1 minute. Add soy sauce and miso and stir to incorporate. Add broth and soaked mushrooms. Add bay leaves and thyme sprigs. Bring soup to a simmer and adjust heat to maintain a bare bubble. Let simmer for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the shiitake chips. Combine remaining sliced shiitake mushrooms with the vegetable oil in a medium non-stick skillet. Heat over medium-low heat and cook, flipping mushrooms and stirring frequently, until dehydrated and well-browned. Transfer to a paper towel-lined plate with a slotted spatula and season immediately with salt. Let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add torn bread slices to soup and soak for 30 seconds. Discard bay leaves and thyme and transfer soup to a blender. Close blender and blend, starting on low speed and slowly getting faster. Once blender is at full speed, slowly drizzle in remaining olive oil. Continue blending until completely smooth. Rinse out pot and pour soup back into it through a chinois or fine mesh strainer. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve soup topped with crispy shiitake mushrooms, scallions, and a drizzle of extra-virgin olive oil</p>"}]}