{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20130102-meat-lite-pork-sausage-patties-cabbage-primary.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["cabbage", "easy", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Sausage Patties With Braised Cabbage and Apples", "link": "https://www.seriouseats.com/recipes/2014/01/meat-lite-pork-sausage-patties-braised-cabbage-apple-recipe.html", "description": "Humble braised cabbage might not win any beauty contests, but when it's made with care and enlivened with a few key aromatics, it's actually a subtly complex side dish. Sweetened with soft apples and onions and rounded out with nutty caraway seeds, bright apple cider vinegar, a hint of sugar and fragrant fresh dill, this is one cabbage dish you'll want to heap on the plate. Here, it's served with fast-cooking, easy to whip up homemade pork sausage patties that are full of flavor from shallots, garlic, fennel seeds, and chile flakes, with a dash of dry sherry for added moisture.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cabbage", "Mains", "Pork"], "recipeIngredient": ["<strong>For the Sausage</strong>:", "1 1/2 pounds ground pork", "1 medium shallot, minced (about 1/2 cup)", "3 cloves garlic, minced (about 3 teaspoons)", "1 tablespoon fennel seeds, lightly crushed in a mortar and pestle or under a skillet", "1 teaspoon mustard powder", "1/2 teaspoon crushed red pepper flakes", "1 tablespoon dry sherry or white wine", "Kosher salt and freshly ground black pepper", "1 teaspoon vegetable oil", " ", "<strong>For the Cabbage</strong>:", "2 tablespoons unsalted butter", "1 large onion, thinly sliced (about 1 1/2 cups)", "3 small cooking apples, such as Granny Smith or Pink Lady, peeled, cored, and cut into slices lengthwise (about 3 1/2 cups)", "1 small but heavy green cabbage, outer leaves removed, cored and sliced (about 5 cups)", "2 tablespoons apple cider vinegar", "1 tablespoon sugar", "1 teaspoon caraway seeds", "Kosher salt and freshly ground black pepper", "1/4 cup chopped fresh dill leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sausage</strong>: Combine pork, shallot, garlic, fennel seeds, red pepper, sherry, and plenty of salt and pepper in a large bowl. Using your hands, knead to combine. Break off a teaspoon-sized piece and either microwave on a plate for 15 seconds or cook in a small skillet until cooked through to taste for seasoning. Add more salt and pepper as necessary, then shape meat into 8 even 1-inch thick patties. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cabbage</strong>: Heat butter in a Dutch oven over medium heat until foaming. Add onion and apples and cook, stirring, until slightly wilted, about 5 minutes. Add cabbage, vinegar, sugar, caraway and salt and pepper to taste, stir to combine, and cover. Reduce heat to low and cook, stirring occasionally, until cabbage has softened, about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While cabbage is cooking, cook sausage patties: adjust oven rack to middle position and preheat oven to 350°F. Heat vegetable oil in a large cast iron skillet over medium heat until shimmering. Cook, turning once, until well-browned on both sides, about 12 minutes. Transfer skillet to oven to cook sausage through, about 8 minutes more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, stir dill into cabbage and arrange on a platter with sausage patties. </p>"}]}