{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140721-meatballs-carinaromano.jpg", "author": {"@type": "Person", "name": "Sarah Grey"}, "recipeCuisine": "Italian", "keywords": ["easy", "Italian", "italian american", "meatball", "pasta", "red sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "5"}, "name": "Super-Simple Friday Night Meatballs", "link": "https://www.seriouseats.com/recipes/2014/09/super-simple-friday-night-meatballs-recipe.html", "description": "So many readers asked for the meatball recipe from my husband, Joe Cleffie, that we had to oblige. After making a few small tweaks for foolproofing and streamlining, we're proud to present it here. This isn't the most complicated meatball recipe around&mdash;quite the opposite, in fact. Our goal here is a recipe that anyone can make, no practice required, and get great results. I hope it inspires a thousand dinners in communities worldwide.", "totalTime": "2 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Beef", "Italian", "Mains", "Pasta", "Recipes"], "recipeIngredient": ["<strong>For the Sauce:</strong>", "2 (28-ounce) cans peeled whole tomatoes", "2 tablespoons (30ml) extra-virgin olive oil", "6 to 8 cloves minced garlic (about 2 tablespoons)", "1 (6-ounce) can tomato paste", "Kosher salt and freshly ground black pepper", "<strong>For the Meatballs:</strong>", "4 slices bread, crusts removed", "2 eggs", "2 pounds (900g) 80/20 ground beef", "1 1/2 tablespoons adobo seasoning (such as <a href=\"http://www.amazon.com/Goya-Adobo-Purpose-Seasoning-Ounces/dp/B001TA9MDQ/?tag=serieats-20\">Goya</a>); see note", "1/2 cup minced fresh parsley leaves, divided", "Kosher salt and freshly ground black pepper", "Olive oil, for frying", "Pasta and grated Parmesan cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Crush tomatoes by hand, with a food mill, or in a food processor to form a very rough purée. Heat oil in a large Dutch oven over medium heat until shimmering. Add garlic and cook, stirring, until softened but not browned, about 1 minute. Add tomato paste and cook, stirring, until fragrant, about 1 minute longer. Add crushed tomatoes, bring to a simmer, cover, and reduce heat to low. Season lightly with salt and pepper. Meanwhile, make the meatballs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meatballs:</strong> Tear bread into rough chunks and pulse in the food processor until reduced to fine crumbs. Transfer to a large bowl. Add eggs and mix with your hands until combined. Add beef, adobo seasoning, and half of parsley. Combine mixture with your hands, working bread crumbs into meat until meat mixture can form a ball that holds together when tossed back into the bowl. Do not over-mix.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a small amount of mixture on a microwave-safe plate and microwave on high until cooked, about 20 seconds. Taste and add salt and/or pepper to mixture to taste. Using wet hands, form mixture into balls of roughly 2 tablespoons each, about 1 1/2 to 2 inches across. Place balls on a large parchment- or wax paper&ndash;lined tray as you work.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough oil to a large cast iron or stainless steel sauté pan to form a thin layer across the bottom. Heat over medium-high heat until shimmering. Add as many meatballs as will fit in a single layer and cook until well browned on first side. Gently turn balls with tongs or a thin metal spatula and continue cooking and turning until well browned on all sides. As meatballs finish browning, add them to the pot of sauce and replace them with raw meatballs. Continue, adding more oil as necessary, until all meatballs are browned and in the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer over low heat for 1 hour. Season to taste with salt and pepper and stir in remaining fresh parsley. Serve with pasta and grated Parmesan cheese.</p>"}]}