{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141218-spiced-nuts-daniel-gritzer-22.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["appetizer", "cashew", "holiday", "hors d'oeuvre", "nut", "olive", "rosemary", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Olive-Rosemary Spiced Cashews", "link": "https://www.seriouseats.com/recipes/2014/12/olive-rosemary-cashews-nuts-nuts-recipe.html", "description": "The savory Mediterranean flavors of olive and rosemary make these roasted cashews an addictive snack.", "totalTime": "50 minutes", "recipeYield": "Makes 4 cups", "recipeCategory": ["Christmas", "Nuts", "Olives", "Snacks"], "recipeIngredient": ["4 large sprigs fresh rosemary", "1/3 cup pitted oil cured olives", "1/4 cup water", "1/4 cup sugar", "1/4 teaspoon cayenne pepper", "Generous pinch kosher salt", "4 cups raw cashews (about 1 pound)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F, position rack in middle position, and grease a rimmed baking sheet with oil or nonstick cooking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a heatproof plate with a paper towel, arrange rosemary sprigs (making sure they are dry) on top, and top with another sheet of paper towel. Microwave on high until rosemary is completely dry, 1 to 2 minutes (keep an eye on it as it can quickly burn if continued to cook after drying). Remove rosemary needles from sprigs, discarding woody stalks, and pulverize needles in a mortar and pestle to a powder. Sift dried rosemary powder through a fine mesh strainer into a small bowl to remove any remaining large pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange olives on a heatproof plate and microwave at half power until dried, about 5 minutes (keep an eye on them as they cook as they can burn quickly if continued to cook after drying). Transfer dried olives to a mortar and pestle and pulverize to an oily paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine water, sugar, cayenne, and salt. Heat over medium-high heat until sugar is dissolved. Stir in cashews and continue to cook, stirring, until cashews are coated in a syrupy glaze and almost all water has cooked off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread glazed cashews in a single even layer on the prepared baking sheet and bake until nuts are lightly toasted, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool, stirring nuts every few minutes to prevent sticking. Once cool, break up any remaining clumps. Add olive paste and stir to coat nuts. Add 4 teaspoons rosemary powder and stir to coat (any remaining powder can be discarded or reserved for another use). Serve. Nuts can be stored in an airtight container at room temperature for up to 1 week.</p>"}]}