{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140113-black-bean-chicken-soup-recipe-13.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["bean", "braise", "chicken", "chipotle", "cinco de mayo", "Mexican", "soup", "stew", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Black Bean Soup With Chorizo and Braised Chicken", "link": "https://www.seriouseats.com/recipes/2014/01/the-food-lab-black-bean-chicken-soup-recipe.html", "description": "A hearty bean and chicken stew flavored with chorizo and chipotle chilies. It takes a little time for the flavors to come together, but the process is easy and the results are worth the wait.", "totalTime": "2 hours, plus overnight to soak the beans", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Braising and Stewing", "Chicken", "Mains", "Mexican", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["1 pound dried black beans", "Kosher salt", "2 pounds chicken drumsticks or thighs", "Freshly ground black pepper", "1 tablespoons canola or vegetable oil", "6 ounces smoked Mexican or Spanish chorizo, cut into 1/4-inch slices", "8 scallions, finely sliced, greens and whites reserved separately", "2 Serrano peppers, 1 finely chopped (about 2 tablespoons), the other thinly sliced for garnish", "4 medium cloves garlic, minced (about 4 teaspoons)", "2 teaspoons ground cumin", "2 whole chipotle peppers in adobo sauce, finely minced, plus 1 tablespoon sauce from can", "1 1/2 quarts low sodium store-bough or homemade chicken broth", "2 bay leaves", "Sliced avocado, for serving", "Fresh cilantro leaves, for serving", "Sour cream or Mexican-style crema, for serving", "1 lime, cut into 8 wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place black beans in a large bowl and cover with 1 gallon of water. Add 3 tablespoons salt and stir until dissolved. Cover and set aside at room temperature overnight. (See note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, season chicken on all sides with salt and pepper. Heat oil in a large Dutch oven or saucepot over medium-high heat until shimmering. Add chicken and cook without moving until well browned on first side, about 5 minutes. Flip chicken and cook until second side is browned, about 3 minutes longer. Remove chicken from pot with tongs and set aside on a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chorizo to pot and cook, stirring occasionally, until chorizo is crisp and starting to char, about 4 minutes. Add scallion whites, chopped Serrano, and garlic. Cook, stirring and scraping up browned bits from bottom of pan until fragrant, about 2 minutes. Add cumin and cook, stirring, until fragrant, about 30 seconds. Add chopped chipotles and their sauce and cook, stirring until fragrant, about 1 minute. Add broth and bay leaves. (If using canned beans, see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain and rinse beans and add to pot. Nestle chicken pieces into beans. Bring to a boil, reduce to a bare simmer and cook, uncovered, stirring occasionally, until beans and chicken are tender, 45 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and discard bay leaves and skins from chicken. Using a ladle, carefully transfer 2 cup of beans and chorizo with liquid to a blender. Blend on high speed until completely smooth, about 1 minute. Stir mixture back into pot. (If a thicker soup is desired, repeat this process until it as thick as desired)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve chicken and beans with cilantro, scallion greens, lime wedges, sliced Serrano peppers, and sour cream at the table for garnish.</p>"}]}