{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/021014-taiwan-eats-braised-cabbage-finished.jpg", "author": {"@type": "Person", "name": "Cathy Erway"}, "recipeCuisine": "Chinese", "keywords": ["cabbage", "Chinese", "easy", "mushroom", "quick", "shiitake", "shrimp", "taiwanese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Taiwanese Braised Cabbage With Dried Shrimp, Chilies, and Shiitake Mushrooms", "link": "https://www.seriouseats.com/recipes/2014/02/taiwan-eats-braised-cabbage-dried-shrimp-chilies-shiitake-mushroom-recipe.html", "description": "Soupier than the average sauté, this braised vegetable side course is great for pooling atop plain rice, lending subtle flavor to the entire bowl.", "totalTime": "35 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Braising and Stewing", "Cabbage", "Chinese", "Mains", "Mushrooms", "Shrimp"], "recipeIngredient": ["4 to 5 dried shiitake mushrooms", "2 tablespoons dried baby shrimp", "1 head Taiwanese cabbage (or substitute with green or Savoy cabbage), about 2 pounds", "2 tablespoons vegetable, peanut, or canola oil", "3 medium cloves garlic, minced (about 1 tablespoon)", "2 small, fresh red chilies, such as Thai chilies, thinly sliced", "1/4 teaspoon white pepper", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the dried shiitake mushrooms in 2 cups water until all the mushrooms are soft throughout, about 20 minutes. Reserve soaking liquid (strain out any crumbs or solids at the bottom if necessary). Squeeze out the mushrooms and remove its stems. Slice the caps thinly and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Soak the dried baby shrimp in just enough water to cover until slightly more soft and moist, about 10 minutes. Drain and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the cabbage head in halves, then quarters. Cut out the tough stem portions and discard. Coarsely shred the remaining leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large pan or wok with a lid over medium-high heat. Add the garlic, chilies, dried shrimp, and sliced shiitake mushrooms. Stir until very fragrant, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cabbage to the pan along with the white pepper and a pinch of salt. Toss occasionally, until its volume has decreased slightly and the oil and other ingredients are incorporated throughout, 1 to 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour in the reserved soaking liquid from the mushrooms and stir. Cover the pan and reduce heat slightly. Let cook, covered and at a steady simmer, for 5 to 6 minutes. Check on the dish; once the leaves are fully wilted and translucent, remove lid. Taste and season with salt as desired. Remove from heat and serve immediately.</p>"}]}