{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140117-279648-cook-the-book-glazed-winter-vegetables-chestnuts-caper-berries.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["cauliflower", "chestnut", "Cook the Book", "feast", "olive", "parsnip", "root vegetable", "turnip", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Glazed Winter Vegetable Medley With Chestnuts and Caper Berries From 'Feast'", "link": "https://www.seriouseats.com/recipes/2014/01/glazed-winter-vegetable-medley-with-chestnuts-recipe-from-feast-cookbook.html", "description": "The final savory chapter in <a href=\"http://edibleliving.com/about/2/\" target=\"_blank\">Sarah Copeland</a>'s new cookbook, <em><a href=\"http://www.amazon.com/Feast-Generous-Vegetarian-Meals-Appetite/dp/1452109737/?tag=serieats-20\" target=\"_blank\">Feast</a></em>, focuses on a few larger, celebration-sized meals. These recipes take a bit longer to prepare than those in the rest of the book, requiring more attention to detail, but they're worth the time&mdash;think paella, vegetable tagine, and silky (bread crumb-free) eggplant parmesan. Her glazed winter vegetable medley is the centerpiece of the chapter.", "totalTime": "About 1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Cauliflower", "Cook the Book", "Mains", "Nuts", "Olives", "Vegetarian"], "recipeIngredient": ["12 fingerling potatoes, halved lengthwise ", "4 tablespoons (60 ml) extra-virgin olive oil ", "Sea salt and freshly ground pepper ", "1/2 head cauliflower, cut into large florets ", "4 large shallots, quartered ", "6 tablespoons (85 g) unsalted butter ", "1 bunch golden beets, peeled and cut into bite-size pieces ", "1 bunch baby turnips, scrubbed and trimmed ", "1 bunch carrots, peeled and cut into bite-size pieces on the diagonal ", "2 parsnips, peeled, cored, and cut into bite-size pieces on the diagonal", "3 sprigs fresh thyme ", "1 to 1 1/2 cups (240 to 360 ml) vegetable stock or water ", "1/2 teaspoon unbleached raw sugar ", "5 oz (140 g) roasted peeled chestnuts (see Note) ", "Handful fresh parsley, finely chopped ", "Finishing oil for drizzling ", "Fleur de sel or sel gris ", "Handful caper berries ", "Oil-cured black olives or kalamata olives for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Toss the potatoes with 2 tablespoons of the olive oil in a large bowl. Season with salt and pepper and spread out on a baking sheet. Toss the cauliflower and shallots in the same bowl with the remaining 2 tablespoons olive oil, and spread out on a second baking sheet. Cover both baking sheets loosely with aluminum foil and roast until the vegetables are tender but with just a little browning, about 40 minutes, stirring with a wooden spoon as needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large, shallow straight-sided skillet, melt 2 tablespoons of the butter. Add the beets, turnips, carrots, and parsnips and toss to coat. Season with salt and pepper, add the thyme and enough stock to come about halfway up the vegetables (you want them to steam, not completely boil). Cover loosely with foil, bring to a simmer, and cook until the vegetables are tender and the stock reduced to 2 to 3 tablespoons of liquid, 10 to 12 minutes. Remove the foil and reduce the stock further, if needed. Set aside until the roasted vegetables are cooked. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the roasted vegetables are cooked, add 2 tablespoons butter and the sugar to the beets, turnips, carrots, and parsnips. Season with salt and pepper. Cook until heated through and glazed, about 4 minutes. Add the chestnuts and toss to glaze. And the roasted vegetables to the skillet and toss together with 2 tablespoons butter and parsley. Drizzle with finishing oil and season with fleur de sel and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide among bowls, making sure each one has an even mix of vegetables and chestnuts. Top with caper berries and olives. Serve warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: To roast fresh chestnuts (and you really should, at least once in your life), make a crisscross slit on the domed side of the chestnut with a thin, sharp knife. Roast at 425°F until the shells look as if they are about to peel off at the incision, about 20 minutes. Cool slightly and peel while warm. Eat, or add to a recipe as directed.</p>"}]}