{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140911-btb-glutenfreebrownies.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "brownie", "cheesecake", "gluten free", "the everyday art of gluten-free"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Marble Chocolate-Cheesecake Brownies From 'The Everyday Art of Gluten-Free'", "link": "https://www.seriouseats.com/recipes/2014/09/marble-chocolate-cheesecake-brownies-from-the-everyday-art-of-gluten-free.html", "description": "A dense, fudgy brownie seems easy enough to make without flour; after all, isn't there flourless chocolate cake? <em><a href=\"http://www.amazon.com/The-Everyday-Art-Gluten-Free-Fail-Proof/dp/1617690600/?tag=serieats-20\" target=\"_blank\">The Everyday Art of Gluten-Free</a></em> answers that question with marbled cheesecake brownies that are still plenty dense, but with a cake-like quality that supports the weight of a pound of cream cheese, thanks to author Karen Morgan's Cookie Jar Blend.", "totalTime": "1 hour 45 minutes", "recipeYield": "Makes 16 brownies", "recipeCategory": ["Bake the Book", "Brownies and Bars", "Gluten-Free"], "recipeIngredient": ["<strong>For the Brownie Batter:</strong>", "3/4 cup (82 g) Cookie Jar Blend (ingredients below)", "1/2 teaspoon plus a pinch of kosher salt", "1/2 teaspoon baking powder", "1/2 cup (84 g) semisweet chocolate chips", "1/2 cup (1 stick / 113 g) unsalted butter, plus more for the pan", "1/2 cup (110 g) packed light brown sugar", "1/2 cup (100 g) granulated sugar", "3 large eggs", "2 1/2 teaspoons pure vanilla extract", "<strong>For the Cream Cheese Marbling:</strong>", "1 pound (455 g) cream cheese, at room temperature", "1/4 cup (50 g) granulated sugar", "2 egg yolks", "2 teaspoons fresh lemon juice", "1/8 teaspoon kosher salt", "<strong>Cookie Jar Blend</strong>", "2 cups plus 1 tablespoon plus 1 teaspoon (240 g) glutinous rice flour", "1 1/2 cups plus 1 tablespoon plus 1 teaspoon (174 g) tapioca starch", "1 1/4 cups plus 2 teaspoons (156 g) cornstarch", "1 1/3 cups plus 1 teaspoon (150 g) sorghum flour", "1/4 cup plus 3 tablespoons (60 g) freshly ground gluten-free quick oats", "4 1/2 teaspoons (13.5 g) guar gum"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the Cookie Jar Blend: Using the spoon-and-sweep method, measure each ingredient into a large bowl. Whisk together and then sift the mixture into a separate large bowl. Repeat several times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F (175°C). Line an 8-inch (20-cm) square pan or a 9-by-13-inch (23-by-33-cm) jelly-roll pan with enough foil to give it a 1-inch (2.5 cm) overhang and then lightly grease the foil with butter or non-stick spray.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the brownie batter: In a large bowl, whisk together the Cookie Jar Blend, salt, and baking powder. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate chips in a large bowl and set them aside. In a small saucepan, melt the butter over medium-low heat. Pour the butter over the chocolate and let stand for 5 minutes to melt the chocolate. Whisk until smooth and well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk in the sugars, then the eggs, one at a time, whisking until each egg is incorporated before adding the next. Whisk in the vanilla. Add the dry mixture and whisk until the batter reaches the consistency of thick pudding. Pour the batter into the prepared pan and set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the cream cheese marbling: In the bowl of a stand mixer fitted with the paddle attachment, combine the cream cheese and sugar and whip on high speed until silky smooth, 1 to 2 minutes. Add the egg yolks, lemon juice, and salt and mix until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cream cheese mixture to a pastry bag fitted with a round tip and pipe a scalloped pattern over the chocolate. Alternatively, simply drop the cream cheese mixture over the chocolate batter in tablespoon-size portions. Using the tip of a knife, swirl the cream cheese mixture through the brownie batter to give it a marbled look.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the brownies for 25 to 30 minutes, until the edges have begun to pull away from the sides of the pan (bringing the foil with them). Allow the brownies to cool completely in the pan on a wire rack so they set. For best results, freeze the brownies for 30 minutes before slicing. I always get the cleanest cuts after my brownies are ice-cold. Use the foil to pull the brownie block out of the pan and cut into 16 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The brownies will keep in an airtight container in the fridge for up to 10 days, and in the freezer, double-wrapped, for up to 1 month.</p>"}]}