{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140321-green-chile-chorizo-hash-food-lab-610px-04.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["avocado", "breakfast", "brunch", "cast iron", "chili", "chorizo", "easy", "hash", "Mexican", "poblano", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "5"}, "name": "Crispy Potato, Chorizo, and Green Chili Hash With Avocado and Eggs", "link": "https://www.seriouseats.com/recipes/2014/04/crispy-potato-and-chorizo-hash-recipe.html", "description": "Ultra-crisp potatoes fried in chorizo fat with chunks of chorizo, seared green chilies, and scallions, all topped with baked eggs, avocado, and cilantro. It's a heck of a way to start the day.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Avocado", "Breakfast and Brunch", "Eggs", "Father's Day", "Mains", "Mexican", "Mother's Day", "Potato", "The Food Lab"], "recipeIngredient": ["1 1/2 pounds russet or Yukon gold potatoes, cut into 3/4- to 1/2-inch dice (see note)", "2 tablespoons distilled white vinegar", "Kosher salt", "4 ounces Spanish chorizo, diced", "1/4 cup vegetable, canola, or olive oil, divided, plus more as needed", "1/2 teaspoon ground cumin", "1/4 teaspoon ground paprika", "Freshly ground black pepper", "6 scallions, white and light green parts cut into 1-inch lengths, greens sliced and reserved separately", "1 poblano pepper, cut into 1/2-inch dice", "4 eggs", "1/4 cup roughly chopped fresh cilantro leaves", "1/2 small avocado diced", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2013/02/basic-salsa-verde-mexican-tomatillo-recipe.html\">homemade</a> or store-bought salsa verde for serving (optional)", "12 <a href=\"http://www.seriouseats.com/2011/10/video-the-right-way-to-warm-corn-tortillas.html\">warm corn tortillas</a> for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Place potatoes in a large saucepan and cover with 2 quarts cold water. Add vinegar and 2 tablespoons kosher salt. Bring to a boil over high heat. Reduce to a simmer and cook until barely tender, about 5 minutes after coming to a boil. Drain potatoes in a colander and let drain for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place chorizo chunks in a cast iron skillet and place over medium heat. Cook, stirring, until chorizo is crisp on all sides and fat has rendered out, about 10 minutes total. Remove chorizo with a slotted spoon to a large bowl, leaving fat in skillet. Set chorizo aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When potatoes are drained, add 3 tablespoons oil to skillet and heat over medium-high heat until shimmering. Add drained potatoes and cook, stirring and tossing occasionally, until potatoes are deep brown and crisp on all sides, about 20 minutes total. Add cumin and paprilka and cook, stirring, until fragrant, about 30 seconds. Season to taste with salt and pepper. Transfer potatoes to bowl with chorizo and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining tablespoon oil to skillet and heat over high heat until shimmering. Add scallion whites and light greens and poblano and cook, stirring occasionally, until charred, about 2 minutes. Season to taste with salt and pepper then transfer to bowl with potatoes and chorizo. Toss contents of bowl and return to skillet. Make 4 wells in potato mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully break 1 egg into a small bowl and slide into a fine mesh strainer over the sink. Swirl egg very gently until excess loose white drains away. Carefully add to one of the cavities in the skillet. Repeat with remaining three eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzly eggs with a few drops of oil, season with salt and pepper, and transfer to oven. Cook until whites are barely set but yolks are still runny, about 10 minutes. Remove from oven, garnish with sliced scallion greens, chopped cilantro, and avocado. Serve immediately with salsa and tortillas.</p>"}]}