{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141120-smoked-turkey-leftovers-collard-greens-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Niki Achitoff-Gray"}, "recipeCuisine": "", "keywords": ["collard green", "leftover", "Southern", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoked Turkey Braised Collard Greens", "link": "https://www.seriouseats.com/recipes/2014/11/smoked-turkey-braised-collard-greens.html", "description": "Smoked turkey replaces the more traditional choice of bacon in this rendition of braised collard greens. Nice and garlicky, the greens are spiced up with red chili flakes, with a bite of acidity from cider vinegar and lemon juice. And, since the turkey's pretty lean, we finish it off with some butter to give the pleasantly bitter, tender greens the rich, mouth-coating quality that pork belly typically provides.", "totalTime": "40 minutes", "recipeYield": "Serves 2 to 4", "recipeCategory": ["Leafy Greens", "Sides", "Turkey"], "recipeIngredient": ["1 large bunch collard greens (1 1/2 to 2 pounds)", "1 tablespoon olive oil", "5 medium cloves garlic, thinly sliced", "1 cup smoked turkey stock (see note)", "2 teaspoons cider vinegar", "1/2 teaspoon kosher salt, plus more to taste", "1/2 teaspoon black pepper, plus more to taste", "1 pinch red pepper flakes", "3 ounces smoked turkey, preferably dark meat, shredded or chopped into bite-size pieces", "1 tablespoon butter", "2 teaspoons lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ribs from collards and rinse leaves thoroughly. Line up the leaves and roll them lengthwise like a cigar. Slice them into 1-inch ribbons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a deep pot, heat olive oil over medium heat. Add garlic and cook, stirring, until fragrant but not browned, 1 to 2 minutes. Add collards in large handfuls, stirring until each addition is wilted before adding the next. Add stock, cider vinegar, salt, pepper, and chili flakes. Bring to a simmer, cover pot, and reduce heat to low. Simmer collards until tender, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid and raise heat to medium-high. Add smoked turkey and butter, stirring until the butter is fully melted and the turkey is heated through. Remove from heat, add lemon juice, season to taste with salt and pepper, toss well, and serve.</p>"}]}