{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141112-potato-casserole-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["comfort", "holiday", "make ahead", "mashed potato", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Crispy Mashed Potato Casserole With Bacon, Cheese, and Scallions", "link": "https://www.seriouseats.com/recipes/2014/11/mashed-potato-casserole-crispy-baked-potato-topping.html", "description": "Mashed potatoes don't generally reheat well, but with the help of sour cream, this mashed potato casserole can be made days in advance, and reheated with no loss in quality. A crispy topping of <em>panko</em> bread crumbs, bacon, cheddar cheese, and scallions adds crunch and the flavor of fully loaded baked potatoes.", "totalTime": "2 hours", "recipeYield": "Serves 10 to 15", "recipeCategory": ["Baking", "Christmas", "Easter", "Fall", "Potato", "Sides", "Thanksgiving", "Winter"], "recipeIngredient": ["5 pounds (2.3kg) russet potatoes, peeled and cut into 3/4-inch cubes", "Kosher salt", "1 stick unsalted butter (4 ounces; 115g), cubed and slightly softened", "1 cup (8 ounces) sour cream (see note)", "1 cup (240ml) heavy cream", "6 thin slices bacon, diced", "1 1/2 cups (180g) panko bread crumbs", "1/4 cup thinly sliced scallions, white and light-green parts only", "6 ounces (170g) grated cheddar cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (177&deg;C). Set cubed potatoes in a colander and rinse under cold water until water runs clear. Transfer to a large saucepan and cover with cold water by at least 2 inches. Season water with salt until water is salty like tears. Bring water to a boil over high heat, then reduce heat to medium-low and simmer until a knife easily pierces potatoes with no resistance, 10 to 15 minutes. Drain potatoes in colander, then rinse with hot running water for 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread potatoes in an even layer on 2 rimmed baking sheets and transfer to oven until excess moisture has evaporated and surface of potatoes is dry, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using a potato masher, transfer cooked potatoes to a large mixing bowl, add butter and sour cream, and mash until only very small lumps remain, then add heavy cream and fold with a rubber spatula until fully incorporated. If using a ricer, rice potatoes into a large mixing bowl, then fold in butter, sour cream, and heavy cream until fully incorporated. If using a food mill, pass potatoes and butter through food mill into a large mixing bowl, then add sour cream and heavy cream and fold with a rubber spatula until fully incorporated. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer potatoes to a 9- by 13-inch baking dish and smooth surface. Cover with plastic and refrigerate for up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Two hours before serving, remove potatoes from refrigerator and let stand for 1 hour. Meanwhile, preheat oven to 350&deg;F (177&deg;C). In a saucepan, cook bacon over medium-high heat until fat has rendered and bacon is browned and crispy, about 6 minutes. Add panko to a large mixing bowl and scrape bacon and its rendered fat into it. Stir well to combine. Stir in scallions and cheese and season with salt. Spread bread crumb topping on potatoes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake casserole until topping is browned and potatoes are heated through, about 45 minutes. Serve.</p>"}]}