{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141201-waffled-sticky-rice-and-tofu-overhead2-daniel-shumski.jpg", "author": {"@type": "Person", "name": "Daniel Shumski"}, "recipeCuisine": "", "keywords": ["Asian", "tofu", "vegetarian", "waffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.75", "ratingCount": "4"}, "name": "Waffled Miso-Sesame Tofu With Waffled Sticky Rice", "link": "https://www.seriouseats.com/recipes/2014/12/waffled-crispy-tofu-miso-sesame-sticky-rice-recipe.html", "description": "Waffling gives tofu a crispy outside and soft inside without the need for deep-frying. And it only takes a few minutes. Paired with a little leftover sticky rice and some condiments, it's a quick and easy meal&mdash;and a visual standout.", "totalTime": "15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Tofu", "Vegan", "Vegetarian"], "recipeIngredient": ["1 package (14 to 16 ounces) firm or extra-firm tofu, cut into slices 1-inch thick", "2 tablespoons canola or vegetable oil", "1 tablespoon sesame oil, plus more for serving", "1 teaspoon yellow miso paste", "1 teaspoon soy sauce, plus more for serving", "Nonstick cooking spray", "2 cups previously prepared Asian-style short grain rice or Thai sticky rice", "Sriracha, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat waffle iron. If it has temperature controls, set it to medium. Place tofu slices on paper towels, top with more paper towels, and press gently but firmly to remove excess moisture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a shallow bowl or deep plate, combine canola oil, sesame oil, miso paste, and soy sauce. Place tofu in soy sauce mixture and turn to coat. Coat both sides of waffle iron with nonstick cooking spray. Place tofu in waffle iron, close lid, and cook until golden brown and crispy, about 3 minutes. Repeat until all the tofu is cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray both sides of waffle iron with more nonstick cooking spray. Place about one half cup of rice on each section of waffle iron, overstuffing that section a bit. Close lid and cook until rice is just golden and holds together, about 2 minutes. Repeat with any remaining rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop up rice and tofu along waffle grids and serve in bowl with soy sauce, sesame oil, and Sriracha for drizzling at the table.</p>"}]}