{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140603-roast-chicken-spring-panzanella-1.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["asparagus", "bread", "chicken", "panzanella", "roast chicken", "salad", "spring recipe"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roast Chicken With Asparagus Panzanella", "link": "https://www.seriouseats.com/recipes/2014/06/roast-chicken-asparagus-panzanella-recipe.html", "description": "Making panzanella&mdash; the classic Tuscan tomato-and-bread salad&mdash;without tomatoes is tricky, because you need all those juices to soften the stale bread. The trick is to find other ways to make the dish as flavor-packed and moist as possible. Here's our method with asparagus, cucumbers, and red onions, served alongside roast chicken.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Asparagus", "Bread", "Chicken", "Mains", "Salads"], "recipeIngredient": ["1 large chicken, about 4 to 5 pounds", "1/2 cup plus 1 tablespoon extra-virgin olive oil, divided, plus more for drizzling", "Kosher salt and fresh ground black pepper", "1/2 medium red onion, very thinly sliced", "1 (1-pound) bunch asparagus, trimmed", "3 Persian cucumbers, 2 very thinly sliced, 1 peeled and cut into chunks", "1/4 cup red wine vinegar", "1/2 pound baguette, stale or toasted until firm, cut into 1-inch cubes (about 6 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to upper-middle position and preheat oven to 400°F. Using sharp kitchen shears, remove spine from chicken; discard spine or reserve for another use. Flatten chicken by placing skin side up on cutting board and applying firm pressure to breast bone. Rub chicken on all surfaces with 1 tablespoon oil. Season generously with kosher salt and ground black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set wire rack in rimmed baking sheet lined with aluminum foil. Position chicken so that breasts are aligned with center of baking sheet and legs are close to edge. Roast until thickest part of breast close to bone registers 150 degrees on an instant-read thermometer and joint between thighs and body registers at least 170°F, 45 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fill medium bowl with ice water and add red onion; set aside. Fill a large bowl with ice water. In a large pot of salted boiling water, cook asparagus until crisp-tender, about 3 minutes. Drain and immediately transfer asparagus to ice bath.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut asparagus in half crosswise. Cut asparagus tip halves into 1-inch pieces and set aside. Roughly chop asparagus stalk halves and combine with peeled cucumber in blender with remaining 1/2 cup olive oil and the vinegar. Blend until vinaigrette is smooth. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken from oven, transfer to cutting board, tent loosely with foil, and allow to rest 10 minutes. Drain onions. In a large bowl, toss bread with vinaigrette until thoroughly coated and let stand 5 minutes. Then mix in two-thirds of the reserved asparagus pieces, two-thirds of the onion, and two thirds of the thinly sliced cucumbers; season with salt and pepper. Carve chicken, arrange on plates and serve with panzanella, garnishing with remaining asparagus pieces, onion, and cucumber slices. Drizzle with olive oil and serve immediately.</p>"}]}