{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141013-chickpea-salad-bacon-celery-cumin-rajas-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bean", "chickpea", "chili", "cotija", "cumin", "garbanzo", "lunch", "make ahead", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Chickpea Salad With Bacon, Cotija, and Roasted Chilies", "link": "https://www.seriouseats.com/recipes/2014/10/chickpea-salad-bacon-roasted-poblano-chili-recipe.html", "description": "This hearty chickpea salad flavored with bacon, cotija, and roasted chilies is easy to make and only gets better as it rests overnight. This is a dish custom-made for making ahead and packing on a camping trip or for lunch at the office.", "totalTime": "2 hours (plus overnight soak if using dried chickpeas)", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Legumes", "Salads"], "recipeIngredient": ["1/2 pound dried chickpeas (garbanzo beans), soaked overnight in cold salted water at room temperature", "1 bay leaf", "1 carrot, cut into 3-inch segments", "1 onion, split in half", "1 stalk celery, cut into 3-inch segments, divided", "Kosher salt", "2 poblano or Anaheim chilies", "4 ounces bacon, cut into 1/2-inch pieces", "1 shallot, thinly sliced (about 2 tablespoons)", "1 medium clove garlic, minced (about 1 teaspoon)", "2 tablespoons extra-virgin olive oil", "2 tablespoons juice from 2 limes, plus 1 extra lime cut into wedges", "1/2 cup crumbled cotija cheese", "1/2 cup thinly sliced scallions, white and light green parts only", "1/2 cup roughly chopped fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain chickpeas and place in a large pot with bay leaf, carrot, onion, and celery. Cover with cold water by 2 inches, season with salt, bring to a boil, reduce to a simmer, and cook until the chickpeas are tender but still hold their shape, about 1 hour. Discard bay leaf, carrot, onion, and celery. Drain and rinse under cold running water until chilled. Let drain in a colander set in the sink.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, adjust rack to 4 to 5 inches below broiler and preheat broiler to high. Place chilies on a foil-lined broiler pan and broil, turning occasionally, until completely blackened on all surfaces, about 15 minutes total. Crimp foil to seal around the chilies and set aside for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook bacon in a medium skillet over medium-high heat, stirring frequently, until completely crisp. Remove from heat and stir in shallots and garlic. Immediately transfer to a large bowl. Add olive oil and 2 tablespoons lime juice and whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chilies are cool enough to handle, peel using your fingers. Discard skin, stems, and seeds and slice flesh into thin strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When beans are cooked and drained, add to bacon mixture. Add chili strips, cotija, scallions, and cilantro and toss to combine. Season to taste with salt and pepper. Serve immediately with lime wedges, or for better results, store overnight in a covered container in the refrigerator. Salad will keep for up to three days.</p>"}]}