{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140305-btb-bearclaws.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["almond", "bear claw", "breakfast sweet", "coconut", "pastry", "The Model Bakery Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Model Bakery's Bear Claws", "link": "https://www.seriouseats.com/recipes/2014/03/model-bakerys-bear-claws.html", "description": "A base of croissant dough is filled with coconut, almonds, and cake crumbs, then garnished with more sliced almonds. It's an impressive-looking pastry that really isn't that hard to master.", "totalTime": "Several hours, if making dough", "recipeYield": "makes 6 bear claws", "recipeCategory": ["Bake the Book", "Coconut", "Desserts", "Nuts"], "recipeIngredient": ["<strong>Filling</strong>", "3/4 cup/85 g sliced almonds", "2/3 cup/55 g sweetened shredded coconut", "1/3 cup/65 g sugar", "1/3 cup/105 g packed almond paste, crumbled ", "1 cup/100 g vanilla-flavored cake crumbs ", "3 tablespoons unsalted butter, at room temperature ", "1 large egg yolk ", " ", "1 recipe Croissant Dough (see below) ", "Unbleached all-purpose flour for rolling out the dough ", "1 large egg yolk ", "1 tablespoon heavy cream or milk ", "1/4 cup/30 g sliced almonds ", "Confectioners’ sugar for dusting", " ", "<strong>Croissant Dough</strong>", "3 2/3 cups/530 g unbleached all-purpose flour, plus more as needed", "3/4 cup/180 ml water", "1/2 cup/120 ml whole milk", "3 tablespoons sugar", "2 tablespoons European-style or regular unsalted butter, at room temperature, thinly sliced, plus 1 cup/225 g cold butter", "2 teaspoons instant (also called quick-rising or bread machine) yeast", "1 1/4 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 6 hours and up to 24 hours before baking, put the flour, water, milk, sugar, 2 tablespoons room-temperature butter, yeast, and salt in the bowl of a stand mixer. Affix the bowl to the mixer and fit with the paddle. Mix on low speed just until the dough is cohesive, adding more flour as needed. The dough should be soft and tacky to the touch, so do not add too much flour. Also, the dough will be worked during the rolling and folding process, so it is not necessary to knead it at this point.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gather up the dough and turn out onto a lightly floured work surface. Pat and shape into a 1 in/2.5 cm-thick rectangle. Wrap the dough tightly in plastic wrap. Refrigerate for at least 2 and up to 4 hours. The dough will not rise much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the 1 cup/225 g cold butter in the bowl of a stand mixer fitted with the paddle attachment until it is smooth and pliable but still cool, about 2 minutes. (Or work the butter in a bowl, squeezing it between your fingers just until it is pliable; then beat with a wooden spoon or electric mixer until smooth.) The idea here is to have the dough and the butter at about the same cool temperature, as the butter must retain its texture during the rolling and folding process. If the butter is too warm, it will ooze out of the dough, and the baked croissants will be greasy and heavy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unwrap the dough and place on a lightly floured work surface. Using a long rolling pin, pummel the chilled dough to coax it into a larger rectangle measuring about 12 by 6 inches, with a long side facing you. Flour the top of the dough and roll it into an 18-by-10-inch rectangle. Use a lot of upper body strength to do the rolling; this isn't pie dough. Brush off the excess flour with a pastry brush.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your fingertips, starting at the left side of the dough, smear the processed butter over two thirds of the dough, leaving the right third unbuttered. Fold the dough into thirds like a business letter: Fold the unbuttered section over the middle section, and then fold the buttered section over the unbuttered third. This is called a turn. Rotate the dough so the long open seam faces you. Roll out the dough again into an 18-by-10-inch rectange. If at any time some of the butter oozes through the dough (it shouldn't), sprinkle some flour over the area to seal it. Repeat the folding into thirds for a second turn, brushing excess flour off the dough as needed. Place on a small baking sheet, cover with plastic wrap, and refrigerate for 20 to 30 minutes. This brief resting period will relax the gluten and lightly chill the butter, making the dough easier to roll and keeping the butter layers from softening. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unwrap the dough and place on the lightly floured work surface with the long open seam facing you. Repeat the rolling and folding for a third turn, brushing excess flour off the dough as needed. Rewrap the dough and refrigerate for at least 30 minutes or up to 18 hours before using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the filling:</strong> Process the almonds, coconut, and sugar in a food processor fitted with the metal blade until the almonds are very finely chopped. Add the almond paste and pulse until processed into fine crumbs. Add the cake crumbs, butter, and egg yolk and pulse until combined. Transfer to a bowl, cover with plastic wrap, and refrigerate until firm enough to shape, at least 2 hours or up to 1 day. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the filling into twelve logs about 5 in/12 cm long; set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line two half-sheet pans with parchment paper. Place the dough on a lightly floured work surface. Lightly flour the top of the dough. Using a large, heavy rolling pin, roll out the dough into a 20-by-15-in/ 50-by-38-cm rectangle. If the dough retracts, cover it with a kitchen towel and let it relax for 5 minutes before rolling again. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a yardstick and a sharp knife, cut the dough into twelve 5-in/12-cm squares. Place a dough square in front of you. Place one of the filling logs 3⁄4 in/2 cm up from the bottom of the square. Fold the top of the square over just to enclose the log, leaving about ½ in/1.25 cm of dough exposed beneath the seam, and press the seam closed. Cut three equally spaced slits in the exposed flap of dough to make four tabs for the “toes.” Place the pastry on one of the lined pans, curving it into a U shape to open space between the tabs. Repeat with the remaining dough and filling. Place six pastries on each pan, spacing them well apart. Cover each pan loosely with plastic wrap and let stand in a warm place until the pastries look puffed, about 1 1/2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the top third and center of the oven and preheat to 375°F/ 190°C/gas 5.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the egg yolk and cream together in a small bowl. Brush the tops of the pastries lightly with the egg mixture and sprinkle with the almonds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until golden brown, about 20 minutes, switching pans from top to bottom and front to back halfway through baking. Transfer to a wire cooling rack and let cool for at least 20 minutes. Dust with confectioners’ sugar. Serve warm or at room temperature. (Cooled bear claws can be stored in an airtight container at room temperature for up to 1 day.)</p>"}]}