{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/02032014-btb-bananapuddincake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["banana", "cake", "Puddin'", "pudding", "walnut"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Banana Upside-Down Cake with Malted Pudding", "link": "https://www.seriouseats.com/recipes/2014/02/banana-upside-down-cake-with-malted-pudding.html", "description": "Bananas and nuts are an idiot-proof combination, but the addition of malted milk is like having a milkshake in cake form. Which is to say, excellent.", "totalTime": "", "recipeYield": "serves 12", "recipeCategory": ["Bake the Book", "Banana", "Cakes", "Nuts", "Puddings and Custards"], "recipeIngredient": ["<strong>For Banana Cake</strong>", "2/3 cup light brown sugar", "2 1/2 sticks butter, softened, divided", "3 firm, ripe whole bananas, halved lengthwise, plus 1 cup mashed ripe bananas", "2/3 cup sugar", "3 eggs, separated", "2 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup buttermilk, shaken", "1 teaspoon vanilla extract", "  ", "<strong>Brown Butter Walnut Buttercream</strong>", "1 1/2 sticks plus 3 tablespoons butter", "1/3 cup walnuts, chopped", "1 teaspoon kosher salt", "6 egg whites", "2/3 cup sugar", " ", "<strong>For Assembly</strong>", "1 cup My Bro's Malted Milk Pudding (ingredients and recipe follow)", "Simple syrup or melted apricot jam (optional)", " ", "<strong>My Bro's Malted Milk Pudding</strong>", "1 1/4 cups whole milk", "1 1/4 cups heavy cream", "1/2 teaspoon salt", "1/2 cup sugar", "3 tablespoons cornstarch", "3 egg yolks", "1 cup plus 2 tablespoons malted milk powder", "1 ounce bittersweet chocolate, finely chopped", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, <strong>Make the Pudding</strong>: In a medium saucepan vigorously whisk together all ingredients except vanilla. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook over medium-high heat, whisking constantly, until thick, 6-7 minutes. (Once you can lift the whisk from the pudding and it leaves a faint shadow, it's done.) Whisk in vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the pudding through a fine-mesh sieve into a bowl, pressing pudding through sieve with spatula. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool at room temperature for 10 minutes, press a layer of plastic wrap onto the surface of the pudding, and chill completely in a refrigerator, 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Cake:</strong> Preheat oven to 350F. Coat two 8-inch round cake layer pans with cooking spray and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine the brown sugar and 1 1/2 sticks butter. Bring to a boil and cook until the sugar is dissolved and the mixture is smooth, 3-4 minutes. Carefully divide the hot mixture evenly between the prepared cake pans. Arrange 3 banana halves cut side down in each of the cake pans and place pans in freezer while making cake batter (this keeps the bananas from shifting when you top them with batter). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, cream together the remaining 1 stick butter with the sugar at high speed until light and fluffy as a cloud, 4-5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mashed bananas and beat until incorporated, 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl whisk together the flour, baking powder, baking soda, and salt. Turn mixer off, add dry ingredients, turn mixer back on to low speed, and slowly increase speed to medium, mixing until dry ingredients are well blended, 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the buttermilk and vanilla extract and mix 1 minute more. Transfer batter to a large bowl and set aside; wash well and thoroughly dry mixing bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fit mixing bowl with whisk attachment, all reserved egg whites, and whisk on high speed until soft peaks form, 1-2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spatula, stir a small amount of the egg whites into the banana batter to loosen batter slightly. Gently fold the remaining egg whites into the banana batter, being careful not to overstir and deflate the lovely aerated batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter among the prepared cake pans and bake until a cake tester or wooden toothpick inserted into the center comes out clean, 30-35 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and let sit in pan 10 minutes, then turn out onto a cooling rack and let cool to room temperature, banana sides up, 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make Frosting:</strong> Preheat oven to 350F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, heat 3 tablespoons of butter over medium-high heat until fragrant with brown flecks, 2-3 minutes. Add walnuts and salt to saucepan, toss to coat, and transfer to a parchment-lined rimmed baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast walnuts in oven until fragrant and lightly browned, 5-7 minutes. Let cool at room temperature until easy to handle, then finely process in food processor or finely chop by hand. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the bowl of a stand mixer atop a saucepan filled with simmering water and whisk egg whites and sugar until warm to the touch. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return bowl with heated mixture to a stand mixer fitted with the whip attachment and whip at high speed until stiff, glossy, and cool, 4-5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining butter 1 tablespoon at a time and whip until nice and fluffy, 4-5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chopped nut mixture to bowl and mix until incorporated, 1-2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble Cake:</strong> Place a cake layer on a lazy Susan or large, flat place, banana side up. (Use the less attractive layers for the bottom.) Pipe a ring of buttercream around the top of the cake about 1/4 inch from the sides to create a wall. Fill the area inside the ring with the malted pudding and smooth it with a spatula or knife. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently place the other, more attractive banana cake layer on top, banana side up, and press down to even it out, pushing the buttercream out to almost the edges of the cake. Fill in the gaps with more buttercream so it is even with the edge of the laters, then smooth out the sides of cake with an offset spatula to form the crumb coat, leaving top of cake bare. Chill in refrigerator until the buttercream is firm, 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use the remaining frosting to frost only the sides of the cake but not the top, leaving those gorgeous caramelized bananas exposed. If you feel like showing those bananas even more love, you can brush the top with a little simple syrup or melted apricot jam. </p>"}]}