{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140113-279638-cook-the-book-radish-enoki-tangerine-avocado-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["avocado", "Cook the Book", "feast", "radish", "salad", "tangerine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Radish, Enoki, Tangerine, and Avocado Salad From 'Feast'", "link": "https://www.seriouseats.com/recipes/2014/01/radish-enoki-tangerine-and-avocado-salad-from.html", "description": "During the wintertime, I struggle to find inspiration in the root vegetables and super bitter greens of January. That's why love to read recipes like <a href=\"http://edibleliving.com/about/2/\" target=\"_blank\">Sarah Copeland</a>'s salad of radish, enoki, tangerine, and avocado in her new cookbook, <em><a href=\"http://www.amazon.com/Feast-Generous-Vegetarian-Meals-Appetite/dp/1452109737/?tag=serieats-20\" target=\"_blank\">Feast</a></em>. The salad is little more than those components, artfully arranged on a plate, but the small touches&mdash;searing the mushrooms, whisking oil into the tangerine juice for the dressing, scattering a few sprigs of chives on top&mdash;make this easy dish memorable enough to serve at a dinner party.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Avocado", "Cook the Book", "Salads", "Sides", "Vegetarian"], "recipeIngredient": ["8 Cherry Belle, globe, or French Breakfast radishes ", "4 tangerines ", "3 tablespoons extra-virgin olive oil ", "Sea salt ", "2 heads Belgian endive, leaves separated", "2 firm, ripe avocados, peeled, pitted, and quartered lengthwise ", "6 ounces (170 g) enoki mushrooms, cleaned and cut into small bunches ", "Freshly ground pepper ", "1/2 bunch fresh chives, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the radishes as thinly as possible with a mandoline or a very sharp knife. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a tangerine on the cutting board and cut off a little bit from both ends to create flat surfaces. Set the tangerine on one of the flat ends. Using a large, sharp knife, shave off the skin, peel, and as much of the pith as possible along the curve of the fruit. Squeeze any juices from the skin into a small bowl and reserve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working over the bowl with the juices with a sharp paring knife, hold the tangerine in your non-dominant hand and use your dominant hand to cut the segment along the membrane. Cut along the opposing membrane (in a V), releasing the segment and collecting any juices and the fruit itself in the bowl below. Repeat with all the segments, then squeeze any remaining juices from the membranes and toss. Repeat with the remaining tangerines. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the tangerine juice with 2 tablespoons of the olive oil and a pinch of salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the endives, radishes, tangerine segments, and avocados among plates. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the remaining 1 tablespoon olive oil in a medium skillet over medium heat. Add the enoki, season with salt, and cook until crispy and brown, 3 to 4 minutes. Sprinkle the cooked enoki over the salad. Drizzle with the dressing, season with salt and pepper, and scatter with chives. Serve immediately. </p>"}]}