{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140623-btb-nectarinetart.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Cook the Book", "dessert", "fruit", "nectarine", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Wine-Poached Nectarine Tart From 'Fruitful'", "link": "https://www.seriouseats.com/recipes/2014/06/wine-poached-nectarine-tart-from-fruitful.html", "description": "Thick, juicy slices of nectarines are stewed in sweet wine and spices, then gently laid on a bed of tart crust in this <strong><em>Fruitful</em></strong> dessert. Nectarine syrup is distilled from the simmering fruits, and used as a garnish.", "totalTime": "1 hour", "recipeYield": "Makes 1 9-inch tart", "recipeCategory": ["Bake the Book", "Fruit Desserts", "Nectarine", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Tart Pastry</strong>", "1 1/4 cups / 180 g all-purpose flour ", "2 tablespoons granulated sugar", "1/4 teaspoon kosher salt", "7 tablespoons / 100 g unsalted butter, cut into very small pieces and chilled", "2 to 4 tablespoons ice water, as needed", " ", "<strong>Nectarine Topping</strong>", "2 cups / 470 ml white dessert wine, such as Muscat or Sauternes", "1 cup / 200 g granulated sugar", " 2 cinnamon sticks", " 3 whole star anise", " 5 firm but ripe nectarines or peaches", "1/2 cup / 120 ml heavy whipping cream", "1/4 cup / 30 g confectioners’ sugar", "1 teaspoon pure vanilla extract", "1 cup / 200 g granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the crust, in a large bowl, whisk together the flour, sugar, and salt. Using a pastry cutter or your fingers, cut or rub the butter into the dry ingredients until the mixture resembles a coarse meal (work quickly to keep the butter cold). Mix in the water with a fork, 1 tablespoon at a time, until the dough just comes together; it should be moist, but not damp or wet. Gather the dough into a large ball and flatten it into a disk with the palm of your hand. Wrap the disk tightly in plastic wrap and chill it in the refrigerator for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, roll the dough to a 1/4-inch / 6 mm-thick round (about 11 inches / 28 cm in diameter). Transfer the dough to a 9-inch / 23 cm fluted tart pan with a removable bottom, pressing it lightly but snugly into the bottom and up the edges of the pan, allowing excess dough to hang over the edges. Run a rolling pin over the top of the pan to trim off any excess. Pierce the bottom of the crust several times with a fork, cover it with plastic wrap, and then transfer it to the refrigerator to chill for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F / 205°C and arrange a rack in the center position. Line the chilled tart shell with foil or parchment and fill it with pie weights, dried beans, or rice. Bake until the shell is set and golden, about 12 minutes. Carefully remove the weights and foil or parchment; continue to bake until the pastry is golden brown, 10 to 15 minutes more. If the edges begin to brown too quickly, cover them with a ring of foil. Remove the pan from the oven and let it cool completely on a wire rack before filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, combine the wine, sugar, cinnamon, and star anise in a medium pot. Add water to just cover the nectarines (about 2 cups). Bring the liquid to a gentle boil over medium-high heat. Cover the pot and reduce the heat to low. Simmer very gently (do not let the mixture come to a boil) until the nectarines are tender when pierced with the tip of a knife, 5 to 10 minutes. Carefully remove the nectarines with a slotted spoon and transfer them to a bowl of ice water until completely cool. Drain the nectarines and pat them dry; peel the skin away with your fingertips and thinly slice the fruit into wedges, discarding the pits.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pot from the heat and strain the poaching liquid through a fine-mesh sieve, reserving 1 1/2 cups. Pour the reserved liquid into a wide skillet over medium-low heat and bring it to a simmer. Cook the liquid until it reduces in a syrup thick enough to coat the back of a spoon, 10 to 15 minutes. Remove the skillet from the heat and set aside to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, in the bowl of an electric mixer fitted with the whisk attachment, whip together the cream and confectioners' sugar until stiff peaks form. Beat in the vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush a thin layer of nectarine syrup on the bottom of the cooled tart crust. Spread the whipped cream over the syrup. Arrange the nectarine slices on top, fanning them in concentric circles with the small ends facing the center. Carefully brush the nectarine slices generously with the remaining syrup. Serve immediately.</p>"}]}