{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140410-btb-amplehillsstout&pretzels.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Ample Hills", "Bake the Book", "beer", "chocolate", "Guinness", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ample Hills' Stout and Pretzels Ice Cream", "link": "https://www.seriouseats.com/recipes/2014/04/ample-hills-stout-and-pretzels-ice-cream.html", "description": "Chocolate and pretzels aren't a groundbreaking combination. Neither are pretzels and beer. But chocolate, pretzels <em>and</em> beer? Yes, please. Do yourself a favor and whip this one up if you want rich, chocolate-and-beer-y ice cream with the salty crunch of pretzels.", "totalTime": "several hours, including freezing", "recipeYield": "serves 4", "recipeCategory": ["Bake the Book", "Chocolate", "Ice Cream and Frozen Treats"], "recipeIngredient": ["1 recipe Dark Chocolate ice cream (ingredients below)", "3/4 cup Guinness beer", "1 1/2 cups chocolate-covered pretzels, chopped", " ", "<strong>Dark Chocolate Dream</strong>", "Chocolate Paste: ", "1 cup organic cane sugar", "1 cup cocoa powder", "4 ounces semisweet or bittersweet chocolate, chopped", " ", "1 recipe Walt’s Dream (see below) ", "1 teaspoon vanilla extract", " ", "<strong>Walt's Dream</strong>", "3/4 cup organic cane sugar", "1/2 cup skim milk powder", "1 2/3 cups whole milk", "1 2/3 cups heavy cream", "3 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare Dark Chocolate ice cream (instructions below). Once the base reaches 165ºF, remove the pan from the heat and mix in the cooled chocolate paste, adding the Guinness at the same time. Transfer the pan to an ice bath and let cool for 15 to 20 minutes. Pour the ice cream base through a wire-mesh strainer into a storage container and place in the refrigerator for 1 to 2 hours, or until completely cool.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cooled base to an ice cream maker and churn it according to the manufacturer’s instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the ice cream to a storage container, folding in the pretzels as you do. Serve immediately or harden in your freezer for 8 to 12 hours for a more scoopable ice cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the dark chocolate ice cream:</strong> Make the chocolate paste. In a medium saucepan, bring 1 cup (240 ml) water to a boil over medium heat. Remove the pan from the heat and add the sugar and cocoa powder, whisking vigorously to combine. Add the chocolate and whisk until melted and combined. Set aside to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare Walt’s Dream according to the recipe directions (see below). Before you cool the base in the ice bath, stir in the chocolate paste and vanilla. Cool the mixture in the ice bath for 15 to 20 minutes. Pour the ice cream base through a wire-mesh strainer into a storage container and place in the refrigerator for 1 to 2 hours, or until completely cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make Walt's Dream ice cream:</strong> Prepare an ice bath in your sink or in a large heatproof bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the sugar, skim milk powder, and milk. Stir with a hand mixer or whisk until smooth. Make sure the skim milk powder is wholly dissolved into the mixture and that no lumps remain (any remaining sugar granules will dissolve over the heat). Stir in the cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clip a candy thermometer to the saucepan and set the pan over medium heat. Cook, stirring often with a rubber spatula and scraping the bottom of the pan to prevent sticking and burning, until the mixture reaches 110ºF, 5 to 10 minutes. Remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the egg yolks in a medium bowl. While whisking, slowly pour in ½ cup of the hot milk mixture to temper the egg yolks. Continue to whisk slowly until the mixture is an even color and consistency, then whisk the egg-yolk mixture back into the remaining milk mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the stovetop over medium heat and continue cooking the mixture, stirring often, until it reaches 165ºF, 5 to 10 minutes more.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this step, you'd transfer the mixture to an ice bath. But for this recipe,  stir in the chocolate paste and vanilla. Cool the mixture in the ice bath for 15 to 20 minutes. Pour the ice cream base through a wire-mesh strainer into a storage container and place in the refrigerator for 1 to 2 hours, or until completely cool. </p>"}]}