{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/05/DeviledEggsCarbonara.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["appetizer", "carbonara", "deviled egg", "egg", "hors d'oeuvre", "pancetta", "parmesan", "pork", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Deviled Eggs Carbonara (Crispy Pancetta, Pork Fat, Parmesan Crisps, and Black Pepper)", "link": "https://www.seriouseats.com/recipes/2014/05/deviled-eggs-carbonara-recipe.html", "description": "These deviled eggs with crispy pancetta, parmesan, and plenty of black pepper take their inspiration from spaghetti carbonara.", "totalTime": "25 minutes", "recipeYield": "makes 8 deviled egg halves", "recipeCategory": ["Christmas", "Deviled Eggs", "Pork", "Snacks"], "recipeIngredient": ["6 tablespoons finely grated Parmigiano-Reggiano", "4 ounces pancetta, finely diced", "6 <a href=\"http://www.seriouseats.com/recipes/2009/10/perfect-boiled-eggs-recipe.html\">hard boiled</a> or <a href=\"http://www.seriouseats.com/recipes/2014/04/steamed-hard-boiled-eggs-recipe.html\">hard steamed eggs</a>, peeled and halved lengthwise", "2 tablespoons mayonnaise", "1 teaspoon distilled white vinegar", "Kosher salt and freshly ground black pepper, plus coarsely cracked pepper, for garnish", "Minced parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F and line a baking sheet with silpat. Sprinkle 4 tablespoons of Parmigiano-Reggiano in two 4-inch rounds on silpat and bake until lightly browned and melted, about 10 minutes. Let cheese crisps cool until crisp. Break each cheese crisp into 4 pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook minced pancetta in small skillet over medium-high heat until pancetta is browned and crisp and fat has rendered, about 5 minutes. Drain crisped pancetta through strainer, reserving rendered fat, and transfer to paper-towel lined plate. You should have about 2 tablespoons crisped pancetta and at least 1 tablespoon rendered fat. Let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add 1 tablespoon crispy pancetta, 1 tablespoon rendered fat, mayonnaise, vinegar, and remaining 2 tablespoons Parmigiano-Reggiano to the yolks and, using a sturdy whisk, mash and stir together until thoroughly combined. Season with salt, and very generously with ground black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap). Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Garnish deviled eggs with crispy pancetta, cracked black pepper, cheese crisps, and parsley. Serve immediately.</p>"}]}