{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141027-baked-occasions-derby-cookies.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "baked occasions", "bourbon", "cookie", "dessert"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Derby Cookies From 'Baked Occasions'", "link": "https://www.seriouseats.com/recipes/2014/10/derby-cookies-from-baked-occasions.html", "description": "To say that Matt and Renato, authors of <em>Baked Occasions</em> are fans of bourbon would be an understatement. They've made pies, cakes, and ice creams featuring the boozy, woodsy liquor. These Derby cookies were crafted in honor of the Kentucky Derby, bite-sized and perfect for a party. Even if you're not celebrating Derby Day, these cookies are delicious with or without an oversized hat.", "totalTime": "1 hour", "recipeYield": "Makes 36 to 40 cookies", "recipeCategory": ["Bake the Book", "Cookies", "Desserts"], "recipeIngredient": ["31/2 ounces (100 g) walnuts (about 1 cup), toasted", "2 cups plus 2 tablespoons (270 g) all-purpose flour", "1/2 teaspoon kosher salt", "8 ounces (2 sticks/225 g) unsalted butter, softened, cut into cubes", "2 tablespoons good-quality Kentucky bourbon", "1 tablespoon pure vanilla extract", "1/2 cup (110 g) firmly packed dark brown sugar", "1/2 cup (120 g) bourbon sugar (see below) or raw or demerara sugar", "3/4 cup (85 g) confectioners’ sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, process the walnuts until almost all are finely ground but some remain coarse.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the flour and salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a standing mixer fitted with the paddle attachment, mix together the butter, bourbon, and vanilla on medium speed until smooth and combined. Add the brown sugar and beat again until the mixture is well combined and light, 3 to 4 minutes. Add the flour mixture and beat on low speed until just combined. Turn the mixer to the lowest speed and add the nuts; mix for 15 seconds. Remove the mixing bowl from the mixer and finish incorporating the nuts with a wooden spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a small ice-cream scoop with a release mechanism (or a small spoon and your hands), form balls from tablespoons of dough and place them on the prepared baking sheet about 1/2 inch (12 mm) apart. More than likely, you should be able to fit all of the balls on one half sheet baking pan; the dough does not really spread during baking. Freeze the balls until firm, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350F (175C).<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the balls from the freezer and let sit for 5 minutes. Place the bourbon sugar in a wide shallow bowl. Roll the balls in the sugar to coat them completely, applying pressure as needed to make the sugar stick, and place them back on the baking sheet. Bake just until the balls start to color, 12 to 14 minutes. Remove the baking sheet from the oven and let them cool for about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using, sift the confectioners’ sugar into a wide shallow bowl. Roll the balls in the sugar and place then on a cool surface. Let the balls cool completely and sprinkle them again with more of the confectioners’ sugar right before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bourbon Sugar Two Ways:</strong> Vanilla bourbon sugar is addictive. Use the leftovers to finish other desserts, to stir into coffee, and to make assorted fancy cocktails.</p>\r\n\r\n<p><strong>Quick and Dirty Bourbon Sugar:</strong> Place 1/2 cup (120 g) raw or demerara sugar in a ceramic canister that has an accompanying lid (or use a small bowl covered with a small plate). Add 1/2 teaspoon bourbon, cover with the lid, and shake vigorously until well combined. Wait at least 30 minutes for the flavor to develop before using.</p>\r\n\r\n<p><strong>Slow and Steady Vanilla Bourbon Sugar:</strong> Place 1 cup (240 g) raw or demerara sugar in a canister that has an accompanying lid. Split a vanilla bean lengthwise and stick the vanilla bean halves into the sugar. Drizzle the sugar with 2 teaspoons of bourbon, and top with 1 more cup (240 g) raw or demerara sugar. Cover the canister and shake like crazy. Place the canister in a dark, cool place and wait about a week for the flavors to fully develop.</p>"}]}