{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140212-nacho-cheese-sauce-vegan-recipe-food-lab-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cheese", "cinco de mayo", "condiment", "easy", "nacho", "quick", "sauce", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5294117647059", "ratingCount": "17"}, "name": "The Best Vegan Nacho Cheese Sauce", "link": "https://www.seriouseats.com/recipes/2014/02/gooey-vegan-nacho-cheese-sauce-recipe-food-lab.html", "description": "A thick, creamy, tangy, gooey vegan nacho sauce made with supermarket staples. Perfect for dipping or topping nachos, baked potatoes, veggie burgers, or macaroni and cheese.", "totalTime": "25 minutes", "recipeYield": "Makes about 2 cups", "recipeCategory": ["Cheese", "Condiments and Sauces", "Dairy-Free", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["6 tablespoons vegetable shortening or palm oil", "1 small onion, thinly sliced", "2 medium cloves garlic, thinly sliced", "1/2 jalapeño pepper, seeds and ribs removed, thinly sliced", "1/2 teaspoon ground cumin", "1 teaspoon ground paprika", "1/2 teaspoon granulated garlic powder", "1 chipotle pepper packed in adobo sauce, finely chopped, plus 1 teaspoon adobo sauce", "4 ounces russet potato (about 1/2 medium), peeled and thinly sliced", "4 ounces roasted cashews (about 1 cup)", "1/2 cup water", "1/2 cup almond milk", "1 teaspoon hot sauce (such as Frank's)", "2 teaspoons pickling liquid from a can of pickled jalapeño peppers (plus peppers, to taste)", "Kosher salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt shortening in a medium skillet over medium heat. Add onions, garlic, and jalapeños and cook, stirring, until completely softened but not browned, about 4 minutes. Add cumin, paprika, garlic powder, and chipotle (with sauce). Cook, stirring, until fragrant and mixture starts to sizzle, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add potatoes and cashews and cook, stirring, until cashews are lightly toasted, about 2 minutes. Add water and almond milk. Bring to a boil, reduce to a bare simmer, and cook, stirring frequently, until potatoes are fully tender, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mixture to the jar of a high-powered blender (see note). Add hot sauce, jalapeño pickling liquid, and a pinch of salt. Start on low speed and slowly increase speed to high. Blend on high speed until completely smooth, about 2 minutes, adding water a few drops at a time as necessary to thin to desired consistency. Season to taste with more salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press mixture through a chinois (see note), using the bottom of a ladle to get it through. Cheese sauce can be stored in the refrigerator in a sealed container for up to 1 week. To reheat, microwave in 30 second increments, stirring in between, or reheat in a small pan on the stovetop, stirring constantly, and adding extra water to loosen sauce as necessary.</p>"}]}