{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140615-btb-raspberrymadeleines.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cookie", "madeleine", "raspberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Raspberry Madeleines From 'Fruitful'", "link": "https://www.seriouseats.com/recipes/2014/06/raspberry-madeleines.html", "description": "Traditionally, the delicate madeleine gets its flavor from vanilla, butter and eggs. In <strong><em><a href=\"http://www.amazon.com/Fruitful-Seasons-Fresh-Fruit-Recipes/dp/0762445653/?tag=serieats-20\" target=\"_blank\">Fruitful</a></em></strong>, Brian Nicholson adds raspberries and lemon zest, taking them from a teatime treat to an anytime indulgence.", "totalTime": "45 minutes", "recipeYield": "Makes 12 madeleines", "recipeCategory": ["Bake the Book", "Cookies", "Desserts", "Fruit Desserts", "Raspberry"], "recipeIngredient": ["5 tablespoons / 70 g unsalted butter, at room temperature, divided\t", "1⁄2 cup plus 2 tablespoons / 85 g all-purpose flour, divided, plus more for dusting", "3 ounces / 85 g raspberries (about 1/2 cup)", "2 large eggs, at room temperature", " 1/3 cup / 70 g granulated sugar", "1/2 teaspoon finely grated lemon zest", "1/4 teaspoon baking powder", "1/4 teaspoon kosher salt", "Confectioners’ sugar, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F/190°C and position a rack in the center position. Grease a 12-cup madeleine pan generously with 1 tablespoon of the butter (make sure to get into the tin’s ridges) and dust with flour, tapping out any excess. In a small saucepan, melt the remaining 4 tablespoons/55 g of butter; remove the pan from the heat and let the butter cool.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, lightly mash the berries. Stir in 2 tablespoons of the flour.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the whisk attachment, beat the eggs, sugar, and lemon zest until the mixture is pale and thick and has tripled in volume, about 5 minutes. In a small bowl, whisk together the remaining 1/2 cup/65 g of flour, the baking powder, and the salt. With the mixer running at medium-low speed, add the dry ingredients, a little at a time, until just incorporated. Using a spatula, fold in the melted butter in three additions. Gently fold in the berries.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drop large spoonfuls of the batter into the center of each madeleine mold. Do not spread the batter evenly over the tin, but leave them in a mound; they will spread as they bake. Bake until the edges of the cakes are golden brown and the centers spring back lightly when pressed, 10 to 12 minutes. Rap the pan lightly on a counter to release the cakes. Transfer the cakes to a wire rack to cool completely. Dust with confectioners’ sugar and serve. Eat within a day. </p>"}]}