{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140115-279643-cook-the-book-polenta-with-winter-salad.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["blue cheese", "Cook the Book", "egg", "feast", "polenta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Polenta With Winter Salad, Poached Egg, and Blue Cheese From 'Feast'", "link": "https://www.seriouseats.com/recipes/2014/01/polenta-with-winter-salad-with-poached-egg-blue-cheese-from-feast.html", "description": "One of my favorite dishes to make in the winter is a big bowl of polenta topped with a scoop of whatever leftover vegetables are rolling around in the fridge. <a href=\"http://edibleliving.com/about/2/\" target=\"_blank\">Sarah Copeland</a> seems to be of the same mind. She has four (yes, four) different recipes for polenta in her new cookbook, <em><a href=\"http://www.amazon.com/Feast-Generous-Vegetarian-Meals-Appetite/dp/1452109737/?tag=serieats-20\" target=\"_blank\">Feast</a></em>; here, she tops cheddar-filled polenta with a wilted melange of bitter greens and cherry tomatoes, a delicate poached egg, and a few crumbles of pungent blue cheese.", "totalTime": "30 to 45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Cook the Book", "Eggs", "Mains", "Pasta", "Vegetarian"], "recipeIngredient": ["3 1/2 cups (840 ml) water ", "1 cup (140 g) polenta ", "Sea salt ", "1 1/4 cups (300 ml) whole milk ", "3 tablespoons unsalted butter ", "1 ounce (30 g) cheddar or Dubliner cheese, grated ", "3 tablespoons extra-virgin olive oil ", "1 handful cherry tomatoes ", "Freshly ground pepper ", "1/4 small head radicchio, chopped into bite-size pieces ", "1/2 head frisée, torn into bite-size pieces ", "Dash white or regular balsamic vinegar ", "4 large eggs, poached", "1 to 2 ounces (30 to 55 g) Danish blue, Roquefort, Valdeon blue, or Gorgonzola cheese  "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 3 cups (720 ml) of the water to a boil in a medium saucepan over medium-high heat. Slowly add the polenta, stir with a wooden spoon, and add 1 teaspoon salt. Reduce the heat to medium and cook, stirring occasionally, until the polenta is tender and fully cooked, about 20 minutes. Add the milk, 2 tablespoons of the butter, and the cheddar to the polenta and stir together over medium-low heat until just warmed through and soft enough to drop easily from a spoon, a few minutes more. Cover to keep warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in your largest skillet over medium-high heat. Add the tomatoes and cook, stirring occasionally, until they are charred and have burst, about 4 minutes. Season with salt and pepper. Add the radicchio and frisée and cook until wilted, about 3 minutes. Stir in the vinegar, the remaining 1/2 cup (120 ml) water, and the remaining 1 tablespoon butter. Reduce the heat to medium-low and toss together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the polenta into bowls and top with the salad and poached eggs. Crumble the blue cheese over the top before serving. </p>"}]}