{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140702-whole-roasted-fish-daniel-gritzer-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["easy", "fish", "roast", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Whole Roasted Fish With Oregano, Parsley, and Lemon", "link": "https://www.seriouseats.com/recipes/2014/07/whole-roasted-fish-oregano-parsley-lemon-recipe.html", "description": "Roasting fish whole is one of the easiest, most delicious ways to cook it. Cooked on the bone and in its skin, the meat remains even more tender and juicy than fillets or steaks do. Here, we soak the fish briefly in a saltwater brine to wash and lightly season it, then stuff the cavity with aromatic herbs, garlic, ginger, and lemon. Feel free to use any other fresh herbs and aromatics you want.", "totalTime": "55 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Fish", "Gluten-Free", "Mains", "Roasting"], "recipeIngredient": ["Kosher salt", "2 (2-pound; 900g) whole white-fleshed fish, such as sea bass, branzino, or porgy, scaled and gutted", "Freshly ground black pepper", "Lemon slices, peeled garlic cloves, peeled ginger slices, fresh oregano sprigs, and/or fresh parsley sprigs, for stuffing", "Extra-virgin olive oil, for rubbing and drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl about halfway full with room-temperature water and add enough salt to taste, stirring to dissolve salt. Add fish and let soak for 10 minutes. Drain fish and pat dry inside and out with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (180&deg;C) and position rack in center of oven. Line a rimmed baking sheet with parchment paper. Season fish inside and out with salt and pepper. Stuff belly cavities with lemon slices, garlic cloves, ginger, and herb sprigs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast fish until an instant-read thermometer inserted into thickest part registers 135&deg;F (57&deg;C), about 20 to 25 minutes, depending on dimensions of fish. Alternatively, roast until fins come right off when pulled and flesh can be felt to flake under the skin when you press on it. Let rest 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2014/07/technique-how-to-carve-whole-cooked-fish.html\">Gently remove fillets from bone cage</a>, drizzle with olive oil, and serve.</p>"}]}