{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141022-kale-pizza-7.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["fall", "kale", "pizza", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Charred Kale Pizza With Garlic", "link": "https://www.seriouseats.com/recipes/2014/11/kale-pizza-garlic-gruyere-fontina-mozzarella-recipe.html", "description": "Kale turns crisp, sweet, and nutty when exposed to the high heat of a pizza-ready oven. In this white pie, we pair it with two cheese (for a mix of more nutty flavor and creamy stretchiness), plenty of garlic, and a little heat.", "totalTime": "1 1/2 hours", "recipeYield": "Makes 2 pizzas, serving 3 to 4", "recipeCategory": ["Kale", "Mains", "Pizza", "The Food Lab", "The Pizza Lab", "Vegetarian"], "recipeIngredient": ["1 pound <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">homemade</a> or store-bought pizza dough, divided into two 8 ounce balls", "6 to 8 ounces roughly chopped trimmed kale leaves (about 2 quarts)", "3 tablespoons extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "6 ounces shredded Fontina, Jack, or Gruyère cheese", "8 ounces fresh mozzarella cheese", "6 medium garlic cloves, thinly sliced", "Pinch red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place each ball of pizza dough in a lightly oiled bowl and cover tightly with plastic wrap. Set aside at room temperature for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine kale and olive oil in a large bowl. Season with salt and pepper. Toss, massaging with hands until every surface of the kale is coated in oil. Set aside while the pizza dough rests. Meanwhile, adjust oven rack to top position under broiler and place a Baking Steel or pizza stone on top. Preheat oven to maximum heat setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, transfer one ball of pizza dough to a bowl of flour and turn to coat. Transfer to a lightly floured wooden pizza peel and stretch or roll into a thin circle. Top with half of grated cheese and half of mozzarella torn into small chunks. Sprinkle half of garlic and half of pepper flake over surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn broiler on to high and launch pizza onto baking steel. Bake, rotating occasionally, until cheese has melted and edges are barely starting to brown, about 2 minutes. Remove from oven with a metal pizza peel, distribute half of kale evenly over surface, and return to oven. Bake, rotating occasionally, until kale is charred and crisp and edges of pizza are browned, about 2 minutes longer. Serve immediately, then repeat with remaining pizza.</p>"}]}