{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141116-turkey-croque-madame-thanksgiving-09.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["brunch", "croque madame", "egg", "gravy", "sandwich", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Turkey and Stuffing Waffle Croque-Madame Sandwich", "link": "https://www.seriouseats.com/recipes/2014/11/turkey-stuffing-waffle-thanksgiving-croque-madame-sandwich-recipe.html", "description": "Slices of turkey on top of a crisp stuffing waffle, all covered with a cheesy gravy sauce that gets broiled until browned and bubbly before being topped off with a fried egg. This is the stuff morning-after-Thanksgiving dreams are made of.", "totalTime": "45 minutes", "recipeYield": "Makes 4 open-faced sandwiches", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Mains", "Sandwiches", "The Food Lab", "Turkey"], "recipeIngredient": ["Vegetable oil or non-stick cooking spray", "1 quart leftover or uncooked <a href=\"http://www.seriouseats.com/recipes/2010/11/classic-sage-and-sausage-stuffing-or-dressing-recipe.html\">stuffing</a> (see note)", "2 cups leftover <a href=\"http://www.seriouseats.com/thanksgiving-side-dishes#gravy\">gravy</a>", "8 ounces grated Comté or gruyère cheese", "1 pound sliced roast turkey breast", "1 tablespoon butter", "4 eggs", "Kosher salt and freshly ground black pepper", "2 tablespoons chopped fresh herbs such as parsley, chives, tarragon, or chervil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to 5 inches below broiler element and preheat broiler to low. Preheat a four-well Belgian waffle iron according to manufacturer's instructions. Spray with non-stick cooking spray and add 1 cup of stuffing to each well. Close waffle iron and cook, turning occasionally, until cooked through and crisp, 10 to 12 minutes. Set waffles aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While waffles bake, make the gravy cheese sauce. Heat gravy in a medium skillet over medium-high heat, whisking frequently, until simmering. Remove from heat and whisk in 6 ounces of cheese. Continue whisking until completely smooth. For a glossier sauce, blend with a hand blender until shiny, about 1 minute. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the waffles in a large oven-safe skillet or on a foil-lined broiler pan. Top with sliced turkey. Ladle half of cheese sauce over turkey, followed by remaining grated cheese. Broil until cheese is melted and bubbly, about 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fry the eggs. Melt the butter in a large cast iron or non-stick skillet over medium-high heat. Add the eggs and cook until whites are cooked through but yolks are still liquid, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top broiled turkey waffles with fried eggs, ladle remaining gravy over the whites of the eggs, season with salt and pepper, sprinkle with herbs, and serve immediately.</p>"}]}