{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140422-kale-frisee-beef-black-bean-sauce-13.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["beef", "Chinese", "Chinese green", "easy", "frisée", "kale", "quick", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Stir-Fried Beef With Kale and Frisée in Black Bean Sauce", "link": "https://www.seriouseats.com/recipes/2014/05/stir-fried-beef-kale-frisee-black-bean-sauce-recipe.html", "description": "This dish, which is made up of equal parts beef and greens in a light but flavor-packed black bean sauce with garlic doesn't quite qualify as a side dish, and seeing as I'm using a mixture of kale and frisée&mdash;two decidedly Western greens&mdash;it doesn't quite qualify as \"Chinese greens\" either. But the basic techniques I use in ut&mdash;just a quick stir-fry with no blanching&mdash;is a method that works with <em>any</em> kind of hearty green leafy vegetable, whether it's Chinese or not.", "totalTime": "30 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Beef", "Chinese", "Kale", "Mains", "Stir Frying"], "recipeIngredient": ["1/2 pound flank steak, sliced about 1/8 inch thick", "1/4 teaspoon salt", "1/4 teaspoon sugar", "1/8 teaspoon ground black pepper", "1/2 teaspoon Shaoxing wine or dry sherry ", "2 1/2 teaspoons soy sauce", "2 1/2 teaspoons cornstarch", "3 tablespoons plus 1 teaspoon vegetable, canola, or peanut oil, divided", "1 tablespoon fermented black beans", "6 cloves garlic, roughly chopped", "1 teaspoon sesame oil", "3 tablespoon water", "12 ounces kale and/or frisée, tender stems chopped into 2-inch pieces, leaves roughly torn", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine beef, sugar, black pepper, Shaoxing wine, 1/2 teaspoon soy sauce, 1/2 teaspoon cornstarch, and 1 teaspoon vegetable oil in a medium bowl. Mix well and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the fermented black beans in a small bowl filled with water. Drain, place on a paper towel to dry, and roughly chop up. Combine with the chopped garlic and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the sesame oil, 3 tablespoons water, remaining 2 teaspoons soy sauce and remaining 2 teaspoons cornstarch in a small bowl and mix with a fork until homogenous. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of oil in a wok over high heat until smoking. Add the stems of the kale, stir-fry for 1 minute, and then add the frisée and the kale leaves. Stir-fry until the greens are wilted, about 3 to 4 minutes. Add a few pinches of salt and transfer to a bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons of oil in a wok over high heat until smoking. Add the garlic and fermented black beans. Stir and cook for about 30 seconds. Add the beef. Stir and spread the beef out with the spatula. Cook without moving until lightly browned, about 1 minute. Continue to cook while stirring regularly until half cooked, about 2 minutes longer. Return the frisée and kale to the wok and stir. Push the beef and vegetable away from the center of the wok. Stir the sauce and add it to the center. Once it starts bubbling, combine it with the beef and vegetable and toss until ingredients are well coated. Transfer to a serving platter immediately and serve with white rice.</p>"}]}