{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140530-btb-spongeblondie.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["A Lighter Way to Bake", "cake", "pistachio", "sponge cake", "strawberry", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "White Chocolate &amp; Pistachio Sponge Blondies", "link": "https://www.seriouseats.com/recipes/2014/06/white-chocolate-pistachio-sponge-blondies.html", "description": "Sponge cake is flavored with strawberries, pistachios, and white chocolate in this dessert from <em>A Lighter Way to Bake</em>.", "totalTime": "45 minutes", "recipeYield": "makes 16 bite-size squares or 8 rectangular bars", "recipeCategory": ["Bake the Book", "Cakes", "Desserts", "Nuts", "Strawberry"], "recipeIngredient": ["Spray oil", "6 tablespoons unsalted butter", "5 oz white chocolate, roughly chopped", "3 eggs", "Seeds of 1/2 vanilla bean or 1/2 teaspoon vanilla extract", "1/4 cup sugar", "3 tablespoons all-purpose flour", "1 teaspoon baking powder", "Pinch of salt", "4 oz strawberries, hulled and chopped into small cubes", "2 oz green pistachios, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Grease an 8-inch square cake pan with a little spray oil and then line it with baking parchment. I just cut a long strip of paper to cover the bottom and come up on opposite sides of the pan with the excess hanging over a little. This makes it easier to lift the baked cake out of the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To prepare the blondies, melt the butter in a small pan over low heat. Then remove from the heat, add the white chocolate and set aside to allow it to melt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the eggs and vanilla seeds or extract in a large bowl and, using a hand whisk or a mixer fitted with a whisk attachment, give them a good whisk up. They will become really light, fluffy and mousselike. Add the sugar and keep whisking. The sugar will make the eggs increase in bulk even more. To test if the eggs are whisked up enough, use a spoon to pick up some of the egg mixture and then drop it back down. If the eggs are whisked up enough, the spoonful will sit on the surface for about 5 seconds (if it sits longer, that’s brilliant too!) before disappearing back into the mixture. Once the egg mixture reaches this stage, it is ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Give the now-melted chocolate a little stir into the butter to blend and pour it around the edges of the egg mixture. Do this from a low height so you don’t knock out all of that wonderful air that you have just beaten in. Then, using a spatula, fold them together, scooping right down to the bottom of the bowl, as the chocolate tends to sink down there. Sprinkle the flour, baking powder and salt over and fold the mixture in using as few “folds” as possible so you keep all that air in, but enough folds to make sure there are no lumps of flour in there. Finally, gently fold in the strawberries and pistachios.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently pour the mixture into the prepared pan from a low height and level it out with the back of a spoon. Bake for 30–35 minutes, until a knife inserted into the center comes out clean. Once cooked, remove from the oven and leave to cool in the pan. It will collapse in the center a little, but don’t worry—it will taste great. Once cooled, carefully remove from the pan, peel off the paper and cut into eight rectangular bars or 16 bite-size squares and serve. The pistachios will sink to the bottom along with the strawberries—all meant to happen and all very tasty.<br />\n</p>"}]}