{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140821-GlutenFree-Corn-Cookies-Elizabeth-Barbone.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["cookie", "corn", "dessert", "gluten free"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Buttery Gluten-Free Corn Cookies", "link": "https://www.seriouseats.com/recipes/2014/08/gluten-fre-corn-cookies-recipe.html", "description": "These flavorful corn cookies take a page from the <em><a href=\"http://www.amazon.com/Momofuku-Milk-Bar-Christina-Tosi/dp/0307720497/?tag=serieats-20\">Momofuku Milk Bar</a></em> cookbook, combining freeze-dried corn powder and a whole lot of butter for a sweet dessert somewhere between buttery corn on the cob and a buttery bowl of Cap'n Crunch.", "totalTime": "3 hour 30 minutes", "recipeYield": "24 cookies", "recipeCategory": ["Cookies", "Corn", "Gluten-Free", "Gluten-Free Tuesday"], "recipeIngredient": ["1 1/4 cups (5 ounces) white rice flour, plus more for dusting", "2/3 cup  (2.2 ounces) freeze-dried corn powder (see note)", "1/2 cup (2 ounces) corn flour (see note)", "1 1/2 teaspoons kosher salt", "3/4 teaspoon baking powder ", "1/4 teaspoon baking soda ", "2 sticks (8 ounces) unsalted butter at room temperature (see note)", "1 1/2 cups (10 1/2 ounces) granulated sugar", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together white rice flour, corn powder, corn flour, baking powder, baking soda, and salt in a medium bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine butter and sugar in the bowl of a stand mixer fitted with the paddle. Beat at medium-high speed for 2 minutes. Turn off mixer and scrape down the bottom and side of the bowl and the paddle with a rubber spatula.  Add egg mix at medium-high speed until very light and airy, about 7 minutes. Scrape down the bottom and side of the bowl and the paddle attachment once more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the dry ingredients and turn mixer to medium-low speed. Mix until dough comes together, about 1 minute. Scoop the dough using a #40 cookie scoop (about 1 1/2 tablespoons each) onto a parchment-lined rimmed baking sheet. Using the bottom of a drinking glass dusted with white rice flour, press down lightly on each cookie to flatten. Wrap the baking sheet tightly in plastic and refrigerate for at least 2 hours and up to 3 days.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center oven rack in middle position and preheat oven to 350&deg;F. Line two rimmed baking sheets with parchment paper. Place 6 dough balls about 4 inches apart on one of the parchment-lined baking pans. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until cookies are golden brown, about 15 minutes. Allow cookies to cool on for 5 minutes. Using a metal spatula, transfer cookies to wire rack to cool completely. Store cookies in an airtight container for up to 4 days. Repeat with remaining batter, alternating baking sheets between each batch so that you are always baking on a cool sheet.  Store cookies in airtight container on the counter for up to four days.</p>"}]}