{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140711-pizza-style-meat--pizzaiolajen-olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Italian", "keywords": ["Italian", "pizza", "pork", "scamorza", "tomatoes"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Scamorza-Loaded Pork Pizzaiola", "link": "https://www.seriouseats.com/recipes/2014/07/scamorza-loaded-pork-pizzaiola.html", "description": "What's better than pizza? Not much, but <em>pizzaiola</em>, a Neapolitan dish of meat cooked pizza-style, is a strong contender. Often made with steak, this indulgent version features thinly pounded pork-tenderloin medallions tied around a scamorza-cheese filling. The bundles are seared, then simmered in a rich red-wine tomato sauce. A final topping of cheese on each piece of pork and a trip under the broiler to get it browned and bubbling is the killer last step. It's delicious served on pasta.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Italian", "Mains", "Pizza", "Pork", "Sunday Supper"], "recipeIngredient": ["4 pork tenderloin medallions (about 1 1/2 pounds total), pounded 1/4 inch thick", "Kosher salt and freshly ground black pepper", "8 thick slices scamorza or mozzarella cheese, divided", "1 1/2 tablespoons extra-virgin olive oil", "1 large yellow onion, finely chopped", "3 medium cloves garlic, minced", "1/2 cup dry red wine", "1 (28-ounce) can crushed tomatoes", "1/3 cup canned roasted red peppers, drained and chopped ", "2 bay leaves", "1/4 teaspoon crushed red pepper", "1 pound cooked penne or spaghetti, for serving", "1/4 cup chopped fresh basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork all over with salt and pepper. Lay pork flat on a work surface and top each tenderloin with a slice of cheese. Roll pork over and around cheese, and tie tightly every 3 inches with a piece of kitchen twine to seal cheese inside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a Dutch oven, heat oil over medium-high heat until shimmering. Add pork and cook, turning, until browned on all sides, about 10 minutes total. Transfer pork to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium and add onion and garlic and cook, stirring, until softened, 3 to 4 minutes. Add red wine and stir, scraping up any browned bits from bottom of pot. Bring to a simmer and cook for 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomatoes, roasted peppers, bay leaves, and crushed red pepper and season with salt and pepper. Bring to a simmer and cook, stirring occasionally, for 20 minutes. Meanwhile, remove twine from pork with scissors, being careful not to unroll the pork; preheat broiler and position oven rack to middle position.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pork to Dutch oven, nestling it in the sauce. Top each piece of pork with 1 of the remaining 4 slices of cheese. Cover and continue to cook until cheese is melted and pork is just cooked through, about 3 minutes. Uncover and transfer Dutch oven to broiler and cook until cheese is just browned on top, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard bay leaves. Transfer pork rolls to plates of pasta and spoon all over with sauce. Garnish with basil and serve immediately.</p>"}]}