{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140422-chinese-broccoli-oyster-sauce-06.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["broccoli", "Chinese", "chinese broccoli", "easy", "garlic", "oyster sauce", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Chinese Broccoli With Oyster Sauce and Fried Garlic", "link": "https://www.seriouseats.com/recipes/2014/04/chinese-broccoli-oyster-sauce-fried-garlic-recipe.html", "description": "Simply simmered Chinese broccoli has a hearty flavor that pairs well with oyster sauce in this classic Cantonese preparation. Our version adds some fried garlic to the mix, using the flavorful garlic oil to amp up flavor.", "totalTime": "25 minutes", "recipeYield": "Serves 4 as a side dish", "recipeCategory": ["Broccoli", "Chinese", "Garlic", "Sides", "Vegetarian"], "recipeIngredient": ["1 whole head of garlic, peeled", "Kosher salt", "1/4 cup vegetable, peanut, or canola oil", "1 teaspoon sesame oil", "1 tablespoon oyster sauce", "10 ounces of Chinese broccoli"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer garlic to the bowl of a food processor or mini food processor. Pulse until garlic is very finely chopped but not a paste, about 12 short pulses, scraping down sides as necessary. Add 1/4 teaspoon salt and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a fine mesh strainer over a heat-proof bowl. Heat 1/4 cup of oil in a small saucepan over medium heat until shimmering. Add garlic and cook, stirring. Garlic should maintain a very gently bubble. If bubbling vigorously, reduce heat. Cook, stirring constantly, until garlic is pale golden brown, 6 to 8 minutes, then immediately strain (do not overcook, garlic will continue to darken as it rests). Transfer garlic to a paper towel-lined plate to cool. Reserve fried garlic and oil separately. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl combine 1 teaspoon of reserved garlic oil, sesame oil, and the oyster sauce. Mix well until combined and then add 1 tablespoon hot water. Stir and set aside. Reserve remaining garlic oil for another use.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to boil. Add the Chinese broccoli and until just tender, 4 to 5 minutes. Drain really well on paper towels or in a salad spinner and place on a serving platter. Drizzle the mixed oyster sauce on top and sprinkle with the fried garlic. Serve immediately.</p>"}]}