{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141003-plenty-more-cauliflower-cake-jonathan-lovekin.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["bread", "cauliflower", "Cook the Book", "plenty more", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Cauliflower Cake From 'Plenty More'", "link": "https://www.seriouseats.com/recipes/2014/10/cauliflower-cake-from-plenty-more.html", "description": "This savory cake from Yotam Ottolenghi's newest cookbook, <em>Plenty More</em>, is as beautiful as it is unusual: cauliflower florets are suspended in a golden cake with green flecks of basil and a load of parmesan cheese, with an orbit of onion rings on top and crunchy, aromatic seeds gilding the edges. And, as with most of Ottolenghi's out-of-the-box creations, it's just delicious.", "totalTime": "1 hour 50 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cauliflower", "Cook the Book", "Sides", "Vegetarian"], "recipeIngredient": ["1 small cauliflower, outer leaves removed, broken into 1 1/4-inch/3-cm florets (1 lb/450 g)", "1 medium red onion, peeled (6 oz/170 g)", "5 tbsp/75 ml olive oil", "1/2 tsp finely chopped rosemary", "7 eggs ", "½ cup/15 g basil leaves, chopped", "1 cup/120 g all-purpose flour, sifted", "1 1/2 tsp baking powder", "1/3 tsp ground turmeric ", "5 oz/150 g coarsely grated Parmesan or another mature cheese", "Melted unsalted butter, for br ushing", "1 tbsp white sesame seeds", "1 tsp nigella seeds", "Salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400ºF/200ºC.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cauliflower florets in a saucepan and add 1 teaspoon salt. Cover with water and simmer for 15 minutes, until the florets are quite soft. They should break when pressed with a spoon. Drain and set aside in a colander to dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut 4 round slices, each 1/4 inch/5 mm thick, off one end of the onion and set aside. Coarsely chop the rest of the onion and place in a small pan with the oil and rosemary. Cook for 10 minutes over medium heat, stirring from time to time, until soft. Remove from the heat and set aside to cool. Transfer the onion to a large bowl, add the eggs and basil, whisk well, and then add the flour, baking powder, turmeric, Parmesan, 1 teaspoon salt, and plenty of pepper. Whisk until smooth before adding the cauliflower and stirring gently, trying not to break up the florets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the base and sides  of a 9 1/2-inch/24-cm springform cake pan with parchment paper. Brush the sides with melted butter, then mix together the sesame and nigella seeds and toss them around the inside  of the pan so that they stick to the sides. Pour the cauliflower mixture into the pan, spreadingit evenly, and arrange the reserved onion rings on top. Place in the center of the oven and bake for 45 minutes, until golden brown and set; a knife inserted into the center of the cake should  come out clean. Remove from the oven and leave for at least 20 minutes before serving. It needs to be served just warm, rather than hot, or at room temperature.</p>"}]}