{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141022-marcus-off-duty-salmon-in-a-sea-of-coconut-paul-brissman.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["coconut", "Cook the Book", "fish", "marcus off duty", "noodle", "salmon", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Salmon in a Sea of Coconut From 'Marcus Off Duty'", "link": "https://www.seriouseats.com/recipes/2014/10/salmon-in-a-sea-of-coconut-from-marcus-off-du.html", "description": "Marcus Samuelsson is downright obliged to love salmon, having grown up on the coast of Sweden. And he has a thing for the flavors of Southeast Asia, choosing the foods of that region to be his desert-island pick, so to speak. In this dish from his new cookbook. <em>Marcus Off Duty,</em> he combines both cuisines into one weird and weirdly wonderful bowl.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Coconut", "Cook the Book", "Mains", "Pasta", "Salmon", "Soups and Stews"], "recipeIngredient": ["3 tablespoons olive oil", "3 ounces shiitake mushrooms, stemmed and sliced (about 1 cup)", "2 shallots, sliced", "1 teaspoon grated peeled ginger", "2 cups fish stock", "1 cup coconut milk", "1 tablespoon dry white wine", "1 tablespoon white miso", "4 ounces Chinese egg noodles (fresh or dried)", "Juice of 1 lime", "4 scallions, sliced", "1/2 cup canned drained water chestnuts, coarsely chopped (see Note)", "2 canned hearts of palm, well rinsed and sliced (see Note)", "1/2 ripe avocado, diced into small pieces", "Kosher salt", "1 pound skinless salmon fillet, cut into 4 pieces", "1/2 tablespoon wasabi powder (see Note)", "1 tablespoon sesame seeds", "2 teaspoons chopped fresh mint", "2 teaspoons chopped fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons of the olive oil in a large pot over medium heat. When the oil shimmers, add the mushrooms, shallots, and ginger and cook until the mushrooms are just tender and starting to brown, about 6 minutes. Add the fish stock, coconut milk, white wine, and miso and bring to a boil. Stir in the noodles, reduce the heat to low, and cook until just tender, 4 to 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the lime juice, scallions, water chestnuts, hearts of palm, and avocado. Season with salt (start with 1/2 teaspoon salt and add more carefully to keep from overpowering the delicate flavors). Turn off the heat, cover the pot, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the skinned side of the salmon with the wasabi and sesame seeds. Heat the remaining 1 tablespoon olive oil in a large skillet over medium-high heat and add the salmon fillets, skin side down. You’ll see the salmon change color as it cooks from the bottom. When it is still rare, 3 to 4 minutes, flip the fillets so the heat can kiss the top of the fish. Turn off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the noodles and soup into four soup bowls, then top each serving with a piece of salmon and sprinkle with the chopped mint and dill.</p>\r\n\r\n<p><br />\r\n<strong>Notes:</strong> You can find canned water chestnuts and hearts of palm in most grocery stores. Wasabi powder is in the Asian section of most grocery stores. Check the label to make sure it’s wasabi—not horseradish and food coloring.<br />\r\n</p>"}]}