{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/Whole%20Roasted%20Bream%20with%20Mushroom%20Pesto.jpg", "author": {"@type": "Person", "name": "Kerry Saretsky"}, "recipeCuisine": "", "keywords": ["fish", "mushroom", "seafood", "truffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Whole Roast Fish for 2 With Mushroom Pesto and Roasted Wild Mushrooms", "link": "https://www.seriouseats.com/recipes/2014/03/whole-fish-for-two-mushroom-truffle-pesto-roasted-wild-mushroom-recipe.html", "description": "This is an elegant meal for two, but not too elegant to make at home. A big sea bass or bream, stuffed with mushroom-truffle pesto, full of parsley and basil and pine nuts, and topped with crisp-broiled mushrooms. Who could resist that for dinner?", "totalTime": "60 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Fish", "Mushrooms"], "recipeIngredient": ["14 ounces cremini mushrooms, thinly sliced", "1 tablespoon butter", "Kosher salt and freshly ground black pepper", "2 cloves garlic, minced (about 2 teaspoons)", "2 jarred black truffles (optional, see note)", "1/4 cup plus 1 tablespoon vegetable or canola oil, divided, plus extra for drizzling", "1/2 cup fresh basil leaves", "1/2 cup fresh parsley leaves", "2 tablespoons toasted pine nuts, plus more for garnish", "1 whole (2-pound) sea bass or sea bream, cleaned", "7 ounces mixed wild mushrooms such as oyster, hen of the woods, and chanterelle", "1 lemon, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Melt the butter in a large skillet over high heat and add the mushrooms.  Season with salt and pepper and cook, stirring often, until the mushrooms have released all of their liquid and the pan has just gone dry. Add the garlic, and cook, stirring, until fragrant, about 1 minute longer. Transfer to a bowl and set aside to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor, add the cooled mushrooms, the truffles, 1/4 cup vegetable oil, the basil, the parsley, and the pine nuts. Pulse until nearly smooth but still slightly chunky, about 12 short pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the fish inside and out with salt and pepper. Using a very sharp knife, cut three or four slits at angle through the flesh on each side of the fish to the bone. Stuff these slits with the mushroom pesto, then spoon the rest into cavity. Rub the outside with just a drizzle of oil. Place in a parchment-lined baking dish, and cook until the fish is just done, about 35 minutes. Remove from oven and allow to rest, tented with foil, for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, increase oven temperature  to 475°F. Toss the wild mushrooms with 1 tablespoon of oil, salt, and pepper. Place on a parchment-lined baking sheet, and roast until crisp, about 5 minutes. Spoon the roasted mushrooms and a few extra pine nuts over the fish, and serve with lemon wedges.</p>"}]}