{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/70_Creme%20Sans%20Lait%20Spoon.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["cashew", "coconut", "frozen dessert", "ice cream", "jeni's splendid ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Jeni Britton Bauer's Crème Sans Lait", "link": "https://www.seriouseats.com/recipes/2014/05/vegan-creme-sans-lait-vanilla-ice-cream.html", "description": "Behold, a totally vegan, totally delicious vanilla ice cream, courtesy of <em>Jeni's Splendid Ice Cream Desserts</em>. The secret? Pulverized cashews and coconut oil for fatty richness, and tapioca starch for thickness. Try it today.", "totalTime": "several hours, for freezing", "recipeYield": "makes about 1 quart", "recipeCategory": ["Bake the Book", "Coconut", "Dairy-Free", "Desserts", "Ice Cream and Frozen Treats", "Nuts", "Vegan"], "recipeIngredient": ["2 3/4 cups almond milk", "2 tablespoons tapioca starch", "1/2 cup raw cashews, or 1/3 cup store-bought cashew paste", "2 ounces (4 tablespoons) vegan cream cheese, (preferably Follow Your Heart)", "1 1/4 cups refined coconut oil, at room temperature", "2/3 cup sugar ", "1/3 cup light corn syrup", "1 vanilla bean, split, seeds scraped out, seeds and bean reserved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prep:</strong> Mix about 2 tablespoons of the almond milk with the tapioca starch in a small bowl to make a smooth slurry. If using raw cashews, pulverize them into a very fine paste in a food processor or with a mortar and pestle. Whip the vegan cream cheese, if using, coconut oil, and cashew paste in a bowl until smooth and creamy. Fill a large bowl with ice and water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook:</strong> Combine the remaining almond milk, the sugar, corn syrup, and vanilla seeds and bean pod in a 4-quart saucepan and heat over medium-high heat until bubbling. Remove the pan from the heat, drizzle in the tapioca starch slurry, and stir well. Bring the mixture to  a boil over medium-high heat, reduce to a simmer, and let simmer for 30 seconds until the mixture thickens slightly. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Chill:</strong> Gradually whisk the hot milk mixture into the cream cheese mixture, stirring until well incorporated. Remove the vanilla bean and pour the mixture into a blender. Blend on high for 3 minutes to homogenize. Then pour the mixture into a 1-gallon Ziploc bag and submerge the sealed bag in the ice bath. Let stand, adding more ice as necessary, until cold, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Freeze:</strong> Remove the frozen canister from the freezer, assemble your ice cream machine, and turn it on. Pour the crème base into the canister and spin until thick and creamy. Pack the crème into a storage container. Press a sheet of parchment directly against the surface, and seal with an airtight lid. Freeze in the coldest part of your freezer until firm, at least 4 hours.</p>"}]}