{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140125-smooth-vegetable-puree-soup-food-lab-13.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Moroccan/North African", "keywords": ["Algerian", "carrot", "easy", "harissa", "north african", "quick", "soup", "tunisian", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "8"}, "name": "Spicy Carrot and Ginger Soup With Harissa", "link": "https://www.seriouseats.com/recipes/2014/01/spicy-carrot-and-ginger-soup-with-harissa.html", "description": "A creamy carrot soup flavored with cumin, ginger, and spicy North African harissa paste, with a toasted almond and parsley garnish.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Christmas", "Dairy-Free", "Father's Day", "Moroccan/North African", "Mother's Day", "Sides", "Soups and Stews", "Thanksgiving", "The Food Lab", "Valentine's Day", "Vegan", "Vegetarian"], "recipeIngredient": ["8 tablespoons extra-virgin olive oil, divided", "1 medium leek, white and pale green parts only, finely sliced (about 1/2 cup)", "1 small onion, chopped (about 1 cup)", "2 cloves garlic, thinly sliced (about 2 teaspoons)", "1 (2-inch) knob of ginger, peeled and finely chopped", "1 teaspoon ground cumin seed", "1/2 teaspoon ground coriander", "1 to 2 tablespoons harissa paste (see note)", "2 1/2 pounds carrots, peeled and roughly chopped", "1 1/2 quarts low-sodium homemade or store bought vegetable or chicken broth (see note)", "Kosher salt", "1/4 cup pine nuts", "2 tablespoons chopped fresh parsley leaves", "1 tablespoon zest and 2 tablespoons juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a large saucepan over medium heat until shimmering. Add leeks, onions, garlic, and ginger, and cook, stirring frequently, until vegetables are softened but not browned, about 5 minutes. Add cumin, coriander, and harissa paste and cook, stirring constantly, until fragrant, about 1 minute. Add carrots and stir to coat in spice mixture. Add broth (see note), season with a pinch of salt, bring to a boil, reduce to a bare simmer and cook, stirring occasionally, until carrots are completely tender, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat 2 tablespoons olive oil in a small skillet over medium heat until shimmering. Add pine nuts, reduce heat to low, and cook, tossing and stirring constantly, until fragrant and nutty brown, about 10 minute. Transfer to a bowl. Let cool for a few moments, then stir in parsley, lemon zest, and a pinch of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When carrots are tender, transfer half of soup to a blender. Start blender on lowest speed and slowly increase speed to high. With blender running, slowly drizzle in remaining 2 tablespoons extra-virgin olive oil. Transfer soup to a clean pot, pressing it through a fine mesh strainer or chinois if desired. Repeat with remaining soup and 2 more tablespoons olive oil. When all the soup is puréed, season to taste with salt and whisk in lemon juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve soup immediately, topped with pine nut and parsley mixture.</p>"}]}