{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140910-Shells_Italian-Sausage-Roasted-Red-Pepper-Cream-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Italian", "keywords": ["baked pasta", "casserole", "cheese", "easy", "Italian", "italian american", "Italian sausage", "pasta", "red pepper", "sausage", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Baked Shells With Roasted Red Pepper Cream Sauce and Italian Sausage", "link": "https://www.seriouseats.com/recipes/2014/09/baked-shells-roasted-red-pepper-cream-sauce-italian-sausage-recipe.html", "description": "A base of roasted red pepper cream sauce swaths pre-cooked, medium-sized pasta shells. I like the sauce smooth and silky, so I purée the roasted pepper mixture before adding a combination of heavy cream and half-and-half, along with three cheeses: ricotta, Fontina, and Asiago. Italian sausage, garlic, and onions, boost the sauce with extra flavor.", "totalTime": "2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Cheese", "Italian", "Mains", "Pasta", "Sunday Supper"], "recipeIngredient": ["5 medium red peppers", "1 tablespoon olive oil", "1 pound hot or sweet Italian sausage, casings removed", "1 medium onion, finely chopped (about 1 cup)", "2 cloves garlic, minced (about 2 teaspoons)", "1/2 cup puréed, canned tomatoes", "1/2 cup heavy cream", "1/2 cup half and half", "2 1/2 tablespoons ricotta cheese", "3/4 cup shredded Fontina cheese", "1/2 cup finely shredded, aged Asiago cheese, plus additional for garnishing", "1 (16-ounce) package medium-size shells, cooked al dente in salted water, drained and rinsed under cold running water", "Kosher salt", "4 tablespoons unsalted butter, cut into small pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 500&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the whole peppers on a foil-lined rimmed baking sheet. Transfer to the oven to cook, turning every 10 minutes, until the skins are wrinkled and the peppers are charred, about 35 minutes. Remove the pan from the oven and immediately gather up the foil to seal into a pouch around the peppers. Let rest for 30 minutes. When the peppers are cool enough to handle, cut in half and remove and discard stems and seeds. Removed charred peels and discard. Puree roasted peppers in a blender or food processor until smooth and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce oven temperature to 450&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a large stockpot over medium-high heat. When oil is shimmering, add Italian sausage and brown, breaking into small bits using a spoon. When sausage is nearly done cooking, add onions and garlic and reduce heat to medium. Continue cooking, stirring frequently, until vegetables start to soften and get translucent, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomatoes, heavy cream, half and half, and reserved pepper puree. Raise heat slightly and bring to a boil. Let simmer for 10 minutes to allow flavors to meld. Add ricotta, Fontina, Asiago, and cooked pasta. Toss to combine. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pasta to a 9- by 13-inch baking pan or casserole dish with high sides. Dot with butter and place in oven to cook until brown and bubbly, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and let rest for 10 minutes before serving with additional shredded Asiago cheese.</p>"}]}