{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20141401-Indian%20Pork%20Sorpotel.jpg", "author": {"@type": "Person", "name": "Denise D'silva Sankhé"}, "recipeCuisine": "Indian", "keywords": ["curry", "Indian", "liver", "offal", "pork", "Portuguese", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork Sorpotel (Goan Pork Offal Stew)", "link": "https://www.seriouseats.com/recipes/2014/01/pork-sorpotel-recipe.html", "description": "If you like pork and offal, there's no looking back from this dish. Pork Sorpotel is a tangy, spicy preparation that tastes even better the next day.", "totalTime": "1 hour 30 mins", "recipeYield": "Serves 4", "recipeCategory": ["Beyond Curry", "Indian", "Mains", "Offal", "Pork", "Soups and Stews"], "recipeIngredient": ["1 pound pork shoulder", "1 pound pork liver", "1/2 pound pork heart/kidney/tongue (any offal of your choice or all—totally optional)", "1 teaspoon turmeric powder (divided)", "Kosher salt", "2 tablespoons vegetable oil", "10 cloves garlic chopped fine (about 3 tablespoons, divided)", "1 inch piece ginger chopped fine (divided)", "4 green chilies slit lengthwise (divided)", "2 bay leaves", "1/4 cup pork blood", " ", "<strong>For the Spice Paste</strong>:", "10 peppercorns", "10 dry red chilies (reduce according to your spice tolerance) ", "2 inch piece cinnamon", "3 cloves", "1 teaspoon cumin seeds (or 2 teaspoons cumin powder)", "1/4 cup coconut vinegar or any other vinegar (divided)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Spice Paste:</strong> Combine the peppercorns, red chili, cinnamon, cloves, cumin seeds (or powder), and half of the vinegar in a blender. Blend on high speed, scraping down sides as necessary, until a smooth red paste is formed. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pork, liver, and other offal in a large saucepan. Cover with three cups of water. Add turmeric and 1 tablespoon salt. Cover and bring to a boil over medium-high heat. Stir once, reduce to a simmer, cover, and cook for 30 minutes. Skim liquid. Strain, reserving meat and broth separately. Trim pork of any rind or fat and cut into 1-inch chunks. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat half of the oil in a large saucepan over medium-high heat until shimmering. Add the drained pork and cook, turning occasionally, until lightly browned, about 4 minutes. Add the garlic, ginger, green chilies, and bay leaf. Cook, stirring, until fragrant, about 4 minutes. Add the spice paste and cook, stirring, until fragrant and raw aroma disappears, about 10 minutes. Add the remaining vinegar, reserved broth, and blood, and stir till the mixture is reddened with the spice paste. Bring to a simmer, cover, and cook for 30 minutes. Season to taste with salt</p>"}]}