{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140305-btb-chocolaterads.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chocolate", "cookie", "The Model Bakery Cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Model Bakery's Chocolate Rads", "link": "https://www.seriouseats.com/recipes/2014/03/model-bakerys-chocolate-rads.html", "description": "The fact that these aren't called cookies, but \"rads\", should tip you off as to how good they are. Two full pounds of semisweet chocolate are used to churn out one dozen of these nut-studded beauties. Taking a bite of one fresh from the oven is like drowning in chocolate. Sweet, sweet chocolate.", "totalTime": "45 minutes", "recipeYield": "makes 12 cookies", "recipeCategory": ["Bake the Book", "Chocolate", "Cookies", "Desserts"], "recipeIngredient": ["2/3 cup/95 g unbleached all-purpose flour", "2 1/2 teaspoons baking powder", "1/4 teaspoon fine sea salt", "1 lb/455 g semisweet chocolate (no more than 55% cacao), finely chopped", "4 tablespoons/55 g unsalted butter, at room temperature", "1 2/3 cups/330 g sugar", "4 large eggs, at room temperature", "1 tablespoon cold brewed espresso (or 1 teaspoon instant espresso dissolved in 1 Tbsp boiling water and cooled)", "2 1/2 teaspoons pure vanilla extract", "2 cups/340 g semisweet chocolate chips", "1 cup/115 g chopped walnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour, baking powder, and salt together into a small bowl and set aside. Put the chopped chocolate in a large heat-proof bowl, preferably stainless steel. Set over a large saucepan of barely simmering water and let stand, stirring occasionally, just until the chocolate is melted and smooth. Remove the bowl from the saucepan and add the butter. Let stand, stirring occasionally, until the butter is melted and incorporated into the chocolate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the sugar and eggs in the bowl of a stand mixer fitted with the whisk attachment on high speed until the mixture is fluffy, thick, and pale yellow, about 5 minutes. (Or whisk the mixture by hand for about 8 minutes.) Beat in the espresso and vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce the mixer speed to low. Add the melted chocolate, being careful not to over-mix. Add the flour mixture, stopping to scrape the sides and bottom of the bowl to ensure that the batter is completely mixed. Stir in the chocolate chips and walnuts. The dough will be soft, so let it stand until firm enough to shape, 20 to 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place an 18-by-13-in/46-by-33-cm sheet of parchment paper on the work surface. Drop large spoonfuls of the dough across the width of the paper. Using wet hands, pat and shape the dough into a 12-by-3-in/30.5-by-7.5-cm log. Wrap the dough in the parchment paper, smoothing the dough into an even log. Twist the ends of the paper closed. Place the log on a baking sheet and refrigerate until firm enough to slice, at least 2 hours or up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position racks in the top third and center of the oven and preheat to 350°F/180°C/gas 4. Line two half-sheet pans with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Since the log will be flat where it sat on the baking sheet, roll the w rapped dough on the work surface to smooth it so that the slices will be nice and round. Unwrap the dough. Using a thin, sharp knife dipped in water, cut the dough into t twelve 1-in-/2.5-cm-thick rounds. Arrange the rounds about 3 in/7.5 cm apart on the lined pans, allowing four cookies per pan. Refrigerate the remaining rounds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, switching the position of the pans from top to bottom and front to back halfway through baking, until the tops of the cookies are cracked and the edges are beginning to crisp, about 20 minutes. Let cool on the pans for 5 minutes. Transfer to wire cooling racks and let cool completely. Repeat with the remaining dough rounds on a cooled pan. The cookies can be stored in an airtight container at room temperature for up to 3 days.</p>"}]}