{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140721-btb-carrotcake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cake", "carrot", "dessert", "habanero", "sweet and vicious"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Habanero Carrot Cake From 'Sweet and Vicious'", "link": "https://www.seriouseats.com/recipes/2014/07/habanero-carrot-cake-from-sweet-vicious.html", "description": "If the fire-breathing dragon wasn't hint enough, one bite will prove this cake is packing heat. In her recently released cookbook, <em><a href=\"http://www.amazon.com/Sweet-Vicious-Attitude-Libbie-Summers/dp/0847841049/?tag=serieats-20\" target=\"_blank\">Sweet and Vicious: Baking with Attitude</a></em>, Libbie Summers stirs hot pepper extract into a lightly spicy batter, and spikes the cream cheese frosting with spiced pecans. The fruitiness of the pepper works well with the carrot-heavy batter, further enhanced by traditional cinnamon, nutmeg, and ground cloves.", "totalTime": "1 hour 30 minutes", "recipeYield": "serves 20", "recipeCategory": ["Bake the Book", "Cakes", "Carrot", "Desserts"], "recipeIngredient": ["2 cups all-purpose flour ", "2 teaspoons baking soda ", "2 teaspoons baking powder ", "1/2 teaspoon salt ", "2 teaspoons ground cinnamon ", "1/8 teaspoon ground cloves ", "Pinch of ground cayenne ", "Pinch of freshly grated nutmeg ", "4 large eggs ", "1/2 cup granulated sugar ", "1 cup packed dark brown sugar ", "1 cup chopped fresh pineapple ", "1/2 cup applesauce ", "3/4 cup vegetable oil ", "1 teaspoon hot pepper extract (ingredients below)", "1 teaspoon vanilla extract", "4 cups grated carrots (about 10 medium), using the large side of a cheese grater ", "1 habanero chili, stemmed, seeded, and minced ", "Cream Cheese Frosting (ingredients below)", "Hot Spiced Pecans (ingredients below)", "<strong>Hot Pepper Extract</strong>", "1 serrano chili, stem removed, cut in half lengthwise", "2 jalapeno chilies, stems removed, cut lengthwise into strips", "1 cup vodka", "<strong>Cream Cheese Frosting</strong>", "1 cup (2 sticks) organic butter, at room temperature", "3 (8-ounce) packages organic cream cheese, at room temperature", "1 teaspoon organic vanilla paste", "4 cups organic confectioners' sugar, sifted (sifting is a must!)", "<strong>Hot Spiced Pecans</strong>", "2 cups chopped pecans ", "2 teaspoons ground cayenne ", "2 tablespoons butter, melted "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350° F. Spray two 8-inch square baking pans with nonstick cooking spray and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, whisk together the flour, baking soda, baking powder, salt, cinnamon, cloves, cayenne, and nutmeg. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, using a hand mixer, or in the bowl of a standing mixer, beat together the eggs, both sugars, pineapple, applesauce, oil, and both extracts until well combined. Gradually add the flour mixture and continue to beat until fully incorporated. Fold in the carrots and chili. Divide the batter between the prepared pans and bake for 25 to 30 minutes, until a toothpick inserted in the center comes out clean. Let cool in the pans completely, then remove the cakes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frost the cake, using 1 1⁄2 cups of the frosting for the first layer and 1 1⁄2 cups for the top and sprinkling half of the spiced pecans on the first layer of frosting and the remaining spiced pecans on the top. (I don’t frost the sides of this cake because I like the taste to be more spicy than sweet, so I only use 3 cups of the frosting recipe. If you choose to frost the sides of the cake, you’ll need the entire recipe of frosting.) Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make Spiced Pecans:</strong> Preheat the oven to 350° F. Line a baking sheet with parchment paper. Toss the pecans, cayenne, and butter together on the baking sheet and bake for 10 minutes. Let cool completely before using.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make Hot Pepper Extract:</strong> Have a sterilized jar with a tight-fitting lid ready. Put the chiles in the jar and pour the vodka over them. Screw the lid on tight and give it a good shake. Set aside in a dark place for 1 month. Store up to 1 year. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make Cream Cheese Frosting:</strong> In the bowl of a standing mixer fitted with the paddle attachment, cream together the butter and cream cheese. Add the vanilla paste and mix thoroughly. Add the confectioners' sugar 1 cup at a time, beating until each addition is incorporated before adding the next. Scrape down the bowl as needed. Use immediately. Frosting can be made ahead and stored in the refrigerator for up to 1 week.</p>"}]}