{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140921-pepperoni-pull-apart-garlic-knots-recipe-20140921-pepperoni-pull-apart-garlic-knots-recipe-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bread", "cast iron", "cheese", "easy", "game day", "garlic", "garlic knot", "pepperoni", "pizza", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4545454545455", "ratingCount": "22"}, "name": "Easy Pull-Apart Pepperoni Garlic Knots", "link": "https://www.seriouseats.com/recipes/2014/09/easy-pull-apart-pepperoni-garlic-bread-recipe.html", "description": "These pull-apart garlic knots are baked in a cast iron skillet for a crisp, golden brown bottom. They are intensely flavored with pepperoni, red pepper flakes, garlic, and two types of cheeses, and have a moist, buttery crumb. It's the kind of recipe that your guests will demand you make time and time again because they're that damn good. Good thing they're easy as well.", "totalTime": "5 hours (or up to overnight)", "recipeYield": "Serves 4 to 6 as an appetizer or snack", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Christmas", "Garlic", "Pizza", "Snacks", "The Food Lab", "Yeast Bread"], "recipeIngredient": ["2 tablespoons unsalted butter", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "4 ounces pepperoni, cut into 1/4-inch squares", "Pinch red pepper flakes", "6 medium cloves garlic, minced (about 2 tablespoons)", "1/4 cup chopped fresh parsley leaves", "2 tablespoons minced fresh chives (optional)", "1/2 cup grated Parmesan cheese, plus more for sprinkling", "Flour for dusting", "1 pound <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">homemade</a> or store-bought pizza dough (see note)", "1/4 cup grated Pecorino Romano cheese", "<a href=\"http://www.seriouseats.com/recipes/2010/10/new-york-style-pizza-sauce.html\">Homemade</a> or store-bought pizza sauce for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter and oil in a 10-inch cast iron skillet over medium heat until butter melts and foaming subsides. Add pepperoni and cook, stirring, until pepperoni begins to crisp, about 2 minutes. Add pepper flakes and garlic and cook, stirring, until fragrant, about 1 minute. Add parsley and chives and stir to combine. Transfer mixture to a large bowl and stir in Parmesan cheese. Do not wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, divide dough into two even pieces. Working one piece at a time, roll or stretch into an oblong about 8 inches long and 4 inches wide. With a bench scraper or knife, cut crosswise into 12 strips. Repeat with other half of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tie each strip into a knot and transfer to bowl with pepperoni/garlic mixture. Toss and fold with your hands until every knot is thoroughly coated in mixture. Transfer the knots to the skillet in a single layer. Drizzle with more olive oil, cover tightly with plastic, and set aside until doubled in size, about 4 hours. Alternatively, refrigerate until doubled in size, 12 to 16 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, preheat oven to 425&deg;F and adjust oven rack to center position. Unwrap garlic knots. Sprinkle with Romano cheese. Transfer to oven and bake until golden brown and crisp, 25 to 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and immediately brush with more extra-virgin olive oil and sprinkle lightly with more Parmesan. Serve right away with warmed sauce on the side.</p>"}]}