{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140331-meat-lite-warm-grain-salad.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["easy", "fall", "fennel", "grain", "Meat Lite", "prosciutto", "salad", "spring", "whole grain", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Warm Whole-Grain Salad With Fennel, Arugula, Prosciutto, and Pecorino", "link": "https://www.seriouseats.com/recipes/2014/04/warm-whole-grain-salad-with-fennel-arugula-prosciutto-and-pecorino.html", "description": "Roasted fennel and arugula meet chewy, nutty grains in a warm salad accented with prosciutto and cheese.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Christmas", "Meat Lite", "Other Grains", "Salads", "Thanksgiving"], "recipeIngredient": ["1 1/2 cups rye berries, wheat berries, spelt grains, or farro grains", "Kosher salt and freshly ground black pepper", "1 medium bulb fennel, trimmed and cut into quarters", "4 tablespoons extra-virgin olive oil, divided", "1 small bunch arugula, cut into thick ribbons (about 3 cups)", "2 tablespoons pitted chopped olives", "1 1/2 ounces prosciutto, excess fat removed, sliced into thin ribbons (about 1/4 cup)", "1 1/2 ounces pecorino or parmesan cheese, shaved into thin slices with a vegetable peeler (about 1/4 cup)", "4 teaspoons juice and 1/2 teaspoon zest from 1 lemon", "2 teaspoons whole grain or dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 375°F. Place grain in a medium saucepan, cover with water by 2 inches, and season heavily with salt. Bring to a boil, reduce to a simmer, and cook until grain is tender, 30 to 40 minutes. Set a fine mesh strainer over a bowl and drain grain. Cover the strainer with a lid to keep grain warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While grain cooks, roast the fennel. Toss fennel quarters with 1 tablespoon olive oil and season with salt and pepper. Place on a small rimmed baking sheet and roast, turning once, until fennel is tender and golden-brown, about 30 minutes. Remove fennel from oven and let cool slightly before removing core from each quarter and slicing into thin slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer grain to a mixing bowl and add chopped fennel, sliced arugula, olives and half of the prosciutto and cheese. In a small bowl, combine remaining olive oil, lemon juice and zest, and mustard and whisk until smooth. Pour dressing over grain mixture and toss gently to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer salad to a serving platter and scatter with remaining prosciutto and cheese. Serve immediately. </p>"}]}