{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141017-rhode-island-clam-chowder-daniel-gritzer-5.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["chowder", "clam", "clam chowder", "shellfish", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Rhode Island Clam Chowder With White Wine and Bacon", "link": "https://www.seriouseats.com/recipes/2014/10/dairy-free-rhode-island-clam-chowder-recipe.html", "description": "Far less popular than creamy New England clam chowder, Rhode Island's dairy-free version deserves a lot more attention. The rich broth is brightened with white wine and loaded with the flavor of clams, chunks of tender potato, and bits of smoky bacon. It may be my new go-to chowder.", "totalTime": "35 minutes plus about 1 hour purging time", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Christmas", "Clams, Mussels, and Oysters", "Soups and Stews"], "recipeIngredient": ["2 pounds live cherrystone or littleneck clams", "Kosher salt", "3 thick-cut slices bacon, cut into 1/2-inch pieces (about 4 ounces)", "1 medium yellow onion, finely chopped (about 1 cup)", "2 medium carrots, finely chopped (about 1 cup)", "2 stalks celery, finely chopped (about 1 cup)", "2 medium cloves garlic, roughly chopped (about 2 teaspoons)", "1 cup dry white wine", "1 quart <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 packets (1/2 ounce) unflavored gelatin (only if using store-bought stock or thin homemade stock; see note)", "2 sprigs thyme", "1 bay leaf", "2 medium Yukon gold potatoes, diced", "Minced parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrub clams well under running water and set in a large bowl. Cover with cold water and add enough salt to make water taste salty like the sea. Let clams stand for about 30 minutes, then lift from water and rinse. Inspect soaking water: if there is sand on the bottom of the bowl, discard water, rinse bowl well, and repeat soaking procedure until sand no longer accumulates on bottom of bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place stock in a large liquid measuring cup and sprinkle gelatin over the top. (See note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon to Dutch oven and cook over medium-high heat, stirring occasionally, until bacon is crisp and fat has rendered, about 7 minutes. Add onion, carrot, celery, and garlic and cook, stirring, until softened but not browned, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine, bring to a simmer, and cook until alcohol smell has cooked off, about 4 minutes. Add stock, thyme sprigs, and bay leaf and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add clams. Cover and cook until clams begin to open, about 5 minutes. Using tongs, transfer clams to a large heatproof bowl as they open. If any clams don't open, transfer them to a separate bowl, and attempt to open them by sliding a knife between the shells: any clams that smell good can be added to the others (discard any that smell bad or are filled with mud). Allow clams to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add potatoes to soup and simmer until tender, about 10 minutes. Meanwhile, remove clam meat from shells. Discard shells and roughly chop clam meat, collecting all juices that accumulate. Skim most of the fat from the surface of the soup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add clam meat back to soup along with any juices and season with salt. Transfer to bowls, garnish with parsley and serve.</p>"}]}