{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/04/FrenchToast.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["breakfast", "dessert", "French toast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7692307692308", "ratingCount": "13"}, "name": "Perfect Quick-and-Easy French Toast", "link": "https://www.seriouseats.com/recipes/2014/04/perfect-quick-easy-french-toast.html", "description": "This easy recipe should be your go-to for basic French toast, designed for when you wake up in the morning and have a craving for French toast but haven't planned for it in advance. It uses only staples like bread, milk, and eggs, and pantry items like cinnamon, sugar, and nutmeg. The key to why it's so delicious and custardy is that the ratio of egg, milk, and sugar strikes the ideal balance&mdash;neither too wet and soggy nor too firm and eggy.", "totalTime": "25 minutes", "recipeYield": "serves 4", "recipeCategory": ["Bread", "Breakfast Sweets", "Easter", "Father's Day", "French Toast", "Mother's Day"], "recipeIngredient": ["6 large eggs", "4 tablespoons sugar, plus more for sprinkling", "Pinch kosher salt", "Pinch ground cinnamon", "Pinch freshly grated nutmeg", "1/4 teaspoon vanilla extract", "2 cups whole milk", "4 tablespoons unsalted butter for the pan, plus more for serving", "Eight (1/2-inch thick) slices white bread", "Maple syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a wire rack on a rimmed baking sheet in the oven and preheat to 200&deg;F. If using very fresh, moist bread, arrange slices in a single layer on the rack and cook in oven, turning once, until lightly toasted, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large mixing bowl, whisk together eggs, sugar, salt, cinnamon, nutmeg, and vanilla until thoroughly combined. Add milk and whisk to blend.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon butter in a large non-stick or cast iron skillet over medium heat, swirling skillet, until foaming subsides, about 5 minutes. Soak 2 slices of bread in egg bath, turning, until saturated. Add soaked bread to skillet and cook, swirling occasionally, until browned on bottom side, about 3 minutes. Sprinkle top side of bread with sugar, flip, and continue to cook, swirling occasionally, until browned on second side, about 3 minutes longer. Transfer French toast to the rack in the oven in a single layer to keep warm and repeat with remaining slices of bread and egg bath.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve French toast with pats of butter and maple syrup.</p>"}]}