{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140514-292538-cook-the-book-saffron-chicken-and-rice-with-golden-beets.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "the new southern table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Saffron Chicken and Rice With Golden Beets From 'The New Southern Table'", "link": "https://www.seriouseats.com/recipes/2014/05/saffron-chicken-and-rice-with-golden-beets-fr.html", "description": "While it may not have the superstar status of other quintessentially Southern ingredients like country ham or collards, rice is a vital part of any Southern table, especially in the low country region around the Carolina coast. <a href=\"http://www.brysstephens.com/\" target=\"_blank\">Brys Stephens</a>'s chapter on rice in his cookbook, <em><a href=\"http://www.amazon.com/The-New-Southern-Table-Ingredients/dp/1592335853/?tag=serieats-20\" target=\"_blank\">The New Southern Table</a></em>, explores varieties and preparations of the grain from everywhere from Thailand to his own home state of South Carolina.", "totalTime": "1 hour and 10 minutes", "recipeYield": "serves 2 to 4", "recipeCategory": ["Chicken", "Cook the Book", "Gluten-Free", "Mains"], "recipeIngredient": ["2 1/2 (570 ml) cups water", "4 boneless, skinless chicken thighs", "Kosher salt and black pepper", "1/2 teaspoon saffron threads", "3 large or medium golden beets, peeled", "1/2 medium-size carrot, chopped", "1 stalk celery, chopped", "1 medium-size shallot, chopped", "4 cloves garlic", "1 piece ginger, 2 inches (5 cm) long, peeled and minced", "2 teaspoons (10 ml) olive oil", "1 tablespoon (14 g) unsalted butter", "1/2 teaspoon red pepper flakes", "1 cup (185 g) basmati rice", "1 teaspoon (6 g) kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the water to a bare simmer. Season the chicken thighs generously all over with salt and pepper. In a small bowl, soak the saffron threads in 1/4 cup (60 ml) of the hot water. Cut each beet into 8 pieces if using large beets, and into 6 pieces if using medium-size beets. Place the carrot, celery, shallot, garlic, and ginger in a food processor and purée.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil over medium-high heat in a large, heavy skillet, and add the butter. When the butter stops foaming, add the chicken thighs, and brown well, 2 to 4 minutes per side. Remove the pan from the heat, and transfer the chicken to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the heat and add the puréed vegetables and the red pepper flakes, and cook, stirring often, 2 to 4 minutes, until fragrant. Add ½ cup (120 ml) of the hot water and scrape up the brown bits on the bottom of the pan. Add the rice and 1 teaspoon (6 g) kosher salt to the pan, and stir to coat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nestle the chicken thighs and beets into the rice mixture. Add the rest of the hot water and the saffron with its soaking liquid to the pan. Bring to a boil, reduce the heat, cover, and simmer 20 to 30 minutes, or until the chicken is cooked through. Add a little more water to the pan if it dries out before the chicken is done, or if too moist, turn up the heat at the end to evaporate any excess liquid. Remove the pan from the heat, and let stand, covered, for 10 minutes before serving.</p>"}]}