{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140610-btb-pizzagrana.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "cupcake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Robicelli's Pastiera di Grano Cupcakes", "link": "https://www.seriouseats.com/recipes/2014/06/robicellis-pastiera-di-grano-cupcakes.html", "description": "Pastiera di Grano is an Easter pie that combines chewy, nutty grains with light, fluffy ricotta in a citrus-flavored pastry crust. <strong><em><a href=\"http://www.amazon.com/Robicellis-Cupcakes-Decidedly-Grown-Up-Recipes/dp/0670785873/?tag=serieats-20\" target=\"_blank\">Robicelli's: A Love Story, With Cupcakes</a></em></strong> refuses to relegate it to a yearly treat, and so, these cupcakes were invented.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes 24 cupcakes", "recipeCategory": ["Bake the Book", "Cakes", "Desserts"], "recipeIngredient": ["<strong>Wheat Berries and Ricotta</strong>", "1/4 cup dried soft white wheat berries", "1/2 cup fresh ricotta", "3/4 cup milk", "2 tablespoons granulated sugar", "&nbsp;", "<strong>Pie Dough</strong>", "3/4 cup powdered sugar, plus additional for dusting", "1/2 cup all-purpose flour", "1/4 teaspoon baking powder", "Scant pinch kosher salt", "3 tablespoons unsalted butter, softened", "1/2 teaspoon lemon zest", "1 large egg yolk", "&nbsp;", "<strong>Italian Citrus Cake</strong>", "12 tablespoons (1 1/2 sticks) unsalted butter", "4 large eggs", "1/2 teaspoon lemon zest", "1/2 teaspoon orange zest", "1 cup milk", "1 teaspoon orange flower water", "1 teaspoon kosher salt", "2 cups all-purpose flour", "1 3/4 cups granulated sugar", "2 teaspoons baking powder", "1/3 cup finely diced candied citron or candied orange zest (optional)", "&nbsp;", "<strong>Wheat Berry–Ricotta Buttercream</strong>", "One recipe French Buttercream (ingredients below)", "Wheat berries (from above)", "Drained ricotta (from above)", "1/8 teaspoon orange flower water", "1/8 teaspoon ground cinnamon", "1/8 teaspoon freshly grated nutmeg", "Guar gum (optional)", "&nbsp;", "<strong>French Buttercream</strong>", "1 cup water", "2 cups sugar", "2 tablespoons corn syrup", "1/4 teaspoon cream of tartar", "5 egg yolks", "1 whole egg", "1/8 teaspoon xanthan gum", "1 1/2 lbs cold butter, preferably European", "&nbsp;", " <strong>To Finish</strong>", "Powdered sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Wheat berries and Ricotta:</strong> Place the wheat berries in a bowl, cover with at least 2 inches of water, wrap the bowl with plastic wrap, and let sit overnight to hydrate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a fine-mesh strainer over a bowl and line with a nonprinted paper towel. Add the ricotta, cover with another paper towel, then weight down the cheese with a saucer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the top with plastic wrap and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next day, drain the wheat berries and place in a small saucepan with the milk and granulated sugar. Simmer on low heat until the wheat kernels are al dente and nearly all the liquid is absorbed, about 25 minutes. While the wheat berries are cooking, preheat the oven to 300°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the cooked wheat berries out onto a baking sheet and place in the oven for 5 minutes. Remove from the oven, give a stir, spread out again, and return the sheet to the oven for another 5 to 10 minutes. (We’re not cooking the wheat berries—we’re just trying to dry off any surface moisture.) Remove from the oven when the wheat berries are no longer wet on the outside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Pie Dough:</strong> Line a baking sheet with parchment paper and dust with powdered sugar. In a small bowl, combine the flour, powdered sugar, baking powder, and salt and blend with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter and lemon zest and work them in with your fingertips or<br />\nthe back of a fork until the mixture is pebbly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a well in the center of the mixture, add the egg yolk, and begin to<br />\nwork in the flour mixture. Turn the dough out onto the prepared baking<br />\nsheet and knead with your hands until smooth. Pat out into a rectangle<br />\nabout 1 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the top with powdered sugar and roll the dough out to a 1/8-inch<br />\nthickness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pizza cutter, score the dough into batons that are 1/4 x 2 inches.<br />\nPlace the baking sheet in the refrigerator to rest while you prepare the cupcakes. We’ll be baking both of them off at the same time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Italian Citrus Cake:</strong> Preheat the oven to 350°F. Line cupcake pans with 24 baking cups. Melt the butter in a microwave at 60 percent power for 1 1/2 to 2 minutes. Keep the butter warm—do not allow it to sit and cool off.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a stand mixer with the paddle attachment, beat the eggs on medium-low speed for 2 minutes until light yellow and lightly foamy. Add the lemon zest and orange zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase the mixer speed to medium-high. Pour the hot butter into the eggs slowly, so that the mixture tempers and the eggs do not scramble. Once the butter is added, reduce the speed to medium-low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer running, add the milk, orange flower water, and salt. Mix for 1 minute until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, sugar, and baking powder and add to the batter. Mix on medium until just combined, about 30 seconds. Remove the bowl and paddle from the mixer and use the paddle to scrape the bottom and sides of the bowl, ensuring that everything is well mixed.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the candied citrus, if using. Scoop the batter into the prepared baking cups, filling them two thirds of the way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in the middle of the oven for 20 to 25 minutes, rotating the pan halfway through. The cupcakes are done when the centers spring back when you touch them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the cupcakes are baking, also bake the pie dough for 10 minutes, rotating the pan once, until golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cupcakes from the oven. Let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Wheat berry–Ricotta Buttercream:</strong> For French buttercream: In a heavy nonreactive saucepan, add water, then add sugar, corn syrup, and cream of tartar. The last two help keep the sugar from crystallizing. Put the pot on high heat. It's going to be there for a while. Be patient and keep your eye on it.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the yolk and eggs in a stand mixer with the whisk attachment and turn to high. Just let it go! Eggs will triple in volume and go to the \"ribbons\" stage. You can't overwhip!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wait on the sugar, looking for 235°F, aka \"soft ball.\" When it happens, be ready to move quickly. Turn off the mixer and add the xanthan gum, turn back up to medium. Remove the thermometer from the hot sugar. Lift with two hands. Rest the lip of the saucepan on the edge of the mixer bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly tilt and pour the sugar in a slow, steady stream down the side of the bowl. Don't go too fast! If you do there will be chunks of scrambled eggs in your buttercream.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the sugar is all in, turn the mixer to high. Beat until cool. Gauge this by putting the inside of your wrist to the outside of the bowl. It's more accurate than your hands. Switch out the whisk for the paddle. Next we're adding the butter. It's too heavy for the whisk and you'll end up breaking your stand mixer if you stay with the whisk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Start cutting the butter into thin pieces - you could shave it with a cheese slicer if you'd like. Add the butter piece by piece.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once your butter is added, mix on high to combine. It should be fluffy and make you want to eat it with your fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cooked wheat berries, drained ricotta, orange flower water, cinnamon, and nutmeg and beat on medium-low until well combined. The buttercream is meant to be heavily textured with the wheat berries and should not be smooth. If it shows any of the telltale signs of “breaking,” add the guar gum 1/8 teaspoon at a time with the mixer on low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assembly:</strong> Following the score lines, break off the pie dough batons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a pastry bag fitted with a plain tip with the wheat berry buttercream and pipe onto each citrus cupcake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crisscross two batons, on top of each cupcake. Dust with powdered sugar.</p>"}]}