{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140422-btb-buttercake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Ample Hills", "butter cake", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ample Hills' Ooey Gooey Butter Cake Ice Cream", "link": "https://www.seriouseats.com/recipes/2014/04/ample-hills-ooey-gooey-butter-cake-ice-cream.html", "description": "With fat pieces of butter-soaked yellow cake in a cream cheese ice cream base, this recipe is easily one of the most decadent offerings at Ample Hills.", "totalTime": "several hours, for chilling and freezing", "recipeYield": "serves 4", "recipeCategory": ["Bake the Book", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>Ooey Gooey Butter Cake</strong>", "Butter for the baking pan", "1 cup unsalted butter", "1 vanilla bean", "1 package yellow cake mix", "3 eggs", "8 ounces cream cheese", "1 teaspoon vanilla extract", "1 pound confectioners’ sugar", " ", "<strong>Cream Cheese Ice Cream</strong>", "1 recipe Walt's Dream (ingredients below)", "4 ounces cream cheese", "2 teaspoons vanilla extract", " ", "<strong>Walt's Dream Ice Cream</strong>", "3/4 cup organic cane sugar", "1/2 cup skim milk powder", "1 2/3 cups whole milk", "1 2/3 cups heavy cream", "3 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the ooey gooey butter cake:</strong> Preheat the oven to 350ºF. Butter a 9-by-13-inch baking pan and line it with parchment paper.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 1/2 cup of the butter in a small saucepan. Halve the vanilla bean lengthwise and scrape out the seeds. Add the seeds and pod to the pan with the butter and cook over low heat until the butter has melted. Use a fork to remove and discard the pod.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, beat together the cake mix, 1 egg, and the melted butter on medium speed until just combined. The batter will be thick and doughlike. Spread it evenly across the prepared baking pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, melt the remaining 1/2 cup (120 g) butter. In the clean bowl of a stand mixer fitted with a clean paddle attachment, beat the cream cheese on high speed until smooth. Add the remaining 2 eggs, vanilla, and melted butter and beat on medium speed until combined. Add the confectioners’ sugar and beat on low until combined. Now increase speed to high and beat until completely smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the cream cheese mixture over the cake batter. Bake for 45 minutes to an hour, until the top has browned slightly, and the cake is no longer jiggly in the middle. Let the cake cool completely, then chop it into bite-size pieces. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cream cheese ice cream:</strong> Prepare an ice bath in your sink or in a large heatproof bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the sugar, skim milk powder, and milk. Stir with a hand mixer or whisk until smooth. Make sure the skim milk powder is wholly dissolved into the mixture and that no lumps remain (any remaining sugar granules will dissolve over the heat). Stir in the cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clip a candy thermometer to the saucepan and set the pan over medium heat. Cook, stirring often with a rubber spatula and scraping the bottom of the pan to prevent sticking and burning, until the mixture reaches 110ºF, 5 to 10 minutes. Remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the egg yolks in a medium bowl. While whisking, slowly pour in ½ cup of the hot milk mixture to temper the egg yolks. Continue to whisk slowly until the mixture is an even color and consistency, then whisk the egg-yolk mixture back into the remaining milk mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the stovetop over medium heat and continue cooking the mixture, stirring often, until it reaches 165ºF, 5 to 10 minutes more.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the mixture reaches 165ºF, remove the pan from the heat and mix in the cream cheese and vanilla. Using a whisk or hand mixer, stir vigorously to make sure the cream cheese melts and combines smoothly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pan to the prepared ice bath and let cool for 15 to 20 minutes, stirring occasionally. Pour the ice cream base through a wire-mesh strainer into a storage container and place in the refrigerator for 1 to 2 hours, or until completely cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the cooled base to an ice cream maker and churn it according to the manufacturer’s instructions.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the ice cream to a storage container, folding in the pieces of ooey gooey butter cake as you do. Use as much of the cake as you want; you won’t necessarily need the whole batch. Serve immediately or harden in your freezer for 8 to 12 hours for a more scoopable ice cream.</p>"}]}