{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/08/20140825-grilled-peach-salad-lauren-rothman-1.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["buttermilk", "easy", "grill", "peach", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Shallot-Stuffed Peaches With Bacon and Buttermilk Dressing", "link": "https://www.seriouseats.com/recipes/2014/08/grilled-shallot-stuffed-peaches-bacon-buttermilk-dressing-recipe.html", "description": "Grilled summer fruit is always a welcome addition at the table, and these peaches get extra boosts of flavor from sticky caramelized shallots, cooling buttermilk dressing and crispy bacon.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon", "Grilling", "Peach", "Salads"], "recipeIngredient": ["6 slices thick-cut bacon (about 6 ounces), cut into 1/2-inch pieces", "6 large shallots, peeled and finely chopped (about 4 cups)", "1 tablespoon balsamic vinegar", "Kosher salt and freshly ground black pepper", "4 medium-large peaches, firm but ripe", "2 tablespoons olive oil", "1/2 cup buttermilk", "1 tablespoon dijon mustard", "2 tablespoons mayonnaise ", "2 tablespoons apple cider vinegar", "2 teaspoons sugar", "2 tablespoons finely chopped fresh chives", "1 small head butter or Boston lettuce, leaves separated, rinsed and spun dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon to a Dutch oven and cook over medium heat. Cook, stirring frequently, until most fat has rendered and bacon is crisp, about 8 minutes. Drain on a paper towel-lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard all but 3 tablespoons of bacon fat from Dutch oven. Add shallots and cook over medium-low heat, stirring occasionally, until sticky and caramelized, about 35 minutes reducing heat or adding a tablespoon of water as necessary to prevent burning. Add balsamic vinegar and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Meanwhile, light 1/2 chimney full of charcoal</a>. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, preheat a gas grill to high, covered, for at least 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean </a>and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil </a>the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss peaches with olive oil and season to taste with salt and pepper. Place peaches cut-side down on the grill and and cook until lightly charred on cut side, about 3 minutes. Using tongs, flip peaches and grill until browned and softened on skin side, 2 to 3 minutes longer. Transfer to a platter, cut side up. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While peaches cool slightly, prepare the buttermilk dressing: in a Mason jar or other container with tight-fitting lid, combine the buttermilk, mustard, mayonnaise, apple cider vinegar, sugar and chives. Shake well to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide shallots between peach halves, filling each peach cavity with about 1 tablespoon of cooked shallots (you may have extra). Divide lettuce leaves between 4 plates, top each plate with two peach halves and drizzle with buttermilk dressing. Sprinkle each salad with chopped bacon and serve immediately. </p>"}]}