{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140703-Sunday-Supper-Korean-Short-Ribs-Jennifer-Olvera-lo-res.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Korean", "keywords": ["Asian", "beef", "braise", "Korean", "short rib"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Slow-Cooked Korean Short Ribs With Green Onion and Pear", "link": "https://www.seriouseats.com/recipes/2014/07/slow-cooked-korean-short-ribs-green-onion-pear-recipe.html", "description": "Braised short ribs are one of the most comforting of comfort foods, but they're not exactly summer fare. By borrowing some tricks from Korean cooking&mdash;such as flavoring them with a <em>kalbi</em>-style sauce and topping them with refreshing green onion and pear&mdash;this version transforms them into a warm-weather-friendly main course.", "totalTime": "4 hours", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Braising and Stewing", "Korean", "Mains", "Sunday Supper"], "recipeIngredient": ["1 1/2 tablespoons extra-virgin olive oil", "1 1/2 pounds boneless beef short ribs", "Freshly ground black pepper", "3 medium cloves garlic, minced", "1 1/2 tablespoons minced fresh ginger", "1/2 cup mirin or sweet sherry, or more as needed", "1/4 cup ponzu sauce", "1/4 cup low-sodium soy sauce", "1/4 cup apple juice", "1 tablespoon toasted sesame oil", "1/2 cup plus 2 tablespoons water, plus more as needed", "1/3 cup packed dark brown sugar", "2 tablespoons Chinese black vinegar or unseasoned rice vinegar", "2 tablespoons cornstarch ", "Cooked white rice, for serving", "2 green onions, thinly sliced, including green parts", "1 Asian pear or other just-ripe pear, cored and cut into matchsticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 325&deg;F. Heat oil in an oven-safe Dutch oven over high heat until shimmering. Season meat generously with pepper, then sear until browned on all sides, about 4 minutes per side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to medium. Add garlic and ginger and cook, stirring constantly, until browned, about 2 minutes. Add mirin and scrape up any browned bits from bottom of Dutch oven. Add ponzu sauce, soy sauce, apple juice, sesame oil, 1/2 cup water, brown sugar, and vinegar and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a simmer, cover, and transfer to oven. Braise, turning beef once and adding water if necessary to keep it halfway submerged throughout cooking, until beef is fork-tender, about 3 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer beef to a platter and skim fat from cooking juices in Dutch oven. Taste cooking juices: If too concentrated, dilute to taste with water and/or mirin. Combine cornstarch with remaining 2 tablespoons water, whisking thoroughly to remove any lumps. Whisk cornstarch slurry into cooking juices, bring to a boil over high heat, and cook until gravy is thickened, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve short ribs over rice, drizzled with gravy and garnished with green onion and pear.</p>"}]}