{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140321-286697-cook-the-book-boiling-bacon-parsley-sauce.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "ham", "irish", "my irish table", "parsley", "pork", "pork belly"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Boiling Bacon with Parsley Sauce From 'My Irish Table'", "link": "https://www.seriouseats.com/recipes/2014/03/boiling-bacon-with-parlsey-sauce-from-my-irish-table.html", "description": "<strong><a href=\"http://www.restauranteve.com/index.cfm/restaurant/an-irish-souls-culinary-passion/\" target=\"_blank\">Cathal Armstrong</a></strong> serves this \"boiling bacon,\" or brined pork belly, for Halloween, but that doesn't mean we can't enjoy it in March. It is, after all, comforting enough to tide us through the rocky weather of early spring, and the bright, herbaceous parsley sauce with which it's served has hints of the warm weather to come.", "totalTime": "3 1/2 hours, plus 3 days brining time for the pork", "recipeYield": "Serves 6", "recipeCategory": ["Bacon", "Condiments and Sauces", "Cook the Book", "Ham", "Mains", "Pork"], "recipeIngredient": ["<strong>Brine</strong>", "1 quart water", "1 cup kosher salt", "1/2 cup sugar", "1 quart water frozen into ice cubes (2 pounds)", "1 small head garlic, unpeeled, halved crosswise", "1 yellow onion, quartered", "2 tablespoons pink curing salt such as sel rose or Insta Cure #1", "1/2 teaspoon black peppercorns", "1/2 teaspoon yellow mustard seeds", "1/2 small bunch fresh sage", "&nbsp", "1 (2 1/2-pound rectangle) pork belly, preferably Kurobuta or Berkshire, rind removed", "&nbsp", "<strong>Parsley Sauce</strong>", "2 tablespoons unsalted butter", "2 1/2 tablespoons all-purpose flour", "1 1/2 cups whole milk, warmed", "1/2 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "Pinch of freshly ground nutmeg", "1/2 cup chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the brine:</strong> In a large pot over high heat, bring the 1 quart of water to a boil. Add the kosher salt and sugar, stirring until they are dissolved. Remove from the heat and stir in the ice to completely cool the brine. Add the garlic, onion, curing salt, peppercorns, mustard seeds, and sage. The brine can be kept for several days in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Brine the bacon:</strong> Place the pork belly in a 2 1/2-gallon zip-top bag placed in a large bowl. Pour the brine into the bag. Seal the bag, removing as much air as possible so that the pork is completely submerged. Refrigerate the pork in the bag for 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Boil the pork:</strong> Remove the pork from the brine; discard the brine and thoroughly rinse the pork under cold running water. In a large pot, cover the pork with cold water and boil it over high heat for 3 hours, or until fork tender. Add water as needed throughout the process so the pork remains covered at all times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the parsley sauce:</strong> In a saucepan over medium heat, heat the butter until it bubbles. Whisk in the flour and cook for 2 to 3 minutes, whisking constantly, until the mixture is blond in color. Whisking continually, slowly add the milk. Bring the sauce to a boil and cook until it thickens, about 3 minutes, whisking continually to keep lumps from forming. Add the salt, pepper, nutmeg, and parsley, whisking to incorporate. Season with more salt and pepper if you wish. It can be stored in the refrigerator for up to 2 days. (To reheat, heat 1/2 cup milk in a saucepan over medium heat and stir in the sauce in batches, warming each one through before adding the next.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Broil the bacon:</strong> Heat the broiler, positioning the rack 8 inches from the heating element. Remove the bacon from the pot, blot it dry with paper towels, and place it on a rimmed baking sheet. Broil it for several minutes until the top is dark brown and crisp. Be patient with the broiling. It doesn’t have to be high temperature or close to the heat: you want a nice, even caramelization and crunchiness on the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Present the dish:</strong> Spoon the warm parsley sauce into a small bowl. Transfer the bacon to a cutting board and slice it 1/2 inch thick, cutting crosswise. Arrange the bacon on a serving platter or individual plates; serve with the sauce on the side.</p>"}]}