{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141022-witch-finger-cookies-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Niki Achitoff-Gray"}, "recipeCuisine": "", "keywords": ["cookie", "dessert", "Jam", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "4"}, "name": "Witch Finger Shortbread Cookies With Raspberry Jam", "link": "https://www.seriouseats.com/recipes/2014/10/bloody-halloween-witch-finger-cookies-shortbread-and-jam.html", "description": "These Halloween witch finger cookies are filled with a tart-sweet raspberry jam. Not only does it give them a bleeding effect when you bite in, but they're a lot more moist and flavorful to boot.", "totalTime": "2 hours", "recipeYield": "Makes 24 cookies", "recipeCategory": ["Cookies", "Desserts"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/04/classic-butter-shortbread-cookie-recipe.html\">Classic Butter Shortbread Cookie Dough</a>, uncooked (through step 1)", "6 tablespoons raspberry jam", "24 sliced almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough into two equal balls. On a piece of parchment paper, roll each portion out until 1/4-inch thick, keeping a roughly rectangular shape. Place dough and parchment paper on baking sheets, cover with plastic wrap, and refrigerate for at least 1 hour and up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove one portion of dough from the refrigerator. Slice the dough into 1-inch thick strips and lift the sides to form a trough along the length of the strip.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working quickly, take a heaping teaspoon of jam and spread it along the length of the dough and carefully pinch the dough closed to form a long, thin cylinder roughly 10-12 inches long. Repeat for remaining strips. Make sure the tube is completely sealed along the seam. If dough begins to feel soft and mushy, return the tray to the fridge for 20 minutes before resuming.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice the tubes in half. Pinch one end shut, dab it with jam, and press on an almond sliver \"nail.\" Squeeze the sides to create a bulged \"knuckle\" area and, using the dull edge of your knife or a spoon, press into both the knuckle and the area below the nail several times to create a wrinkled appearance. Add a spoonful of jam over the base of each finger and return the tray to the refrigerator for at least 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper and lower middle positions and preheat oven to 300&deg;F. Repeat steps 2 through 4 with remaining tray of rolled-out dough. Bake both trays until the cookies are lightly golden-brown, rotating top to bottom and back to front half way through cooking, 15 to 20 minutes total. Let cool for 20 minutes before serving.</p>"}]}