{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141117-red-beans-rice-max-falkowitz.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["bean", "cajun", "leftover", "louisiana", "red beans and rice", "smoked turkey", "Southern", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Red Beans and Rice With Smoked Turkey", "link": "https://www.seriouseats.com/recipes/2014/11/red-beans-and-rice-with-smoked-turkey-leftover-thanksgiving-recipe.html", "description": "The Louisiana meal of red beans and rice is typically made with pork: smoked, salted, roasted, or pickled. Those all work well in this recipe (a pound of sliced and browned andouille sausage would be our choice), but the beans also shine with smoked turkey.", "totalTime": "3 hours, plus overnight soak", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Sides", "Turkey"], "recipeIngredient": ["<strong>For the beans:</strong>", "1 pound red kidney beans, rinsed and sorted", "6 tablespoons kosher salt, plus more for seasoning", "4 quarts water", "4 tablespoons vegetable or canola oil", "1 large onion, finely chopped (about 1 1/2 cups)", "1 green bell pepper, finely chopped (about 1 cup)", "2 ribs celery, finely chopped (about 1 cup)", "6 cloves garlic, minced (about 2 tablespoons)", "1 jalapeño pepper, minced (about 2 tablespoons)", "1 tablespoon minced fresh thyme leaves", "3 bay leaves", "1/2 teaspoon cayenne pepper", "1 pound pulled or chopped smoked turkey, or 1 smoked turkey leg", "8 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken or turkey stock", "Freshly ground black pepper", "<strong>For the rice:</strong>", "5 cups water", "3 tablespoons unsalted butter", "2 1/2 cups long grain rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the beans: </strong>In a large pot or container, combine beans, salt, and water and stir until salt dissolves. Cover and let soak for 8 to 12 hours. Drain soaked beans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 5-quart Dutch oven over medium heat until shimmering. Add onion, bell pepper, celery, and a pinch of salt. Cook, stirring frequently, until onions are soft and translucent but not browned, about 7 minutes. Add garlic and jalapeño and cook, stirring, until fragrant, about 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add thyme, bay leaves, cayenne, stock, smoked turkey, and beans. Stir to combine. Increase heat to high and bring to a boil. Cover and reduce to a bare simmer. Cook until beans are very soft but not falling apart, 2 to 3 hours. If using smoked turkey leg, remove it now to let cool slightly, then remove skin and pull meat into fine pieces. Remove Dutch oven lid and increase heat to high. Cook beans at a hard simmer, stirring frequently, until broth is reduced to your liking. Add pulled drumstick meat back to pot if using. Season with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the rice:</strong> In the last half hour of bean-cooking, bring water and butter to a boil over high heat in a heavy-bottomed pot. Stir in rice, reduce to a bare simmer, and cover. Cook until rice is tender and liquid is fully absorbed, about 20 minutes. Serve beans ladled over a pile of rice.</p>"}]}