{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141027-pumpkin-lasagna-food-lab-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["apple", "comfort", "fall", "Italian", "lasagna", "pasta", "squash", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "The Best Squash Lasagna", "link": "https://www.seriouseats.com/recipes/2014/10/the-best-squash-lasagna-food-lab-recipe.html", "description": "Roasted squash and sage are classic fall and winter flavors. I wanted to find the best way to incorporate them into a rich, creamy lasagna. The result&mdash;after a bit of tweaking and testing, of course&mdash;was a squash lasagna with intense, rich, sweet squash flavor balanced with chunks of sage-scented browned squash and apple, all layered with a creamy Gruyère white sauce and layers of tender pasta.", "totalTime": "2 hours 15 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Apple", "Christmas", "Italian", "Lasagna", "Mains", "Squash", "Thanksgiving", "The Food Lab", "Vegetarian"], "recipeIngredient": ["1 large kabocha squash or sugar pumpkin (about 2 1/2 pounds), quartered, seeds discarded", "1 tablespoon olive oil", "Kosher salt and freshly ground black pepper", "1 large egg", "4 ounces cream cheese", "6 tablespoons unsalted butter, divided", "2 tablespoons maple syrup", "1/4 teaspoon cinnamon", "1/4 teaspoon freshly grated nutmeg, divided", "2 crisp baking apples such as Golden Delicious, peeled, cored, and cut into 1/2-inch dice", "1/4 cup minced fresh sage leaves", "1 package no-boil lasagna noodles (15 noodles)", "2 medium cloves garlic, minced (about 2 teaspoons)", "2 tablespoons flour", "2 cups whole milk", "12 ounces shredded Gruyère cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 325&deg;F. Toss three squash quarters with 1 tablespoon olive oil and coat thoroughly using your hands. Season with salt and pepper. Place in a cast iron skillet or on a foil-lined rimmed baking sheet and roast until a knife meets no resistance when poked into the flesh around the stem, about 45 minutes. Remove from oven and set aside until cool enough to handle. Increase oven temperature to 400&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape roasted squash flesh out into the work bowl of a food processor. Add egg, cream cheese, 2 tablespoons butter, maple syrup, cinnamon, and half of nutmeg. Process until a completely smooth purée is formed. Transfer to a medium bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While squashes are roasting in step 1, cut remaining squash quarter into 1/2-inch dice. Melt 2 more tablespoons butter in a large skillet over high heat, swirling until foaming subsides. Add diced squash and apple and cook, tossing and stirring frequently until tender and browned on most sides, about 10 minutes. Season to taste with salt and pepper and add minced sage. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place lasagna noodles in a 9- by 13-inch casserole dish and cover with cold water. Set aside, agitating the noodles occasionally to make sure they aren't sticking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwehile, heat remaining 2 tablespoons butter and garlic in a medium saucepan over medium heat. Cook, stirring, until butter has melted and garlic is fragrant, about 1 minute. Add flour and cook, whisking constantly, until flour starts to smell nutty and is pale blond, about 2 minutes. Whisking constantly, slowly add the milk in a thin, steady stream. Once milk is fully incorporated, bring to a boil, whisk vigorously, then remove from heat. Add 8 ounces of Gruyère cheese and whisk until completely smooth. If any lumps remain, blend with a hand blender or in a standing blender until smooth. Add remaining 1/8th teaspoon nutmeg and season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lasagna noodles from baking dish and transfer to clean dish towels to blot excess moisture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread 1/6th of the white sauce over the bottom of the baking dish and top with three lasagna noodles. Add 1/5 of squash puree and 1/4 of sautéed squash and apple mixture. Top with 1/6th of white sauce. Repeat with 3 more layers of noodles, squash puree, cooked squash mixture, and white sauce. At this stage, you should have used up all of the sautéed squash and still have 1/6th of the white sauce and 1/5th of the squash purée remaining. Place the final three noodles on top of the lasagna, top with the remaining purée, the remaining 4 ounces of shredded Gruyère, and drizzle with the remaining white sauce. Cover with aluminum foil, and transfer to the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, covered, for 20 minutes. Remove foil and continue baking until browned and bubbly, about 15 minutes longer. Remove from oven, let rest for 5 minutes, slice, and serve.</p>"}]}