{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20140930-btb-huckleberry-quince-goatcheese-galette.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "dessert", "huckleberry", "pear", "quince"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quince and Goat Cheese Galette From 'Huckleberry'", "link": "https://www.seriouseats.com/recipes/2014/10/quince-and-goat-cheese-galette-from-huckleberry.html", "description": "How can one humble galette be sweet and flaky, <em>and</em> salty and sour? By combining poached quince and fresh goat cheese, that's how. Slices of the fruit are simmered in sugar and vanilla and arranged over a tart mix of chevre and crème fraîche.", "totalTime": "Overnight, if making dough", "recipeYield": "Serves 8", "recipeCategory": ["Bake the Book", "Fruit Desserts", "Pear", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["10 cups/2.4 L water ", "4 cups/800 g sugar, plus more for sprinkling", "1 vanilla bean, split and scraped ", "1 pinch salt ", "4 quince, peeled ", "1 batch Everyday Flaky Dough (ingredients below) ", "1 cup/220 g goat cheese", "2 tablespoons crème fraîche ", "1 batch Egg Wash (ingredients below)", "2 tablespoons unsalted butter", "<strong>Everyday Flaky Dough</strong>", "2 cups/250 g all-purpose flour ", "1/4 cup/50 g sugar ", "1/2 teaspoon baking powder ", "3/4 teaspoon kosher salt ", "1 cup/220 g cold unsalted butter, cubed ", "1/4 cup/60 ml water", "<strong>Egg Wash</strong>", "2 egg yolks ", "2 tablespoons heavy cream ", "Pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the dough: <br />\r\nTo mix with a food processor, pulse the flour, sugar, baking powder, and salt once to blend. Add the butter to the work bowl and pulse about three times until pea-size pieces form. Pour the water over the flour mixture and pulse another three times until the dough is only just starting to come together. To mix by hand, combine the flour, sugar, baking powder, and salt in a very large bowl. Stir to blend. Add the butter, working it between your fingertips until the pieces are pea- and lima bean–size. Add the water and lightly toss to distribute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The dough should be shaggy, dry, and clumpy. Dump it onto a clean work surface to bring the dough together by hand. (Do not flour the counter, as you do not want to add any more flour to the dough.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Begin by firmly pressing the entire surface of the dough with the heel of your palm. Toss and squeeze the dough to redistribute the wet and dry patches. Repeat, pressing thoroughly again with the heel of your palm, and continue pressing, tossing, and squeezing until the dough begins to hold together. But be sure not to overwork the dough! It should stay together but you should still see pea-size bits of butter running through. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the dough into a disc 3/4 in/2 cm thick, wrap tightly in plastic, and refrigerate for at least 1 hour, or freeze for up to 1 month. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you’re ready to use the dough, if refrigerated for longer than 1 hour, allow the dough to warm up at room temperature for a few minutes. If frozen, thaw in the refrigerator overnight before shaping. The dough should feel cold to the touch but malleable. Never allow the dough to become too soft or warm. Chill as needed while working. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the Egg Wash: Combine the egg yolks, heavy cream, and salt and whisk until homogeneous. Refrigerate until needed. This keeps, refrigerated, for up to 2 days. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the Galette: Bring the water, sugar, vanilla bean, and salt to a simmer in a pot over high heat, whisking until the sugar dissolves. Reduce the heat to low, add the quince, cover, and simmer until the quince are fork-tender but not falling apart, about 50 minutes. Refrigerate until cooled completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, allow the flaky dough to soften at room temperature for 10 to 20 minutes, depending on the temperature of your house, before rolling. The dough should be cold but malleable. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together the goat cheese and crème fraîche. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Core and slice the quince into slices 1/4 in/6 mm thick. Set aside. Reserve the poaching liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, roll the dough to a 13-by-15 in/ 33-by-38 cm rectangle about an even 1/8 in/3 mm thick. Trim the edges to make them even and transfer to a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the goat cheese mixture in the center of the dough, leaving a 3-in/7.5-cm border all around the edge. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a paper towel, lightly dry the quince and position the quince over the goat cheese mixture in even rows of overlapping slices. Brush the exposed dough with egg wash and fold it over the filling, pressing the corners to seal. The dough should only partially cover the filling and you should have a nice rectangular galette. Brush the top of the dough with egg wash and sprinkle with sugar. Dot the exposed quince with the butter. Freeze for 25 minutes, or up to 1 month, tightly wrapped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 375°F/190°C. Bake from frozen for about 1 hour, or until deep golden brown. Don’t be afraid of good color. Trust us. Immediately brush the dough and the exposed fruit with the quince poaching liquid. Allow to cool on the sheet pan before transferring to a serving platter. Serve at room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This is best the day it’s made but keeps, tightly wrapped, at room temperature, for up to 1 day.</p>"}]}