{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2014/12/CrownRoastLamb.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["Christmas", "couscous", "holiday", "lamb", "roast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Crown Roast of Lamb With Couscous Stuffing and Pistachio-Mint Sauce", "link": "https://www.seriouseats.com/recipes/2014/12/crown-roast-rack-lamb-couscous-recipe.html", "description": "The reverse-sear method produces a crown roast of lamb that's evenly cooked and a showstopping centerpiece for a holiday meal.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Christmas", "Easter", "Lamb", "Mains", "Roasting", "Spring"], "recipeIngredient": ["1 (3- or 4-pound; 1.4- to 1.8kg) crown roast of lamb, prepared by the butcher", "Kosher salt and freshly ground black pepper", "<strong>For the Stuffing (see note):</strong>", "1 cup (240ml) boiling <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">chicken stock</a>, low-sodium broth, or water", "1/2 cup dried apricots, diced", "1/2 cup pitted prunes, diced", "1/2 cup shelled pistachios", "1/2 cup plus 3 tablespoons (165ml) extra-virgin olive oil, divided", "1 medium onion, minced", "1/2 teaspoon ground coriander", "4 cups warm cooked couscous (from about 2 cups dry), fluffed", "3/4 cup minced parsley", "Kosher salt and freshly ground black pepper", "<strong>For the Sauce (see note):</strong>", "1 cup packed fresh mint leaves", "1/2 cup packed parsley leaves and tender stems", "1/4 cup shelled pistachios", "1 cup (240ml) extra-virgin olive oil", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 200&deg;F (90&deg;C) and position oven rack low enough to fit crown roast in oven. Generously season crown roast all over with salt and pepper. Place roast on a rack set in a rimmed baking sheet and roast until lamb registers 115&deg;F (46&deg;C) on an instant-read thermometer inserted into center of loin, 1 to 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Stuffing:</strong> In a heatproof bowl, pour boiling stock or water over apricots, prunes, and pistachios and let steep for 10 minutes. Meanwhile, in a medium skillet, heat 3 tablespoons (45ml) olive oil over medium-high heat until shimmering. Add onion and coriander, lower heat to medium, and cook, stirring, until golden and soft, about 8 minutes. Drain dried fruit and pistachios of any excess liquid. In a large bowl, toss together couscous, apricots, prunes, pistachios, cooked onions, parsley, and remaining 1/2 cup (120ml) olive oil. Season with salt and pepper and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Using an immersion blender, blender, or food processor, pulse mint, parsley, and pistachios until roughly chopped. Add 1/4 cup (60ml) olive oil and pulse until herbs and nuts are finely chopped. Stir in remaining 3/4 cup (180ml) olive oil and season with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When lamb reaches 115&deg;F (46&deg;C), remove from oven. Increase oven to highest possible temperature (broil setting on some ovens, or about 500&deg;F/260&deg;C on others) and allow to heat fully. Cover lamb rib bones with foil. Roast lamb, checking temperature every 5 minutes and then more frequently as it approaches doneness, until lamb is browned and an instant-read thermometer inserted into thickest part of lamb registers 125 to 130&deg;F (52 to 54&deg;C) for medium-rare, or 130 to 135&deg;F (54 to 57&deg;C) for medium, about 10 minutes. Let lamb rest for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stuff with warm couscous and serve, passing sauce at the table. To carve lamb, slice lamb between rib bones into chops.</p>"}]}