{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140227-284937-mardi-gras-cake-batter.jpg", "author": {"@type": "Person", "name": "Alexandra Penfold"}, "recipeCuisine": "", "keywords": ["cake", "cream cheese frosting", "layer cake", "mardi gras"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mardi Gras Tie-Dye Cake", "link": "https://www.seriouseats.com/recipes/2014/02/mardi-gras-tie-dye-cake.html", "description": "If you're looking for something delicious and fun to put everyone in the Fat Tuesday spirit, try out this Mardi Gras-themed tie-dye cake.", "totalTime": "3 hours", "recipeYield": "Serves 12", "recipeCategory": ["American Classics", "Cakes", "Mardi Gras"], "recipeIngredient": ["<strong>For the Cake</strong>", "11 1/2 ounces (about 2 1/4 cups) all purpose flour, plus more for flouring pans", "1 tablespoon baking powder", "1/2 tablespoon salt", "11 1/2 ounces (about 1 2/3 cups) sugar", "16 tablespoons unsalted butter, softened and divided into 1 tablespoon pieces, plus more for greasing pans", "4 large eggs, room temperature", "2 yolks from large eggs, room temperature", "1 tablespoon vanilla extract", "1 1/4 cups whole milk, room temperature", "Green, yellow, and purple food coloring", " ", "<strong>For the Cream Cheese Frosting</strong>", "5 ounces sugar", "1/4 cup cornstarch", "1/4 teaspoon Kosher salt", "1 large egg", "1 egg yolk from a large egg", "8 ounces whole milk", "2 teaspoons vanilla extract", "16 tablespoons unsalted butter, room temperature", "8 tablespoons cream cheese, room temperature", "2 tablespoons lemon juice from one lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to middle position and preheat oven to 350°F. Grease and flour three cake pans and set aside. In a medium bowl whisk together flour, baking powder, and salt, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In bowl of a stand mixer fitted with a paddle attachment, cream butter and sugar together on high speed until light and fluffy (about 5 minutes). Reduce mixer speed to medium and add eggs and yolks, one at a time, mixing well between each addition until incorporated and scraping down sides with a rubber spatula as needed. Once eggs have been added, mix in vanilla. Alternate adding dry ingredients and milk a third at a time on low speed, mixing until just incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide mixture into three medium bowls. Stir in drops of food coloring in your first bowl until it reaches a desired shade of green. Repeat in separate bowls with the purple and yellow food coloring. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon spoonfuls of batter into the prepared pans, staggering the colors. Each pan should have the same amount of batter. Once you've added the batter to all of the pans, very gently rock the pan back and forth so the batter settles and the top flattens out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until cake is golden brown and springy to the touch and cake tester inserted into center comes out clean, 25-27 minutes, rotating the pans halfway through. Cool cakes in the pan for 15 minutes then carefully release from the pan onto cooling racks to cool completely. Do not assemble cake until it has completely cooled. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting</strong>: In a medium bowl, whisk together sugar, cornstarch, salt, egg, and egg yolk until thoroughly combined. Set aside.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, whisk together milk and vanilla extract. Heat over medium heat until small bubbles form along the edges. Remove from heat. Quickly whisk half of the milk mixture into the sugar and egg mixture to temper. Once combined, quickly whisk the tempered mixture back into the saucepan with the remaining milk mixture. Turn the heat back to medium and whisk continuously until the mixture thickens to pudding-like consistency. Once the mixture has thickened and is bubbling, continue whisking one minute more then remove from heat. Transfer the custard to a large bowl or the bowl of a stand mixer. Fit the mixer with the whisk attachment and whisk continuously on high until the mixture has completely cooled (note: the custard must be absolutely, completely cool before you add the butter. If you have extra time you can always place a piece of plastic wrap on top of the custard and refrigerate it until it is completely chilled). Once the custard is cooled, put the mixer on high and add the butter one tablespoon at a time. Add the cream cheese one tablespoon at a time until it is well combined and the texture of the frosting is light and fluffy. Beat in the lemon juice until fully incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Frost cake adding a thin layer of frosting between the layers to leave enough to cover the top and sides of the cake completely. Refrigerate for 1 hour before serving to set the frosting. Store covered in the refrigerator.</p>"}]}