{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140225-284253-cook-the-book-empanada-with-marinated-pork-onions-peppers.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Spanish", "keywords": ["Cook the Book", "empanada", "pepper", "pork", "spain", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Empanada with Marinated Pork and Roasted Red Peppers (Empanada de Lomo) From 'Spain'", "link": "https://www.seriouseats.com/recipes/2014/02/empanada-with-marinated-pork-and-roasted-red.html", "description": "My previous experience with empanadas consisted of individual hand-pies filled mostly with sweet ground beef and olives. But my perception of the savory pastries has totally shifted as of this week. Tucked into the tapas chapter of <a href=\"http://jeff-koehler.com/?page_id=2\" target=\"_blank\">Jeff Koehler</a>'s new cookbook, <em><a href=\"http://www.amazon.com/Spain-Recipes-Traditions-Verdant-Andaluc%C3%ADa/dp/0811875016/?tag=serieats-20\" target=\"_blank\">Spain</a></em>, is a recipe for a giant pie filled with slivers of paprika-marinated pork mixed with caramelized onions and peppers.", "totalTime": "About 4 hours, plus cooling time for empanada", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cook the Book", "Mains", "Pork", "Spanish"], "recipeIngredient": ["4 garlic cloves, peeled", "8 tablespoons extra-virgin olive oil, plus more for oiling the bowl", "2 tablespoons dry white wine", "1 1/2 teaspoons Spanish pimentón dulche (sweet paprika)", "1 teaspoon dried oregano", "Salt", "1 bay leaf", "12 ounces (340 g) pork fillets, thinly cut into 1/3-inch (1-cm) thick strips", "3 cups (375 g) all-purpose flour, plus more for work surface and pan", "1 1/2 tablespoons (20 g) firmly packed fresh baker's yeast or 2 teaspoons active dry yeast", "1/2 cup (120 ml) whole milk, warmed", "2 eggs, whisked", "2 medium onions, thinly sliced", "1 red bell pepper, halved crosswise and sliced into thin lengthwise strips", "Butter for greasing pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, blend the garlic, 3 tablespoons of the olive oil, the wine, 1 teaspoon of the pimentón, and the oregano. Season with salt and add the bay leaf and pork. Turn over to coat. Cover and marinate for at least a couple of hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the flour in a wide bowl and sprinkle in the remaining pimentón and 1 teaspoon salt, blend with your fingers, and make a crater in the middle. Dissolve the yeast in the milk and add along with one egg. Begin working into a ball while adding 2 tablespoons olive oil. (Add a touch more milk if needed.) Transfer the dough to a lightly floured work space and knead by hand for about 10 minutes, until supple and elastic and slightly tacky. Place it in a lightly oiled bowl, cover with plastic wrap, and let rise in a warm corner of the kitchen for about 1 hour, or until about doubled in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet or sauté pan, heat the remaining 3 tablespoons olive oil over medium heat, add the onions, and cook until they begin to soften and turn pale, about 5 minutes. Add the bell pepper and cook until it and the onions are tender and sweet, about 25 minutes. Reduce the heat to low and cover the skillet toward the end. Transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a heavy skillet over high heat. Discard the garlic and bay leaf from the marinade. Working in single-layer batches that don’t crowd the pan, quickly brown the pork in its marinade, 1 to 2 minutes per batch. Transfer to the bowl and blend with the onions and bell peppers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F/200°C/gas mark 6.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Butter and flour a 10 1/2-inch/27-cm pie pan or line it with a piece of parchment paper cut to fit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in half, with one piece slightly larger than the other. (The larger piece will be used for the bottom, the smaller for the top covering.) On a clean, lightly floured work surface, roll out the larger piece so that it will comfortably drape over the pie pan. Lay it over the pan, and gently tuck the inside against the sides of the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay in the pork, bell pepper, and onions. Spread out in a thick, even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the remaining piece of dough. Lay it on the top of the filling like a lid. Cut away and reserve the edges. Form a crimped edge by pinching the edges together with your fingers. Make a 1-inch/2.5-cm or so hole in the very center of the top to allow some steam to escape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the excess dough, decorate the top as desired. Roll out some pieces to run across the top or even make a cross, for instance, or make a simple braid to run along the edge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Paint the top of the empanada with the whisked egg using a pastry brush.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the empanada until the top is a lovely golden color, 20 to 25 minutes. Let the empanada cool before slicing into portions and serving.</p>"}]}