{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140211-vegan-enchilada-spinach-hominy-recipe-8.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["cashew", "cinco de mayo", "enchilada", "hominy", "Mexican", "spinach", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Vegan Spinach and Hominy Enchiladas With Spicy Cashew Cream", "link": "https://www.seriouseats.com/recipes/2014/02/vegan-spinach-and-hominy-enchiladas-with-spicy-cashew-cream.html", "description": "Rich and spicy enchiladas stuffed with spinach and hominy with a bright chile verde and smoky cashew-chipotle cream.", "totalTime": "1 hour 45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Dairy-Free", "Mains", "Mexican", "Nuts", "Spinach", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Salsa Verde</strong>", "1 1/2 pounds tomatillos, husks and stems removed", "1 to 2 jalapeño or serrano peppers, stem and seeds removed", "2 medium white onions, divided", "1 bunch fresh picked cilantro leaves and tender stems, divided", "Kosher salt", "2 tablespoons fresh juice from about 2 limes, plus 1 lime cut into wedges for serving", "&nbsp;", "<strong>For the Filling</strong>", "2 tablespoons vegetable oil", "4 medium cloves garlic, thinly sliced, divided", "2 teaspoons ground cumin seed", "1 teaspoon ground ancho chili powder", "2 bunches flat leaf spinach, washed and roughly chopped", "Freshly ground black pepper", "1 (28-ounce) can hominy, drained", "&nbsp;", "<strong>For the Cashew Cream</strong>", "1 cup rosted cashews", "1 medium clove garlic", "2 chipotle peppers packed in adobo sauce", "1/2 cup water or vegetable stock", "1 teaspoon red wine vinegar", "&nbsp;", "<strong>To Assemble</strong>", "18 soft corn tortillas, warmed and wrapped in foil or stored under a damp dish towel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salsa Verde:</strong> Combine tomatillos, serranos, and 1 onion (peeled and roughly chopped) in a medium saucepan and cover with water. Bring to a boil over high heat then reduce to a simmer. Simmer until vegetables are completely softened, about 10 minutes, stirring occasionally to make sure all sides are softened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain vegetables then transfer to a blender. Add 3/4 of cilantro, a large pinch of salt, and 1 tablespoon lime juice. Blend on medium speed until a chunky purée is formed, about 30 seconds. Transfer to a bowl, season to taste with more salt or lime juice if necessary, and reserve. Cooled salsa can be stored in a sealed container in the refrigerator for up to 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Finely mince half of remaining onion. Heat vegetable oil in a large saucepan over medium-high heat until shimmering. Add onion and garlic and cook, stirring frequently, until softened and light golden brown, about 4 minutes. Add cumin and chili powder and cook, stirring, until fragrant, about 30 seconds. Add spinach in batches, stirring and allowing each batch to wilt before adding the next. Cook, stirring, until excess moisture has evaporated, about 7 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer spinach to a colander to drain, pressing out excess moisture with a rubber spatula. Transfer to a large bowl and fold in hominy. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cashew Cream:</strong> Combine cashews, remaining garlic clove, chipotle, stock, and vinegar in the jar of a blender. Blend on high speed, adding water or stock as necessary to reach a thick, pancake batter-like consistency. Continue blending until completely smooth, about 2 minutes. Season to taste with salt and transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Set rack to 12 inches below broiler element and set broiler to high (alternatively, set oven to 475°F). Spread 1 1/2 cups of salsa verde across bottom of a 9- by 13-inch baking dish and transfer the rest to a shallow bowl. Working one tortilla at a time, dip tortillas into bowl of salsa verde, coating both sides thoroughly. Place on cutting board and top with 2 to 3 tablespoons of filling. Roll up tortilla and place edge-down in baking dish. Repeat until all tortillas are filled. Spread remaining salsa verde over top of tortillas. Spoon cashew cream over the baking dish in a single line down the center of each row of tortillas. Transfer to oven and bake until cashew cream is lightly browned and edges of tortillas are beginning to crisp, about 15 minutes. Thinly slice remaining half onion and roughly chop remaining cilantro. Sprinkle on top of enchiladas and serve.</p>"}]}