{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141217-tenderloin-roast-recipe-food-lab-13.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "Christmas", "filet mignon", "holiday", "low carb", "roast", "roast beef", "tenderloin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9375", "ratingCount": "16"}, "name": "Slow-Roasted Beef Tenderloin", "link": "https://www.seriouseats.com/recipes/2014/12/slow-roasted-beef-tenderloin-recipe.html", "description": "Whole-roasted beef tenderloin is a once-a-year celebratory dish that can be fantastic if done properly. The problem is, its extra-lean meat dries out and overcooks very easily. Our slow-roasting reverse-sear method ensures perfectly medium-rare meat from edge to center, with a nicely browned, flavorful crust.", "totalTime": "4 hours, plus up to 32 hours resting time (see note)", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Beef", "Christmas", "Gluten-Free", "Mains", "New Year", "Roasting", "The Food Lab", "Winter"], "recipeIngredient": ["1 center-cut trimmed beef tenderloin, 2 to 3 pounds (900g to 1.4kg; see note)", "Kosher salt and freshly ground black pepper", "4 tablespoons (57g) unsalted butter", "4 sprigs thyme", "1 shallot, roughly sliced", "Finely minced chives, for serving", "Coarse sea salt, such as <em>fleur de sel</em> or Maldon, for serving", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2011/04/sauced-horseradish-cream-sauce.html\">Horseradish Cream Sauce</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>The Day Before:</strong> Using butcher's twine, tie tenderloin at 1-inch intervals using <a href=\"http://www.seriouseats.com/2014/12/how-to-tie-a-butchers-knot.html\">butcher's knots</a>. Season generously with salt and pepper. Transfer to a wire rack set in a foil-lined rimmed baking sheet and refrigerate uncovered at least overnight and up to 2 nights.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>When Ready to Cook:</strong> Adjust oven rack to center position and preheat oven to 225&deg;F (107&deg;C). Place baking sheet with rack and tenderloin in oven and roast until internal temperature registers 120 to 125&deg;F (49 to 52&deg;C) on an <a href=\"http://thermoworks.com/products/thermapen/?tw=SERIOUSEATS\" target=\"_blank\">instant-read thermometer</a>, 2 to 3 hours. Remove from oven and set aside at room temperature for 10 minutes. Cut and remove twine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish Under the Broiler:</strong> Adjust rack to 6 inches from broiler element and preheat broiler to high. Heat butter, swirling, in a medium skillet over high heat until foaming subsides and butter turns a light nutty brown. Add thyme and shallots and stir until crackling stops. Pour butter mixture over tenderloin and spread with a spoon until all surfaces are coated. Remove shallots from top surface of meat. Place pan with tenderloin under broiler and broil, turning every 30 seconds, until meat is well browned on all sides and internal temperature registers 125&deg;F (52&deg;C) for rare or 130&deg;F (54&deg;C) for medium-rare, about 2 minutes total. Proceed to step 5.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on the Stovetop:</strong> Heat butter, swirling, in a medium skillet over high heat until foaming subsides and butter turns a light nutty brown. Add tenderloin, shallots, and thyme and cook, turning occasionally and spooning hot butter and aromatics over roast, until meat is well browned on all sides and internal temperature registers 125&deg;F (52&deg;C) for rare or 130&deg;F (54&deg;C) for medium-rare, about 1 1/2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer tenderloin to a cutting board and allow to rest for 5 minutes. Slice into 1/2-inch slices, sprinkle with chives and coarse sea salt, and serve with Horseradish Cream Sauce.</p>"}]}