{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140911-btb-glutenfreepoptarts.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "dessert", "gluten free", "Pop Tart", "the everyday art of gluten-free"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Le Pop Tart From 'The Everyday Art of Gluten-Free'", "link": "https://www.seriouseats.com/recipes/2014/09/le-pop-tart-from-the-everyday-art-of-gluten-free.html", "description": "When you can't have gluten, finding palatable substitutions to your favorite foods can be a real hassle. Luckily, we have Karen Morgan's <strong><em><a href=\"http://www.amazon.com/The-Everyday-Art-Gluten-Free-Fail-Proof/dp/1617690600/?tag=serieats-20\" target=\"_blank\">The Everyday Art of Gluten-Free</a></em></strong> to help you through that quest. Take this thickly-frosted, fruit-stuffed pop tart as a shining example of what can be done with a little starch manipulation.", "totalTime": "Overnight, for dough prep", "recipeYield": "Makes 12 tarts", "recipeCategory": ["Bake the Book", "Desserts", "Gluten-Free", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Short Crust:</strong>", "2 1/4 cups (272 g) Pie & Pasta Blend (see below)", "1 cup (2 sticks / 226 g) unsalted butter, diced and kept cold", "2 large eggs", "Glutinous rice flour (or additional Pie & Pasta blend), for dusting", "<strong>For the Buttercream Icing:</strong>", "1 cup (200 g) granulated sugar", "1 vanilla bean, split", "1 cup (2 sticks / 226 g) unsalted butter, softened", "4 cups (400 g) confectioners’ sugar", "1 1/2 cups (360 ml) jam or preserves of your choice (classics are strawberry, blueberry, and cherry)", "Dried or dehydrated fruit to match the preserves", "<strong>Pie & Pasta Blend:</strong>", "1 1/4 cups plus 3 tablespoons (160 g) tapioca starch", "1 cup plus 1/2 teaspoon (124 g) cornstarch", "3/4 cup plus 1 1/2 tablespoons (96 g) glutinous rice flour", "1/2 cup (52 g) sorghum flour", "1/4 cup plus 1 1/2 teaspoons (48 g) potato starch", "1/4 cup (48 g) granulated sugar", "1 tablespoon ( 9 g) guar gum", "1/2 teaspoon (3 g) kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Pie & Pasta Blend:</strong> Using the spoon-and-sweep method, measure each ingredient into a large bowl. Whisk together and then sift the mixture into a separate large bowl. Repeat several times. Since you are working with so many different starches, you really need to sift and whisk the blend several times to ensure an even distribution of all the ingredients. Kept in an airtight container, the Pie & Pasta Blend will keep for up to 1 year in your pantry. <strong>Note:</strong> Makes 4 1/2 cups (540 g), Enough for 2 batches of short crust or homemade pasta</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><Strong>Make the short crust:</strong> In the bowl of a stand mixer fitted with the paddle attachment, or in a food processor fitted with the S-blade, combine the Pie & Pasta Blend with the butter and beat or pulse them on the lowest setting until the mixture resembles damp cornmeal. Add the eggs and keep mixing until the dough pulls together and starts to ball up, about 1 minute with the mixer on high speed. The dough is done when it is sticking to the sides of the bowl and the paddle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dust your work surface with glutinous rice flour. Turn the dough out and lightly dust it with more rice flour. Knead the dough with the heel of your hand just until it is smooth. Form the dough into a ball, cut it in half, and shape each half into a 6- to 7-inch (15- to 17-cm) disk. Wrap each disk in plastic wrap and refrigerate for at least 2 hours, or overnight for best results.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the buttercream:</strong> In a small saucepan, combine the granulated sugar and 1/2 cup (120 ml) water and bring to a boil, stirring to dissolve the sugar. Add the vanilla bean. Reduce the heat to low and simmer the syrup for 5 minutes, swirling to be sure all the sugar has dissolved. Remove it from the heat and let the syrup infuse for 30 minutes. Remove the vanilla bean and discard it or rinse and reserve it for another use. Let the syrup cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the paddle attachment, beat the butter until it is smooth and free of lumps. Add in the confectioners’ sugar and 3 tablespoons of the cooled vanilla syrup and beat the mixture on high speed until it is very smooth. Set it aside in a cool place (not refrigerated), covered so the icing won’t harden, until you’re ready to use it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Assemble the tarts:</strong> Preheat the oven to 425°F (220°C). Arrange the oven racks in the middle and lower positions. Let the dough sit at room temperature for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly dust your work surface with glutinous rice flour and knead the dough until it is very uniform and smooth, about 8 turns. Shape the dough into two 4-by-6-inch (10-by-15-cm) rectangles. Roll them out to 1/8 inch (3 mm) thick, maintaining their rectangular shape. Trim each rectangle to 8 by 14 inches (20 by 35.5 cm), then cut each into four 4-by-7-inch (10-by-17-cm) rectangles.<br />\nSpread 1 generous tablespoon of preserves onto four of the rectangles, being sure to keep a border of at least 1/2 inch (12 mm) on all sides. Using the tip of your finger or a pastry brush, lightly dampen the dough border with cool water. Top each filled rectangle with an unfilled rectangle and seal the edges by applying smooth even pressure with your fingers or with the tines of a fork. Transfer the tarts to two unlined baking sheets, leaving at least 1 inch (2.5 cm) between each tart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 10 minutes, then switch the pans on the racks and bake for about 10 minutes more, until the tarts are browned on the edges.Let cool on the baking sheets for 5 minutes, then transfer to a wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an offset spatula, ice each tart with 1 to 2 tablespoons of the buttercream. If desired, dip your fingers in water and run them over the icing to smooth it out for that trademark sleek finish. Garnish each with a dried or dehydrated fruit reflective of the filling. The buttercream will keep for up to 2 weeks in an airtight container in the fridge for that next batch of pop tarts! Simply allow the icing to come to room temperature 1 hour before you plan on using it.</p>"}]}