{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140116-279645-cook-the-book-artichoke-enchiladas.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "feast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Artichoke Enchiladas From 'Feast'", "link": "https://www.seriouseats.com/recipes/2014/01/artichoke-enchiladas-from-feast.html", "description": "<a href=\"http://edibleliving.com/about/2/\" target=\"_blank\">Sarah Copeland</a>'s hearty vegetarian enchiladas in her new cookbook, <em><a href=\"http://www.amazon.com/Feast-Generous-Vegetarian-Meals-Appetite/dp/1452109737/?tag=serieats-20\" target=\"_blank\">Feast</a></em>, round out a unique filling of artichokes and quinoa with gooey Monterey Jack cheese and grassy cilantro leaves. The enchiladas are smothered in a tangy tomatillo-based sauce (easy to whip up with a broiler and blender), making them brighter than your average Tex-Mex order.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Cook the Book", "Mains", "Quinoa", "Vegetarian"], "recipeIngredient": ["<strong>Quinoa</strong>", "1 1/4 cups (300 ml) water ", "3/4 cup (145 g) quinoa ", "1/4 teaspoon sea salt ", " ", "<strong>Enchiladas</strong>", "2 tablespoons extra-virgin olive oil, plus more for the baking dish ", "1 red onion ", "1 1/2 pounds (680 g) tomatillos, husked", "2 serrano chiles, seeded for a milder sauce ", "1/2 cup (120 ml) vegetable stock or water", "Sea salt ", "1 teaspoon unbleached raw sugar ", "3/4 cup (130 g) fresh, frozen, or unmarinated jarred artichoke hearts (see Note) ", "10 fresh small corn tortillas ", "2 1/2 cups (290 g) grated Monterey Jack cheese ", "Handful fresh cilantro leaves, plus more for topping ", "1 cup (115 g) Cotija, queso añejo, queso fresco, or feta cheese, crumbled ", "Cayenne pepper for sprinkling ", "1 lime, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the quinoa: Bring the water, quinoa, and salt to boil in a medium saucepan over medium-high heat. Reduce to medium heat, cover, and simmer about 25 minutes. Set aside. (You can prepare the quinoa up to 2 days in advance; just be sure to cool completely and store in an airtight container.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the enchiladas: Lightly brush a 9-by-13-inch (23-by-33-cm) baking dish or casserole with olive oil. Preheat the broiler to high. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve the onion. Slice one half into thin rings and cut the other half into wedges. Arrange the onion wedges, tomatillos, and serranos on a baking sheet and broil until the tomatillos are soft and browned, 15 to 20 minutes, turning with tongs halfway through cooking. Transfer the onion, tomatillos, and serranos with any of their liquid to a blender or food processor, add the stock, and purée until smooth, about 3 minutes. Add 1/2 teaspoon salt and the sugar and pulse a few times to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toss the artichokes with the 2 tablespoons olive oil in a bowl and season lightly with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Steam or warm the tortillas in the microwave (wrap a stack in barely damp paper towels and microwave for 20 to 30 second, then wrap in a kitchen towel to keep warm); keep them wrapped. Toss the artichokes and quinoa with two-thirds of the Monterey Jack in a bowl. Place a tortilla on the work surface. Spoon 2 to 3 tablespoons of the artichoke mixture down the middle of the tortilla, add some cilantro leaves, and roll up the tortilla, leaving the ends open. Tuck the enchilada, seam-side down, into the prepared baking dish. Repeat with the remaining tortillas and artichoke filling, lining up the enchiladas side by side in the baking dish. Broil until the tortillas are crisp and golden around the edges, 3 to 4 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour most of the tomatillo sauce over and around the sides of the enchiladas and sprinkle the remaining Monterey Jack on top. Broil until the cheese is golden brown, 1 to 2 minutes more. Remove from the oven and top with the sliced onion, Cotija, and remaining cilantro. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the enchiladas among plates and sprinkle them lightly with cayenne. Serve warm with lime wedges. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: The beauty of the artichoke filling is that it will truly work with whatever artichokes you can find, from fresh to frozen or even canned. If all you can find is marinated artichokes, drain your artichokes and pat dry, and skip the step of seasoning the artichokes before filling your enchiladas.</p>"}]}