{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141013-tortilla-pizza-food-lab-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "pizza", "quick", "tortilla", "tortilla pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9", "ratingCount": "20"}, "name": "Extra-Crispy Bar-Style Tortilla Pizza", "link": "https://www.seriouseats.com/recipes/2014/10/extra-crispy-bar-style-tortilla-pizza-recipe.html", "description": "Bar pies are the pizza for those who love thin crusts, and while making them from scratch is doable, sometimes you just need that pizza NOW. Far from being a compromise, tortilla-based pizzas are in fact the <em>ideal</em> quick and easy-way to make a super-crisp, extra-thin crust for a full-on pizza experience in under 15 minutes from start to finish.", "totalTime": "12 minutes", "recipeYield": "Serves 1 to 2", "recipeCategory": ["Mains", "Pizza", "Quick Dinners", "Snacks", "The Food Lab", "The Pizza Lab", "Vegetarian"], "recipeIngredient": ["1/2 teaspoon extra-virgin olive oil, plus more for drizzling", "1 (10-inch) flour tortilla", "1/4 cup store-bought or <a href=\"http://www.seriouseats.com/recipes/2010/10/new-york-style-pizza-sauce.html\">homemade pizza sauce</a>", "1 1/2 ounces shredded whole milk low moisture mozzarella cheese", "1 ounce grated Parmesan cheese, divided", "2 basil leaves, roughly torn", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to 6 to 8 inches below broiler element and preheat broiler to high. Heat oil in a large cast iron skillet over high heat until shimmering. Reduce heat to medium-low and wipe out excess oil with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tortilla in skillet with the rougher textured-side facing down. Spread sauce evenly over tortilla all the way to the edges. Spread mozzarella and half of Parmesan evenly over tortilla all the way to the edges. Season lightly with salt. Scatter with basil and drizzle with olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place skillet under broiler and broil until cheese is melted and starting to brown in spots, 2 to 4 minutes. Remove from oven and sprinkle with remaining Parmesan. Using a small metal spatula, gently pry edges of pizza, releasing the cheese from the skillet. Peek under bottom. If more crispness is desired, place skillet over medium heat and cook, swirling pizza and peeking occasionally, until desired crispness is achieved. Slide pizza out onto a cutting board. Cut and serve immediately.</p>"}]}