{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140212-283000-baked-chicken-spaghetti.1.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["chicken", "easy", "pasta", "spaghetti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Spaghetti Pie", "link": "https://www.seriouseats.com/recipes/2014/02/baked-chicken-spaghetti-pie.html", "description": "Got the spaghetti blues? Amp up your routine with this cheesy-meaty baked version.", "totalTime": "45 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Chicken", "Chicken Dinners"], "recipeIngredient": ["5 ounces angel hair pasta, broken in half (see note)", "2 tablespoons olive oil", "1 small onion, chopped (about 3/4 cup)", "Kosher salt and freshly ground black pepper", "8 ounces ground chicken", "2 cloves garlic, minced", "1/2 teaspoon chili flakes", "1 (14-ounce) can diced tomatoes, strained", "1 (8-ounce) can tomato purée", "6 ounces cheddar cheese (or Colby or Monterey Jack), shredded, divided", "1 ounce Parmesan cheese, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat to 400&deg;F. Bring 2 quarts water to boil in medium pot over high heat. Season generously with salt and pasta. Quickly cook until pasta is al dente (about 2 minutes). Immediately drain and run cold water over pasta to cool. Spread onto a plate and place in the freezer while you prepare the sauce (see note).  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in large saucepan over medium heat until shimmering. Add onion and season with salt. Cook, stirring, until just softened, about 5 minutes. Add chicken and garlic, and cook, breaking up with spoon, until chicken is no longer pink, about 2 minutes. Add chili flakes, 1/4 teaspoon black pepper, strained tomatoes, and purée, and bring to a simmer. Cook, stirring occasionally, until lightly thickened and flavors have melded, about 5 minutes. Let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place sauce, spaghetti, 5 ounces cheddar, and Parmesan in large bowl. Toss to combine. Spread into 2 quart casserole dish, top with remaining ounce of cheddar, and bake until top is crispy, about 20 minutes. Serve. </p>"}]}