{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141113-slow-cooker-stuffing-recipe-5.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["comfort", "dressing", "slow cooker", "stuffing", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "6"}, "name": "Slow Cooker Sage and Sausage Stuffing", "link": "https://www.seriouseats.com/recipes/2014/11/slow-cooker-sage-sausage-stuffing-recipe.html", "description": "Bread puddings and other moist dishes come out extremely well when cooked in a slow cooker. This classic stuffing, flavored with sage and pork sausage, is no different.", "totalTime": "6 hours", "recipeYield": "Serves 10 to 14", "recipeCategory": ["Christmas", "Fall", "Pork", "Seasonal and Holiday", "Sides", "Slow Cooker", "Thanksgiving", "The Food Lab", "Winter"], "recipeIngredient": ["2 1/2 pounds (1.25kg) high-quality sandwich bread or soft Italian or French bread (about 2 loaves), cut into 3/4-inch dice (about 5 quarts)", "8 tablespoons butter (1 stick; 4 ounces; 115g), plus more for buttering slow cooker", "1 1/2 pounds (680g) sage sausage, removed from casing", "1 large onion (about 12 ounces; 350g), finely chopped (about 2 cups)", "4 large ribs celery (about 12 ounces; 350g), finely chopped (about 2 cups)", "2 cloves garlic, minced or grated on a Microplane", "1/4 cup minced fresh sage leaves (or 2 teaspoons dried sage leaves)", "Kosher salt and freshly ground black pepper, if needed (see note)", "24 ounces low-sodium chicken or turkey broth (3 cups; 720ml), preferably <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a>", "3 whole eggs", "1/4 cup minced parsley leaves, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower-middle and upper-middle positions. Preheat oven to 275&deg;F (135&deg;C). Spread bread evenly over 2 rimmed baking sheets. Stagger trays on oven racks and bake until completely dried, about 50 minutes total, rotating trays and stirring bread cubes several times during baking. Remove from oven and allow to cool. Turn off oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven, melt butter over medium-high heat until foaming subsides (do not allow butter to brown), about 2 minutes. Add sausage and mash with a stiff whisk or potato masher to break up into fine pieces (largest pieces should be no bigger than 1/4 inch). Cook, stirring frequently, until only a few bits of pink remain, about 8 minutes. Add onions, celery, garlic, and sage and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk remaining chicken stock, eggs, and 3 tablespoons parsley in a medium bowl until homogeneous. Stirring constantly with a wooden spoon, slowly pour egg mixture into sausage mixture. Add bread cubes and fold gently until evenly mixed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease the inside of a slow cooker with butter. Transfer stuffing to slow cooker and set to low heat. Cook for 5 hours. Keep warm or sprinkle with remaining parsley to serve.</p>"}]}