{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140418-290342-chicken-tinga-tacos-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "cinco de mayo", "Mexican", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Smoky Chicken Tinga Tacos", "link": "https://www.seriouseats.com/recipes/2014/04/chicken-tinga-tacos-recipe.html", "description": "This smoky, spicy, and earthy chicken tinga takes less work than the flavor would lead you to believe&mdash;chipotles add most of the depth, while meaty chicken thighs, canned fire-roasted tomatoes, tomatillos, and onion add layers of flavor to the sauce.", "totalTime": "1 hour", "recipeYield": "Serves 4-6", "recipeCategory": ["Chicken", "Mains", "Mexican", "Snacks"], "recipeIngredient": ["1 tablespoon extra-virgin olive oil", "1 1/2 pounds skin-on, bone-in chicken thighs", "1 cup medium diced white onion", "2 medium cloves garlic, smashed and peeled", "1 large tomatillo, husk removed, rinsed, and roughly chopped", "1/2 teaspoon Mexican oregano", "1/4 teaspoon ground cumin", "One (14.5-ounce) can fire-roasted diced or crushed tomatoes ", "2 tablespoons roughly chopped chipotles plus 2 tablespoons adobo sauce from one (7-ounce) can", "1/2 cup homemade chicken stock or low-sodium chicken broth", "1 bay leaf", "Kosher salt", "&nbsp;", "Warm corn tortillas, <a href=\"http://www.seriouseats.com/recipes/2009/04/grilling-tomatillo-salsa-recipe.html\">tomatillo salsa</a>, onion, cilantro, grated cotija cheese, and llime wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a Dutch oven or large pot over medium-high heat until shimmering. Add chicken thighs skin-side down and cook until well browned, about 6 minutes. Flip thighs and continue to cook until other side is lightly browned, about 3 minutes. Transfer chicken to a plate, leaving fat in pan, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions and garlic to Dutch oven and cook, stirring occasionally, until onions have browned around the edges, about 5 minutes. Add tomatillo and cook until browned around the edges, about 4 minutes. Add oregano and cumin and cook until fragrant, about 30 seconds. Add tomatoes, chipotle, and adobo sauce and stir to combine. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer sauce to the jar of a blender and puree until smooth. Pour sauce back into pan, stir in chicken stock and bay leaf, and bring to a boil over medium heat. Nestle chicken thighs in sauce, reduce to a simmer, and cook until meat registers 165&deg;F in thickest part of thigh on an instant-read thermometer. Transfer chicken to a plate and let sit until cool enough to handle. Remove sauce from heat and discard bay leaf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull chicken meat into strips, discarding skin, any large pieces of fat, and bones. Stir chicken into sauce and cook over medium heat until warmed through, about 3 minutes. Remove from heat and season with salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon chicken into warm tortillas and top with tomatillo salsa, onion, cilantro, and cotija cheese. Serve with lime wedges.</p>"}]}