{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/02/20140224-284251-cook-the-book-chicken-croquettes.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Spanish", "keywords": ["Cook the Book", "croquette", "fry", "snack", "spain", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken Croquettes (<em>Croquetas de Pollo</em>) From 'Spain'", "link": "https://www.seriouseats.com/recipes/2014/02/chicken-croquettes-croquetas-de-pollo-from-sp.html", "description": "Miniature fried savory patties are some of my favorite small bites. I'm most familiar with hearty arancini and fluffy salt cod fritters, but I'll eat just about anything bite-sized that's served hot from the fryer. And based on the description in <a href=\"http://jeff-koehler.com/?page_id=2\" target=\"_blank\">Jeff Koehler</a>'s new cookbook, <em><a href=\"http://www.amazon.com/Spain-Recipes-Traditions-Verdant-Andaluc%C3%ADa/dp/0811875016/?tag=serieats-20\" target=\"_blank\">Spain</a></em>, Spanish croquettes offer something a little different.", "totalTime": "1 1/2 hours plus several hours to chill the croquette mixture", "recipeYield": "Makes about 40 croquettes", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Cook the Book", "Sides", "Snacks", "Spanish"], "recipeIngredient": ["1 tablespoon extra-virgin olive oil", "12 ounces (340 g) boneless, skinless chicken breast", "Salt", "1/2 cup (110 g) butter, cut into pieces", "1 medium onion, very finely chopped", "3 cups (720 ml) whole milk", "Freshly ground black pepper", "Pinch freshly grated nutmeg", "1 cup (125 g) all-purpose flour, plus more for dusting", "2 eggs", "1 cup (140 g) fine breadcrumbs", "Sunflower oil or mild olive oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet or sauté pan, heat the olive oil over medium heat. Season the chicken with salt and sauté until cooked through, about 10 minutes. Transfer to a platter to cool. Cut the chicken into pieces and grind with a food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean skillet or sauté pan, melt the butter over medium heat and add the onion. Cook over medium-low heat, until soft and transparent but not yet browned, about 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium saucepan, bring the milk to a simmer; season with salt, pepper, and the nutmeg. Reduce the heat, cover the pan, and keep hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour into the skillet over the onion and cook, stirring constantly, for about 2 minutes. It should be a compact and just-moist ball. Spread out the ball in the pan and begin slowly stirring in the hot milk until the mixture is creamy and not too sticky when touched, about 5 minutes. Reduce the heat to low and fold in the ground chicken. Cook, gently stirring, for 2 minutes. The mixture should be spongy and can be touched without sticking to your finger.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to a large bowl to cool. Once cool, cover with plastic wrap and refrigerate for several hours until chilled. (This will make forming the croquettes easier.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a flat work surface dusted with flour, form croquettes into 2- to 2 1/2-inch (5- to 6.25-cm) long cylinders about 1 inch (2.5 cm) in diameter. Lightly roll in flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break the eggs in a bowl and thoroughly whisk. Place the breadcrumbs in a second bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip the croquettes in the egg and roll in breadcrumbs to completely cover.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet or sauté pan, heat at least 3/4 inch/2 cm of sunflower oil over medium-high heat. Reduce the heat to medium-low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in small batches that don’t crowd the pan, fry the croquettes, turning frequently, until they are golden on the outside and hot and creamy at the center, about 2 minutes. Gently transfer them to absorbent paper towels to drain off excess oil. Serve hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Notes:</strong> To freeze, roll the uncooked croquettes in egg and breadcrumbs and freeze in batches. Take them from the freezer and fry directly, without thawing. </p>\n\n<p>When frying various batches in a skillet, breadcrumbs gather in the bottom and burn. These tend to stick to the new batch and leave a bitter taste. After two batches, very carefully filter the oil into a new skillet, bring it back to the correct temperature, and then continue frying.</p>"}]}