{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/01142014-btb-chilichocolatepie.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chili", "chocolate", "four &amp; twenty blackbirds", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "3"}, "name": "Four &amp; Twenty Blackbirds' Green Chili Chocolate Pie", "link": "https://www.seriouseats.com/recipes/2014/01/four-twenty-blackbirds-green-chili-chocolate.html", "description": "Some desserts boast one secret ingredient. This pie has three. Jalapeno and ginger flavor heavy cream, which is mixed into melted bittersweet chocolate spiked with cardamom. The result is heady, spicy, and delightful, with a chocolate crust to match.", "totalTime": "several hours, including baking and cooling", "recipeYield": "makes 1 9-inch tart", "recipeCategory": ["Bake the Book", "Chocolate", "Condiments and Sauces", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["Chocolate All-Butter Crust for a single-crust pie, partially prebaked in a 9-inch springform pan (ingredients and instructions to follow)", "1 jalapeño pepper, halved and sliced into 1/2-inch pieces", "1-inch piece fresh ginger, peeled and sliced into 1⁄8-inch pieces", "1 cup whole milk", "1 cup heavy cream", "12 ounces bittersweet chocolate (55% cocoa), broken into 1/4-inch pieces", "1/2 teaspoon ground cardamom", "1/2 teaspoon kosher salt", "2 large eggs", "2 teaspoons fresh lime juice", "<strong>Crust Ingredients:</strong>", "1 cup unbleached all-purpose flour", "1/4 cup cocoa powder", "1/2 teaspoon kosher salt", "1 1/2 teaspoons granulated sugar", "1/4 pound (1 stick) cold unsalted butter, cut into 1/2 inch pieces", "1/2 cup cold water", "2 tablespoons cider vinegar", "1/2 cup ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and preheat the oven to 325°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the prebaked springform pan on a rimmed baking sheet. (For crust making and prebaking instructions, see below.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the sliced jalapeño (with seeds), sliced ginger, milk, and cream in a heavy-bottomed saucepan and bring just to a boil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat, cover, and allow to steep for 6 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chocolate, cardamom, and salt in a large heatproof bowl and position a fine-mesh sieve over the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring the cream mixture back to a simmer, and immediately strain it over the top of the chocolate. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let stand for 5 minutes, and then whisk steadily until all the chocolate is melted.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack the eggs into a separate bowl or large measuring cup, and whisk. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly stream a small amount of the chocolate mixture into the eggs, whisking as you pour. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue until the egg mixture feels warm to the touch; then mix it back into the chocolate mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the lime juice and whisk until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the filling through a fine-mesh sieve directly into the springform pan, or strain it into a separate bowl and then pour it into the pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake on the middle rack of the oven for 30 to 35 minutes, rotating 180 degrees when the edges start to set, 20 to 25 minutes through baking. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The pie is finished when the edges are set about 2 inches in and puffed slightly and the center is no longer liquid but still quite wobbly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Be careful not to overbake or the filling will be dry and sandy; the filling will continue to cook and set after the pie is removed from the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow to cool completely on a wire rack, 2 to 3 hours. Serve slightly warm or at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The pie will keep refrigerated for 2 days or at room temperature for 1 day.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Making the Crust:</strong> Stir the flour, cocoa, salt, and sugar together in a large bowl. Add the butter pieces and coat with the flour mixture using a bench scraper or spatula. With a pastry blender, cut the butter into the flour mixture, working quickly until mostly pea-sized pieces of butter remain (a few larger pieces are okay; be careful not to over blend.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, cider vinegar, and ice in a large measuring cup or small bowl. Sprinkle 2 tablespoons of the ice water mixture, 1 to 2 tablespoons at a time, and mix until the dough comes together in a ball, with some dry bits remaining. Squeeze and pinch with your fingertips to bring all the dough together, sprinkling dry bits with more small drops of the ice water mixture, if necessary, to combine. Shape the dough into a flat disc, wrap in plastic, and refrigerate for at least 1 hour, preferably overnight, to give the crust time to mellow. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Tips for Prebaking:</strong> Have your crust rolled, crimped, and rested in the refrigerator for at least 30 minutes. When it's fully chilled, use a fork to prick all over the bottom and sides, 15 to 20 times. This step, called docking, helps eliminate the air bubbles that can form when the dough is exposed to heat and also prevents the crust from shrinking. Place the crust in the freezer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the oven racks in the bottom and center positions, place a rimmed baking sheet on the lowest rack, and preheat the oven to 425F. Have ready 1 egg white mixed with 1 teaspoon of water to brush the crust with during baking. This glaze acts to moistureproof the bottom and sides of the crust that will be exposed to the filling. It's not totally necessary, but does make for a better final product.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the crust is frozen solid (about 10 minutes), line it tightly with a piece or two of aluminum foil. Make sure the crimped edges are completely covered and there are no gaps between the foil and the crust. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour pie weights or beans into the pan and spread them so they are concentrated more about the edge of the shell than in the center. Place the pan on the preheated baking sheet and bake for 20 minutes, until the crimped edges are set but not browned. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan and the baking sheet from the oven, lift out the foil and pie weights, and let the crust cool for a minute. Use a pastry brush to coat the bottom and sides with a thin layer of egg white glaze (1 egg white whisked with 1 teaspoon of water) to moistureproof the crust. Return the pan, on the baking sheet, to the oven's middle rack and continue baking for 3 more minutes. Remove and cool completely before filling.</p>"}]}