{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140701-leek-ricotta-crostini-lauren-rothman.jpg", "author": {"@type": "Person", "name": "Lauren Rothman"}, "recipeCuisine": "", "keywords": ["appetizer", "basil", "crostini", "leek", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ricotta and Braised Leek Crostini", "link": "https://www.seriouseats.com/recipes/2014/07/ricotta-baised-leek-crostini-recipe.html", "description": "Soft braised leeks are accented with basil and rounded out with ricotta cheese for these simple, summery crostini.", "totalTime": "30 minutes", "recipeYield": "Makes 30 crostini", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Vegetarian"], "recipeIngredient": ["30 (1/2-inch thick) slices baguette or other crusty bread", "1/4 cup plus 3 tablespoons extra-virgin olive oil, divided", "3 large leeks, roots and dark green parts trimmed off, split lengthwise and soaked in cold water to remove all grit", "3 cups chicken stock or low-sodium broth", "3 tablespoons fresh basil leaves, cut into thin ribbons", "Kosher salt and freshly ground black pepper", "1 pound fresh ricotta cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350&deg;F. Place baguette slices on a baking sheet and drizzle with 1/4 cup olive oil. Bake until lightly browned and crisp, about 8 minutes. Let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine leeks, chicken stock and 1 tablespoon oil in a large, wide-bottomed pot, cover, and bring to a boil over high heat. Lower heat to a simmer and cook, partially covered, until leeks are tender, about 20 minutes. Remove leeks from pot and let cool, reserving broth for another use. Slice leeks crosswise into thin ribbons and transfer to a small mixing bowl. Add basil and stir gently to combine. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread toasts with about 1 tablespoon ricotta cheese eac, then top with leek mixture. Transfer crostini to a platter, drizzle with remaining olive oil and serve immediately. </p>"}]}