{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140328-btb-mangocheesecake.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["cheesecake", "Frenchie", "mango", "passion fruit"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Brillat-Savarin Cheesecake with Mango and Passion Fruit", "link": "https://www.seriouseats.com/recipes/2014/03/bake-the-book-brillant-savarin-cheesecake-mango-passionfruit-frenchie.html", "description": "The combination of velvety smoothness and intense creaminess of fresh Brillat-Savarin cheese sandwiched between a passion fruit glaze and a thin crumb crust is absolutely gorgeous. Further enhanced by a mango puree, serve this dessert when you're ready to say goodbye to winter.", "totalTime": "several hours, because of chilling", "recipeYield": "serves 8 to 10", "recipeCategory": ["Bake the Book", "Cakes", "Desserts", "Fruit Desserts", "Mango"], "recipeIngredient": ["<strong>Cheesecake</strong>", "6 tablespoons (85 grams) unsalted butter", "About 5 1/2 ounces (150 grams) speculoos, gingersnaps, or cinnamon cookies", "1 vanilla bean", "3 sheets (12 grams) gelatin", "12 ounces (350 grams) Brillat-Savarin cheese (or another triple-crème cheese)", "1 3/4 cups (425 ml.) very cold heavy cream", "3 large eggs", "3/4 cup (140 grams) granulated sugar", "Grated zest of 1 lemon", "2 tablespoons lemon juice", "&nbsp;", "<strong>Passion Fruit Glaze</strong>", "2 sheets (8 grams) gelatin", "2 passion fruits", "1 cup (250 ml.) unsweetened passion fruit juice", "&nbsp;", "<strong>Mango Puree</strong>", "1 ripe mango", "Juice of 1 lime, or to taste", "3 tablespoons granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cheesecake: Melt the butter in a small saucepan over low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crush the cookies into crumbs in a food processor. Add the melted butter and pulse just until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a bottomless 10-inch square mold on a baking sheet lined with a Silpat or parchment paper; or use a 9-inch springform pan. Pour the crumb mixture into the mold and pat it evenly over the bottom. Refrigerate.<br />\n </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split the vanilla bean and scrape out the seeds. Put the gelatin in a bowl of cold water and let stand for 10 minutes, or until softened. Carefully remove all the rind from the cheese. Cut the cheese into chunks and set aside to come to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With an electric mixer, beat the cream until firm peaks form. Refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the eggs and sugar in a large bowl and beat on medium-high speed until pale and tripled in volume. Add the Brillat-Savarin, lemon zest, and vanilla seeds and beat at medium speed until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm the lemon juice in a small saucepan. Drain the gelatin, squeeze out the excess water, and add it to the juice, stirring until dissolved. Add to the cheese mixture and beat at high speed until smooth. Delicately fold in the whipped cream with a rubber spatula.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the mixture into the mold and smooth the top. Refrigerate for at least 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the passion fruit glaze: Put the gelatin in a bowl of cold water to soften. Cut the passion fruit in half and spoon out the seeds; drain the seeds well in a strainer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Warm 1/4 cup of the passion fruit juice in a small saucepan. Drain the gelatin, squeeze out the excess water, add to the warm juice, and stir to dissolve. Add the rest of the juice and the passion fruit seeds; remove from the heat and let cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the glaze on top of the cold cheesecake and refrigerate for at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the mango puree: Meanwhile, peel and pit the mango and cut it into chunks. Put it in a blender or food processor, add the lime juice and sugar, and puree. Refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Run a sharp knife around the sides of the cheesecake mold to loosen the cake and lift off the mold (or remove the sides of the springform pan). Cut into portions, running the knife under very hot water and wiping it dry after each for a clean cut. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread some mango puree on each plate and top with a slice of the cheesecake.</p>"}]}