{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140317-286689-cook-the-book-shepherds-pie.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book", "irish", "lamb", "mashed potato", "my irish table", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Shepherd's Pie From 'My Irish Table'", "link": "https://www.seriouseats.com/recipes/2014/03/shepherds-pie-from-my-irish-table.html", "description": "Corned beef may be what most Americans will eat to celebrate St. Patrick's Day today, but I'm here to make a case for a rich, homey shepherd's pie. After a weekend of revelry, there's nothing better than digging into a bowl of warm, meaty stew topped with creamy mashed potatoes.", "totalTime": "2 hours and 45 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Cook the Book", "Lamb", "Mains", "Mashed Potatoes", "Soups and Stews"], "recipeIngredient": ["<strong>Stew</strong>", "1 1/2 pounds lamb shoulder, trimmed of all fat and sinew, cut into 1/2-inch cubes", "Kosher salt and freshly ground black pepper", "2 tablespoons canola oil", "1 yellow onion, chopped", "4 carrots, peeled and chopped", "4 celery stalks, chopped", "2 tablespoons all-purpose flour", "4 cups lamb stock or store-bought beef broth", "3 russet potatoes, peeled and cut into 1/2-inch cubes (2 cups)", "2 large fresh bay leaves", "2 tablespoons chopped fresh thyme leaves", "1 tablespoon chopped fresh rosemary leaves", "1 tablespoon chopped fresh oregano leaves", "&nbsp", "<strong>Mashed Potatoes</strong>", "4 russet potatoes, peeled and quartered", "1 tablespoon salt", "4 large egg yolks", "1/2 cup unsalted butter", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Brown the lamb:</strong> Pat the lamb cubes dry on all sides with paper towels and season well with salt and pepper. In a large slope-sided sauté pan over medium-high heat, heat the oil until it shimmers. Distribute the meat evenly in the bottom of the pan without crowding it and don’t disturb it for several minutes. If you stir the cubes too soon, they will release water and the meat will boil instead of browning. After 3 or 4 minutes, turn the cubes over and brown them on the other side for another 3 or 4 minutes. Using a slotted spoon, transfer the meat to a bowl and return the pan to the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Sweat the vegetables:</strong> Add the onion, carrots, and celery, stirring with a flat-edged wooden spatula. As the vegetables cook, water will release and deglaze the pan. Use the spatula to scrape up brown bits from the bottom of the pan. Sweat the vegetables for 4 to 5 minutes. They should be translucent but still a bit firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook the stew:</strong> Stir in the flour and allow it to brown lightly for about 2 minutes. Add the lamb stock, continuing to scrape up any brown bits from the bottom of the pan. Stir in the potatoes, bay leaves, thyme, rosemary, and oregano. Return the meat and its collected juices to the pan. Bring the liquid to a boil. Lower the heat to medium and cover the pot. Simmer for 1 1/2 hours, until the meat is fork tender. Discard the bay leaves and transfer the stew to an 8-cup baking dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, boil the potatoes for mashing:</strong> Place the quartered potatoes and salt in a pot and cover them with cold water. Bring the water to a boil, then lower the heat to medium and allow the potatoes to simmer uncovered until cooked through, about 40 minutes. To tell if they are cooked, take a piece out and cut it in half to see if it's soft in the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the potatoes are cooking, preheat the oven to 450 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mash the potatoes:</strong> Drain the potatoes, return them to the pot, and stir them over the heat for a couple of minutes. This ensures that they are dry. Rice the potatoes into a mixing bowl. Add the egg yolks, butter, and cream, whisking until the mixture is smooth. Work quickly while the potatoes are hot so they don't become gummy and starchy. Adjust the salt seasoning to taste and allow the potatoes to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Top the pie:</strong> Fit a large pastry bag with a large star tip. Spoon the mashed potatoes into the bag. Moving in one direction, pipe large rosettes of potatoes over the lamb mixture, in neat row or around the perimeter of the baking dish. Go over your work and pipe rosettes wherever you see any holes&mdash;you want to create a good seal. Alternatively, you can dollop the potatoes over the stew and spread them with a spatula to seal it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bake the pie:</strong> Line a baking sheet with aluminum foil. Set the pie on it and bake for 30 to 35 minutes, until the potatoes are nicely browned and the filing is bubbling. Let the casserole rest for 15 minutes; serve with piccalilli on the side if you'd like.</p>"}]}