{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140703-ideas-in-food-clam-sauce-PreparingSmokingPanBottom.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "Korean", "keywords": ["Asian", "Korean", "rice cake", "smoke"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoked Korean Rice Cakes", "link": "https://www.seriouseats.com/recipes/2014/07/smoked-korean-rice-cakes-recipe.html", "description": "Korean rice cakes are wonderfully chewy, and their subtle flavor is the perfect foil to strong, rich sauces. But that doesn't mean they can't have their own flavor too. Here, the rice cakes are quickly smoked using a makeshift stovetop smoking rig that requires no special equipment beyond a couple of disposable aluminum roasting pans and some wood shavings.", "totalTime": "30 minutes", "recipeYield": "Serves 8", "recipeCategory": ["Korean", "Rice"], "recipeIngredient": ["1 (1 pound / 450 gram) bag mini cylindrical Korean rice cakes", "Fruit wood shavings or small chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a ring of crumpled up aluminum foil around the perimeter of 1 disposable aluminum roasting pan. Put about 2 tablespoons of wood chips in center of roasting pan, inside the ring of aluminum foil and set the pan over medium-high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, using a pair of scissors, punch 9 holes all over the bottom of another disposable aluminum roasting pan. Set rice cakes inside perforated roasting pan in a single even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When wood chips begin to smolder and smoke, set perforated pan over the bottom pan so that it is sitting on the ring of aluminum foil. Wearing oven mitts, carefully crimp aluminum foil over both pans to seal in smoke. Turn off heat the heat and let rice cakes smoke for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using oven mitts, remove foil in a single piece by un-crimping edges and lift perforated roasting pan out of the smoking pan. Check the wood chips: If they are entirely burnt, add 2 more tablespoons wood chips; if not, continue to work with the chips left in the roasting pan. Turn heat to medium and wait for wood chips to smoke and smolder again. Set perforated pan on top again, cover with the foil, and turn off the heat once more. Let smoke for 10 minutes longer. Remove foil and transfer the rice cakes to a baking sheet to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cooled rice cakes to a zipper-top bag or plastic container and refrigerate until ready to use, up to 2 days. </p>"}]}