{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140219-284008-mushroom-gravy-step-1.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["mushroom", "sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Mushroom Gravy", "link": "https://www.seriouseats.com/recipes/2014/02/mushroom-gravy-sauce-recipe.html", "description": "A robust, clean mushroom flavor makes this a great gravy to smother on steak, biscuits, mashed potatoes, pork chops, and more.", "totalTime": "45 minutes", "recipeYield": "Makes 3 cups", "recipeCategory": ["Condiments and Sauces", "Mushrooms", "Sauced"], "recipeIngredient": ["4 cups homemade or store-bought low-sodium chicken or beef stock (or a mix, see note)", "1/2 ounces dried porcini mushrooms", "6 tablespoons tablespoons butter", "6 ounces cremini mushrooms, stemmed, cleaned, and roughly chopped", "6 ounces shiitake mushrooms, stemmed, cleaned, and roughly chopped", "4 tablespoons flour", "2 tablespoons dry sherry", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring stock to a boil over medium high heat in a medium saucepan. Remove from heat and add in porcini mushrooms. Let steep until mushrooms are tender, about 15 minutes. Drain mushrooms, reserving stock. Roughly chop mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in medium saucepan over medium heat. When foaming subsides, add porcini, cremini, and shiitake mushrooms and cook, stirring occasionally, until browned, about 10 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add flour and cook, stirring constantly, for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly whisk in reserved stock. Bring to a boil, reduce to a simmer, and cook until gravy has thickened and reduced to 3 cups, 10 to 15 minutes. Stir in sherry and continue to cook until warmed through, about 1 minute. Season with salt and pepper to taste. Serve immediately or store in an airtight container in refrigerator for up to one week, reheating over medium-low heat before serving.</p>"}]}