{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140812-ideas-in-food-Pressure-Cooked-Pudding.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["budino", "buttermilk", "coconut", "dessert", "fruit", "German", "ideas in food", "pudding", "rhubarb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Layered Toasted-Coconut Puddings With Red Fruit Purée and Coconut Cream", "link": "https://www.seriouseats.com/recipes/2014/08/rote-grutze-layered-coconut-fruit-puddings-recipe.html", "description": "In its original form, <em>rote grütze</em> is a simple pudding made with red fruits, thickened with starch, and served with milk or cream. In this wildly re-imagined version,  a red fruit puree is layered on top of a toasted coconut pudding, then topped with an aerated cultured coconut cream. While the number of components may make it seem like a restaurant dessert, each step is easy and the indulgence is worth the effort.", "totalTime": "", "recipeYield": "Makes 8 pint-sized mason jars", "recipeCategory": ["Coconut", "Fruit Desserts", "Puddings and Custards", "Rhubarb"], "recipeIngredient": ["<strong>For the Coconut Pudding:</strong>", "100 grams coconut flour (see note)", "100 grams unsweetened shredded coconut", "400 grams coconut milk", "500 grams coconut water", "250 grams sweetened condensed milk", "4.5 grams salt", "4 large egg yolks", "113 grams unsalted butter, cubed", " ", "<strong>For the Coconut Simple Syrup:</strong>", "500 grams coconut water", "500 grams coconut sugar (see note)", " ", "<strong>For the \"Cocoa-Nut\" Syrup:</strong>", "400 grams Coconut Simple Syrup", "50 grams black cocoa powder", "1.5 grams salt", " ", "<strong>For the \"Cocoa-Nuts\":</strong>", "175 grams coconut flakes", "150 grams \"Cocoa-Nut\" Syrup", " ", "<strong>For the Red Fruit Pudding:</strong>", "500 grams Coconut Simple Syrup", "800 grams washed and sliced rhubarb", "450 grams washed, hulled, and sliced strawberries", "200 grams washed raspberries", "5 grams salt", " ", "<strong>For the Coconut-Buttermilk Mousse:</strong>", "130 grams sweetened condensed milk", "400 grams coconut milk", "5.2 grams silver sheet gelatin (2 sheets), cut in half (see note)", "400 grams room-temperature buttermilk", "3 grams salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Coconut Pudding:</strong> Preheat oven to 250&deg;F. Line 2 rimmed baking sheets with parchment paper. Spread coconut flour in an even layer on 1 baking sheet. Spread shredded coconut in an even layer on the second baking sheet. Bake coconut flour and shredded coconut for 20 minutes. Rotate baking sheets and bake until lightly browned and toasted, about 20 minutes longer. Let coconut flour and shredded coconut cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine coconut flour and shredded coconut in a stainless steel bowl that will fit inside a pressure cooker. Add coconut milk, coconut water, sweetened condensed milk, and salt to the bowl and whisk until fully blended. Fill pressure cooker with 2 inches of water and set a small metal rack or folded towel inside the cooker. Set the bowl on the rack or towel and cook coconut mixture at high pressure for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let pressure dissipate naturally, then remove lid. While the mixture is still hot, transfer contents of the bowl to a food processor, and puree until smooth, 2-3 minutes. With the processor on, add yolks and then butter, piece by piece, until incorporated; the coconut mixture will appear soupy. Pour into an 8-inch square baking dish, and cover with plastic. Refrigerate coconut pudding until thickened, at least 4 hours and up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Coconut Simple Syrup:</strong> Combine coconut water and coconut sugar in a medium saucepan and whisk until sugar dissolves. Bring to a boil over medium high heat, then reduce heat to low and simmer, stirring occasionally, for 5 minutes. Strain coconut simple syrup into a heatproof container and reserve. Coconut Simple Syrup may be refrigerated in a covered container for up to 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the \"Cocoa-Nut\" Syrup:</strong> Combine <br />\r\nCoconut Simple Syrup, black cocoa, and salt in a medium saucepan and whisk until smooth. Bring to a boil over medium heat, stirring with a silicone spatula to prevent burning, then reduce heat to low and simmer, stirring constantly, for 5 minutes. Strain \"Cocoa-Nut\" syrup through a fine mesh strainer into a heatproof container and reserve. \"Cocoa-Nut\" Syrup will keep refrigerated in a covered container for up to 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cocoa Nuts:</strong> Preheat oven to 250&deg;F. Combine coconut flakes and \"Cocoa-Nut\" Syrup in a bowl and stir with a rubber spatula to evenly coat flakes. Line a rimmed baking sheet with parchment paper and spread flakes in an even layer. Bake until flakes are dry to the touch with a glass-like sheen, about 1 hour 20 minutes.  Let cool on the baking sheet; flakes will crisp as they cool. Cooled flakes can be stored in a zipper-lock bag at room temperature for up to 1 week.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Red Fruit Pudding:</strong> Combine all of the ingredients a large pot. Bring fruit mixture to a simmer over high heat, then reduce heat to medium-low and cook until rhubarb is soft and falling apart, about 20 minutes. Remove from heat and let stand for 20 minutes. Transfer fruit mixture into a blender. Starting at low speed, gradually increase speed to high and blend until pureed, about 30 seconds. Strain fruit puree into a bowl and refrigerate at least 4 hours and up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Coconut-Buttermilk Mousse:</strong> Combine sweetened condensed milk and coconut milk into a medium saucepan and whisk until smooth. Add gelatin sheets and let soak until softened, 3-5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set saucepan over medium heat and, stirring, bring mixture to 175&deg;F; the gelatin will melt into the liquid. Remove from heat. Add buttermilk and salt and stir with a silicone spatula until incorporated. Strain coconut-buttermilk mixture into a bowl and refrigerate, uncovered, until thickened like yogurt, at least 4 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour coconut buttermilk into a whipped-cream canister to the fill line. Close canister and charge with one whipped-cream charge. Refrigerate coconut-buttermilk mousse for at least 4 hours and up to 3 days in the canister.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble the Rote Grütze:</strong> Spoon about 2/3 cup of Coconut Pudding into the bottom of each jar. Layer about 2/3 cup of Red Fruit Pudding on top of Coconut Pudding. Jars may be covered and stored in the refrigerator at this point until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, dispense Coconut-Buttermilk Mousse from the whipped-cream canister on top of the Red Fruit Pudding until jars are full. Sprinkle \"Cocoa-Nut\" Flakes on the top and serve with long spoons.<br />\r\n</p>"}]}