{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140421-pimento-cheeseburger-recipe-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["burger", "cheeseburger", "grill", "jalapeño", "pimento cheese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pimento-Jalapeño Cheeseburgers", "link": "https://www.seriouseats.com/recipes/2014/06/pimento-jalapeno-cheeseburger-recipe.html", "description": "There's something about the way the caviar of the South (as pimento cheese is affectionately known) melts into a rich, oozy coating, its acidity and punch of pimento flavor accenting a thick and juicy grilled burger in a way that regular cheese just can't. Add some pickled jalapeño peppers in there in place of standard pickles and you've got yourself one hell of a fiery backyard treat.", "totalTime": "1 hour", "recipeYield": "Makes 4 burgers", "recipeCategory": ["Burger", "The Burger Lab", "The Food Lab"], "recipeIngredient": ["1 cup <a href=\"http://www.seriouseats.com/recipes/2011/09/sauced-pimento-cheese-recipe.html\">Pimento Cheese</a>", "1 1/2 pounds beef chuck, cut into 1-inch cubes (see note)", "Kosher salt and freshly ground black pepper", "4 soft hamburger buns", "1 1/2 cups shredded iceberg lettuce", "1/2 small white or yellow onion, thinly sliced", "4 slices ripe tomato", "3/4 cup sliced pickled jalapeño peppers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pimento cheese in food processor. Pulse until finely chopped, 6 to 8 short pulses. Transfer to a small bowl with a rubber spatula and wash food processor bowl if using to grind meat (see step 3).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To grind with a meat grinder</strong>: Place grinding shaft, feed tube, plate, die, and screw of a meat grinder into the freezer along with a large mixing bowl. Spread beef chunks evenly in a single layer on a large plate or rimmed baking sheet. Place meat in freezer and freeze until starting to get firm around edges but still malleable, about 20 minutes. Set up meat grinder with 3/8-inch plate. Grind meat into the cold bowl. Working quickly, grind meat again using 1/4-inch plate. If grinder or meat begins to get too warm during grinding process, return to freezer for 10 minutes before continuing to grind.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To grind with a food processor</strong>: Spread beef chunks evenly in a single layer on a large plate or rimmed baking sheet. Place in freezer and freeze until starting to get firm around edges but still malleable, about 20 minutes. Working in three batches, place meat cubes in the work bowl of a food processor. Pulse until finely chopped, about 15 to 20 short pulses. Transfer to a bowl and repeat with remaining beef.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form beef into 4 patties about 1/2-inch wider than the burger buns with a slight depression in the center to account for bulging as they cook. Season generously with salt and pepper and refrigerate until ready to cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, spread evenly over one side of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Place burgers directly over hot coals, cover with vents open, and cook, turning occasionally, until well charred and center of burgers register 110°F on an instant read thermometer, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread pimento cheese evenly on top of burgers and continue to cook until cheese is melted and burgers register 125°F for medium rare or 135°F for medium, 1 to 2 minutes longer. Transfer burgers to a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast buns over center of grill until golden brown and warmed through. Transfer buns to a large cutting board. Top bottom buns with shredded lettuce, slivered onions, tomato slices, and jalapeño slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with burger patties, close with top bun, and serve immediately.</p>"}]}