{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141027-pumpkin-lasagna-food-lab-07.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["apple", "fall", "kabocha", "pizza", "sage", "squash", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Best Pumpkin Pizza", "link": "https://www.seriouseats.com/recipes/2014/10/pumpkin-pizza-food-lab-recipe.html", "description": "Pumpkin, apples, and sage come together in this fall-inspired pizza.", "totalTime": "1 hour 45 minutes", "recipeYield": "Makes 2 pizzas, serving 3 to 4", "recipeCategory": ["Apple", "Mains", "Pizza", "Pumpkin", "Squash", "The Food Lab", "The Pizza Lab", "Vegetarian"], "recipeIngredient": ["1 pound <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">homemade</a> or store-bought pizza dough, divided into two 8-ounce balls", "1 small kabocha squash or sugar pumpkin, quartered, seeds discarded", "5 tablespoons extra-virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "2 tablespoons honey", "1 pinch ground cinnamon", "1 pinch grated nutmeg", "2 tablespoons unsalted butter", "2 crisp baking apples such as Golden Delicious, cut into 1/2-inch dice", "2 tablespoons minced fresh sage leaves, plus 1/4 cup roughly torn leaves, divided", "Flour for dusting", "8 ounces shredded Gruyère cheese", "6 ounces fresh mozzarella cheese", "2 ounces grated Parmigiano-Reggiano cheese", "2 scallions, white and pale-green parts only, thinly sliced, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place each ball of pizza dough in a lightly oiled bowl and cover tightly with plastic wrap. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 325&deg;F. Toss three pumpkin quarters with 1 tablespoon olive oil and coat thoroughly with hands. Season with salt and pepper. Place in a cast iron skillet or on a foil-lined rimmed baking sheet and roast until a knife meets no resistance when poked into the flesh around the stem, about 45 minutes. Remove from oven and set aside until cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape pumpkin flesh out into a large bowl. Add honey, cinnamon, nutmeg, and 2 tablespoons olive oil. Mash with a whisk until a rough purée is formed. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pumpkins are roasting, cut remaining pumpkin quarter into 1/2-inch dice. Melt butter in a large skillet over high heat, swirling until foaming subsides. Add diced pumpkin and apple and cook, tossing and stirring frequently until tender and browned on most sides, about 10 minutes. Season to taste with salt and pepper; stir in minced sage. Transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When toppings are ready, adjust oven rack to top position under broiler and place a Baking Steel or pizza stone on top. Preheat oven to maximum heat setting. Allow to preheat for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer one ball of pizza dough to a bowl of flour and turn to coat. Transfer to a lightly floured wooden pizza peel and stretch or roll into a thin circle. Top with half of shredded gruyere cheese, half of the mozzarella applied in dollops, and a light sprinkling of Parmesan. Add mashed pumpkin in rough dollops around the cheese. Add half of sautéed pumpkin and apple. Sprinkle with torn sage leaves and half the scallion whites. Drizzle with 1 tablespoon olive oil and season with salt. Turn broiler on to high and launch pizza onto baking steel. Bake, rotating occasionally, until puffy and charred around the edges, about 4 minutes. Remove from oven, sprinkle with half the pale-green scallions, and serve. Repeat with remaining dough and toppings.</p>"}]}