{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140523-293192-cook-the-book-curry-noodles-with-chicken.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Thai", "keywords": ["Asian", "Cook the Book", "curry", "noodle", "simple thai food", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Curry Noodles With Chicken (Kuai-Tiao Kaeng Sai Kai) From 'Simple Thai Food'", "link": "https://www.seriouseats.com/recipes/2014/05/curry-noodles-with-chicken-from-simple-thai-food.html", "description": "Scratch-made chicken curry is a thing of beauty, with far greater complexity than anything that comes out of a jar. Add supple rice noodles and an array of toppings, and consider me satisfied for the next week.", "totalTime": "30 minutes with store-bought curry pastes, 1 hour with homemade", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Eggs", "Mains", "Pasta", "Thai"], "recipeIngredient": ["1 1/2 pounds boneless chicken thighs (great) or breasts (okay)", "1 tablespoon vegetable oil", "1/2 cup coconut cream (from the top of a can of coconut milk)", "2 tablespoons red curry paste, store-bought or <a href=\"http://www.seriouseats.com/recipes/2014/05/red-curry-paste-nam-phrik-kaeng-phet-from-sim.html\">homemade</a>", "2 tablespoons kari (“yellow”) curry paste, store-bought or <a href=\"http://www.seriouseats.com/recipes/2014/05/kari-yellow-curry-paste-nam-phrik-kaeng-kari\">homemade</a>", "2 tablespoons packed grated palm sugar or 1 1/2 tablespoons packed light brown sugar", "3 tablespoons fish sauce", "1 1/2 cups coconut milk", "3 cups sodium-free chicken stock", "6 ounces extra-firm tofu, cut into matchsticks 1 inch long and 1/4 inch wide and thick", "2 teaspoons curry powder", "8 ounces mung bean sprouts (about 4 cups)", "8 ounces dried rice sticks, 3 millimeters (about 1/8 inch) wide", "1/4 cup finely chopped preserved radish (optional)", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2014/05/fried-shallots-and-fried-shallot-oil-from-simple-thai-food.html\">fried shallots</a>", "1/4 cup packed fresh cilantro leaves", "1/3 cup finely chopped roasted peanuts", "2 hard- or medium-boiled eggs peeled and halved lengthwise", "&nbsp", "<strong>Table Seasonings</strong>", "2 or 3 limes, cut into wedges", "Fish sauce", "Granulated sugar", "Red chile powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the chicken against the grain and on the diagonal into thin, bite-size pieces. Cover and refrigerate until needed.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 1-gallon saucepan, combine the vegetable oil, coconut cream, and curry pastes, and stir over medium-high heat until fragrant, about 2 minutes. Add the chicken and stir for about 1 minute, until the chicken is coated with the curry paste. Add the sugar, fish sauce, coconut milk, and stock, stir well, and bring to a very gentle boil. When the chicken is cooked through, after 3 to 4 minutes, stir in the tofu and curry powder, mixing well to distribute the curry powder evenly. Turn down the heat to the lowest setting; keep the curry warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have ready 4 large individual serving bowls. Half fill another 1-gallon saucepan with water and bring to a boil. Add the bean sprouts, stir, and then immediately fish the bean sprouts out of the water with a wire-mesh skimmer, shaking off the excess water. Divide the bean sprouts evenly among the bowls. While the water is still boiling, add the dried noodles, stir to submerge, and cook until they have softened through, about 15 minutes. Taste a strand to make sure they are ready. Drain the cooked noodles through a large colander placed in the sink and rinse off all starchy<br />\r\nliquid that clings to them with running hot tap water. Shake off the water. Divide the noodles evenly among the bowls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately ladle the curry over the noodles, dividing it evenly. Sprinkle each serving with an equal amount of the radish, fried shallots, cilantro, and peanuts. Top each serving with an egg half. Serve immediately with the limes, fish sauce, sugar, and red chile powder for adding as desired.</p>"}]}