{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140723-Crispin-Cider-Bacon-Wrapped-Brats-Jennifer-Olvera-3.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crispin Cider-Steeped, Bacon-Wrapped Brats With Caramelized Hard Cider Onions", "link": "https://www.seriouseats.com/recipes/2014/07/crispin-cider-steeped-bacon-wrapped-brats-wit.html", "description": "Tart, refreshing Crispin Cider is the perfect vehicle for steeping cheddar brats and onions. Once the sausages are infused with flavor and cooked through and the onions are melty, the sausages are wrapped in bacon and finished on the grill, while the onions caramelize with thyme atop the stove.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Condiments and Sauces", "Mains", "Sandwiches"], "recipeIngredient": ["4 cheddar brats or regular brats", "1 large onion, thinly sliced", "1 12-ounce bottle Crispin Cider, preferably apple", "4 slices thick-cut bacon", "1 1/2 tablespoons unsalted butter", "2 sprigs fresh thyme", "1/4 teaspoon sugar", "Kosher salt and black pepper", "Mustard", "Hot dog or brat buns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate, leaving an area without direct heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine brats, onion and hard cider in a 10-inch square disposable aluminum pan. Alternatively, construct a tray out of a double layer of heavy duty aluminum foil, 10 inches square, with sides about 2 inches high. Place tray on hot side of grill and cook until simmering, about 4 minutes. Slide to cooler side of grill. Cover grill with vents over the sausages. Cook with all vents open until sausages register 140&deg;F to 145&deg;F on an instant read thermometer, about 15 minutes, turning once in the middle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove onions from beer pan using a slotted spoon. Remove brats from beer and wrap diagonally with bacon, taking care to tuck ends in at each end so it won’t come undone during cooking. Melt butter in a medium sauté pan on the stovetop over medium heat. Transfer onions to pan with butter. Add thyme and sugar. Let onions caramelize, stirring periodically to avoid burning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place brats directly on the grates on a cool part of the grill. Cook, turning occasionally and dipping into beer, until well-browned and crisp, 5 to 7 minutes total. Remove brats and beer pan from the grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When onions are caramelized, discard woody thyme stems, season with salt and pepper and stir to combine. Tuck brats into buns, garnish with mustard and top with caramelized onion. Serve immediately.</p>"}]}