{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20141019-quesadilla-pizza-pizzadilla-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "pizza", "pizzadilla", "quesadilla", "quick", "snack", "tortilla", "tortilla pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Pizzadilla (Quesadilla Pizza)", "link": "https://www.seriouseats.com/recipes/2014/10/pizzadilla-quesadilla-pizza-quesadizza.html", "description": "This is what happens when a pizza and a quesadilla meet down in a van by the river for a little late-night action: cheesy, greasy, crisp-edged glory.", "totalTime": "15 minutes", "recipeYield": "Serves 1 to 2", "recipeCategory": ["Mains", "Pizza", "Quick and Easy", "Snacks", "Stovetop", "The Food Lab", "The Pizza Lab"], "recipeIngredient": ["1/2 teaspoon (3ml) extra-virgin olive oil", "2 large flour tortillas that just fit inside your cast iron skillet", "3/4 cup (180ml) store-bought or <a href=\"http://www.seriouseats.com/recipes/2010/10/new-york-style-pizza-sauce.html\">homemade</a> pizza sauce", "5 ounces (140g) shredded whole-milk low-moisture mozzarella cheese", "2 ounces (55g) grated Parmesan cheese, divided", "2 basil leaves, roughly torn", "Additional toppings (such as crumbled Italian sausage mix), as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to 6 to 8 inches below broiler element and preheat broiler to high. Heat oil in a large cast iron skillet over high heat until shimmering. Reduce heat to low and wipe out excess oil with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tortilla in skillet with the rougher textured-side facing down. Spread half of sauce evenly over tortilla all the way to the edges. Spread half of mozzarella evenly over tortilla all the way to the edges. Place second tortilla on top. Cook, swirling pan occasionally, until crisp on the bottom, about 3 minutes. Carefully flip with a large spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread remaining sauce evenly over tortilla all the way to the edges. Spread remaining mozzarella and half of Parmesan evenly over tortilla all the way to the edges. Scatter with basil and add toppings (such as sausage) as desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place skillet under broiler and broil until toppings are cooked through and cheese is melted and starting to brown in spots, 2 to 4 minutes. Remove from oven and sprinkle with remaining Parmesan. Using a small metal spatula, gently pry edges of pizza, releasing the cheese from the skillet. Peek under bottom. If more crispness is desired, place skillet over medium-heat and cook, swirling pizza and peeking occasionally, until desired crispness is achieved. Slide pizza out onto a cutting board. Cut and serve immediately.</p>"}]}