{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140601-grilled-pizza-toppings-food-lab-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["grill", "grilled pizza", "pizza", "shiitake", "sopressata", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Pizza With Grilled Shiitake, Sopressata, and Parmesan", "link": "https://www.seriouseats.com/recipes/2014/06/grilled-pizza-shiitake-sopressata-recipe.html", "description": "This guy is all savoriness. It starts with shiitake mushrooms charred on the grill. Slices of sopressata get the briefest turn over the fire, then go on top of a pie with fresh mozzarella. On go the mushrooms, along with a fistful of coarsely shaved Parmesan cheese.", "totalTime": "2 to 3 hours, plus time for dough to proof", "recipeYield": "Makes 4 pizzas", "recipeCategory": ["Pizza", "The Food Lab", "The Pizza Lab"], "recipeIngredient": ["2 pounds <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">homemade</a> or store-bought pizza dough", "12 ounces shiitake mushrooms, stems removed", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "Kosher salt and freshly ground black pepper", "6 ounces thinly sliced sopressata", "1 pound fresh mozzarella, sliced, drained between paper towels", "1/4 pound roughly grated or shaved Parmesan cheese", "3 tablespoons finely sliced chives or scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a knife or bench scraper to divide dough into four even pieces. With lightly floured hands, form into tight balls. Lightly oil 4 medium containers (large soup bowls work great) and place 1 dough ball in each one. Lightly grease the tops of the dough balls then cover each bowl with plastic wrap. Allow to rise at room temperature until doubled in volume, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toss shiitake and olive oil in a large bowl. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a heavily floured surface, roll a dough ball into a disk about 13-inches by 9-inches and 1/4-inch thick using rolling pin. Shake off excess flour and place on a sheet tray lined with parchment paper. Repeat with remaining dough balls, placing a sheet of parchment between each one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Light a large chimney starter full with charcoal and wait until fully ignited and coals are mostly covered in gray ash (about 20 minutes). Arrange coals under half of grill grate and place grate on top. Cover and allow to preheat for 10 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place mushooms over hot side of grill and cook, turning frequently with tongs, until charred and tender, about 3 minutes. Transfer to cutting board and roughly chop. Place sopressata over hot side of grill and cook just until fat starts to render, about 15 seconds. Transfer to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush top of 1 dough round with a thin even layer of oil and season with kosher salt. Place gently on hot side of grill, oiled side down. Immediately brush top side with thin layer of oil and season with salt. Cook, checking frequently and moving to encourage even browning until bottom is dark brown and charred in spots and top is bubbly, 45 to 90 seconds. Flip using tongs or large spatula and cook until second side is charred. Flip again and transfer to cooler side of grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apply 1/4 of mozzarella in a thin even layer across surface of pizza. Add 1/4 of sopressata and 1/4 of mushrooms. Cover and cook until cheese is melted, about 1 minute. Transfer pizza to cutting board with large spatula or metal pizza peel. Add 1/4 of Parmesan and 1/4 of chives. Drizzle with more oil and serve immediately. Repeat with remaining dough and toppings.</p>"}]}