{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140503-btb-cardamomshortbread.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["A Lighter Way to Bake", "cardamom", "cookie", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cardamom and Ginger Shortbread", "link": "https://www.seriouseats.com/recipes/2014/06/cardamom-and-ginger-shortbread.html", "description": "Sometimes, <em>A Lighter Way to Bake</em> doesn't mean cutting corners on everything. Rather than compromising the flavor of a good shortbread, a full stick of butter is used in this recipe. Sugar is what's skimped on here, but the modest amount included is all that's needed to set off the bold flavors of cardamom and ginger.", "totalTime": "1 hour", "recipeYield": "makes 10 shortbread wedges", "recipeCategory": ["Bake the Book", "Cookies", "Desserts", "Ginger"], "recipeIngredient": ["Spray oil", "8 tablespoons unsalted butter, softened", "1/3 cup soft light brown sugar", "1 3/4 cups all-purpose flour", "1 teaspoon ground cardamom", "1-inch piece peeled ginger, finely chopped", "Seeds of 1 vanilla bean or 1 teaspoon vanilla extract", "1 tablespoon egg white (fiddly, I know, but a whole egg white is too much!)", "Pinch of salt", "2 tablespoons low-fat milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Lightly grease an 8-inch springform pan with a bit of spray oil and then line the base with baking parchment. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using an electric mixer fitted with the beater attachment or by hand with a wooden spoon and in a large bowl, cream the butter and the sugar together until combined. Add the flour, ground cardamom, ginger, vanilla seeds or extract, egg white, salt, milk and 1 tablespoon of cold water and mix everything together. The mixture is quite dry so I find it best to get my hands in and squash it against the side of the bowl to bring it together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the mixture into the pan and squish it tight and flat with the back of a spoon. Once the shortbread is level, press the tip of your index finger all the way around the edge of the shortbread to make a fluted pattern and then use a sharp knife to mark the shortbread into 10 even-size triangular pieces. Bake in the oven for 35–40 minutes or until the shortbread is a light golden brown and firm, but with a slight softness to the touch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cooked, remove it from the oven and use the sharp knife to cut through the 10 wedges. Leave to cool completely before carefully removing from the pan. Arrange the wedges on a plate and serve.</p>"}]}