{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140317-one-pot-wonders-lemon-chicken.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["chicken", "easy", "feta", "greek", "pilaf", "quick", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Greek-Style Rice Pilaf With Chicken Thighs", "link": "https://www.seriouseats.com/recipes/2014/03/greek-style-pila-chicken-thighs-recipe.html", "description": "As a lover of quick and easy dishes, pilafs&mdash;simple dishes of rice cooked in broth&mdash;come up in my repertoire all the time. They're an insanely easy way to produce a flavor-packed meal in a single pan with minimum fuss.This version combines chicken and rice with Greek flavors.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "One-Pot Wonders", "Rice"], "recipeIngredient": ["1 pound skin-on chicken thighs", "Kosher salt and freshly ground black pepper", "2 tablespoons chopped fresh oregano leaves, divided (see note)", "2 tablespoons olive oil", "1 medium onion, finely chopped (about 1 cup)", "2 medium cloves garlic, minced or grated with a microplane (about 2 teaspoons)", " 1 1/2 cups basmati or long-grain rice", "2 3/4 cups homemade or store-bought low sodium chicken stock", "1 (15-ounce) can artichoke hearts, drained, rinsed and cut into chunks", "2 tablespoons fresh juice and 2 teaspoons zest from 1 lemon ", "3 ounces crumbled feta cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the chicken well with salt, pepper, and half of the oregano. Heat the oil in a pot or 12-inch skillet over medium-high heat until lightly smoking. Add the chicken, skin-side down and cook until well browned, 6 to 10 minutes, flip and then brown the other side, 3 to 4 minutes more. Remove to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard all but 1 tablespoon fat from skillet and heat the fat over medium heat until shimmering. Add the onion and a pinch of salt and cook, stirring, until softened, about 3 minutes. Add the remaining oregano and garlic and cook until fragrant, about 30 seconds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the rice, stirring until fragrant and lightly toasted, about 1 minute, then add the stock and artichoke hearts and stir together. Nestle the chicken thighs on top, skin-side up, adjust the heat to maintain a simmer. Cover and cook until the chicken and rice are done 15 to 20 minutes more. Sprinkle with lemon zest, lemon juice, and feta. Serve immediately.</p>"}]}