{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141107-mashed-sweet-potatoes-food-lab-thanksgiving-08.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "fall", "mashed sweet potato", "sweet potato", "thanksgiving", "thyme"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "8"}, "name": "The Best Mashed Sweet Potatoes", "link": "https://www.seriouseats.com/recipes/2014/11/the-best-mashed-sweet-potatoes-recipe.html", "description": "Have you ever wondered why sweet potatoes are so darn insecure? It's time to say good-bye to the days of hiding sweet potatoes behind sugar and bolted-on marshmallows. What we have here is a technique for making mashed sweet potatoes that are so sweet, rich, and packed with sweet-potato flavor, they need only the simplest of embellishments to shine.", "totalTime": "2 hours 20 minutes", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Christmas", "Gluten-Free", "Other Vegetables", "Roasting", "Seasonal and Holiday", "Sides", "Sweet Potatoes and Yams", "Thanksgiving", "The Food Lab", "Vegetables", "Vegetarian", "Winter"], "recipeIngredient": ["4 pounds (1.8kg) moist sweet potatoes, such as ruby or garnet yams (about 4 large potatoes; see note)", "8 sprigs thyme, divided", "6 tablespoons butter (3 ounces; 85g)", "1/4 cup (60ml) maple syrup", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position. Place 2 large sheets of heavy-duty aluminum foil on a work surface. Working with 1 sheet at a time, place half of potatoes in center along with 3 sprigs of thyme. Fold up foil and crimp edges to seal tightly. Repeat with other half of potatoes. Transfer pouches to a rimmed baking sheet and place in oven. Set oven to 300&deg;F (150&deg;C). Roast until a thin skewer inserted into potatoes meets no resistance, about 2 hours. Remove potatoes from oven and set aside until cool enough to handle. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt butter in a medium saucepan over medium-low heat, swirling gently, until particles are pale golden brown and smell nutty. Immediately transfer to a large bowl or the bowl of a stand mixer fitted with a whisk attachment. Add maple syrup. Pick leaves off of remaining 2 thyme sprigs, roughly chop, and add to bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel sweet potatoes and discard skins. Add flesh to bowl with butter and syrup. Beat with whisk attachment or a handheld mixer until smooth and fluffy, about 2 minutes. Season to taste with salt. Serve. See note for make-ahead suggestions.</p>"}]}