{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140412-286493-dinner-tonight-breakfast-torta-chipotle-guacamole.jpg", "author": {"@type": "Person", "name": "Nick Kindelsperger"}, "recipeCuisine": "Mexican", "keywords": ["bean", "breakfast", "easy", "egg", "Mexican", "quick", "refried bean", "sandwich", "torta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Breakfast Torta With Bacon, Eggs, and Chipotle Guacamole", "link": "https://www.seriouseats.com/recipes/2014/03/breakfast-torta-bacon-eggs-chipotle-guacamole-recipe.html", "description": "Ham and eggs is a very common torta filling in Mexico, and for a good reason. The salty slices bring texture and loads of porkiness to the game, while the eggs help bulk it out. But you know what is crispier and more intense than ham? That's right. Bacon.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Dinner Tonight", "Eggs", "Mains", "Mexican", "Mother's Day", "Sandwiches"], "recipeIngredient": ["4 Mexican rolls (telera or bolillo)", "1 (16-ounce) can refried pinto beans  ", "1/2 pound thick-cut bacon ", "8 eggs ", "2 avocados", "1 tablespoon fresh juice from about 1 lime", "Handful fresh cilantro leaves, chopped ", "1/2 white onion, chopped (about 1/2 cup)", "1 garlic clove, minced (about 1 teaspoon)", "1 chipotle chile en adobo    ", "2 ounces queso fresco, crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F. Wrap rolls in aluminum foil and place in the oven to warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat refried beans in a small saucepan over medium-low, stirring occasionally to keep from sticking on the bottom. Alternatively, heat in the microwave on medium heat, stirring every 30 seconds until hot. Taste and season with a pinch of salt if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook bacon in a large non-stick skillet over medium heat, flipping occasionally, until crisp. Remove slices with tongs and drain on paper towels. Add 1/2 tablespoon bacon fat to refried beans and stir well. Drain fat remaining fat into a bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crack 4 eggs into large bowl, season with a pinch of salt, and whisk until combined. Heat 1 tablespoon of reserved bacon fat in the now-empty skillet over medium heat until shimmering, then add the whisked eggs. Tilt the pan so eggs evenly coat the bottom, and cook until set and just starting to brown on the bottom, about 1 minute. Use a spatula to fold the eggs like an omelet, and continue cooking until lightly browned. Flip and brown on the other side. Transfer the cooked eggs to a plate. Repeat process with more bacon fat and remaining eggs. Cut both sheets of egg in half, to make four sheets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut avocados in half, remove the pits, and scoop the flesh into a bowl. Mash with the back back of a fork. Stir in lime juice, cilantro, onion, garlic, and chipotle. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When warm, remove rolls from the oven and discard aluminum foil. Cut each in half horizontally, and use your fingers to remove some of the excess interior of the rolls. For the bottom halves, smear the cut-side with a few tablespoons of refried beans and add a sheet of egg and 2 slices of bacon. For the top halves, smear the cut-side with a few tablespoons of the guacamole and sprinkle queso fresco. Place the top halves on the bottom halves. Slice vertically crosswise and serve immediately.</p>"}]}