{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140419-deviled-egg-variations-recipe-08.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["appetizer", "caper", "deviled egg", "egg", "hors d'oeuvre", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Deviled Eggs With Fried Capers, Lemon, and Parsley", "link": "https://www.seriouseats.com/recipes/2014/05/deviled-eggs-fried-capers-lemon-parsley-recipe.html", "description": "Deviled eggs spiked with briny and crisp fried capers, parsley leaves, lemon juice, and extra-virgin olive oil.", "totalTime": "20 min", "recipeYield": "makes 8 deviled egg halves", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Deviled Eggs", "Snacks"], "recipeIngredient": ["1/3 cup capers, rinsed and drained", "2 cup vegetable, peanut, or canola oil", "6 <a href=\"http://www.seriouseats.com/recipes/2009/10/perfect-boiled-eggs-recipe.html\">hard boiled</a> or <a href=\"http://www.seriouseats.com/recipes/2014/04/steamed-hard-boiled-eggs-recipe.html\">hard steamed eggs</a>, peeled and halved lengthwise", "2 tablespoons mayonnaise", "1 teaspoon Dijon mustard", "2 teapsoons juice and 1 teaspoon zest from 1 lemon", "1 tablespoon extra-virgin olive oil, plus more for drizzling", "2 tablespoon minced fresh parsley leaves, plus more for garnish", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place capers on a double layer of paper towels. Fold towels over and press firmly to dry capers thoroughly. In a medium pot, heat oil to 350°F as registered on an instant read thermometer. Carefully add capers and stand back (they will bubble and spit). Cook, stirring with a metal spider, until bubbling slows to a steady stream, about 30 seconds. Immediately remove capers from oil and transfer to paper towel-lined plate. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add fried capers (reserving 16 as garnish), mayonnaise, mustard, lemon juice and zest, olive oil, and parsley. Using a stiff whisk, mash and stir until well combined. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap). Fried caper garnish can be stored in a sealed container at room temperature (allow to cool completely before closing container). Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Garnish with fried capers and parsley. Drizzle with olive oil and serve immediately.</p>"}]}