{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140120-btb-limebars.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["bar cookie", "coconut", "cookie", "lime", "shortbread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Lime Bars", "link": "https://www.seriouseats.com/recipes/2014/01/levi-roots-tropical-lime-bars-recipe.html", "description": "The crumbly shortbread base of these bars contrasts well with its tart lime filling; they're dense enough to be satisfying during the winter, but with enough tang to serve as a reminder that warmer days are ahead. A handful of toasted dried coconut sprinkled on top ties it all together.", "totalTime": "2 hours, including dough making", "recipeYield": "makes 30 bars", "recipeCategory": ["Bake the Book", "Coconut", "Cookies", "Lime"], "recipeIngredient": ["<strong>For the Dough:</strong>", "250g (9 oz) unsalted butter, softened, plus extra for greasing", "90g (3 1/4 oz) granulated sugar", "250g (9 oz) plain flour, plus extra for flouring", "Pinch of salt", "Icing sugar, for dusting", " ", "<strong>For the Filling</strong>", "6 extra-large free-range eggs, at room temperature", "625g (1 lb 6 oz) granulated sugar", "finely grated rind of 8 unwaxed limes, plus extra for decorating", "1/2 cup lime juice", "125g (4 1/2 oz) plain flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Beat the butter and sugar together, using an electric mixer or by hand, until pale but not too fluffy. With the mixer set on a very low speed, add the flour and salt and beat gently until just combined. Turn out the dough (it may not have come together into a ball yet — don’t worry) onto a lightly floured work surface and knead into a ball. Using well-floured hands, press the dough into a greased 8 1/2 x 12 inch rectangular baking tin. Chill in the refrigerator for 30 minutes (or stick it in the freezer for about 10 minutes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15 - 20 minutes until pale golden, then remove from the oven but don’t turn the oven off. Leave to cool in the tin.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the filling, whisk together the eggs, sugar, lime rind and juice. When combined, gradually mix in the flour, whisking continuously. Pour into the cooled tin, on top of the cooled shortbread base, and bake for 30 minutes or until the filling is set. Leave to cool in the tin. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut into 30 small bars, dust with icing sugar and decorate with lime rind.<br />\r\n</p>"}]}