{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140513-292532-cook-the-book-lamb-stuffed-collards.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["collard green", "Cook the Book", "lamb", "Southern", "the new southern table"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lamb-Stuffed Collards From 'The New Southern Table'", "link": "https://www.seriouseats.com/recipes/2014/05/lamb-stuffed-collards-from-the-new-southern-t.html", "description": "Unlike most Southern cookbooks, <a href=\"http://www.brysstephens.com/\" target=\"_blank\">Brys Stephens</a>'s book, <em><a href=\"http://www.amazon.com/The-New-Southern-Table-Ingredients/dp/1592335853/?tag=serieats-20\" target=\"_blank\">The New Southern Table</a></em>, does not include a recipe for slow-cooked collard greens.", "totalTime": "1 hour and 40 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cook the Book", "Lamb", "Leafy Greens", "Mains"], "recipeIngredient": ["<strong>Stuffed Collards</strong>", "4 cups (945 ml) water, plus more for blanching the collards", "1/2 teaspoon kosher salt, plus more to taste", "3/4 cup (105 g) bulgur", "12 ounces (340 g) collard green leaves (about 8 to 10 medium-size leaves)", "1 tablespoon (15 ml) olive oil", "1/2 medium yellow onion, diced", "1 clove garlic, minced", "2 pounds (905 g) ground lamb", "2 teaspoons (2 g) dried oregano", "Freshly ground black pepper", "1/2 teaspoon red pepper flakes", "4 to 6 fresh mint leaves, thinly sliced", "1 teaspoon (2 g) freshly grated lemon zest", "&nbsp", "<strong>Sauce</strong>", "1/2 medium-size yellow onion, diced", "1 clove garlic, minced", "1 can (28 ounces, or 795 g) whole peeled tomatoes", "Kosher salt", "Freshly ground black pepper", "Red pepper flakes", "1 cup (235 ml) dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the stuffed collards:</strong> Bring the 4 cups of water to a boil, stir in the salt and bulgur, and then lower the heat to simmer gently 10 to 15 minutes, or until the bulgur is tender. Drain, rinse the bulgur with cold water, and set aside until completely drained, stirring occasionally to help this process along.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the bulgur is cooking, prepare the collard leaves by peeling the central stems with a vegetable peeler so that they’re flush with the leaves. Cut off the stem ends below the leaves and discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large stockpot of generously salted water to a boil. Working in two batches, add the collard green leaves, and blanch about 2 minutes, or until bright green but still firm. Transfer the leaves to a kitchen towel to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the olive oil in large skillet over medium-high heat. Add the onion, season lightly with salt, and cook, stirring often, 3 to 5 minutes, or until translucent. Add the garlic and cook about 30 seconds until fragrant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the ground lamb and oregano, season with salt and pepper, and add the red pepper flakes. Cook, stirring often and breaking the lamb up, 10 to 15 minutes, or until meat is cooked through. Stir in the mint and lemon zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the lamb mixture to a large bowl, leaving about 1 tablespoon (15 ml) of fat in the skillet. Add the bulgur to the bowl with the lamb, stir to combine, and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the sauce:</strong> Return the skillet to medium-high heat, and add the onion. Cook for 3 to 5 minutes, or until translucent. Add the garlic, and cook about 30 seconds until fragrant. Add the tomatoes and cook, stirring and breaking them up, about 10 minutes, or until it thickens to a sauce. Season to taste with salt, black pepper, and red pepper flakes. Stir onefourth of this tomato sauce into the lamb and bulgur mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble:</strong> Preheat the oven to 375°F (190°C, or gas mark 5). Spread out the collard leaves on a work surface. Divide the lamb and bulgur mixture among the collard leaves, mounding it in the center. Roll each collard leaf over the lamb mixture, folding the sides inward.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the bottom of a large casserole dish with half of the remaining tomato sauce, top with the stuffed collards, and spread the remaining tomato sauce over the collards. Pour the wine into the bottom of the casserole dish, cover with foil, and bake about 30 minutes.</p>"}]}