{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/05062014_meringueonwhip_meringue1.jpg", "author": {"@type": "Person", "name": "Marissa Sertich Velie"}, "recipeCuisine": "", "keywords": ["egg white", "meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Basic Italian Meringue", "link": "https://www.seriouseats.com/recipes/2014/06/basic-italian-meringue-recipe.html", "description": "A glossy Italian meringue is the base for buttercream frosting, meringue pies, and mousses.", "totalTime": "10 minutes", "recipeYield": "Makes about 4 cups meringue", "recipeCategory": ["Desserts"], "recipeIngredient": ["1 cup sugar", "1/2 cup water", "4 room temperature egg whites, preferably from fresh eggs (see note)", "1/2 teaspoon cream of tartar, lemon juice from 1 lemon, or 1/2 lemon (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, combine sugar and water. Heat over high heat, brushing down sides of pot as necessary with a pastry brush dipped in water. Cook until sugar syrup registers 240°F on an instant read or candy thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine egg whites and cream of tartar or lemon juice in the bowl of a stand mixer fitted with a whisk attachment; alternatively, wipe the mixer bowl with cut side of 1/2 lemon before adding egg whites (and omit cream of tartar or lemon juice). Set mixer to medium speed and mix until soft peaks form (when lifted, the head of the mixer should form gentle peaks in the egg whites that very slowly collapse back into themselves), about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer running, carefully and slowly drizzle in hot sugar syrup. Increase speed to high and whip until desired stiffness is achieved.</p>"}]}