{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141027-baked-occasions-pumpkin-swirl.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Bake the Book", "baked occasions", "brownie", "cheesecake", "dessert"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pumpkin Swirl Cheesecake Chocolate Brownies From 'Baked Occasions'", "link": "https://www.seriouseats.com/recipes/2014/10/pumpkin-swirl-cheesecake-chocolate-brownies-baked-ocassions-cookbook.html", "description": "Brownies are hard to mess up, but the truly great ones combine a generous helping of chocolate with a dense, satisfying bite. These brownies from <em>Baked Occasions</em> have both, with a sweetly spiced pumpkin cheesecake swirl that makes them even more satisfying, and seasonally appropriate.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes 24 brownies", "recipeCategory": ["Bake the Book", "Brownies and Bars", "Pumpkin"], "recipeIngredient": ["1 (8-ounce/226g) package cream cheese, softened", "1/4 cup plus 2 tablespoons (75 g) granulated sugar", "3/4 cup (170 g) solid pack pumpkin or pumpkin puree (not pumpkin pie filling)", "1 large egg yolk", "2 tablespoons all-purpose flour", "1 teaspoon ground cinnamon", "1/4 teaspoon ground nutmeg", "1/4 teaspoon ground allspice", "1/4 teaspoon ground ginger", "<strong>For the Brownie Layer</strong>", "3/4 cup plus 2 tablespoons (105 g) all-purpose flour", "1 tablespoon unsweetened cocoa powder", "1/2 teaspoon kosher salt", "8 ounces (225 g) dark chocolate (60 to 72% cacao), coarsely chopped", "6 ounces (11/2 sticks/170 g) unsalted butter, cut into 1-inch (2.5-cm) cubes, plus more for the pan", "3/4 cup (150 g) granulated sugar", "1/4 cup plus 2 tablespoons (85 g) firmly packed light brown sugar", "3 large eggs, at room temperature", "1 teaspoon pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the Pumpkin Cheesecake Swirl: In a medium bowl, whisk the cream cheese and sugar until smooth and creamy (it should almost look like frosting). Add the pumpkin, egg yolk, flour, cinnamon, nutmeg, allspice, and ginger and whisk again until well blended. Cover and refrigerate while you make the brownie layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the Brownie Layer: Preheat the oven to 350F (175C) and position a rack in the center. Butter the sides and bottom of a glass or light-colored metal 9-by-13-inch (23-by-33-cm) pan. Line the bottom with a sheet of parchment paper with a 1-inch (2.5-cm) overhang on the long sides of the pan, and butter the parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together the flour, cocoa, and salt.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chocolate and butter in a large heatproof bowl and set it over a saucepan of simmering water, stirring occasionally, until the chocolate and butter are completely melted, smooth, and combined. Turn off the heat, but keep the bowl over the water and add both sugars. Whisk until completely combined, then remove the bowl from the pan. The mixture should be at room temperature. Add 2 eggs to the chocolate mixture and gently whisk until just combined. Add the remaining egg and whisk until combined. Add the vanilla and whisk until combined. Do not overbeat the batter at this stage or your brownies will be cakey.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the flour mixture over the chocolate mixture. Using a spatula, fold them gently together until just a bit of the flour mixture is visible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour two-thirds of the batter into the prepared pan and smooth the top. Pour the pumpkin cheesecake mixture over the brownies and smooth into an even layer with the back of an offset spatula. Drop the remaining one-third of the brownie batter by heaping tablespoons here and there over the pumpkin layer. Use a knife to gently pull through the batters to create a swirl. (The brownie batter is thick, so you might need to pull several times before you start to create the swirl.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, rotating the pan halfway through the baking time, until a toothpick inserted into the center of the brownies comes out with a few moist crumbs sticking to it, 30 to 40 minutes. Let the brownies cool almost completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can eat the brownies slightly warm or at room temperature, when they have a more pumpkin-y flavor. Or cover and refrigerate them for about 3 hours and enjoy them slightly chilled (this is our favorite). Either way, when you’re ready, release the brownies from the side of the pan with a small paring knife. Pull straight up on the parchment to remove them from the pan, place them on a cutting board, cut, and serve.</p>"}]}