{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140508-291808-cook-the-book-chicken-and-egg.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["chicken", "coi", "Cook the Book", "egg"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chicken and Egg From 'Coi' (Part 2)", "link": "https://www.seriouseats.com/recipes/2014/05/chicken-and-egg-from-coi-part-2.html", "description": "After you've <a href=\"http://www.seriouseats.com/recipes/2014/05/chicken-and-egg-from-coi-part-1.html\">made your stock and seaweed powder</a>, it is time to tackle the actual chicken and egg components of <a href=\"http://www.starchefs.com/cook/chefs/bio/Daniel-Patterson/coi\" target=\"_blank\">Daniel Patterson</a>'s Chicken and Egg from his new cookbook, <em><a href=\"http://www.amazon.com/Coi-Stories-Recipes-Daniel-Patterson/dp/0714865907/?tag=serieats-20\" target=\"_blank\">Coi</a></em>.", "totalTime": "About 4 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Cook the Book", "Eggs", "Gluten-Free"], "recipeIngredient": ["<strong>Chicken Jus</strong>", "600 g chicken parts (backs and necks) ", "Pure olive oil", "75 g onion, sliced", "50 g carrot, sliced", "300 g white wine", "2 kg <a href=\"http://www.seriouseats.com/recipes/2014/05/chicken-and-egg-from-coi-part-1.html\">AP Stock</a>", "20 g kombu", "15 g katsuobushi, shaved", "Champagne vinegar", "&nbsp", "<strong>To serve</strong>", "4 eggs", "<a href=\"http://www.seriouseats.com/recipes/2014/05/chicken-and-egg-from-coi-part-1.html\">Seaweed Powder</a>", "Breakfast, black Spanish, watermelon and/or wild radishes", "Rice wine vinegar", "Wild radish flowers, pods and sprouts", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the chicken jus:</strong> Deeply brown the backs and necks in pure olive oil in a wide pan. Add the sliced onion and carrot, and cooked until softened. Deglaze with white wine, scraping up any bits that cling to the bottom of the pan. Reduce until almost dry. Add the AP stock, and bring to a light simmer. Cook for a few hours, without skimming, until the stock is redolent of browned chicken bones. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain through a chinois, and reduce, skimming frequently, until light sauce consistency (i.e. before it gets tacky). Add the seaweed, and cook on medium-low heat for about 15 minutes. Add the shaved katsuobushi, remove from the heat, and cover for 5 minutes, until the flavor is balanced-smoky and savory, but never loosing the flavor of the chicken. Strain through cheesecloth and season with a little champagne vinegar, just enough to balance the sauce. It should not be sour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Crack an egg into a bowl. If it’s not super-fresh, first rest in a narrow-slotted spoon, letting the thin white drain away, and then transfer the remaining yolk and thick white to a small bowl. Beat the egg vigorously with a fork for 30 seconds. Set a medium saucepan filled with 4 inch (10 cm) of water over medium heat. Put a strainer in the sink.  When the water is at a low boil, add a few large pinches of salt, then stir in a clockwise direction to create a whirlpool. Pour the egg into the moving water, cover the pan and count to 20. Turn off the heat and uncover the pan. The egg should be floating on the surface in ribbons. While holding back the egg with a spoon, pour off most of the water over the strainer. Gently slide the egg into the strainer and press lightly to expel any excess liquid. Season with salt, and then overturn onto a small plate. Season with a little more salt and then sprinkle seaweed powder over in an even layer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the radishes in different shapes and textures. The most peppery ones, leave raw. Any tough ones like black Spanish radish, cook in salted water until crisp-tender. Season the other pieces with rice wined vinegar and salt. There are no right answers&mdash;taste the radishes and season them the way that seems to best highlight their special qualities. Top the egg with the radish pieces, and transfer to a shallow bowl. Garnish with wild radish flowers, pods and sprouts if you have them. Spoon some jus around. </p>"}]}