{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/20141210-Buttery-Marzipan-Stollen-1-Yvonne-Ruperti.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["baking", "bread", "christmas dessert", "marzipan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Buttery Marzipan Stollen", "link": "https://www.seriouseats.com/recipes/2014/12/marzipan-stollen-recipe-german-bread-christmas.html", "description": "Stollen is one of the world's great Christmas breads, a delicious treat whether you celebrate Christmas or not. Most people buy it, but the truth is that stollen is as easy to make at home as any basic bread.", "totalTime": "4 to 5 hours", "recipeYield": "makes 1 (1 3/4-pound) stollen", "recipeCategory": ["Bread", "Breakfast Sweets", "Cakes", "Christmas"], "recipeIngredient": ["1/3 cup (3 ounces) milk", "1 1/2 teaspoons active dry yeast", "1 1/2 cups (7 1/2 ounces) plus 1 tablespoon bread flour, divided, plus more if needed", "1 tablespoon bourbon", "1/2 cup (3 ounces) raisins", "1/4 cup (1 3/4 ounces) plus 1 tablespoon granulated sugar", "1 large egg yolk", "3/4 teaspoon salt", "6 tablespoons (3 ounces) unsalted butter, softened, divided", "4 teaspoons finely chopped orange peel from one orange (see note)", "1/3 cup (3 ounces) sliced almonds", "3 1/2 ounces marzipan", "<strong>For the Glaze:</strong>", "4 tablespoons (2 ounces) unsalted butter, melted", "1 cup (4 ounces) confectioner's sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat milk in small saucepan over low heat until just warm. Pour into bowl of stand mixer and whisk in yeast and 1 tablespoon bread flour. Set aside for 30 minutes. In same unwashed saucepan, gently heat bourbon and raisins until warm; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 1/4 cups bread flour, sugar, and egg yolk to yeast mixture. Mix with dough hook at low speed just until mixture begins to come together, about 1 minute. With mixer running, add salt and then slowly add butter to incorporate. If dough seems too wet, add up to a few tablespoons more flour. Continue to mix until a soft, smooth dough forms, about 8 minutes. Mix in raisins, orange zest, and almonds until just incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form dough into a ball, place in a greased bowl, cover, and let rest in a warm place until dough has risen by about 50 percent, 1 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 350&degF. Line a large baking sheet with parchment paper. Place dough onto lightly floured work surface and press into an 8- by 10-inch oval. Using rolling pin, press a trench lengthwise into the dough about 1/3 from the bottom. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the marzipan into a log to fit the length of the stollen. Place the log on worksurface and flatten with a rolling pin to about 1/2 inch thick. Place the strip of marzipan into the trench in the dough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift the bottom portion of dough up and over the marzipan to seal it inside, being sure not to fold it so far as to make the edges meet (this will form the hump on top of the stollen). Gently press top of stollen with rolling pin to seal, leaving the hump of dough on the top. Carefully transfer the stollen to the parchment-lined baking sheet, loosely cover, and let rest in a warm place for about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until golden brown and just cooked through, 25 to 30 minutes. Do not overbake or your stollen will be dry. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Glaze:</strong> Brush stollen immediately with half the melted butter. Sprinkle with a coating of confectioner's sugar. Brush with remaining melted butter and sift 1/2 of the remaining confectioners' sugar over the top. Let cool. Sift with remaining confectioners' sugar and serve.</p>"}]}