{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20140204-281773-GFTues-ChickenDumplings.jpg", "author": {"@type": "Person", "name": "Elizabeth Barbone"}, "recipeCuisine": "", "keywords": ["chicken", "chicken and dumplings", "gluten free", "soup", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Gluten-Free Chicken and Dumplings", "link": "https://www.seriouseats.com/recipes/2014/02/gluten-free-chicken-and-dumplings-recipe.html", "description": "A gluten- free version of the wintertime classic, our chicken and dumplings has a rich, flavorful broth and light, fluffy dumplings.", "totalTime": "2 hours", "recipeYield": "serves 6", "recipeCategory": ["Chicken", "Gluten-Free", "Gluten-Free Tuesday", "Mains", "Soups and Stews"], "recipeIngredient": ["<strong> For the Soup</strong>:", "2 tablespoons olive oil", "3 large carrots, peeled and thinly sliced (about 2 cups)", "1 medium onion, finely chopped (about 1 cup)", "3 stalks celery, thinly sliced (about 1 1/2 cups)", "Kosher salt and freshly ground black pepper", "2 tablespoons white or sweet rice flour", "3 cups cold water", "3 pounds bone-in chicken thigs, skin removed", "1 quart homemade or store-bought low sodium chicken stock", " ", "<strong> For the Dumplings</strong>:", "1 cup white rice flour", "1/2 cup cornstarch", "1/2 cup sweet rice flour", "1/4 cup fresh parsley leaves, finely chopped", "4 teaspoons baking powder", "1/4 teaspoon xanthan gum", "3/4 cup milk", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Soup:</strong> In a large pot, heat the olive oil over medium-high heat until shimmering. Add the carrots and cook, stirring, until lightly softened, about 2 minutes. Add onion and celery. Cook, stirring, until vegetables are soft but not brown, about 7 minutes. Season lightly with salt and pepper. Add white rice flour and cook, stirring until flour just begins to brown, about 3 minutes. Whisk in the water in a slow, steady stream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the chicken thighs and chicken stock. Bring to a boil. Once it reaches a boil, skim surface of any scum, then lower heat to a bare simmer. Cook, uncovered, skimming a few times, until chicken is completely tender, about 1 1/2 hours (add extra water or chicken stock as necessary to keep chicken and vegetables submerged).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the chicken from the soup with a slotted spoon and place on a clean cutting board. Allow to rest until cool enough to handle, then shred meat with fingers or two forks, discarding the bones and any excess fat or gristle. Shred or chop chicken into bite-sized pieces and return to soup. Season soup to taste with salt and pepper. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dumplings:</strong> In a medium bowl, whisk together the white rice flour, cornstarch, sweet rice flour, parsley, baking powder, 1 teaspoon salt, and xanthan gum. Add the milk and eggs and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring soup to a bare simmer. Scoop the dough, about 2 tablespoons at a time, onto the top of the soup. You will get about 15 dumplings. The dumpling batter will cover the top of the soup and touch. This is normal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As soon as you’ve added the last dumpling, cover the pot. Set heat to low, and cook for 20 minutes without opening cover. A tester inserted into the center of a dumpling should come out clean. Spoon into individual bowls or plates and serve hot. Store leftovers in the refrigerator for up to four days. </p>"}]}