{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/06/20140616-strawberry-shortcake-ideas-in-food-8.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["ideas in food", "strawberry", "strawberry shortcake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Strawberry Pudding and Macerated Strawberries with Strawberry Sugar", "link": "https://www.seriouseats.com/recipes/2014/06/strawberry-pudding-macerated-strawberries-recipe.html", "description": "Created as the strawberry component of a reinvented strawberry shortcake recipe, these macerated strawberries and rich strawberry pudding are made with the help of a flavor-packed freeze-dried strawberries. It's delicious as part of the larger strawberry shortcake recipe, but also works well as a standalone fruit-and-pudding dessert.", "totalTime": "30 minutes plus 2 hours cooling", "recipeYield": "Makes about 5 cups pudding and 1 pound of macerated berries", "recipeCategory": ["Desserts", "Fruit Desserts", "Puddings and Custards", "Strawberry"], "recipeIngredient": ["<strong>For the Strawberry Pudding:</strong>", "1 1/2 cup plus 2 tablespoons (175 grams) granulated sugar", "2 tablespoons (14 grams) cornstarch", "2 tablespoons (12 grams) tapioca starch", "3/4 teaspoon (4.5 grams) fine sea salt", "1 cup plus 1 tablespoon (255 grams) half-and-half", "2 cups (520 grams) whole milk", "2 teaspoons (8 grams) pure vanilla paste or vanilla extract", "4 yolks from large eggs", "2 ounces (56 grams) freeze-dried strawberries", "1 stick (4 ounces / 113 grams) unsalted butter, sliced", "&nbsp;", "<strong>For the Strawberry Sugar:</strong>", "3/4 cup plus 1 tablespoon (100 grams) confectioners' sugar", "1 ounce (30 grams) freeze-dried strawberries", "&nbsp;", "<strong>For the Marinated Strawberries:</strong>", "1 pound (450 grams) strawberries, hulled and quartered", "1/4 teaspoon (1.5 grams) fine sea salt", "Strawberry sugar, for sprinkling (recipe above)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Strawberry Pudding:</strong> Whisk together granulated sugar, cornstarch, tapioca starch, and salt. Combine half-and-half, milk, and vanilla paste in a medium pot set over medium heat. Add sugar mixture and whisk until completely dissolved. Cook, stirring constantly with a silicone spatula, until mixture reaches 194&deg;F on an instant-read thermometer, about 15 minutes. Remove pudding base from heat and transfer to a blender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blend pudding base on low speed, gradually increasing speed to medium. Blend in egg yolks, followed by freeze-dried strawberries. Puree for 30 seconds, until smooth, then blend in butter, one piece at a time, until it is completely incorporated. Strain strawberry pudding through a fine mesh strainer set over a medium bowl to remove strawberry seeds. Let stand until cool, about 1 hour. Cover pudding and refrigerate until chilled, about 1 hour longer. Keep refrigerated until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Strawberry Sugar:</strong> Put confectioners' sugar and freeze-dried strawberries in a clean, dry blender. Turn blender to low speed, then slowly increase speed to high. Pulverize strawberries and sugar until they form a fine powder. Store strawberry sugar in an airtight container at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Marinated Strawberries:</strong> Place strawberries in a bowl and sift or sprinkle strawberry sugar over them, stirring to coat evenly. Taste the fruit, adding more strawberry sugar as necessary to balance the natural flavor of the fruit. Reserve additional strawberry sugar for making strawberry milk, or for dusting the final strawberry shortcake dish. Refrigerate until ready to serve.</p>"}]}