{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/10/20141026-mussels-how-to-food-lab-thai2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["coconut", "curry", "easy", "mussel", "quick", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Steamed Mussels With Thai-Style Coconut-Curry Broth", "link": "https://www.seriouseats.com/recipes/2014/11/steamed-mussels-thai-coconut-chili-curry-broth-recipe.html", "description": "Mussels are the easiest choose-your-own-adventure one-pot meal around, and I intend to prove it to you. This version uses my standard steamed mussel technique and combines it with flavors from Central Thailand to create a dish whose basic process is pretty much identical to the French version, but whose end results are entirely different.", "totalTime": "20 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Clams, Mussels, and Oysters", "Coconut", "Mains", "Quick Dinners", "Soups and Stews", "Thai", "The Food Lab"], "recipeIngredient": ["8 sprigs cilantro, leaves and stems roughly chopped and reserved separately", "4 medium cloves garlic, thinly sliced", "2 small shallots, thinly sliced", "1/2 teaspoon whole coriander seeds", "1/2 teaspoon dried Thai chilies or red chili flakes", "1 teaspoon zest plus 1 tablespoon juice from 1 lime (plus additional limes for serving)", "Kosher salt", "1 (15 ounce) can coconut milk (do not shake before opening)", "1 tablespoon vegetable or canola oil", "1 tablespoon Thai green curry paste", "1 tablespoon brown or palm sugar", "1 tablespoon fish sauce, plus more to taste", "2 pounds mussels (see note)", "1 small Thai or Serrano chili, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cilantro stems, half of garlic, half of shallot, coriander seed, dried chili, lime zest and a small pinch of kosher salt in a mortar and pestle. Pound and grind until a smooth paste is formed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop 2 tablespoons of thick cream from the top of the can of coconut milk and add to a large saucepan. Add oil and heat over medium heat until shimmering and sputtering. Add remaining garlic and shallots, pounded paste, and the store-bought curry paste. Cook, stirring and scraping the paste around the bottom of the pan until very aromatic, about 4 minutes. Add remaining contents of coconut milk can, sugar, and fish sauce. Bring to a simmer and cook until rich and aromatic, about 3 minutes. Season to taste with more fish sauce as desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mussels, stir, cover, and cook, shaking pan constantly and peeking every 30 seconds to stir. As soon as all the mussels are open, stir in chopped cilantro leaves, fresh chili, and lime juice. Serve immediately, with additional limes at the table.</p>"}]}