{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140909-endive-shallot-tart-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Niki Achitoff-Gray"}, "recipeCuisine": "French", "keywords": ["endive", "French", "shallot", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Endive, Shallot, and Goat Cheese Tart", "link": "https://www.seriouseats.com/recipes/2014/10/endive-shallot-goat-cheese-tart.html", "description": "If you only know endive as a crunchy, leafy, bitter green, then you've been missing out. Roasted, grilled, or sautéed, the wide-leafed vegetable loses much of its trademark bitterness, allowing its sweet, faintly earthy character to emerge at full force. Here, it's combined with shallots and goat cheese for a rich, buttery quiche-like tart.", "totalTime": "1 hour 10 minutes", "recipeYield": "Serves 6-8 as a side dish", "recipeCategory": ["Christmas", "French", "Sides", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["1/2 recipe <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">easy pie dough</a> or pre-made uncooked pie crust", "1 tablespoon butter", "1 1/3 cup finely sliced shallots or vidalia onion (3 to 4 medium shallots)", "4 to 5 endives, hearts removed, cut crosswise into 1/2-inch slices (7 cups)", "Kosher salt and freshly ground black pepper", "2 medium cloves minced garlic (about 2 teaspoons)", "5 oil-packed anchovies", "2 teaspoons fresh thyme", "2 teaspoons balsamic vinegar", "Pinch red pepper flakes", "2 eggs", "1/2 cup grated Parmesan cheese", "1/4 cup heavy cream", "6 ounces fresh or semi-fresh goat cheese (such as Bucheron de Chevre) in 1/4-inch slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to bottom position and preheat oven to 425&deg;F. Lay rolled out pie dough into a tart or pie pan, pressing gently into the edges. With a docker or the tines of a fork, poke holes in even rows across the base of the crust. Measure out a piece of parchment paper to fit the pan. Line the dough with the parchment paper and fill the pan with pie weights, dried beans, or dry rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pan into the oven and bake for 10 minutes. Remove pie weights and parchment paper, wrap edges of the pie dough with tin foil, and return to the oven. Bake until golden brown, about 5 minutes longer. Remove and allow to come to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the filling. Melt butter in a large skillet over medium-low heat. Add the shallots and endive, season with salt and pepper and cook, stirring, until wilted, 3 to 5 minutes. Add the garlic, thyme, balsamic vinegar, anchovies, and a pinch of chili flakes. Continue cooking until the shallots are translucent and the endive has fully softened, about 10 minutes longer. remove from heat and transfer mixture to a strainer set over a large bowl over the sink. Allow to drain and cool for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, beat the eggs with cream and Parmesan cheese until fully combined. Add endive-shallot mixture to the bowl and stir until evenly combined. Pour mixture into the tart pan and cover the surface with slices of goat cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the tart to the oven and bake 20 minutes. Cover tart with tin foil and continue baking for 20 minutes. Remove from oven and rest 15 to 20 minutes before serving.</p>"}]}