{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/20131128-ox-tail-sandwich-11.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["braise", "oxtail", "sandwich", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Braised Oxtail and Gruyère Sandwiches", "link": "https://www.seriouseats.com/recipes/2014/01/braised-oxtail-gruyere-sandwich-recipe.html", "description": "A savory sandwich made with braised oxtail, pickled cherry peppers, and melted Gruyère cheese.", "totalTime": "5 hours", "recipeYield": "Serves 6", "recipeCategory": ["Braising and Stewing", "Mains", "Sandwiches"], "recipeIngredient": ["<strong>For the Oxtail:</strong>", "1 tablespoon canola or vegetable oil", "2 pounds oxtails", "1 large onion, roughly chopped", "1 large carrot, roughly chopped", "2 stalks celery, roughly chopped", "1 tablespoon tomato paste", "1 1/2 cups dry red wine", "3 cups homemade or store-bought low sodium chicken stock", "2 bay leaves", "2 tablespoons finely minced fresh parsley leaves", "Kosher salt and freshly ground black pepper", " ", "<strong>For the Sandwiches</strong>:", "6 small loaves of ciabatta or hearty sandwich rolls", "3/4 cup sliced pickled cherry peppers (optional)", "12 ounces Comté, Gruyère, or Swiss cheese, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Oxtail</strong>: Adjust oven rack to center position and preheat oven to 250°F. Heat oil in a large Dutch oven over high heat until shimmering. Add as many oxtail pieces as will fit in a single layer. Cook until well browned, about 6 minutes. Flip pieces and cook until second side is browned, about 4 minutes longer. Transfer to a large plate and repeat with remaining oxtails until all oxtails are browned.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Without removing any oil or rendered fat, add onion, carrot, and celery to now-empty pot and cook, stirring and scraping up browned bits from the bottom, until vegetables are well-browned, about 10 minutes total. Stir in tomato paste until vegetables are coated. Add wine and cook, scraping up browned bits. Simmer until reduced by half, about 5 minutes. Add chicken stock and bay leaves. Return oxtails to pot, bring to a simmer, cover with the lid slightly ajar, and transfer to the oven. Cook until oxtail meat comes easily off the bone, about 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, transfer oxtails to a large bowl. Set aside until cool enough to handle. Meanwhile, strain stock through a fine mesh strainer into a medium saucepan. Discard solids. Place saucepan over medium heat and simmer stock until reduced to about 3/4 cup, about 15 minutes. Meanwhile, remove oxtail meat from bones and shred with fingers or two forks. Return meat to stock as it simmers. Finished stock/oxtail mixture should be very thick and sticky. Stir in parsley. Season to taste with salt and pepper and set aside. Oxtail mixture can be made up to 4 days in advance.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Sandwiches</strong>: Preheat broiler to high. Slice bread in half horizontally and place cut-side-up on a rimmed baking sheet. Broil until lightly toasted, about 2 minutes. Remove from broiler. Divide oxtail mixture evenly between bottom halves of bread. Top oxtail with pickled cherry peppers and slices of cheese. Remove top halves of bread from tray. Broil bottom halves until cheese is melted, about 4 minutes. Close sandwiches and serve.</p>"}]}