{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140411-soy-sauce-vegetable-noodles-13.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "chow mein", "easy", "noodle", "quick", "stir fry", "tofu", "wok skills 101"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "4"}, "name": "Stir-Fried Chow Mein With Four Vegetables", "link": "https://www.seriouseats.com/recipes/2014/04/stir-fried-chow-mein-four-vegetables.html", "description": "For me, a dim sum brunch isn't complete without a plate of Supreme Soy Sauce Chow Mein. A simple dish of stir-fried thin noodles cooked with bean sprouts and scallions, it's cooked with just a bit of thin, soy-based sauce that coats the noodles in a concentrated layer of flavor. I turn this snack into a meal by adding an array of colorful, crunchy vegetables and tofu.", "totalTime": "", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chinese", "Mains", "Noodles", "Pasta", "Stir Frying", "Tofu", "Vegetarian"], "recipeIngredient": ["2 tablespoon light soy sauce, divided ", "1 tablespoon dark soy sauce", "2 teaspoon sesame oil", "1/4 teaspoon salt", "1/4 teaspoon sugar", "1/2 teaspoon white pepper", "16 ounces Hong Kong-style (chow mein) noodles (see note)", "3 tablespoons vegetable, canola, or peanut oil, divided", "6 ounces five spiced tofu, julienned", "1 bunch (3 ounces) Chinese flowering chives, cut into 2-inch lenghts", "1 small carrot, cut into fine julienne", "8 ounces bean sprouts, trimmed", "3 scallions, cut into fine julienne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine the 1 tablespoon light soy sauce, the dark soy sauce, sesame oil, salt, sugar, and white pepper. Mix well and set aside. Open the package of noodles and loosen them in a large bowl. Separate any noodle strands that are clumped together. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon of oil in a wok over high heat until smoking. Add the tofu, spread it out, and cook without moving until lightly browned, about 30 seconds. Add remaining tablespoon of soy sauce, mix, and add in the chives. Stir-fry until chives are bright green, about 1 minute, then transfer to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons in now-empty wok over high heat until smoking. Add the noodles. Using tongs or long chopsticks, spread the noodles around, toss them in the oil, and make sure they are not in one big clump. Cook, stirring, until they start to get a little bit crispy, about 3 minutes. Add the soy sauce mixture and continue stirring and mixing the noodles around. It is important that you keep the noodles moving once you add the sauce. Once the noodles are combined with the sauce, add the bean sprouts and the carrots. Continue tossing until the bean sprouts begin to turn transparent, 1 to 2 minutes longer. Add the scallions, tofu, and chives back to the wok. Toss until everything is combined. Serve immediately. </p>"}]}