{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/03/20140318-btb-saltycaramel.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["caramel", "First Prize Pies", "pie", "salted caramel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Samantha Bee's Salty Caramel", "link": "https://www.seriouseats.com/recipes/2014/03/samantha-bees-salty-caramel.html", "description": "To make this salty stunner, a couldn't-be-simpler pretzel crust serves as the base for a honey-sweetened, brown-buttery filling, topped with a thick layer of melted chocolate and cream. A healthy sprinkling of flaky sea salt is the finishing touch.", "totalTime": "2 hours", "recipeYield": "makes 1 9-inch pie", "recipeCategory": ["Bake the Book", "Desserts", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>Pretzel Crust</strong>", "8 ounces pretzels (pick your favorite kind)", "6 to 8 tablespoons (85 to 115 g) unsalted butter, melted (pretzels can be very dry, so you may need more)", "&nbsp;", "<strong>Filling</strong>", "1 1⁄2 cups (300 g) sugar", "1/2 cup (120 ml) honey", "1/2 cup (120 ml) heavy cream", "1/2 cup (1 stick/115 g) brown butter ", "2 tablespoons mascarpone", "1 teaspoon vanilla extract", "1/2 teaspoon sea salt", "&nbsp;", "<strong>Topping</strong>", "1/4 cup (120 ml) heavy cream", "4 ounces (115 g) bittersweet chocolate, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the crust: Grind the pretzels in a food processor until finely ground or seal them in a plastic bag  and crush them with a rolling pin. Pour in the butter and mix (hands are best for this) until the texture is that of wet sand. You may need more or less butter, depending on the texture of the pretzels. Firmly press the crumbs into a 9-inch (23-cm) pie pan. Chill the crust in the freezer or fridge. Once chilled through, bake the crust in a 350°F oven for 10 minutes. Allow to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the filling: In a heavy-bottomed saucepan, stir together 1/2 cup (120 ml) water, the sugar, and honey until the sugar is mostly dissolved. Cook over medium-high heat, moving the pan around occasionally, until the caramel has turned dark amber and reached 340°F (170°C) on a candy thermometer. Remove the caramel from the heat and slowly pour the cream down the side of the pan, whisking constantly. Be very careful here: The caramel will start to bubble violently and release a lot of hot steam. Whisk in the butter, then the mascarpone, then the vanilla and salt. Pour the filling into your prebaked pie shell, and refrigerate it, uncovered, until fully set—at least 5 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the topping: Heat the cream until scalded, and then pour it over the chocolate. Let it sit for a minute, then whisk until glossy. Spread or drizzle the ganache over the filling, allow it to set, and serve. This pie can be refrigerated for up to 1 week, covered well in plastic wrap. Allow it to come to room temperature before serving. For easier slicing, run your knife under hot water first to prevent the caramel from sticking to the blade.</p>"}]}