{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/05/20140522-293190-cook-the-book-grilled-steaks-with-roasted-tomato-sauce.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "Thai", "keywords": ["Asian", "Cook the Book", "simple thai food", "steak", "thai", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Steaks With Roasted Tomato Dipping Sauce (Crying Tiger, or Suea Rong Hai Kap Jaeo Ma-Khuea Thet) From 'Simple Thai Food'", "link": "https://www.seriouseats.com/recipes/2014/05/grilled-steaks-with-roasted-tomato-dipping-sauce-crying-tiger-from-simple-thai-food.html", "description": "Like son-in-law eggs, this \"crying tiger\" dish of grilled steak with spicy tomato sauce has a mysterious name. No one really knows if the tiger is crying because the steaks are good or bad, or if the sauce is just so spicy that it generates tears. I'm inclined to believe the latter, because if you're grilling rib-eye, it'd be a shame to serve it tough.", "totalTime": "1 hour and 45 minutes, plus time to heat the grill", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Condiments and Sauces", "Cook the Book", "Mains", "Thai", "Tomato"], "recipeIngredient": ["3 (8-ounce) rib-eye steaks", "1 tablespoon thin soy sauce", "1 tablespoon oyster sauce", "1 tablespoon vegetable oil", "1/2 teaspoon ground white pepper", "4 ounces cherry tomatoes", "3 large cloves garlic, unpeeled", "1 large shallot, about 1 ounce, unpeeled", "1 tablespoon fish sauce", "1 tablespoon freshly squeezed lime juice", "2 tablespoons red pepper flakes", "1/2 teaspoon packed light or dark brown sugar", "2 tablespoons coarsely chopped fresh cilantro leaves, plus 1/2 cup loosely packed whole leaves", "2 tablespoons coarsely chopped fresh sawtooth coriander (optional)", "1/2 English cucumber, or 2 pickling cucumbers, sliced crosswise 1/4 inch thick", "2 large Roma tomatoes, sliced crosswise 1/4 inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position an oven rack in the middle of the oven and preheat the broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the steaks in a wide, shallow bowl. Add the soy sauce, oyster sauce, oil, and white pepper and turn the steaks to coat them evenly with the ingredients. Cover and refrigerate for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the cherry tomatoes, garlic, and shallot on a baking sheet and broil, turning often, until charred in spots and softened, about 5 to 7 minutes. Remove from the broiler and let cool until they can be handled. Peel the garlic and shallot but leave the tomatoes unpeeled. Put the garlic in a bowl and press with the back of a spoon until reduced to a paste. Add the shallot and mash with the spoon until it breaks down into small pieces. Add the tomatoes and cut into chunks with edge of the same spoon. Stir in the fish sauce, lime juice, pepper flakes, sugar, chopped cilantro, and sawtooth coriander; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a hot fire in a charcoal or gas grill. If using charcoal, allow the charcoal to develop a gray ash before you start grilling. Oil the grate with vegetable oil. Alternatively, heat a well-oiled stove-top grill pan over high heat until hot or leave the broiler on and oil a broiler pan. Cook the steaks, turning them once halfway through the cooking, until they are medium-rare to medium. The timing will vary depending on which cooking method you are using. If possible, test if they are ready with an instant-read thermometer, which should register 140°F to 150°F, the ideal level of doneness for this dish. Transfer the steaks to a cutting board, tent with aluminum foil, and let rest for 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the sauce to a small serving bowl and place it on the center of a large platter. Cut the steaks against the grain into slices 1/4 to 1/2 inch thick and arrange them around the sauce bowl. Arrange the cucumber and tomatoes on the side of the platter. Sprinkle the whole cilantro leaves over the beef and serve immediately.</p>"}]}