{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140410-btb-amplehillspb&j.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["Ample Hills", "grape", "ice cream", "jelly", "peanut butter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ample Hills' PB&amp;J Ice Cream", "link": "https://www.seriouseats.com/recipes/2014/04/ample-hills-pbj-ice-cream.html", "description": "Peanut butter and jelly is a classic combination, but it's the way these flavors come together in this ice cream that makes it great. First, a fat scoop of PB is stirred into a sweet cream ice cream base, then, just before serving, spoonfuls of jelly are folded into the finished product. It keeps the flavors separate, letting them, quite literally, melt in your mouth.", "totalTime": "several hours, for churning and freezing", "recipeYield": "serves 4", "recipeCategory": ["Bake the Book", "Grapes", "Ice Cream and Frozen Treats", "Nuts"], "recipeIngredient": ["1 recipe peanut butter ice cream (see below)", "1 cup Concord grape jelly ", "&nbsp;", "<strong>Peanut Butter Ice Cream</strong>", "1/2 cup all-natural peanut butter", "2 teaspoons vanilla extract", "1 recipe Walt's Dream Sweet Cream Ice Cream (ingredients below)", "3/4 cup organic cane sugar", "1/2 cup skim milk powder", "1 2/3 cups whole milk", "1 2/3 cup heavy cream", "3 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare an ice bath in your sink or in a large heatproof bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine the sugar, skim milk powder, and milk. Stir with a hand mixer or whisk until smooth. Make sure the skim milk powder is wholly dissolved into the mixture and that no lumps remain (any remaining sugar granules will dissolve over the heat). Stir in the cream.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clip a candy thermometer to the saucepan and set the pan over medium heat. Cook, stirring often with a rubber spatula and scraping the bottom of the pan to prevent sticking and burning, until the mixture reaches 110ºF, 5 to 10 minutes. Remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the egg yolks in a medium bowl. While whisking, slowly pour in ½ cup of the hot milk mixture to temper the egg yolks. Continue to whisk slowly until the mixture is an even color and consistency, then whisk the egg-yolk mixture back into the remaining milk mixture.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pan to the stovetop over medium heat and continue cooking the mixture, stirring often, until it reaches 165ºF, 5 to 10 minutes more. Add the peanut butter and vanilla and whisk vigorously to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the pan to the prepared ice bath and let cool for 15 to 20 minutes. Pour the ice cream base through a wire-mesh strainer into a storage container and place in the refrigerator for 1 to 2 hours, or until completely cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now you’re ready to make ice cream! Transfer the cooled base to an ice cream maker and churn it according to the manufacturer’s instructions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the ice cream to a storage container, gently folding in heaping spoonfuls of the grape jelly as you do, softly lifting and spinning it throughout the ice cream. Be careful not to overmix. Serve immediately or harden in your freezer for 8 to 12 hours for a more scoopable ice cream.</p>"}]}