{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140424-290403-cook-the-book-pavo-en-escabeche-oriental.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "", "keywords": ["Cook the Book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pavo en Escabeche Oriental From 'Yucatán'", "link": "https://www.seriouseats.com/recipes/2014/04/pavo-en-escabeche-oriental-from-yucatan.html", "description": "Another Yucatecan classic dish is fragrant <em>Pavo en escabeche oriental</em>. Made with grilled turkey, tangy vinegar pickles, and an enormous amount of black pepper, the smoky stew is a specialty of the city of Valladolid.", "totalTime": "2 1/2 hours, plus time to heat the grill and 6-8 hours brining time for the turkey", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Cook the Book", "Turkey"], "recipeIngredient": ["<strong>Cebollas en escabeche</strong>", "1 pound (500 g) white onions, peeled, thinly sliced across the width, and separated into rings", "1 cup (250 ml) white vinegar", "2 teaspoons (12 g) sea salt", "1 tablespoon <a href=\"http://www.seriouseats.com/recipes/2014/04/recado-para-escabeche-from-yucatan.html\">Recado para escabeche</a>, plus 2 bay leaves from the recado mixture", "2 medium chiles x'catiques (2 1/2 oz/ 70 g), charred", "1 medium head garlic (1 3/4 oz/50 g), charred, peeled, and separated into cloves", " ", "<strong>Recado blanco</strong>", "5 tablespoons (60 g) black peppercorns", "1 tablespoon (6 g) cumin seeds and 1 tablespoon (2 g) dried whole Mexican oregano, lightly toasted together", "2 teaspoons (6 g) whole cloves", "10 allspice berries", "1/2 teaspoon (1.5 g) ground <em>canela</em> (Mexican cinnamon)", "2 medium heads garlic, charred, peeled, and separated into cloves", "2 tablespoons (30 ml) white vinegar", " ", "5 1/2 pounds (2.5 k) turkey, halved or pieces, brined (see note)", " ", "<strong>Marinade</strong>", "5 tablespoons (75 g) Recado blanco", "5 tablespoons (75 ml) white vinegar", "1 tablespoon (18 g) sea salt", "2 tablespoons (28 g) lard, enriched with bacon fat if possible", " ", "<strong>For Grilling</strong>", "3 medium chiles x'catiques (about 1 1/4 oz / 35 g each)", "2 medium heads garlic (about 1 3/4 oz / 50 g each), whole, unpeeled", " ", "<strong>Stew</strong>", "16 cups (4 L) water", "2 tablespoons (36 g) sea salt", "4 bay leaves", "2 tablespoons (30 g) Recado blanco", "2 tablespoons (30ml) white vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the cebollas en escabeche:</strong> Place the onions in a large nonreactive bowl. Cover with boiling water and let stand 1 minute; drain thoroughly and return to the bowl. Add the remaining ingredients and toss to combine. Allow the onions to macerate at room temperature for at least 1 hour, tossing occasionally to keep them covered with the vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the recado blanco:</strong> Working in batches as necessary, place the spices in a spice mill or coffee grinder reserved for the purpose and grind until very fine. Strain the powder through a fine-mesh sieve over a bowl, crumbling any remaining bits of debris through the sieve with your fingers. Return anything left in the sieve to the grinder and process again. Pass through the sieve and discard any residue.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ground spices, garlic, and vinegar in the jar of a blender or a small food processor. Purée for several minutes, scraping down the sides of the jar as needed, until the mixture turns into a smooth paste. You will need 7 tablespoons of this mixture; store the remainder in an airtight container for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Marinate the turkey:</strong> Remove the poultry from the brine, rinse, and pat dry; discard the brining solution. Mix the remaining ingredients and stir to create a thick cream. Liberally coat the poultry on all sides with the mixture and allow it to marinate under refrigeration at least 1 hour or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Grill the turkey:</strong> Bring the poultry to room temperature. Preheat a gas or charcoal grill for indirect grilling using wood chips. Grill the poultry over a very hot fire, with the grilling rack close to the flame and the lid closed. It should acquire charring and grill marks overall, but it will not cook through and should still present some pink juices. Char the garlic and chiles at the same time, making sure not to puncture the chiles. Remove the poultry and vegetables from the grill and place the poultry in a large stockpot. Peel the garlic and separate it into cloves. Add the charred chiles and garlic to pot with the poultry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the stew:</strong> Cover the poultry with the water and add the salt and bay leaves. Bring to a boil, then reduce to a simmer, skimming off any foam that surfaces. Cook until the poultry is cooked through but not falling apart, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dilute the recado in the vinegar and add it to the stockpot along with the Cebollas en escabeche (include all the marinade, garlic, and chile). Simmer another 5 minutes to combine the flavors. Check the seasoning and add more salt if necessary. Remove all the chiles and gently rub off their skin under running water. Slice them open along one side and remove the stem, seeds, and veins. Cut the chiles lengthwise into thin strips and set aside for the garnish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, pull large pieces of meat off the bones. Place some of the meat in individual serving bowls and ladle on some of the stock, making sure to include pickled onions and garlic cloves with each serving. Garnish with a few strips of chile. (Note: In Yucatán, each diner is usually given a whole charred chile, which you may do for heat-loving friends.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Note:</strong> To brine the turkey, dissolve 1/2 cup (145 g) sea salt and 1/2 cup (100 g) sugar in 1 gallon (4 L) cold water in a large bowl. Add 2 teaspoons (8 g) coarsely crushed black peppercorns and 10 coarsely crushed allspice berries. Place the turkey in the brine and refrigerate for 6 to 8 hours. Drain the chicken, rinse under cold water, and pat dry with paper towels. Discard the brining solution.</p>"}]}