{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140908-aguachile-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Mexican", "keywords": ["aguachile", "ceviche", "easy", "Latin American", "Mexican", "scallop", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Scallop Aguachile With Jalapeño, Cucumber, and Avocado", "link": "https://www.seriouseats.com/recipes/2014/09/scallop-aguachile-ceviche-cucmber-recipe.html", "description": "If you love ceviche, then Mexico's <em>aguachile</em> is for you. Traditionally made with raw shrimp, lime juice, chilies, cucumber, and onion, it's served immediately while still totally raw, unlike most other ceviche recipes. In this variation, sweet raw scallops are tossed with lime juice, jalapeño chilies, cucumber, and red onion, then served with tostadas and avocado (and if you like, beer or tequila).", "totalTime": "20 minutes plus 1 to 2 hours salting time", "recipeYield": "Serves 4 to 6 as a snack or appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Latin American", "Mexican", "Other Seafood", "Sides", "Snacks"], "recipeIngredient": ["1 pound very fresh dry-packed sea scallops, sliced horizontally into 1/4 inch thick rounds (see note)", "Sea or kosher salt", "2 medium jalapeño peppers, stemmed and seeded and roughly chopped (about 3 tablespoons)", "3 tablespoons water", "1/4 cup diced seeded cucumber plus 3/4 cup seeded and thinly sliced cucumber half-moons, divided", "4 tablespoons fresh juice from 4 limes", "1/4 cup loosely packed cilantro leaves and tender stems, roughly chopped", "Freshly ground black pepper", "1/2 cup thinly sliced red onion", "Tostadas and avocado, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange scallops in an even layer on a large plate and sprinkle all over with salt. Cover with plastic and refrigerate for at least 1 hour and up to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, blend jalapeños with water in a blender or with an immersion blender until thoroughly blended. Add diced cucumber and blend until pureed. Add lime juice and cilantro and blend until cilantro is finely chopped. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, toss scallops with jalapeño-lime marinade, onion, and remaining cucumber half-moons. Season once more with salt and pepper and serve right away with tostadas and avocado.</p>"}]}