{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/09/20140902-grilled-cabbage-recipe-6.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["cabbage", "easy", "grill", "grilling", "quick", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Grilled Cabbage With Spicy Thai Dressing", "link": "https://www.seriouseats.com/recipes/2014/09/griled-cabbage-with-spicy-thai-dressing-recipe.html", "description": "Deeply fragrant, with smoky, charred edges, cabbage takes on a nutty, sweet flavor when grilled over blazing-hot coals, and a great texture that's simultaneously tender and crisp. Its layered structure also makes it the ideal vessel for picking up both smoke flavor from the grill and whatever sauce you choose to serve it with. In this case, we're going with a spicy Thai dressing that packs in chili, garlic, fish sauce, and a ton of herbs.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cabbage", "Gluten-Free", "Grilling", "Grilling, Smoking, and Barbecue", "July 4th", "Labor Day", "Memorial Day", "Seasonal and Holiday", "Sides", "Summer", "Thai", "Vegetables"], "recipeIngredient": ["3 tablespoons (45ml) fresh juice from 4 to 6 limes, divided", "3 tablespoons (45ml) fish sauce", "3 tablespoons (45g) palm or light brown sugar", "3 medium cloves garlic, finely minced", "2 teaspoons dried Thai-style chili flakes, more or less to taste (see note)", "2 tablespoons chopped fresh mint leaves", "2 tablespoons chopped fresh cilantro leaves and fine stems", "1 medium head green cabbage, cut into 6 wedges, with core left intact", "2 tablespoons (30ml) extra-virgin olive oil", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine 2 tablespoons (30ml) lime juice and all of fish sauce, sugar, and garlic in a small microwaveable bowl. Microwave on high heat until steaming-hot, about 20 seconds. Add chili flakes. Stir until sugar is dissolved. Allow to cool in refrigerator, then stir in remaining lime juice and herbs. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1 chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cabbage wedges directly over hot side of grill. Cook, covered, until well charred on first side, about 2 minutes. Flip cabbage, cover, and cook until charred on second side, another 2 minutes. Flip wedges to third side, cover, and cook until well charred, another 2 minutes. Transfer cabbage to cooler side of grill, cover, and continue cooking until mostly tender but still crunchy in center, about 4 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cabbage to a large bowl and toss with olive oil, salt, and pepper. Transfer to a serving platter. Drizzle with sauce and serve immediately.</p>"}]}