{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140419-deviled-egg-variations-recipe-22.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["appetizer", "chorizo", "deviled egg", "egg", "hors d'oeuvre", "snack", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Deviled Eggs With Crispy Chorizo, Chorizo Oil, and Smoked Paprika", "link": "https://www.seriouseats.com/recipes/2014/05/deviled-eggs-chorizo-smoked-paprika-recipe.html", "description": "Deviled eggs flavored with crisp fried Spanish chorizo and sherry vinegar, drizzled with bright red chorizo oil and smoked Spanish paprika.", "totalTime": "20 minutes", "recipeYield": "Makes 8 deviled egg halves", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Deviled Eggs", "Snacks", "Spanish"], "recipeIngredient": ["4 ounces dry-cured Spanish style chorizo, finely diced", "6 <a href=\"http://www.seriouseats.com/recipes/2009/10/perfect-boiled-eggs-recipe.html\">hard boiled</a> or <a href=\"http://www.seriouseats.com/recipes/2014/04/steamed-hard-boiled-eggs-recipe.html\">hard steamed eggs</a>, peeled and halved lengthwise", "3 tablespoons mayonnaise", "1 1/2 teaspoons minced parsley, plus more for garnish", "1 tablespoon fresh lemon juice from 1 lemon", "1 1/2 teaspoons sherry vinegar", "Kosher salt and freshly ground black pepper", "Pinch smoked paprika, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat chorizo in a small skillet over medium heat and cook, stirring frequently, until chorizo is crisp and fat is rendered, about 2 minutes. Transfer chorizo to a paper towel-lined plate, reserving extra fat separately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all of the yolks in a medium bowl. Select 8 of the best looking egg white halves and set aside. Reserve the remaining 4 for another use. Add mayonnaise, parsley, lemon juice, and vinegar and, using a sturdy whisk, mash and stir together until thoroughly combined. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer yolk filling to zipper-lock bag. Filling and egg white halves can be stored covered in the refrigerator up to overnight before filling and serving (lay egg white halves cut-side-down on a large plate and cover with plastic wrap). Cut off corner of zipper-lock bag and pipe filling mixture into egg white halves, overstuffing each hole. Garnish with crispy chorizo, drizzle with chorizo oil, and sprinkle with parsley and smoked paprika. Serve immediately.</p>"}]}