{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/01/01132014-btb-blackbottompie.jpg", "author": {"@type": "Person", "name": "Emma Kobolakis"}, "recipeCuisine": "", "keywords": ["chocolate", "four &amp; twenty blackbirds", "lemon", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.3333333333333", "ratingCount": "3"}, "name": "Four &amp; Twenty Blackbirds' Black Bottom Lemon Pie", "link": "https://www.seriouseats.com/recipes/2014/01/four-twenty-blackbirds-black-bottom-lemon-pie.html", "description": "If you're sick of lemon pies topped with cloying clouds of meringue, give this pie a try. A layer of dark chocolate ganache lines the crust, topped with a Meyer lemon curd infused with orange zest. It's a beautiful interplay between dark and light, bitter and sweet flavors.", "totalTime": "2 hours, including baking and cooling (overnight if making crust)", "recipeYield": "makes 1 9-inch pie", "recipeCategory": ["Bake the Book", "Chocolate", "Desserts", "Lemon", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["All-Butter Crust for a 9-inch single-crust pie partially prebaked and cooled", "3/4 cup heavy cream", "4 ounces bittersweet chocolate (we use 70% cocoa), chopped into 1/4-inch pieces", "4 large eggs", " 1 large egg yolk", " 1 1⁄3 cups granulated sugar", "1/2 teaspoon kosher salt", "1/2 cup fresh Meyer lemon juice (from 3 to 4 lemons)", "1/4 cup fresh orange juice", "Finely grated zest of 1 Meyer lemon", "Finely grated zest of 1/4 orange", "<strong>For the Crust:</strong>", "1 1/4 cups unbleached all-purpose flour", "1/2 teaspoon kosher salt", "1 1/2 teaspoons granulated sugar", "1/4 pound (1 stick) cold unsalted butter, cut into 1/2-inch pieces", "1/2 cup cold water", "2 tablespoons cider vinegar", "1/2 cup ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: Make the pie crust before preparing the filling and ganache. For crust instructions, including prebaking, skip to the bottom.</p>\n\n<p>To make the ganache layer, bring 1/4 cup of the heavy cream just to a boil over medium heat in a heavy-bottomed saucepan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the heat and pour in the chocolate pieces. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Swirl the cream around to distribute and cover the chocolate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let sit for 5 minutes, and then whisk gently to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the ganache into the cooled pie shell and spread evenly over the bottom and halfway up the sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate the shell to set the ganache while making the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position a rack in the center of the oven and preheat the oven to 325°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, combine the eggs, egg yolk, sugar, and salt, and mix on medium speed until thick and well combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the lemon and orange juices and zests and the remaining 1/2 cup heavy cream and blend well.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the ganache-lined pie shell on a rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the filling through a fine-mesh sieve directly into the pie shell, or strain it into a separate bowl and then pour it into the shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake on the middle rack of the oven for 25 to 30 minutes, rotating 180 degrees when the edges start to set, 15 to 20 minutes through baking. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The pie is finished when the edges are set and the center is no longer liquid but still quite wobbly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Be careful not to overbake or the custard can separate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The filling will continue to cook and set after the pie is removed from the oven. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow to cool completely on a wire rack, 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve slightly warm, at room temperature, or cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The pie will keep refrigerated for 2 days or at room temperature for 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Stir the flour, salt, and sugar together in a large bowl. Add the butter pieces and coat with the flour mixture using a bench scraper or spatula.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a pastry blender, cut the butter into the flour mixture, working quickly until mostly pea-size pieces of butter remain (a few larger pieces are okay; be careful not to overblend).<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water, cider vinegar, and ice in a large measuring cup or bowl.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle 2 tablespoons of the ice water mixture over the flour mixture, and mix and cut it in with a bench scraper or spatula until it is fully incorporated. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add more of the ice water mixture, 1 to 2 tablespoons at a time, using the bench scraper or your hands (or both) to mix until the dough comes together in a ball, with some dry bits remaining.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze and pinch with your fingertips to bring all the dough together, sprinkling dry bits with more small drops of the ice water mixture, if necessary, to combine. <br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape the dough into a flat disc, wrap in plastic, and refrigerate for at least 1 hour, preferably overnight, to give the crust time to mellow. Wrapped tightly, the dough can be refrigerated for 3 days or frozen for 1 month.</p>\n\n<p><br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Tips for Prebaking:</strong> Have your crust rolled, crimped, and rested in the refrigerator for at least 30 minutes. When it's fully chilled, use a fork to prick all over the bottom and sides, 15 to 20 times. This step, called docking, helps eliminate the air bubbles that can form when the dough is exposed to heat and also prevents the crust from shrinking. Place the crust in the freezer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position the oven racks in the bottom and center positions, place a rimmed baking sheet on the lowest rack, and preheat the oven to 425F. Have ready 1 egg white mixed with 1 teaspoon of water to brush the crust with during baking. This glaze acts to moistureproof the bottom and sides of the crust that will be exposed to the filling. It's not totally necessary, but does make for a better final product.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the crust is frozen solid (about 10 minutes), line it tightly with a piece or two of aluminum foil. Make sure the crimped edges are completely covered and there are no gaps between the foil and the crust. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour pie weights or beans into the pan and spread them so they are concentrated more about the edge of the shell than in the center. Place the pan on the preheated baking sheet and bake for 20 minutes, until the crimped edges are set but not browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the pan and the baking sheet from the oven, lift out the foil and pie weights, and let the crust cool for a minute. Use a pastry brush to coat the bottom and sides with a thin layer of egg white glaze (1 egg white whisked with 1 teaspoon of water) to moistureproof the crust. Return the pan, on the baking sheet, to the oven's middle rack and continue baking for 3 more minutes. Remove and cool completely before filling.</p>"}]}