{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/04/20140418-289641-cook-the-book-chicken-lady-chicken.jpg", "author": {"@type": "Person", "name": "Kate Williams"}, "recipeCuisine": "French", "keywords": ["chicken", "Cook the Book", "david lebovitz", "French", "my paris kitchen"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Chicken Lady Chicken From 'My Paris Kitchen'", "link": "https://www.seriouseats.com/recipes/2014/04/chicken-lady-chicken-from-my-paris-kitchen.html", "description": "On the page before <a href=\"http://www.davidlebovitz.com/\" target=\"_blank\">David Lebovitz</a> begins his recipe for \"Chicken Lady Chicken\" in his new book, <em><a href=\"http://www.amazon.com/My-Paris-Kitchen-Recipes-Stories/dp/1607742675/?tag=serieats-20\" target=\"_blank\">My Paris Kitchen</a></em>, he tells the story of how he fell for one particular woman's rotisserie chicken.", "totalTime": "1 hour, plus 24 to 48 hours marinating time", "recipeYield": "serves 4", "recipeCategory": ["Chicken", "Cook the Book", "French", "Mains"], "recipeIngredient": ["3 cloves garlic, peeled and minced", "11/2 teaspoons sea salt or kosher salt", "2 tablespoons olive oil", "2 tablespoons freshly squeezed lemon juice", "2 tablespoons white wine", "1 tablespoon soy sauce", "21/2 teaspoons harissa, Sriracha, or Asian chile paste", "2 teaspoons Dijon or yellow mustard", "2 teaspoons honey", "1 (3-pound/1.5kg) chicken"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the minced garlic and salt in a resealable plastic bag and crush it with the heel of your hand until it’s a paste. Add the olive oil, lemon juice, white wine, soy sauce, harissa, mustard, and honey to the bag, combining the ingredients well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the backbone of the chicken by snipping down both sides of the spine with poultry shears, or taking a chef’s knife and cutting along both sides of it, and pulling it off. With the breast side down on the cutting board, take a knife and crack the bone between the breasts, then push the chicken down with your hands so it spreads out and lies flat. Flip the chicken over so it’s skin side up and press down with the heels of your hands on the chicken very firmly—like you’re giving it a shiatsu massage—to flatten it as much as you possibly can. Don’t go easy on it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Loosen the skin from the breast and thigh meat and spoon some of the marinade under the skin. Put the chicken in the bag, close it securely, and use your hands to rub the ingredients into the chicken. Refrigerate it for 1 to 2 days, flipping the bag over a few times as it marinates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook the chicken, preheat the oven to 400ºF (200ºC). Heat a cast-iron skillet or grill pan over medium-high heat on the stovetop and place the chicken in it, breast side down. Drape a sheet of heavy-duty aluminum foil over the top and set a heavy weight on top of it. A good option is a brick or a large saucepan filled with water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the chicken until the skin is a deep golden brown, which usually takes about 10 minutes or so—check it often. Once it’s browned, flip the chicken over, replace the weight, and let it cook for about 5 more minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the weight and the foil and place the chicken in the oven for 25 minutes, until it’s cooked through. To serve it French-style, cut the chicken into eight pieces: two legs, two thighs, and cut each breast in half crosswise, leaving the wings attached.</p>"}]}