{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140804-crab-pasta-yasmin-fahr-2.jpg", "author": {"@type": "Person", "name": "Yasmin Fahr"}, "recipeCuisine": "", "keywords": ["crab", "gluten free", "pasta", "quinoa", "seafood", "shellfish", "tomato", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Linguine With Zucchini, Tomato, and Crab", "link": "https://www.seriouseats.com/recipes/2014/08/one-pot-wonders-zucchini-tomato-crab-pasta-recipe.html", "description": "With the farmers market filled with plump, juicy tomatoes, stacks of smooth-skinned zucchini, and aromatic fresh herbs, now is the perfect time to combine summer's best produce into one vegetable-filled pasta. Some bonus crabmeat kicks it up a decadent notch.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Gluten-Free", "Lobster and Crab", "One-Pot Wonders", "Pasta", "Quick Dinners", "Quinoa", "Tomato", "Zucchini"], "recipeIngredient": ["Kosher salt and freshly ground black pepper", "Water", "1 pound regular, whole wheat, or quinoa linguine", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "1/2 red onion, sliced", "Pinch of red chili flakes", "1 large zucchini, diced (about 2 cups)", "2 cups quartered cherry tomatoes", "1 quart homemade vegetable stock or low-sodium vegetable broth", "6 ounces lump blue crabmeat, picked over for shells", "1/2 cup loosely packed basil leaves, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot of salted boiling water, cook pasta for half the cooking time specified on the package. Drain in a colander, drizzle lightly with oil and toss to coat to prevent sticking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out the pot, then add the remaining 2 tablespoons olive oil and heat over medium-high heat until shimmering. Add onion, a pinch of salt, and chili flakes and cook until softened, about 4 minutes. Add zucchini and tomatoes, season with salt and pepper, and cook until tomatoes and zucchini have softened, about 5 minutes. Transfer to a bowl along with any juices and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pasta to the pot along with 1 cup vegetable stock and cook over medium-high heat, stirring frequently, until most of the stock is absorbed. Continue stirring in stock, 1/2 cup at a time, until pasta is al dente (you may not need the full quart of vegetable stock; conversely, if you use all of the stock and still need to cook the pasta further, add water 1/2 cup at a time until pasta is al dente). Stir in tomato mixture and crabmeat and cook until warmed through; if necessary, add more water or stock, 1 tablespoon at a time, to create a saucy consistency. Season with salt and pepper, top with fresh basil, and serve.</p>"}]}