{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20140730-ideas-in-food-Marinade-Ingredients-Puree.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["cheese", "ideas in food", "salami", "sandwich", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Steak Bomb With Flap Steak, Scallions, and Salami-Cheese Crisps", "link": "https://www.seriouseats.com/recipes/2014/08/the-steak-bomb-upgrade-recipe.html", "description": "Grilled flap steak, charred scallions, salami-cheese crisps, a rich pepper-and-onion sauce, all packed into a soft roll with salami baked into it. These sandwiches are the bomb. The reinvented Steak Bomb, to be exact.", "totalTime": "5 hours", "recipeYield": "Makes 20 small (slider-sized) sandwiches", "recipeCategory": ["Beef", "Cheese", "Mains", "Sandwiches"], "recipeIngredient": ["<strong>For the Flavor Base:</strong>", "2 red bell peppers, stemmed, seeded and cut into 1-inch chunks", "2 medium onions, peeled and roughly diced", "1 head of garlic, peeled", "50 grams soy sauce", "75 grams fish sauce, such as Red Boat", "150 grams dry white wine", "10 grams smoked paprika", "&nbsp;", "<strong>For the Steak:</strong>", "1 whole Beef Flap steak (about 3 pounds 8 ounces; see note)", "&nbsp;", "<strong>For the Beef-Fat Oil:</strong>", "Reserved Beef Fat and Trim (from above)", "110 grams extra-virgin olive oil", "&nbsp;", "<strong>For the Peppers and Onions:</strong>", "Reserved Flavor Base", "1/2 batch Rendered Beef Fat Oil", "100 grams ketchup", "100 grams brown mustard", "100 grams rice vinegar", "6 red bell peppers, stemmed, seeded, and thinly sliced", "4 large sweet onions, peeled and thinly sliced", "3 grams kosher salt", "&nbsp;", "<strong>For the Charred Scallions:</strong>", "3 bunches scallions, washed and root ends trimmed", "Coarse salt, for seasoning", "&nbsp;", "<strong>For the Cheese-and-Salami Crisps:</strong>", "7 thick slices provolone chees", "21 small slices salami", "<a href=\"http://www.seriouseats.com/2014/07/ideas-in-food-vs-steak-bomb-part-1.html\">Soft Bread Salami Rolls</a>, split"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Flavor Base:</strong> Combine all Flavor Base ingredients in a blender and turn it to low speed. Slowly increase speed to high. Puree mixture until smooth. Divide Flavor Base into two equal portions and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Steak:</strong> Set steak on cutting board and remove any fat, silver skin, or unsightly pieces of meat. Reserve beef and fat trimmings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Score both sides of steak about 1/4-inch deep in a cross-hatch pattern. Divide steak into 4 equal pieces. Put steak in a zipper-lock bag and cover with 1/2 of Flavor Base. Squeeze out as much excess air as possible and seal bag. Put bag into a baking dish and refrigerate meat until you are ready to grill it, at least 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Beef-Fat Oil:</strong> Combine reserved beef fat and trimmings and olive oil in a medium pot set over medium heat. Let mixture come to a simmer and reduce heat to low. Cook, stirring occasionally, until fat renders and beef browns, about 1 hour. Remove from heat and strain through a strainer set over a heat-proof bowl. Discard fat and trimming solids and reserve rendered fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Peppers and Onions:</strong> Put remaining Flavor Base and beef fat oil in a medium pot set over medium heat. Bring it to a simmer and reduce heat to low. Cook until the sauce darkens, about 45 minutes. Add ketchup, mustard, and rice vinegar and cook sauce for 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add peppers, onions, and salt to a large pot. Stir in sauce and cook over medium-low heat, stirring occasionally, until peppers and onions are soft and tender, about 45 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Charred Scallions:</strong> Arrange scallions in a single layer on a stainless steel rack set over a baking sheet. Set the baking sheet onto a heat-proof surface, such as a stovetop. Using a butane torch, char scallions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let scallions cool, then roughly chop. Transfer scallions to a shallow baking dish large enough to hold the steak. Season scallions with coarse salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Remove steak from bags, pat dry, and brush with remaining rendered beef fat. Grill steak over coals, turning every 30 seconds and basting with remaining beef fat, until steak registers 130&deg;F on an instant-read thermometer, about 10 minutes. Set steak on top of scallions in baking dish, cover loosely with foil, and let rest for at least 10 minutes. Slice beef 1/4 inch thick across the grain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cheese-and-Salami Crisps:</strong> Meanwhile, preheat an electric griddle to 300&deg;F or set a cast iron skillet on a stovetop over medium-high heat. Arrange 3 slices of salami together on griddle or in skillet and top with a slice of provolone. Cook until top is melted and the bottom is caramelized. Transfer to a stainless steel rack set over a baking sheet to cool and repeat with remaining salami and cheese. Cut each crisp into thirds.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a generous spoonful of peppers and onions on bottom half of each roll. Add a small spoonful of charred scallions. Arrange steak on top. Top each mound of steak with a Cheese-and-Salami Crisp and cover with the top half of the roll. Serve immediately.<br />\n</p>"}]}