{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/11/20141120-turkey-enchilada-mole-thanksgiving-6.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["easy", "enchilada", "Mexican", "mole", "quick", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "15-Minute Turkey Enchiladas", "link": "https://www.seriouseats.com/recipes/2014/11/15-minute-turkey-mole-enchilada-recipe.html", "description": "Supposing that you've got yourself a big 'ol pile of leftover turkey sitting in the fridge, and right next to it happens to be a batch of the mole poblano you made a few weeks back. There's only one possible outcome to this situation: turkey and mole enchiladas (or, if you want to get really technical about it, <em>enmoladas</em>).", "totalTime": "15 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Mains", "Mexican", "Turkey"], "recipeIngredient": ["4 to 8 soft corn tortillas, warmed in the microwave or in a foil-wrapped pouch in the oven or toaster oven", "1 1/2 ounces picked roast turkey meat per tortilla", "3 tablespoons vegetable or canola oil", "Kosher salt", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2012/10/mole-poblano-recipe-how-to-make-mole.html\">homemade</a> or store-bought <em>mole poblano</em> per tortilla (see note)", "1 tablespoon Mexican-style crema per tortilla (see note)", "Crumbled cotija cheese for serving", "Sliced white onions for serving", "Chopped fresh cilantro leaves for serving", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a single tortilla on a cutting board. Add 1 1/2 ounce of turkey meat. Roll tightly into a cigar shape and rest on seam. Repeat with remaining tortillas and turkey.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a cast iron or non-stick skillet over medium-high heat until shimmering. Reduce heat to medium. Add enchiladas seam-side-down in a single row (you may have to work in batches). Cook without moving until crisp on first side, 2 to 3 minutes. Carefully turn with tongs or a slotted spatula and cook on second side until crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from pan and drain on paper towels. Season with salt immediately. If cooking in batches, cooked enchiladas can be held in a 200°F oven while you cook the second batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, spread half of sauce on a plate. Top with enchiladas and spoon remaining sauce on top. Drizzle with crema. Sprinkly with cotija, onions, and cilantro. Serve immediately with lime wedges.</p>"}]}