{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/01/CHICKENCHICKPEASTEW.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["chicken", "chickpea", "chorizo", "easy", "quick", "spanish", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4285714285714", "ratingCount": "7"}, "name": "30-Minute Pressure Cooker Chicken With Chickpeas, Tomatoes, and Chorizo", "link": "https://www.seriouseats.com/recipes/2015/01/30-minute-pressure-cooker-chicken-chickpeas-tomatoes-chorizo-recipe.html", "description": "The pressure cooker is an amazing device for making flavor-packed stews in very short order. In this version, canned chickpeas, roasted tomatoes, smoked paprika, and chorizo come together to form a flavorful base for fall-off-the-bone tender chicken legs. It all cooks in under half an hour start to finish.", "totalTime": "30 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Chicken", "Legumes", "Mains", "Pressure Cooker", "Quick Dinners", "Soups and Stews", "Spanish"], "recipeIngredient": ["2 tablespoons extra-virgin olive oil, plus more for serving", "8 ounces Spanish-style chorizo, cut into 1/2-inch dice", "1 medium onion, thinly sliced (about 1 cup)", "1 tablespoon smoked Spanish paprika", "2 (15-ounce) cans chickpeas, drained and rinsed", "1 (28-ounce) can diced tomatoes, preferably fire-roasted (such as Muir Glen)", "1 whole chicken (about 4 pounds), cut into 8 serving pieces, or a mix of bone-in, skin-on breasts, drumsticks, and/or thighs", "2 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "Kosher salt and freshly ground black pepper", "2 teaspoons sherry vinegar", "Chopped fresh parsley leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a pressure cooker over medium-high heat until shimmering. Add chorizo and cook, stirring, until just starting to crisp around the edges, about 2 minutes. Add onions and cook, stirring, until softened, about 3 minutes. Add paprika, chickpeas, tomatoes, chicken pieces, and broth. Season gently with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Seal pressure cooker and bring to high pressure. Cook for 15 minutes. Cool pressure cooker under a cold running tap (if using an electric cooker, use the quick release valve), and open. Return to high heat and cook, stirring gently, until it achieves a thick, stew-like consistency, about 5 minutes. Stir in vinegar and season to taste with salt and pepper. Stir in parsley and serve, drizzling with more extra-virgin olive oil at the table.</p>"}]}