{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150715-fried-chicken-08.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "comfort", "fried", "fried chicken", "Southern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "24"}, "name": "The Food Lab's Southern Fried Chicken", "link": "https://www.seriouseats.com/recipes/2015/07/the-food-lab-southern-fried-chicken-recipe.html", "description": "For me, as a kid growing up in New York, fried chicken came from one place, and one place only: those grease-stained cardboard buckets peddled by the Colonel himself. But times have changed, and as is often the case, revisiting those fond childhood memories results only in disappointment and disillusionment. That said, stylistically, it can't be faulted. So I figured that I could somehow manage to take what the Colonel started and bring it to its ultimate conclusion&mdash;that is, deep chicken flavor; a flab-free skin; juicy, tender meat; and crisp, spicy coating&mdash;I might just be able to recapture those first fleeting childhood tastes of fried chicken as I remembered them. Here's the result of my efforts.", "totalTime": "At least 5 hours and up to overnight", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Chicken", "Deep Frying", "Fried Chicken", "Mains", "The Food Lab"], "recipeIngredient": ["2 tablespoons paprika", "2 tablespoons freshly ground black pepper", "2 teaspoons garlic powder", "2 teaspoons dried oregano", "1/2 teaspoon cayenne pepper", "1 cup buttermilk", "1 large egg", "Kosher salt", "One whole chicken, about 4 pounds, <a href=\"http://www.seriouseats.com/2010/05/knife-skills-how-to-break-down-a-chicken.html\">cut into 10 pieces</a> or 3 1/2 pounds bone-in, skin-on breasts, legs, drumsticks, and/or wings", "1 1⁄2 cups all-purpose flour", "1⁄2 cup cornstarch", "1 teaspoon baking powder", "4 cups vegetable shortening or peanut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the paprika, black pepper, garlic powder, oregano, and cayenne in a small bowl and mix thoroughly with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the buttermilk, egg, 1 tablespoon salt, and 2 tablespoons of the spice mixture in a large bowl. Add the chicken pieces and toss and turn to coat. Transfer the contents of the bowl to a gallon-sized zipper-lock freezer bag and refrigerate for at least 4 hours, and up to overnight, flipping the bag occasionally to redistribute the contents and coat the chicken evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the flour, cornstarch, baking powder, 2 teaspoons salt, and the remaining spice mixture in a large bowl. Add 3 tablespoons of the marinade from the zipper-lock bag and work it into the flour with your fingertips. Remove one piece of chicken from the bag, allowing excess buttermilk to drip off, drop the chicken into the flour mixture, and toss to coat. Continue adding chicken pieces to the flour mixture one at a time until they are all in the bowl. Toss the chicken until every piece is thoroughly coated, pressing with your hands to get the flour to adhere in a thick layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to the middle position and preheat the oven to 350&deg;F. Heat the shortening or oil to 425&deg;F in a 12-inch straight-sided cast-iron chicken fryer or a large wok over medium-high heat. Adjust the heat as necessary to maintain the temperature, being careful not to let the fat get any hotter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One piece at a time, transfer the coated chicken to a fine-mesh strainer and shake to remove excess flour. Transfer to a wire rack set on a rimmed baking sheet. Once all the chicken pieces are coated, place skin side down in the pan. The temperature should drop to 300&deg;F; adjust the heat to maintain the temperature at 300&deg;F for the duration of the cooking. Fry the chicken until it’s a deep golden brown on the first side, about 6 minutes; do not move the chicken or start checking for doneness until it has fried for at least 3 minutes, or you may knock off the coating. Care- fully flip the chicken pieces with tongs and cook until the second side is golden brown, about 4 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the chicken to a clean wire rack set on a rimmed baking sheet and place in the oven. Cook until an instant-read thermometer inserted into the thickest part of the breast registers 150°F and the legs register 165°F, 5 to 10 minutes; remove the chicken pieces to a second rack or a paper-towel-lined plate as they reach their final temperature. Season with salt and serve&mdash;or, for extra-crunchy fried chicken, go to step 7.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the plate of cooked chicken in the refrigerator for at least 1 hour, and up to overnight. When ready to serve, reheat the oil to 400°F. Add the chicken pieces and cook, flipping them once halfway through cooking, until completely crisp, about 5 minutes. Transfer to a wire rack set on a rimmed baking sheet to drain, then serve immediately.</p>"}]}