{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/01/20141222-the-kitchn-cookbook-icebox-cake-leela-cyd.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["cake", "Cook the Book", "dessert", "the kitchn cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "No-Bake Banana and Peanut Butter Caramel Icebox Cake From 'The Kitchn Cookbook'", "link": "https://www.seriouseats.com/recipes/2015/01/no-bake-banana-and-peanut-butter-caramel-iceb.html", "description": "With all the cookie baking going on around the holidays, it was nice to not have to turn on the oven for this over-the-top icebox cake from <a href=\"http://www.amazon.com/Kitchn-Cookbook-Recipes-Kitchens-Inspire/dp/0770434436/?tag=serieats-20\"><em>The Kitchn Cookbook: Recipes, Kitchens &amp; Tips to Inspire Your Cooking,</em></a> by Sara Kate Gillingham and Faith Durand. Graham crackers are layered with a cream cheesy whipped cream, bananas, chopped peanuts and pecans, and a killer peanut butter caramel sauce.", "totalTime": null, "recipeYield": "Serves 6 to 8", "recipeCategory": ["Cakes", "Cook the Book", "Desserts", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>For the peanut butter caramel sauce</strong>", "1/2 cup sugar", "1/2 cup heavy cream", "1/4 cup creamy peanut butter", "Generous pinch of kosher salt", "&nbsp;", "<strong>For the cake</strong>", "4 ounces cream cheese, very soft", "1 14-ounce can sweetened condensed milk", "2 3/4 cups heavy cream", "2 teaspoons pure vanilla extract", "1/2 teaspoon salt", "1/2 cup finely chopped peanuts", "1/2 cup finely chopped pecans", "4 sleeves graham crackers (about 19 ounces, or 28 to 30 whole crackers)", "3 small to medium bananas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the peanut butter caramel sauce</strong><br />\nMix the sugar with 2 tablespoons of water in a 2-quart saucepan. Heat over medium to high heat, stirring occasionally, until the mixture comes to a rolling boil. Stop stirring and cook over high heat for 5 to 10 minutes, until the sugar develops brown streaks. Swirl the pan by the handle and watch for the first sign of smoke. As soon as the caramel turns dark brown and smokes, take the pan off the heat and whisk in the heavy cream. Be careful&mdash;the mixture will steam and bubble up violently. Return the pan to the heat and bring the caramel sauce to a simmer over low heat. Add the peanut butter and salt and whisk until the sauce is very smooth, then remove the pan from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To assemble the cake</strong><br />\nIn the bowl of a stand mixer fitted with the paddle attachment, or in a large bowl using a hand mixer, whip the cream cheese until it is very smooth and creamy. Add the sweetened condensed milk very gradually, whipping continually and stopping to scrape down the bowl as necessary.<br />\nWhen the milk is smoothly incorporated, and with the mixer still going, slowly pour in the cream. Add the vanilla and salt and whip on medium or high speed for 5 to 10 minutes, or until the cream holds soft peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the peanuts and pecans together in a bowl and set aside. If the peanut butter caramel has cooled too much to pour easily, warm it gently over low heat, then transfer it to a glass measuring cup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread a spoonful of the whipped cream over the bottom of a 9 × 13-inch baking pan, or a similarly sized platter. (This keeps the graham crackers from sliding around.) Lay down six or more graham crackers, enough to completely fill the bottom of the pan. Lightly cover the top of the graham crackers with a quarter of the remaining whipped cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel and quarter the bananas lengthwise, then chop them fine. Arrange a third of the bananas over the whipped cream. Sprinkle with 1/4 cup of the mixed nuts, and drizzle about a quarter of the peanut butter caramel sauce over the top. Make another layer with graham crackers, whipped cream, bananas, nuts, and caramel, then repeat again. (You will have three layers of crackers, whipped cream, bananas, nuts, and caramel.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with a final layer of crackers. Swirl the remaining whipped cream on top, sprinkle with the remaining nuts, and drizzle on the remaining peanut butter caramel sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate the cake uncovered for 4 hours, or until the crackers have softened completely. This cake is best when made no more than 12 hours ahead of time. It will last 3 days, covered, in the refrigerator.</p>"}]}