{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150416-gravlax-vicky-wasik-23.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["appetizer", "brine", "Cure", "easy", "fish", "gravlax", "salmon", "Scandinavian", "seafood", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.3333333333333", "ratingCount": "3"}, "name": "Gravlax With Caraway, Coriander, and Mustard-Dill Sauce", "link": "https://www.seriouseats.com/recipes/2015/04/gravlax-cured-salmon-recipe.html", "description": "Luxurious foods are, practically by definition, extremely expensive. Except for gravlax. For the price of a fresh piece of salmon, you can cure your own gravlax at home, then slice it and serve it as one of the most elegant hors d'oeuvres or light appetizers imaginable. In this recipe, we cure the salmon with sugar and salt, caraway, coriander, and dill, then serve it with a tangy mustard-dill sauce.", "totalTime": "2 to 3 days", "recipeYield": "Serves 10 to 15 as an hors d'oeuvre", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Father's Day", "Mother's Day", "No-Cook", "Salmon", "Sides", "Snacks", "Valentine's Day"], "recipeIngredient": ["Kosher salt", "1 (2-pound; 900g) skin-on sushi-grade salmon fillet, pin bones removed by fishmonger", "1 teaspoon caraway seeds", "1 teaspoon coriander seeds", "40g kosher salt (about 4 tablespoons), plus more for washing salmon", "25g sugar (about 1 tablespoon)", "1/2 teaspoon freshly ground white pepper or black pepper", "2 large bunches dill", "<strong>For the Sauce:</strong>", "3 tablespoons (45ml) distilled white vinegar", "2 tablespoons roughly chopped dill fronds", "5 tablespoons (75ml) Dijon mustard", "1 tablespoon (15g) sugar", "1/4 cup (60ml) canola or vegetable oil", "Freshly ground black pepper", "Sliced pumpernickel bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with cold water and add enough salt to make it taste like the sea. Add salmon and let stand 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet, toast caraway and coriander seeds over high heat, stirring constantly, until fragrant, about 1 minute. Transfer to a spice grinder or mortar and pestle and grind finely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together salt, sugar, ground caraway and coriander seeds, and white or black pepper until thoroughly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove salmon from bath and pat dry with paper towels. On a work surface, turn salmon skin side up and sprinkle about half of salt mixture all over, rubbing in with fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange half of dill all over the bottom of a baking dish large enough to hold salmon. Set salmon skin side down on bed of dill. Rub remaining salt mixture all over top and sides of salmon, then top with remaining dill. Cover salmon with plastic, then top with a weight (such as a smaller baking dish or plate with cans of beans on top). Refrigerate for 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unpack salmon and turn skin side up. Re-pack with dill, cover with plastic, and set weight back on top. Refrigerate until salmon is sufficiently cured, 1 day longer for a lighter cure or 2 days longer for slightly more cure (which will mean a slightly firmer texture and saltier flavor).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Before serving, make the sauce. In a blender or mini food processor, or using an immersion blender, combine vinegar with chopped dill fronds, mustard, and sugar and blend until dill is very finely chopped. Add oil and blend until a smooth sauce has formed. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unpack salmon, scraping off dill, and set on a work surface. Using a very sharp slicing knife, cut gravlax on a bias into thin slices. Arrange on slices of pumpernickel bread and drizzle sauce on top. Serve. Gravlax can be kept refrigerated, tightly wrapped in plastic, for approximately 5 days after curing.</p>"}]}