{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/01/redwinebeefshanks.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["beef", "braise", "wine", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Red Wine-Braised Beef Shanks", "link": "https://www.seriouseats.com/recipes/2015/01/red-wine-braised-beef-shanks-recipe.html", "description": "Beef shanks are braised in an ample amount of red wine with carrots and onions until the meat is tender and falling off the bone. The braising liquid and aromatic vegetables are then blended into a rich sauce.", "totalTime": "4 hours", "recipeYield": "Serve 6", "recipeCategory": ["Beef", "Braising and Stewing", "Father's Day", "Mains", "Mother's Day", "Valentine's Day"], "recipeIngredient": ["6 beef hindquarter shanks (about 1 1/2 inches thick and 1 pound each)", "Kosher salt and freshly ground black pepper", "4 tablespoons extra-virgin olive oil", "2 large yellow onions, diced", "6 medium carrots, diced", "12 medium cloves garlic, minced", "6 cups dry red wine", "4 sprigs thyme", "2 bay leaves", "1 teaspoon soy sauce", "Hot water or chicken stock, as needed", "Minced parsley, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preaheat oven to 300&deg;F. Season shanks all over with salt and pepper. In a large heavy roasting pan (alternatively, you can use 2 large pots such as Dutch ovens or straight-sided sauté pans, splitting ingredients between them), heat oil over high heat until shimmering. Add shanks and cook until browned on both sides, about 5 minutes per side. Transfer shanks to a platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower heat to medium-high and add onion, carrot, and garlic and cook, stirring, until softened, about 10 minutes. Add wine, scraping up any browned bits, and bring to a simmer; lower heat to medium and cook until raw alcohol smell has mostly cooked off, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add thyme and bay leaves. Nestle shanks in cooking liquid so that they are almost mostly but not completely submerged; pour any accumulated juices from shanks into the roasting pan. Cut out a piece of parchment paper about the size of the roasting pan (or pots). Cut a hole in the center of the parchment and press against surface of shanks. Transfer to oven and braise until shanks are tender, about 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard parchment and transfer shanks to a clean platter. Skim rendered fat off surface of braising liquid and discard thyme and bay leaves. Using an immersion blender or blender, blend aromatics and braising liquid to form a smooth sauce. Thin with warm water or stock as needed to create a consistency just thick enough to coat the back of a spoon. Add soy sauce and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve shanks with sauce, sprinkling parsley on top. Shanks can be refrigerated in their sauce for up to 4 days. Reheat before serving, and thinning reheated sauce if necessary with water.</p>"}]}