{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150327-poutine-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["cheese", "fry", "gravy", "potato", "poutine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "The Ultimate Poutine", "link": "https://www.seriouseats.com/recipes/2015/03/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe.html", "description": "A perfect poutine is a trifecta of the best of its three ingredients&mdash;fries with a crisp exterior and soft interior, fresh and soft squeaky cheese curds, and a beefy brown gravy that's just flavorful enough without overwhelming the fries or curds. Getting each piece of the puzzle together for an ultimate version like this takes some time, but once complete, the reward is so good you'll go gaga even if you're totally sober.", "totalTime": "5 hours", "recipeYield": "Serves 4-6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "French Fries", "Sides", "Snacks"], "recipeIngredient": ["<strong>For the Gravy (See Note):</strong>", "1 tablespoon canola or vegetable oil", "2 pounds beef oxtails", "1 pound beef marrow bones", "1 pound veal bones", "1 pound chicken necks, backs, or legs", "2 medium carrots, roughly chopped", "1 stalk celery, roughly chopped", "1 large onion, quartered", "4 medium cloves garlic, smashed and peeled", "1 quart <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium broth", "3 quarts water", "3 sprigs fresh parsley", "3 sprigs fresh thyme", "2 bay leaves", "1 tablespoon whole black peppercorns", "1/4 cup unsalted butter", "1/4 cup all-purpose flour", "1 tablespoon rice vinegar", "Kosher salt", "<strong>For the Fries:</strong>", "4 large skin-on russet potatoes (about 2 pounds), cut into 1/4-inch sticks on a <a href=\"http://www.seriouseats.com/2015/01/what-are-the-best-cheap-mandoline-vegetable-fruit-slicers.html\">mandoline</a>", "2 quarts peanut oil", "12 ounces freshly made white cheddar cheese curds (preferably not more than 24 hours old), either store-bought or <a href=\"http://culturecheesemag.com/diy/homemade-squeaky-cheese-curds\" target=\"_blank\">homemade</a>, at room temperature and broken into bite-size pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Gravy:</strong> Heat oil in a large stock pot over high heat until shimmering. Add oxtails and cook until deeply browned, about 4 minutes per side. Transfer to a plate. Add beef and veal bones and cook until deeply browned, about 10 minutes total. Transfer to plate with oxtails. Add chicken pieces and cook until well browned, 5 to 8 minutes. Transfer to plate with oxtails and bones. Stir in carrots, onion, and garlic and cook until well browned. Stir in chicken stock, scraping up any browned bits from bottom of pot. Add water, parsley, thyme, bay leaves, peppercorns, oxtails, beef bones, chicken, and any accumulated juices from plate. Bring stock to a simmer, then reduce heat to low and cook at a bare simmer for 3 hours. Pour stock through a fine mesh strainer into a large bowl. Remove fat from stock by skimming with a ladle, using a fat separator, or placing stock in refrigerator until chilled, then discarding hardened fat from the surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in medium saucepan over medium-high heat until foaming. Whisk in flour and cook, stirring constantly, until golden blonde, about 2 minutes. Gradually whisk in 3 cups of stock in a steady stream. Bring to a boil, reduce to a simmer, and cook until reduced to 2 cups, 10 to 15 minutes. Remove from heat, stir in vinegar, and season with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fries:</strong> Place potatoes in a large bowl and cover completely with cold water. Let soak for at least 1 hour, or, alternatively, drain water and rinse again, changing water until it runs completely clear. Drain potatoes and dry thoroughly with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large Dutch oven or wok to 350&deg;F. Working in batches, add potatoes and cook, stirring and turning frequently until pale blonde, about 5 minutes. Transfer potatoes to a paper towel-lined baking sheet. (For crispiest fries, see note about adding a freezing step.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil to 425&deg;F. Add potatoes and cook, stirring and turning frequently, until deep golden brown, about 3 minutes. Transfer to paper towel-lined bowl and season with salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat gravy over high heat until hot. Place fries in a shallow bowl or dish, top generously with cheese curds, and ladle on gravy. Serve immediately.</p>"}]}