{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150625-Summer-Strawberry-Pie-beauty-1-Yvonne-Ruperti2.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "", "keywords": ["dessert", "fruit dessert", "no bake", "strawberry", "summer baking"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Summer Strawberry Pie", "link": "https://www.seriouseats.com/recipes/2015/07/summer-strawberry-pie-recipe.html", "description": "This no-bake, no-cook strawberry pie really makes the most of perfect summer berries. Macerated strawberries and strawberry puree are gently held together in a graham cracker crust, delivering juicy slices and fresh-picked flavor. It'll keep your kitchen nice and cool, too.", "totalTime": "5 to 7 hours", "recipeYield": "Makes one 9 1/2-inch pie", "recipeCategory": ["Fruit Desserts", "No-Cook", "Pies, Tarts, and Crumbles", "Strawberry"], "recipeIngredient": ["<strong>For the Crust:</strong>", "8 tablespoons (4 ounces) unsalted butter, melted, using more if needed", "14 ounces graham crackers (about 24 crackers), crushed into fine crumbs in a food processor or blender", "<strong>For the Strawberry Filling:</strong>", "3 pounds fresh strawberries, hulled, divided", "1 cup (7 ounces) granulated sugar", "2 1/4 teaspoons powdered unflavored gelatin", "Pinch kosher salt", "1 teaspoon juice from 1 lemon (optional; see note)", "Lightly sweetened whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> In a medium bowl, stir butter into graham cracker crumbs until evenly incorporated. Firmly press into an even layer lining the bottom and sides of a 9-inch deep-dish pie plate; it helps to use the bottom of a measuring cup to flatten bottom of crust evenly. Refrigerate until ready to fill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Strawberry Filling:</strong> Place 12 ounces of strawberries in a food processor or blender and blend to a smooth puree. You should have about 3/4 cup puree (it's okay to have up to a cup ).Transfer to a 2-cup liquid measuring cup and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut remaining strawberries into 3/4-inch slices, transfer to a large bowl, and stir in the sugar. Let stand, stirring occasionally, until berries release about 3/4 cup liquid, about 1 hour. Measure out enough macerating liquid to combine with strawberry puree for 1 1/2 cups total. Drain macerated berries of any extra liquid; reserve extra liquid for another use or discard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place 2 tablespoons water in a small microwave-safe bowl. Sprinkle gelatin evenly on top and let stand 5 minutes. Microwave gelatin mixture in 10-second intervals until gelatin is melted and hot, about 10 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape melted gelatin into a large bowl, then gradually whisk in strawberry puree mixture until well combined. Whisk in salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add drained macerated strawberry chunks and stir to combine. Adjust taste with lemon juice, if desired, then immediately pour into the prepared pie crust. Turn the berries on top skin side up for best presentation. Refrigerate until set, 4 to 6 hours. Serve with whipped cream. </p>"}]}