{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150806-ultra-smashed-burgers-layered-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["beef", "breakfast", "brunch", "burger", "smashed burger"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Ultra-Smashed Brunch Burgers With Quick Jalapeño Hollandaise", "link": "https://www.seriouseats.com/recipes/2015/08/smashed-brunch-burger-jalapeno-hollandaise-recipe.html", "description": "Perhaps the greatest hangover killer ever invented, this brunch-themed smash burger has it all: crispy, lacy smashed beef patties, a fried egg, melted cheese, avocado, bacon, and a jalapeño-and-lime-infused Hollandaise.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Breakfast and Brunch", "Burger", "Eggs", "Mains", "Mother's Day", "Sandwiches"], "recipeIngredient": ["<strong>For the Bacon:</strong>", "8 slices bacon", "<strong>For the Jalapeño Hollandaise:</strong>", "1 large egg yolk", "1 teaspoon water", "1 teaspoon fresh juice from 1 lime", "Pinch of kosher salt", "1 stick unsalted butter (8 tablespoons)", "1 jalapeño, stemmed, seeded, and chopped, divided", "<strong>For the Smashed Burgers and to Serve:</strong>", "4 English muffins, split, toasted, and buttered", "1 pound ground beef chuck, divided into 8 (2-ounce) balls", "Kosher salt and freshly ground black pepper", "4 slices Colby-Jack cheese", "1/4 avocado, pitted and sliced", "2 tablespoons unsalted butter", "4 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bacon:</strong> Preheat oven to 400&deg;F. Line a rimmed baking sheet with foil and arrange bacon on top in a single layer. Bake until crisp and evenly cooked, about 16 minutes, rotating baking sheet once front to back during cooking. Place bacon on a paper towel&ndash;lined plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Jalapeño Hollandaise:</strong> In the bottom of a tall, narrow container that just fits the head of an immersion blender, combine the egg yolk, water, lime juice, and a pinch of salt. In a small saucepan over high heat, melt the butter. Swirl the saucepan constantly until the butter is no longer foaming. Pour butter into a liquid measuring cup. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the head of the immersion blender into the bottom of the container and turn it on. With the blender running, very slowly pour in the hot butter; it should emulsify with the other ingredients. Continue pouring until all of the butter has been added. Add half of the jalapeño (or enough to achieve your desired level of heat); reserve the remaining jalapeño to garnish burgers. Keep blending until smooth and creamy. Transfer to a small lidded pot and keep in a warm place until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Smashed Burgers and to Serve:</strong> Arrange bacon on the bottom halves of English muffins and set aside. Preheat a large sauté pan or skillet over high heat. Place 2 balls of beef in the pan at a time and smash down with two stiff metal spatulas (or any flat-bottomed, heat-safe tool, such as a small saucepan). Press firmly to flatten.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the patties generously with salt and pepper and cook until the bottoms are well browned and the tops are beginning to cook through to a pale grayish pink, about 45 seconds. Flip the patties and place a slice of cheese on top of one. Immediately stack the second one on top. Transfer the smashed-burger stack to one of the bacon-topped muffins. Repeat until all of the burgers have been cooked. Top each with sliced avocado.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large nonstick skillet over medium heat, melt 2 tablespoons butter. Crack eggs into the skillet and fry, undisturbed, until cooked to your liking, about 2 minutes for runny yolks. Place each egg on top of the sliced avocado. Spoon the Hollandaise on top of the eggs and season with black pepper and reserved chopped jalapeño. Close burgers and serve immediately.</p>"}]}