{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/03/20150331-meringue-nests-with-orange-curd-nila-jones-1-thumb.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["citrus", "custard", "dessert", "meringue", "orange"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Meringue Nests With Orange Curd Cream and Easter Eggs", "link": "https://www.seriouseats.com/recipes/2015/04/meringue-nests-orange-curd-cream-easter-eggs-recipe.html", "description": "These gorgeous individual meringue nests, filled with a swirled orange curd cream, fresh red currants, and chocolate Easter eggs are the perfect Easter dessert. The crisp, light meringue pairs beautifully with the creamy, tangy orange curd and berries.", "totalTime": "3 to 5 hours", "recipeYield": "Serves 8", "recipeCategory": ["Easter", "Fruit Desserts", "Orange"], "recipeIngredient": ["<strong>For the Meringue Nests:</strong>", "1 cup minus 1 1/2 tablespoons (about 180 grams) sugar", "3 large egg whites", "1/4teaspoon vanilla extract", "<strong>For the Orange Curd:</strong>", "6 tablespoons (about 90 grams) heavy whipping cream", "2 tablespoons grated zest and 1/2 cup juice (about 120 grams) from 2 large oranges", "1/2 cup (about 100 grams) sugar, divided", "6 large egg yolks", "6 1/2 tablespoons (about 90 grams) cold unsalted butter, cut into 1/2-inch cubes ", "<strong>To Serve:</strong>", "2 cups (about 480 grams) heavy whipping cream", "Sugar, to taste", "Fresh berries such as currants or raspberries", "Candy-covered chocolate eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Meringue Nests: </strong> adjust oven rack to center position and preheat oven to 400°F. Line a rimmed baking sheet with parchment paper. Pour the sugar onto the lined baking sheet and bake until the edges are just beginning to melt, 3 to 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While the sugar is in the oven, add the egg whites to the bowl of a stand mixer fitted with a whisk attachment. Start the mixer on low and beat until frothy, about 30 seconds. Increase speed to high and beat until soft peaks form (the peaks should slowly collapse as they sit).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer running, add the hot sugar to the egg whites one spoonful at a time. Once all the sugar has been added, continue mixing until the meringue holds stiff peaks and you no longer feel sugar crystals when you rub a bit of meringue between your fingers 5 to 8 minutes. Add the vanilla and mix to combine. Reduce oven temperature to 200°F and leave oven door ajar so it cools slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the meringue to a piping bag fitted with a star tip and line a baking sheet with baking parchment, using a dollop of meringue to stick the parchment to the sheet. Pipe 8 meringue nests. First, pipe a 3-inch round spiral base, then pipe two to three circles on top of the outer edge of the base, spiraling upwards to create an edge of meringue. Transfer the meringue nests to the oven and bake until light, crisp, and stiff. You should be able to easily remove them from the parchment when done, for 2 1/2 to 4 hours. Remove from the oven and allow to cool on a wire rack. Once completely cooled, meringues can be stored in a sealed container at room temperature for up to five days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, Make the Orange Curd:</strong> Combine the cream, zest, juice, and half the sugar in a medium-sized saucepan. In a medium-sized bowl, whisk together the remaining sugar and the yolks until foamy. Place a fine-meshed strainer over another medium-sized bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the saucepan over medium-high heat and cook, stirring frequently, until barely simmering. Whisking constantly, slow drizzle the hot cream mixture into the yolk and sugar mixture. Once incorporated, pour the mixture back into the saucepan and heat over low heat, stirring continuously with a wooden spoon until the foam dissipates and the mixture thickens enough to coat the back of the spoon, 5 to 10 minutes. (Mixture should register 165°F on a thermometer at this point.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately pour the orange curd through the strainer into the prepared bowl. Using a clean whisk, whisk in the cold butter, a few cubes at a time. Once the orange curd is smooth, press a sheet of plastic wrap directly onto its surface to prevent a skin from forming and transfer to the refrigerator. Allow to cool completely. Orange curd can be stored for up to five days in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble: </strong> In a large bowl or stand mixer fitted with a whisk attachment, whisk the cream with sugar to taste until it holds stiff peaks. Using a rubber spatula, gently fold the orange curd into the cream, creating a swirl effect. Right before serving, spoon the orange curd cream into the meringue nests, add a few chocolate eggs and some fresh fruit, such as red currants or other berries. Serve immediately. </p>"}]}