{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150424-singapore-noodles-shao-zhong-7.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "curry", "noodle", "pork", "shrimp", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.625", "ratingCount": "8"}, "name": "Singapore Noodles", "link": "https://www.seriouseats.com/recipes/2015/05/singapore-curry-noodles-stir-fry-recipe.html", "description": "It's not entirely clear where Singapore noodles&mdash;the stir-fried curried rice noodles with shrimp, pork, and vegetables&mdash;come from, though it's unlikely Singapore is the source. Regardless, they're a stir-fry classic, and are easy to make at home. Here's what you need to know, from how to choose the right rice noodles to how to make the stir-fry work on a home burner.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Dairy-Free", "Mains", "Noodles", "Pork", "Shrimp", "Stir Frying"], "recipeIngredient": ["1/4 pound shrimp, shelled, deveined, and rinsed under cold water", "2 tablespoons plus 4 teaspoons canola or vegetable oil, divided", "2 1/2 teaspoons Asian fish sauce, divided", "1 bundle (about 5 1/2 ounces) dried rice stick noodles (see note)", "2 medium cloves garlic, minced", "1 teaspoon soy sauce", "1 teaspoon Shaoxing wine", "1/4 teaspoon ground white pepper", "1/4 teaspoon sugar", "2 eggs, beaten with two pinches kosher salt", "1/4 pound Chinese roast pork (char siu) or ham, cut into thin strips", "1/4 medium onion, very thinly sliced", "1/2 medium red bell pepper, stemmed, seeded and julienned", "12 snow peas, stemmed, tough strings removed, and slice thinly on the bias", "1/2 medium carrot, julienned", "1 tablespoon curry powder, divided", "Kosher salt", "2 scallions, sliced very thinly on the bias", "2 teaspoons toasted sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat shrimp dry with paper towels and place in a small bowl. Add 1 teaspoon canola oil and 1/2 teaspoon fish sauce. Mix well and set aside in the refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place rice noodles in a large bowl and cover with boiling water. Let stand for 5 minutes. Drain noodles in a colander, rinse with cold running water, then drain until dry. Using scissors, cut the bundle of noodles in half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place garlic in a small bowl and add soy sauce, Shaoxing wine, white pepper, sugar, and remaining 2 teaspoons fish sauce. Mix well and set sauce aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 teaspoon canola oil in a wok or nonstick skillet over high heat, tilting to swirl oil, until smoking. Add eggs and let cook undisturbed for about 10 second, then gently move the eggs back and forth with a spatula until they start to firm up. Break the eggs into small pieces, then set aside in a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe wok clean. Return wok to high heat, add 2 teaspoons oil and heat until smoking. Add shrimp and stir-fry for 30 seconds. Add roast pork and onion and continue to stir-fry for another 30 seconds. Add red bell pepper and snow peas and stir for another 30 seconds, then add carrots. Add 1 teaspoon curry powder, season with salt, and cook, tossing, until curry is evenly distributed. Scrape wok contents into bowl with eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe the wok clean again. Heat remaining 2 tablespoons canola oil over high heat until smoking. Add the rice-stick noodles and stir-fry for 30 seconds. Add the sauce and remaining 2 teaspoons curry powder. Stir until the curry powder is evenly distributed. Return egg, shrimp, roast pork, and vegetables to wok and stir-fry until everything is evenly combined, about 30 seconds. Season with salt and remove from heat. Add scallions, drizzle with sesame oil, mix well, and transfer to a large serving bowl. Enjoy immediately. </p>"}]}