{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150427-cemita-finals-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Mexican", "keywords": ["cemita", "cutlet", "Mexican", "puebla", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pueblan-Style Cemita Sandwiches", "link": "https://www.seriouseats.com/recipes/2015/04/pueblan-style-cemita-sanwiches-mexican-recipe.html", "description": "Cemitas are a Mexican sandwich that originally hails from the State of Puebla and gets its name from the bun itself, also known as a cemita. This recipe shows you how to make a Pueblan-style cemita with a fried <em>milanesa</em> beef, chicken, or pork cutlet filling. Loaded with fine strands of shredded Oaxacan cheese, plenty of ripe avocado, chipotles or pickled jalapeños, and papalo, a fragrant Mexican herb with a flavor all its own, it's a masterpiece of sandwich construction.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Mexican", "Sandwiches"], "recipeIngredient": ["4 (6-ounce) pieces beef, pork, or chicken cutlets, very thinly pounded", "1 cup milk", "1 cup all-purpose flour", "1 cup bread crumbs", "Canola or vegetable oil, for frying", "Kosher salt and freshly ground black pepper", "2 ripe medium Hass avocados, halved, pitted, and sliced", "4 <a href=\"http://www.seriouseats.com/recipes/2015/05/cemitas-mexican-saseme-seed-sandwich-buns-recipe.html\">homemade</a> or store-bought cemita buns (see note), sesame-seed buns, or brioche buns, halved", "2 cups shredded Queso Oaxaca from 1 (14-ounce) ball of cheese (see note), or fresh mozzarella or string cheese, divided", "12 raw onion rings (about 1/4 inch thick)", "4 chioptle chiles from 1 (7-ounce) can whole chipotle chiles in adobo, or pickled jalapeños from 1 (12-ounce) can", "20 leaves papalo (see note), or fresh cilantro leaves", "Extra-virgin olive oil, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set wire rack on a sheet pan. Place milk in a shallow dish. Place flour in another shallow dish. Place bread crumbs in third shallow dish. Working one at a time, dip cutlets in milk, then dredge in flour, shaking off excess. Return to milk, then dredge in bread crumbs, pressing to adhere. Place breaded cutlets on a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat about 1/2 inch oil in a cast-iron skillet to 375&deg;F. Working in batches and adding oil as needed to maintain level, fry cutlets, turning once, until golden brown on both sides, about 3 minutes per side. Transfer to a clean paper-towel-lined baking sheet. Season with salt and pepper when still hot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread avocado on bottom bun halves. Top with fried cutlets. Mound half of the cheese on the cutlets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange onion rings on top of cheese. If using chipotles, tear into pieces and arrange on onion rings; alternatively, arrange pickled jalapeños on top of onion rings. Top with papalo and mound the remaining cheese on top. Drizzle with olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop some bread from each of the top buns and discard. Close sandwiches and serve right away.</p>"}]}