{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150520-corn-bacon-scallion-jalapeno-cheddar-pancake-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "cheddar", "corn", "easy", "pancake", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Savory Bacon-Cheddar Pancakes With Corn and Jalapeño", "link": "https://www.seriouseats.com/recipes/2015/05/savory-bacon-cheddar-jalapeno-corn-pancake-recipe.html", "description": "Who ever said American pancakes have to be sweet? What's stopping us from savory-ing them up? That's exactly what these pancakes are. They start with a basic American-style pancake recipe, but they come stuffed with crisp bacon, sautéed corn, jalapeño peppers, scallions, and&mdash;the kicker&mdash;pockets of gooey melted cheddar cheese.", "totalTime": "30 minutes", "recipeYield": "Seves 4 to 6", "recipeCategory": ["Bacon", "Cheese", "Corn", "Easter", "Father's Day", "Mother's Day", "Pancake"], "recipeIngredient": ["1 tablespoon unsalted butter", "4 ounces bacon, cut into fine dice", "1 1/2 cups fresh corn kernels (from about 2 ears of corn)", "1 to 2 red or green jalapeño peppers, stemmed, seeded, and minced", "8 scallions, thinly sliced (divided)", "Kosher salt and freshly ground black pepper", "1 cup (about 5 ounces) fine yellow cornmeal", "1 cup (about 5 ounces) all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon baking soda", "2 tablespoons honey, plus more for serving", "2 eggs", "10 ounces (about 1 1/4 cup) cultured buttermilk", "2 tablespoons vegetable oil, plus more for oiling pan or griddle", "4 ounces cheddar cheese, cut into 1/4-inch cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter, bacon, and 1 tablespoon water in a large skillet over medium heat. Cook, stirring, until water evaporates and bacon begins to crisp and brown, about 5 minutes. Add corn, increase heat to high, and cook, stirring, until tender and cooked through, about 2 minutes. Add jalapeño peppers and half of scallions and cook, stirring, until aromatic, about 1 minute. Season with salt and pepper. Transfer mixture to a plate to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cornmeal, flour, 1 teaspoon kosher salt, baking powder, baking soda, honey, eggs, buttermilk, 2 tablespoons oil, half of corn/bacon mixture, and half of remaining scallions in a large bowl and stir and fold until no dry streaks of flour remain but batter is still lumpy. Fold in cheese cubes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat griddle or large non-stick or cast iron skillet over medium-low heat for 5 minutes. Add a small amount of oil to the griddle and spread with a paper towel. Ladle 1/4 to 1/2 cup of batter onto the griddle, spreading it into an even circle. Repeat to fit as many pancakes as you can. Spread a 1 tablespoon-sized portion of the bacon/corn mixture on top of each pancake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook undisturbed until edges of pancakes begin to set and bubbles start to break the top surface, about 1 1/2 to 2 minutes. Carefully flip the pancakes with a thin, flexible spatula and cook on second side until golden brown and completely set, about 2 minutes longer. Transfer to a wire rack set in a rimmed baking sheet in a warm oven while you cook the remaining pancakes. Serve, garnished with remaining scallions and drizzled with honey.</p>"}]}