{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/08/BLUEBERRYCHEESECAKEPIE.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["blueberry", "cheesecake", "cream cheese", "gluten free", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Blueberry Cheesecake Pie With Lavender Streusel", "link": "https://www.seriouseats.com/recipes/2015/08/gluten-free-flour-power-blueberry-cheesecake-recipe.html", "description": "This recipe brings together cheesecake and pie, two of our favorite things. A light cheesecake topping covers a sweet and tangy blueberry filling inside a gluten-free pie crust, and a lavender-scented streusel tops it off. Once you try this pie, you'll never look at cheesecake the same way again.", "totalTime": "2 1/2 hours, plus 5 to 6 hours to chill before serving", "recipeYield": "Makes 1 pie, serving 8", "recipeCategory": ["Blueberry", "Fruit Desserts", "Gluten-Free", "Pastry", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Pie Crust:</strong>", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/11/gluten-free-pastry-crust.html\">Gluten-Free Pastry Pie Crust</a>", "<strong>For the Blueberry Layer:</strong>", "2 pints (620 grams) blueberries", "1/2 cup (100 grams) sugar", "3/8 teaspoon (2.25 grams) fine sea salt", "2 tablespoons (12 grams) tapioca starch ", "1 1/2 teaspoons (3.5 grams) cornstarch", "1 tablespoon (14 grams) water", "<strong>For the Cheesecake Layer:</strong>", "3/4 cup (180 grams) sour cream", "1/3 cup (75 grams) sugar", "1/4 teaspoon (1.5 grams) fine sea salt", "1 large egg", "1 teaspoon vanilla paste or pure vanilla extract", "1/2 pound (225 grams) cream cheese, diced, at room temperature", "1 tablespoon (1/2 ounce or 14 grams) unsalted butter, melted", "<strong>For the Streusel Layer:</strong>", "3/4 cup (150 grams) sugar", "1 cup (130 grams) <a href=\"http://www.seriouseats.com/recipes/2015/08/all-purpose-gluten-free-flour.html\">Gluten-Free Flour Blend</a>", "1/8 teaspoon (0.25 gram) dried lavender flowers (optional)", "1/8 teaspoon (0.75 gram) fine sea salt", "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350&deg;F (180&deg;C). Lightly butter a deep 9-inch pie pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pie Crust:</strong> Roll out the dough into a 12-inch circle on parchment paper or a silicone mat. Slide one hand underneath the parchment, slightly lifting the center of the dough. Pick up the pie pan in your other hand, and invert it over the dough, pressing the center of the dough into the center of the pan, then carefully flip over the pie pan and the dough. Lift off the parchment paper and discard. Gently press the dough against the bottom and sides of the pan. Trim the edges, leaving a 1-inch overhang. Tuck the overhang under the crust, forming a soft cylinder of dough all the way around the pie. Use your thumbs and forefingers to gently pinch and crimp this dough all the way around to form the border.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the crust for 30 minutes. Rotate the pan and bake for 10 more minutes, or until the crust is a deep brown. Put the pan on a wire rack and let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Blueberry Layer:</strong> Put the blueberries, sugar, and salt in a medium saucepan and bring to a simmer over medium heat. Reduce heat to low and cook for 10 minutes, until the berries begin to burst and become juicy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, put the tapioca starch, cornstarch, and water in a small bowl and stir to make a slurry. Increase the heat to medium, pour in the slurry, and cook, stirring constantly, until the mixture comes to a boil and thickens, about 5 minutes. Remove from the heat and let cool.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cheesecake Layer:</strong> Put the sour cream, sugar, and salt in a blender and blend on low until smooth. Add egg and blend just until incorporated. Add the vanilla and blend to incorporate. Add the cream cheese and blend until smooth. With the blender running, pour in the melted butter and blend until the butter has been absorbed. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Streusel Layer</strong> To make the streusel, put the sugar, flour, lavender (if using), and salt in a food processor and pulse to a fine powder, about 30 seconds. Add the butter and pulse until the mixture resembles coarse meal. Reserve in a covered container in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the blueberry layer into the baked pie crust, using a small offset spatula to spread it evenly on the bottom. Pour the cheesecake layer over the blueberry layer. Put the pie in the oven and bake for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from the oven and carefully sprinkle the streusel over the top of the pie. Return to the oven and bake for another 40 minutes, until the filling is just set but still wobbles slightly when shaken gently; the internal temperature of the cheesecake layer should be 150&deg;F (66&deg;C). Let the pie cool completely. Transfer the pie to the refrigerator and chill for at least 3 hours before serving.</p>"}]}