{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/01/20150107-italian-american-meatballs-vicky-wasik-29.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["beef", "comfort", "Italian", "italian american", "meatball", "pork", "red sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5142857142857", "ratingCount": "35"}, "name": "Juicy and Tender Italian-American Meatballs in Red Sauce", "link": "https://www.seriouseats.com/recipes/2015/01/italian-american-beef-pork-meatballs-red-tomato-sauce-recipe.html", "description": "What is the perfect meatball? For me, it's a plump, juicy ball of highly seasoned meat that's so tender a spoon can pass right through it with almost no resistance. Here's how I make that a reality.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4 to 6 (makes about 10 handball-sized meatballs)", "recipeCategory": ["Beef", "Italian", "Mains", "Pork"], "recipeIngredient": ["1 packet unflavored gelatin (optional, see note)", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium broth (optional, see note)", "4 ounces fresh white bread, crusts removed and bread cut into 1/2-inch cubes (about 2 unpacked cups)", "1/3 cup buttermilk, plus more as needed", "1 medium onion, minced", "8 cloves garlic, <a href=\"http://www.seriouseats.com/2015/01/how-to-mince-chop-garlic-microplane-vs-garlic-press.html\">finely minced</a>", "2 ounces grated Parmigiano-Reggiano, grated, plus more for serving.", "1/2 cup loosely packed fresh parsley leaves, minced", "3 teaspoons kosher salt (14 grams; see note)", "Freshly ground black pepper", "3 ounces fatty pancetta, finely minced (see note)", "4 large egg yolks", "1 teaspoon dried oregano", "1 teaspoon ground fennel seed", "1 pound ground beef (at least 25% fat)", "1 pound ground pork (at least 25% fat)", "5 cups tomato sauce, such as <a href=\"http://www.seriouseats.com/recipes/2014/09/easy-italian-amercian-red-sauce-recipe.html\">Quick and Easy Italian American Red Sauce</a>, <a href=\"http://www.seriouseats.com/recipes/2014/09/the-best-slow-cooked-italian-american-tomato-sauce-red-sauce-recipe.html\">The Best Slow Cooked Tomato Sauce</a>, or <a href=\"http://www.seriouseats.com/recipes/2014/08/the-best-fresh-tomato-sauce-for-pasta-recipe.html\">The Best Fresh Tomato Sauce</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heatproof measuring cup, sprinkle gelatin all over surface of stock and let stand for 5 minutes (if not using stock and gelatin, proceed to Step 2). Microwave stock, stirring once or twice, until gelatin completely dissolves, about 2 minutes. Pour stock into a wide heatproof bowl and refrigerate until fully set, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, combine bread with buttermilk, tossing to coat. Let stand, tossing occasionally, until bread is completely moist, about 10 minutes. Squeeze bread between your fingers or mash with a spoon to make sure there are no dry spots;  if there are dry spots that refuse to moisten, add more buttermilk 1 tablespoon at a time until bread is moist throughout.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion, garlic, Parmigiano-Reggiano, parsley, salt, pepper, pancetta, egg yolks, oregano, and fennel to bread/buttermilk mixture. Finely mince gelled stock, if using, and add.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set mixer bowl in stand mixer and attach paddle. Starting at low speed and gradually increasing to medium-high speed, beat bread mixture until thoroughly blended, stopping to scrape down sides as necessary. Add 1/3 each of the beef and pork and beat at medium-high speed until thoroughly blended with bread mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove bowl from stand mixer and add remaining beef and pork. Using a clean hand, gently mix meatball mixture, teasing apart ground meat with your fingers, just until ground beef and pork are thoroughly distributed throughout; avoid mixing any more than is necessary for even distribution.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler and set oven rack in upper position. Line a rimmed baking sheet with aluminum foil. Form meatball mixture into handball-sized balls and arrange on prepared baking sheet; you should be able to make about 10. Broil meatballs until browned on top, about 7 minutes (browning times can vary dramatically, depending on oven broiler strength).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat tomato sauce in a medium pot until simmering and add meatballs. Simmer until meatballs are just cooked through and register about 145&deg;F on an instant-read thermometer, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve meatballs, spooning sauce all over and grating more cheese on top.</p>"}]}