{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150320-cooking-olive-oil-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["beef", "cream", "easy", "mushroom", "pan sauce", "quick", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Skirt Steak With Mushroom-Cream Pan Sauce", "link": "https://www.seriouseats.com/recipes/2015/04/skirt-steak-mushroom-cream-pan-sauce-recipe.html", "description": "This easy weeknight meal features skirt steaks, seared until brown, then served with a flavorful pan sauce made from cremini mushrooms, shallots, garlic, thyme, chicken stock, white wine, and heavy cream.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Mains", "Mushrooms", "Quick Dinners"], "recipeIngredient": ["1 3/4 pounds skirt steaks, cut into 4 even portions (see note)", "Kosher salt and freshly ground black pepper", "6 tablespoons vegetable or canola oil, divided", "1 pound cremini mushrooms, washed and thinly sliced", "1 cup minced shallots (about 2 to 4 shallots)", "2 medium cloves garlic, minced", "1 1/2 teaspoons minced fresh thyme leaves", "1 cup dry white wine", "1 cup <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1/2 cup heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season steak all over with salt and pepper. In 2 large stainless steel or cast iron skillets, heat 2 tablespoons oil in each over high heat until lightly smoking. Divide steaks between skillets and sear, turning frequently, until well browned on both sides and an instant-read thermometer registers 120 to 125&deg;F for medium-rare, about 7 minutes. Transfer steaks to a plate and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide remaining 2 tablespoons oil between the skillets and heat until shimmering. Add half the mushrooms to each skillet and cook, stirring frequently and scraping up any browned bits from bottom of pan, until mushrooms have released their liquid and it has cooked off, about 6 minutes. Add half the shallots, garlic, and thyme to each skillet and continue cooking, stirring, until mushrooms are browned and shallots are softened and lightly golden, about 7 minutes longer. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half the wine to each skillet and bring to a boil, stirring and scraping up any browned bits. Scrape the contents of 1 skillet into the other and continue cooking until wine has evaporated, about 6 minutes. Add stock and reduce by half, about 4 minutes. Add cream, bring to a boil, and reduce to a simmer. Simmer until lightly reduced and the sauce has thickened slightly. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return steaks to skillet, bathe with sauce to rewarm and serve right away.</p>"}]}