{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151212-goose-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Niki Achitoff-Gray"}, "recipeCuisine": "", "keywords": ["Christmas", "comfort", "fall", "goose", "roast", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Crisp-Skinned Roast Goose and Gravy", "link": "https://www.seriouseats.com/recipes/2015/12/roast-goose-and-gravy-recipe.html", "description": "Done right, a roast goose is moist, flavorful, and supremely rich. The key is getting the bird's high volume of fat to render properly. This recipe, adapted from <em>Cook's Illustrated</em>, does that by pricking the skin and blanching the goose before roasting. Here, we also dry-brine it, to guarantee even juicier meat and crisp, flavorful skin. Serve it with gravy and our <a href=\"http://www.seriouseats.com/recipes/2015/12/prune-and-apple-stuffing-with-chestnuts-recipe.html\">prune and apple stuffing with chestnuts</a> for a totally delicious, totally old-school Christmas feast.", "totalTime": "3 hours, plus overnight", "recipeYield": "Serves 6-8", "recipeCategory": ["Chicken", "Other Meats", "Roasting"], "recipeIngredient": ["1 whole goose (10-12 pounds; 4.5-5.5kg), neck, giblets, wing tips, and wishbone removed and reserved (see note)", "1/2 cup (2.5 ounces; 70g) Diamond Crystal kosher salt or 6 tablespoons (3 ounces; 85g) Morton's kosher salt, plus more to taste ", "2 tablespoons (24g) baking powder", "1 1/2 cups (355ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium chicken broth", "1 packet (2 1/2 teaspoons; 7g) unflavored gelatin (only if using store-bought chicken broth; see note)", "1 large yellow onion, diced", "2 medium carrots, peeled and diced", "2 ribs celery, diced", "1 tablespoon (15ml) tomato paste", "2 cups (475ml) dry red wine", "8 large sprigs parsley", "3 sprigs fresh thyme", "1 bay leaf", "2 tablespoons (16g) all-purpose flour", "1/2 cup (120ml) Amontillado sherry", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using kitchen shears, trim excess skin from the goose's neck. Use shears or fingers to remove bundles of pale, lumpy fat from the cavity. Reserve 3 tablespoons solid fat, plus an additional 1/3 cup if making <a href=\"http://www.seriouseats.com/recipes/2015/12/prune-and-apple-stuffing-with-chestnuts-recipe.html\">prune and apple stuffing</a>. Pat reserved fat dry, chill, then mince.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a trussing needle or paring knife, prick goose skin at 1/2-inch intervals all over, front and back, being sure to pierce the skin but not poke holes in the meat. Pay special attention to particularly fatty areas, such as beneath wings and around thighs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large stock pot by two-thirds with water and bring to a boil over high heat. Wearing clean rubber kitchen gloves, grasp the legs of the goose and lower it into the water, neck end first, submerging it halfway. Keep submerged for 1 minute. Lift goose, allowing excess water to drain back into pot, then transfer to a work surface. Grasp wings and submerge other half of goose, tail end first, in boiling water and keep submerged 1 minute longer. Lift goose, allowing excess water to drain back into pot, then transfer goose to work surface. Pat dry with paper towels inside and out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, mix kosher salt and baking powder together. Generously and evenly sprinkle salt mixture all over goose skin; use just enough of the salt mixture to coat thoroughly. (You will most likely not need all of the salt, and in some cases, less than half will be sufficient, depending on the size of your bird and your salt preference.) Transfer goose to a rack set in roasting pan and refrigerate uncovered for 12-24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using store-bought chicken broth, pour into a microwave-safe medium bowl and sprinkle gelatin in an even layer on surface. Let stand 5 minutes; microwave in 1 minute intervals, whisking each time, until gelatin is dissolved. Meanwhile, in a medium saucepan, heat the 3 tablespoons reserved minced fat over medium heat until the fat renders and forms small browned bits, about 3 minutes. Increase heat to medium-high and add goose neck, wing tips, wishbone, and all giblets (except liver) and sauté until dark brown, 8-10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions, carrots, and celery to saucepan, and cook, stirring, until vegetables begin to brown, about 10 minutes. Stir in tomato paste and cook for 1 minute. Add red wine, scraping up any brown bits on bottom of saucepan. Add chicken broth, parsley, thyme, and bay leaf. Bring to a boil, reduce heat to low, partially cover, and cook at a bare simmer for 2 hours. If necessary, add additional stock or water to keep ingredients covered. Set a fine mesh strainer over a 4-cup measuring cup and strain stock, pressing down on solids with a ladle or spoon to extract all liquid. Reserve and finely chop heart and gizzard; dispose of all other solids. Skim fat off top of stock and, if necessary, add additional chicken stock or water to make 2 full cups. Stock can be refrigerated in an airtight container for up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to lowest position and preheat to 325&deg;F. Remove goose from refrigerator and place breast side down in a V-rack set in a roasting pan (we often recommend roasting on a wire rack set in a rimmed baking sheet, but the goose renders too much fat for this to be a safe option). Transfer goose to oven and roast for 1 1/2 hours. Remove from oven and carefully transfer V-rack with goose to a work surface. Carefully spoon or pour off all but a few tablespoons of the rendered fat in the roasting pan into a heat-safe bowl or container, being careful to leave behind any browned bits. Reserve rendered fat. Return V-rack with goose to the roasting pan and, using two wooden spoons inserted into neck and body cavities, to carefully rotate goose breast side up. Return goose to the oven and roast until skin is puffed up around breast bone and tops of thighs, and skin is browned, 1 to 1 1/2 hours longer. Remove from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Raise oven temperature to 400&deg;F and transfer V-rack with goose to a rimmed baking sheet. Return to goose to oven until skin is fully browned and crisp, about 15 minutes longer. Remove from oven and let stand, uncovered, for 30 minutes. Meanwhile, transfer newly accumulated rendered fat from roasting pan to reserved fat. Do not wash roasting pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, bring reserved goose stock to a simmer. Heat roasting pan on 2 burners over low heat. Add sherry and, using a wooden spoon, scrape up any brown bits on the bottom. Bring sherry to a boil and let boil for 30 seconds. Scrape contents of roasting pan into saucepan with goose stock. Add reserved chopped gizzard and heart to saucepan. Continue simmering for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop reserved goose liver. In a clean medium saucepan, stir together 2 tablespoons of reserved rendered goose fat with flour over medium-low heat, stirring constantly, until aromatic and light brown, about 5 minutes. Remove from heat. (Remaining goose fat can be refrigerated or frozen and used for cooking and frying.) Pour hot goose stock into flour mixture and whisk to combine. Simmer on low heat until gravy is slightly thickened, about 3 minutes. Add goose liver and simmer for 1 minute longer. Season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve goose and serve with gravy.</p>"}]}