{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150813-raw-tomato-coulis-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["easy", "puree", "sauce", "summer", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1", "ratingCount": "1"}, "name": "Raw Tomato Coulis", "link": "https://www.seriouseats.com/recipes/2015/08/raw-tomato-sauce-puree-coulis-recipe.html", "description": "A quick and easy puree made from fresh raw tomatoes, which can then be tossed with pasta along with olive oil and basil, or spread on crusty bread and drizzled with olive oil, among other applications.", "totalTime": "1 hour", "recipeYield": "Makes about 1 quart", "recipeCategory": ["Condiments and Sauces", "Dairy-Free", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1 1/2 pounds ripe plum tomatoes (about 8 large tomatoes)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil and fill a large bowl with ice water. Meanwhile, cut out the stem end of each tomato, then score the skin of each tomato, making an X at the top of each one. Carefully lower tomatoes into boiling water and let stand until skins show the first signs of loosening around the edges of the score marks. Using a slotted spoon, transfer tomatoes to ice water and let cool; their skins should loosen even more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull off tomato skins and discard. Cut tomatoes into quarters lengthwise, then scoop out seeds and discard. Dice tomato flesh.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer diced tomatoes to a mesh strainer set over a mixing bowl and sprinkle liberally all over with salt. Let stand to drain at least 30 minutes and up to 1 hour. Discard collected liquids.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer salted tomatoes to a tall container and blend with an immersion blender until a smooth puree forms. Alternatively, blend them to a smooth puree in a standing blender. If you want an even smoother puree, pass the blended tomato puree through a fine-mesh strainer. Adjust seasoning with more salt if required (you probably will not need to add more salt). Use as desired, or freeze for up to 6 months.</p>"}]}