{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150519-halloumi-chorizo-pancake-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "chorizo", "egg", "pancake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chorizo and Halloumi Pancakes With Fried Eggs", "link": "https://www.seriouseats.com/recipes/2015/05/chorizo-halloumi-pancakes-fried-eggs-recipe.html", "description": "I have a good friend who often has the kind of ideas that only the intentional chemical expansion of the mind can bring about. That's where the idea of putting halloumi&mdash;the squeaky, salty, fry-able cheese from Cyprus&mdash;into American-style pancakes came about, and it was such a genius idea that I decided to run with it and make it my own. Adding some crisp chorizo and a fried egg makes these into pancakes that are worthy of a 2 a.m. binge <em>or</em> an elegant Sunday morning cocktail brunch.", "totalTime": "30 minutes", "recipeYield": "Makes 4 large pancakes, serving 4", "recipeCategory": ["Easter", "Father's Day", "Fried Eggs", "Mother's Day", "Pancake"], "recipeIngredient": ["8 ounces Spanish chorizo, finely diced", "2 tablespoons extra virgin olive oil", "2 tablespoons roughly chopped fresh oregano leaves", "7 1/2 ounces (about 1 1/2 cups) all-purpose flour", "3/4 teaspoon baking powder", "1/4 teaspoon baking soda", "1 teaspoon kosher salt", "2 teaspoons sugar", "5 large eggs, divided", "2 tablespoons vegetable or canola oil (plus more for cooking)", "12 ounces (about 1 1/2 cups) buttermilk", "4 (1- to 2-ounce each) slices halloumi cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chorizo and olive oil in a large non-stick or cast iron skillet over medium heat and cook, stirring constantly, until chorizo is crisp. Transfer to a bowl, making sure to get all of the excess oil. Add oregano to chorizo and toss to combine. Wipe out skillet and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, baking powder, baking soda, salt, sugar, 1 egg, vegetable oil, buttermilk, and half of chorizo mixture in a large bowl and whisk together until it forms a batter. There should be no streaks of dry flour, but plenty of lumps are okay.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to medium-low heat, add 1 tablespoon vegetable oil, and heat until shimmering, about 1 minute. Add 2 halloumi slices (these will become the center of two pancakes). Cook until lightly browned on first side, about 1 minute. Flip halloumi and scatter a teaspoon of crisp chorizo on either side of each piece of halloumi.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle a few ounces of batter on top of halloumi and chorizo, completely covering it. Cook pancake without moving until well-browned and crisp on first side, 2 to 3 minutes. Carefully flip and cook until browned on second side, about 2 minutes longer. Transfer to a rack and set in a warm oven while you cook the remaining pancakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat Steps 3 and 4 to cook remaining pancakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat another tablespoon of oil in the skillet and place over medium-high heat. Break remaining 4 eggs into the skillet and cook until crisp on the bottom but yolks are still runny, about 1 1/2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve pancakes immediately, topped with a fried egg and drizzled with remaining chorizo and chorizo oil.</p>"}]}