{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/09/20150919-midautumnfeast-fiona-reilly-20150919-midautumnfeast-suzhoumooncakes-fiona-reilly.jpg", "author": {"@type": "Person", "name": "Fiona Reilly"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "mooncake", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Suzhou Savory Pork Mooncakes", "link": "https://www.seriouseats.com/recipes/2015/09/suzhou-savory-pork-mooncakes.html", "description": "These mooncakes, with their richly savory pork filling and crisp, flaky pastry, are easy to make. This style of mooncake originates from Suzhou, near Shanghai, and are typically found in both savory and sweet (black or white sesame) varieties. In this recipe, butter has been substituted for the more traditional lard.", "totalTime": "3 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Pork", "Sides", "Snacks"], "recipeIngredient": ["<strong>For the Dough</strong>", "8 ounces (about 1 1/2 cups) all-purpose flour", "1 whole stick plus 2 tablespoons unsalted butter, divided", "1/2 cup ice cold water", "<strong>For the Filling</strong>", "14 ounces minced pork", "1/2-inch knob ginger, finely chopped (about 2 teaspoons)", "6 scallions, white parts only, finely chopped (about 1/4 cup)", "4 teaspoons Shaoxing wine", "Kosher salt", "1 tablespoon cornstarch", "1 teaspoon white pepper", "1 teaspoon sugar", "1 tablespoon sesame oil", "<strong>For the Egg Glaze</strong>", "1 egg beaten with 2 teaspoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Rub 2 tablespoons butter into flour with fingertips until mixture resembles breadcrumbs. Add ice water in small increments until dough just comes together and knead gently until smooth. Form dough into a disk, cover with plastic wrap, and chill in fridge for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove dough from fridge and roll into a rectangle approximately 12- by 4-inches. Place remaining stick of butter between 2 sheets of parchment paper and roll into an approximate 3- by 3-inch square.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place butter in center of dough. Fold top edge of the dough over butter. Fold bottom edge over, so that the dough is folded in thirds like a letter. Roll dough out into a 12- by 4-inch rectanble and fold in thirds again. Refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from refrigerator and place on a slightly floured surface. Roll dough out into a 12- by 4-inch rectanble and fold in thirds again. Refrigerate for 30 minutes. Meanwhile, make the filling</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the filling:</strong> In a large bowl, combine pork, ginger, scallions, Shaoxing wine, 1 teaspoon salt, cornstarch, white pepper, sugar, and sesame oil. Place a dime-sized amount of filling on a microwave-safe plate and microwave until cooked through, about 10 seconds. Taste and add more salt to pork filling mixture as necessary. Refrigerate until ready to assemble.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble</strong>: Remove doug from refrigerator and roll out to 1/4-inch thickness. Using a 3 1/2-inch cookie cutter, cut as many circles as possible from dough. Roll each circle out to a 4-inch diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower and upper middle positions and preheat oven to 400&deg;F. Place approximately one tablespoon of pork mixture in center of dough circle. Draw dough edges around filling and pleat edges to form a sealed topknot.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place mooncake topknot-side-down on a parchment-lined baking tray. Repeat with remaining dough circles. Brush the top of each mooncake with egg glaze and bake until golden and crisp, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, or bake up to three days ahead and refrigerate, covered, until needed. They can be reheated for five minutes in a 350&deg;F.</p>"}]}