{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150102-lechon-kawali-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Filipino", "keywords": ["Asian", "deep fry", "Filipino", "low carb", "pork belly"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Lechon Kawali (Filipino Crispy Fried Pork Belly)", "link": "https://www.seriouseats.com/recipes/2015/02/lechon-kawali-filipino-crispy-fried-pork-belly-recipe.html", "description": "Filipino <em>lechon kawali</em> is one of the great pork dishes of the world, and the only hard thing about making it is waiting for the boiled pork belly to air-dry in the fridge overnight before being fried until intensely crisp and crunchy on the outside and meltingly tender within.", "totalTime": "10 hours", "recipeYield": "Serves 6-8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Filipino", "Mains", "Pork"], "recipeIngredient": ["2 pounds boneless skin-on pork belly, cut in half", "8 medium cloves garlic, smashed", "2 bay leaves", "1 tablespoon black peppercorns", "1/2 cup soy sauce", "Kosher salt", "Canola or peanut oil, for frying", "Rice or cane vinegar, preferably spicy, for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork belly, skin side down, in a large pot and add enough water to completely submerge meat. Add garlic, bay leaves, peppercorns, and soy sauce. Bring to a boil over medium-high heat, then lower heat and reduce to a simmer. Cover and cook until pork skin can be pierced with a knife with no resistance, about 1 hour. Transfer pork to a wire rack set in a rimmed baking sheet and season liberally with salt all over. Refrigerate pork until skin has completely dried, 6 hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork from refrigerator and cut into 3/4-inch slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a wok or Dutch oven at least 4 inches oil and heat to 375&deg;F over high heat. Working in batches, fry pork until deeply browned and skin has bubbled and crisped, 7 to 10 minutes. Transfer pork to a paper towel-lined plate and season with salt to taste. Cut pork slices into 1/2-inch pieces. Serve immediately with vinegar for dipping.</p>"}]}