{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/11/20151102-oyster-cornbread-stuffing-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["cornbread", "dressing", "oyster", "seafood", "shellfish", "stuffing", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Southern Cornbread Dressing With Oysters and Sausage", "link": "https://www.seriouseats.com/recipes/2015/11/cornbread-oyster-stuffing-recipe.html", "description": "Adding oysters to Thanksgiving stuffing may sound like an odd choice, but it's a practice with a long history and delicious results. Here, raw chopped oysters are mixed with toasted unsweetened cornbread, sausage, and aromatic vegetables and herbs. The oysters add a wonderful savory flavor and subtle brininess.", "totalTime": "2 hours", "recipeYield": "Serves 8 as a side", "recipeCategory": ["Baking", "Christmas", "Clams, Mussels, and Oysters", "Cornbread", "Fall", "Pork", "Sides", "Thanksgiving", "Winter"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2015/11/southern-unsweetened-cornbread-recipe.html\">Southern-Style Unsweetened Cornbread</a> (about 2 1/2 pounds; 1 1/4 kilograms), cut into 3/4-inch dice", "1 stick unsalted butter (113 grams), plus more for greasing dish", "1 pound (500 grams) sweet Italian sausage, removed from casing", "1 large onion, finely chopped (about 2 cups; 300 grams)", "2 large stalks celery, finely chopped (about 1 cup; 200 grams)", "1/2 medium fennel bulb, finely chopped (about 1 cup; 200 grams)", "2 medium cloves garlic, minced (about 2 teaspoons; 10 grams)", "1 teaspoon minced fresh thyme leaves", "3 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium broth (700 milliliters), divided", "4 large eggs", "2 tablespoons minced fresh tarragon leaves", "1/4 cup minced flat-leaf parsley leaves (about 1/4 ounce; 8 grams), divided", "2 cups raw oysters and their liquor (470 milliliters; about 32 medium oysters), oysters chopped (see note)", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower-middle and upper-middle positions. Preheat oven to 425&deg;F. Spread cornbread evenly over 2 rimmed baking sheets. Stagger sheets on oven racks and bake until lightly toasted, about 10 minutes. Remove from oven and allow to cool.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven, melt butter over medium-high heat until foaming subsides, about 2 minutes, without allowing butter to brown. Add sausage and mash with stiff whisk or potato masher to break up into fine pieces (largest pieces should be no bigger than 1/4 inch). Cook, stirring frequently, until only a few bits of pink remain, about 8 minutes. Add onion, celery, fennel, garlic, and thyme and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk remaining chicken stock, eggs, tarragon, and 3 tablespoons parsley in a medium bowl until homogeneous. Stirring constantly with a wooden spoon, slowly pour egg mixture into sausage mixture. Add cornbread cubes, oysters, and oyster liquor and fold gently until evenly mixed. Season lightly with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dressing to a buttered 9- by 13-inch rectangular baking dish or 10- by 14-inch oval dish. The dressing can be covered with aluminum foil and refrigerated for up to 2 days at this point (the flavor will improve as it sits). When ready to bake, preheat oven to 375&deg;F. Uncover dressing and bake until an instant-read thermometer reads 150&deg;F when inserted into center of dish and dressing is crisped on top, about 45 minutes. Remove from oven, let cool for 5 minutes, sprinkle with remaining parsley, and serve.</p>"}]}