{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150113-brown-butter-cake-nila-jones-2-thumb.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["brown butter", "cake", "dessert", "frosting", "loaf", "quick bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2", "ratingCount": "5"}, "name": "Brown Butter Cake With Brown Butter Frosting", "link": "https://www.seriouseats.com/recipes/2015/01/brown-butter-cake-insane-brown-butter-frosting-recipe.html", "description": "This brown butter cake is dense and moist with a sturdy crumb and an intense brown butter flavor. The decadent brown butter glaze on top knocks the cake out of the park.", "totalTime": "4 1/2 hours (waiting time included)", "recipeYield": "serves 10 to 12", "recipeCategory": ["Cakes", "Desserts"], "recipeIngredient": ["<strong>For the Cake:</strong>", "1 1/4 cups (3 sticks) unsalted butter", "1 1/3 cups plus 2 tablespoons granulated sugar ", "5 large eggs, at room temperature", "2 cups plus 2 1/2 teaspoons (about 10 1/4 ounces) all-purpose flour", "1/2 teaspoon table salt ", "2 1/2 teaspoons baking powder", "1/2 cup minus 2 teaspoons whole milk", "1 teaspoon vanilla extract ", "<strong>For the Frosting:</strong>", "1/4 cup (1/2 stick) unsalted butter", "1 cup powdered sugar", "5 teaspoons hot water", "2 drops of vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First make the cake:</strong> Heat the butter in a heavy-bottomed and preferably light-colored saucepan over low heat, stirring occasionally, until melted. Continue cooking, stirring frequently, until foaming subsides and butter starts to smell nutty and milk solids are a deep golden brown, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To check the color of the butter, use a ladle or spoon to transfer some butter to a heatproof white bowl or plate. When ready, pour the butter into a heatproof bowl, scraping the milk solids off the bottom of the pan.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the butter to cool to room temperature, stirring it every now and then with a rubber spatula, then place it in the refrigerator until cold about 30 minutes. It is crucial that the butter is chilled until solid. Once cold, re-soften the butter at room temperature for 30 to 45 minutes. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to make the cake, adjust oven rack to lower middle position and preheat the oven to 350°F. Lightly butter an 8- by 4 1/2-inch (2-quart) loaf pan and dust is with a tablespoon of flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the brown butter in the bowl of a stand mixer fitted with a paddle attachment at medium speed until creamy and lightened in color, about 2 minutes. Add sugar and continue to beat until the mixture looks fluffy, 2 to 3 minutes, scraping down the bowl with a rubber spatula every now and then. Once the mixture is fluffy, add eggs one at a time, mixing well (about 2 minutes) after each addition. Again, scrape the sides and bottom of the bowl every now and then.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all the eggs have been added to the stand mixer, combine flour, salt and baking powder in a bowl and stir to combine. Combine the milk and vanilla in a separate bowl. Add half the flour mixture to the mixer and fold with a rubber spatula until somewhat incorporated. Mix on medium speed until the batter looks smooth. Add the milk mixture and beat on medium speed until smooth. Add the remaining flour mixture and mix well, 1 to 2 minutes, until the mixture looks smooth. Make sure to scrape the sides and bottom of the bowl with a rubber spatula every now and then as you mix. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared cake pan. Rap the pan sharply on the counter to remove any air bubbles. Bake the cake for 30 minutes. After 30 minutes of baking, cover the top of the cake loosely with aluminum foil to prevent the cake from browning too much. Continue baking until a tester inserted into the center of the cake comes out clean, about 20 minutes longer. Remove from the oven and allow the cake to cool for 15 minutes in the pan before turning cake out on a wire rack. Allow cake to cool to room temperature before frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting:</strong> brown the butter, following the process explained in steps 1 and 2. Add the powdered sugar and whisk until incorporated. Add the water one teaspoon at a time (mixing well after each addition). Add vanilla and whisk until the mixture looks smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the back of a spoon, slather the frosting on top of the cake. Place the cake in the refrigerator until the frosting has firmed up, about 20 minutes. Cut into slices and serve. Store the cake in an airtight container in the refrigerator for up to 3 days. </p>"}]}