{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150202-potato-bacon-cheese-broccoli-cauliflower-soup-vegan-8.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["potato", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Fully Loaded Vegan Baked Potato Soup", "link": "https://www.seriouseats.com/recipes/2015/02/fully-loaded-baked-potato-soup-vegan-recipe.html", "description": "Creamy, rich, and packed with nutty, sharp, tangy, cheesy flavor, this 100% vegan loaded potato soup relies on a few secret ingredients and techniques to satisfy even the hungriest eater. Vegan mushroom bacon bits, broccoli, and scallions load it up.", "totalTime": "1 1/2 hours", "recipeYield": "Makes about 2 1/2 quarts, serving 8", "recipeCategory": ["Dairy-Free", "Potato", "Soups and Stews", "Vegan", "Vegetarian"], "recipeIngredient": ["1 head cauliflower, split in half", "2 large (or 3 medium) russet potatoes, about 1 1/4 pounds total", "3 tablespoons vegetable or canola oil", "3 tablespoons coconut or palm oil or vegetable shortening", "1 large leek, chopped", "2 stalks celery, finely chopped", "6 scallions, thinly sliced, white and green parts reserved separately", "4 medium cloves garlic, thinly sliced", "Kosher salt and freshly ground black pepper", "1 teaspoon paprika", "1 chipotle pepper packed in adobo sauce, finely chopped, plus 1 teaspoon adobo sauce", "1 cup roasted cashews", "1 quart almond or cashew milk", "1/2 teaspoon liquid smoke (optional)", "Up to 2 cups <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">Hearty Vegetable Stock</a> or water", "1 bunch minced fresh chives", "1 recipe chopped <a href=\"http://www.seriouseats.com/recipes/2014/02/crispy-smoked-mushroom-bacon-bits-vegan-recipe.html\">Crispy Vegan Mushroom \"Bacon\"</a>, for serving", "1 cup steamed broccoli florets, for serving", "Vegan sour cream, for serving (if desired)", "Extra-virgin olive oil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 400&deg;F. Toss cauliflower and potatoes in vegetable or canola oil and transfer to a parchment or foil-lined rimmed baking sheet. Use a wooden skewer to poke 6 holes in each potato. Roast cauliflower and potatoes until potatoes show no resistance when a wooden skewer is pressed through them, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat shortening, coconut, or palm oil in a large saucepan over medium-low heat until melted. Add leek, celery, scallion whites, and garlic, season with salt and pepper, and cook, stirring frequently, until very soft but not browned, about 10 minutes, lowering heat as necessary to prevent browning. Add paprika and chipotle pepper along with adobo sauce and stir to combine. Stir in cashews and transfer to a large bowl. Set aside until cauliflower and potatoes are cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When potatoes and cauliflower are cooked, transfer cashew mixture to the jar of a blender. Add cauliflower, discarding any green leaves and the central fibrous stem. Add almond milk and liquid smoke (if using). Peel half of one potato and add to blender. Blend, starting at lowest speed and increasing to high until completely smooth, about 2 minutes. Transfer to a large pot through a fine mesh strainer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split remaining potatoes in half and press through a ricer or food mill directly into the pot of soup. Whisk by hand or with a hand mixer until potato is thoroughly incorporated and soup is smooth. Thin to desired consistency with <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">Hearty Vegetable Stock</a> or water, then season to taste with salt and pepper. For smoother soup, blend with a hand blender, but do not over-blend or it will become gluey. Soup can also be made smoother by pressing through a fine mesh strainer with the bottom of a ladle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in chives and half of mushroom bacon, reheat until simmering, and serve immediately, topping with vegan bacon, broccoli florets, scallion greens, vegan sour cream, and drizzling with olive oil.</p>"}]}