{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151119-smoked-turkey-food-lab-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barbecue", "grill", "low carb", "smoker", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "5"}, "name": "Spice-Rubbed Butterflied Smoked Turkey", "link": "https://www.seriouseats.com/recipes/2015/11/spice-rubbed-butterflied-smoked-turkey-food-lab-recipe.html", "description": "Turkey and smoke are a natural pairing, as anyone who's looked at a deli case can tell you, but there's a difference between cold-cut smoked turkey, with its ham-like cured texture and questionable smoke flavor, and real <em>barbecued</em> turkey. I'm talking the kind of smoked turkey you want served in thick, glistening slabs that are shiny with juice and fork-tender, with deep smoke flavor.", "totalTime": "4 hours, plus up to 3 days for dry-brining", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Christmas", "Grilling", "Mains", "Thanksgiving", "The Food Lab", "Turkey"], "recipeIngredient": ["1 (10- to 12-pound; 4.5- to 6-kilogram) turkey", "2 tablespoons (35 grams) kosher salt", "1 tablespoon vegetable oil", "1 tablespoon paprika", "1 teaspoon smoked paprika", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon ground yellow mustard seed", "1/2 teaspoon ground coriander seed", "1/2 teaspoon ground cumin seed", "1/4 teaspoon ground cayenne pepper", "1 teaspoon granulated garlic powder", "1 teaspoon granulated onion powder", "1 teaspoon ground sage", "2 tablespoons (40 grams) light brown sugar", "1 tablespoon baking powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 1 day and up to 3 days before cooking, remove the backbone from the turkey by cutting down either side of the spine with a pair of heavy-duty poultry shears. If necessary, use a cleaver or a heavy chef's knife to cut through the joints where the thigh meets the backbone. Alternatively, ask your butcher to butterfly your bird for you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the wishbone by lifting the skin above the breast near the neck opening and locating the Y-shaped bone with your fingertip. Using a sharp paring knife, cut along the top and bottom of both halves of the bone. Slip your finger behind the bone, pull it out, and discard or save for gravy or stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay the bird flat on a cutting board with its legs splayed out. Press down firmly on the breast to crack the bone so the turkey lies flat. Rub the skin all over with oil. Combine salt, paprika, smoked paprika, black pepper, mustard seed, coriander, cumin, cayenne, garlic powder, onion powder, sage, brown sugar, and baking powder in a small bowl and mix until homogeneous. Rub mixture over entire surface of turkey, coating it thoroughly. Transfer turkey to a wire rack set in a rimmed baking sheet, cover loosely with plastic wrap, and refrigerate at least overnight and up to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">light one half chimney of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Place the turkey on the cooler side of the grill with the legs facing toward the coals. Add 4 wood chunks. Cover grill with lid vents directly over the turkey. Close bottom and top vents halfway.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook turkey, adjusting vents to maintain a temperature between 225 and 275&deg;F, adding fresh wood chunks every half hour and fresh coals a dozen at a time as necessary to maintain temperature. Cook until a probe thermometer inserted into the coolest part of the breast registers 150&deg;F and the legs register at least 165&deg;F, 2 1/2 to 3 1/2 hours. Remove turkey from grill, let rest 15 minutes, carve, and serve.</p>"}]}