{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150128-tamale-pie-american-food-lab-recipe-11.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bread", "corn", "cornbread", "easy", "quick", "quick bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "12"}, "name": "Moist and Tender Brown Butter Cornbread", "link": "https://www.seriouseats.com/recipes/2015/01/moist-and-tender-brown-butter-cornbread-recipe.html", "description": "Whether you're serving it with chili or simply with a smear of butter and a drizzle of honey, good cornbread with a moist, tender crumb and intense corn flavor is one of life's greatest pleasures. So how do you take one of life's greatest pleasures and make it even more, well, pleasurable? Simple: Add some browned butter to it.", "totalTime": "45 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Christmas", "Corn", "Cornbread", "Thanksgiving"], "recipeIngredient": ["7 tablespoons unsalted butter, plus more for serving", "1 cup (about 5 ounces) fine yellow cornmeal", "1 cup (about 5 ounces) all-purpose flour", "4 tablespoons sugar", "1 teaspoon kosher salt", "2 teaspoons baking powder", "1/4 teaspoon baking soda", "2 eggs", "6 ounces (about 3/4 cup) sour cream", "4 ounces (about 1/2 cup) cultured buttermilk", "Honey, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 425&deg;F. Place butter in a 10-inch cast iron skillet. Transfer skillet to oven and heat until the butter is melted and well browned, 10 to 20 minutes (you can measure your wet and dry ingredients while waiting). Pour browned butter into a heatproof cup or bowl, leaving about 1 tablespoon remaining in skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cornmeal, flour, sugar, salt, baking powder, and baking soda in a large bowl. Combine eggs, sour cream, and buttermilk in a second bowl and whisk until homogenous. Whisking constantly, slowly drizzle in reserved browned butter. Whisk wet ingredients into dry ingredients until homogenous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove skillet from the oven and swirl to coat all surfaces with melted butter. Spoon batter into skillet, smooth top lightly, then transfer to oven. Bake until light golden brown on top and a wooden skewer inserted into cornbread comes out with no crumbs, 20 to 25 minutes. Let cool 10 minutes, then serve with extra butter and honey at the table. Leftover cornbread can be stored in a sealed container in the refrigerator for up to 3 days.</p>"}]}