{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/12/20151110-snowball-cookies-vicky-wasik-018.jpg", "author": {"@type": "Person", "name": "Grace Parisi"}, "recipeCuisine": "", "keywords": ["cookie", "dessert", "holiday", "snowball"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Snowball Cookies", "link": "https://www.seriouseats.com/recipes/2015/12/snowball-cookies-recipe.html", "description": "My mother, the queen of Christmas cookies (even years after her death), made dozens and dozens of varieties every year. Some of my earliest cookie memories were of her Christmas snowballs&mdash;buttery and nutty and melt-in-your-mouth tender. It seemed inexplicable how each cookie was neatly and evenly glazed&mdash;that is, until my mom shared the secret. Now I'm sharing it with you.", "totalTime": "2 hours", "recipeYield": "Makes about 24 cookies", "recipeCategory": ["Christmas", "Cookies", "Desserts"], "recipeIngredient": ["1 cup slivered almonds (4 1/2 ounces; 130g) (see note)", "1 scant cup all-purpose flour (4 1/2 ounces; 130g) ", "1/2 teaspoon (3g) baking soda", "1/4 teaspoon (1g) salt ", "4 ounces unsalted butter, softened (1 stick; 115g)", "3 tablespoons (35g) granulated sugar ", "1 teaspoon (5mL) pure vanilla extract", "1 1/2 cups (about 200g) confectioner's sugar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat the oven to 325&deg;F. Spread the almonds out on a pie plate and toast until golden, about 8 minutes. Let cool, then transfer the nuts to a mini food processor and pulse until finely chopped. Transfer to a small bowl and whisk in the flour, baking soda, and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a standing electric mixer fitted with the paddle attachment, beat the butter with the granulated sugar and vanilla until creamy, about 4 minutes. On low speed, add the nut mixture and beat until evenly combined, scraping up the bottom and sides of the bowl once or twice, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large sturdy baking sheet with parchment paper. Scoop level tablespoons of the dough into balls and gently roll. Arrange the balls 1 inch apart and freeze until just firm, about 10 minutes. Bake until lightly golden on top and deep golden on the bottom, about 22 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the cookie sheet on a rack to cool for 10 minutes. Put the confectioner's sugar into a shallow bowl. Working with no more than 2 cookies at a time, roll them in the confectioner's sugar. Return them to the baking sheet and let them cool completely, undisturbed, until the glaze is set, about 1 hour. Sift the confectioner's sugar to remove any crumbs and re-roll the cooled cookies. Store cookies in an airtight container between sheets of waxed paper for up to 2 weeks. </p>"}]}