{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150415-huevos-rancheros-easy-recipe-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "easy", "enchilada", "Mexican"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "18"}, "name": "Easy Pressure Cooker Chicken Enchiladas", "link": "https://www.seriouseats.com/recipes/2015/04/pressure-cooker-fast-and-easy-chicken-enchiladas-food-lab-recipe.html", "description": "The pressure cooker makes short work of making tender chicken and an intensely flavored sauce&mdash;just add the ingredients, and turn it on, no searing or pre-cooking of any kind required. After that, assembling and baking these delicious red chile chicken enchiladas is a snap.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "Mexican", "Pressure Cooker", "The Food Lab"], "recipeIngredient": ["<strong>For the Chicken and Sauce:</strong>", "2 whole dried ancho chilies", "2 pounds bone-in, skin-on chicken thighs", "1 Serrano or jalapeño pepper, roughly sliced", "1 pound roma tomatoes, roughly chopped (about 4)", "1 medium onion, sliced", "4 medium cloves garlic, smashed", "2 whole canned chipotle chilies packed in adobo, plus 2 tablepoons sauce from the can", "1 bay leaf", "2 teaspoons dried oregano, preferably Mexican", "1 teaspoon ground cumin seed", "1/2 teaspoon ground coriander seed", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "Kosher salt and freshly ground black pepper", "1 tablespoon juice from 1 lime", "1 tablespoon soy sauce", "1/4 cup chopped fresh cilantro leaves and fine stems", "<strong>To Assemble:</strong>", "1/4 cup canola oil", "12 fresh corn tortillas", "3 ounces grated Jack or cheddar cheese", "1 ounce crumbled cotija cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chicken and Sauce:</strong> Trim tops of chilies and discard seeds (see <a href=\"http://www.seriouseats.com/2015/01/how-to-clean-and-prepare-dried-chilies-chili-powder-substitute.html\">here for more detailed instructions</a>). Place on a microwave-safe plate and microwave on high power until pliable and fragrant, about 15 seconds. Cut chilies into thin strips using kitchen shears or a sharp knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chilies, chicken, Serrano or jalapeño, tomatoes, onion, garlic, chipotle peppers and adobo sauce, bay leaf, oregano, cumin, coriander, and chicken stock in a pressure cooker, season with salt and pepper, and stir roughly until ingredients are evenly distributed. Seal pressure cooker and cook on high pressure for 15 minutes. Release pressure using quick-release method. Using tongs, transfer chicken to a bowl and set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard bay leaf. Transfer remaining ingredients from pressure cooker to the jar of a blender. Add soy sauce and lime juice. Blend, starting at low speed and slowly increasing to high until sauce is smooth. Season to taste with salt and stir in 3 tablespoons of cilantro. Transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cool enough to handle, discard skin and bones. Shred chicken meat roughly with your fingers or two forks. Fold in 1/4 cup of sauce and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Adjust oven rack to middle position and preheat oven to 400&deg;F. Heat canola oil in a medium cast iron or non-stick skillet over medium heat until shimmering. Working one at a time, place a tortilla in the oil, fry for 5 seconds, turn, and fry second side for 5 seconds. Transfer to a paper towel-lined plate to drain, then to a second clean plate. Stack tortillas as you work and cover with a clean kitchen towel or paper towel when finished to keep tortillas warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip tortillas in sauce one at a time, letting excess drip off and stacking them as you go. Ladle one cup of sauce over the base of a 9- by 13-inch baking dish. Place 2 to 3 tablespoons of chicken filling in a line along the center of one tortilla. Roll tortilla up like a cigar and transfer to the baking dish, seam side-down. Repeat with remaining tortillas and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon more sauce over the top of the tortillas, then spread cheddar or Jack cheese in two even rows across the center of the tortillas. Spoon a few more tablespoons of sauce on top of the cheese. Cover baking dish with aluminum foil, transfer to the oven, and bake for 10 minutes. Remove foil, sprinkle with half of cotija cheese, and continue baking until heated through, 5 to 10 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove baking dish from oven, sprinkle with remaining cotija cheese and chopped cilantro, and serve immediately, passing any additional salsa at the table.</p>"}]}