{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/03/20150311-chocolate-cinnamon-meringues-nila-jones-1-thumb.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["baking", "chocolate", "dessert", "egg", "meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Chocolate-Cinnamon Swirl Meringues", "link": "https://www.seriouseats.com/recipes/2015/03/chocolate-cinnamon-swirl-meringues-recipe-egg-whites.html", "description": "These rustic-looking chocolate swirl meringues are flavored with cocoa powder, a touch of molasses, and a pinch of cinnamon, then baked until crisp. They bring together a light and crumbly texture with intense chocolatey flavor. The cinnamon provides just a hint of warmth, while the molasses gives the meringues a subtle caramel flavor.", "totalTime": "2 hours 45 minutes to 4 hours 15 minutes (see note)", "recipeYield": "Makes 9 meringues", "recipeCategory": ["Chocolate", "Eggs"], "recipeIngredient": ["3/4 cup plus 7 teaspoons (180 grams) granulated sugar", "3 large egg whites, at room temperature (about 1/3 cup plus 4 teaspoons, or 100 grams)", "1/4 teaspoon molasses (see note)", "1/8 teaspoon vanilla extract", "1 tablespoon Dutch-processed cocoa powder", "1/4 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 390&deg;F and adjust oven rack to middle position. Line a rimmed baking sheet with parchment paper. Pour sugar onto the lined baking sheet and bake until the edges of the sugar are just beginning to melt, about 4 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add egg whites to a clean medium-sized mixing bowl. Using an electric mixer with clean beaters, beat egg whites until they hold soft peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce oven to 210&deg;F. Add hot sugar to the egg whites 1 spoonful at a time, mixing continuously. Once all the sugar has been added, continue mixing until the meringue holds stiff peaks and you no longer feel sugar crystals when you rub a bit of meringue between your fingers, 5 to 8 minutes. Add molasses and vanilla and mix briefly to make sure meringue still holds stiff peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together cocoa powder and cinnamon. Using a fine-mesh sieve, dust the surface of the meringue with a thin layer of the cocoa and cinnamon mixture; you probably won't need to use all of the mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper and spoon the mixture onto the lined baking sheet in 9 equal-sized meringues. Try not to stir the cocoa and cinnamon mixture into the meringue too much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 2 1/2 to 4 hours (see note). The resulting meringues should be light and crisp and you should be able to easily remove them from the parchment. When tapped, they should sound hollow. Allow to cool on a wire rack. The meringues will keep in an airtight container at room temperature for up to 5 days. </p>"}]}