{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/05/20150519-farinata-daniel-gritzer-10-e1558720829624.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["chickpea", "garbanzo", "gluten free", "Italy", "pancake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.6666666666667", "ratingCount": "3"}, "name": "Farinata (Italian Chickpea Pancake)", "link": "https://www.seriouseats.com/recipes/2015/05/farinata-italian-chickpea-pancake-recipe.html", "description": "The first time I tried farinata, the baked chickpea pancake from Italy, it was dry as particleboard. The second and third times were just as bad. Only after I'd dismissed it as an inexplicably terrible product of the Italian kitchen did I finally taste the real thing, and then I understood why people loved it so much. Savory, custardy, and simple in the best possible way, it's also dead easy to make at home. Here's how.", "totalTime": "4 hours 30 minutes", "recipeYield": "Serves 4 to 6 as a snack", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Gluten-Free", "Legumes", "Pancake", "Sides", "Snacks", "Vegetarian"], "recipeIngredient": ["1/2 pound finely ground chickpea (garbanzo bean) flour", "1 teaspoon kosher salt", "3 cups water", "1/4 cup extra-virgin olive oil", "Freshly ground black pepper", "Picked rosemary leaves, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, combine chickpea flour and salt. Gradually add water, whisking constantly, until a smooth, thin batter forms. Let stand, covered, at least 4 and up to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 550&deg;F and position oven rack in second position from top. If you have a pizza stone or Baking Steel, set it on the rack (it will help crisp the farinata from below, but isn't required).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour olive oil into well-seasoned large cast iron skillet and swirl to fully coat bottom in an even layer. Using a spoon, scrape any foam from surface of batter and discard. Stir batter to mix well, then pour into skillet. Stir gently to swirl oil on top of batter. Season all over with black pepper and sprinkle with rosemary leaves, if using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn on broiler. Set skillet on pizza stone or Baking Steel, or on the oven rack if not using a stone, and cook until farinata has just set, no longer jiggles, and is browned all over, about 11 minutes. If your broiler cycles off, you can prop the oven door open with a utensil to keep it on the whole time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let farinata cool slightly until set. Eat warm or at room temperature.</p>"}]}