{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/09/20150919-midautumnfeast-fiona-reilly-20150919-midautumnfeast-redcookedpork-fiona-reilly.jpg", "author": {"@type": "Person", "name": "Fiona Reilly"}, "recipeCuisine": "Chinese", "keywords": ["braise", "Chinese", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Shanghainese Sticky Red-Cooked Pork Belly", "link": "https://www.seriouseats.com/recipes/2015/09/shanghainese-sticky-red-cooked-pork-belly.html", "description": "Pork is included in almost every Chinese celebration, in which it symbolizes abundance and wealth. This glossy, aromatic pork belly is \"red-cooked,\" or coated in a sticky soy-based reduction typical of Shanghainese cuisine. The result is sweet and savory cubes of meltingly tender meat in an aromatic sauce.", "totalTime": "3 hours", "recipeYield": "Serves 4", "recipeCategory": ["Braising and Stewing", "Chinese", "Pork", "Sides"], "recipeIngredient": ["1 1/2 pounds pork belly, skin on, in a single piece", "2 tablespoons vegetable oil", "2 tablespoons brown sugar", "1/2 inch knob ginger, peeled and finely sliced (about 2 teaspoons)", "1 garlic clove, peeled and finely sliced (about 1 teaspoon) ", "2 scallions, white part only, finely sliced (about 1 1/2 tablespoons)", "2 star anise pods", "1 cinnamon stick", "3 tablespoons Shaoxing wine", "1/4 cup light soy sauce", "Steamed rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large saucepan of water to a boil over high heat. Add pork belly and cook for 5 minutes. Drain and allow to cool slightly. Slice belly into 1-inch cubes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a wok over medium heat until the oil starts to shimmer, about 1 minute. Add brown sugar and stir until mixture begins to caramelize, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to high. Add ginger, garlic, and scallions, and cook, stirring, until fragrant, about 30 seconds. Add star anise and cinnamon stick and cook, stirring, for 30 seconds. Add pork cubes, stirring until the meat is well-coated in caramel. Add soy sauce and Shaoxing wine and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough water to cover the pork and bring it to a boil. Reduce heat to low and simmer uncovered for 2 hours, stirring occasionally until sauce has thickened and is dark brown and glossy. If liquid begins to dry out, add enough water to cover the meat and continue simmering. If sauce appears thin and diluted, remove pork after 2 hours and reduce sauce to desired consistency before returning pork to wok to gently reheat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve pork with sauce, accompanied by steamed rice.</p>"}]}