{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/chili-cheese-dog-grilled-cheese.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cheese", "chili", "grilled cheese", "hot dog", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chili Cheese Dog Grilled Cheese", "link": "https://www.seriouseats.com/recipes/2015/02/chili-cheese-dogs-grilled-cheese-recipe.html", "description": "This'll take you right back to the ballpark. Sliced fried hot dogs, chili, and melty American cheese. Not big enough? A double dog'll do ya'!", "totalTime": "20 minutes", "recipeYield": "Makes 1 sandwich", "recipeCategory": ["Cheese", "Sandwiches"], "recipeIngredient": ["2 tablespoons butter, cut into three even pieces", "1 hot dog, cut into 4 thin slices lengthwise", "2 slices hearty white bread, such as Pepperidge Farm or Arnold", "2 slices American, Cheddar, or Jack cheese", "1/2 cup your favorite chili", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt one third of butter in a large non-stick skillet over medium heat until foaming subsides. Add hot dog slices and cook, turning occasionally, until browned on all sides. Transfer to a plate. Add both bread slices and cook, swirling occasionally, until pale golden brown on bottom side, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer bread to a cutting board toasted-side-up. Place cheese slices on top of each slice. Add hot dogs and chili to one side, then close sandwich, with both toasted sides facing inwards.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt one more piece of butter in the skillet and reduce heat to medium low. Add sandwich and cook, swirling occasionally, until deep, even golden brown, about 5 minutes. Remove sandwich using a flexible metal spatula. Add the remaining butter. Return sandwich to skillet cooked-side up. Season with salt. Cook, swirling occasionally, until second side is deep, even golden brown and cheese is thoroughly melted, about 5 minutes. Serve immediately.<br />\r\n</p>"}]}