{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150219-grilled-buffalo-chicken-blue-cheese-sandwich-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Niki Achitoff-Gray"}, "recipeCuisine": "", "keywords": ["cheese", "chicken", "grilled cheese", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Buffalo Chicken Grilled Cheese Sandwich", "link": "https://www.seriouseats.com/recipes/2015/02/buffalo-chicken-grilled-cheese-sandwich-recipe.html", "description": "Blue cheese, shredded chicken, and Frank's RedHot are straddled by two melted layers of Monterey Jack&mdash;all the spicy, meaty, funky, cheesy flavors of a bar food classic, translated into the ultimate comfort food.", "totalTime": "15 minutes", "recipeYield": "Makes 1 sandwich", "recipeCategory": ["Cheese", "Chicken", "Sandwiches"], "recipeIngredient": ["2 tablespoons unsalted butter, cut into 3 even pats, divided", "2 slices hearty white sandwich bread, such as Pepperidge Farm or Arnold", "2 ounces grated Monterey Jack cheese", "1/2 cup shredded chicken (see note)", "1 ounce crumbled blue cheese", "1 tablespoon Frank's RedHot", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 pat of butter in a large non-stick skillet over medium heat until foaming subsides. Add both bread slices and cook, swirling occasionally, until pale golden brown on bottom side, about 2 minutes. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer bread to a cutting board toasted-side-up. Place half of Monterey Jack on one slice, followed by shredded chicken, blue cheese, and Frank's RedHot. Top with remaining Monterey Jack and close sandwich so that toasted side of top slice is facing the cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to burner and melt 1 more pat of butter over medium-low heat. Add sandwich and cook, swirling occasionally, until deep golden brown, about 5 minutes. Remove sandwich using a flexible metal spatula. Add the remaining 1 pat butter. Return sandwich to skillet cooked-side up. Season with salt. Cook, swirling occasionally, until second side is deep golden brown and cheese is thoroughly melted, about 5 minutes. Serve immediately.</p>"}]}