{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/10/20151022-pappa-al-pomodoro-vicky-wasik-11.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["bread", "Italian", "soup", "tomato", "tuscan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Tuscan Pappa al Pomodoro (Tomato and Bread Soup)", "link": "https://www.seriouseats.com/recipes/2015/11/tuscan-tomato-bread-soup-pappa-al-pomodoro-recipe.html", "description": "Just because it's no longer tomato season doesn't mean it's time to stop eating tomatoes. The Tuscan tomato-bread soup known as <em>pappa al pomodoro</em>, for instance, is perfect made with good-quality canned tomatoes and plenty of olive oil.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Italian", "Soups and Stews", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["2 tablespoons extra-virgin olive oil, plus more for drizzling", "Pinch red pepper flakes", "2 medium cloves garlic, thinly sliced", "1/2 medium onion, minced (about 1/2 cup)", "1 (28-ounce) can whole plum tomatoes, crushed by hand, with juices", "2 sprigs fresh basil, plus torn leaves for serving", "1/3 pound (about 6 ounces) fresh or stale rustic bread, torn or cut into 1-inch chunks (see note)", "2 cups warm <a href=\"http://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">Quick and Easy Vegetable Stock</a>, plus more as needed (see note)", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, heat 2 tablespoons olive oil over medium heat until shimmering. Add red pepper flakes and garlic and cook, stirring, until garlic just begins to turn golden. Add onion and cook, stirring, just until softened, about 5 minutes. Add crushed tomatoes and their juices, along with basil sprigs, and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in bread. Ladle stock on top, stirring to combine. Simmer bread, adding more stock as needed, until bread is completely softened and custardy and soup has thickened to a porridge-like consistency, about 25 minutes. Season with salt and pepper. Discard basil sprigs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon into bowls, generously drizzle with olive oil, and grind black pepper on top. Garnish with torn basil leaves and serve.</p>"}]}