{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/01/20130110-chicharron-thai-salad-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["easy", "issan", "pork", "quick", "salad", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Isan-Style Spicy Thai Fried Pork Rind and Herb Salad", "link": "https://www.seriouseats.com/recipes/2015/01/issan-thai-pork-rind-herb-salad-recipe.html", "description": "The dressing for this salad fires on all cylinders with big bursts of hot, acidic, sweet, and savory elements all in balance. The dressing coats crisp fried pork rinds, softening them up slightly, and making them taste almost bright and refreshing when coupled with plenty of fresh herbs and bean sprouts.", "totalTime": "10 minutes", "recipeYield": "Serves 4 to 6 as an appetizer", "recipeCategory": ["Pork", "Salads", "Thai"], "recipeIngredient": ["1 small red onion, split in half from pole to pole and thinly sliced", "2 scallions, thinly sliced on a sharp bias", "3 medium cloves garlic", "2 teaspoons Thai red pepper flakes (more or less to taste, see note)", "1 small green thai chili or 1/2 small Serrano chili, finely chopped", "1 tablespoon brown sugar (more or less to taste)", "1 tablespoon Asian fish sauce (more or less to taste)", "1 tablespoon juice from 1 lime (more or less to taste)", "1 roma tomato, split in half and thinly sliced", "1 cup mung bean sprouts, washed, trimmed, and dried", "2 (1.75 ounces) packages unflavored fried pork rinds", "1/2 cup fresh picked mint leaves", "1/2 cup fresh picked cilantro leaves", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place onions and scallions in a bowl, cover with cold water, add 6 ice cubes, and place in refrigerator until ready to use, at least 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine garlic, pepper flakes, and Thai chilies in a mortar and pestle and pound into a fine paste (see note). Add sugar, fish sauce, and lime juice, and pound until the sugar is dissolved. Taste dressing and add more sugar, fish sauce, lime juice, or pepper flakes to taste. It should be strongly spicy, sweet, salty, and acidic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine tomatoes, bean sprouts, pork rinds, mint, cilantro, and dressing in a large bowl and toss to combine. Carefully drain onions and scallions. Add to bowl and toss to combine. Serve immediately.</p>"}]}