{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150130-Poutine-Poppers-Plated-Picks-Morgan-Eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["cheese", "deep fry", "gravy", "potato", "poutine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Poutine Poppers (Cheese-Stuffed Potato Bites With Brown Gravy)", "link": "https://www.seriouseats.com/recipes/2015/02/poutine-poppers-potato-cheese-gravy-recipe.html", "description": "There's a lot to love about poutine, the Canadian dish of brown gravy- and cheese curd-topped fries. But it's not exactly a good finger food at  a party, unless you like the idea of dozens of gravy-coated fingers being wiped on the couch. Well, we'd like to introduce the solution to that problem: the Poutine Popper.", "totalTime": "1 hour 45 minutes", "recipeYield": "Serves 5-6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Potato", "Snacks", "Vegetarian"], "recipeIngredient": ["6 medium russet potatoes, washed and scrubbed", "Canola, vegetable, or peanut oil, for brushing and deep frying", "1/4 cup plus 2 tablespoons all-purpose flour, divided", "2 teaspoons kosher salt", "1 teaspoon freshly ground black pepper", "8 ounces cheese curds (see note)", "1 1/2 cups water", "2 beef bouillon cubes (or 2 teaspoons beef bouillon granules; see note)", "2 tablespoons unsalted butter", "1/4 teaspoon garlic powder", "1/4 teaspoon onion powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 400&deg;F. Line a baking sheet with foil and place potatoes on top. Brush potatoes all over with oil and bake until pierced easily with a fork, about 40 minutes. <br />\r\nLet potatoes stand until cool enough to handle. Cut potatoes in half lengthwise and, using a spoon, scoop out the potato flesh and transfer to a bowl. Reserve the skins for another use, such as <a href=http://www.seriouseats.com/recipes/2015/01/bacon-bratwurst-beer-cheese-potato-skins-recipe.html\">potato skins</a>, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix potatoes with 1/4 cup flour along with the salt pepper. Working one at a time, shape potato mixture into 1 1/2-inch cylinders, then flatten into your palm, and place 1 or 2 cheese curds, depending on their size, in the center. Using your fingers, fold the potato around the cheese to re-form the cylinder, making sure the cheese isn't poking through in any spots. Set on a baking sheet and repeat with remaining potato and curds. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the water and beef bouillon in a microwave-safe container and microwave until hot, about 1 1/2 minutes; stir to blend. In a saucepan over medium heat, melt butter and mix in remaining 2 tablespoons flour. Cook until lightly browned, then whisk in beef broth. Bring to a boil, stirring occasionally, and reduce to a simmer. Stir in garlic and onion powders and cook, stirring, until gravy thickens, about 3 minutes. Keep warm until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a deep fryer, Dutch oven, or wok, heat at least 2 inches of oil to 375&deg;F. Working in batches of 4 or 5, add poppers to oil and fry until golden brown, flipping for even browning all over, about 5 minutes. Using a slotted spoon or spider, transfer fried poppers to a paper towel-lined plate. Serve right away with warm gravy.</p>"}]}