{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150218-coq-au-vin-daniel-gritzer-15.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["braise", "chicken", "French", "stew", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7142857142857", "ratingCount": "7"}, "name": "Coq au Vin (Chicken Braised in Red Wine)", "link": "https://www.seriouseats.com/recipes/2015/02/coq-au-vin-chicken-red-wine-braise-recipe.html", "description": "A lot of <em>coq au vin</em> recipes have you braise the bird for hours. That's fine when you're doing it the traditional way with a tough old rooster, but it doesn't work well for the tender roasting hens most of us use today. This recipe delivers a rich and deeply braise with red wine, mushrooms, lardons, and onions that tastes like it was in the oven all day, except that it wasn't.", "totalTime": "2 hours 30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Braising and Stewing", "Chicken", "French", "Mains", "Soups and Stews"], "recipeIngredient": ["2 whole small chickens (about 3 pounds each, see note), each chicken <a href=\"http://www.seriouseats.com/2010/05/knife-skills-how-to-break-down-a-chicken.html\">cut into 4 pieces, backbones reserved for stock</a>", "2 cups <a href=\"http://www.seriouseats.com/2015/02/how-to-choose-red-white-wine-for-cooking.html\">dry red wine</a>", "8 ounces pearl onions (see note)", "1/4 pound slab bacon or salt pork, cut into 1- by 1/4- by 1/4-inch sticks", "Kosher salt and freshly ground black pepper", "8 ounces button or cremini mushrooms, woody stems trimmed if necessary, quartered", "3 medium carrots, diced (about 1 1/2 cups)", "4 medium cloves garlic, crushed", "2 sprigs thyme", "2 bay leaves", "2 cups gelatinous <a href=\"http://www.seriouseats.com/2014/10/how-to-make-rich-flavorful-easy-chicken-stock.html\">homemade chicken stock</a> (see note) or low-sodium chicken broth", "3 tablespoons cold unsalted butter, cubed", "1/4 cup minced flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Add chicken to a 1-gallon zipper-lock bag. Pour in wine and seal bag, pressing out air. Let stand while you prepare the remaining ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a paring knife, trim off the ends of each onion and score a light \"X\" into one cut side. Bring a small pot of water to a boil over high heat. Add onions and cook until outer layers are soft, about 1 1/2 minutes. Drain onions and run under cool water until cold enough to handle. Peel onions with your fingers and discard peels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven or rondeau, cook bacon over medium-high heat, stirring and reducing heat as necessary to prevent scorching, until browned and fat has rendered, about 10 minutes. Remove from heat and, using a slotted spoon, transfer bacon to a paper towel-lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken from zipper-lock bag, reserving wine, and pat dry. Season with salt and pepper. Return Dutch oven with rendered bacon fat to medium-high heat and, working in batches, add chicken, skin side down, and cook until browned, about 7 minutes. Turn and brown other side, about 5 minutes. Transfer browned chicken to a wire rack set over a rimmed baking sheet. Reserve at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all chicken is browned, add mushrooms to Dutch oven and cook over medium-high heat, stirring frequently, until browned, 10 to 12 minutes. Add pearl onions, carrots, and garlic and cook, stirring, until lightly browned, about 5 minutes. Add bacon, wine, thyme, and bay leaves and bring to a simmer, stirring up any browned bits. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in stock. Add chicken legs skin side up, nestling them into the Dutch oven so that they are partially submerged but top of skin is above the liquid. Pour in any accumulated juices from chicken. Transfer to oven and cook, uncovered, for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chicken breasts, nestling them skin side up amongst the legs, and return to the oven. Cook until breasts are just cooked through (they should register 145 to 150°F on an instant read thermometer), about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken breasts and legs to a clean rack set over a rimmed backing sheet. Set Dutch oven over medium-low heat and simmer until sauce is lightly viscous, about 10 minutes. Whisk in butter, then season with salt (if necessary) and pepper. Stir in half of parsley.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return chicken to pot, spooning sauce on top. Garnish with remaining parsley. Serve right away with buttered potatoes, pasta, or rice.</p>"}]}