{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/10/20151007-pork-tenderloin-vicky-wasik-12-2.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["Italian", "pork", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Pork Tenderloin Vitello Tonnato (Veal With Tuna Sauce)", "link": "https://www.seriouseats.com/recipes/2015/10/pork-tenderloin-vitello-tonnato-recipe.html", "description": "Vitello tonnato (veal with tuna sauce) is a northern Italian classic, but it can be hard to convince the uninitiated that it's even a good idea. Not only is it delicious, though, it's just as good when made with pork.", "totalTime": "2 hours", "recipeYield": "Serves 4 to 6 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fish", "Italian", "Pork"], "recipeIngredient": ["1 (1-pound) pork tenderloin", "Kosher salt and freshly ground black pepper", "1/2 cup extra-virgin olive oil, plus more for drizzling", "1/2 cup plus 1 tablespoon vegetable oil, divided", "1 whole egg", "1/4 cup fresh juice from 2 lemons, divided", "1 teaspoon Dijon mustard", "1 teaspoon drained capers", "2 <a href=\"http://www.seriouseats.com/2015/09/how-to-buy-and-prepare-anchovies.html\">anchovy fillets</a>", "1 (5-ounce) can tuna in olive oil, drained", "Flat-leaf parsley leaves, thinly sliced celery and celery leaves, thinly sliced fennel bulb and fennel fronds, thinly sliced caper berries, and/or thinly sliced radish, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 250&deg;F. Place pork on a rimmed baking sheet and season all over with salt and pepper. Drizzle with olive oil and rub all over to lightly coat. Roast pork until instant-read thermometer registers 140&deg;F, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat 1 tablespoon vegetable oil over high heat until lightly smoking. Add pork and cook until browned on all sides, about 5 minutes total. Transfer pork to refrigerator to chill for at least 1 hour and up to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place egg, 2 tablespoons lemon juice, mustard, capers, and anchovies in the bottom of an immersion blender cup. Pour remaining 1/2 cup vegetable oil on top and allow to settle for 15 seconds. Place head of immersion blender at bottom of cup and switch it on. As mayonnaise forms, slowly tilt and lift the head of the immersion blender until all oil is emulsified. Add tuna and remaining 2 tablespoons lemon juice and blend until thoroughly incorporated into a smooth sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mayonnaise to a large mixing bowl and slowly drizzle in 1/2 cup olive oil, whisking until emulsified. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice pork very thinly against the grain. Arrange on a large plate and spoon tuna mayonnaise all over, spreading to form an even coating. You can refrigerate the pork tonnato, covered with plastic, for up to 8 hours; it will improve in flavor as it sits.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, toss garnish with a small drizzle of olive oil and salt. Arrange on top and serve right away.</p>"}]}