{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150627-corn-shrimp-tomatillo-salad-recipe-8.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "quick", "salad", "shrimp", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Quick and Easy Shrimp, Corn, and Tomatillo Salad", "link": "https://www.seriouseats.com/recipes/2015/07/quick-easy-shrimp-corn-tomatillo-salad-recipe.html", "description": "A quick and easy shrimp and corn salad flavored with cilantro, bell peppers, and crunchy raw tomatillos, this dish is light enough for an easy side and hearty enough for a bright, fresh supper.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Salads", "Shrimp", "Sides"], "recipeIngredient": ["1 pound raw medium shrimp, shelled and deveined", "1 tablespoon plus 1 teaspoon kosher salt, divided, plus more for seasoning", "1/4 teaspoon baking soda", "3 cups fresh corn kernels, cut from about 3 ears of corn", "2 tablespoons fresh juice from 3 to 4 limes, divided", "1/2 pound fresh tomatillos, husks removed, split in half and cut into 1/4-inch slices", "1 serrano pepper, thinly sliced", "1 red bell pepper, diced (about 3/4 cup)", "3 scallions, white and light green parts only, thinly sliced on a bias", "1/4 cup roughly chopped fresh cilantro leaves and tender stems", "3 tablespoons extra-virgin olive oil", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine shrimp, 1 teaspoon kosher salt, and baking soda in a medium bowl and toss to coat. Set aside in refrigerator while you cook the corn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium pot of well-salted water to a boil. Add corn and cook until tender-crisp, about 3 minutes. Drain carefully, rinse under cold running water, and spin dry in a salad spinner.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add shrimp to now-empty pot and cover with 3 cups cold water. Add remaining 1 tablespoon salt along with 1 tablespoon lime juice. Place over medium-high heat and heat until water is barely steaming and registers 170&deg;F on an instant-read thermometer; adjust heat to maintain this temperature for remainder of cooking. Cook shrimp until pink and firm to the touch, about 7 minutes total. Drain carefully, rinse under cold running water, and spin dry in salad spinner.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cooked shrimp and corn with tomatillos, serrano pepper, red bell pepper, scallions, cilantro, olive oil, and remaining lime juice. Toss to coat, season to taste with salt and pepper, and serve.</p>"}]}