{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/10/20151021-cremed-spinach-recipe-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["creamed spinach", "essential", "holiday", "low carb", "spinach", "the food lab book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "The Food Lab's Creamed Spinach", "link": "https://www.seriouseats.com/recipes/2015/10/food-lab-creamed-spinach-recipe.html", "description": "The bare bones of this creamed spinach recipe are pretty straightforward and classic: The spinach is cooked low and slow to gradually concentrate its juices. Combined with a creamy béchamel sauce, it reduces into a rich, thick coating with a near pudding-like texture. The only minor embellishments I include here are a doubling-up of the alliums and a last-minute shot of crème fraîche for a final dose of creaminess and fresh flavor.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Christmas", "Sides", "Spinach", "The Food Lab", "Vegetarian"], "recipeIngredient": ["3 tablespoons unsalted butter", "2 medium shallots, finely minced (about 1/2 cup)", "2 medium cloves garlic, minced or grated on a Microplane (about 2 teaspoons)", "2 pounds curly spinach, trimmed, washed, and drained", "1 tablespoon all-purpose flour", "1 1/2 cups heavy cream", "1/2 cup whole milk", "1/4 teaspoon freshly grated nutmeg", "1/4 cup store-bought or <a href=\"http://www.seriouseats.com/recipes/2011/02/how-to-make-creme-fraiche-in-1-easy-step.html\">homemade</a> crème fraîche", "Kosher salt and freshly ground black pepper", "2 ounces Parmigiano-Reggiano, finely grated (about 1 cup; optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in a Dutch oven or large saucepan over medium-high heat. Add the shallots and garlic and cook, stirring, until softened, about 2 minutes. Add the spinach in four batches, turning each batch with tongs or a rubber spatula and allowing it to wilt before adding the next.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the flour and cook, stirring constantly, until no dry flour remains. Slowly stir in the heavy cream and milk. Bring to a simmer, stirring, then reduce the heat to the lowest possible setting and cook, stirring occasionally, until the spinach is completely softened and the sauce has thickened, about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the nutmeg and crème fraîche and season to taste with salt and pepper. Remove from the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If desired, preheat the broiler to high. Transfer the creamed spinach to a 1-quart oval or round casserole dish and top it with the cheese. Broil until the spinach is bubbly and the cheese has formed a well-browned crust, about 2 minutes. Serve.</p>"}]}