{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150313-roman-gnocchi-daniel-gritzer-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["casserole", "gnocchi", "Italian", "pasta", "semolina"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.3333333333333", "ratingCount": "3"}, "name": "Roman Semolina Gnocchi (Gnocchi alla Romana)", "link": "https://www.seriouseats.com/recipes/2015/03/roman-semolina-gnocchi-alla-romana-recipe.html", "description": "Long before ships brought native crops from the Americas to Europe, Italy was a land without red sauce, corn polenta, or potato gnocchi. But even without the potato, gnocchi still existed, such as in the form of the classic gnocchi <em>alla Romana</em>, this custardy oven-baked version made with semolina, egg, cheese, and butter. You could say these are the OG: the original gnocchi.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4 to 6 as a pasta or main course and 8 as a side or appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Father's Day", "Italian", "Mains", "Pasta", "Sides", "Vegetarian"], "recipeIngredient": ["6 cups milk", "Kosher salt", "1 1/2 cups semolina flour", "8 tablespoons unsalted butter, divided, plus more for greasing", "1 cup grated Parmigiano-Reggiano, plus more for grating", "3 egg yolks, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, heat milk over medium-high heat, whisking occasionally to prevent scorching, until steaming. Season well with salt. While whisking constantly, sprinkle in semolina in a fine shower to prevent lumps; the mixture will thicken and become difficult to whisk. Once all semolina is added, lower heat to medium-low, switch to a stiff rubber spatula or wooden spoon and cook over medium-low heat, stirring constantly, until a sticky, dough-like mass forms and begins to pull away from sides of saucepan, 10 to 15 minutes; make sure to stir deep into corners and all over bottom of saucepan to prevent scorching. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in 4 tablespoons of butter until melted and thoroughly incorporated. Stir in cheese until melted and thoroughly incorporated. Scrape in egg yolks and stir until thoroughly incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape semolina dough into a buttered rimmed baking sheet. Using a wet rubber spatula or wet clean hands, and re-wetting frequently to prevent sticking, press and smooth semolina dough into an even layer about 1/2 inch thick. It's okay if the dough does not fully reach all edges of the baking sheet, as long as it's even throughout. Press plastic wrap against the surface and refrigerate until set, at least 40 minutes and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450&deg;F. Using a 3-inch round cookie cutter or similarly sized glass, cut semolina into rounds (scraps can be saved and refrigerated for up to 4 days: deep fry in oil for a snack, or assemble in a smaller baking dish to make a mini version of this dish). Grease a large baking dish or ovenproof skillet with butter. Using a thin metal spatula, scrape each semolina round from the baking sheet and arrange in an overlapping pattern in the prepared dish or skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the remaining 4 tablespoons butter and drizzle all over semolina gnocchi. Grate Parmigiano-Reggiano generously all over. Bake until gnocchi are sizzling hot and browned on top, about 15 minutes. Serve, passing more grated cheese at the table.</p>"}]}