{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150604-pasta-salad-italian-tomato-basil-daniel-gritzer-11.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["basil", "easy", "Italian", "pasta", "pasta salad", "salad", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "3"}, "name": "Blistered-Tomato Pasta Salad With Basil", "link": "https://www.seriouseats.com/recipes/2015/06/blistered-tomato-pasta-salad-basil-recipe.html", "description": "Pasta salad with raw tomatoes and basil is a common summertime dish. Here we give it a thoughtful upgrade by cooking the tomatoes just until bursting, so that they release their rich juices into a flavorful sauce that coats the pasta even when cooled. It's a new summertime must.", "totalTime": "25 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Dairy-Free", "Italian", "Mains", "Pasta Salad", "Salads", "Sides", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["1 pound dried pasta, sich as fusilli bucati or regular fusilli", "6 tablespoons extra-virgin olive oil, divided, plus more for drizzling", "8 medium cloves garlic, thinly sliced", "2 pints mixed cherry and/or grape tomatoes", "Kosher salt and freshly ground black pepper", "15-20 basil leaves, torn", "3/4 pound fresh mozzarella, cut into 1/2-inch cubes (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pot of salted boiling water, cook pasta until very tender throughout, 2 to 3 minutes longer than al dente stage according to package. Drain in a colander, then chill under cold running water. Let drain well, then drizzle lightly with olive oil and toss to coat. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium skillet, heat 3 tablespoons olive oil with garlic over medium heat until garlic begins to sizzle lightly. Increase heat to high and add tomatoes. Cook, tossing frequently, until tomato skins split, burst, and release some juices, about 5 minutes; you can gently press on some of the tomatoes with a wooden spoon to help them along, but avoid mashing them. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss pasta with tomatoes, garlic, and their sauce, along with the remaining 3 tablespoons olive oil and basil. Season with salt and pepper. Once cooled, add mozzarella, if using, and toss to combine. Serve at room temperature, adding additional olive oil as necessary to refresh noodles. Pasta salad can be made up to 1 day in advance without basil and kept refrigerated; return to room temperature, toss in basil, and refresh with more olive oil before serving.</p>"}]}