{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150316-sticky-rice-with-lotus-leaf-shao-zhong-2.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "dim sum", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Chinese Sticky Rice Wrapped in Lotus Leaf (Lo Mai Gai)", "link": "https://www.seriouseats.com/recipes/2015/03/sticky-rice-wrapped-lotus-leaf-lo-mai-gai-recipe.html", "description": "<em>Lo mai gai</em>, the dim sum classic of steamed lotus leaves stuffed with sticky rice and all sorts of delicious goodies, are irresistible from the moment you unwrap one fresh from the steamer and a chorus of aromas hits your nose. The biggest task is gathering all the ingredients, like the lotus leaves and glutinous rice, as well as Chinese sausage, cured pork belly, and salted egg yolks. Once you've got them rounded up, though, it's a relatively easy and extremely delicious at-home dish.", "totalTime": "5 hours", "recipeYield": "Makes 4 lotus-leaf packages, serving 4 to 8", "recipeCategory": ["Chicken", "Chinese", "Mains", "Pork", "Rice", "Snacks"], "recipeIngredient": ["2 cups sticky rice (sweet rice)", "<strong>For the Marinated Chicken:</strong>", "1/2 pound skinless, boneless chicken thighs, sliced thinly", "1/2 teaspoon cornstarch", "1 teaspoon vegetable or canola oil", "1 teaspoon oyster sauce", "1/2 teaspoon Shaoxing wine", "1 teaspoon dark soy sauce", "1/4 teaspoon sugar", "1/4 teaspoon ground white pepper", "2 pinches kosher salt", "<strong>For the Sticky Rice Seasoning:</strong>", "1 teaspoon Shaoxing wine", "1 teaspoon toasted sesame oil", "1 teaspoon oyster sauce", "2 teaspoons dark soy sauce", "<strong>For the Lotus Leaf Packages:</strong>", "2 dried lotus leaves or 4 sheets of 2-foot-long parchment paper", "2 tablespoons small dried shrimp, soaked in water for 5 minutes, then drained, rinsed, and patted dry (optional)", "3 teaspoons canola or vegetable oil, divided", "1 whole shallot, minced", "2 medium garlic cloves, minced", "8 dried shiitake mushroom caps, rehydrated in hot water for 15 minutes, then drained, squeezed dry, and sliced thinly", "2 salted duck eggs (cooked or uncooked)", "3 ounces Chinese bacon (lap yuk), sliced thinly", "2 Chinese sausages (lap cheong), sliced thinly on the bias"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place sticky rice in a large bowl and cover completely with water. Let stand for at least 2 hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Marinated Chicken:</strong> In a medium bowl, mix chicken with the remaining marinade ingredients until thoroughly combined. Let stand in refrigerator for at least 2 hours or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sticky Rice Seasoning:</strong> Stir together all ingredients in a small bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lotus Leaf Packages:</strong> Cut each lotus leaf in half down the middle. Place leaves in a large container, cover with water, weighing leaves down with a plate if necessary, and soak for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain sticky rice well and transfer to a large bowl. Stir in dried shrimp, if using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a non-stick skillet or wok, heat 2 teaspoons of oil over high heat until shimmering. Add shallot and garlic and cook, stirring, until softened, about 1 minute. Add shiitake mushrooms and cook, stirring, until golden brown, about 2 minutes. Scrape mixture into the sticky rice and stir to combine. Stir in the Sticky Rice Seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same skillet or wok, heat remaining 1 teaspoon oil over high heat until shimmering. Add marinated chicken, and cook, stirring, until just cooked through, about 3 minutes. Transfer chicken to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you are using cooked salted duck eggs, peel the eggs, then slice in half and gently scoop out yolks with a spoon (it’s ok if some of the egg whites are attached). If you are using raw salted duck eggs, crack the eggs into a small bowl and separate the whites from the yolks (the yolks should be bright orange and fairly firm); carefully slice the yolks in half with a knife. Set cooked or uncooked yolks aside on a small plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form packages, drain lotus leaves, pat dry with towels, and arrange on a work surface. Alternatively, arrange 4 pieces parchment paper on work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place about 1/2 cup of sticky rice mixture in the center of each lotus leaf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange cooked chicken, Chinese bacon, Chinese sausage, and salted duck yolks on top of each stick rice mound.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop another 1/2 cup of sticky rice mixture directly on top of the rice mounds on each lotus leaf, carefully spreading it out to cover the meats and egg yolk; it's okay if the rice can’t cover everything.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap each lotus-leaf or parchment package by folding edges around filling to form a tight package. Using kitchen twine, tie up each package.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring water to a boil in a steamer setup. Arrange rice packages in steamer and steam for 1 hour 30 minutes; make sure to check water level occasionally, topping up with more boiling water if needed to prevent it from going dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut off and discard kitchen twine and serve right away.</p>"}]}