{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/01/quickandeasyskillettamalepie.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "American", "keywords": ["american", "beef", "chili", "comfort", "Southern", "southwest", "tamale", "tamale pie", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1666666666667", "ratingCount": "6"}, "name": "Quick and Easy Skillet Tamale Pie With Brown Butter Cornbread Crust", "link": "https://www.seriouseats.com/recipes/2015/01/american-tamale-pie-quick-and-easy-food-lab-recipe.html", "description": "Tamale pie is a dish that screams for an update. I mean, it's cornbread and chili all rolled into one! Just imagine how great it could be if we took the time to make a real, deeply flavored, meaty chili from scratch, eschewing the dump-and-stir approach and instead building up layers of spices and aromatics. Now imagine that chili topped with tender, moist, crisp-edged, buttery cornbread with those chili juices seeping up into it as it bakes in the oven. That's the kind of meal I'd love to come home to after a long day out in the cold. Wouldn't you?", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["American", "Beef", "Mains", "Quick Dinners", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["6 tablespoons unsalted butter", "1 pound ground beef chuck", "1 medium onion, diced (about 1 cup)", "4 medium cloves garlic, thinly sliced", "2 tablespoons ancho chili powder", "1/4 teaspoons cayenne pepper (optional)", "1 tablespoon ground cumin", "1 teaspoon ground coriander", "1 cup frozen or fresh corn kernels, thawed if frozen", "1 (15-ounce) can black beans, drained and rinsed", "1 (28-ounce) can whole peeled tomatoes, drained and crushed with your hand through fingers to roughly break up", "1 cup <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium broth", "4 ounces grated sharp cheddar cheese (about 1 cup)", "3 scallions, thinly sliced", "1/2 cup fresh cilantro leaves and fine stems, minced", "Kosher salt and freshly ground black pepper", "<strong>For the Brown Butter Cornbread Crust:</strong>", "1 cup (about 5 ounces) fine yellow cornmeal", "1 cup (about 5 ounces) all-purpose flour", "4 tablespoons sugar", "2 teaspoons baking powder", "1/4 teaspoon baking soda", "2 eggs", "6 ounces (about 3/4 cup) sour cream", "4 ounces (about 1/4 cup) cultured buttermilk", "Sour cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 425&deg;F. Heat butter in a 12-inch cast iron or stainless steel skillet over medium heat until melted. Continue to cook, swirling pan gently until butter is nutty-smelling and solids are a toasty brown. Transfer to a heatproof cup or bowl and reserve for Brown Butter Cornbread Crust.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pan to high heat. Add beef and cook, stirring and breaking up with a wooden spoon or a potato masher until starting to brown, about 8 minutes. Add onion and garlic and cook, stirring frequently, until softened and fragrant, about 4 minutes. Add chili powder, cayenne (if using), cumin, and coriander. Stir until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add corn, black beans, tomatoes, and chicken stock. Bring to a simmer, then stir in cheese. Reduce heat to low and cook, stirring occasionally, until thickened into a rich stew-like consistency, about 5 minutes. Remove from heat and stir in scallions and cilantro. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Brown Butter Cornbread Crust:</strong> Combine cornmeal, flour, sugar, 1 teaspoon kosher salt, baking powder, and baking soda in a large bowl. Combine eggs, sour cream, and buttermilk in a second bowl and whisk until homogenous. Whisking constantly, slowly drizzle in reserved browned butter. Whisk wet ingredients into dry ingredients until homogenous.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a large spoon, place small dollops of the cornbread batter mixture on top of the beef filling, then use the back of the spoon to spread it into an even layer. Transfer the skillet to the oven and bake until pale golden brown and a skewer inserted into the cornbread comes out clean, about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool 15 minutes, then serve with sour cream.</p>"}]}