{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151019-miso-risotto-recipe-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["easy", "Italian", "Japanese", "quick", "risotto", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "6"}, "name": "Easy Vegan Pressure-Cooker Miso Risotto", "link": "https://www.seriouseats.com/recipes/2015/10/pressure-cooker-miso-risotto-recipe.html", "description": "Miso paste is high in glutamates and will add a deep savory backbone to a dish without overwhelming it. We use a touch of miso paste in both our squash risotto and our mushroom risotto. In those recipes, the miso is a flavor enhancer. In this recipe, the miso is the star.", "totalTime": "20 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Dairy-Free", "Italian", "Japanese", "Mains", "Pressure Cooker", "Quick Dinners", "Rice", "Vegan", "Vegetarian"], "recipeIngredient": ["6 tablespoons extra-virgin olive oil", "1 medium shallot, finely minced (about 1/4 cup)", "3 medium cloves garlic, minced (about 1 tablespoon)", "2 cups risotto rice, such as Arborio or Vialone Nano", "3/4 cup dry sake", "2 teaspoons soy sauce", "1/4 cup white or yellow miso paste", "4 cups homemade or store-bought low-sodium <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">vegetable stock</a> or <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">chicken stock</a>", "1/2 teaspoon fresh juice from 1 lemon", "Kosher salt", "Minced fresh chives or scallions, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil in a pressure cooker over medium-high heat, stirring and swirling pan until shimmering. Add shallot and garlic and cook, stirring, until translucent but not browned, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3 to 4 minutes. (Rice grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sake and cook, stirring, until raw alcohol smell has cooked off and wine has almost fully evaporated, about 2 minutes. Stir in soy sauce and miso paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add stock and scrape any grains of rice or pieces of shallot or garlic from the sides of the pressure cooker so that they are fully submerged. Close pressure cooker and bring up to low pressure (10 psi on most units). Cook at low pressure for 5 minutes, then depressurize cooker, either by using the steam-release valve (if it has one) or running it under cold water (if it does not; do not run an electric pressure cooker under running water).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open pressure cooker, add lemon juice, and stir to combine rice and cooking liquid; it should begin to form a creamy consistency. If risotto is too soupy, cook for a few minutes longer, stirring, until it begins to thicken more; it should look like a smooth, creamy sauce. Season to taste with salt (if necessary), stir in chives or scallions, and serve immediately.</p>"}]}