{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/Serious-Eats-Slow-Cooker-Cream-Roasted-Mushroom-Soup1-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "", "keywords": ["easy", "mushroom", "slow cooker", "soup", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.75", "ratingCount": "4"}, "name": "Lazy-Day Slow-Cooker Mushroom Soup", "link": "https://www.seriouseats.com/recipes/2015/01/roasted-mushroom-soup-recipe-slow-cooker.html", "description": "There are few things in life more enjoyable than a mound of roasted mushrooms. Whether scarfed down hot or at room temperature, using a fork or a spoon, I can plow through them like nobody's business. The question is, how do you take those same mushrooms, with their intense, savory roasted flavor, and turn them into a rich, comforting soup? The slow cooker sure comes in handy at times like these.", "totalTime": "6 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Mushrooms", "Slow Cooker", "Soups and Stews", "Vegetarian"], "recipeIngredient": ["24 ounces cremini or white button mushrooms, cleaned, dried, trimmed, and quartered ", "1 medium onion, roughly chopped", "4 cloves garlic, sliced", "7 sprigs thyme, divided", "2 small lemons, halved", "2 tablespoons olive oil", "1 1/2 tablespoons red wine vinegar", "Kosher salt and freshly ground black pepper", "1/2 cup dry sherry", "2 cups half and half", "1 cup heavy cream", "1/2 cup sour cream", "3 cups homemade or store-bought low-sodium <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">chicken stock</a> or <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">vegetable stock</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 375°F. Place mushrooms, onions, garlic, and 5 thyme sprigs in a large bowl. Squeeze lemons into the bowl and add the squeezed lemon halves. Add olive oil and vinegar. Season with salt and pepper and toss to coat. Transfer to a foil-lined rimmed baking sheet and spread into an even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to oven and roast until mushrooms release liquid, about 15 minutes. Carefully drain liquid into a separate container and reserve. Return mushrooms to oven and continue roasting until browned but still tender, about 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lemons and thyme sprigs and discard. Transfer mushroom mixture along with drained liquid to the crock of a slow cooker. Add sherry, half and half, heavy cream, sour cream, and stock, along with remaining 2 thyme sprigs. Stir to combine and cook on low for 6 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard thyme sprigs. Working in batches, transfer soup to a blender. Set blender to lowest speed and slowly increase speed to high. Blend until desired consistency is reached. Alternatively, blend with a hand blender directly in the slow cooker.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle into bowls and serve immediately or refrigerate and reheat on the stove-top before serving.</p>"}]}