{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150723-brewing-a-fast-sour-beer-steve-hoyt.jpg", "author": {"@type": "Person", "name": "Peter Mortensen"}, "recipeCuisine": "", "keywords": ["beer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Fast Sour Beer", "link": "https://www.seriouseats.com/recipes/2015/08/how-to-brew-sour-beer-recipe.html", "description": "Most sour beers take a year or more to brew at home. This one is ready in four to five weeks.", "totalTime": "4 to 6 weeks", "recipeYield": "makes 5 gallons", "recipeCategory": ["Drinks", "Other Drinks"], "recipeIngredient": ["2 cups Briess light <a href=\"http://www.amazon.com/Briess-Light-Malt-Extract-Brewing/dp/B0038O5N4I/?tag=serieats-20\">dry malt extract</a>", "2.5 pounds <a href=\"http://www.amazon.com/Rahr-G01037-RAHR-2-Row-lb/dp/B0076QY6B0/?tag=serieats-20\">2 row malt</a>", "2.5 pounds <a href=\"http://www.amazon.com/White-Wheat-Malt-1-lb/dp/B0076QY4R6/?tag=serieats-20\">white wheat malt</a>", "1 liter tap water", "2 tablespoons yogurt with live and active cultures (Fage recommended) or liquid probiotic supplement (Good Belly Big Shot recommended)", "1 ounce fresh herbs, such as rosemary, lemon verbena, and/or lemongrass", "1 375 milliliter bottle unpasteurized wild ale (Lindeman’s Cuvee Renee recommended for price and availability; see this <a href=\"http://www.themadfermentationist.com/p/dreg-list.html\">list of beers with viable dregs from the Mad Fermentationist</a>.", "1 package Brettanomyces Bruxellensis (<a href=\"http://www.amazon.com/WLP650-Brettanomyces-bruxellensis-Bacteria-HomeBrewStuff/dp/B00PYV4FNS\">White Labs 650</a> or <a href=\"http://www.amazon.com/Brettanomyces-Bruxellensis-Activator-Wyeast-5112/dp/B0064O7M5M/?tag=serieats-20\">Wyeast 5112</a>)", "Small container of <a href=\"http://www.amazon.com/Monster-Brew-Brewing-Supplies-FS_SS_8/dp/B00FA86OZ2/?tag=serieats-20\">Starsan Sanitizer</a>", "2 gallons purified water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, bring 1 liter of water to boil over high heat to make starter wort, or unfermented beer. Remove from heat and stir in 2 cups dry malt extract until completely dissolved. Bring back to a boil for 10 minutes, then cool to 120&deg;F by covering pan with lid and running cool tap water over it. Once cooled, scoop 2 tablespoons Greek yogurt into a sanitized 64-ounce mason jar or glass jug, then pour in cooled wort on top. Cover the top of the vessel loosely with foil, then insulate with a blanket or neoprene sleeve. Hold as close to 110&deg; as possible for 60 to 72 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1.5 gallons water in a stockpot to about 160&deg;F, then add all grain, stirring to avoid clumps. Cover pan with lid, remove from heat, and hold at temperature for 1 hour by wrapping pot in a thick towel. This is your \"mash tun.\"</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a separate kettle, heat another 1.5 gallons of water to 170&deg;. This is your “hot liquor tank,” which provides a reservoir of hot water to rinse the grains with in a later state. When hot liquor tank comes to temperature, bring mash tun to 175&deg; over medium heat, then turn off heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large fine mesh strainer (12” in diameter has just enough capacity for 5 pounds of grain) over the top of a third 5-gallon brewing kettle. Pour the contents of mash tun through the fine mesh strainer into the kettle. Let stand until grain has fully drained. Ladle all 1.5 gallons of water from your hot liquor tank over the grains in the colander, rinsing off any additional sugars on the surface of the grains. When finished, taste the grains; all sweetness should be gone. If you taste any sugar, heat more water to 170&deg; and rinse over the grains until they taste bland. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You should have about 3 gallons of wort in the kettle at this point. Bring to a boil over high heat, then stir in herbs. After 15 minutes, smell steam to ensure no aroma of cooked corn (DiMethyl Sulfide, or DMS). The goal is to sanitize the wort and boil off DMS without losing much yield. If you can detect DMS aroma in the steam, keep boiling until it is no longer apparent.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As you end the boil, switch off heat, and place thermometer in the wort. Pour 2 gallons of refrigerated purified water into the kettle, increasing volume to 5 gallons and dropping the temperature between 120 to 130&deg;F. Stir vigorously with a large spoon to cool further if temperature is a little on the high side. Once at temperature, pour all liquid and solids from bacterial starter from step 1 directly into kettle. Cover tightly with foil or plastic wrap and insulate with a thick bath towel, holding at temperature for 24 hours to ensure sufficient acid formation. Because fermentation generates heat, the simple insulation is enough to stay above 100&deg; overnight, ideal growing temperature for lactic acid-producing bacteria.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>24 hours later, sanitize your fermentation carboy by diluting 1 teaspoon of Starsan sanitizer in a gallon of water inside the carboy. Shake up and roll the carboy on its side to ensure the liquid touches all interior surfaces and the opening. Pour out when complete. Pour off 10 ounces of your storebought unpasteurized sour beer (reserve for your well-deserved enjoyment), reserving just over 3 ounces (about the bottom quarter of the bottle) of liquid and yeast and bacteria-rich dregs from the bottom. Using an auto-siphon device, transfer soured wort into carboy, then pour in the remaining liquid and dregs into the carboy. Add an airlock and rubber stopper to the top, then set in a cool location in the high 60s to low 70s to favor yeast activity over further bacterial growth and souring.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste periodically, using your pipette reserved for sour beers, starting at about 2 weeks from initial brew day. When beer is both tart and lightly buttery (from diacetyl), add the brettanomyces, dumping the full vial into the carboy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Taste again with pipette a week or so after brettanomyces addition. If the buttery flavor has dissipated and the beer tastes “bright,” use a sanitized hydrometer, testing jar, and pipette to take a sample. If the specific gravity is at or below 1.010, the beer is ready to be transferred to a keg or bottles; if not, continue fermenting until reaching this target. Do not replace beer tested to the carboy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To carbonate, heat 1 cup of water to boiling, then turn off heat and add 4.5 ounces dextrose (corn sugar) to hot water and stir until dissolved. Pour into carboy through a sanitized funnel and let sit for 10 minutes, then use auto-siphon to transfer liquid into bottles, and adding caps and sealing them as you go. This should yield approximately 48 12-ounce bottles. Alternatively, transfer to sanitized keg and carbonate following keg carbonation instructions. For natural carbonation, the beer should be ready in 2 to 3 weeks.</p>"}]}