{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/12/20151115-EggNogJelloShot-jelloshots2-ElanaLepkowski.jpg", "author": {"@type": "Person", "name": "Elana Lepkowski"}, "recipeCuisine": "", "keywords": ["cocktail", "eggnog", "holiday", "jello shot", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Eggnog Jello Shots", "link": "https://www.seriouseats.com/recipes/2015/12/eggnog-jello-shot-recipe.html", "description": "I love a frothy mug of <a href=\"http://www.seriouseats.com/recipes/2011/12/rich-and-frothy-holiday-eggnog-with-an-electric-mixer-or-stand-mixer.html\">eggnog</a>, but the Christmas classic is even more fun in jello-shot form.", "totalTime": "8 hours 30 minutes", "recipeYield": "Makes 48 (2/5 ounce) jello shots", "recipeCategory": ["Puddings and Custards", "Rum"], "recipeIngredient": ["2 large eggs, separated", "2 1/2 tablespoons granulated sugar (1.1 ounces; 28g), divided", "3/4 cup (180ml) whole milk", "1/2 cup (120ml) heavy cream", "2 packets unflavored powdered gelatin (1/2 ounce; 14g)", "1/2 cup (120ml) dark rum, such as Gosling's, or spiced rum, such as Malahat Spiced Rum", "1/4 teaspoon freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place egg whites in the bowl of a stand mixer fitted with the whisk and beat at low speed until frothy, about 30 seconds. Increase speed to medium-high and beat until they are about the consistency of shaving cream, about 90 seconds. Reduce speed to medium. With mixer running, add half of sugar and beat until incorporated, about 30 seconds. Scrape whites into a large bowl. Do not wash stand mixer bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add egg yolks and remaining sugar to stand mixer bowl and beat at medium-high speed until pale yellow and ribbony, shutting off machine and scraping down sides of bowl with a rubber spatula as necessary, about 2 minutes total. Add milk and cream and mix at low speed to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour half of the yolk mixture into a small saucepan and sprinkle gelatin over the surface. Let stand 5 minutes. Meanwhile, add rum to remaining yolk mixture in stand mixer bowl and mix at low speed for 30 seconds to combine. Set saucepan over low heat and bring to just below a simmer, whisking constantly, until gelatin is fully dissolved; do not let boil. Remove from heat and let stand until cooled slightly, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With stand mixer running at low speed, slowly pour gelatin mixture into the yolk-rum mixture. Gently whisk in egg whites until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain mixture into a large measuring cup with a spout. Sprinkle in nutmeg and stir gently to combine. Carefully fill your molds with the eggnog. Refrigerate until set, about 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To remove jello shots from semi-spherical molds, carefully run a small spoon around the edge and slowly invert the mold to pop out the shot. If using square or straight-sided molds, run a butter knife around the edge and slowly invert the mold to pop out the shot. For other shapes or non-flexible molds, dip the bottom of the mold in warm water for 15 seconds, invert mold onto a baking sheet, and gently tap the mold to release the jello shot. Eggnog jello shots can be refrigerated for up to 3 days in an airtight container.</p>"}]}