{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150414-massa-ball-soup-daniel-gritzer-12.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "corn", "masa", "Mexican", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Masa Ball Soup (Mexican Corn Dumplings in Chicken Soup)", "link": "https://www.seriouseats.com/recipes/2015/04/masa-ball-soup-corn-matzo-recipe.html", "description": "A lot of people will tell you that punning is one of the lowest forms of humor. No matter&mdash;this soup, born of a silly pun, is tasty whether you like that kind of wordplay or not. Based on a classic matzo-ball soup recipe, this one uses masa harina for tamales in place of matzo meal for light and moist poached dumplings that have more than a little in common with tamales themselves. We serve them in chicken broth spiked with Mexican flavors, like jalapeño, lime juice, and cilantro.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Corn", "Gluten-Free", "Mexican", "Soups and Stews"], "recipeIngredient": ["4 large eggs, beaten", "1/4 cup seltzer or water", "1/4 cup lard, <a href=\"http://www.seriouseats.com/recipes/2015/04/schmaltz-rendered-chicken-fat-recipe.html\">schmaltz</a> (rendered chicken fat) or neutral oil like vegetable or canola oil (see note)", "1 cup <em>masa harina para tamales</em> (see note)", "1 teaspoon baking powder", "1 teaspoon kosher salt, plus more to taste", "Freshly ground black pepper", "3 quarts <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 medium carrot, cut into 1/4-inch dice", "1 rib celery, cut into 1/4-inch dice", "3/4 cup 1/4-inch diced butternut squash", "1/4 cup cilantro leaves and tender stems", "1 jalapeño or Serrano pepper, thinly sliced", "1 lime cut into wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine eggs with seltzer and schmaltz or oil. In a small bowl, stir together masa harina with baking powder, salt, and pepper. Add dry ingredients to wet ingredients and stir to combine thoroughly. Refrigerate uncovered for 30 minutes.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, divide stock evenly between two pots, season both to taste with salt, and bring to a simmer. Add diced carrots, celery, and squash to one pot and simmer until just tender. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using wet hands, and re-wetting hands as necessary, form masa mixture into 1- to 1 1/2-inch balls, and add to simmering pot of stock that doesn't have the vegetables (the mixture may feel a little soft, but should form balls easily enough). When all masa balls are added, cover and simmer until cooked through, 30 to 45 minutes. Cooked masa balls can be kept warm in their broth until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat both the vegetable pot and the masa-ball pot. Using a slotted spoon, transfer masa balls to serving bowls (you should have at least 3 per bowl); strain masa ball cooking broth with a fine mesh strainer into the pot with the remaining broth and vegetables. Ladle hot broth with vegetables into each bowl and garnish with cilantro and jalapeño or Serrano peppers. Serve, passing lime wedges at the table.</p>"}]}