{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150702-mexican-chicken-waffles-assembled-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "Mexican", "keywords": ["brunch", "chicken", "fried chicken", "mashup", "Mexican", "Southern", "waffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fully Loaded Mexican Fried Chicken With Green Chili&ndash;Corn Waffles", "link": "https://www.seriouseats.com/recipes/2015/07/mexican-fried-chicken-waffles-recipe.html", "description": "You won't miss your usual fried chicken and waffles once you try this Mexican-inspired version. Built with waffles that are flavored with corn and green chilis, and crunchy buttermilk-soaked and cornmeal-coated fried chicken, this mashup is going to blow you away. Guacamole, ancho-honey bacon, salsa roja, and a drizzle of Mexican crema top off  a creation that's fully loaded and totally insane.", "totalTime": "4 hours 30 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Deep Frying", "Easter", "Fried Chicken", "Mains", "Mexican", "Waffle"], "recipeIngredient": ["<strong>For the Fried Chicken:</strong>", "6 skin-on, <a href=\"http://www.seriouseats.com/2014/04/knife-skills-how-to-debone-a-chicken-thigh.html\">deboned</a> chicken thighs", "4 cups buttermilk", "1 tablespoon hot sauce", "Fresh juice of 2 limes", "1 tablespoon plus 2 teaspoons kosher salt, divided", "1 cup yellow cornmeal", "1/2 cup masa harina (see note)", "1/2 cup all-purpose flour", "1 teaspoon baking powder", "2 teaspoons ancho chili powder", "2 teaspoons ground cumin", "2 teaspoons paprika", "1 teaspoon garlic powder", "1 teaspoon granulated onion", "1 teaspoon freshly ground black pepper", "1 teaspoon granulated sugar", "Oil, for frying", "<strong>For the Waffles:</strong>", "2 cups buttermilk", "2 large eggs", "1/4 cup butter, melted and cooled ", "1 cup all-purpose flour", "1 cup masa harina (see note)", "1 cup yellow cornmeal", "2 tablespoons granulated sugar", "1 tablespoon baking powder", "1 teaspoon kosher salt", "1/2 cup diced <a href=\"http://www.seriouseats.com/2010/07/how-to-roast-peppers.html\">roasted</a> green poblano peppers (about 4 poblano peppers), or 7 ounces drained and diced canned green chilis", "Nonstick cooking spray", "<strong>For the Honey-Ancho Bacon:</strong>", "1 pound thick-cut bacon", "1/4 cup honey", "1 1/2 teaspoons ancho chili powder", "<strong>To Serve:</strong>", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/01/the-best-basic-guacamole-recipe.html\">The Best Basic Guacamole</a>", "3/4 cup <a href=\"http://www.seriouseats.com/recipes/2012/05/roasted-tomato-salsa.html\">homemade</a> or store-bought salsa roja", "1/2 cup Mexican crema or sour cream", "Fresh cilantro leaves and tender stems, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fried Chicken:</strong> Place chicken thighs in a large bowl and add buttermilk, hot sauce, lime juice, and 1 tablespoon kosher salt. Toss to coat, cover, and refrigerate for at least 1 hour and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a wide, shallow bowl, combine cornmeal, masa harina, flour, baking powder, ancho chili powder, cumin, paprika, garlic powder, granulated onion, black pepper, sugar, and 2 teaspoons salt and whisk until thoroughly mixed. Drain chicken, reserving buttermilk marinade in bowl. Working with one piece at a time, roll chicken in the dry mixture to coat. Return chicken to buttermilk marinade, then coat once more in dry mixture. Transfer chicken to a wire rack set above a rimmed baking sheet. Repeat with remaining chicken, then let stand 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large wok or cast iron skillet, heat 2 inches of oil to 375&deg;F. Working in batches and turning occasionally, fry the chicken until exterior is deep golden-brown and the internal temperature registers 150&deg;F on an instant-read thermometer, about 10 minutes. Oil temperature will drop when you add chicken, so adjust heat to maintain 350&deg;F frying temperature during cooking. Transfer fried chicken to a paper towel&ndash;lined plate to absorb excess oil. After draining, transfer chicken to a clean wire rack set over a clean baking sheet. Let cool to room temperature; set frying oil aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Waffles:</strong> In a large bowl, whisk together buttermilk, eggs, and melted butter. In a separate large bowl, whisk together flour, masa harina, cornmeal, sugar, baking powder, and salt. Pour the wet ingredients into the dry ingredients and stir until just combined. Fold in peppers and let stand for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the waffle iron to moderate setting and spray both sides with nonstick cooking spray. Pour batter to nearly fill the bottom half of the waffle iron and cook until golden-brown. Transfer to a rimmed baking sheet. Repeat until all of the waffles have been cooked, then tent with foil to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Honey-Ancho Bacon:</strong> Preheat the oven to 400&deg;F. Line a rimmed baking sheet with foil and arrange bacon in a single layer. In a small bowl, combine honey and ancho chili powder. Set aside. Bake bacon until beginning to crisp, about 10 minutes, then brush liberally with the honey-ancho mixture and continue to bake until crisp and caramelized, 5-10 minutes longer. Transfer bacon to a wire rack to cool. Reduce oven to 200&deg;F and transfer waffles to oven to keep warm until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Reheat frying oil to 375&deg;F and quickly fry chicken to reheat, about 2 minutes; transfer chicken to clean paper towels to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer waffles to plates. Spread guacamole on top, then arrange bacon over guacamole. Crown with fried chicken pieces. Spoon salsa roja on top and drizzle with crema. Garnish with cilantro and serve immediately.</p>"}]}