{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150429-tamales-with-red-chili-and-chicken-step-2-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "corn", "Mexican", "tamale"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tamales With Red Chili and Chicken Filling", "link": "https://www.seriouseats.com/recipes/2015/05/tamales-red-chili-chicken-recipe.html", "description": "A combo of guajillo, ancho, and arbol chiles gives this red chili sauce its earthy, smoky, and spicy complexity. It's folded into an airy and flavorful tamale dough, then steamed in corn husks until light and tender.", "totalTime": "3 hours", "recipeYield": "Makes approximately 30 tamales", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Corn", "Mexican", "Snacks"], "recipeIngredient": ["6 medium guajillo chiles, stemmed and seeded", "3 medium ancho chiles, stemmed and seeded", "3 chiles de arbol, stemmed and seeded", "4 medium cloves garlic, smashed and peeled", "1/2 teaspoon ground cumin", "1 tablespoon canola or vegetable oil", "2 cups <a href=\"http://www.seriouseats.com/2014/10/how-to-make-rich-flavorful-easy-chicken-stock.html\">homemade chicken stock</a> or low-sodium broth", "2 pounds boneless, skinless chicken thighs", "Kosher salt and freshly ground black pepper", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2015/05/basic-mexican-tamale-dough-recipe.html\">Basic Tamale Dough</a>", "3 dozen dried corn husks, soaked in water for at least 1 hour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine all the dried chiles in a large Dutch oven or cast iron skillet and cook over medium-high heat, flipping chiles frequently, until slightly darkened and aromatic, about 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chiles to a medium saucepan and cover with 4 cups water. Bring to a boil over high heat, then reduce heat to low and simmer until chiles are very soft, about 20 minutes. Strain chiles through a fine-mesh strainer set over a medium bowl. Transfer chilies and 1 cup of steeping liquid to the jar of a blender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add garlic and cumin and puree until smooth. Using a rubber spatula, push sauce through a fine-mesh strainer set over a medium bowl. Discard solids in strainer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large Dutch oven over medium-high heat until shimmering. Add red chili sauce and cook, stirring constantly, until thickened to the consistency of tomato paste, about 5 minutes. Stir in chicken stock and bring to a boil. Nestle chicken thighs in sauce, reduce heat to medium, cover, and cook until thickest part of thigh registers between 175-185&deg;F on an instant-read thermometer, about 20 minutes. Transfer chicken to plate and let stand until cool enough to handle, then shred by hand or using two forks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken is cooling, increase heat to medium-high and let sauce boil until slightly thickened. Remove from heat, let cool slightly, then season with salt and pepper. Add shredded chicken to sauce and stir to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one at a time, place a corn husk on work surface. Place 2-3 tablespoons of tamale dough on larger end of husk and spread into a rectangle approximately 1/4 inch thick, leaving a 1-inch border around edges of husk. Place a heaping tablespoon of filling in a line down center of dough. Fold over sides of husk so dough surrounds filling, then fold bottom of husk up and secure closed by tying a thin strip pulled from another husk around tamale. Repeat with remaining husks, dough, and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot with 1 inch of water and bring to a boil. Rest tamales upright in a steamer insert or on rack above the water level. Cover and steam until dough is cooked through and pulls away easily from the husk, about 1 hour. Remove tamales from steamer and let rest until dough firms up, about 15 minutes. Serve immediately or store in refrigerator for up to a week or freeze for up to four months. Defrost and reheat tamales in steamer until warmed through or in microwave on high for 2 minutes.</p>"}]}