{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150626-sous-vide-chicken-thigh-guide-23.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8571428571429", "ratingCount": "7"}, "name": "Crispy Sous-Vide Chicken Thighs With Mustard-Wine Pan Sauce", "link": "https://www.seriouseats.com/recipes/2015/07/crispy-sous-vide-chicken-thigh-recipe.html", "description": "Sous-vide techniques yield chicken with unparalleled levels of juiciness. Finish your chicken on the stovetop to crisp it up.", "totalTime": "2 hours and up", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Chicken", "Mains", "Sous Vide", "The Food Lab"], "recipeIngredient": ["4 bone-in, skin-on chicken thighs", "Kosher salt and freshly ground black pepper", "4 sprigs thyme or rosemary (optional)", "1 tablespoon canola, vegetable, or grapeseed oil", "1 small shallot, minced", "1 cup dry white wine", "1 tablespoon whole-grain mustard", "2 tablespoons unsalted butter", "1/2 teaspoon fresh juice from 1 lemon", "1 tablespoon minced fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a water bath to desired final temperature using a sous-vide cooker, according to the chart above. Season chicken generously with salt and pepper. Place chicken in a single layer in zipper-lock bags or vacuum bags and add thyme or rosemary sprigs, if using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using Zipper-Lock Bags:</strong> Remove air from zipper-lock bags by closing bags, leaving the last inch of the top unsealed. Slowly lower bagged chicken into the preheated water bath, sealing the bags completely just before they fully submerge. Cook according to the chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using Vacuum Bags:</strong> Seal according to manufacturer's instructions. Add bagged chicken to preheated water bath and cook according to the chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cooked, transfer bags to an ice bath and chill completely. Proceed to step 5 or store chicken in refrigerator for up to 4 days before finishing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Remove chicken from bags, reserving any gelled liquid, and pat thoroughly dry with paper towels. Place chicken on a cutting board, skin side down, and press firmly with your hands to flatten the skin against the board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oil in a nonstick or cast iron skillet over medium heat until shimmering. Gently lay the chicken in the skillet, skin side down, using your fingers or a set of tongs. Hold the chicken down flat in the pan with a flexible metal spatula or your fingers (be careful of splattering oil). Cook until golden brown and crisp, about 8 minutes, reducing heat if chicken starts to singe. Flip chicken and warm second side for about 2 minutes. Transfer chicken to a paper towel&ndash;lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pan to medium-high heat. Add shallot and cook, stirring, until softened, about 30 seconds. Add wine and cook until reduced by half, about 2 minutes. Stir in gelled chicken juices and mustard. Off heat, whisk in butter, lemon juice, and parsley. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve chicken immediately with pan sauce.</p>"}]}