{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150910-pan-con-tomate-kenji-05-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["bread", "easy", "garlic", "olive oil", "quick", "snack", "spanish", "tapas", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Pan con Tomate (Spanish-Style Grilled Bread With Tomato)", "link": "https://www.seriouseats.com/recipes/2015/09/pan-con-tomate-tomato-bread-spanish-recipe.html", "description": "<em>Pan con tomate</em> is just about as humble as tapas can get. It's got only five ingredients&mdash;bread, tomato, olive oil, garlic, and salt&mdash;and requires barely any actual cooking, yet it's precisely this simplicity and restraint that make it such a perfect end-of-summer dish. It takes just minutes, and, more than anything, it highlights the quality of your ingredients.", "totalTime": "7 minutes", "recipeYield": "Serves 6 to 8 as an appetizer or snack", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Garlic", "Snacks", "Spanish", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["2 large, ripe beefsteak tomatoes", "Kosher salt", "1 loaf ciabatta, split in half horizontally lengthwise, cut crosswise into 1 1/2-inch slices", "Extra-virgin olive oil", "2 medium cloves garlic, split in half", "Flaky sea salt, such as Maldon or fleur de sel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Split tomatoes in half horizontally. Place a box grater into a large bowl. Rub the cut faces of the tomatoes over the large holes of the box grater, using the flattened palm of your hand to move the tomatoes back and forth. The flesh should be grated off, while the skin remains intact in your hand. Discard the skin and season the tomato pulp with kosher salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust rack to 4 inches below broiler and preheat broiler to high. Place bread, cut side up, on a cutting board and drizzle with olive oil. Season with kosher salt. Place bread, cut side up, on a rack set in a tray or directly on the broiler rack and broil until crisp and starting to char around the edges, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove bread from oven and rub with the split garlic cloves. Spoon tomato mixture over bread. Drizzle with more extra-virgin olive oil and season with flaky sea salt. Serve immediately.</p>"}]}