{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/10/20151002-shrimp-grits-vicky-wasik-19.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["breakfast", "brunch", "grit", "mushroom", "shrimp", "Southern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "12"}, "name": "Shrimp and Gruyère Cheese Grits With Bacon and Mushrooms", "link": "https://www.seriouseats.com/recipes/2015/10/shrimp-and-grits-recipe.html", "description": "Shrimp and grits is a dish with so many renditions, the only thing you can really count on is that it contains shrimp...and grits. Often there's pork, sometimes mushrooms, and the amount of gravy can range from none to tons. This recipe features plump shrimp, seared mushrooms, crispy bacon, and rich cheese grits infused with layers and layers of flavor.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Easter", "Father's Day", "Mains", "Mother's Day", "Mushrooms", "Other Grains", "Shrimp", "Stovetop", "Valentine's Day"], "recipeIngredient": ["5 3/4 cups (1.4L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought chicken stock, divided", "1 pound (450g) large shrimp, shelled (shells reserved)", "3/4 pound (340g) mixed mushrooms, such as cremini, shiitake, and oyster, stemmed and thinly sliced (stems reserved)", "3/4 teaspoon (3g) kosher salt, plus more for seasoning", "1/4 teaspoon baking soda", "1/4 teaspoon cornstarch", "1 cup grits, preferably stone-ground (see note)", "1 cup grated Gruyère cheese (about 4 ounces; 115g)", "Freshly ground black pepper", "4 slices thick-cut bacon (about 4 ounces; 115g), diced", "Vegetable oil (if needed)", "1 medium shallot, minced", "2 medium cloves garlic, minced", "1/4 teaspoon cayenne pepper", "2 tablespoons (30g) unsalted butter, cubed", "1 tablespoon (15ml) fresh juice from 1 lemon", "2 tablespoons mixed minced fresh herbs, such as parsley, chives, and tarragon, plus more as garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, combine 5 cups (1.2L) stock with reserved shrimp shells and mushroom trimmings. Bring to a gentle simmer and cook for 20 minutes. Strain and return stock to saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine shrimp, 3/4 teaspoon (3g) salt, baking soda, and cornstarch in a medium bowl and toss to coat. Refrigerate for at least 30 minutes and up to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk grits into stock, set over medium-high heat, and bring to a simmer, whisking frequently. Lower heat to a bare simmer and cook, stirring and scraping bottom frequently with a wooden spoon, until grits are fully softened and cooked and have thickened into a spoonable porridge, about 1 hour. Stir in Gruyère cheese until fully melted. Season with salt and pepper and keep grits warm. (A piece of parchment pressed against the surface will help prevent a skin from forming.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat bacon over high heat until sizzling. Lower heat to medium and cook, stirring, until bacon has rendered its fat and become crisp, about 5 minutes. Using a slotted spoon, transfer bacon to paper towels to drain. You should have 1/4 cup rendered bacon fat in the skillet. Remove all but 1 tablespoon fat and reserve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to high heat and heat until very lightly smoking. Add shrimp and cook, stirring frequently, until lightly browned outside with only a faint trace of translucence remaining in the center of each shrimp. Transfer shrimp to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add reserved 3 tablespoons bacon fat to skillet, return to medium-high heat, and heat until shimmering. Add mushrooms and cook, stirring, until mushrooms release their liquid, about 3 minutes; scrape any browned bits from bottom of skillet. Continue cooking mushrooms, stirring frequently, until lightly browned, about 6 minutes; if pan becomes too dry, add vegetable oil, 1 tablespoon at a time, to keep it lubricated. Stir in shallot, garlic, and cayenne and cook until shallot and garlic are softened, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 3/4 cup (180ml) stock and scrape up any browned bits on bottom of pan. Stir in shrimp. Lower heat to medium-low and whisk in butter until fully melted and emulsified with the sauce. Remove from heat and whisk in lemon juice. Stir in herbs and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon grits into bowls and top with shrimp, mushrooms, and their gravy. Top with reserved crispy bacon and additional herbs for garnish, then serve right away.</p>"}]}