{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/11/20151124-enchilada-soup-recipe-kenji-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "chicken soup", "easy", "enchilada soup", "quick", "soup", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2", "ratingCount": "10"}, "name": "Easy Creamy Chicken Enchilada Soup", "link": "https://www.seriouseats.com/recipes/2015/11/chicken-enchilada-soup-recipe.html", "description": "This chicken enchilada soup features a rich and creamy broth, plenty of melted cheese, and the spicy, toasty flavor of chilies. Little nubs of sweet corn and black beans fill each spoonful, along with tender bits of shredded chicken. It's like drinking deliciously inauthentic liquid enchiladas&mdash;what more could you want on a cold night?", "totalTime": "40 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chicken", "Soups and Stews"], "recipeIngredient": ["2 whole dried guajillo chilies, stems and seeds removed (see note)", "2 whole dried ancho chilies, stems and seeds removed (see note)", "1 1/2 quarts (1.5 liters) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 split bone-in, skin-on chicken breast (about 1 pound; 450 grams)", "4 ounces (100 grams) cream cheese", "1 tablespoon (15 milliliters) distilled white vinegar (see note)", "1 tablespoon (15 milliliters) vegetable or canola oil", "1 medium yellow onion, finely diced (about 1 cup; 1/2 pound; 200 grams)", "Kosher salt and freshly ground black pepper", "3 medium cloves garlic, minced (about 1 tablespoon; 10 grams)", "2 ears of corn, kernels removed (about 1 1/2 cups; 250 grams)", "1 (14-ounce; 400-milliliter) can diced tomatoes", "1 (4.5-ounce; 125-milliliter) can chopped green chilies (see note)", "1 (14.5-ounce; 400-gram) can black beans, drained and rinsed", "1/2 pound (225 grams) grated pepper jack cheese", "1 tablespoon (15 milliliters) fresh juice from 1 lime", "1/2 cup picked fresh cilantro leaves (about 1 ounce; 30 grams), chopped", "Diced avocado, picked fresh cilantro leaves, sliced scallions, and grated cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place guajillo and ancho chilies on a microwave-safe plate and microwave on high at 15-second intervals until hot, pliable, and toasted-smelling, about 30 seconds total. Combine chicken stock, split chicken breast, and toasted chilies in a medium pot. Bring to a boil, reduce to lowest heat setting, cover, and cook until chicken breast is cooked through (an instant-read thermometer inserted into the center of the breast should register 155 to 160&deg;F) and chilies are tender, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken breast to a plate and set aside to cool. Transfer chilies to the jar of a blender and add 1 cup of stock. Blend, starting at lowest speed and gradually increasing to high speed, until chilies are completely puréed, about 2 minutes. Add cream cheese and blend until homogeneous, about 1 minute, adding more stock as necessary if the mixture is too thick. Whisk chili/cream cheese mixture back into remaining chicken stock. Whisk in vinegar and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cool enough to handle, shred meat into bite-sized pieces using your fingers or two forks. Set aside. Discard skin and bones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large saucepan over medium heat until shimmering. Add onion, season with salt and pepper, and cook, stirring, until softened but not browned, about 5 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add corn and cook, stirring, until heated through, about 3 minutes. Add tomatoes, chopped green chilies, black beans, and stock/chili/cream cheese mixture. Bring to a simmer over medium heat, stirring frequently. Stir in pepper jack cheese, shredded chicken, and lime juice. Season to taste with more salt and pepper. Stir in cilantro. Serve immediately with diced avocado, picked fresh cilantro leaves, sliced scallions, and grated cheese.</p>"}]}