{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150429-tamales-with-rajas-and-queso-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Mexican", "keywords": ["cheese", "corn", "masa", "Mexican", "pepper", "poblano", "tamale"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tamales With Rajas and Oaxacan Cheese", "link": "https://www.seriouseats.com/recipes/2015/05/tamales-rajas-oaxacan-cheese-recipe.html", "description": "This insanely delicious tamale filling is also one of the easiest&mdash;fruity roasted poblano peppers paired with strands of melted mild Oaxacan cheese. It's a minimal combo that delivers a lot of flavor within a light and tender tamale dough.", "totalTime": "2 hours", "recipeYield": "Makes approximately 30 tamales", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Corn", "Mexican", "Snacks"], "recipeIngredient": ["6 medium poblano peppers", "1 pound Oaxacan cheese, pulled into thin strips approximately 3-inches long", "1 recipe basic <a href=\"http://www.seriouseats.com/recipes/2015/05/basic-mexican-tamale-dough-recipe.html\">tamale dough</a>", "3 dozen dried corn husks, soaked in water for at least 1 hour", "<a href=\"http://www.seriouseats.com/recipes/2013/02/basic-salsa-verde-mexican-tomatillo-recipe.html\">Salsa verde</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast peppers directly over the flame of a gas stove, grill, or under a hot broiler, turning occasionally, until skin is completely charred and blackened all over. Place in a bowl, cover with plastic wrap, and let stand until cool enough to handle, 10 to 15 minutes. Using paper towels, rub off charred skin, then stem and seed poblanos. Slice peppers into strips 1/4 inch thick and 2 to 3 inches long.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one at a time, place a corn husk on work surface. Place 2-3 tablespoons of tamale dough on larger end of husk and spread into a rectangle approximately 1/4 inch thick, leaving a 1-inch border around edges of husk. Place a few strips of peppers and cheese down center of dough. Fold over sides of husk so dough surrounds filling, then fold bottom of husk up and secure closed by tying a thin strip pulled from another husk around tamale. Repeat with remaining husks, dough, and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot with 1 inch of water and bring to a boil. Rest tamales upright in a steamer insert or on rack above the water level. Cover and steam until dough is cooked through and pulls away easily from the husk, about 1 hour. Remove tamales from steamer and let rest until dough firms slightly, about 15 minutes. Serve immediately with salsa verde, or store in refrigerator for up to a week or freeze for up to four months. Defrost and reheat tamales in steamer until warmed through or in microwave on high for 2 minutes.</p>"}]}