{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150801-gluten-free-potato-bread-4.jpg", "author": {"@type": "Person", "name": "Ideas in Food"}, "recipeCuisine": "", "keywords": ["bread", "gluten free", "potato", "potato bread", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Gluten-Free Potato Bread", "link": "https://www.seriouseats.com/recipes/2015/08/gluten-free-flour-power-potato-bread-recipe.html", "description": "This week, Aki and Alex from Ideas in Food show you how to use three different blends of gluten-free flour to make classic potato bread, with a tender crumb that makes it the perfect vehicle for sandwiches.", "totalTime": "About 7 1/2 hours", "recipeYield": "Makes 1 loaf", "recipeCategory": ["Gluten-Free", "Potato", "Sandwiches", "Thanksgiving", "Yeast Bread"], "recipeIngredient": ["10 1/2 ounces (300 grams) russet potato (1 large or 2 medium), peeled, quartered, and thinly sliced", "1 1/2 cups (337.5 grams) water", "1 1/4 teaspoons (7.5 grams) fine sea salt", "1 cup (260 grams) whole milk", "2 teaspoons (6 grams) instant yeast", "1 tablespoon (12.5 grams) sugar", "6 large eggs", "4 2/3 cups (600 grams) <a href=\"http://www.seriouseats.com/recipes/2015/08/all-purpose-gluten-free-flour.html\">Gluten-Free Flour Blend</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the potatoes, water, and 1/4 teaspoon of the salt in a medium saucepan and bring to a simmer over medium heat, then turn the heat down and cook the potatoes until fork-tender, about 15 minutes. Transfer the potatoes and their liquid to a bowl and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining 1 teaspoon salt, the milk, yeast, and sugar to the potatoes and stir to combine. Put the potato mixture and eggs in a blender. Turn the blender on low, gradually increase the speed to medium-high, and puree until the mixture is smooth, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the potato mixture to the bowl of a stand mixer fitted with the paddle attachment (or use a hand mixer), add the flour, and mix on low until all of the potato mixture has been absorbed by the flour. Increase the speed to medium-high and beat until the dough appears smooth and elastic, about 30 seconds. Use a rubber spatula to scrape the dough into a clean bowl. Cover with plastic wrap and let it rise for 2 1/2 hours, until not quite doubled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease a 13- by 4- by 4-inch pain-de-mie or Pullman loaf pan and lid. Use a rubber spatula to stir the dough together and then transfer it to the prepared loaf pan. Cover loosely with plastic wrap and let rise until it reaches the top of the pan, about 2 hours. Meanwhile, 1 hour before baking, preheat oven to 400&deg;F (200&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the plastic wrap from the pan and slide the lid into place. Bake the bread for 45 minutes. Turn the heat down to 350&deg;F (180&deg;C) and bake for 30 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat down to 300&deg;F (150&deg;C). Remove the top of the pan and bake the bread uncovered for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bread from the oven and invert it onto a rack set over a baking sheet. Lift off the pan and bake the bread for 10 more minutes. The internal temperature should be 210&deg; to 212&deg;F (99&deg; to 100&deg;C). Turn off the oven, open the door, and let the bread cool on the rack for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the bread from the oven, transfer to a rack, and let cool to room temperature completely before cutting. Well-wrapped, the bread will keep at cool room temperature for up to a week.</p>"}]}