{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/11/20151124-turkey-carnitas-recipe-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["carnitas", "low carb", "taco", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8571428571429", "ratingCount": "7"}, "name": "Leftover Turkey \"Carnitas\"", "link": "https://www.seriouseats.com/recipes/2015/11/leftover-thanksgiving-turkey-carnitas-recipe.html", "description": "Here's all you need to know: You can transform your leftover Thanksgiving turkey into wonderfully crispy and juicy shreds that are a dead ringer for carnitas, minus all the lard and time involved. This is a technique I discovered by accident a few years back, when I decided to see what would happen if I fried up the shredded meat I'd just picked off the turkey carcass. Extreme deliciousness&mdash;that's what happened.", "totalTime": "1 hour 15 minutes", "recipeYield": "Varies depending on quantity of leftovers", "recipeCategory": ["The Food Lab", "Turkey"], "recipeIngredient": ["Any amount leftover cooked dark-meat turkey (thighs and drumsticks) (see note)", "1 orange, preferably sour, per pound (450 grams) of leftover turkey meat (see note)", "1 medium onion (about 6 ounces; 175 grams) per pound (450 grams) of leftover turkey meat", "2 bay leaves per pound (450 grams) of leftover turkey meat", "2 tablespoons vegetable oil, chicken fat, turkey fat, or duck fat per pound (450 grams) of leftover turkey meat", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine turkey (with bones if available), orange, onion, and bay leaf in a pot that fits them snugly. Add enough water to cover halfway. Cover and bring to a boil, then reduce to a bare simmer and cook until turkey is fall-off-the-bone tender, 45 minutes to 1 hour. Discard orange, onion, and bay leaves and drain turkey well. Shred turkey and discard bones.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil or fat in a cast iron or nonstick skillet over medium-high heat until shimmering. Add turkey and spread into an even layer. Cook, without moving, until meat is well browned and crisp on the bottom, about 5 minutes. Stir turkey to incorporate the crisp bits and introduce new soft bits to the bottom. Continue this process until the turkey is as crisp as you like it (I like mine quite crisp). Season with salt. Turkey carnitas can be used in place of pork carnitas in any recipe. Try them in a taco with onion, cilantro, and lime juice; on top of nachos; or in a burrito or quesadilla.</p>"}]}