{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150323-pan-fried-pork-bao-shao-zhong-2.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "bun", "Chinese", "dumpling", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Sheng Jian Bao (Pan-Fried Pork Soup Dumplings)", "link": "https://www.seriouseats.com/recipes/2015/04/sheng-jian-bao-pan-fried-pork-soup-dumplings-recipe.html", "description": "Xiao long bao, Shanghai-style soup dumplings, have become legendary for good reason, but so far their doughier pan-fried cousins called sheng jian bao remain much less well-known here in the States. If you love XLB, you need to try sheng jian bao. Here's how to make them, from the flavorful pork filling to the dough wrapper and combo pan-frying and steaming method.", "totalTime": "1 hour", "recipeYield": "Makes about 24 dumplings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Pork", "Sides", "Snacks"], "recipeIngredient": ["<strong>For the Pork Filling:</strong>", "1 cup shredded Napa cabbage (from about 2 or 3 leaves)", "1 teaspoon kosher salt", "3/4 pound pork belly, cut into 1-inch cubes", "2 dried shiitake mushrooms, soaked in boiling water for 1 hour, then drained, squeezed dry, and finely chopped", "1 scallion, finely chopped", "2 medium cloves garlic, minced", "2 teaspoons cornstarch", "1 teaspoon Shaoxing wine", "1 teaspoon toasted sesame oil", "1 teaspoon vegetable, peanut, or canola oil", "1/4 teaspoon sugar", "1/4 teaspoon ground white pepper", "<strong>For the Dough:</strong>", "1 cup plus 6 tablespoons all-purpose flour, plus more for dusting", "2 tablespoons cornstarch", "1/4 teaspoon kosher salt", "1 tablespoon sugar", "1 1/2 teaspoon baking powder", "1 1/4 teaspoon dry yeast", "1/2 cup lowfat or whole milk", "Vegetable, peanut, or canola oil, for greasing and cooking"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pork Filling:</strong> Place Napa cabbage in a bowl, add salt, and mix until slightly wilted, about 1 minute. Let stand at room temperature for 10 minutes. Squeeze cabbage of excess water and return to bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pork belly in a food processor and process until finely ground. Add Napa cabbage, shiitake mushrooms, scallion, garlic, and pulse 2 times until incorporated. Transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cornstarch, Shaoxing wine, sesame oil, vegetable oil, table salt, sugar, and white pepper powder to the ground pork. Mix well and set aside in the refrigerator. The filling can be made a day ahead.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> In a large bowl, mix flour, cornstarch, salt, sugar, baking powder, and yeast together. Warm milk in a microwave, about 30 seconds. Stir half of the milk into the flour, combine with a spatula, then stir in the remaining milk until thoroughly combined. Knead until dough comes together, about 5 to 10 seconds. Transfer dough to a clean work surface and knead until the dough is smooth. Grease a bowl with oil, transfer the dough to the bowl, and cover with plastic wrapper. Let rest for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble the Buns:</strong> Transfer dough to a lightly floured work surface. Cut dough into 4 equal parts. Roll out one portion of dough into a 6-inch snake, and cut into 6 equal pieces. Roll each piece of dough into a ball, flatten it with the palm of your hand, and roll the dough out with a small rolling pin until it is about 3 1/2 inches in diameter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place about 1 tablespoon of the pork filling in the center of the dough round. Fold the dough up and around the filling, pleating and pinching around the top until sealed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place finished buns on a lightly greased plate, cover plate loosely with plastic wrap, and let rest at room temperature for 10 minutes. The buns can be frozen at this point by spreading them on a parchment-lined baking sheet dusted with flour and freezing; transfer frozen buns to a zipper-lock bag for long-term freezer storage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook fresh buns, heat 1 teaspoon oil in a non-stick skillet over medium-high heat until shimmering. Place the buns in the pan, leaving 1/2 inch  of space between each bun (work in batches if necessary). Pan-fry the buns until they start to turn lightly golden brown on the bottom, about 25 seconds. Pour 1/4 cup water into the skillet and cover immediately. Cook until the water completely evaporates, about 5 minutes. Turn off the heat and leave the lid on the pan until the sizzling stops, about 30 seconds. Remove the lid, plate the buns, and serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To cook frozen buns, heat 1 teaspoon oil in a non-stick skillet over medium-high heat until shimmering. Place the frozen buns in the pan, leaving 1/2 inch  of space between each bun (work in batches if necessary). Pan-fry the buns until they start to turn lightly golden brown on the bottom, about 25 seconds. Pour 1/4 cup water into the skillet and cover immediately. Cook until the water completely evaporates, about 7 minutes. Turn off the heat and leave the lid on the pan until the sizzling stops, about 30 seconds. Remove the lid, plate the buns, and serve immediately. </p>"}]}