{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150206-caponata-eggplant-sicilian-pine-nut-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["caponata", "easy", "eggplant", "Italy", "quick", "Siciliy", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5714285714286", "ratingCount": "7"}, "name": "Sicilian Eggplant and Pine Nut Caponata", "link": "https://www.seriouseats.com/recipes/2015/02/sicilian-eggplant-pinenut-caponata-vegan-recipe.html", "description": "Caponata, the Sicilian dish of eggplant and other vegetables sautéed in a sweet and sour sauce can be <em>shockingly</em> flavorful the first time you try it. And I'm not using the word shockingly lightly here. Packed with extra-virgin olive oil, raisins, pine nuts, herbs, vinegar, sugar, and a slew of other ingredients, it's the kind of dish you have to recalibrate your whole mouth for in order to really appreciate it. But once that recalibration is done, man oh man is it great stuff.", "totalTime": "30 minutes", "recipeYield": "Makes about 1 quart, serving 4 to 6 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Eggplant", "Mains", "Quick Dinners", "Sides", "Soups and Stews", "Vegan", "Vegetarian"], "recipeIngredient": ["1 cup pine nuts", "1/2 cup extra-virgin olive oil, plus more for serving", "1 small globe eggplant (about 1 pound), cut into 3/4-inch dice", "Kosher salt and freshly ground black pepper", "4 scallions, white parts only, sliced into 1/4-inch segments", "1 rib celery, finely diced", "1 red bell pepper, cut into 1/2-inch dice", "4 medium cloves garlic, thinly sliced", "2 tablespoons minced fresh mint leaves, plus more for garnish", "2 tablespoons minced fresh parsley leaves, plus more for garnish", "2 tablespoons tomato paste", "1/2 teaspoon ground cinnamon", "1/2 cup raisins", "2 tablespoons capers, drained and rinsed", "2 tablespoons sugar", "2 tablespoons red wine vinegar", "2 tablespoons balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss pine nuts with 1 teaspoon olive oil and transfer to a large plate. Toast by microwaving on high power for 2 minutes. Continue microwaving at 30 second intervals until golden brown and nutty, 3 to 8 minutes total. Alternatively, toast in a toaster oven set at 375&deg;F until golden brown and nutty, about 15 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 4 tablespoons oil in a large non-stick or cast iron skillet over high heat until shimmering. Add eggplant and cook, tossing occasionally, until completely softened and browned in spots (eggplant will initially absorb all of the oil then slowly release some of it), about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push eggplant to the side of the skillet and add 2 more tablespoons oil to the center. Add scallions, celery, bell pepper, and garlic and toss to combine with the eggplant. Cook, stirring and tossing frequently, until vegetables are softened and aromatic, about 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add reserved pine nuts, mint, parsley, tomato paste, ground cinnamon, raisins, capers, sugar, red wine vinegar, and balsamic vinegar and toss to combine. Drizzle in remaining olive oil and bring to a simmer, adding water a tablespoon at a time as necessary until caponata has a sauce-like consistency that is loose, but doesn't run freely over a plate. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let mixture cool to room temperature or refrigerate in a sealed container for up to a week. Serve at room temperature garnished with extra mint leaves and a drizzle of olive oil if desired. Serve with toasted bread or pasta.</p>"}]}