{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150329-Baked-Strawberry-Chipotle-Chicken-Wings-Avocado-Blue-Cheese-Plated-Morgan-Eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["chicken", "chicken wing", "game day", "party", "strawberry", "wing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Oven-Baked Strawberry-Chipotle Wings With Avocado-Blue Cheese Dip", "link": "https://www.seriouseats.com/recipes/2015/04/strawberry-chipotle-baked-chicken-wings-avocado-dip-recipe.html", "description": "A simple oven-frying technique using baking powder gives these wings all of the traditional crispness of deep-fried ones with far less mess. Juicy strawberries bring sweetness to the sauce, while chipotle peppers round it out with heat and smokiness. Paired with creamy avocado-blue cheese dip and sprinkled with poppy seeds, there's no shortage of flavor or texture here!", "totalTime": "8 hours 45 minutes", "recipeYield": "4 servings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Sides", "Snacks", "Strawberry"], "recipeIngredient": ["2 pounds chicken wings, cut into drumettes and flats", "2 teaspoons baking powder", "1 teaspoons kosher salt, plus more as needed", "8 ounces fresh strawberries, hulled and halved", "1 tablespoon balsamic or apple cider vinegar", "2 medium cloves garlic, minced", "1/2 teaspoon minced fresh ginger", "2 tablespoons light brown sugar", "1 chipotle pepper in adobo, minced, plus 1 tablespoon adobo sauce from the can", "1/2 teaspoon onion powder", "1/8 to 1/4 teaspoon cayenne pepper (depending on taste)", "Water or chicken stock, as needed", "1 Haas avocado, halved and pitted", "1/2 cup sour cream", "1/2 cup crumbled blue cheese, plus more for garnish", "1 tablespoon fresh juice from 1 lemon", "1 tablespoon milk", "1 1/2 tablespoons poppy seeds", "Fresh cilantro leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a rack with nonstick cooking spray and set on a foil-lined rimmed baking sheet. Dry chicken wings with paper towels. In a large zipper-lock bag, toss wings with baking powder and 1 teaspoon salt until evenly coated, then arrange wings in an even layer on the rack. Refrigerate wings, uncovered, overnight or up to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450&deg;F and set the oven rack in the upper-middle position. Bake wings on the rack set over the baking sheet for 20 minutes, then flip and continue to bake until cooked through and crisp, about 20 minutes longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a saucepan over medium heat, combine strawberries, vinegar, garlic, ginger, and light brown sugar and cook until strawberries are softened and release their juices, about 10 minutes. Mash strawberries with a wooden spoon and stir in minced chipotle, adobo sauce, onion powder, and cayenne pepper (1/8 or 1/4 teaspoon depending on your heat preference). Season with salt. Reduce heat to low and cook, stirring occasionally, until sauce is thick enough to coat a spoon, about 5 minutes. If sauce becomes too thick and candy-like, stir in water or chicken stock to return to desired consistency. If any chunks of strawberry remain, transfer to a blender or food processor and pulse until smooth. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a blender or food processor, combine avocado, sour cream, blue cheese, lemon juice, and milk. Season with salt (taste first, as blue cheese is salty). Pulse until well-combined, transfer to a bowl, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the baked wings in a large bowl and toss with the strawberry sauce until evenly coated. Transfer to a plate and sprinkle with poppy seeds. Garnish with cilantro and serve with avocado blue cheese dip.</p>"}]}