{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150215-ajiaco-negro-vegan-colombian-soup-recipe-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["Colombia", "easy", "potato", "quick", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Quick and Easy Dairy- and Fat-Free Colombian Vegetable Soup (Ajiaco Negro)", "link": "https://www.seriouseats.com/recipes/2015/02/quick-and-easy-dairy-and-fat-free-colombian-vegetable-soup-recipe-vegan.html", "description": "This quick and easy dairy-free, fat-free Colombian vegetable soup comes out creamy and comforting thanks to the natural thickening power of potatoes. No added cream, milk, or butter means that the soup shines with vegetable flavor from peas, fava beans, carrots, and carrots. The stovetop version takes about 45 minutes of hands-off work while the pressure cooker can cut that time down to under half an hour.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Dairy-Free", "Mains", "Potato", "Pressure Cooker", "Soups and Stews", "Vegan", "Vegetarian"], "recipeIngredient": ["2 large russet potatoes, peeled and cut into 3/4-inch dice (about 1 1/4 pounds)", "1 medium carrot, peeled and cut into medium dice (about 5 ounces)", "1 cup fresh or frozen peas, divided", "1 1/2 cups cooked dried or canned fava beans (see note), or 1 1/2 cups raw fresh fava beans, divided", "1 large ear yellow corn, shucked and cut into 6 pieces crosswise", "1 1/2 quarts <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">homemade vegetable stock</a> or an equivalent amount made with <a href=\"http://www.amazon.com/Better-Than-Bouillion-Vegetable-Base/dp/B00016LA9S/?tag=serieats-20\" target=\"_blank\">Better Than Bouillon vegetable base</a> or <a href=\"http://www.amazon.com/Better-Than-Bouillon-Chicken-Base/dp/B004XM4UP2/?tag=serieats-20\" target=\"_blank\">No Chicken Base</a> (see note)", "Kosher salt and freshly ground black pepper", "1/4 cup minced fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine potatoes, carrots, half of peas, half of favas, corn, and vegetable stock (or water with stock base) in a pressure cooker. Bring to high pressure and cook for 15 minutes. Release pressure by running a stovetop pressure cooker under cold tap water or by using the quick steam release on an electric pressure cooker.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring soup to a simmer. Using a potato masher or a stick whisk, mash vegetables until broth is thickened but some large pieces still remain. Add remaining fresh peas and fava beans and simmer until cooked through, about 5 minutes. Season to taste with salt and pepper and serve, making sure to include one piece of corn in each bowl (along with a fork to pick it up), and sprinkline each serving with cilantro.</p>"}]}