{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/05/20150501-polenta-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["corn", "cornmeal", "grain", "Italian", "northern italian", "polenta", "porridge"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4545454545455", "ratingCount": "11"}, "name": "Smooth and Creamy Polenta", "link": "https://www.seriouseats.com/recipes/2015/05/smooth-creamy-polenta-recipe.html", "description": "Forget all the rules you've heard about polenta. What's really important is using the right ratio of liquid to cornmeal and cooking the polenta long enough for the cornmeal to properly hydrate.", "totalTime": "1 hour (or 35 minutes plus overnight soak, if using presoaking method)", "recipeYield": "Serves 4 to 6 as a side", "recipeCategory": ["Corn", "Dairy-Free", "Gluten-Free", "Italian", "Other Grains", "Sides", "Stovetop", "Vegetarian"], "recipeIngredient": ["5 cups (1.2L) water, milk, or <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">chicken stock</a> or <a href=\"https://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable stock</a> (see note)", "1 cup (5 ounces; 140g) medium or coarse cornmeal/polenta (see note)", "Kosher salt", "2 tablespoons (1 ounce; 30g) unsalted butter or extra-virgin olive oil "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using the Presoaking Method:</strong> Combine water with cornmeal in a large mixing bowl and let stand, covered, at room temperature overnight. When ready to cook, scrape soaked cornmeal and water into a large saucier or saucepan and set over high heat. Continue with step 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using the Standard Method:</strong> Add water, milk, or stock to a large saucier or saucepan and set over high heat. Sprinkle in cornmeal while whisking (water does not have to be boiling).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil, stirring frequently. Let boil, stirring frequently, until polenta thickens enough that it starts to spit. Lower heat immediately to prevent spitting and continue to cook, stirring frequently with a spoon or silicone spatula and scraping bottom to prevent scorching, until polenta becomes thick and pulls away from side of saucepan, about 30 minutes for presoaked cornmeal and 50 minutes for dry cornmeal. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in butter or olive oil, using either a spoon, a silicone spatula, or a whisk. If polenta forms lumps, beat vigorously with a stiff whisk to remove. If polenta becomes too firm or begins to set, add a small amount of water, stock, or milk and beat in with a whisk until liquid is fully incorporated and no lumps remain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve right away with accompaniment of your choice, or scrape into a vessel and chill until set, then cut into pieces for grilling, searing, or frying.</p>"}]}