{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/04/chiliverde.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["chicken", "chile verde", "chili", "easy", "green chili", "low carb", "Mexican", "quick", "tomatillo"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7954545454545", "ratingCount": "44"}, "name": "Easy Pressure Cooker Green Chili With Chicken", "link": "https://www.seriouseats.com/recipes/2015/04/pressure-cooker-fast-and-easy-chicken-chile-verde-recipe.html", "description": "<p>It's a tough call, but I'm almost inclined to say that I like green chili made with tomatillos and a mix of fresh green peppers even more than I like a bowl of Texas red. This version is packed with moist, tender chunks of braised chicken thighs in a balanced sauce that is rich with umami depth and green chili flavor, but still plenty bright and fresh. And the best part: You can make it in under half an hour. All it takes is a pressure cooker.</p>", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chicken", "Chili", "Dairy-Free", "Gluten-Free", "Mains", "Mexican", "Pressure Cooker", "Quick Dinners", "The Food Lab"], "recipeIngredient": ["3 pounds bone-in skin-on chicken thighs and drumsticks", "3/4 pound tomatillos, quartered, husks discarded (about 4 tomatillos)", "1 pound poblano peppers, roughly chopped, seeds and stems discarded (about 3 peppers)", "6 ounces Anaheim or Cubanelle peppers, roughly chopped, seeds and stems discarded (about 2 peppers)", "2 Serrano or jalapeño chilies, roughly chopped, stems discarded", "10 ounces white onion, roughly chopped (about 1 medium)", "6 medium cloves garlic, peeled", "1 tablespoon whole cumin seed, toasted and ground", "Kosher salt", "1/2 cup loosely packed fresh cilantro leaves and fine stems, plus more for garnish", "1 tablespoon Asian fish sauce, such as <dorado id=\"red-boat-fish-sauce\" class=\"text\">Red Boat</dorado>", "Fresh corn tortillas and lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chicken, tomatillos, poblano peppers, Anaheim peppers, Serrano peppers, onion, garlic, cumin, and a big pinch of salt in a pressure cooker. Heat over high heat until gently sizzling, then seal pressure cooker, bring to high pressure, and cook for 15 minutes. Release pressure.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, transfer chicken pieces to a bowl and set aside. Add cilantro and fish sauce to remaining contents of pressure cooker. Blend with a hand blender or in a standing blender and season to taste with salt. Return chicken to sauce, discarding skin and bones and shredding if desired. Transfer to a serving platter, garnish with chopped cilantro, and serve immediately with tortillas and lime wedges.</p>"}]}