{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150602-sous-vide-chicken-salad-a-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "chicken salad", "easy", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "The Best Classic Chicken Salad", "link": "https://www.seriouseats.com/recipes/2015/06/the-best-classic-chicken-salad-recipe.html", "description": "The sous-vide cooker is the best way to guarantee the juiciest, tenderest, most flavor-packed chicken salad. Adding aromatics directly to the cooking bag guarantees more flavorful results.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Chicken Salad", "Salads", "Sous Vide", "The Food Lab"], "recipeIngredient": ["1 3/4 pounds whole bone-in, skin-on split chicken breast halves (2 to 3 breast halves)", "Kosher salt and freshly ground black pepper", "2 whole lemons", "4 whole sprigs of tarragon plus 1 tablespoon minced fresh tarragon leaves, divided", "1/4 cup mayonnaise, preferably <a href=\"http://www.seriouseats.com/recipes/2011/10/two-minute-mayonnaise.html\">homemade</a>, plus more to taste", "1 tablespoon Dijon mustard, plus more to taste", "1 tablespoon minced fresh parsley leaves", "1 tablespoon minced fresh chives", "1/2 cup finely diced red onion (about 1/2 medium onion)", "1/2 cup finely diced celery (about 2 stalks)", "1 medium clove garlic, minced (about 1 teaspoon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season chicken generously with salt and pepper. Slice 1 lemon into 1/8- to 1/4-inch slices. Place chicken in zipper-lock bags or vacuum bags and add whole tarragon sprigs and lemon slices. Remove air from zipper-lock bags by closing the bags, leaving the last inch of the top un-sealed. Slowly lower into a pot of water, sealing the bag completely just before it fully submerges. If using a vacuum bag, seal according to manufacturer instructions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Cooking in a Sous-Vide Precision Cooker</strong>: Preheat a sous-vide cooker to 150&deg;F. Add chicken and cook for at least 1 hour and up to 4. Transfer to an ice bath and let chill for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Cooking in a Cooler</strong>: Heat 2 quarts of water in a large, heavy-bottomed saucepot or Dutch oven over medium-high heat until it registers 155&deg;F on an instant-read thermometer. Transfer to a small cooler, add chicken, and seal cooler. Cook for at least 1 hour and up to 4, topping up with boiling water as necessary to maintain temperature of 150&deg;F. Transfer to an ice bath and let chill for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons juice and 1 teaspoon zest from remaining lemon to a large bowl. Add mayonnaise, mustard, minced tarragon leaves, parsley, chives, red onion, celery, and garlic and mix with a rubber spatula. Keep refrigerated until chicken is ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cooked, remove from bags and discard tarragon stems and lemon slices. Remove skin and bones from chicken and discard. Cut meat into 1/2-inch cubes and add to bowl with mayonnaise. Fold gently to combine. Season to taste with salt and pepper. Add more mayonnaise, mustard, or lemon juice to taste if desired. Serve with lettuce or in sandwiches.</p>"}]}