{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/10/The-Food-Lab-Chapter-02.02-Pasta-147.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["baked ziti", "casserole", "comfort", "Italian", "italian american", "pasta", "red sauce", "the food lab book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2", "ratingCount": "10"}, "name": "The Food Lab's No-Boil Baked Ziti", "link": "https://www.seriouseats.com/recipes/2015/10/food-lab-no-boil-baked-ziti-recipe.html", "description": "Baked ziti is the dish I make at the annual ski retreat that my friends and I take each year in New England. There are few pasta bakes that are easier to put together yet produce such ridiculously good results, particularly when it's snowing outside and you've got a whole cabinful of friends to feed. The noodles get tossed with a pink mixture of tomato sauce, cream, and ricotta cheese, with a couple of eggs thrown in to lend structure to the casserole as it cooks. I also like to toss cubes of mozzarella cheese together with the pasta to form gooey, stretchy pockets. I top the whole thing with some more marinara, more cubes of mozzarella, and a grating of Parmesan.", "totalTime": null, "recipeYield": "Serves 6 to 8", "recipeCategory": ["Italian", "Mains", "Pasta", "The Food Lab", "Vegetarian"], "recipeIngredient": ["1 pound ziti, penne, or other thick tubular pasta", "6 cups <a href=\"http://www.seriouseats.com/recipes/2014/09/easy-italian-amercian-red-sauce-recipe.html\">homemade</a> or high-quality store-bought red sauce (such as Rao's)", "12 ounces whole-milk <a href=\"http://www.seriouseats.com/recipes/2010/02/how-to-make-fresh-ricotta-fast-easy-homemade-cheese-the-food-lab-recipe.html\">homemade</a> or high-quality ricotta cheese (see note)", "3 ounces Parmigiano-Reggiano, finely grated (about 11⁄2 cups)", "2 large eggs, beaten", "1 cup heavy cream", "3 tablespoons minced fresh parsley", "3 tablespoons minced fresh basil", "Kosher salt and freshly ground black pepper", "1 pound whole-milk mozzarella cheese, cut into rough 1/4-inch cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to the middle position and preheat the oven to 400&deg;F. Place the ziti in a large bowl and cover with hot salted water by 3 or 4 inches. Let sit at room temperature for 30 minutes, stirring it after the first 5 minutes to prevent sticking. Drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour half of the marinara into a large pot, add the ricotta, half of the Par- migiano, the eggs, the cream, and half of the parsley and basil, and stir to combine. Season to taste with salt and pepper. Add the soaked ziti, along with half of the cheese cubes and stir until well combined. Transfer to a 13- by 9-inch baking dish and top with the remaining marinara sauce and mozzarella.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover tightly with aluminum foil and bake for 45 minutes. Remove the foil and bake until the cheese is beginning to brown, about 15 minutes longer. Remove from the oven and sprinkle with the remaining Parmi- giano, then let cool for 10 minutes. Sprinkle with the remaining parsley and basil and serve.</p>"}]}