{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/05/20150527-wedge-salad-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["cheese", "salad", "summer", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Fully Loaded Iceberg Wedge Salad", "link": "https://www.seriouseats.com/recipes/2015/06/wedge-salad-iceberg-blue-cheese-bacon-recipe.html", "description": "Come summertime, most of us want foods that somehow manage to satisfy while still seeming light and refreshing. No dish better delivers on both counts than the classic iceberg wedge salad, a retro creation that is all about simplicity. And yet, to be the celebration of flavor and texture that it should be, we need to make sure to cut the toppings small and play up contrast in flavor and texture wherever possible.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Cheese", "Easter", "Pork", "Salads", "Summer", "Tomato"], "recipeIngredient": ["2 small tomatoes (about 8 ounces total), diced", "Kosher salt", "1 small red onion, minced", "White wine vinegar, for soaking onion (see note)", "4 ounces sliced bacon, cut into 1/2-inch pieces", "2 ounces (about 1/2 cup) fresh bread crumbs", "Freshly ground black pepper", "1 head iceberg lettuce, outer leaves discarded, quartered through core so that each quarter holds together", "<a href=\"http://www.seriouseats.com/recipes/2017/06/buttermilk-blue-cheese-dressing-recipe.html\">Buttermilk Blue Cheese Dressing</a> (you may not need the full recipe)", "Minced chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a fine-mesh strainer over a bowl and add diced tomatoes. Sprinkle liberally with salt and toss to combine. Place onion in a small bowl and pour enough vinegar on top to cover. Let tomatoes and onion stand while you prep the other ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet, cook bacon over medium-high heat, stirring occasionally, until crisped, about 5 minutes. Using a slotted spoon, transfer to a paper towel&ndash;lined plate to drain. You should have about 2 tablespoons (30ml) rendered fat in the skillet. Add bread crumbs and cook over medium heat, stirring frequently, until browned and crisp, 3 to 4 minutes. Transfer to a paper towel&ndash;lined plate to drain and season liberally with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange iceberg wedges on plates and spoon dressing over each. Drain quick-pickled onions and sprinkle all over salads, along with drained tomatoes (discard any extracted liquid), bacon, toasted bread crumbs, and chives. Serve.</p>"}]}