{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150615-sweet-salty-stout-marshmallow-bars-double-chocolate-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["baking", "beer", "chocolate", "dessert", "marshmallow", "potato chip", "pretzel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweet and Salty Stout Marshmallow Bars With Pretzels, Potato Chips, and Chocolate", "link": "https://www.seriouseats.com/recipes/2015/07/stout-chocolate-pretzel-marshmallow-bars-recipe.html", "description": "The Rice Krispie treats of your childhood get a grown-up makeover with a homemade chocolate-stout marshmallow. Pretzels and potato chips replace the rice cereal, and a boozy chocolate drizzle finishes off these sweet, salty, and chewy bars.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes 12 bars", "recipeCategory": ["Brownies and Bars", "Candy", "Chocolate", "Christmas", "Desserts", "Snacks", "Thanksgiving"], "recipeIngredient": ["1 1/4 cup double chocolate stout, divided", "Nonstick cooking spray", "3 packets unflavored gelatin (.75 oz total)", "1 1/2 cups granulated sugar", "1 cup light corn syrup", "1/4 teaspoon kosher salt", "1 teaspoon pure vanilla extract", "2 tablespoons unsalted butter, melted", "3 cups ruffled potato chips, crushed, or more if desired (see note)", "3 cups miniature pretzels, crushed, or more if desired (see note)", "1/2 cup milk chocolate, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour stout into a medium bowl, whisk, then refrigerate until chilled and flat, at least 1 hour and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spray a 9 x 13-inch baking pan with nonstick cooking spray and line the bottom with parchment paper, allowing the parchment paper ends to overhang the sides, then spray again. Pour 1/2 cup of the flat stout into a large bowl or bowl of a stand mixer and sprinkle with the gelatin. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large (6-quart or more) saucepan, combine sugar, corn syrup, salt, and 1/2 cup of the stout. Set over low heat and stir until the sugar is completely dissolved. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to medium-high and bring to a boil (it will bubble a lot, filling about 3/4 of the saucepan). Continue to boil until the mixture reaches the soft ball stage, 240&deg;F on an instant-read or candy thermometer. Quickly remove the pot from heat and pour the mixture over the gelatin and stout. Beat the marshmallow mixture with a hand mixer or whisk attachment until it has tripled in size, about 10 minutes. When it is finished, the marshmallow should be very thick and sticky. Beat in vanilla extract and melted butter until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in small additions, fold in potato chips and pretzels until the mixture reaches your desired ratio of fillings to marshmallow (see note). Work quickly, since the marshmallow will begin to set as it cools; if it sets too much before you have finished adding the fillings, return it to a pot over low heat and stir until softened, then continue.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the marshmallow mixture into the prepared pan and, using gloved hands or a buttered spatula, press evenly to fill the pan. Press additional pieces of pretzel and chips on top, if desired. Let stand to cool completely. Remove from pan, using overhanging parchment to lift, and cut into squares.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a microwave-safe bowl, combine the remaining 1/4 cup stout and the chopped milk chocolate. Microwave for 10 seconds, then stir. Microwave again in 10-second intervals, stirring each time, until melted and smooth. Drizzle chocolate mixture over the squares and let the chocolate cool until set. Serve. To store, cover with plastic wrap. The bars can be kept in a sealed airtight container for up to 3 days.</p>"}]}