{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150624-argentine-chimichanga-burger-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["Argentine", "asado", "burger", "chimichurri", "South American"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Argentine Asado Burgers With Seared Provolone and Chimichurri", "link": "https://www.seriouseats.com/recipes/2015/07/argentine-asado-burger-chimichurri-provolone-recipe.html", "description": "Even if you've never been to a proper <em>asado</em>, the legendary grilling feast that takes place in the mountains of South America, that doesn't mean you can't enjoy those flavors at home, squeezed between bread in the form of a miraculous cheeseburger.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Burger", "Chimichurri", "Mains", "Quick Dinners"], "recipeIngredient": ["1 1/2 pounds ground beef chuck, preferably about 80% lean, formed into 4 (6-ounce) patties", "Kosher salt and freshly ground black pepper", "4 (1/4-inch thick) rounds provolone cheese", "8 thin slices crusty peasant bread, trimmed to size of patties, drizzled with olive oil, and toasted until lightly browned", "<a href=\"http://www.seriouseats.com/recipes/2011/06/sauced-chimichurri-sauce-recipe.html\">Chimichurri Sauce</a>, for spooning"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press a dimple into the top of each burger patty. Season patties generously with salt and pepper. Heat oil in a large cast iron skillet over high heat until lightly smoking. Add patties and cook, turning, to desired doneness (120&deg;F for rare, 125&deg;F for medium rare, or 135&deg;F for medium). Transfer to a plate and allow to rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pour off fat from skillet and wipe clean with paper towels. Return skillet to high heat and heat until smoking. Add cheese rounds to skillet and cook until undersides are just starting to turn molten, 15&ndash;30 seconds. Using a thin metal spatula, quickly scrape under each cheese round and flip. Cook until cheese is almost fully melted and softened throughout, then slide spatula underneath and transfer each round to a burger patty. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set each cheese-topped patty on top of a slice of toast, spoon chimichurri sauce on top, and close burgers. Serve right away.</p>"}]}