{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150201-yuba-noodle-vietnamese-salad-14.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Vietnamese", "keywords": ["citrus", "noodle", "salad", "vegetarian", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Vietnamese Citrus and Noodle Salad With Fresh Herbs and Fried Yuba (Tofu Skin)", "link": "https://www.seriouseats.com/recipes/2015/02/vietnamese-citrus-noodle-salad-fresh-herbs-fried-shllots-recipe-vegan-yuba.html", "description": "Crispy fried tofu skin, rice noodles, handfuls of herbs, and crunchy, fresh vegetables combine for a light-yet-hearty salad with a huge variety of textures and flavors, all dressed with a punchy lime, garlic, and chili dressing.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dairy-Free", "Mains", "Salads", "Vegan", "Vegetarian", "Vietnamese"], "recipeIngredient": ["4 small shallots, sliced 1/8-inch thick, <a href=\"http://www.seriouseats.com/2015/01/what-are-the-best-cheap-mandoline-vegetable-fruit-slicers.html\">preferably on a mandoline</a> for even thickness (see note)", "1 quart vegetable or canola oil", "Kosher salt", "4 ounces fresh yuba (see note), cut into 1/2-inch strips", "4 ounces dried thin rice noodles", "3 medium cloves garlic", "2 to 3 Thai bird chilies, roughly chopped", "3 tablespoons brown sugar", "3 tablespoons fresh juice from about 3 limes", "1 tablespoon soy sauce (see note)", "1 teaspoon Maggi seasoning (or other liquid aminos, see note)", "1 large carrot, cut into thin matchsticks, <a href=\"http://www.seriouseats.com/2015/01/what-are-the-best-cheap-mandoline-vegetable-fruit-slicers.html\">preferably on a mandoline</a>, or grated on the large holes of a box grater", "1 large cucumber, peeled, split lengthwise, deseeded, and sliced thinly on a bias.", "1 cup fresh mint leaves", "1 cup fresh cilantro leaves and fine stems", "2 large grapefruits (or 1 pomelo), <a href=\"http://www.seriouseats.com/2014/04/knife-skills-how-to-cut-citrus-fruit-into-wedges-slices-and-supremes.html\">cut into <em>suprêmes</em></a>", "3/4 cup roasted peanuts, lightly crushed in a <a href=\"http://www.amazon.com/Libertyware-Granite-Mortar-Pestle-Capacity/dp/B000Y0AYFC/?tag=serieats-20\" target=\"_blank\">mortar and pestle</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large plate or rimmed baking sheet with 4 layers of paper towels. Set a fine mesh strainer over a large heat-proof bowl or medium saucepan. Combine shallots and oil in a wok or medium saucepan. Place over high heat and cook, stirring frequently, until shallots begin to bubble. Continue cooking, stirring constantly as the shallots fry to ensure even cooking. When shallots are light golden brown, transfer to strainer and drain. (Shallots will continue cooking for a brief period after draining, so do not allow them to get too dark). Immediately transfer to paper towel-lined tray and season with salt. Allow shallots to drain, then carefully lift the top layer of paper towels and roll shallots onto second layer, blotting gently with the first. Repeat, until shallots are on the last layer of paper towels and mostly grease-free. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return oil to wok and heat to 325&deg;F. Add yuba strips one at a time (they will stick together if you try to add them at once), gently lowering them into the hot oil. Do not crowd the wok. Fry, turning and agitating with a metal spider, until yuba is crisp and bubbles have mostly stopped, about 45 seconds. Transfer fried yuba to a paper towel-lined plate to drain and season with salt. Repeat until all yuba is fried.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 2 quarts of water to a boil over high heat. Add noodles, remove pot from heat, and let rest until noodles are soft but not mushy, about 4 minutes. Drain, rinse under cold running water, and drain again. Transfer to large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mortar and pestle, pound garlic and chilies with a pinch of salt until a fine paste is formed. Add sugar, lime juice, soy sauce, and liquid aminos and stir with pestle to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add carrots, cucumber, fried yuba, mint, cilantro, grapefruit, yuba, half of fried shallots, and half of peanuts to the bowl with the noodles. Add the dressing and toss to coat. Transfer to a large serving bowl. Top with remaining peanuts and fried shallots and serve.</p>"}]}