{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150702-zucchini-pizza-worth-eating-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["Italian", "pizza", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pizza With Zucchini, Feta, Lemon, and Garlic", "link": "https://www.seriouseats.com/recipes/2015/07/pizza-zucchini-feta-lemon-garlic-recipe.html", "description": "The secret to great zucchini pizza is to remove as much liquid from the zucchini as possible before topping the pizza. Our technique gives you a nice crunch along with fresh, sweet, caramelized zucchini flavor.", "totalTime": "3 hours", "recipeYield": "Makes four 10- to 12-inch pizzas, serving 4", "recipeCategory": ["Italian", "Mains", "Pizza", "The Food Lab", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-neapolitan-pizza-dough-recipe.html\">Neapolitan Pizza Dough</a>, or 2 pounds store-bought pizza dough", "1 large zucchini (about 12 ounces), thinly sliced and cut into 1/4-inch-thick matchsticks", "8 medium cloves garlic (2 minced, 6 thinly sliced), divided", "1 teaspoon kosher salt, plus more for sprinkling", "1 pound fresh mozzarella, torn into rough chunks and drained", "1 lemon, very thinly sliced, seeds removed", "8 ounces goat or sheep's milk feta cheese, roughly crumbled into 1/2-inch pieces", "4 tablespoons extra-virgin olive oil, for drizzling, divided", "1/2 cup thinly sliced scallions, white and light green parts only"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into four equal parts and place each in a covered quart-sized deli container or in a zipper-lock freezer bag. Allow to rest at room temperature for at least 2 hours before baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine zucchini and minced garlic in a medium bowl. Add 1 teaspoon kosher salt and toss to coat. Transfer to a strainer and set over the bowl. Let rest for 30 minutes. Squeeze zucchini with your hands to remove all excess moisture. Transfer zucchini to a paper towel&ndash;lined plate and set aside until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to 6 inches under broiler and place stone or steel on rack. Preheat oven to highest possible temperature (500 or 550&deg;F) for at least 45 minutes. Alternatively, use a <a href=\"http://slice.seriouseats.com/archives/2013/09/the-pizza-lab-we-test-kettle-pizza-and-baking-steels-new-joint-pizza-oven.html\">KettlePizza and Baking Steel grill insert</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, turn one dough ball out onto a lightly floured surface. Gently press out dough into a rough 8-inch circle, leaving the outer 1 inch higher than the center. Gently stretch dough into a 10- to 12-inch circle, about 1/4 inch thick, by draping over knuckles and gently stretching. Transfer to floured wooden pizza peel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high. Spread 1/4 of mozzarella over pizza, followed by a few lemon rings, 1/4 of zucchini, 1/4 of feta, and 1/4 of thinly sliced garlic. Sprinkle lightly with salt and drizzle with 1 tablespoon olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pizza to hot stone or steel and broil, rotating regularly for even cooking, until edges are puffed and lightly charred and bottom is crisp, 3 to 6 minutes total. Retrieve pizza with a metal peel and transfer to a cutting board. Allow to rest 1 minute. Meanwhile, switch oven back to 550&deg;F to reheat stone for remaining pizzas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle with scallions, slice, and serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat steps 4 through 7 for remaining pizzas.</p>"}]}