{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/11/gooeyapplepie.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["apple pie", "pie", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "5"}, "name": "Gooey Apple Pie", "link": "https://www.seriouseats.com/recipes/2015/11/gooey-deep-dish-apple-pie-recipe.html", "description": "This apple pie slices cleanly and holds its shape as you lift it out of the pie plate. It has chunks of apple that are tender yet intact, lightly bound in a thickened sauce that's just sweet enough, with a hint of spice. This is the pie for all you gooey-pie-lovers out there (and you know who you are).", "totalTime": "6 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Baking", "Christmas", "Desserts", "Fruit Desserts", "Pastry", "Pies, Tarts, and Crumbles", "Sous Vide", "Thanksgiving", "The Food Lab"], "recipeIngredient": ["5 pounds (2.25kg) apples (see note), peeled, cored, and sliced 1/2 inch thick", "1/2 to 3/4 cup (100 to 150g) sugar (see note), plus more for sprinkling", "2 tablespoons cornstarch (1/2 ounce; 15g) ", "1/2 teaspoon ground cinnamon", "2 teaspoons (10ml) fresh juice and 1 teaspoon grated zest from 1 lemon", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2011/07/easy-pie-dough-recipe.html\">Easy Pie Dough</a>", "1 egg white"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and place a heavy rimmed baking sheet on it. Preheat oven to 425&deg;F (220&deg;C). Toss apple slices with sugar, cornstarch, cinnamon, and lemon juice and zest until well coated. Let rest for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook Filling on the Stovetop</strong>: Transfer apples and their juices to a large Dutch oven. Heat over low heat, stirring constantly, until lightly steaming. Cover and continue cooking over lowest heat setting, stirring frequently, using a thermometer to maintain temperature below 160&deg;F (71&deg;C). Do not allow liquid to come to a boil for first 20 minutes. After 20 minutes, increase heat to medium-high and cook, stirring frequently, until juices thicken enough that a spatula dragged through the bottom of the pot leaves a trail that very slowly closes back up, about 10 minutes more. Transfer apples to a rimmed baking sheet, spread out into a single layer, and allow to cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook Filling With a Sous Vide Precision Cooker</strong> (see note): Set precision cooker to 160&deg;F (71&deg;C). Transfer apples and their juices to a vacuum bag and seal. Cook in water bath for 1 hour. Transfer contents to a large Dutch oven and heat over medium-high heat, stirring frequently, until juices thicken enough that a spatula dragged through the bottom of the pot leaves a trail that very slowly closes back up, about 10 minutes. Transfer apples to a rimmed baking sheet, spread out into a single layer, and allow to cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll 1 disk of pie dough into a circle roughly 12 inches in diameter. Transfer to a 9-inch pie plate. Add filling, piling it into the pie shell until it all fits. Roll remaining disk of pie dough into a circle roughly 12 inches in diameter. Transfer to top of pie.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pair of kitchen shears, trim edges of both pie crusts until they overhang the edge of the pie plate by 1/2 inch all the way around. Fold edges of both pie crusts down together, tucking them in between the bottom crust and the pie plate and working your way all the way around the pie plate until everything is well tucked. Use the forefinger on your left hand and the thumb and forefinger on your right hand to crimp the edges. Cut 5 slits in the top with a sharp knife for ventilation.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a pastry brush to brush an even coat of lightly beaten egg white all over the top surface of the pie. Sprinkle evenly with 1 tablespoon (15g) of sugar. Transfer pie to baking sheet in oven and bake until light golden brown, about 20 minutes. Reduce heat to 375&deg;F (190&deg;C) and continue baking until deep golden brown, about 25 minutes longer. Remove from oven and allow to cool at room temperature for at least 4 hours before serving.</p>"}]}