{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150626-Stacked-Perfect-Pitas-Yvonne-Ruperti-Edit-Edit.jpg", "author": {"@type": "Person", "name": "Yvonne Ruperti"}, "recipeCuisine": "Middle Eastern", "keywords": ["Bake", "bread", "middle eastern", "pita"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9", "ratingCount": "10"}, "name": "Perfect Homemade Pita Bread", "link": "https://www.seriouseats.com/recipes/2015/08/perfect-pita-bread-recipe.html", "description": "Once you see how easy it is to bake your own pita bread, and, more importantly, once you <em>taste</em> it, you'll never want to eat store-bought again. These pitas have a nutty, slightly sweet flavor from whole wheat flour, along with a chewy texture, a charred exterior, and big pockets for stuffing.", "totalTime": "2 hours", "recipeYield": "Makes 6 pitas", "recipeCategory": ["Baking", "Bread", "Dairy-Free", "Middle Eastern", "Vegan", "Vegetarian"], "recipeIngredient": ["1 cup water (8 ounces; 240ml), 105–110°F (41–43°C)", "1 tablespoon (15ml) extra-virgin olive oil, plus more for oiling the bowl", "1 tablespoon granulated sugar", "2 1/4 teaspoons <a href=\"https://www.seriouseats.com/2018/03/all-about-dry-yeast-instant-active-dry-fast-acting-and-more.html\">instant yeast</a>", "1 teaspoon kosher salt", "1/2 cup whole wheat flour (2 1/2 ounces; 70g)", "2 cups all-purpose flour (10 ounces; 280g), plus more for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, combine water, oil, sugar, yeast, salt, and whole wheat flour with a wooden spoon until combined and smooth. Stir in all-purpose flour until the mixture comes together into a shaggy mass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using clean hands, knead the dough in the bowl for 10 minutes or until it becomes smooth and very elastic, adding only very small amounts of extra flour if dough is extremely sticky (see note). Alternatively, knead dough at low speed in a stand mixer fitted with the dough hook attachment until dough is very elastic and smooth, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto a lightly floured work surface and form into a smooth ball. Lightly oil a clean mixing bowl and place dough inside, then rub oiled hands over the top of the dough. Cover bowl with a damp cloth and let rise in a warm place for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place a baking steel or 12-inch cast iron skillet on the top oven rack and preheat oven to 500&deg;F (260&deg;C). Line a plate with a large, clean kitchen towel and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Punch down the dough, transfer to a lightly floured work surface, and cut into 6 even pieces. Form each dough piece into an even ball. Cover with a damp towel and let rest for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll each piece of dough into about a 7-inch circle, no more than 1/4 inch thick, taking care not to tear dough and keeping the thickness even all around. Place dough disks on a lightly floured surface, cover with a damp towel, and let proof until slightly puffy, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with as many pitas as will fit on the steel at once, pick up each pita and place on the steel top side down. (If using a cast iron skillet, bake one pita at a time.) Immediately close the oven door and bake until pitas have puffed and are slightly golden around the edges, about 3 minutes. Be careful not to over-bake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place baked pitas onto towel-lined plate and wrap with the overhanging towel. Repeat with any remaining pitas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For an extra-charred finish, heat a cast iron skillet on the stovetop over high heat until smoking. Working with one pita at a time, briefly heat each side until charred in a few spots, about 30 seconds. Return pita to towel and cover. Repeat with remaining pitas and serve immediately.</p>"}]}