{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150616-mint-chocolate-chip-ice-cream-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["chocolate", "ice cream", "mint"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4166666666667", "ratingCount": "12"}, "name": "The Best Mint Chip Ice Cream", "link": "https://www.seriouseats.com/recipes/2015/06/best-mint-chocolate-chip-ice-cream-recipe.html", "description": "No mint leaves can match the charged blast of a slug of mint extract, but fresh mint ice cream has an unbeatable roundness of flavor you just can't find in a bottle. Add in lacy straciatella swirls that don't turn brittle like regular frozen chocolate for a mint chip ice cream that'll put all the others to bed.", "totalTime": "6 to 7 hours, or overnight", "recipeYield": "Makes 1 quart", "recipeCategory": ["Chocolate", "Father's Day", "Ice Cream and Frozen Treats", "Mother's Day"], "recipeIngredient": ["2 cups heavy cream", "1 cup whole milk", "1 large or two small bunches fresh mint leaves", "6 egg yolks", "1/2 cup sugar", "1/2 teaspoon kosher salt, or to taste", "4 ounces dark chocolate", "2 teaspoons neutral-flavored oil, such as vegetable or canola"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed saucepan, bring cream and milk to a simmer. Remove from heat, stir in mint leaves, cover, and let steep for 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In another heavy-bottomed saucepan, whisk together egg yolks and sugar until well combined. Quickly strain dairy into pot with egg yolks, pressing on the mint with the back of a spoon to extract as much mint flavor as possible. Whisk until fully combined, then set over medium heat and cook, whisking frequently, until a custard forms on a spoon and a finger swiped across the back leaves a clean line, or until custard temperature reaches 170&deg;F. Add salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour custard through a fine mesh strainer into an airtight container and chill in an ice bath or refrigerator until temperature drops to 40&deg;F, about 4 hours for ice bath, up to overnight for refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Churn ice cream according to manufacturer's instructions. While ice cream churns, melt chocolate in a microwave or double boiler and stir to combine with oil. During final minutes of churning, slowly drizzle chocolate into ice cream to form thin, lacy lines, pausing to break up larger chocolate chunks with a spoon, if needed. Transfer churned ice cream to an airtight container and harden in freezer for at least 4 hours before serving.</p>"}]}