{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150408-french-madeleines-with-almonds-and-apricot-nila-jones-1-thumb.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["almond", "apricot", "cake", "dessert", "madeleine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "French Madeleines With Almonds and Apricot Glaze", "link": "https://www.seriouseats.com/recipes/2015/04/french-madeleines-almonds-apricot-glaze-recipe.html", "description": "French madeleines, the delicious shell-like tea-cakes, are an impressive dessert that also happens to be very easy to make. They're often flavored with vanilla bean or citrus, such as lemon or orange, but in this recipe, the buttery flavor of the madeleines is paired with the slightly bitter taste of almond extract and a sweet apricot glaze. Vanilla is added for a touch of warmth, while the brown butter in the batter gives the madeleines a rich, complex flavor.", "totalTime": "1 hour 40 minutes", "recipeYield": "Makes 16 madeleines", "recipeCategory": ["Apricot", "Cakes", "Desserts", "Father's Day", "Mother's Day", "Nuts", "Valentine's Day"], "recipeIngredient": ["<strong>For the Madeleines:</strong>", "1/3 cup plus 1 tablespoon (3.17 ounces or 90 grams) unsalted butter, cubed, plus more for greasing", "2 large eggs", "1/2 cup (3.5 ounces or 100 grams) granulated sugar", "1/2 cup plus 2 tablespoons plus 1/2 teaspoon (3.17 ounces or 90 grams) all-purpose flour", "1 teaspoon baking powder", "Pinch of kosher salt", "1 1/2 tablespoons milk", "1/4 teaspoon vanilla extract", "1/4 teaspoon almond extract", "2 tablespoons shaved almonds", "<strong>For the Glaze:</strong>", "3 tablespoons apricot jam", "1 tablespoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Madeleines:</strong> Heat the butter in a heavy-bottomed and preferably light-colored saucepan over low heat, stirring occasionally, until melted. Continue cooking, stirring frequently, until foaming subsides and butter starts to smell nutty and milk solids are a deep golden brown, about 5 minutes. Pour brown butter into a heatproof container and set aside to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk 1 egg with the sugar until foamy. Add flour, baking powder, and salt and whisk until incorporated. Whisk in the remaining egg until the batter looks smooth. Add milk to the cooled (but still melted) brown butter and drizzle the mixture into the batter, whisking continuously. <br />\nWhisk in the vanilla and almond extracts. Set the batter aside for 50 minutes at room temperature, then refrigerate for 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 390&deg;F and adjust oven rack to middle position. Butter a madeleine pan and pour the batter among the molds, filling them almost to the top. (There’s no need to smooth the batter, as it will even out as it bakes.) Sprinkle the shaved almonds on top. Bake until a toothpick inserted into the center of the cakes comes out clean, 9 to 11 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove madeleines from the oven and immediately invert the hot pan over a cool baking sheet or a wire rack, gently rapping the pan to dislodge the madeleines. (Waiting for the madeleines to cool even slightly will make it difficult to remove them from the pan.) Set the madeleines aside to cool slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Glaze:</strong> Combine jam and water in a small saucepan and cook over medium-high heat, stirring, until the jam loosens and melts into the water. Remove from the heat. Using a pastry brush, brush the shell-side of the madeleines with the glaze. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or at room temperature. Madeleines taste best on the day they’re made, but you can keep them, stored in an airtight container, for up to 2 days. </p>"}]}