{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/02/homemadetortellini.jpg", "author": {"@type": "Person", "name": "Niki Achitoff-Gray"}, "recipeCuisine": "Italian", "keywords": ["Italian", "pasta", "tortellini", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Homemade Mushroom Tortellini", "link": "https://www.seriouseats.com/recipes/2015/02/mushroom-tortellini-recipe.html", "description": "Homemade tortellini are delicate, flavorful showstoppers that also lend themselves well to cooking with a partner or group of friends. This version is filled with a savory purée of sautéed mushrooms, shallots, and Parmesan cheese.", "totalTime": "2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Italian", "Mains", "Pasta", "Vegetarian"], "recipeIngredient": ["5 ounces shiitake mushrooms, <a href=\"http://www.seriouseats.com/2014/10/knife-skills-how-to-clean-shiitake-portobello-oyster-mushrooms.html\">cleaned and trimmed</a>", "5 ounces cremini mushrooms, <a href=\"http://www.seriouseats.com/2014/10/knife-skills-how-to-clean-shiitake-portobello-oyster-mushrooms.html\">cleaned and trimmed</a>", "5 ounces oyster mushrooms, <a href=\"http://www.seriouseats.com/2014/10/knife-skills-how-to-clean-shiitake-portobello-oyster-mushrooms.html\">cleaned and trimmed</a>", "2 1/2 tablespoons butter", "2 small shallots, finely minced (about 1/4 cup)", "3 medium cloves garlic, minced (about 1 tablespoon)", "1 teaspoon fresh thyme leaves, minced", "Kosher salt and freshly ground black pepper", "1/2 cup dry red wine", "1 teaspoon Worcestershire sauce", "3/4 ounces grated Parmesan cheese (approximately 1/2 cup loosely packed) plus more for serving", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2015/01/fresh-egg-pasta.html\">Classic fresh egg pasta dough</a>", "A few tablespoons olive oil or <a href=\"http://www.seriouseats.com/2015/01/how-to-make-brown-butter-technique.html\">brown butter</a> for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place mushrooms in the work bowl of a food processor. Pulse until chopped into pieces no larger than 1/4 inch, 8 to 10 short pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a large skillet over medium heat. Add mushrooms and cook until softened, 3 to 5 minutes. Add shallots, garlic, and thyme and season with salt and pepper. Reduce heat to medium low and continue cooking, stirring frequently, until mixture is dry and starting to brown, 15 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add red wine and Worcesterhire sauce. Increase heat to high and cook, stirring, until no visible liquid remains, approximately 1 minute. Remove from heat and stir in Parmesan cheese. Season to taste with salt and pepper. Transfer mixture to a food processor or blender and process until smooth. Transfer to a plate and spread into a thin layer. Transfer to refrigerator to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, divide dough into four even sections. Working one section at a time, with remaining sections tightly wrapped in plastic, roll dough through machine until sheet is just under 1/16th of an inch thick (typically second-to-last setting).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay dough out on a lightly floured surface. Use cookie cutter to cut circles as close together as possible, twisting each time to cut all the way through. Each sheet of dough should yield roughly 30 disks. Remove excess dough and cover with a kitchen towel to keep moist. (Excess dough can be re-kneaded and rolled again for a higher yield.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pastry bag, ziplock bag, or measuring spoon, add 1/2 teaspoon of filling to the center of the first disk. Lightly moisten edges of disk with pastry brush dipped in water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold disk over into a semi-circle and, working from one edge and carefully pressing out any extra air, create a seal around the filling.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick up both corners of semi-circle and bring them toward each other, working slowly to prevent dough from splitting. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tuck one corner behind the other and press together. Place finished tortellini on parchment paper dusted with semolina or flour. Repeat with remaining dough. Tortellini can be frozen and transferred to a zipper-lock freezer bag for up to 2 weeks at this point.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook tortellini in salted boiling water until tender, approximately 4 minutes. Drain, reserving 1 cup of pasta cooking water. Return to pot, add olive oil or brown butter along with a splash of pasta water and cook over high heat, tossing constantly until sauce emulsifies and coats the tortellini, adding more pasta water as necessary. Serve immediately, sprinkled with grated Parmesan.</p>"}]}