{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150709-tuscan-fried-chicken-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Kosher", "keywords": ["chicken", "fried chicken", "Italian", "Jewish", "tuscan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemon-Marinated Tuscan-Jewish Fried Chicken", "link": "https://www.seriouseats.com/recipes/2015/07/tuscan-jewish-lemon-fried-chicken-recipe.html", "description": "Tuscany and fried chicken: two things that are almost universally loved, but otherwise have very little to do with each other. Or do they? Turns out there's an awesome fried chicken dish that comes to us straight from the Jewish community of Tuscany, featuring meat that's brined in lemon juice with garlic and spices, then fried in a simple coating of flour and egg.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Deep Frying", "Fried Chicken", "Italian", "Kosher", "Mains"], "recipeIngredient": ["1 whole chicken (about 4 pounds), <a href=\"http://www.seriouseats.com/2010/05/knife-skills-how-to-break-down-a-chicken.html\">cut into 8 pieces</a> (legs split into drumsticks and thighs, breast halves and wings split), backbones reserved for stock (see note)", "1/4 cup plus 1 tablespoon fresh juice from 3 lemons", "2 medium cloves garlic, minced", "1 teaspoon kosher salt, plus more for seasoning", "Freshly ground black pepper", "1/8 teaspoon ground cinnamon", "1/8 teaspoon freshly grated nutmeg", "Vegetable, peanut, canola, or olive oil, for frying (see note)", "1 cup all-purpose flour", "4 eggs, beaten", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 1-gallon zipper-lock bag, combine chicken, lemon juice, garlic, salt, a generous grating of pepper, cinnamon, and nutmeg. Seal and shake to combine thoroughly. Refrigerate for at least 1 hour and up to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to fry chicken, fill a wok, Dutch oven, or large cast iron skillet with about 1 1/2 inches of oil and heat oil until it registers 375&deg;F on an instant-read thermometer. Fill a wide bowl with flour and another with egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain chicken. Working in batches if necessary, dredge each piece of chicken in flour, shaking off excess, then dip in egg to coat. Let excess egg drizzle off, then add to hot oil; the oil temperature will drop. Fry chicken, turning occasionally and maintaining an oil temperature between 325 and 350&deg;F, until chicken is golden brown outside and registers an internal temperature of 145&deg;F for breasts and 155&deg;F for drumsticks and thighs, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer fried chicken to paper towels to drain, then transfer to a wire rack set over a baking sheet. Sprinkle with salt. Allow chicken to rest for a full 3 minutes after breast core temperature rises to 150&deg;F. Serve right away with lemon wedges. Alternatively, allow to cool to room temperature, then re-fry in hot oil just before serving.</p>"}]}