{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/05/20150521-Cornbread-Coated-Mac-N-Cheese-Pulled-Pork-Drizzled-Morgan-Eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["barbecue", "cheese", "deep fry", "pulled pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cornbread-Coated Pulled Pork Mac and Cheese Wedges", "link": "https://www.seriouseats.com/recipes/2015/05/cornbread-coated-mac-and-cheese-pulled-pork-fried-recipe.html", "description": "When I have leftover mac and cheese and pulled pork after a day of barbecuing, I don't just reheat it and eat it the next day. I fold them together into these outrageous fried mac and cheese bombs, stuffed with barbecue-sauced pulled pork and coated in a cornbread crust.", "totalTime": "1 hour 45 minutes", "recipeYield": "Makes 6-8 servings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Pasta", "Pork", "Sides", "Snacks"], "recipeIngredient": ["3 cups leftover macaroni and cheese, chilled (see note)", "1 jalapeño pepper, seeded, stemmed, and chopped, plus additional jalapeno slices for garnish", "1/2 cup shredded pepper jack, Monterey jack, or cheddar cheese", "2 cups pulled pork (about 1 1/4 pounds), tossed with barbecue sauce (see note)", "2 cups all-purpose flour", "1 cup ground yellow cornmeal", "1/2 cup granulated sugar", "2 teaspoons kosher salt", "1 teaspoon baking soda", "1 3/4 cups milk", "2 eggs", "Oil, for frying", "Barbecue sauce, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with parchment paper. Press chilled macaroni and cheese in an even layer in the baking sheet. Sprinkle all over with jalapeño peppers and shredded cheese. With the short side of the baking sheet in front of you, layer the pulled pork evenly on half of the macaroni and cheese layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the parchment paper, fold the macaroni layer without pork over the half with pork to sandwich it. Place another baking sheet on top and press gently to condense. Transfer to the freezer and freeze until solid, at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard parchment paper. Cut the layered macaroni and pork into squares, and then cut diagonally to create triangles. Return to freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large cast iron skillet or wok, heat 2 inches of oil to 350&deg;F. Meanwhile, in a large bowl, whisk together flour, cornmeal, sugar, salt, and baking soda. Make a well in the center of the dry ingredients and add milk and eggs. Whisk together until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove macaroni and pork triangles from freezer. Dip a few at a time into the batter and, using a spoon, transfer them to the oil. Cook, flipping halfway, until golden brown and warmed through, 3-4 minutes. Using a slotted spoon, transfer the wedges to a paper towel-lined plate. Repeat until all of the wedges have been fried. Serve warm, garnished with sliced jalapeños and barbecue sauce alongside for dipping.</p>"}]}