{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150826-oyster-mushroom-watercress-salad-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["easy", "mushroom", "salad", "vegetarian", "watercress"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Roasted Oyster Mushroom and Watercress Salad", "link": "https://www.seriouseats.com/recipes/2015/09/oyster-mushroom-watercress-salad-recipe.html", "description": "Watercress is peppery, plump, and loaded with character. Here, we turn it into a full meal by pairing it with pan-roasted oyster mushrooms, Parmesan cheese, and a flavorful tarragon vinaigrette.", "totalTime": "25 minutes", "recipeYield": "Serves 2 as a main course or 4 as an appetizer or side dish", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Easter", "Father's Day", "Mains", "Mother's Day", "Mushrooms", "Salads", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["1 small shallot, minced (about 2 tablespoons)", "1 small clove garlic, minced (about 1/2 teaspoon)", "2 teaspoons Dijon mustard", "3 tablespoons white wine vinegar", "1 tablespoon water", "1 packed tablespoon roughly chopped fresh tarragon leaves", "3/4 cup extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "Vegetable or canola oil, for searing mushrooms", "1 pound oyster mushrooms, firm central stems removed, mushroom caps separated, large caps torn by hand vertically into smaller pieces", "4 ounces fresh watercress, cut or torn into smaller pieces if stalks are large", "3 ounces Parmigiano-Reggiano or Grana Padano cheese, shaved with a vegetable peeler"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine shallot, garlic, mustard, vinegar, water, and tarragon in a tall, narrow container. Using an immersion blender, blend until tarragon is finely chopped and incorporated into dressing base. Alternatively, mince tarragon finely by hand and add to the base. Transfer to a large bowl. Whisking constantly, slowly drizzle in olive oil. Season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large cast iron skillet, heat 3 tablespoons vegetable oil over high heat until lightly smoking. Add just enough mushrooms to barely fill skillet without crowding. Season with salt and cook, stirring occasionally, until mushrooms are tender and browned, about 5 minutes. Transfer cooked mushrooms to a baking sheet in an even layer and allow them to cool to room temperature. Repeat with remaining mushrooms in as many batches as needed, adding more oil to the pan before each batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine watercress with cooled mushrooms and cheese. Season lightly with salt and pepper. Dress and toss with just enough vinaigrette to lightly coat salad ingredients, adding more vinaigrette as needed. Serve right away. Extra vinaigrette can be kept refrigerated in an airtight container for up to 2 weeks.</p>"}]}