{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150729-grilled-chicken-salad-kenji-lopez-alt-16.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cabbage", "chicken", "easy", "grill", "quick", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "2"}, "name": "Grilled Chicken and Cabbage Salad With Creamy Tahini Dressing", "link": "https://www.seriouseats.com/recipes/2015/08/grilled-chicken-and-cabbage-salad-recipe.html", "description": "I've been trying to come up with great ways to use leftover grilled chicken breasts that mask their inherent dryness and give them new life. One of my favorites is a fresh, crunchy salad with cabbage, red onion, and a ton of fresh herbs in a tahini-based dressing.", "totalTime": "15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cabbage", "Grilled Chicken", "Mains", "Salads"], "recipeIngredient": ["3/4 pound leftover <a href=\"http://www.seriouseats.com/recipes/2012/06/the-best-juicy-grilled-boneless-skinless-chicken-breasts-recipe.html\">grilled chicken breasts</a> (about 2 breasts) or 3/4 pound picked cooked rotisserie chicken meat, shredded", "5 tablespoons extra-virgin olive oil, divided", "3 tablespoons fresh juice from 2 lemons, divided", "4 medium cloves garlic, finely minced (about 4 teaspoons), divided", "Kosher salt and freshly ground black pepper", "3/4 pound finely shredded red cabbage (about 1/2 head)", "1 small red onion, thinly sliced", "1/3 cup tahini paste", "1/2 cup roughly chopped fresh mint leaves", "1/2 cup roughly chopped fresh parsley leaves", "1/2 cup roughly chopped fresh cilantro leaves", "1 tablespoon roasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chicken with 2 tablespoons olive oil, 1 tablespoon lemon juice, and 1 teaspoon minced garlic in a large bowl. Season with salt and pepper and massage with clean hands to work the dressing into the chicken. Add cabbage and red onion and toss to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine tahini, remaining 2 tablespoons lemon juice, and remaining 3 teaspoons minced garlic. Whisking constantly, drizzle in remaining 3 tablespoons olive oil. Slowly whisk in up to 1/2 cup water until a thick, pancake-batter-like consistency is reached. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mint, parsley, and cilantro to bowl with shredded chicken and cabbage, along with half of sesame seeds and all of the dressing. Toss with clean hands to combine. Adjust to taste with more salt, pepper, or lemon juice as necessary. Transfer to serving platter or bowl and sprinkle with remaining sesame seeds. Serve immediately. Salad can be stored in a covered container in the refrigerator for up to 3 days.</p>"}]}