{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150617-tabbouleh-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Middle Eastern", "keywords": ["bulgur", "herb", "israeli", "Lebanese", "middle eastern", "parsley", "salad", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "The Best Tabbouleh Salad", "link": "https://www.seriouseats.com/recipes/2015/06/tabbouleh-salad-recipe.html", "description": "There are lots of tabbouleh recipes in the world, but many give instructions that can lead to a sopping wet salad with bulgur that's too hard to eat. This one uses pre-salting steps to remove excess moisture from the tomatoes and parsley, then uses the water drained from the tomatoes to soak the bulgur until tender and flavorful. A hint of spices adds complexity and depth.", "totalTime": "1 hour 15 minutes", "recipeYield": "Makes about 4 cups", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Middle Eastern", "Other Grains", "Salads", "Sides", "Snacks", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["3/4 pound ripe plum tomatoes, finely diced", "2 cups finely chopped flat-leaf parsley leaves and tender stems (about 2 bunches), finely chopped with a sharp knife", "2 teaspoons kosher salt, divided, plus more for seasoning", "1/4 cup dry coarse bulgur wheat", "1 cup finely chopped fresh mint leaves (about 1 bunch)", "2 scallions, white and light green parts only, finely chopped", "5 tablespoons extra-virgin olive oil", "2 tablespoons fresh juice from 2 lemons", "1/4 teaspoon ground coriander seed (optional; see note)", "Pinch ground cinnamon (optional; see note)", "Freshly ground black pepper", "Romaine lettuce leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season tomatoes with 1 teaspoon salt and toss to combine. Transfer to a fine mesh strainer or colander set in a bowl and allow to drain for 20 minutes. Reserve liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season parsley with remaining 1 teaspoon salt and toss to combine. Transfer to a large mixing bowl lined with paper towels and let stand for 20 minutes. Blot parsley with towels to remove excess moisture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring 1/2 cup reserved tomato water to a boil, then pour over bulgur in a small heatproof bowl and let stand until bulgur is softened, about 1 hour (bulgur may still have a slight bite, but will continue to soften in the salad). Drain bulgur of any excess liquid and pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, stir together tomatoes, parsley, mint, bulgur, scallions, olive oil, lemon juice, coriander seed, and cinnamon until well combined. Season with salt and pepper. Serve tabbouleh with romaine leaves.</p>"}]}