{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/07/20140701-bluefish-recipe-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Niki Achitoff-Gray"}, "recipeCuisine": "", "keywords": ["aioli", "fish", "garlic", "mayonnaise", "spring", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quick and Easy Broiled Bluefish Fillets With Lime Aioli", "link": "https://www.seriouseats.com/recipes/2015/04/quick-easy-bluefish-fillet-lime-aioli-recipe.html", "description": "A rich and juicy fish that's almost impossible to cook to the point of dryness, bluefish is practically custom-built for simple preparations like this one, where it's rubbed with a lime- and chile-spiked aioli, roasted until tender, then quickly broiled until browned on top. It's so easy, you can have it on the table in under 30 minutes.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Fish", "Garlic"], "recipeIngredient": ["2 medium garlic cloves", "Kosher salt and freshly ground black pepper", "1 yolk from a large egg", "2 teaspoons fresh juice from 1 lime, plus wedges for serving", "1/4 teaspoon Dijon mustard", "1/4 teaspoon chipotle chili powder", "1/4 cup canola or vegetable oil", "1 tablespoon extra-virgin olive oil", "1/8 teaspoon lime zest from 1 lime", "1 1/2 pounds bluefish fillets, cut into 4 even portions", "1 tablespoon chopped flat-leaft parsely"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F and arrange oven rack 8 inches from broiler element. Line a rimmed baking sheet with foil or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a mortar and pestle, combine garlic with a pinch of salt and work into a paste. In a medium bowl, whisk together garlic paste, lime zest, egg yolk, lime juice, mustard, and chili powder. Whisking constantly, drizzle in canola and extra-virgin olive oils in a slow, steady stream to form a thick, emulsified sauce. Season aioli with salt and pepper. Alternatively, using a blender, blend garlic with egg yolk, lime juice, mustard, and chili powder; then drizzle in canola oil in a thin, steady stream until a thick, emulsified sauce forms. Whisk in olive oil (do not add olive oil in blender) and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat bluefish fillets dry with paper towels and arrange on baking sheet. Using an offset spatula or butter knife, spread aioli evenly all over fillets. Bake until bluefish reaches 135&deg;F on an instant-read thermometer, about 7 minutes. Remove from oven and turn on broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Broil bluefish until lightly browned and bubbling on top and an instant-read thermometer registers 140&deg;F when inserted in center, about 4 minutes. Transfer bluefish to plates, sprinkle with parsley, and serve with lime wedges.</p>"}]}