{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150331-matzo-balls-daniel-gritzer-24.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Kosher", "keywords": ["chicken", "comfort", "dumpling", "Jewish", "matzo", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "5"}, "name": "The Best Matzo Ball Soup", "link": "https://www.seriouseats.com/recipes/2015/04/the-best-matzo-balls-recipe.html", "description": "Some people like sinkers, some people like floaters. Here at Serious Eats, we're equal opportunity matzo-ballers, so we're giving a recipe that lets you choose the matzo balls of your dreams. Best part, it's ridiculously easy.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Kosher", "Passover", "Soups and Stews"], "recipeIngredient": ["4 large eggs, beaten", "1/4 cup seltzer or water (see note)", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2015/04/schmaltz-rendered-chicken-fat-recipe.html\">Schmaltz (rendered chicken fat)</a> or neutral oil like vegetable or canola oil (see note)", "1 cup matzo meal", "1/8 to 1 teaspoon baking powder (optional; see note)", "1 teaspoon kosher salt, plus more to taste", "Freshly ground black pepper", "3 quarts <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">good-quality homemade chicken stock</a>, divided", "Finely diced carrot and celery, for garnish", "2 fresh dill sprigs, plus picked fresh dill frinds for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine eggs with seltzer, and schmaltz or oil. In a small bowl, stir together matzo meal with baking powder (if using), salt, and pepper. Add dry ingredients to wet ingredients and stir to combine thoroughly. Refrigerate uncovered for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, divide stock evenly between two pots, season both with salt, and bring to a simmer. Add diced carrots and celery and dill sprigs to one pot and simmer until just tender; discard dill sprigs and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using wet hands, and re-wetting hands as necessary, form matzo-ball mixture into 1- to 1 1/2-inch balls, and add to simmering pot of stock that doesn't have the carrots and celery. When all matzo balls are added, cover and simmer until matzo balls are cooked through, 1 hour. Cooked matzo balls can be kept warm in their broth until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spoon, transfer matzo balls to serving bowls (you should have at least 3 per bowl); strain matzo-ball-cooking broth and save for another use. Ladle hot clear broth with carrots and celery into each bowl and garnish with dill springs. Serve.</p>"}]}