{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/01/20150119-pressure-cooker-chicken-stew-food-lab-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["black bean", "chicken", "easy", "sausage", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1818181818182", "ratingCount": "11"}, "name": "Quick and Easy Pressure Cooker Chicken and Black Bean Stew", "link": "https://www.seriouseats.com/recipes/2015/01/quick-and-easy-pressure-cooker-chicken-black-bean-stew-recipe.html", "description": "The pressure cooker is an amazing device for making flavor-packed stews in very short order. In this version, black beans are stewed together with spicy Hatch chilies, smoky Andouille sausage, and fall-off-the-bone tender chicken legs. It all cooks in under an hour start-to-finish.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Beans and Pulses", "Braising and Stewing", "Chicken", "Mains", "Pressure Cooker", "Quick Dinners", "Soups and Stews"], "recipeIngredient": ["1 tablespoon vegetable oil", "8 ounces smoked sausage, such as andouille or kielbasa, sliced into 1/4 inch disks", "1 medium onion, diced (about 1 cup)", "2 teaspoons ground cumin", "2 (4-ounce) cans diced green chilies (preferably Hatch)", "8 ounces dried black beans", "12 stems cilantro, leaves roughly chopped, stems tied together with a piece of kitchen twine", "4 chicken legs, divided into thighs and drumsticks (about 2 pounds)", "1 quart <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "Kosher salt and freshly ground black pepper", "Sour cream, for serving", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a pressure cooker over medium-high heat until shimmering. Add sausage and cook until starting to crisp around edges, about 2 minutes. Add onions and cook, stirring, until softened, about 3 minutes longer. Add cumin and cook until fragrant, about 30 seconds. Add chilies, dried black beans, cilantro stems, chicken, and broth. Season gently with salt and pepper and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Seal pressure cooker and bring to high pressure. Cook for 40 minutes. Cool pressure cooker under a cold running tap (if using an electric cooker, use the quick release valve), and open. Using tongs, transfer chicken pieces to a bowl. Discard cilantro stems. Return beans to high heat and continue cooking, stirring, until reduced to a thick, stew-like consistency, about 5 minutes. Meanwhile, shred chicken from bones and discard skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir chicken into beans, season to taste with salt and pepper, stir in half of chopped cilantro, and serve, passing sour cream, lime wedges, and remaining cilantro at the table.</p>"}]}