{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150301-pasta-fagioli-daniel-gritzer-1.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["bean", "comfort", "easy", "Italian", "pasta", "soup", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Pasta e Fagioli (Italian Bean and Pasta Soup)", "link": "https://www.seriouseats.com/recipes/2015/03/pasta-e-fagioli-italian-bean-pasta-soup-recipe.html", "description": "There's a version of <em>pasta e fagioli</em> for just about every region, province and household in Italy, from brothy ones packed with vegetables to creamy ones made only with beans and pasta. This one belongs to that latter group, and the secret to its greatness is all in the beans themselves.", "totalTime": "about 2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Italian", "Soups and Stews", "Vegan", "Vegetarian"], "recipeIngredient": ["1 pound dried beans, such as kidney beans, cannellini beans, or chickpeas, soaked overnight in salted water (see note)", "Kosher salt", "6 cloves garlic", "1 medium onion, peeled and halved", "2 medium carrots, peeled and halved", "2 stalks celery, halved", "2 large sprigs fresh sage or rosemary", "1/2 pound small pasta, such as ditalini, small shells, or orzo", "Extra-virgin olive oil, for drizzling", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place beans in a large pot and cover with lightly salted water by at least 2 inches. Add garlic, onion, carrots, celery, and rosemary or sage. Cover and bring to a boil over high heat. Reduce heat to a bare simmer and cook, topping up with water as necessary to keep beans submerged, until beans are very tender and creamy with no graininess left, 1 to 2 hours depending on type of bean. Beans can also be cooked in a pressure cooker at low pressure for 25 minutes if using kidney or cannellini beans, or 30 minutes if using chickpeas. Discard onions, garlic, carrots, celery, and herbs. Drain beans, reserving beans and liquid separately. You should have about 6 cups of cooked beans.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure out 4 cups of cooked beans, setting the remaining beans (approximately 2 cups) aside. Combine the 4 cups of beans with 3 cups bean-cooking water and blend until completely smooth. Transfer bean soup to a heatproof container and add reserved cooked beans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small pot of salted boiling water, cook pasta until just short of al dente (about 3 minutes less than cooking time on package). Drain and chill under cold running water. Let drip dry, then transfer to a container. Drizzle with a small amount of olive oil and toss to lightly coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, ladle soup into a saucepan and bring to a simmer, thinning with water and seasoning with salt as necessary. Spoon in a generous amount of pasta and simmer until warmed through. Serve right away, drizzling fresh olive oil on top and a generous grinding of black pepper. Soup and pasta can be refrigerated separately for up to 3 days.</p>"}]}