{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/04/ricottagnudi.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["April Bloomfield", "cheese", "gnocchi", "gnudi", "Italy", "pasta", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2222222222222", "ratingCount": "9"}, "name": "Ricotta and Black Pepper Gnudi With Sage and Brown Butter", "link": "https://www.seriouseats.com/recipes/2015/04/ricotta-and-black-pepper-gnudi-spotted-pig-april-bloomfield-recipe.html", "description": "Normally I'm all about innovation and deep digging and hardcore testing here at The Food Lab. But this time I'm starting with a dish so iconic, so incredible, so damn-near-flawless in its original form that the best I can possibly hope to do is tweak it just a bit to suit my very particular personal tastes. I'm talking about the ricotta gnudi at The Spotted Pig, April Bloomfield's West Village gastropub. Thin, thin pasta surrounds a core of creamy, explosive sheep's milk ricotta all served in a brown butter and sage sauce. And the good news is that my favorite dish isn't even that hard to make.", "totalTime": "1 to 3 days", "recipeYield": "Serves 4 to 6 as an appetizer or 2 to 3 as a main course", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Father's Day", "Mains", "Mother's Day", "Other Grains", "The Food Lab", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["<strong>For the gnudi:</strong>", "16 ounces best quality fresh sheep or cow's milk ricotta", "2 ounces Parmesan cheese, plus more for serving", "Kosher salt and freshly ground black pepper", "4 cups semolina flour", "<strong>For Finishing</strong>", "3/4 stick (6 tablespoons) unsalted butter", "12 to 15 fresh sage leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the gnudi:</strong> Line a large plate with three layers of paper towels or a clean dish towel. Transfer ricotta directly to paper towels and spread with a rubber spatula. Place another triple layer of paper towels or a clean dish towel on top and press down firmly with the palms of your hands to blot excess moisture. Peel off upper paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large bowl on a scale and zero the scale. Scrape ricotta into bowl to weigh. Remove excess ricotta to leave exactly 12 ounces. Reserve excess ricotta for another use. Add Parmesan and season heavily with black pepper. Combine mixture with a rubber spatula. Season to taste with salt. Transfer to a large clean plate and spread into a thin, even layer. Transfer to freezer and let chill for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, transfer half of the semolina flour to a large bowl and the other half to a 9- by 13-inch baking dish. When ricotta is chilled, scrape it into a separate empty large bowl and fold it with a rubber spatula until no big chunks of frozen ricotta remain. Using a <a href=\"http://www.amazon.com/dp/B0000CCY1E/?tag=serieats-20\" target=\"_blank\">small cookie scoop</a>, form a ball of ricotta about 1 1/2-inches wide (about 2 tablespoons) and transfer to the bowl with the flour. Using your fingers, scoop dry flour over the top of the ricotta ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the ball is coated, gently lift it and roll it around in your hands to form a neat sphere. Transfer it to the baking dish. Repeat with remaining ricotta. You should have about 16 to 20 finished gnudi. Sprinkle any remaining semolina in the bowl over the formed gnudi. Cover baking dish with plastic wrap and refrigerate for at least 1 and up to 3 days, turning the gnudi once per day. Once gnudi have formed a skin, they can be frozen. Transfer to a large plate or a rimmed baking sheet and freeze until solid, about 1 hour. Transfer to a zipper-lock freezer bag and store in the freezer for up to 2 months. Allow to thaw on a plate covered with plastic wrap in the refrigerator overnight before cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook and Serve:</strong> Heat 2 tablespoons butter in a medium saucepan over medium-low heat until foaming subsides, butter solids are golden brown, and butter has a nutty aroma. Add sage leaves, season lightly with salt, and cook, turning the leaves occasionally, until crisp, about 2 minutes. Using tongs, transfer the leaves to a paper towel-lined plate to drain. Reserve browned butter off-heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining butter in a medium skillet. Bring a large pot of well-salted water to a boil. Add gnudi and cook, stirring very gently, for 3 minutes. Using a slotted spoon, transfer the gnudi to the skillet with the butter, making sure that plenty of pasta water gets into the pan with the gnudi.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the skillet over high heat and cook, shaking the pan and gently stirring the gnudi until the butter and pasta water emulsify into a creamy sauce, about 1 minute. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer gnudi and butter sauce to a warm serving dish or to individual plates. Top with fried sage leaves and drizzle with browned butter. Sprinkle with Parmesan and black pepper and serve immediately.</p>"}]}