{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150803-ratatouille-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["French", "summer", "vegetable"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Provençal Ratatouille", "link": "https://www.seriouseats.com/recipes/2015/08/ratatouille-provence-vegetable-stew-recipe.html", "description": "This classic Provençal summer stew features eggplant, summer squash, bell peppers, onion, garlic, and tomatoes, along with plenty of olive oil. If you can resist eating it all while it's still hot, it gets even better the next day, served slightly chilled or at room temperature.", "totalTime": "2 hours", "recipeYield": "Makes about 2 quarts", "recipeCategory": ["Dairy-Free", "French", "Mains", "Quick Dinners", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["3 cups 1/4-inch diced summer squash, such as zucchini and yellow squash (about 4 small or 2 medium squash)", "3 cups 1/4-inch diced Italian eggplant (about 1 medium eggplant)", "Kosher salt and freshly ground black pepper", "3/4 cup (12 tablespoons) extra-virgin olive oil, divided, plus more as needed", "3 cups 1/4-inch diced yellow onion (about 3 medium onions)", "6 medium cloves garlic, minced (about 2 tablespoons)", "3 cups 1/4-inch diced red and yellow bell pepper (about 4 large peppers)", "2 cups pureed canned whole tomatoes, with their juices, from 1 (28-ounce) can (see note)", "1 bouquet garni (herb bundle), made from fresh herbs such as thyme, parsley, and basil, tied together with butcher's twine (see note)", "Chopped fresh parsley leaves and tender stems, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place summer squash in a wire mesh strainer set over a bowl; place eggplant in a second wire mesh strainer and set over a second bowl. Toss both with a liberal amount of kosher salt and let stand to drain at least 15 minutes and up to 1 hour. Discard any liquid that collects in the bowls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, heat 3 tablespoons olive oil over medium-high heat until shimmering. Add onion and garlic, season with salt, and cook, stirring, until softened, about 6 minutes. Scrape onion and garlic onto a rimmed baking sheet and spread in an even layer to cool for 3 minutes. Transfer onion and garlic to a large pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add 3 more tablespoons olive oil to skillet and heat over medium-high heat until shimmering. Add bell pepper, season with salt, and cook, stirring, until softened, about 7 minutes. Scrape bell pepper onto the rimmed baking sheet in an even layer to cool for 3 minutes. Transfer bell pepper to pot with onion.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 3 more tablespoons olive oil to skillet and heat over medium-high heat until shimmering. Add summer squash and cook, stirring, until softened, about 4 minutes. Scrape onto rimmed baking sheet in an even layer to cool for 3 minutes. Transfer to pot with onion and bell pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 3 tablespoons olive oil to skillet and heat over medium-high heat until shimmering. Add eggplant and cook, stirring, until softened, about 4 minutes; add more olive oil as needed if skillet dries out while cooking eggplant. Scrape eggplant into pot with other vegetables and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set pot of vegetables over medium-high heat and stir in tomato puree and herb bundle; heat until ratatouille is gently bubbling, then lower heat to medium and cook, stirring, until tomato puree coats vegetables in a thick sauce, about 15 minutes. Discard herb bundle. Season with salt, stir in chopped parsley (if using), and drizzle with a small amount of fresh extra-virgin olive oil. Serve right away, or chill and serve either reheated, slightly chilled, or at room temperature.</p>"}]}