{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150310-sichuan-wonton-chili-oil-recipe-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "dumpling", "sichuan", "wonton"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "7"}, "name": "Sichuan-Style Wontons in Hot and Sour Vinegar and Chili Oil Sauce (Suanla Chaoshou)", "link": "https://www.seriouseats.com/recipes/2015/03/sichuan-wonton-chili-oil-suanla-chaoshou-recipe.html", "description": "Sweet and savory. Slippery and slick. Juicy and tender. Hot and sour. Garlicky. So. Freaking. Good. These are all words that should enter your head as you slide back a bowl of <em>suanla chaoshou</em>, the Sichuan-style wontons that come coated in an intensely aromatic sauce made with vinegar, garlic, and roasted chili oil.", "totalTime": "1 hour", "recipeYield": "Makes about 40 wontons, serving 6 to 8 as an appetizer or light meal", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Pork", "Snacks"], "recipeIngredient": ["<strong>For the Wontons:</strong>", "1 pound ground pork shoulder", "2 teaspoons kosher salt", "1 tablespoon sugar", "1 teaspoon finely ground white pepper", "1 1/2 ounces minced scallions or Chinese chives (about 2 scallions)", "2 teaspoons minced fresh garlic (about 2 medium cloves)", "2 teaspoons Shaoxing wine or dry sherry", "40 thin square wonton wrappers", "<strong>For the Sauce:</strong>", "4 to 8 whole hot Chinese dried red peppers (or arbol chilies), stems removed", "2 teaspoons sichuan peppercorns", "1/4 cup vegetable or canola oil", "1 tablespoon roasted sesame oil", "3 tablespoons Chinkiang vinegar (or a mixture of 2 tablespoons rice vinegar and 1 tablespoon balsamic vinegar)", "2 tablespoons soy sauce", "1 tablespoon sugar", "1 tablespoon minced fresh garlic (about 3 medium cloves)", "1 tablespoon toasted sesame seeds", "<strong>To Cook and Serve:</strong>", "2 tablespoons lightly crushed roasted peanuts (optional)", "2 tablespoons minced fresh cilantro leaves and fine stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Wontons:</strong> Combine pork, salt, sugar, white pepper, scallions, garlic, and wine in a medium bowl and knead and turn with clean hands until the mixture is homogenous and starting to feel tacky/sticky, about 1 minute. Transfer a teaspoon-sized amount to a microwave-safe plate and microwave on high power until cooked through, about 10 seconds. Taste and adjust seasoning with more salt, white pepper, and/or sugar if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a work station with a small bowl of water, a clean dish towel for wiping your fingers, a bowl with the wonton filling, a parchment-lined rimmed baking sheet for the finished wontons, and a stack of wonton wrappers covered in plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form dumplings hold one wrapper on top of a flat hand. Using a spoon, place a 2 teaspoon- to 1 tablespoon-sized amount of filling in the center of the wrapper. Use the tip of the finger on your other hand to very gently moisten the edge of the wrapper with water (do not use too much water). Wipe fingertip dry on kitchen towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully fold one tip of the wonton wrapper across to meet the opposite tip to form a triangle. Seal edges of the triangle, carefully pushing out all air from within the wrapper as you work. Pull the two corners on the hypotenuse of the newly formed triangle to meet, moistening one with a little water, crossing them and pinching to seal (see <a href=\"http://www.seriouseats.com/2015/03/how-to-make-sichuan-wontons-in-chili-oil-dumpling.html\">here for more detailed step by step instructions</a>). Transfer finished dumplings to the parchment lined baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Place chilies and Sichuan peppercorns on a microwave-safe plate and microwave on high until toasted and aromatic, about 15 seconds. Transfer to a mortar and pestle or a food processor and crush until it's about the texture of store-bought crushed red pepper flakes. Transfer to a small saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a skillet over medium heat until shimmering. Immediately pour hot oil over chili/peppercorn mixture (it should sizzle). Let cool for 5 minutes then transfer to a medium bowl. Add sesame oil and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar, vinegar, soy sauce, and garlic in a small bowl and stir until sugar is dissolved. Add chili oil mixture. Set aside until ready to use. (Sauce can be stored in a sealed container in the fridge for up to 2 weeks).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook and Serve:</strong> Bring a large pot of water to a boil. Add 12 to 16 wontons and cook until they are completely cooked through, about 4 minutes. Drain wontons and transfer to a warm serving platter. Spoon sauce on top. Sprinkle with peanuts and minced cilantro and serve immediately.</p>"}]}