{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/03/20150316-soubise-onion-sauce-roast-chicken-daniel-gritzer-07.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["chicken", "French", "onion"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Roasted Chicken With Classic or Curry Soubise (Onion Sauce)", "link": "https://www.seriouseats.com/recipes/2015/03/roasted-chicken-curry-soubise-onion-sauce-recipe.html", "description": "Soubise, an old-school French sauce classically made by pureeing softened onions with bechamel, is a great pairing for all sorts of roasted meats, like the roast chicken here. In this more modern version, it's simplified and lightened by using cream in place of the bechamel, then flavored with curry powder or vadouvan, a French variation on curry powder with garlic and shallots.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Condiments and Sauces", "French", "Mains", "Onion"], "recipeIngredient": ["1 large chicken, about 4 to 5 pounds", "Kosher salt and freshly ground black and/or white pepper", "3 tablespoons unsalted butter, 1 tablespoon softened", "2 medium onions, thinly sliced", "1 1/2 cups heavy cream", "1 teaspoon curry powder or vadouvan spice, optional (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set oven rack to upper-middle position and preheat oven to 400&deg;F. Using sharp kitchen shears, remove spine from chicken and reserve for another use (such as <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a>). Flatten chicken by placing skin side up on cutting board and applying firm pressure to breast bone. Season generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set wire rack in rimmed baking sheet lined with aluminum foil. Position chicken so that breasts are aligned with center of baking sheet and legs are close to edge. Roast for 20 minutes, then rub skin all over with the 1 tablespoon softened butter. Return to oven and cook until thickest part of breast close to bone registers 150&deg;F on an instant-read thermometer and joint between thighs and body registers at least 170&deg;F, 25 to 45 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium saucepan, melt remaining 2 tablespoons butter over medium heat until foaming. Add onions and cook, stirring frequently, until softened and most liquid has evaporated, about 20 minutes. Stir in cream and simmer for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer hot onions and cream to a blender. Add curry powder or vadouvan if using, and blend, starting at low speed and gradually increasing to high, until a smooth sauce forms. If desired, pass sauce through a fine-mesh strainer, pressing on solids with a spoon, for an even more refined texture. Return onion sauce to saucepan and season with salt and white pepper (note that sauce should have a texture that's thicker than most sauces but thinner than a puree). Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve chicken and serve, spooning sauce all around.</p>"}]}