{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150222-Tarte-Flambee-daniel-gritzer-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["cheese", "easy", "French", "onion", "pizza", "tortilla pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Bar-Style Tarte Flambée (Alsatian Pizza With Fresh Cheese, Onions, and Bacon)", "link": "https://www.seriouseats.com/recipes/2015/02/quick-easy-bar-style-tarte-flambee-alsatian-pizza-recipe.html", "description": "It looks like a pizza, it cooks like a pizza, but don't make the mistake of actually thinking it's a pizza. Tarte flambée, the Alsatian flatbread topped with fromage blanc (a fresh, tart, spreadable cheese), thinly sliced raw onions and bacon, is as Franco-Germanic in flavor as can be. This method delivers a bar-style tart, cooked on a flour tortilla in a cast iron skillet, then browned under the broiler. It has a thin, cracker-like crust that is irresistible.", "totalTime": "25 minutes", "recipeYield": "Makes about 6 (10-inch) bar-style pies", "recipeCategory": ["Bacon", "Cheese", "French", "Mains", "Onion", "Pizza", "Quick Dinners"], "recipeIngredient": ["1 cup fromage blanc (see note)", "1/2 cup crème fraîche (see note)", "Kosher salt and freshly ground black pepper", "Pinch freshly grated nutmeg", "Vegetable oil, for skillet", "6 (10-inch) flour tortillas", "1 medium white or yellow onion, very thinly sliced", "1/4 pound sliced bacon, cut crosswise into thin strips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to 6 to 8 inches below broiler element and preheat broiler to high. In a medium bowl, whisk together fromage blanc and crème fraîche together until thoroughly incorporated. Season with salt and pepper; whisk in nutmeg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 teaspoon oil in a large cast iron skillet over high heat until shimmering. Reduce heat to low and wipe out excess oil with a paper towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working 1 tortilla at a time, place tortilla in skillet with the rougher textured-side facing down. Spread 1/4 cup fromage blanc mixture over tortilla all the way to the edges.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scatter a small amount of onion on top, all the way to the edge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scatter small amount of bacon on top, all the way to the edge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place skillet under broiler and broil until bacon is cooked and tarte flambée is browned in spots, 2 to 4 minutes. Remove from oven. Using a small metal spatula, peek under bottom. If more crispness is desired, place skillet over medium-heat and cook, swirling tarte and peeking occasionally, until desired crispness is achieved. Slide tarte out onto a cutting board. Cut and serve immediately. Wipe out skillet and repeat with remaining tortillas and toppings.</p>"}]}