{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150622-jalea-fried-seafood-peruvian-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Latin American", "keywords": ["deep fry", "fish", "latin", "Latin American", "Peruvian", "seafood", "South American"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Peruvian Fried Seafood Platter With Lime-Marinated Onion and Tomato Salad (Jalea)", "link": "https://www.seriouseats.com/recipes/2015/06/jalea-peruvian-fried-seafood-salsa-criolla-recipe.html", "description": "One of the world's great fried seafood dishes, <em>jalea</em> features a pile of mixed fried seafood including fish, shrimp, and calamari that's topped with a bright, refreshing, slightly spicy salad of lime-marinated red onion, tomato, and cilantro. This version is made with a beer batter that comes out incredibly light and crisp.", "totalTime": "1 hour", "recipeYield": "Serves 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fish", "Latin American", "Mains", "Sides"], "recipeIngredient": ["<strong>For the Salsa Criolla:</strong>", "1/2 large red onion, very thinly sliced", "2 medium plum tomatoes, diced", "1/4 cup loosely packed chopped cilantro leaves and tender stems", "1 fresh <em>aji amarillo</em> pepper, stemmed, seeded, and minced (see note)", "1 medium clove garlic, minced", "1/4 cup fresh juice from 3 limes", "Kosher salt", "<strong>For the Fried Seafood:</strong>", "1 1/2 to 2 quarts peanut, canola, or vegetable oil", "4 1/2 cups all-purpose flour, divided", "3/4 cup cornstarch", "1 1/2 teaspoons baking powder", "Kosher salt and freshly ground black pepper", "1/2 teaspoon paprika", "2 cups light beer, divided", "1/2 pound skinned and boned firm white-fleshed fish, such as halibut, wild striped bass, or cod, sliced into 1 1/2- by 1-inch pieces", "1/2 pound shelled and deveined large shrimp", "1/3 pound cleaned squid bodies and tentacles, bodies sliced crosswise into 1/2-inch rings", "<strong>To Serve:</strong>", "<a href=\"http://www.seriouseats.com/recipes/2012/09/fried-yuca-with-spicy-mayo-recipe.html\">1 recipe Fried Yuca With Spicy Mayo</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salsa Criolla:</strong> In a large bowl, toss onion, tomatoes, cilantro, aji amarillo, garlic, and lime juice together until well combined. Season with salt. Let stand, stirring occasionally, until onions soften slightly and turn a brighter pink color, about 10 minutes. Drain well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fried Seafood:</strong> Preheat oven to 400&deg;F. In a fryer, medium pot, or wok, heat oil to 350&deg;F, adjusting heat source as needed to maintain temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, add 1 1/2 cups flour to a large bowl with corn starch, baking powder, 1 1/2 teaspoons salt, 3/4 teaspoon ground black pepper, and paprika. Whisk to combine. Add 1 1/2 cups beer, whisking to form a thick batter; some small lumps of flour are okay. In a separate medium bowl, add remaining 3 cups flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dredge white-fleshed fish in flour, shake off excess, and transfer to beer batter, turning to coat. Working 1 piece at a time, pick up the fish and allow excess batter to drip back into the bowl (a wire strainer can be helpful with this). Return it to the bowl with dry flour and quickly coat it on both sides. Repeat with remaining fish. Pick up the fish pieces with your hands, tossing them gently in your open fingers to get rid of excess flour. Carefully lower into the hot oil and fry, agitating and turning frequently, until golden brown outside, about 3 minutes. Transfer fish to large paper towel-lined mixing bowl and season with salt, shaking gently to absorb oil. Transfer fish to a wire rack set over a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase oil temperature to 375&deg;F, adjusting heat to maintain temperature. Repeat dredging and battering process with shrimp and fry until golden, 2 to 3 minutes. Transfer to the large mixing bowl lined with fresh paper towels and season with salt, shaking gently to absorb oil. Transfer shrimp to wire rack with fish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk remaining 1/2 cup beer into batter until thoroughly incorporated (this will thin the batter slightly, making the squid easier to work with). Repeat dredging process with squid, making sure to drain each piece well of batter before the final coating in flour. Fry until golden, about 2 minutes. Transfer to the same large mixing bowl once again lined with fresh paper towels and season with salt. Shake gently to absorb excess oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> If fried seafood has cooled, set in oven until reheated, about 3 minutes. Mound fried seafood on a plate. Arrange Salsa Criolla on top and serve immediately with fried yuca and its dipping sauce.</p>"}]}