{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150206-pasta-topping-olive-parm-miso-vegan-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["Italian", "mint", "olive", "pasta", "tomato", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Zucchini and Roasted Tomatoes With Pasta and Dried Olive Flavor Shake", "link": "https://www.seriouseats.com/recipes/2015/02/roasted-zucchini-tomato-pasta-olive-mint-kenji-vegan.html", "description": "Deeply flavored roasted zucchini and tomatoes are the star of the dish; pasta just plays a supporting role. Slow-cooking garlic and rosemary infuses olive oil with flavor that fills the entire bowl, while a dusting of our dehydrated olive and miso shake gives it over-the-top savory flavor.", "totalTime": "45 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Dairy-Free", "Italian", "Mains", "Olives", "Pasta", "Quick Dinners", "The Food Lab", "Tomato", "Vegan", "Vegetarian", "Zucchini"], "recipeIngredient": ["1 1/2 pounds cherry tomatoes, split in half", "6 tablespoons extra-virgin olive oil, divided, plus more for serving", "2 large zucchini (about 12 ounces each), split in half lengthwise and cut into 1/2-inch slices", "Kosher salt and freshly ground black pepper", "6 medium cloves garlic, thinly sliced", "2 tablespoons roughly chopped fresh rosemary leaves, stems reserved", "1 1/2 cups your favorite store-bought or <a href=\"http://www.seriouseats.com/recipes/2014/09/the-best-slow-cooked-italian-american-tomato-sauce-red-sauce-recipe.html\">homemade</a> marinara sauce", "12 ounces fresh or 8 ounces dried short tubular pasta such as rigatoni or penne", "1/4 cup roughly chopped fresh mint leaves", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2015/02/dried-olive-miso-rosemary-shake-condiment-vegan-parmesan-replacement-recipe.html\">Dried Olive and Miso Shake</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper-middle position and preheat oven to 425&deg;F. Toss tomatoes in a large bowl with 2 tablespoons olive oil. Season with salt and pepper. Transfer to a foil-lined rimmed baking sheet, skin side down. Transfer to oven and roast until tomatoes have collapsed and are lightly charred in spots, about 30 minutes total. Remove from oven and set aside to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 more tablespoons of olive oil in a large non-stick or cast iron skillet over high heat until shimmering. Add zucchini, season with salt and pepper, and cook without moving until well browned on first side, about 3 minutes. Toss and stir and continue to cook, shaking pan occasionally, until well browned all over, about 6 minutes total. Transfer zucchini to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Meanwhile, heat remaining 2 tablespoons olive oil, garlic, and rosemary in the now-empty skillet over medium-low heat. As soon as garlic starts releasing bubbles, reduce heat to lowest setting. Cook, stirring frequently, until garlic is very pale golden brown and aromatic, about 8 minutes. Add tomato sauce to skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When tomatoes are finished roasting, add them to the skillet with the sauce. Add zucchini and toss to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pasta in large pot of salted water according to package directions. Drain, reserving 1 cup of cooking liquid. Add pasta to skillet with vegetables along with 1/2 cup of cooking liquid. Cook on high heat, tossing and stirring constantly until sauce thickens and clings to the pasta, about 1 minute. Stir in half of mint leaves and 2 tablespoons of <a href=\"http://www.seriouseats.com/recipes/2015/02/dried-olive-miso-rosemary-shake-condiment-vegan-recipe.html\">Dried Olive and Miso Shake</a>. Transfer to a serving dish, garnish with remaining mint, sprinkle with more <a href=\"http://www.seriouseats.com/recipes/2015/02/dried-olive-miso-rosemary-shake-condiment-vegan-parmesan-replacement-recipe.html\">Dried Olive and Miso Shake</a>, drizzle with olive oil, and serve immediately.</p>"}]}