{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151217-cheese-ball-trio-base-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["appetizer", "cheese", "cheese ball", "dip", "easy", "hors d'oeuvre"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Updated Cheese Ball Trio", "link": "https://www.seriouseats.com/recipes/2015/12/cheese-ball-trio-updated-retro-recipe-appetizer.html", "description": "There is one mid-century dish that does not deserve to be lumped in with the other molds and loaves. It, too, involves processing ingredients until smooth and then molding them into an unnatural shape. It's the cheese ball, and it's actually delicious. But how do we inject some allure into the kitsch? We take away the junk (I'm looking at you, waxy pre-shredded cheddar), we use more flavorful ingredients, and we give people <em>options</em>. Nothing says sultry like a tray full of cheesy choices, am I right?", "totalTime": "3 hours", "recipeYield": "makes 3 cheese balls", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Christmas"], "recipeIngredient": ["<strong>For the Base</strong>:", "3 (8-ounce) packages cream cheese, at room temperature (675g)", "2 tablespoons freshly squeezed lemon juice (30ml)", "1/2 teaspoon kosher salt (2g)", "1/4 teaspoon pepper (1g)", "1/4 cup minced fresh chives (about .25 ounces; 7g)", "<strong>For the Goat Cheese, Lemon, and Herb Cheese Balls</strong>:", "1/3 of base mixture (about 1 1/4 cups)", "8 ounces fresh goat cheese (225g)", "3/4 cup assorted fresh herbs such as chives, mint, basil, and parsley, finely minced (175ml)", "2 teaspoons freshly grated lemon zest (10ml)", "Coarsely ground black pepper", "<strong>For the Blue Cheese, Toasted Walnut, and Pomegranate Cheese Balls</strong>:", "1/3 of the base mixture (about 1 1/4 cups)", "8 ounces crumbled blue cheese (225g)", "2/3 cup toasted walnuts, chopped (about 4 ounces; 115g)", "1/3 cup pomegranate seeds (about 2 ounces; 55g)", "<strong>For the Feta Cheese, Sun-Dried Tomato, and Pine Nut Cheese Balls</strong>:", "1/3 of the base mixture (about 1 1/4 cups)", "8 ounces crumbled feta cheese (225g)", "10 small sun-dried tomatoes (about 2 ounces; 55g)", "1 cup toasted pine nuts (about 6 ounces; 170g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Base:</strong> In the bowl of a food processor, combine the cream cheese, lemon juice, salt, and pepper, and process until smooth, about 30 seconds. Add the chives and process again until just combined. Remove from the food processor and divide into thirds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Goat Cheese, Lemon, and Herb Cheese Balls</strong>: Add 1/3 of base mixture to the bowl of a clean food processor. Add goat cheese and process until smooth and well-combined. Transfer mixture to a sealable container and refrigerate until firm, 30 minutes to 1 hour. Transfer mixture to the center of a large sheet of plastic wrap. Wrap the cheese firmly in the plastic wrap and use your hands to mold into a sphere. Place the plastic-wrapped ball back in the refrigerator and chill until firm again, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine herbs, lemon zest, and plenty of ground black pepper on a large plate. Remove the goat cheese ball from the plastic wrapping and roll it in the chopped herbs until fully coated. Refrigerate until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Blue Cheese, Toasted Walnut, and Pomegranate Cheese Balls</strong>: Add 1/3 of base mixture to the bowl of a clean food processor. Add blue cheese and process until smooth and well-combined. Transfer mixture to a sealable container and refrigerate until firm, 30 minutes to 1 hour. Transfer mixture to the center of a large sheet of plastic wrap. Wrap the cheese firmly in the plastic wrap and use your hands to mold into a sphere. Place the plastic-wrapped ball back in the refrigerator and chill until firm again, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chopped walnuts and pomegranate seeds on a large plate. Remove the blue cheese ball from the plastic wrapping and roll it in the chopped nuts until fully coated. Refrigerate until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Feta Cheese, Sun-Dried Tomato, and Pine Nut Cheese Balls</strong>: Add 1/3 of base mixture to the bowl of a clean food processor. Add feta and sun-dried tomatoes and process until smooth and well-combined. Transfer mixture to a sealable container and refrigerate until firm, 30 minutes to 1 hour. Transfer mixture to the center of a large sheet of plastic wrap. Wrap the cheese firmly in the plastic wrap and use your hands to mold into a sphere. Place the plastic-wrapped ball back in the refrigerator and chill until firm again, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread toasted pine nuts on a large plate. Remove the feta cheese ball from the plastic wrapping and roll it in the chopped nuts until fully coated. Refrigerate until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve cheese balls with chips, pita, crostini, crackers, pretzels, or vegetables.</p>"}]}