{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/12/20151110-coconut-macaroons-vicky-wasik-001.jpg", "author": {"@type": "Person", "name": "Grace Parisi"}, "recipeCuisine": "", "keywords": ["chocolate", "coconut", "cookie", "macaroon"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.25", "ratingCount": "4"}, "name": "The Best Chocolate-Dipped Coconut Macaroons", "link": "https://www.seriouseats.com/recipes/2015/12/the-best-coconut-macaroons-recipe.html", "description": "Chewy on the inside, crunchy on the outside, coconutty all the way through, these are nothing like the <em>oh-la-la</em> pink, purple, or green <em>macarons</em> that replaced the cupcake for Hot Bakery Trend of 2008. Coconut macaroons are what cemented my coconut addiction many years ago, and this recipe is my updated version, developed through dozens of tests to perfect the texture, flavor, and appearance.", "totalTime": "2 hours", "recipeYield": "Makes 18 macaroons", "recipeCategory": ["Chocolate", "Christmas", "Coconut", "Cookies", "Passover"], "recipeIngredient": ["6 ounces dried unsweetened, shredded coconut (about 1 1/2 cups; 170g)", "6 tablespoons (90mL) sweetened condensed milk or dulce de leche (see note)", "2 teaspoons (10mL) nut liqueur or brandy", "1/2 teaspoon (2.5mL) vanilla paste (or 1/2 vanilla bean, seeds scraped)", "1 large egg white, at room temperature", "Pinch of salt", "2 1/2 tablespoons (30g) sugar", "4 ounces (115g) bittersweet chocolate, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 325&deg;F. Spread coconut out on a baking sheet and toast until lightly golden, stirring occasionally, about 12 minutes. Alternatively, place coconut in a single layer on a microwave-safe plate and microwave at 30-second intervals until lightly golden, about 2 minutes total. Let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine sweetened condensed milk with liqueur, vanilla paste, and coconut and stir until evenly moistened.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl with a handheld electric mixer or in the bowl of a stand mixer fitted with the whisk attachment, beat egg white with salt at high speed until soft peaks form. With the mixer running, slowly add the sugar and beat until firm and glossy, about 30 seconds longer. Using a rubber spatula, fold beaten egg white into the coconut mixture. (Don't worry about deflating the white.) Scoop 18 mounds onto a parchment-lined baking sheet and bake until lightly golden, about 18 minutes. Let cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate:</strong> Put half of the chocolate into a microwave-safe bowl and microwave on high power in 30-second bursts, stirring in between bursts, until fully melted. Scrape the melted chocolate into a cool, clean bowl and add the remaining chopped chocolate. Stir until chocolate is melted and registers 90&deg;F on an instant-read thermometer. Dip the bottom of each macaroon in the chocolate, scraping off the excess, and set on a parchment-lined rimmed baking sheet. Drizzle any remaining chocolate on top. Refrigerate until set, about 10 minutes, then peel off the parchment and transfer the macaroons to an airtight container. The macaroons can be stored at room temperature for up to 1 week.  </p>"}]}