{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150125-pressure-cooker-chile-con-carne-recipe-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "chile con carne", "chili", "texas", "Texas chili", "Texas red"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4444444444444", "ratingCount": "9"}, "name": "1-Hour Pressure Cooker Texas-Style Chile Con Carne", "link": "https://www.seriouseats.com/recipes/2015/01/pressure-cooker-chile-con-carne-texas-red-chili-recipe.html", "description": "Real Texas chile con carne is all about the beef and the chilies. In this version, we start with toasted whole dried chilies and puree them with broth and spices before adding beef chuck and cooking the whole thing down in a pressure cooker. 30 minutes later, you've got spoon-tender chunks of beef in a rich, complex chili-based stew.", "totalTime": "1 hour", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Beef", "Chili", "Mains", "Pressure Cooker", "Quick Dinners"], "recipeIngredient": ["3 whole sweet fresh dried chilies like Costeño, New Mexico, or Choricero, stems and seeds removed", "2 small hot dried chilies like Arbol or Cascabel, stems and seeds removed", "3 whole rich fruity dried chilies like Ancho, Mulatto, Negro, or Pasilla, stems and seeds removed", "1 1/2 quarts <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or store-bought low-sodium broth", "2 whole Chipotle dried chilies canned in adobo sauce, plus 2 tablespoons sauce, stems and seeds removed", "4 pounds whole beef chuck, trimmed of excess gristle and fat, cut into 2 to 3 large steaks", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable oil", "1 large onion, finely diced", "4 medium cloves garlic, minced", "1/2 teaspoon powdered cinnamon", "1 tablespoon ground cumin", "1/4 teaspoon ground allspice", "2 teaspoons dried oregano", "2 tablespoons Asian fish sauce, plus more to taste", "2 to 3 tablespoons <em>masa harina</em> (optional)", "2 tablespoons apple cider vinegar", "Hot sauce, to taste", "Cilantro, chopped onions, scallions, grated cheese, avocado, and warm tortillas for serving as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add dried chiles to large heavy-bottomed Dutch oven or stock pot and cook over medium-high heat, stirring frequently, until slightly darkened with intense, roasted aroma, 2 to 5 minutes. Do not allow to smoke. Remove chiles to small bowl and set aside. Alternatively, place dried chilies on a microwave-safe plate and microwave on high power in 15-second increments until pliable and toasted-smelling, about 30 seconds total. Transfer to a 2-quart microwave-safe liquid measuring cup or bowl. Add chicken broth and chipotle chilies, cover with plastic wrap, and microwave on high power until gently simmering, about 5 minutes. Remove from microwave and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season chuck steaks generously with salt and pepper. Heat oil in the base of an <a href=\"http://www.amazon.com/Breville-BPR600XL-Fast-Slow-Cooker/dp/B009OZ624K/?tag=serieats-20\" target=\"_blank\">electric</a> or <a href=\"http://www.amazon.com/Presto-01370-8-Quart-Stainless-Pressure/dp/B0000Z6JIW/?tag=serieats-20\" target=\"_blank\">stovetop pressure cooker</a> over high heat until just starting to smoke. Add half of beef chuck in a single layer and cook without moving until deeply browned, about 6 minutes. Flip steaks and brown second side, 3 to 4 minutes longer. Transfer steaks to a cutting board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions to pressure cooker and cook, stirring frequently until translucent and softened, about 2 minutes. Add garlic, cinnamon, cumin, allspice, and oregano, and cook, stirring constantly, until fragrant, about 1 minute. Add the soaked chilies and the chicken broth and bring to a simmer. Transfer mixture to the jar of a blender. Blend, starting on the lowest possible setting and gradually increasing speed to high (make sure to hold the lid down with a clean kitchen towel or a potholder to prevent it from blowing out). Blend until smooth, about 1 minute. Return purée to the pressure cooker.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the seared and raw chuck steaks into 1 1/2- to 2-inch chunks and transfer to the pressure cooker. Bring to a simmer, season gently with salt and pepper, seal pressure cooker, and cook on high pressure for 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Release pressure using quick release valve on an electric cooker or running under cold water for a stovetop cooker. Remove lid. Stir in fish sauce, masa harina (if using), and vinegar. Add hot sauce to taste. Simmer until thickened to desired consistency, about 5 minutes. Season to taste with salt. For best results, allow chili to cool and store in the refrigerator at least overnight and up to five days. Reheat the next day to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve, garnished with cilantro, chopped onions, scallions, grated cheese, avocado, and warm tortillas as desired.</p>"}]}