{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150123-baked-jalapeno-poppers-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["cheese", "game day", "jalapeño", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crispy and Gooey Baked Jalapeño Poppers", "link": "https://www.seriouseats.com/recipes/2015/01/crispy-gooey-baked-jalapeno-cheese-poppers-recipe.html", "description": "Creating a baked jalapeño popper that has a crisp and crunchy exterior and a creamy melted-cheese filling isn't an easy project, but this recipe delivers it all.", "totalTime": "2 hours", "recipeYield": "Serves 6-8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Snacks", "Vegetarian"], "recipeIngredient": ["8 ounces Monterey Jack cheese, grated on large holes of a box grater", "3 ounces sharp cheddar, grated on large holes of a box grater\t", "1 tablespoon cornstarch", "1/2 cup evaporated milk", "2 teaspoons hot sauce, such as Frank's RedHot", "1 pound jalapeños, stemmed, sliced into 1/2-inch rings, and seeded", "2 cups cornflakes", "3/4 cup panko breadcrumbs", "3 cups buttermilk", "1 1/2 cups all-purpose flour", "1/3 cup bacon fat or canola oil", "1 batch <a href=\"http://www.seriouseats.com/recipes/2012/05/roasted-tomato-salsa.html\">roasted tomato salsa</a> or your favorite salsa, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place Monterey Jack and cheddar cheeses in a medium bowl and toss with cornstarch until evenly coated. Transfer cheese to a medium saucepan and add evaporated milk and hot sauce. Place over low heat and cook, whisking constantly, until melted and thickened, about 5 minutes. Let stand until cooled to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange jalapeño rings on a parchment-lined baking sheet. Spoon cheese sauce into jalapeño rings, patting down with fingers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cornflakes and breadcrumbs in the workbowl of a food processor and pulse until cornflakes are finely processed. Transfer breading mixture to a shallow bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place buttermilk and flour in separate shallow bowls. Working one at a time, dunk a jalapeño slice into buttermilk and then roll around in flour until completely coated. Dunk jalapeño slice back into buttermilk and then roll around in breadcrumb mixture until completely coated. Transfer to a wire rack set in a rimmed baking sheet. Repeat with all jalapeño rings. Transfer baking sheet to refrigerator and let cool for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F. Brush breaded jalapeños all over with bacon fat or oil. Transfer baking sheet to oven and cook until cheese is heated throughout and outsides are browned and crisp, 20-25 minutes. Remove from oven and transfer jalapeño poppers to a tray. Serve immediately.</p>"}]}