{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150916-chicken-paprikash-kenji-08.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["central european", "chicken", "chicken paprikash", "comfort", "hungarian", "paprika", "spaetzle", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8571428571429", "ratingCount": "7"}, "name": "The Best Chicken Paprikash", "link": "https://www.seriouseats.com/recipes/2015/11/best-chicken-paprikash-recipe.html", "description": "This version of chicken paprikash takes a few extra steps to ensure the best possible flavor. Searing the chicken produces a more complex sauce while adding gelatin to chicken broth gives it a richer mouthfeel. The recipe is a little more complicated than your average chicken paprikash, but the results are well worth the effort.", "totalTime": "1 hour 10 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["1 cup <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 (.25 ounce) packet powdered gelatin (about 2 1/2 teaspoons)", "4 whole chicken legs, split into thighs and drumsticks (about 2 pounds)", "Kosher salt and freshly ground black pepper", "1 tablespoon vegetable oil", "1 large yellow onion, thinly sliced (about 1 1/2 cups)", "1 red bell pepper, thinly sliced (optional, see note)", "1/4 cup (1 ounce) high quality Hungarian sweet paprika (see note)", "1 bay leaf", "1/2 cup sour cream, plus more for garnish", "1/2 teaspoon Asian fish sauce", "1 teaspoon juice from 1 lemon", "Minced fresh parsley leaves or dill (optional)", "Egg noodles, boiled potatoes, or <a href=\"http://www.seriouseats.com/2011/05/how-to-make-spatzle-spaetzle-pasta.html\">spaetzle</a> for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour chicken stock into a 1-cup liquid measuring cup and sprinkle gelatin over the top. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season chicken pieces generously on all sides with salt and pepper. Heat vegetable oil in a large straight-sided sauté pan or a Dutch oven over medium-high heat until lightly smoking. Add chicken pieces skin-side-down in a single layer and cook without moving until deep golden brown, about 8 minutes. As the chicken pieces finish browning, flip them over and cook until the second side is light golden brown, about 2 minutes longer. Transfer chicken to a large plate and set aside. Pour off all but 1 tablespoon of fat from pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions and bell peppers (if using) to the pan and cook, stirring and scraping up any browned bits from the bottom, until the onions are tender and just starting to brown, about 5 minutes. Add paprika and cook, stirring, until fragrant and nutty, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add stock/gelatin mixture and scrape up anything stuck to the bottom of the pan, stirring constantly. Add bay leaf. Nestle seared chicken pieces back into the sauce, leaving them skin-side up. Reduce heat to lowest setting, cover pan, and cook until chicken is completely tender, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken pieces and set aside on a large plate. Whisk sour cream, fish sauce, lemon juice, and half of minced parsley or dill into sauce. Season to taste with salt and more paprika if desired. Return chicken to pan and turn to coat in sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately over noodles, boiled potatoes, or <a href=\"http://www.seriouseats.com/2011/05/how-to-make-spatzle-spaetzle-pasta.html\">spaetzle</a>, tossing the noodles or potatoes with the sauce and placing the chicken on top. Garnish with more sour cream, paprika, and minced fresh parsley or dill (if using)</p>"}]}