{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150429-tamales-with-green-chili-and-pork-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Mexican", "keywords": ["carnitas", "corn", "masa", "Mexican", "pork", "tamale"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tamales With Green Chili and Pork", "link": "https://www.seriouseats.com/recipes/2015/05/tamales-green-chili-pork-recipe.html", "description": "A green chili made of roasted poblanos, tomatillos, and cilantro provides a bright and fruity base for the rich pork carnitas in these light and tender tamales.", "totalTime": "2 1/2 hours", "recipeYield": "Makes approximately 30 tamales", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Corn", "Mexican", "Pork", "Snacks"], "recipeIngredient": ["4 medium poblano peppers", "1 medium jalapeño", "1 pound tomatillos, husked, washed, and halved", "3 mediums cloves garlic, smashed and peeled", "1 cup packed roughly chopped fresh cilantro leaves and tender stems", "1 cup <a href=\"http://www.seriouseats.com/2014/10/how-to-make-rich-flavorful-easy-chicken-stock.html\">homemade chicken stock</a> or low-sodium broth", "2 tablespoons juice from 1 lime", "Kosher salt", "Sugar, to taste", "4 cups shredded <a href=\"http://www.seriouseats.com/recipes/2010/07/no-waste-tacos-de-carnitas-with-salsa-verde-recipe.html\">pork carnitas</a> (see note)", "1 recipe basic <a href=\"http://www.seriouseats.com/recipes/2015/05/basic-mexican-tamale-dough-recipe.html\">tamale dough</a>", "3 dozen dried corn husks, soaked in water for at least 1 hour", "<a href=\"http://www.seriouseats.com/recipes/2013/02/basic-salsa-verde-mexican-tomatillo-recipe.html\">Salsa verde</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler. Roast poblanos and jalapeño peppers directly over the flame of a gas stove, grill, or under a hot broiler, turning occasionally, until skin is completely charred and blackened all over. Place in a bowl, cover with plastic wrap, and let stand until cool enough to handle, 10 to 15 minutes. Using paper towels, run off charred skins, then stem and seed peppers. Transfer to the jar of a blender and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place tomatillos on a baking sheet, cut sides down. Broil until tomatillos have charred and softened, about 10 minutes. Transfer to blender with peppers, along with any liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add garlic, cilantro, chicken stock and lime juice and puree until smooth. Transfer salsa to a large bowl and season with salt and sugar to taste. Stir in shredded pork and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working one at a time, place a corn husk on work surface. Place 2-3 tablespoons of tamale dough on larger end of husk and spread into a rectangle approximately 1/4 inch thick, leaving a 1-inch border around edges of husk. Place a heaping tablespoon of filling in a line down center of dough. Fold over sides of husk so dough surrounds filling, then fold bottom of husk up and secure closed by tying a thin strip of husk around tamale. Repeat with remaining husks, dough, and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large pot with 1 inch of water and bring to a boil. Rest tamales upright in a steamer insert or on rack above the water level. Cover and steam until dough is cooked through and pulls away easily from the husk, about 1 hour. Remove tamales from steamer and let rest until dough firms up, about 15 minutes. Serve immediately with salsa verde or store in refrigerator for up to a week or freeze for up to four months. Defrost and reheat tamales in steamer until warmed through or in microwave on high for 2 minutes.</p>"}]}