{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150529-cold-ramen-hiyashi-chuka-shao-zhong-4.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Japanese", "keywords": ["Asian", "fish", "Japanese", "noodle", "ramen", "seafood", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Hiyashi Chuka (Cold Ramen) With Shrimp, Ham, and Vegetables", "link": "https://www.seriouseats.com/recipes/2015/06/hiyashi-chuka-cold-ramen-easy-summer-noodle-recipe.html", "description": "When the heat starts to climb, I try to use my oven as little as possible. One of my favorite chilled meals: <em>hiyashi chuka</em>, chilled ramen topped all sorts of goodies and tossed in a bright, simple dressing.", "totalTime": "30 minutes", "recipeYield": "4 servings", "recipeCategory": ["Fish", "Japanese", "Mains", "Ramen"], "recipeIngredient": ["4 servings fresh ramen noodles (about 22 ounces total; see note)", "1/4 pound large shrimp, shelled and deveined", "1 ear of cooked corn, kernels sliced off and cob discarded", "1 egg, beaten", "3 tablespoons soy sauce", "3 tablespoons rice vinegar", "1 tablespoon sugar", "1 tablespoon water", "1 teaspoon grated fresh peeled ginger", "1 teaspoon toasted sesame oil", "1/2 teaspoon hot chili oil", "1 teaspoon toasted sesame seeds", "1/4 pound sliced cooked ham, cut into strips", "4 sticks immitation crab meat, shredded into thin strips", "1 large tomato, halved, then thinly sliced", "2 scallions, white and light green parts only, thinly sliced on the bias", "Spicy Japanese mustard, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot of salted boiling water, cook ramen noodles until tender and springy. Drain in a colander, rinse under cold running water, and let drip dry. Set aside. (If they being to clump or stick, run under cold water again to loosen.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan of simmering salted water, poach shrimp until just cooked through, about 3 minutes. Chill under cold running water, then slice in half lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small nonstick skillet, cook beaten egg over medium heat until set in a thin sheet like an omelette, about 3 minutes; cover during last minute to set the top. Remove from skillet, let cool 1 minute, then roll and thinly slice into strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small mixing bowl, stir together soy sauce, rice vinegar, sugar, water, grated ginger, sesame oil, hot oil, and toasted sesame seeds. Set dressing aside in the refrigerator to chill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, place chilled drained noodles in serving bowls. Top the noodle with shrimp, corn, scallion, ham, tomato, crab stick, and sliced egg. Add a dollop of hot Japanese mustard in the middle. Divide dressing into 4 small bowls and serve. To eat, pour dressing on top of the noodles at the table, toss to combine, and enjoy right away.</p>"}]}