{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150730-anova-sous-vide-rib-guide-food-lab-03-j-kenji-lopez-alt.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barbecue", "barbecue rib", "low carb", "pork", "rib"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "15"}, "name": "Sous Vide Barbecue Pork Ribs", "link": "https://www.seriouseats.com/recipes/2015/09/sous-vide-pork-ribs-recipe-food-lab.html", "description": "I was a skeptic at first, but I'm going to say it now: When done properly, ribs cooked sous vide are every bit as good as traditional barbecue, if not better. Not only that, but they're far more replicable, they take much less effort, they take less practice, and, to top it off, they can be cooked year-round, indoors.", "totalTime": "16 to 50 hours", "recipeYield": "Makes 2 racks of ribs, serving 4", "recipeCategory": ["Dairy-Free", "Gluten-Free", "Grilling", "Mains", "Pork", "Sous Vide", "The Food Lab"], "recipeIngredient": ["<strong>For the Spice Rub:</strong>", "1/3 cup paprika", "1/3 cup dark brown sugar", "1/4 cup kosher salt", "1 teaspoon Prague Powder #1 (optional; see note)", "2 tablespoons whole yellow mustard seed", "1 teaspoon freshly ground black pepper", "2 tablespoons granulated garlic powder", "1 tablespoon dried oregano", "1 tablespoon whole coriander seed", "1 teaspoon red pepper flakes", "<strong>For the Sauce</strong> (if making sauced ribs):", "1 medium yellow onion, grated on the large holes of a box grater", "1 1/2 cups (360ml) ketchup", "2 tablespoons (30ml) spicy brown mustard", "1/3 cup (80ml) dark molasses", "1/4 cup (60ml) Worcestershire sauce", "1/4 cup (60ml) apple cider vinegar", "3/4 teaspoon (3ml) Wright’s or Colgin <dorado id=\"liquid-smoke\" class=\"text\">liquid hickory smoke</dorado>", "<strong>For the Ribs:</strong>", "2 whole racks <a href=\"http://www.seriouseats.com/2014/05/how-to-trim-pork-spare-ribs-st-louis-style.html\">St. Louis–cut</a> pork ribs", "About 3/4 teaspoon (3ml) Wright’s or Colgin liquid hickory smoke"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spice Rub:</strong> Working in batches, combine the paprika, brown sugar, salt, Prague Powder (if using), mustard seed, black pepper, garlic powder, oregano, coriander seed, and red pepper flakes in a <a href=\"https://www.seriouseats.com/2018/02/the-best-spice-grinders.html\">spice grinder</a> and reduce to a fine powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce (if using):</strong> Combine 3 tablespoons spice rub, grated onion, ketchup, mustard, molasses, Worcestershire sauce, vinegar, and liquid smoke in a medium saucepan and whisk to combine. Bring to a bare simmer and cook until reduced and thickened, about 20 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Prepare the Ribs:</strong> Remove the papery membrane on the back of the ribs, using a paper towel or kitchen towel to grip it and pulling it away in one piece. Divide each rack of ribs into three to four portions with three to four ribs each by cutting through the meat in between the ribs. Rub ribs generously on all sides with the remaining spice rub mixture. (Set aside 3 tablespoons spice rub if making dry-style ribs.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place individual portions of rubbed ribs in vacuum bags. (Fold over the top of each bag while you add the ribs so that no rub or pork juices get on the edges of the bags, which can weaken the seal.) Add 4 drops (about 1/8 teaspoon) liquid smoke to each bag. Seal the bags, transfer to refrigerator, and let rest for 4 to 12 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>When Ready to Cook:</strong> Set your precision cooker to 145&deg;F (63&deg;C) for extra-meaty ribs or 165&deg;F (74&deg;C) for more traditionally textured ribs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add ribs to the water bath and cover it with a lid, aluminum foil, or <a href=\"https://www.seriouseats.com/2017/01/how-to-insulate-sous-vide-water-bath.html\">table tennis balls</a>. Cook for 36 hours at 145&deg;F or 12 hours at 165&deg;F. Transfer cooked ribs to a large bowl of water filled with ice to chill thoroughly. Ribs can be stored in the refrigerator at this stage for up to 5 days before finishing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish Dry-Style in the Oven:</strong> Remove ribs from vacuum bags and carefully pat dry with paper towels. Rub with remaining 3 tablespoons spice rub. Adjust oven racks to upper and lower-middle positions and preheat oven to 300&deg;F (150&deg;C). Line 2 rimmed baking sheets with aluminum foil and place a wire rack in each. Divide ribs evenly on racks, facing up. Transfer ribs to oven and cook until a crusty bark has formed, about 40 minutes. Serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish Dry-Style on the Grill:</strong> Remove ribs from vacuum bags and carefully pat dry with paper towels. Rub with remaining 3 tablespoons spice rub. Light one-half chimney full of charcoal (about 2 1/2 quarts of coals). When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium heat setting, cover, and preheat for 10 minutes. Scrape the grill grates clean with a grill scraper, then oil the grates by holding an oil-dipped kitchen towel or paper towels in a set of tongs and rubbing them over the grates 5 to 6 times. Place the ribs, facing up, over the cooler side of the grill. Cover and cook until ribs are heated through and dry to the touch, about 15 minutes. Transfer ribs to hotter side of grill and continue grilling, turning occasionally, until a crusty bark has formed, about 10 minutes. Serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish Sauced Ribs in the Oven:</strong> Remove ribs from vacuum bags and carefully pat dry with paper towels. Adjust oven racks to upper and lower-middle positions and preheat oven to 300&deg;F (150&deg;C). Line 2 rimmed baking sheets with aluminum foil and place a wire rack in each. Divide ribs evenly on racks, facing up. Transfer ribs to oven and cook until surface is sizzling and ribs are heated through, about 20 minutes. Brush ribs with sauce and return to oven for 10 minutes. Remove from oven, brush with another layer of sauce, and return to oven until sauce is dried and sticky, about 10 minutes longer. Remove ribs from oven, paint with one last layer of sauce, and serve, passing extra sauce at the table.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish Sauced Ribs on the Grill:</strong> Remove ribs from vacuum bags and carefully pat dry with paper towels. Light one-half chimney full of charcoal (about 2 1/2 quarts of coals). When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium heat setting, cover, and preheat for 10 minutes. Scrape the grill grates clean with a grill scraper, then oil the grates by holding an oil-dipped kitchen towel or paper towels in a set of tongs and rubbing them over the grates 5 to 6 times. Place the ribs, facing up, over the cooler side of the grill. Cover and cook until ribs are heated through and dry to the touch, about 15 minutes. Brush ribs with a layer of sauce and transfer ribs to hotter side of grill. Cover and cook until sauce is mostly dry, about 7 minutes. Brush with a second layer of sauce, cover, and cook until second layer is sticky, about 5 minutes longer. Remove ribs from grill, paint with one last layer of sauce, and serve, passing extra sauce at the table.</p>"}]}