{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/04/CHOCOLATEICECREAM.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["chocolate", "dessert", "ice cream", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.3333333333333", "ratingCount": "3"}, "name": "The Darkest Dark Chocolate Ice Cream", "link": "https://www.seriouseats.com/recipes/2015/04/best-dark-chocolate-ice-cream-recipe.html", "description": "An ice cream for the most hardcore chocolate lover: The person who likes their chocolate dark, bittersweet, and fruity.", "totalTime": "8 hours", "recipeYield": "Makes about 1 quart", "recipeCategory": ["Chocolate", "Father's Day", "Ice Cream and Frozen Treats", "Mother's Day", "Valentine's Day"], "recipeIngredient": ["3 cups whole milk", "2 ounces (about 6 tablespoons) cocoa nibs", "1/2 cup sugar", "1 ounce (about 1/4 cup) best quality cocoa powder, such as Valrhona or Pernigotti", "6 egg yolks", "8 ounces best quality dark chocolate, about 70% cocoa solids, such as Valrhona, Madecasse, Cacao Barry, or Callebaut", "1 to 1 1/2 teaspoons kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed saucepan, bring milk to a simmer over medium-high heat, stirring frequently. Stir in cocoa nibs, cover, and let steep for 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean heavy-bottomed saucepan, whisk together sugar and cocoa powder until no large lumps of cocoa remain. Then whisk in egg yolks until thoroughly combined. (Whisking in a different order will lead to a clumpy mess.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain milk into yolk mixture, pressing on cocoa nibs to squeeze out all possible dairy, then whisk dairy to combine. Set pan over medium heat and cook, whisking frequently, until custard reaches 170&deg;F on an instant-read thermometer. Custard should coat the back of a spoon and a finger swiped across it should leave a clean line.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chocolate and stir until thoroughly melted. Strain into a container or bowl, add salt, and chill in refrigerator or ice bath until base cools to 40&deg;F. Churn in ice cream maker according to manufacturer's instructions, then serve right away as soft serve or transfer to an airtight container to harden in freezer for 3 to 4 hours before scooping.</p>"}]}