{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/01/xianwings-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["chicken", "Chinese", "game day", "sichuan", "snack", "wing", "Xi'an"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "16"}, "name": "Hot and Numbing Xi'an-Style Oven-Fried Chicken Wings", "link": "https://www.seriouseats.com/recipes/2015/01/hot-and-numbing-oven-fried-xian-chicken-wings-recipe.html", "description": "Smoky chilies, cumin, and anise combine with mouth-numbing Sichuan peppercorns, cilantro, and scallions for flavor that just won't quit on these crispy, juicy oven-fried chicken wings. The key to their perfect crunch without having to break out the deep fryer? An overnight rest with baking powder and salt.", "totalTime": "1 hour, plus overnight rest", "recipeYield": "Serves 4 as an appetizer or 8 as a snack", "recipeCategory": ["Chicken", "Chinese", "Snacks", "The Food Lab"], "recipeIngredient": ["4 pounds chicken wings, cut into drumettes and flats", "1 tablespoon baking powder", "1 1/2 tablespoons kosher salt", "1 tablespoon whole cumin seed", "1 teaspoon whole fennel seed", "1 tablespoon dried red pepper flakes (preferably Thai)", "1 tablespoon whole Sichuan peppercorns, seeds removed", "1 tablespoon brown sugar", "2 teaspoons vegetable oil", "1/2 cup chopped fresh cilantro leaves and fine stems", "4 scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line rimmed baking sheet with aluminum foil, and set rack inside. Carefully dry chicken wings with paper towels. Place 1/3 of wings in large bowl, sprinkle with 1 teaspoon baking powder and 1 teaspoon salt, and toss until thoroughly and evenly coated. Place on rack, leaving slight space between each wing. Repeat with remaining two batches of wings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place baking sheet with wings in refrigerator and allow to rest, uncovered, at least 8 hours, and up to 18 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to upper-middle position and preheat oven to 450&deg;F. Add chicken wings and cook for 20 minutes. Flip wings and continue to cook until crisp and golden brown, 15 to 25 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine cumin, fennel, pepper flakes, and Sichuan peppercorns in a small skillet and toast over medium-low heat until fragrant, about 1 minute. Transfer to a mortar and pestle or a spice grinder. Add remaining 1/2 tablespoon salt and sugar and grind until a rough powder is formed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When wings are finished, transfer to a large bowl and toss with oil. Add half of the spice powder and all of the cilantro and scallions. Toss until coated. Taste one wing, then add more spice powder to taste. Serve immediately.</p>"}]}