{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150121-salted-dulce-de-leche-brownies-nila-jones-4.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["butterscotch", "condensed milk", "condiment", "dulce", "dulce de leche", "spread", "toffee"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "4"}, "name": "Easy Dulce de Leche", "link": "https://www.seriouseats.com/recipes/2015/02/dulce-de-leche-recipe.html", "description": "What is dulce de leche? While often called Mexican caramel, it's based on the Maillard browning of dairy rather than the caramelization of sugar. That may sound like a technicality, but it gives dulce de leche a sweet and mellow, toffee or butterscotch-like flavor without the bitterness associated with caramel (i.e., burned sugar). Traditional methods made with fresh milk can take seven hours or more, while starting with a can of sweetened condensed milk drops the time down to two to three hours. It's a no-fuss approach to this rich and creamy sauce.", "totalTime": "2 to 3 hours", "recipeYield": "Makes 1 (14-ounce) can", "recipeCategory": ["Candy", "Cinco de Mayo", "Gluten-Free", "Stovetop", "Syrup"], "recipeIngredient": ["1 (14-ounce) can of sweetened condensed milk, label removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the can on its side in a large pot. Fill the pot with room-temperature water, making sure the water level is at least 2 inches above the can.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set pot over high heat and allow to come to a simmer. Reduce heat and simmer for 2 hours for a lighter caramel, and up to 3 hours for a darker caramel; check the pot every 30 minutes to ensure the water level stays above the can, adding boiling water as necessary to top it up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a pair of tongs, remove the can from the water and set on a wire rack to cool to room temperature (important: do not attempt to open the can while still hot, which can cause pressurized hot caramel to spray dangerously).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unopened cans of dulce de leche can be stored at room temperature for up to 3 months. To use dulce de leche, open can when cool and scoop out of can; reheat in a double boiler to soften dulce de leche to a spreadable or drizzle-able consistency. Dulce de leche can be tranferred to an airtight container and refrigerated for up to 3 weeks.</p>"}]}