{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151110-chewy-sugar-cookies-vicky-wasik-composite.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["cookie", "easy", "holiday"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Soft and Chewy Sugar Cookies", "link": "https://www.seriouseats.com/recipes/2015/12/soft-and-chewy-sugar-cookie-recipe.html", "description": "These old-fashioned sugar cookies bake up soft and chewy, but lightly crisp around the edges. Stick with plain sugar for a classic finish, dress 'em up with colorful nonpareils, or double down on flavor with a vanilla bean.", "totalTime": "45 minutes", "recipeYield": "Makes 30 (three-inch) cookies", "recipeCategory": ["Baking", "Christmas", "Cookies"], "recipeIngredient": ["8 ounces unsalted butter (2 sticks; 225g); firm but pliable, about 60°F (16°C)", "10 ounces sugar (1 1/2 cups; 280g)", "2 1/2 teaspoons baking powder (10g)", "1 1/4 teaspoons Diamond Crystal kosher salt (5g) (For table salt, use half as much by volume or use the same weight)", "Pinch of freshly grated nutmeg", "1 large egg, cold", "1 tablespoon pure vanilla extract (15mL)", "11 1/4 ounces all purpose flour (about 2 1/2 cups, spooned; 320g)", "Assorted sanding sugars, nonpareils, and sprinkles, or plain granulated sugar blended with vanilla seeds, luster dust, or powdered food coloring for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position, preheat to 350°F (170°C), and line 2 aluminum half sheet pans with parchment paper (not wax paper!).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine butter, sugar, baking powder, kosher salt, nutmeg, and vanilla extract in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, increase to medium and beat until fluffy, pale ivory, and soft, about 5 minutes. Add egg and continue beating until smooth, about 2 minutes more, pausing to scrape down the sides of the bowl with a rubber spatula as needed. Resume mixing on low, sprinkle in flour, and continue mixing until a thick dough is formed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide into twenty six 1-ounce portions with a 2-tablespoon cookie scoop. Roll each ball of dough between your hands until smooth and round. If desired, tumble in a dish with sanding sugar, nonpareils, sprinkles, granulated, or vanilla sugar until coated on all sides. Arrange cookies on prepared half sheet pan, leaving 2 1/2 inches of space in between cookies. Do not flatten; cookies will spread on their own.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until puffed and pale gold around the edges, but still steamy in the middle, about 15 minutes. Cool directly on sheet pan until firm, about 10 minutes. Enjoy warm, or allow to cool completely, then store in an airtight container for up to 2 days at room temperature.</p>"}]}