{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150206-fondue-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["cheese", "fondue", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Foolproof Cheese Fondue", "link": "https://www.seriouseats.com/recipes/2015/02/cheese-fondue-emmentaler-gruyere-recipe.html", "description": "Cheese fondue is one of the great melted-cheese dishes of the world, and it couldn't be simpler&mdash;but getting it right requires paying attention to a few key points. In this recipe, a combination of Emmentaler and Gruyère are melted together into a white wine base, then spiked with lemon juice and, optionally, kirsch.", "totalTime": "25 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cheese", "Father's Day", "Mains", "Mother's Day", "Valentine's Day"], "recipeIngredient": ["1 medium clove garlic, cut in half", "1 cup dry white wine, such as sauvignon blanc or pinot grigio, plus more as needed", "1/2 pound Emmentaler cheese, grated", "1/2 pound Gruyère cheese, grated", "1 tablespoon cornstarch", "1 tablespoon fresh juice from 1 lemon", "1 tablespoon kirsch (optional)", "Kosher salt and freshly ground white or black pepper", "Toasted bread cubed and/or lightly blanched vegetables, for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub cut faces of garlic cloves around the inside of a fondue pot, double boiler, or stainless steel mixing bowl set over a pot of simmering water (do not allow bowl to come into direct contact with the water). Add wine and heat until steaming. Meanwhile, in a large bowl, toss together both cheeses with cornstarch until evenly coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working over low heat, add cheese 1 handful at a time, stirring until mostly melted before adding next handful. Continue until all cheese is melted into the wine, forming a smooth, glossy melted cheese sauce, about 10 minutes;it is very important that the fondue stay below a simmer once you start adding the cheese, or there's a risk it could break. Stir in lemon juice and kirsch, if using, until fully incorporated. Season with salt and pepper. If not already in a fondue pot, transfer fondue to a fondue pot to keep it warm and melted at the table. Serve with toasted bread cubes and lightly blanched vegetables for dipping. If fondue begins to thicken too much, add a small splash of wine to loosen it.</p>"}]}