{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/03/gyoza.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["cabbage", "dumpling", "gyoza", "Japanese", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9", "ratingCount": "10"}, "name": "The Best Japanese Pork and Cabbage Dumplings (Gyoza)", "link": "https://www.seriouseats.com/recipes/2015/03/the-best-japanese-pork-and-cabbage-dumplings-gyoza-recipe.html", "description": "Japanese-style gyoza are related to their Chinese counterparts but tend to be more subtle in flavor, stuffed with juicy pork and cabbage lightly seasoned with garlic, scallions, ginger, white pepper, salt, and sugar. The key to cooking them is a three-stage crisp-steam-crisp process.", "totalTime": "1 hour", "recipeYield": "Makes 40 to 50 gyoza, serving 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cabbage", "Dairy-Free", "Japanese", "Pork", "Sides", "Snacks"], "recipeIngredient": ["<strong>For the Dumplings:</strong>", "1 pound finely minced Napa cabbage (about 1/2 a medium head)", "1 tablespoon kosher salt, divided", "1 pound ground pork shoulder", "1 teaspoon white pepper", "1 tablespoon minced fresh garlic (about 3 medium cloves)", "1 teaspoon minced fresh ginger", "2 ounces minced scallions (about 3 whole scallions)", "2 teaspoons sugar", "1 package dumpling wrappers (40 to 50 wrappers)", "Vegetable or canola oil for cooking", "<strong>For the Sauce:</strong>", "1/2 cup rice vinegar", "1/4 cup soy sauce", "2 tablespoons chili oil (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dumplings:</strong> Combine cabbage and 2 teaspoons salt in a large bowl and toss to combine. Transfer to a fine mesh strainer and set it over the bowl. Let stand at room temperature for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cabbage to the center of a clean dish towel and gather up the edges. Twist the towel to squeeze the cabbage, wringing out as much excess moisture as possible. Discard the liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pork, drained cabbage, remaining teaspoon salt, white pepper, garlic, ginger, scallions, and sugar in a large bowl and knead and turn with clean hands until the mixture is homogenous and starting to feel tacky/sticky. Transfer a teaspoon-sized amount to a microwave-safe plate and microwave on high power until cooked through, about 10 seconds. Taste and adjust seasoning with more salt, white pepper, and/or sugar if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up a work station with a small bowl of water, a clean dish towel for wiping your fingers, a bowl with the dumpling filling, a parchment-lined rimmed baking sheet for the finished dumplings, and a stack of dumpling wrappers covered in plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form dumplings, hold one wrapper on top of a flat hand. Using a spoon, place a 2 teaspoon- to 1 tablespoon-sized amount of filling in the center of the wrapper. Use the tip of  the finger on your other hand to very gently moisten the edge of the wrapper with water (do not use too much water). Wipe fingertip dry on kitchen towel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working from one side, carefully seal the filling inside the wrapper by folding it into a crescent shape, pleating in edge as it meets the other (see <a href=\"http://www.seriouseats.com/2015/03/how-to-make-japanese-gyoza-dumplings.html\">here for more detailed step by step instructions</a>). Transfer finished dumplings to the parchment lined baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this point the dumplings may be frozen by placing the baking sheet in the freezer. Freeze dumplings for at least 30 minutes then transfer to a zipper-lock freezer bag for long-term storage. Dumplings can be frozen for up to 2 months and cooked directly from the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook:</strong> Heat 1 tablespoon of vegetable oil in a medium non-stick skillet over medium heat until shimmering. Add as many dumplings as will fit in a single layer and cook, swirling pan, until evenly golden brown on the bottom surface, about 1 1/2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to medium-high, add 1/2 cup of water and cover tightly with a lid. Let dumplings steam for 3 minutes (5 minutes if frozen), then remove lid. Continue cooking, swirling pan frequently and using a thin spatula to gently dislodge the dumplings if they've stuck to the bottom of the pan, until the water has fully evaporated and the dumplings have crisped again, about 2 minutes longer. Slide dumplings onto a plate, turning them crisped-side-up before serving with the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Combine vinegar, soy sauce, and chili oil.</p>"}]}