{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/01/20150112-slow-cooker-meatball-recipe-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "comfort", "italian american", "meatball", "pork", "red sauce", "slow cooker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "4"}, "name": "Tender and Juicy Slow-Cooker Meatballs", "link": "https://www.seriouseats.com/recipes/2015/01/slow-cooker-meatballs-recipe.html", "description": "Tender Italian-American meatballs made with beef and pork and flavored with garlic, buttermilk, and Parmesan cheese in a meaty, slow-cooked sauce. Your slow-cooker takes care of the tomato sauce, reducing it into a rich, meaty gravy.", "totalTime": "7 to 11 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Beef", "Mains", "Pork", "Slow Cooker", "Soups and Stews"], "recipeIngredient": ["3 slices white bread, crusts removed, roughly torn", "1/3 cup buttermilk, plus more as needed", "1 large onion, minced (about 1 1/2 cups), divided", "12 cloves garlic, <a href=\"http://www.seriouseats.com/2015/01/how-to-mince-chop-garlic-microplane-vs-garlic-press.html\">finely minced</a>, divided", "2 ounces grated Parmigiano-Reggiano, grated, plus more for serving", "1/2 cup loosely packed fresh parsley leaves, minced", "4 teaspoons kosher salt (18 grams)", "Freshly ground black pepper", "2 large eggs", "2 teaspoons dried oregano, divided", "1 pound ground beef (at least 25% fat)", "1 1/4 pounds ground pork (at least 25% fat)", "1/4 cup extra-virgin olive oil", "3 (28-ounce) cans whole peeled tomatoes, crushed by hand", "1/2 teaspoon red pepper flakes", "1 sprig fresh basil", "Cooked pasta, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, combine bread with buttermilk, tossing to coat. Let stand, tossing occasionally, until bread is completely moist, about 10 minutes. Squeeze bread between your fingers or mash with a spoon to make sure there are no dry spots. Add half of onion, 8 cloves of minced garlic, Parmigiano-Reggiano, parsley, salt, pepper, egg, and half of oregano to bread/buttermilk mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set mixer bowl in stand mixer and attach paddle. Starting at low speed and gradually increasing to medium-high speed, beat bread mixture until thoroughly blended, stopping to scrape down sides as necessary. Add 1/3 each of the beef and pork and beat at medium-high speed until thoroughly blended with bread mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove bowl from stand mixer and add remaining beef and pork. Using a clean hand, gently mix meatball mixture, teasing apart ground meat with your fingers, just until ground beef and pork and thoroughly distributed throughout; avoid mixing any more than is necessary for even distribution.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler and set oven rack in upper position. Line a rimmed baking sheet with aluminum foil. Set aside 6 ounces of meatball mixture. Form remaining meatball mixture into golfball-sized balls and arrange on prepared baking sheet; you should be able to make about 16. Broil meatballs until browned on top, about 7 minutes (browning times can vary dramatically, depending on oven broiler strength). Transfer meatballs to a plate, cover with plastic wrap, and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large Dutch oven over medium-high heat until shimmering. Add remaining meat mixture and cook, stirring, until no longer pink, about 3 minutes. Add remaining onion and garlic and cook, stirring, until softened, about 5 minutes. Add remaining oregano and pepper flakes and cook, stirring, for 30 seconds. Add tomatoes and bring to a simmer. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer tomato sauce and basil sprig to slow cooker. Cook on low heat for 6 to 10 hours. Gently fold meatballs into mixture for last 30 minutes of cooking. Serve with pasta and Parmesan cheese.</p>"}]}