{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150422-cemita-rolls-recipe-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["bread", "bun", "cemita", "Mexican", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0625", "ratingCount": "16"}, "name": "<em>Cemitas</em> (Mexican Sesame Seed Sandwich Buns)", "link": "https://www.seriouseats.com/recipes/2015/05/cemitas-mexican-saseme-seed-sandwich-buns-recipe.html", "description": "The cemita, a brioche-like bun from Puebla may well be the ultimate sandwich or hamburger bun. It has a sweet and savory flavor with a dense-yet-light crumb that can stand up to stacks and stacks of toppings without disintegrating or being overly firm.", "totalTime": "5 1/2 hours", "recipeYield": "Makes 6 single-serving buns", "recipeCategory": ["Burger", "Mexican", "Sandwiches", "The Food Lab", "Yeast Bread"], "recipeIngredient": ["12.5 ounces (2 1/2 cups) all-purpose flour", "8 ounces heavy cream", "3 eggs, divided", "1 teaspoon instant yeast", "1 1/2 teaspoons kosher salt (or 3/4 teaspoon table salt)", "3 tablespoons sugar", "1/2 cup sesame seeds", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, cream, 2 eggs, yeast, salt, and sugar in the bowl of a food processor. Process until a ball of dough that rides around the blade is formed, about 45 seconds. Dough will be very sticky. Alternatively, form dough in a stand mixer fitted with a paddle attachment by adding ingredients and mixing on medium speed until a homogenous dough comes together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough to a large mixing bowl, cover tightly with plastic wrap, and let rise at room temperature until about 1 1/2 times its original size, about 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly flour dough and transfer to a floured work surface. Form into a large ball then, using a bench scraper or sharp knife, divide the ball into 6 even pieces. Using lightly floured hands, form each piece into a ball. Transfer dough balls to a parchment-lined rimmed baking sheet, tucking the seam underneath. Cover with plastic wrap weighted down with a kitchen towel and set aside at room temperature for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, adjust oven rack to center position and preheat oven to 450&deg;F. When ready to bake, beat remaining egg with 1 tablespoon of water. Brush egg mixture on top of each bun until evenly coated. Sprinkle with generously with sesame seeds and lightly sprinkle with coarse salt. Bake until deep golden brown, 12 to 15 minutes. Remove from oven, transfer buns to a wire cooling rack, and let cool completely before using. Buns can be stored in a plastic of paper bag in the refrigerator for up to 1 week. Refresh in a warm oven or toaster before using.</p>"}]}