{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/09/20150927-food-lab-onion-rings-20.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bar snack", "fry", "onion ring", "snack", "the food lab book"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Food Lab's Foolproof Onion Rings", "link": "https://www.seriouseats.com/recipes/2015/09/foolproof-onion-rings-food-lab-recipe.html", "description": "It's always difficult to decide whether to get onion rings or fries (get a combo if they'll let you!). Proper beer-battered onion rings, with a substantial crisp crust covering a sweet, tender, thick ring of onion, are one of life's three greatest pleasures (and the only one that can be enjoyed legally, incidentally), but how often do you get perfect rings? This recipe delivers.", "totalTime": "1 hour 45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Deep Frying", "Onion", "Recipes", "Sides", "Snacks", "Vegetables", "Vegetarian"], "recipeIngredient": ["2 large onions, cut into 1⁄2-inch rounds", "2 quarts peanut oil", "1 cup all-purpose flour", "1⁄2 cup cornstarch", "1 teaspoon baking powder", "1⁄4 teaspoon baking soda", "1⁄2 teaspoon paprika", "3/4 cup light-flavored beer (such as PBR or Budweiser), ice-cold", "1/4 cup 80-proof vodka", "Kosher Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate the onion rounds into individual rings. Place in a gallon-sized zipper-lock freezer bag and put them in the freezer until completely frozen, at least 1 hour (they can stay in the freezer for up to 1 month).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to fry, remove the onion rings from the freezer bag, transfer to a bowl, and thaw under tepid running water. Transfer to a rimmed baking sheet lined with a clean kitchen towel or several layers of paper towels and dry the rings thoroughly. Carefully peel off the inner papery membrane from each ring and discard (the rings will be very floppy). Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oil to 375&deg;F in a large wok or a Dutch oven over medium-high heat. Combine the flour, cornstarch, baking powder, baking soda, and paprika in a medium bowl and whisk together. Combine the beer and vodka in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slowly add the beer mixture to the flour mixture, whisking constantly until the batter has texture of thick paint (you may not need all of the beer). The batter should leave a trail if you drip it back into the bowl off the whisk. Do not overmix; a few small lumps are OK. Dip one onion ring in the batter, making sure that all surfaces are coated, lift it out, letting the excess batter drip off, and add it to the hot oil by slowly lowering it in with your fingers until just one side is sticking out, then dropping it in. Repeat until half of the rings are in the oil. Fry, flipping the rings halfway through cooking, until they are deep golden brown, about 4 minutes. Transfer the rings to a large mixing bowl lined with paper towels and toss while sprinkling salt over them. The fried rings can be placed on a rack on a rimmed baking sheet and kept hot in a 200&deg;F oven while you fry the remaining rings. Serve the rings immediately.</p>"}]}