{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/09/20150902-shiitake-mushroom-poboys-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["mushroom", "New Orleans", "po' boy", "Southern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Fried Shiitake Po' Boys With New Orleans-Style Remoulade", "link": "https://www.seriouseats.com/recipes/2015/09/fried-shiitake-mushroom-poboy-remoulade-recipe.html", "description": "We stuff this vegetarian twist on the iconic New Orleans sandwich with crispy, juicy, cornmeal-breaded shiitakes to substitute for the traditional fried seafood. A super-tangy remoulade sauce cuts through fat and inhibitions alike, getting you into the true, oops-one-too-many New Orleans spirit.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Mushrooms", "Sandwiches", "Vegetarian"], "recipeIngredient": ["<strong>For the New Orleans-Style Remoulade:</strong>", "2/3 cup mayonnaise", "1 tablespoon Creole or stone-ground mustard ", "1 tablespoon fresh juice from 1 lemon", "1 teaspoon hot sauce, such as Crystal or Tabasco", "4 scallions, white and light green parts only, finely chopped", "1 tablespoon capers, coarsely chopped", "Kosher salt and freshly ground black pepper", "<strong>For the Mushrooms and Sandwiches:</strong>", "Vegetable or canola oil, for frying", "1 cup fine cornmeal", "1/2 cup all-purpose flour", "1 tablespoon plus 2 teaspoons kosher salt, plus more for seasoning", "1 teaspoon freshly ground black pepper", "1/2 teaspoon cayenne pepper", "1 pound shiitake mushrooms, stems trimmed", "4 (6-inch) lengths soft baguette, split lengthwise (see note)", "Shredded iceberg lettuce and sliced tomatoes, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the New Orleans-Style Remoulade:</strong> In a small bowl, stir together mayonnaise, mustard, lemon juice, hot sauce, scallions, and capers. Season with salt and pepper. Refrigerate until ready to use. (Makes about 1 cup; you can keep any leftover remoulade refrigerated in an airtight container and use it on sandwiches, as a dip, or on burgers.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mushrooms and Sandwiches:</strong> Fill a large pot with at least 2 inches oil and heat to 360&deg;F. Line a wire rack with a double layer of paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pie plate or large shallow bowl, whisk together cornmeal, flour, salt, black pepper, and cayenne. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash 1/4 of the shiitake caps, and, while they are still dripping wet, dredge them in the cornmeal mixture. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully lower the shiitakes into the hot oil (after a moment, they will bubble furiously, then settle back down). Fry, turning, until golden brown and crisp, about 3 minutes; adjust heat to maintain an oil temperature of 340 to 350&deg;F. Using a wire strainer, transfer mushrooms to the lined wire rack to drain. Sprinkle with salt. Repeat with remaining mushrooms, making sure they're very wet before dredging each time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the top half of each baguette piece with a generous amount of remoulade and layer with iceberg lettuce and sliced tomatoes. Pile each bottom half with the fried shiitakes. Close the sandwiches and serve.</p>"}]}