{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/03/20150305-sichuan-asparagus-tofu-salad-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["asparagus", "Chinese", "easy", "quick", "salad", "sichuan", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Sichuan-Style Asparagus and Tofu Salad", "link": "https://www.seriouseats.com/recipes/2015/03/sichuan-style-asparagus-tofu-salad-recipe.html", "description": "Tender-crisp asparagus and firm tofu tossed in a fiery-sweet Sichuan-style vinaigrette made with roasted chilies and Sichuan peppercorns.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Asparagus", "Chinese", "Dairy-Free", "Salads", "Tofu", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Sauce:</strong>", "4 to 8 whole hot Chinese dried red peppers (or arbol chilies), stems removed", "2 teaspoons Sichuan peppercorns", "1/4 cup vegetable or canola oil", "3 tablespoons Chinkiang vinegar (or a mixture of 2 tablespoons rice vinegar and 1 tablespoon balsamic vinegar)", "2 tablespoons soy sauce", "1 tablespoon sugar", "1 tablespoon minced fresh garlic (about 3 medium cloves)", "1 tablespoon toasted sesame seeds", "<strong>For the Salad:</strong>", "Kosher salt", "1 pound thin asparagus stalks, ends trimmed, cut into 2-inch pieces", "10 ounces extra-firm plain, smoked, or five-spice tofu, cut into 2-inch matchsticks", "4 scallions, sliced thinly on a sharp bias"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Place chilies and Sichuan peppercorns on a microwave-safe plate and microwave on high until toasted and aromatic, about 15 seconds. Transfer to a mortar and pestle or a food processor and crush until it's about the texture of store-bought crushed red pepper flakes. Transfer to a small saucepan.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a skillet over medium heat until shimmering. Immediately pour hot oil over chili/peppercorn mixture (it should sizzle). Let cool for 5 minutes then transfer to a medium bowl. Add sesame seeds and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar, vinegar, soy sauce, and garlic in a small bowl and stir until sugar is dissolved. Add chili oil mixture. Set aside until ready to use. (Sauce can be stored in a sealed container in the fridge for up to 2 weeks).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salad:</strong> Bring a large pot of salted water to a boil over high heat. Add asparagus and cook, stirring occasionally, until asparagus is bright green with a tender snap, about 1 minute. Drain in a colander and rinse under cold running water until completely cooled. Transfer to a rimmed baking sheet lined with a clean kitchen towel or a double layer of paper towels and shake to dry thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine asparagus, tofu, and scallions in a large bowl. Stir dressing and add to taste, tossing to coat vegetables. Serve immediately.</p>"}]}