{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/11/20151110-sweet-potato-casserole-vicky-wasik-11.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["casserole", "sweet potato", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Sweet Potato Casserole", "link": "https://www.seriouseats.com/recipes/2015/11/sweet-potato-casserole-marshmallow-recipe.html", "description": "The problem with most marshmallow-topped sweet potato casseroles is that they're far too sweet, with candied sweet potatoes layered high with sugary melted marshmallows. This version corrects that by adding savory notes to the sweet potatoes, like peppery grated ginger, nutty brown butter, woodsy herbs, and just a touch of tangy dairy. That means you can go heavy on the marshmallows without your teeth quitting in protest.", "totalTime": "3 hours 30 minutes", "recipeYield": "Serves 6 to 8 as a side", "recipeCategory": ["Christmas", "Fall", "Gluten-Free", "Sides", "Sweet Potatoes and Yams", "Thanksgiving", "Winter"], "recipeIngredient": ["6 pounds (2.8kg) moist sweet potatoes, such as ruby or garnet yams (about 6 large potatoes; see note)", "8 tablespoons unsalted butter (1 stick; 115g) ", "8 sprigs fresh thyme and/or sage", "1 (4-inch) knob peeled fresh ginger, finely grated (about 1 tablespoon; 15g)", "1/4 cup (60g) buttermilk or sour cream", "Kosher salt", "2 cups mini marshmallows (3 ounces; 90g) (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position. Place 2 large sheets of heavy-duty aluminum foil on a work surface. Working with one sheet at a time, place half of potatoes in center. Fold up foil and crimp edges to seal tightly. Repeat on second sheet with rest of potatoes. Transfer pouches to a rimmed baking sheet and place in oven. Set oven to 300&deg;F (149&deg;C). Roast until a thin skewer inserted into potatoes goes in with no resistance, about 2 hours. Remove from oven and set aside until cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt butter in a medium saucepan over medium-low heat, swirling gently until particles are pale golden brown and smell nutty. Add herb sprigs; herbs may cause brown butter to splatter at first, so take care. Swirl herbs in brown butter off-heat until frizzled. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel sweet potatoes and discard skins. Add flesh to a large bowl or the bowl of a stand mixer. Beat with the whisk attachment or with a handheld mixer until smooth and fluffy, about 2 minutes. Strain brown butter into potatoes, discarding frizzled herbs. Beat in ginger, then beat in buttermilk or sour cream. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to finish dish, preheat oven to 375&deg;F (190&deg;C). Scrape potatoes into a 2-quart baking dish, smoothing surface with a rubber spatula. Bake until heated through, about 30 minutes. Increase oven temperature to 475&deg;F (246&deg;C) and top with mini marshmallows. Bake until marshmallows are melted and lightly browned, about 3 minutes (keep an eye on them, as they can brown and then burn very quickly). Serve.</p>"}]}