{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150507-galician-empanadas-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Spanish", "keywords": ["bell pepper", "empanada", "Galicia", "hand pie", "onion", "spanish", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Galician Empanada With Tuna, Onion, and Green Bell Pepper Filling", "link": "https://www.seriouseats.com/recipes/2015/05/galician-empanadas-tuna-onion-bell-pepper-recipe.html", "description": "All the empanadas of Latin America&mdash;whether baked or fried, wrapped in a corn or flour dough&mdash;can thank the Galician empanada for their existence. Unlike the individual hand pies of Latin America, this empanada is formed as a large baked pie with a wheat crust and filled with onions, green peppers, and your choice of protein. Only after it's baked does it get cut into individual portions. Here's how to make it at home with a classic tuna filling.", "totalTime": "3 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bread", "Breakfast and Brunch", "Fish", "Onion", "Sides", "Snacks", "Spanish"], "recipeIngredient": ["<strong>For the Dough:</strong>", "12 3/4 ounces all-purpose flour, plus more for dusting", "1 1/2 teaspoons kosher salt", "1 teaspoon instant yeast", "8 ounces warm (120°F) water", "2 tablespoons extra-virgin olive oil, plus more for greasing", "<strong>For the Filling:</strong>", "1/4 cup plus 2 tablespoons extra-virgin olive oil", "4 cups (1-inch) diced green bell pepper (about 2 large peppers)", "4 cups (1-inch) diced yellow onion (about 4 small to medium onions)", "15 medium cloves garlic, thinly sliced", "2 (250-gram, about 8.5 ounces) cans oil-packed bonito tuna, such as <a href=\"http://www.amazon.com/Ortiz-Velero-Bonito-Norte-Packed/dp/B000N1662M/?tag=serieats-20\">Ortiz</a>, drained", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> In a large bowl, mix together flour, salt, and yeast. Add water and olive oil and mix until fully incorporated. Continue mixing and kneading until a smooth, elastic dough forms, about 5 minutes. Grease a medium bowl with olive oil. Stretch dough ball by tucking it under itself to form a taut, smooth ball. Drizzle with olive oil, rub to coat, and transfer to greased bowl. Cover with plastic and set aside in a warm place until doubled in size, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, For the Filling:</strong> In a large sauté pan, heat oil over medium-high heat until shimmering. Add green peppers and cook, stirring occasionally, until just starting to soften, about 5 minutes. Add onions and garlic and cook, stirring occasionally, until onions and green peppers are very soft and sweet, about 25 minutes; lower heat as necessary to prevent burning. Stir in tuna, season with salt, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Grease a large rectangular or circular rimmed baking dish or large cast iron skillet with olive oil. Divide dough into 2 portions, one twice as large as the other. On a floured work surface, roll out larger dough to form a thin sheet. Transfer rolled-out dough to the greased baking dish, pressing it into corners and allowing dough to overhang rim, trimming off any excess.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape filling into baking dish, smoothing it in an even, flat layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out smaller portion of dough to form a thin sheet. Transfer to baking dish, arranging it to cover filling in an even layer. Roll overhanging dough of bottom crust onto top crust, twisting to seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut a small hole in center of top crust to form steam vent. Using a piece of dough trimmings, form a small decorative ring for steam vent. Transfer to oven and bake until browned on top and cooked through, 45-55 minutes (setting baking dish or skillet on a preheated baking stone or bottom of oven for about half of the cooking time will help crisp and brown the bottom crust).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and let cool slightly. Cut into wedges (if pie is circular) or squares (if pie is rectangular) and serve warm or at room temperature.</p>"}]}