{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/03/20150322-lemongrasscocktail-cocktail-elana-lepkowski.jpg", "author": {"@type": "Person", "name": "Elana Lepkowski"}, "recipeCuisine": "", "keywords": ["cocktail", "lemongrass", "vodka"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Lemongrass Sour", "link": "https://www.seriouseats.com/recipes/2015/03/lemongrass-sour-vodka-cocktail-drink-recipe.html", "description": "Lemongrass infused vodka&mdash;combined with lemon bitters suspended on a head of eggwhite foam&mdash;makes for a light and delicately citrusy spring cocktail.", "totalTime": "2 weeks", "recipeYield": "Makes 2 cups infused vodka (enough for 8 individual cocktails)", "recipeCategory": ["Vodka"], "recipeIngredient": ["<strong>For the Lemongrass Infused Vodka:</strong>", "4 lemongrass stalks", "2 cups vodka", "<strong>For Each Cocktail:</strong>", "2 ounces Lemongrass Infused Vodka", "3/4 ounce freshly squeezed juice from 1 lime", "1/2 ounce simple syrup", "1 fresh egg white (see note)", "3 dashes lemon bitters", "Curly lime zest, peeled with a zester, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lemongrass Infused Vodka:</strong> Remove tough outer layer from each lemongrass stalk. Chop stalks into 1-inch pieces and bruise them by crushing them with the blunt side of a heavy knife. For slow infusion, add lemongrass pieces to an airtight container and cover with vodka. Seal and let stand at room temperature for 1 week, shaking daily. Taste after 1 week and continue to steep up to 2 weeks to desired flavor. Strain into an airtight container.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Alternatively, to infuse instantly using a siphon, take lemongrass pieces and add to whipped cream canister. Pour in vodka and seal. Charge with one N2O charger. Shake well. Charge a second time with a second N2O charger. Shake well and then discharge contents through a strainer into a clean, airtight container. Infused vodka keeps at room temperature for up to 6 months. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Each Cocktail:</strong> In a cocktail shaker, add Lemongrass Infused Vodka, lime juice, simple syrup, and egg white. Shake without ice for 30 seconds to incorporate the egg white. Fill cocktail shaker with ice, then shake hard until well chilled, about 30 seconds. Double strain into cocktail glass and garnish with lemon bitters and lime zest.</p>"}]}