{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150206-braised-tofu-mushrooms-shao-z-15.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "mushroom", "new year", "tofu"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Mushrooms and Tofu With Chinese Mustard Greens", "link": "https://www.seriouseats.com/recipes/2015/02/mushrooms-tofu-chinese-mustard-greens-recipe.html", "description": "Every year, families celebrate the Chinese Lunar New Year with an impressive feast called Reunion Dinner, and among the many plates on the table is abalone in a rich sauce with dried oysters, shiitakes, and an algae called black moss. Inspired by that dish, this recipe is a vegetarian take with easier-to-find ingredients, like tofu and both fresh and dried mushrooms. Even without the seafood it still delivers on the richness and flavor of the original.", "totalTime": "2 hours", "recipeYield": "Serves 4-6", "recipeCategory": ["Chinese", "Mains", "Mushrooms", "Sides", "Tofu", "Vegetarian"], "recipeIngredient": ["2 ounces dried shiitake mushrooms (about 10 mushrooms)", "12 ounces firm tofu, sliced 1/4 inch thick", "1/4 cup plus 5 teaspoons cornstarch, divided", "Kosher salt and freshly ground black pepper", "3 tablespoons plus 2 teaspoons canola, vegetable, or peanut oil, divided", "1 pound Chinese mustard greens (<em>gai toy</em>; see note), leaves separated, smaller ones left whole and larger onces halved, and stalks cut into thick slices", "3/4 cup <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">vegetable stock</a>", "2 tablespoons soy sauce", "2 teaspoons Shaoxing wine, or dry sherry", "2 teaspoons toasted sesame oil", "1 1/4 pounds mixed fresh mushrooms, such as portabello, maitake, kinf oyster, shimeji, enoki, and cremini, cut into thick slices, torn into large pieces, or separated into strands (depending on type of mushroom)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse dried shiitakes under cold running water to remove any grit. Place shiitakes in a heatproof bowl and pour 1 1/2 cups hot water on top. Soak the shiitakes until fully rehydrated, at least 2 hours or up to overnight. Lift mushrooms from water, squeezing any excess water back into the bowl. Line a fine mesh strainer with paper towels or cheesecloth and strain mushroom soaking liquid through it into a clean bowl and reserve. Discard shiitake mushroom stems.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tofu in a clean heatproof bowl and carefully pour enough boiling water on top to cover. Let stand for 30 seconds, then drain and transfer tofu to a paper towel-lined plate. Press gently on tofu with paper towels to dry thoroughly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix together 1/4 cup of cornstarch and 1/4 tsp of salt on a plate. Dredge tofu slices in cornstarch to evenly coat, tapping off excess and transferring them back to a clean, dry plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons oil in a non-stick pan over medium-high heat until shimmering. Working in batches if necessary t avoid crowding the pan, cook tofu slices until crisp and golden on both sides, about 7 minutes. Transfer cooked tofu to a paper towel-lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of salted water to a boil. Add Chinese mustard greens in and cook until just tender, about 5 minutes. Drain and place greens in a large deep serving plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, combine vegetable stock, 3/4 cup of the shiitake mushroom soaking liquid, soy sauce, Shaoxing wine, toasted sesame oil, and remaining 5 teaspoons cornstarch. Mix well and set aside.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pan or wok, heat up remaining 2 teaspoons oil. Add shiitake mushroom caps along with all the fresh mushrooms except the enoki, if using. Season with salt and pepper. Cook, stirring, until mushrooms release their water and then it evaporates. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vegetable stock mixture and stir well. When the sauce begins to bubble and thicken, gently mix in tofu slices. Lower heat to a gentle simmer, then cook for 5 minutes. Add the enoki mushrooms, if using, and simmer until the mushrooms are tender and coated in a glossy sauce, about 5 minutes longer. Scrape mushrooms and tofu, along with any sauce, on top of mustard greens and serve with white rice.</p>"}]}