{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150702-mushroom-truffle-pizza-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["Italian", "mushroom", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Pizza With Mushrooms, Mozzarella, and Truffle", "link": "https://www.seriouseats.com/recipes/2015/07/mushroom-duxelles-truffle-pizza-recipe.html", "description": "Double up on mushroom flavor with sliced fresh mushrooms and a rich mushroom <em>duxelles</em>, made with shallots, thyme, and cognac. Go over the top with a drizzle of good-quality truffle oil for a triple-mushroom threat.", "totalTime": "4 hours", "recipeYield": "Makes four 10- to 12-inch pizzas, serving 4", "recipeCategory": ["Italian", "Mains", "Mushrooms", "Pizza", "Vegetarian"], "recipeIngredient": ["1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-neapolitan-pizza-dough-recipe.html\">Neapolitan Pizza Dough</a> or 2 pounds store-bought pizza dough", "1 pound mushrooms (button, cremini, shiitake, portobello, or a mix), cleaned and trimmed", "6 tablespoons extra-virgin olive oil, divided", "1 medium shallot, minced (about 2 tablespoons)", "2 teaspoons freshly minced thyme leaves, plus 1 tablespoon picked whole thyme leaves", "1/4 cup cognac or other brandy or barrel-aged spirit, such as bourbon", "2 teaspoons soy sauce", "Kosher salt and freshly ground black pepper", "6 cloves garlic, thinly sliced", "1 pound fresh mozzarella, torn into rough chunks and drained", "Truffle oil (optional), for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into 4 equal parts and place each in a covered quart-sized deli container or in a zipper-lock freezer bag. Allow to rest at room temperature for at least 2 hours before baking. Meanwhile, make mushroom mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a large plate in the freezer. Place half the mushrooms in the bowl of a food processor and pulse until very finely chopped, about 10 short pulses, scraping down sides and redistributing mushrooms with a spatula as necessary. Transfer to a bowl. Thinly slice remaining mushrooms and set aside until assembling pizzas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons olive oil in a 12-inch skillet over medium-high heat until shimmering. Add chopped mushrooms and cook, stirring occasionally, until mushrooms have exuded all their liquid and start to sizzle, about 8 minutes. Continue cooking until mushrooms begin to brown and leave browned bits stuck to bottom of pan, about 4 minutes longer. Add shallot and minced thyme and cook, stirring frequently, until softened, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cognac or brandy. Scrape bottom of skillet with a silicone spatula or wooden spoon to release browned bits. Continue to cook until brandy is nearly dry, about 4 minutes. Add soy sauce and stir to combine. Season to taste with salt and pepper and transfer mixture to the chilled plate. Spread into a thin, even layer and refrigerate until fully cooled, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to 6 inches under broiler and place stone or steel on rack. Preheat oven to highest possible temperature (500 or 550&deg;F) for at least 45 minutes. Alternatively, use a <a href=\"http://slice.seriouseats.com/archives/2013/09/the-pizza-lab-we-test-kettle-pizza-and-baking-steels-new-joint-pizza-oven.html\">KettlePizza and Baking Steel grill insert</a> on an outdoor grill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, turn one dough ball out onto a lightly floured surface. Gently press out dough into a rough 8-inch circle, leaving the outer 1 inch higher than the center. Gently stretch dough into a 10- to 12-inch circle, about 1/4 inch thick, by draping over knuckles and gently stretching. Transfer to floured wooden pizza peel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high. Dollop 1/4 of mushroom mixture over the surface of the pizza, followed by 1/4 of mozzarella pieces. Scatter 1/4 of sliced mushrooms over pizza and scatter with 1/4 of whole thyme leaves and 1/4 of sliced garlic. Season with salt and drizzle with 1 tablespoon olive oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pizza to hot stone or steel and broil, rotating regularly for even cooking, until edges are puffed and lightly charred and bottom is crisp, 3 to 6 minutes total. Retrieve pizza with a metal peel and transfer to a cutting board. Allow to rest 1 minute. Meanwhile, switch oven back to 550&deg;F to reheat stone for remaining pizzas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle with truffle oil (if using) and serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat steps 6 through 9 with remaining pizzas.</p>"}]}