{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20110803-grilled-naan-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Middle Eastern", "keywords": ["bread", "easy", "grill", "labne", "middle eastern", "za'atar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Flatbread With Olive Oil and Za'atar", "link": "https://www.seriouseats.com/recipes/2015/07/grilled-flatbread-zaatar-recipe.html", "description": "A quick and easy flatbread made on the grill gets topped with za'atar, and plenty of it!", "totalTime": "6 hours", "recipeYield": "Makes 6 flatbreads", "recipeCategory": ["Bread", "Grilling", "Middle Eastern", "Vegetarian"], "recipeIngredient": ["<strong>For the Flatbread</strong> (see note):", "10 ounces (about 2 cups) bread flour", "1 teaspoon Diamond Crystal kosher salt", "1/2 teaspoon instant or rapid-rise yeast", "2 teaspoons sugar", "2 tablespoons extra-virgin olive oil", "6 1/2 ounces (about 3/4 cup plus 1 tablespoon) yogurt or whole milk", "<strong>To Serve</strong> (see note if using store-bought za'atar):", "1 1/2 tablespoons dried oregano", "2 tablespoons minced fresh thyme leaves", "2 tablespoons minced fresh savory", "1/4 cup toasted sesame seeds", "1 1/2 tablespoons ground sumac (see note)", "2 tablespoons Diamond Crystal kosher salt", "Extra-virgin olive oil, for brushing and drizzling", "3/4 cup labne (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Flatbread:</strong> Combine flour, salt, yeast, and sugar in the bowl of a stand mixer and whisk until combined. Add olive oil and the yogurt or milk and knead with dough hook at low speed until dough comes together into a smooth ball. Dough should stick slightly to bottom of bowl as it kneads (add slightly more yogurt or milk as necessary). Continue to knead for 5 minutes. Alternatively, form dough in a food processor by adding all ingredients and processing until the dough rides around the blade. Transfer the dough to a clean bowl, cover tightly with plastic wrap, and allow to rise at room temperature until roughly doubled in volume, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough out onto floured work surface. Using a bench scraper or a knife, cut the dough into 6 equal pieces. Roll each piece into a ball, then place on a well-floured surface (leaving a few inches of space between each one) and cover with a floured cloth. Alternatively, place each ball of dough in an individual covered pint-size deli container. Allow dough to rise at room temperature until doubled in volume, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with one ball of dough at a time, stretch dough with floured hands or a rolling pin into an oblong or circle roughly 10 inches long and 6 inches wide. Once you have 2 or 3 pieces stretched, lay them out directly above the hot side of the grill. Cook without moving, popping any large air bubbles with a knife or the edge of a spatula or pizza peel, until bottom side is charred in spots and light golden brown. Flip with a large spatula, pizza peel, or tongs and cook until other side is charred and browned. Remove bread from the grill, transfer to a large plate, and cover with a clean dish towel to keep warm while you cook the remaining bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Form the za'atar mixture by combining oregano, thyme, savory, sesame seeds, sumac, and salt in a small bowl and stirring with fingers until homogenous. Brush finished flatbreads with olive oil and sprinkle generously with the za'atar mixture. Place labne in a serving dish, drizzle with olive oil, and sprinkle with za'atar. Serve bread with labne immediately.</p>"}]}