{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/12/20151110-lebkuchen-cookies-vicky-wasik-021.jpg", "author": {"@type": "Person", "name": "Grace Parisi"}, "recipeCuisine": "", "keywords": ["baking", "Christmas", "cookie", "German"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Moist and Chewy <em>Lebkuchen</em> (German Spiced Christmas Cookies)", "link": "https://www.seriouseats.com/recipes/2015/12/lebkuchen-german-spiced-christmas-cookies-recipe.html", "description": "These classic German Christmas cookies are rich with warm spices, toasted nuts, and candied fruit, with a cakey, chewy texture and a sweet, crackly glaze. They can be made as either bars or individual cookies, and get even better as they age in the days following baking.", "totalTime": "1 hour plus 4 hours chilling (if making individual cookies)", "recipeYield": "48 (3-inch) cookies or 48 bars", "recipeCategory": ["Christmas", "Cookies"], "recipeIngredient": ["<strong>For the Dough:</strong>", "1/2 cup hazelnuts (2 ounces; 57g)", "1/2 cup almond meal (2 ounces; 57g)", "2 3/4 cups sifted all-purpose flour (12 ounces; 320g)", "2 tablespoons (14.8g) unsweetened cocoa (preferably dark)", "1 1/2 teaspoons (7.5g) baking powder", "1/2 teaspoon (2.5g) baking soda", "2 teaspoons (4.2g) ground cinnamon", "1 teaspoon (2.1g) ground powdered ginger", "1/2 teaspoon (1g) ground nutmeg", "1/2 teaspoon (1g) ground cloves", "1/2 teaspoon (1g) ground allspice", "1/4 teaspoon (0.5g) ground cardamom", "1/2 teaspoon (2.8g) kosher salt", "1/2 cup tightly packed chopped candied orange rind (4 ounces; 113g)", "1/4 cup tightly packed chopped crystallized ginger (2 ounces; 57g)", "4 tablespoons unsalted butter (1/2 stick; 57g)", "3/4 cup dark brown sugar (5.3 ounces; 150g)", "1 cup honey (12 ounces; 340g)", "2 large eggs", "1 tablespoon (15mL) pure vanilla extract", "Nonstick spray, for greasing", "<strong>For the Glaze:</strong>", "3 cups confectioners' sugar (13 ounces; 375g) ", "1 tablespoon (15mL) kirsch, Grand Marnier, or rum (or pure vanilla extract)", "3 to 4 tablespoons warm water (1.5 to 2 ounces; 45 to 60mL)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Preheat oven to 350&deg;F. Spread hazelnuts on a baking sheet and toast until the skins blister, about 14 minutes. Let cool slightly, then transfer nuts to a clean kitchen towel and rub together to remove the skins. Transfer nuts to a food processor and cool completely. Pulse until finely ground. Transfer to a bowl along with the almond meal, flour, cocoa, baking powder, baking soda, cinnamon, powdered ginger, nutmeg, cloves, allspice, cardamom, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the candied orange rind and crystallized ginger into food processor along with 1 cup of the dry ingredient mixture and pulse until very finely chopped. Add the remaining dry ingredients and pulse to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a standing electric mixer fitted with a paddle attachment, beat butter with brown sugar at medium speed until creamy. Add honey and beat until smooth. Add eggs and vanilla and beat to combine. At very low speed, add dry ingredients by the heaping spoonful (to avoid powder eruptions) and beat until combined. Scrape sides and bottom of bowl and beat again until evenly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Making Bars:</strong> Line a half-sheet pan (13 inches by 18 inches) with brown parchment paper, extending paper a few inches over the short sides. Lightly spray the unlined sides of the pan with nonstick cooking spray. Spread the dough into a thin, even layer and bake in the center of the oven until surface is dimpled and a toothpick inserted into the center comes out clean, about 25 minutes. The cake should be springy but firm. Let cool on a rack for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Making Individual Round Cookies:</strong> Chill dough until quite firm, about 4 hours. Working in 2 batches, line 2 large cookie sheets with brown parchment. Dip a 1 3/4-inch ice cream scoop (2 level tablespoons) into water, shake off excess water, and scoop level scoops of dough. Roll into balls and place 2 inches apart. Bake in the lower and middle thirds of the oven, shifting pans from top to bottom and front to back halfway through, until a toothpick inserted in center of cookies comes out clean, about 18 minutes. Slide parchment onto a wire rack to let cookies cool slightly while you bake the remaining cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Glaze:</strong> In a medium bowl, whisk confectioners' sugar with kirsch and add enough water to make a thin but spreadable glaze. Spread glaze on just-warm cake or cookies and let cool completely. If making bars, slide cake (with parchment) from pan onto cutting board. Cut into 8 short strips, then cut each strip into 6 bars.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The lebkuchen can be stored in an airtight container at room temperature for up to 2 weeks, and improve significantly in texture and flavor if allowed to stand at least 1 day before serving.</p>"}]}