{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150716-halibut-clams-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["clam", "easy", "fish", "poach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Halibut à la Nage With Clams, Dill, and White Wine", "link": "https://www.seriouseats.com/recipes/2015/07/halibut-a-la-nage-clams-white-wine-recipe.html", "description": "This easy one-pot dish features halibut and clams gently poached in an aromatic broth with fennel, white wine, dill, and celery.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Clams, Mussels, and Oysters", "Easter", "Father's Day", "Fish", "Mains", "Mother's Day", "Poaching", "Valentine's Day"], "recipeIngredient": ["4 tablespoons unsalted butter, divided", "1 medium yellow onion, diced", "1 small fennel bulb, halved, cored, and diced, plus fronds for garnish (optional)", "2 medium cloves garlic, roughly chopped", "1 stalk celery, diced", "1 cup dry white wine", "2 cups water", "4 (6-ounce) skinless halibut fillets", "Kosher salt and freshly ground black pepper", "1 dozen littleneck clams, scrubbed", "1 tablespoon chopped dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, straight-sided sauté pan, heat 2 tablespoons butter over medium-high heat until foaming. Add onion, diced fennel, garlic, and celery and cook, stirring, until vegetables are softened and onion is translucent, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and cook, stirring, until reduced by about half and raw alcohol smell has mostly cooked off, about 4 minutes. Add water. Season halibut fillets with salt and pepper, then nestle in cooking liquid; they should be partially submerged. Nestle clams in the liquid around the halibut fillets. Bring liquid to a simmer, then cover pan and lower heat. Cook, covered, until clams are open and halibut is just cooked through and registers 135&deg;F on an instant-read thermometer, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spatula, transfer fish and clams to bowls. Whisk dill and remaining butter into broth until butter is fully melted and incorporated. Season broth with salt and pepper, then ladle all around fish and clams in the bowls along with the vegetables. Garnish with fennel fronds, if desired, and serve right away.</p>"}]}