{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/08/20150730-mini-salmon-burgers-plated-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["burger", "fish", "pineapple", "salmon", "sandwich", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Mini Pineapple-Teriyaki-Glazed Salmon Burgers With Avocado", "link": "https://www.seriouseats.com/recipes/2015/08/mini-pineapple-teriyaki-salmon-burger-recipe.html", "description": "These miniature salmon burgers are proof that big flavors come in small packages. Fresh salmon in a pineapple-teriyaki glaze, seared pineapple slices, lightly mashed avocado, and peppery watercress make them the perfect sweet and savory summer sandwiches.", "totalTime": "1 hour", "recipeYield": "Makes 12 mini burgers", "recipeCategory": ["Burger", "Mains", "Pineapple", "Quick Dinners", "Salmon", "Sandwiches"], "recipeIngredient": ["<strong>For the Glaze:</strong>", "2 cups light brown sugar", "1 1/2 cups pineapple juice", "1 cup water", "1/2 cup <a href=\"http://www.seriouseats.com/recipes/2012/03/teriyaki-sauce-how-to-make-at-home-recipe.html\">homemade</a> or store-bought teriyaki sauce", "2 tablespoons soy sauce", "3 tablespoons rice vinegar", "1/2 small white onion, finely minced", "4 medium cloves garlic, minced", "2 teaspoons peeled fresh ginger, minced", "<strong>For the Salmon Patties:</strong>", "1 1/2 pounds fresh, raw salmon, skin and bones removed, divided", "2 tablespoons mayonnaise", "2 scallions, white and light green parts only, chopped", "<strong>To Cook and Serve:</strong>", "2 Hass avocados, pitted and peeled", "Kosher salt", "1 tablespoon plus 2 teaspoons vegetable or canola oil, divided", "6 fresh pineapple rings, quartered", "Freshly ground black pepper", "12 Hawaiian-style rolls, toasted", "1 1/2 cups fresh watercress"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Glaze:</strong> In a large pot, stir together brown sugar, pineapple juice, water, teriyaki sauce, and soy sauce over medium heat until sugar is completely dissolved. Bring to a full boil, then lower heat to a vigorous simmer. Stir in the rice vinegar, onion, garlic, and ginger. Continue to cook, stirring occasionally, until reduced by half and syrupy, about 30 minutes. (If the glaze seems to climb the pot and you’re at risk of it boiling over, the heat is too high. Reduce the heat until you have small, consistent bubbles that don't threaten to escape the pot.) Set aside to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Salmon Patties:</strong> Chop salmon into 1-inch cubes and place half in the bowl of a food processor. Pulse until only small pieces remain (about 5 pulses), then add mayonnaise and remaining salmon. Continue to pulse until well distributed, with some larger chunks of salmon remaining. You do not want a paste, but you want to be able to mold the mixture into patties.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape salmon mixture into a bowl, mix in scallions, then form into 12 evenly sized patties. Set the patties on a parchment paper&ndash;lined baking sheet and refrigerate until ready to cook. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook and Serve:</strong> In a small bowl, gently mash the avocado with a spoon. Season lightly with salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 teaspoons oil to a medium skillet and set over medium heat until shimmering. Add pineapple rings, brush top side with glaze, then turn and brush other side with glaze. Cook, turning and applying more glaze, until lightly caramelized. Remove pineapple from skillet and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 1 tablespoon oil to skillet and set over medium-high heat until shimmering. Season salmon patties with salt and pepper, then cook in batches until golden, about 2 minutes per side. Brush liberally with glaze and cook for 1 minute longer on each side, applying more glaze when you flip the patties. Reduce heat to low and continue to cook, turning and brushing with glaze, until salmon burgers are medium-rare (115&deg;F on an instant-read thermometer) or medium (125&deg;F), about 2 minutes longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble burgers in this order: bottom bun, watercress, salmon patty, mashed avocado, glazed pineapple, top bun. Serve warm.</p>"}]}