{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/09/20150909-nicoise-salad-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["French", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "The Un-Composed (i.e., Best) Niçoise Salad", "link": "https://www.seriouseats.com/recipes/2015/09/nicoise-salad-recipe.html", "description": "Traditionally, Niçoise salads are \"composed,\" meaning each ingredient is artfully arranged in separate little piles on the plate. Here's the truth: That's a terrible (and lazy!) way to make a salad. This one is loaded with all the best ingredients, cooked with care, and assembled like you actually give a damn. Which you do. Your guests will thank you.", "totalTime": "2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fish", "French", "Mains", "Quick Dinners", "Salads", "Sides"], "recipeIngredient": ["<strong>For the Vinaigrette: </strong>", "1 small shallot, minced (about 2 tablespoons)", "1 small clove garlic, minced (about 1/2 teaspoon)", "2 teaspoons Dijon mustard", "4 cured anchovy fillets, either oil-packed or <a href=\"http://www.seriouseats.com/2015/09/how-to-buy-and-prepare-anchovies.html\">fully cleaned and prepped salt-packed ones</a>, minced (about 1 teaspoon)", "3 tablespoons white wine vinegar", "1 tablespoon water", "3/4 cup extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "<strong>For the Salad:</strong>", "3/4 pound small waxy potatoes (about 4 potatoes), such as young Yukon Golds", "1/2 medium onion", "2 sprigs fresh thyme", "4 medium cloves garlic", "1/2 cup kosher salt, plus more for seasoning", "1 pound string beans, preferably French <em>haricots verts</em>, trimmed", "4 large eggs", "1/2 pound ripe tomatoes, preferably a small variety or cherry tomatoes, halved, quartered, or cut into wedges (depending on size)", "10 anchovy fillets, either oil-packed or <a href=\"http://www.seriouseats.com/2015/09/how-to-buy-and-prepare-anchovies.html\">fully cleaned and prepped salt-packed ones</a>, cut into 1-inch lengths", "1 (250-gram, about 8.5 ounces) can oil-packed bonito tuna, such as <a href=\"http://www.amazon.com/Ortiz-Velero-Bonito-Norte-Packed/dp/B000N1662M/?tag=serieats-20&link_code=ur2&creative=9325&camp=211189\">Ortiz</a>, drained (optional; see note)", "3/4 cup pitted small black olives, such as Niçoise or Taggiasca, drained", "2 tablespoons drained brined capers", "20 torn fresh basil leaves", "3 ounces (about 4 cups) lettuce greens, such as a good mesclun mix, arugula, mizuna, and/or butter lettuce", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Vinaigrette: </strong> Combine shallot, garlic, mustard, anchovies, vinegar, and water in a large bowl and whisk to combine. Whisking constantly, slowly drizzle in olive oil. Alternatively, place all ingredients in a tightly sealing jar, seal, and shake vigorously until emulsified. Season to taste with salt and pepper. Vinaigrette will keep in the refrigerator for up to 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salad:</strong> In a large saucepan, cover potatoes with at least 2 inches of water. Add onion, thyme, and garlic. Stir in 1/2 cup salt until dissolved. Set over medium-high heat and bring just to a simmer. Lower heat to just barely below a simmer and cook until potatoes are easily pierced by a fork, about 40 minutes. Remove from heat and let stand in cooking water until cooled slightly. Drain potatoes. If using right away, allow to cool to room temperature, then crumble and set aside. If making 1 day ahead, store potatoes in the refrigerator, then revive by gently crushing with the bottom of a saucepan and frying in a cast iron skillet (see note); allow to cool to room temperature, then crumble and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, fill a large saucepan with water and season generously with salt. Fill a large bowl with ice water. Bring saucepan of water to a boil. Working in small batches, cook beans until tender-crisp, about 3 minutes. Transfer to ice bath to chill. Drain beans and pat dry; beans can be refrigerated overnight at this point. Cut beans into 1 1/2-inch lengths and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 tray of ice cubes to another large bowl and fill with water. Add 1 inch of water to a large pot. Place steamer insert inside, cover, and bring to a boil over high heat. Add eggs to steamer basket, cover, and continue cooking 9 minutes. Immediately place eggs in bowl of ice water and allow to cool for at least 15 minutes before peeling under cool running water. Store in the refrigerator for up to 5 days. Cut eggs into quarters lengthwise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine potatoes, green beans, tomatoes, anchovy fillets, tuna (if using), olives, capers, basil, and lettuce greens. Shake or whisk vinaigrette, then drizzle a small amount over ingredients in bowl, tossing gently with clean hands and adding more vinaigrette as needed until everything is lightly coated. Season with salt and pepper. Transfer salad to serving bowls and garnish with eggs.</p>"}]}