{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151122-fall-salad-food-lab-roasted-squash-kale-02-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cranberry", "kale", "kale salad", "low carb", "pecan", "squash", "thanksgiving", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Make-Ahead Roasted Squash and Kale Salad With Spiced Nuts, Cranberries, and Maple Vinaigrette", "link": "https://www.seriouseats.com/recipes/2015/11/roasted-squash-kale-make-ahead-spiced-nut-cranberry-maple-recipe.html", "description": "This salad combines sweet roasted butternut squash with roasted kale in a vinaigrette flavored with maple syrup and sherry vinegar, along with some spiced pecans for crunch and dried cranberries for a nice chewy texture. It's a delightful salad when it's made fresh, but the flavors and textures actually get even better as it sits in the fridge overnight.", "totalTime": "1 hour 45 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Christmas", "Cranberry", "Dairy-Free", "Kale", "Nuts", "Salads", "Squash", "Thanksgiving", "Vegan", "Vegetarian"], "recipeIngredient": ["2 1/2 pounds (1 kilogram, about 1 large or 2 medium) butternut squash, <a href=\"http://www.seriouseats.com/2014/10/knife-skills-how-to-prepare-butternut-squash.html\">peeled, seeded, quartered, and cut into 1/2-inch pieces</a>", "1/2 cup (120 ml) extra-virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "1 large bunch (about 8 ounces; 250 grams) lacinato or curly kale", "1/4 teaspoon ground cinnamon", "1/2 teaspoon paprika", "1/4 teaspoon ground nutmeg", "Pinch ground cloves", "Pinch cayenne pepper", "1 tablespoon light brown sugar", "1 1/2 cups (about 8 ounces; 250 grams) pecans", "1 small shallot, finely minced (about 2 tablespoons; 20 grams)", "2 tablespoons (30 milliliters) maple syrup", "1 tablespoon (10 grams) whole grain mustard", "1 tablespoon (15 milliliters) sherry vinegar", "1 cup (about 6 ounces; 200 grams) dried cranberries or cherries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 400&deg;F. Toss squash pieces with 2 tablespoons (30 ml) olive oil and season with salt and pepper. Arrange in a single layer on a foil-lined rimmed baking sheet. Bake until squash is tender throughout and well browned around the edges, 45 minutes to 1 hour. Remove from oven and allow to cool completely before attempting to remove from foil. Carefully remove squash from foil using a thin metal spatula and transfer to a large bowl. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, pick leaves off of kale stems into a large bowl and roughly tear with hands; discard stems. Drizzle with 1 tablespoon (15 ml) olive oil, season with salt and pepper, and massage until well-coated in oil. Transfer to a foil-lined rimmed baking sheet and bake until wilted and crisp in some spots, about 10 minutes. Remove from oven and transfer to bowl with squash.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cinnamon, paprika, nutmeg, cloves, cayenne pepper, and brown sugar in a large bowl. Add nuts and 1 tablespoon olive oil (15 ml), season with salt and pepper, and toss to coat. Transfer to a rimmed baking sheet and bake until toasted, about 5 minutes. Remove from oven, allow to cool slightly, then add to bowl with squash and kale.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together shallot, maple syrup, mustard, and vinegar. Whisking constantly, drizzle in remaining 1/4 cup (60 ml) olive oil. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cranberries to bowl with squash, kale, and nuts. Toss with half of dressing, taste, and add more dressing as desired. The dressed salad can be stored in the refrigerator for up to 5 days. Let it come to room temperature or briefly microwave until warm before serving.</p>"}]}