{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150216-grilled-tofu-banh-mi-recipe-vegan-12.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Vietnamese", "keywords": ["bánh mì", "sandwich", "tofu", "vegetarian", "Vietnamese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Grilled Lemongrass- and Coriander-Marinated Tofu Vietnamese Sandwiches (Vegan <em>Banh Mi</em>)", "link": "https://www.seriouseats.com/recipes/2015/02/grilled-lemongrass-coriander-marinated-tofu-vietnamese-sandwich-vegan-recipe.html", "description": "Crispy tofu is marinated in garlic, coriander root, and lemongrass, and stuffed into a Vietnamese-style sandwich with pickled carrots, daikon, cilantro, cucumber, and jalapeños. The trick is a low and slow cooking method and a double coating of the flavorful marinade.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Dairy-Free", "Mains", "Sandwiches", "The Food Lab", "Tofu", "Vegan", "Vegetarian", "Vietnamese"], "recipeIngredient": ["6 medium cloves garlic", "12 sprigs cilantro, including thick stalks", "3 tablespoons palm or light brown sugar", "2 teaspoons ground white pepper", "1 teaspoon ground coriander", "2 teaspoons soy sauce", "2 (3-inch) segments lemongrass", "3 tablespoons vegetable oil", "1 pound extra-firm tofu, cut into 1/3-inch slabs, carefully dried (see note)", "3 to 4 Vietnamese-style baguettes, or 2 standard baguettes", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2012/01/how-to-make-vegan-mayo-mayonnaise-recipe.html\">homemade</a> or <a href=\"http://www.seriouseats.com/2014/02/vegan-mayonnaise-taste-test-produces-surprising-results.html\">store-bought<a/> vegan mayonnaise", "2 teaspoons liquid aminos, such as Maggi or Bragg's", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/05/hainnanese-ginger-scallion-oil.html\">Hainnanese Ginger-Scallion Oil</a> (optional)", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/02/pickled-daikon-and-carrot-do-chua.html\">Vietnamese Pickled Carrots and Daikon</a> (do chua)", "1 cucumber, seeds removed, split lengthwise into 8 spears", "1 jalapeño pepper, seeds and stem removed, sliced into thin spears", "1 bunch cilantro leaves and fine stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine garlic, cilantro, sugar, white pepper, coriander, soy sauce, lemongrass, and half of oil in the bowl of a food processor. Process until a paste is formed, about 1 minute, scraping down sides as necessary. Brush or rub half of mixture over tofu slabs, stacking them in a plastic container or on a plate as you go.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook on the Grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Place tofu over cooler side of grill at 45-degree angle to the grill grates. Cover and cook for 5 minutes. Carefully rotate tofu 90 degrees and continue cooking until bottom side is crisp and has distinct hash marks, about 5 minutes longer. Carefully flip tofu and repeat cooking and rotating steps until crisp on both sides. Continue with step 4 and transfer tofu to a large plate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook Under the Broiler:</strong> Oil a <a href=\"http://www.amazon.com/Professional-Cross-Cooling-Sheet-Grate/dp/B0001MS3DI/?tag=serieats-20\" target=\"_blank\">wire cooling rack</a> and set it in a foil-lined <a href=\"http://www.amazon.com/Norpro-Commercial-Grade-Aluminum-Jelly/dp/B000F7A58U/?tag=serieats-20\" target=\"_blank\">rimmed baking sheet</a>. Arrange tofu slices on top in a single layer. Adjust rack to 6 to 8 inches below broiler element and preheat broiler to low (if your oven has two broiler settings, otherwise just preheat the broiler). Broil tofu, turning and rotating every few minutes until crisp and browned on both sides, about 20 minutes total. Continue with step 4 and transfer tofu to a large plate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While tofu cooks, combine remaining marinade with remaining oil in a small bowl. When tofu is cooked, transfer to a large plate or cutting board and, using a brush or the back of a spoon, coat each piece with the remaining marinade. Cut each piece into slices slightly narrower than the baguettes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place baguettes on the cooler side of the grill (or place in oven and immediately shut off broiler if cooking indoors). Cover and cook until heated through and crisp, about 5 minutes. Split baguettes, leaving them hinged on one side. Spread with mayonnaise. Sprinkle bottoms and tops with liquid aminos, then spoon on a thin layer of the ginger-scallion oil if using. Layer with sliced tofu. Add pickled carrot/daikon mixture, cucumber spears, jalapeño, and cilantro. Season to taste with salt, close sandwiches, split in half crosswise (or if using full-sized standard baguettes, cut each into 3 to 4 serving pieces), and serve immediately.</p>"}]}