{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/01/20150114-ragu-napoletana-neapolitan-meat-sauce-pork-beef-sausage-italian-recipe-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["beef", "Italian", "italian american", "Naples", "pasta", "pork", "ragu", "sauce", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Ragú Napoletano (Neapolitan-Style Italian Meat Sauce with Pork, Beef, and Sausage)", "link": "https://www.seriouseats.com/recipes/2015/01/ragu-napoletano-meat-sauce-pork-beef-sausage-recipe.html", "description": "If you were to pick a president and <em>el tigre numero uno</em> of the ragù world, it'd be <em>ragù Napoletano</em>, a meaty stew with big chunks of beef, pork, and sausages simmered until fall-apart tender in a rich tomato sauce flavored with wine, onions, garlic, basil, and plenty of good Southern Italian olive oil. It's the precursor to Italian-American Sunday gravy: just add some meatballs, serve it with spaghetti, and you're there. It's also the perfect dish for a lazy Sunday with family or friends at home.", "totalTime": "about 4 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Beef", "Italian", "Mains", "Pasta", "Pork", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["3 pounds pork spare ribs (about 1/3 large rack), cut into three chunks", "2 pounds beef chuck, cut into 2-inch strips", "1/2 cup extra-virgin olive oil, divided", "1 large onion, finely chopped (about 1 1/2 cups)", "8 medium cloves garlic, <a href=\"http://seriouseats.com/2015/01/how-to-mince-chop-garlic-microplane-vs-garlic-press.html\">finely minced</a>, divided", "1/2 teaspoon dried red chili flakes", "1 teaspoon dried oregano", "2 cups dry red wine", "2 (28-ounce) cans whole peeled tomatoes, preferably D.O.P. San Marzano, crushed by hand in a large bowl", "1 (2- to 3-inch) Parmesan rind (optional)", "1 bunch fresh basil", "1 pound mild sausage, in the casings (see note)", "1 tablespoon Asian fish sauce", "8 to 10 servings fresh or dried pasta", "Grated Parmesan cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat oven to 300&deg;F (see note for slow cooker instructions). Season ribs with salt and pepper. Heat 2 tablespoons olive oil in a large Dutch oven over high heat until shimmering. Add ribs and cook without moving until well browned, 8 to 10 minutes. Flip and cook until second side is well browned, 5 to 7 minutes longer. Transfer to a plate and set aside. Repeat with beef until browned all over and add to plate with pork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onions to now-empty dutch oven and cook, scraping up any browned bits, and stirring frequently until just beginning to brown, about 6 minutes. Add garlic and continue cooking until onions and garlic are lightly browned, about 3 minutes longer. Add pepper flakes and oregano and cook, stirring, for 30 seconds. Add wine and cook until nearly completely reduced, about 5 minutes. Add tomatoes, Parmesan rind (if using), and 3/4 of basil. Return ribs and pork to pot and bring to a simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with lid slightly ajar and place in the oven (see note for slow cooker instructions). Cook, stirring occasionally, until the rib bones can be easily pulled from the meat, about 3 hours. Add sausages and continue cooking for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer ribs, beef, and sausages to a bowl, discard bones, and let stand until cool enough to handle. Discard basil sprigs from sauce. Roughly shred rib and beef with two forks or your hands and return to pot. Slice sausages into disks and return to sauce. Stir in fish sauce and remaining olive oil and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, cook pasta in a pot of boiling salted water until just shy of al dente (about 1 minute for fresh pasta or 1 minute short of recommended cooking time for dried pasta). Drain, reserving about 1 cup of starchy pasta water. Return pasta to the pot you just cooked it in and add half of ragù, half of pasta cooking water, and a handful of grated cheese. Cook over high eat, stirring until the sauce emulsifies with the pasta water and clings to the pasta, adding more pasta water if necessary. Serve immediately, passing additional sauce, cheese, and remaining fresh basil at the table.</p>"}]}