{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150309-siu-mai-shao-zhong-4.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "dumpling", "pork", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pork and Shrimp Siu Mai (Steamed Chinese Dumplings)", "link": "https://www.seriouseats.com/recipes/2015/03/pork-shrimp-siu-mai-steamed-chinese-dumplings-recipe.html", "description": "Siu mai, the Chinese steamed pork and shrimp dumplings, are one of the most popular items at dim sum parlors. But you don't have to go out just to enjoy them, because they're one of the easiest dumplings to make at home.", "totalTime": "2 hours", "recipeYield": "Makes about 15 dumplings", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Chinese", "Pork", "Shrimp", "Snacks"], "recipeIngredient": ["1/4 pound shrimp, shelled and deveined", "1 tablespoon baking soda", "1/2 pound bonesless pork, such as shoulder, cut into large cubes", "2 ounces pork fat, such as fatback or fatty belly, finely diced", "1/4 teaspoon ground white pepper", "1/2 teaspoon kosher salt", "2 teaspoons cornstarch", "2 teaspoons Shaoxing wine", "1 teaspoon toasted sesame oil", "1 teaspoon extra-virgin olive oil ", "1/2 teaspoon finely grated fresh peeled ginger", "1/2 teaspoon sugar ", "1 package extra-thin wonton wrappers or regular wonton wrappers", "1 large carrot, thinly sliced into 15-20 rounds and the rest finely minced (optional, see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, cover shrimp with cold water and stir in baking soda. Refrigerate for 30 minutes. Drain and rinse shrimp under cold running water, then pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the shrimp in a food processor and pulse 10 times, until coarsely chopped. Transfer shrimp to a large mixing bowl. Add pork and pork fat to the food processor and pulse until finely chopped. Transfer pork to bowl with shrimp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add white pepper, salt, cornstarch, Shaoxing wine, sesame oil, olive oil, ginger, and sugar to the pork and shrimp, and, using a spatula or chopsticks, mix well until thoroughly combined. Set filling aside in the refrigerator for at least 30 minutes or overnight. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To wrap the siu mai, place 1 wonton wrapper in the palm of your hand. Place about 1 tablespoon of filling in the middle of the wrapper. Bring two opposite corners towards each other, and press gently to adhere them to filling. Repeat with remaining 2 corners to form a little cup around the filling, gently squeezing to hold wrapper in place. Place one carrot round (if using) on the bottom of each siu mai, add a little bit of the minced carrot on top, and transfer to a plate. Continue wrapping the remaining siu mai. The siu mai can be frozen now (see note) or cooked; note that frozen siu mai are best made without the carrot rounds on the bottom.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To steam, line your steamer basket or tray with parchment paper (Napa cabbage laves can also work). Pour enough water into your steaming pot or wok so that the water is about 1 inch below the bottom of the steamer basket or tray. Bring to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange siu mai in the steamer tray, leaving room around each one and steaming in batches if necessary. Steam fresh siu mai until cooked through, about 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a plate. Serve. (Note that siu mai are traditionally served without a dipping sauce, though if you prefer one, mix soy sauce with a little sesame oil and fresh scallions and serve alongside.)</p>"}]}