{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150521-Chinese-Hot-Mustard-Pork-Pretzel-Bao-Mixing-Morgan-Eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "bao", "bun", "Chinese", "German", "mashup", "pork", "pretzel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Pretzel Bao With Sweet Sesame-Hot Mustard Pork", "link": "https://www.seriouseats.com/recipes/2015/06/sesame-hot-mustard-pork-pretzel-bao-recipe.html", "description": "German-Chinese fusion may sound strange, but when pillowy pretzel buns meet bao, and mustard-slathered roasted pork meats <em>char siu</em>, it <em>works</em>. Chinese hot mustard, sesame paste, and honey make a flavor-packed change-up from the traditional char siu sauce, while a special Chinese bread-making trick makes the pretzel buns even more moist and tender. It's impossible not to love this Deutsch version of a Dim Sum classic.", "totalTime": "5 hours", "recipeYield": "Make 16 buns", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chinese", "Pork", "Sides", "Snacks"], "recipeIngredient": ["<strong>For the Marinated Pork:</strong>", "2 medium garlic cloves, minced", "1 small shallot, minced", "1 (1/2-inch) knob fresh peeled ginger, minced", "1 tablespoon low-sodium soy sauce", "2 tablespoons Chinese hot mustard", "2 tablespoons sesame paste", "2 tablespoons granulated sugar", "1 teaspoon kosher salt", "2 pounds boneless pork loin, belly, or butt ", "<strong>For the Glaze:</strong>", "2 tablespoons honey", "1 tablespoon water", "<strong>For the Sauce:</strong>", "1 bunch chives, chopped", "1/3 cup Chinese hot mustard", "1/3 cup sesame paste", "1/3 cup honey", "<strong>For the <em>Tangzhong</em>:</strong>", "3 tablespoons bread flour", "1/2 cup water", "<strong>For the Dough:</strong>", "1/2 cup milk", "2 teaspoons active dry yeast", "1/4 cup granulated sugar", "3 cups bread flour", "1 teaspoon kosher salt", "1 large egg", "2 tablespoons unsalted butter, melted and cooled", "<strong>For the Alkaline Solution:</strong>", "1/2 cup baked baking soda (see note)", "2 cups hot water", "<strong>For Topping the Buns:</strong>", "1 large egg", "1 tablespoon water", "Sesame seeds, for sprinkling", "Pretzel salt or sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Marinated Pork:</strong> In a large container, mix together all of the marinade ingredients (except the pork) until well combined. Add pork and toss to cover with the marinade. Cover and refrigerate at least 2 hours or overnight, turning at least once. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Line a baking sheet with aluminum foil and place a rack on top. Remove the pork from the marinade and place on the rack. Roast until pork reaches 135&deg;F on an instant-read thermometer when inserted in the center, about 40 minutes.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, For the Glaze:</strong> In a small bowl, mix together honey and water for the glaze. Brush the pork with the glaze and set the oven to broil. Broil the pork, turning, until charred all over, about 5 minutes. Let rest 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sauce:</strong> Combine all sauce ingredients in a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut roasted pork into small pieces and mix in a large bowl with the sauce. Refrigerate until ready to stuff.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the <em>Tangzhong</em>:</strong> In a small saucepan over medium-low heat, mix together the water and bread flour. Cook, stirring constantly, until thick and lightly golden. Remove from heat and transfer the tangzhong to a small container. Cover with plastic and chill for at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Warm 1/2 cup of milk and pour in the yeast. Let stand until frothy, about 10 minutes. Combine the yeast-milk mixture, the Tangzhong, and the remaining dough ingredients in a large bowl, and stir until the dough pulls away from the side of the bowl, about 5 minutes. Remove from the bowl and knead on a lightly floured work surface until stretchy, about 10 minutes longer. Spray the dough all over with nonstick spray and return to the bowl. Place plastic wrap directly on top of the dough to prevent it from drying out and set in a warm, draft free area until doubled in size, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the dough from the bowl and divide into 16 even pieces. Roll the pieces into balls. Using the palm of your hand, press down each dough ball until flat. Place 2 tablespoons of filling on the center of each round. Pull up the edges and pinch together to seal. Transfer the filled buns, seam-side down, to a parchment-lined baking sheet. Re-cover with the coated plastic wrap and let rise for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Alkaline Solution:</strong> Preheat the oven to 350&deg;F. In a large bowl, whisk together 2 cups of hot water and baked baking soda. Dunk the tops of the stuffed buns into the baking-soda solution for 1 minute each and then return to the tray, dipped side up. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Topping the Buns:</strong> In a small bowl, beat the egg with the water. Brush the buns with the egg mixture and sprinkle with sesame seeds and salt, to your preference. Using a sharp knife or pair of kitchen shears, slice the very tops of the buns, making sure not to pierce through to the filling. Bake until browned, about 20 minutes, turning halfway through.<br />\r\nServe warm.</p>"}]}