{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/french-melt-kenji.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "French", "keywords": ["cheese", "French", "grilled cheese"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "French Melt (Grilled Cheese With Caramelized Onion and Comté)", "link": "https://www.seriouseats.com/recipes/2015/02/french-melt-grilled-cheese-sandwich-with-caramelized-onions-recipe.html", "description": "Want to impress your dinner date? Whip up a couple of French Melts. That's a big ol' pile of sweet, caramelized onions (see here for an easy technique to speed up the process) melted with a fat slab of Comté cheese. It's like French onion soup in an easy-to-pick-up, extra-buttery package. Set the table cloth and pull out the fine china, dear, tonight I'm wearing pants to the table!", "totalTime": "1 hour", "recipeYield": "Makes 2 sandwiches", "recipeCategory": ["Cheese", "French", "Sandwiches"], "recipeIngredient": ["4 tablespoons butter, divided", "2 medium onions, thinly sliced", "Kosher salt and freshly ground black pepper", "4 slices crusty country-style bread", "4 ounces Comté or gruyere cheese, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon in a large non-stick of cast iron skillet over medium-low heat until melted. Add onions, season with salt and pepper and cook, stirring frequently, until deeply caramelized and rich brown, about 45 minutes (If onions threaten to burn, add 1 tablespoon of water). Transfer onions to a bowl and wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to medium heat and melt 1 tablespoon butter. Add bread slices and cook, swirling bread around pan, until pale golden brown, about 2 minutes. Transfer to a cutting board, cooked-side-up. Divide cheese evenly between each slice. Spread onions evenly between two slices. Close sandwiches with onions and cheese inside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 1 more tablespoon butter in skillet and add both sandwiches. Cook, swirling pan frequently, until deep golden brown on first side, about 3 minutes. Add remaining tablespoon butter, flip sandwiches, and continue cooking until deep golden brown and cheese is melted, about 3 minutes longer. Serve immediately.</p>"}]}