{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/03/20150313-pulled-pork-jalapeno-poppers-raspberry-sauce-plated-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["barbecue", "cheese", "jalapeño", "jalapeño popper", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pulled Pork Jalapeño Poppers With Raspberry Sauce", "link": "https://www.seriouseats.com/recipes/2015/04/pulled-pork-jalapeno-poppers-bacon-recipe.html", "description": "Jalapeño poppers get a barbecue-style update with bacon, pulled pork, and tangy raspberry sauce. No frying necessary: just cut the jalapeños in half, stuff them, roast them, and serve them with sauce for a sweet, spicy, smoky, and downright delicious appetizer.", "totalTime": "45 mins", "recipeYield": "12 poppers", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Pork", "Sides", "Snacks"], "recipeIngredient": ["10 ounces raspberries", "2 tablespoons sugar", "2 tablespoons apple cider vinegar", "Pinch of chipotle chili powder (or more, to taste)", "Kosher salt", "6 ounces cream cheese, softened", "4 ounces sharp cheddar cheese, shredded", "10 ounces pulled pork coated in barbecue sauce (see note)", "12 jalapeño peppers, halved, seeded, and membranes removed", "12 slices bacon, cut in half", "Cilantro leaves, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan, combine the raspberries, sugar, and apple cider vinegar and heat over medium-low heat, stirring occasionally, until the raspberries are broken down into a thick sauce the mixture coats the back of a spoon, about 20 minutes. Stir in chipotle chili powder and season with salt. If desired, strain to remove seeds. Let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400 &deg;F. In a medium-sized bowl, stir together cream cheese, cheddar cheese, and pulled pork until evenly distributed. Spoon the filling generously into the halved jalapeños. Wrap a half-strip of bacon around the middle of each stuffed jalapeño half, tucking the cut sides underneath the poppers. Place the wrapped poppers on a baking sheet lined with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until the bacon is crisp and the cheese begins to brown, about 25 minutes. If you like your bacon extra crisp, turn the broiler on for the last 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let poppers cool slightly, then drizzle with raspberry sauce and garnish with cilantro. Serve warm.</p>"}]}