{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150429-tamale-dough-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "Mexican", "keywords": ["corn", "dough", "masa", "Mexican", "tamale"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.3333333333333", "ratingCount": "3"}, "name": "Basic Mexican Tamale Dough", "link": "https://www.seriouseats.com/recipes/2015/05/basic-mexican-tamale-dough-recipe.html", "description": "This master dough recipe for Mexican tamales starts with either fresh <em>masa</em> (the nixtamalized corn dough used to make tamales and tortillas) from a tortilleria or masa <em>harina</em> (nixtamailzed corn flour that's reconstituted with water or stock). Then lard, baking powder, and chicken stock are beaten into it to create a light, tender, and flavorful tamale that can be stuffed with your favorite filling, like <a href=\"link-to-green-chili-tamales\">green chili and pork</a>, <a href=\"link-to-rajas-tamales\">rajas and queso</a>, or <a href=\"link-to-red-chili-tamales\">red chili with chicken</a>.", "totalTime": "1 hour 15 minutes", "recipeYield": "Makes enough dough for about 30 tamales", "recipeCategory": ["Corn", "Mexican", "Snacks"], "recipeIngredient": ["2 pounds fresh masa for tamales from a tortilleria or 3 cups of masa harina para tamales mixed with 2 cups water or chicken stock and left to rest, covered, for 15 minutes (see note)", "8 ounces lard, preferably back lard (see note)", "2 teaspoons baking powder", "2 teaspoons kosher salt", "1 cup <a href=\"http://www.seriouseats.com/2014/10/how-to-make-rich-flavorful-easy-chicken-stock.html\">homemade chicken stock</a> or store-bought low-sodium broth, plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine lard, salt, and baking powder and, using an electric mixer, beat at medium-high speed until well whipped, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add one-fourth of the masa at a time to the lard, beating between additions until thoroughly incorporated. Add chicken stock and continue beating until dough is light and has a soft and spreadable hummus-like texture. Cover masa with plastic and refrigerate for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove masa from refrigerator and re-whip, adding additional chicken stock 1 tablespoon at a time, if necessary, to return it to original hummus-like texture. Use tamale dough in any tamale recipe (see links above for ideas, assembly, and cooking instructions).</p>"}]}