{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150207-vegan-tamale-pie-chili-cornbread-crust-recipe-9.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["bean", "cal mex", "casserole", "cast iron cooking", "comfort", "cornbread", "tamale", "tamale pie", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Quick and Easy Vegetarian Tamale Pie With Brown Butter Cornbread Crust", "link": "https://www.seriouseats.com/recipes/2015/03/vegetarian-tamale-pie-recipe.html", "description": "I've been on a tamale pie kick ever since updating my mom's classic recipe a couple months ago by adding a brown butter cornbread crust. Essentially an olive-packed chili baked underneath a sweet cornbread crust, it's one of the all-in-one comfort classics that never fails to bring big smiles and full bellies in its wake. This 100% vegetarian version is no different.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cornbread", "Mains", "Soups and Stews", "The Food Lab", "Vegetarian"], "recipeIngredient": ["1/4 cup extra-virgin olive oil", "1 cup fresh corn kernels from 1 to 2 ears of corn", "1 medium onion, diced", "1 red bell pepper, diced", "1 poblano pepper, diced", "Kosher salt and freshly ground black pepper", "4 medium cloves garlic, thinly sliced", "1 Serrano pepper, minced", "1 tablespoon ground cumin (preferably from whole seeds)", "1 teaspoon ground coriander (preferably from whole seeds)", "1 teaspoon dried oregano", "3 tablespoons ancho chili powder", "1 cup pitted green olives, sliced", "1 tablespoon soy sauce", "1 (15-ounce) can black beans, drained and rinsed", "1 (15-ounce) can red kidney beans, drained and rinsed", "1 (28-ounce) can whole peeled tomatoes, drained and coaresly crushed with your hand", "4 ounces grated sharp cheddar cheese (about 1 cup)", "3 scallions, thinly sliced", "1/2 cup fresh cilantro leaves and fine stems, minced", "<strong>For the Brown Butter Cornbread Crust:</strong>", "6 talespoons unsalted butter", "1 cup (about 5 ounces) fine yellow cornmeal", "1 cup (about 5 ounces) all-purpose flour", "4 tablespoons sugar", "2 teaspoons baking powder", "1/4 teaspoon baking soda", "2 eggs", "6 ounces (about 3/4 cup) sour cream", "4 ounces (about 1/4 cup) cultured buttermilk", "1/2 cup thinly sliced scallions", "1 red jalapeño pepper, finely minced", "Sour cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 425&deg;F. Heat oil in a large Dutch oven, or saucepan over high heat until lightly smoking. Add corn and cook, stirring occasionally, until corn is well charred in spots, about 4 minutes. Add onion, bell pepper, and poblano pepper, season with salt and pepper, and cook, stirring, until softened but not browned, about 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add garlic, Serrano pepper, cumin, coriander, oregano, and chili powder and cook, stirring, until fragrant, about 30 seconds. Add olives, soy sauce, tomatoes, black beans, and kidney beans. Bring to a simmer and adjust heat to maintain. Cook, stirring occasionally, until thick and fragrant, about 20 minutes. Stir in grated cheese, scallions, and cilantro and season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Brown Butter Cornbread Crust:</strong> Heat butter in a 12-inch cast iron or stainless steel skillet over medium heat until melted. Continue to cook, swirling pan gently until butter is nutty-smelling and solids are a toasty brown. Transfer to a heatproof cup or bowl and let rest until slightly cooler, about five minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cornmeal, flour, sugar, 1 teaspoon kosher salt, baking powder, and baking soda in a large bowl. Combine eggs, sour cream, and buttermilk in a second bowl and whisk until homogenous. Whisking constantly, slowly drizzle in reserved browned butter. Whisk wet ingredients into dry ingredients until homogenous. Fold in scallions and jalapeño pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer bean mixture to a large cast iron skillet. Using a large spoon, place small dollops of the cornbread batter mixture on top of the bean filling, then use the back of the spoon to spread it into an even layer. Transfer the skillet to the oven and bake until pale golden brown and a skewer inserted into the cornbread comes out clean, about 20 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool 15 minutes, then serve with sour cream.</p>"}]}