{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/01/20141222-the-kitchn-cookbook-breakfast-pizza-leela-cyd.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["Cook the Book", "dough", "pizza", "the kitchn cookbook"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pizza Dough From 'The Kitchn Cookbook'", "link": "https://www.seriouseats.com/recipes/2015/01/pizza-dough-from-the-kitchn-cookbook.html", "description": "From <a href=\"http://www.amazon.com/Kitchn-Cookbook-Recipes-Kitchens-Inspire/dp/0770434436/?tag=serieats-20\"><em>The Kitchn Cookbook: Recipes, Kitchens &amp; Tips to Inspire Your Cooking,</em></a> by Sara Kate Gillingham and Faith Durand, this pizza dough recipe is quick and easy and results in a pleasantly chewy crust.", "totalTime": "1 hour 40 minutes", "recipeYield": "Makes two 10-inch pizzas", "recipeCategory": ["Cook the Book", "Pizza"], "recipeIngredient": ["3/4 cup (6 ounces) lukewarm water", "1 teaspoon active dry yeast or instant yeast", "2 cups unbleached all-purpose flour, plus more as needed", "1 1/2 teaspoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl or in the bowl of a stand mixer, combine the water and yeast and stir with a fork to dissolve the yeast. The mixture should look cloudy and begin to foam. Place the paddle attachment on the mixer, add the flour and salt to the bowl, and mix until a shaggy dough is formed. If the dough is too wet, add more flour as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough out onto a clean work surface, along with any loose flour still in the bowl. Or, if using a stand mixer, switch to the dough hook. Knead the dough until all the flour is incorporated, and the dough is smooth and elastic, about 5 minutes. The dough should still feel moist and slightly tacky. If it’s sticking to your hands and the countertop or the sides of the stand mixer bowl like bubble gum, work in more flour 1 tablespoon at a time until it is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you have time at this point, you can let the dough rise, covered in an oiled bowl in a warm place until doubled in size (about 1 hour and 30 minutes). After the dough has risen, you can use the dough or wrap it in plastic wrap and refrigerate it for up to 3 days. (Bring the dough to room temperature before proceeding.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the dough with the upside-down mixing bowl or a clean kitchen towel while you prepare the pizza toppings, or let the dough rest overnight.</p>"}]}