{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150215-vegan-ramen-recipe-04.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["Japanese", "noodle", "ramen", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "16"}, "name": "The Ultimate Rich and Creamy Vegan Ramen With Roasted Vegetables and Miso Broth", "link": "https://www.seriouseats.com/recipes/2015/02/vegan-ramen-miso-creamy-vegan-vegetarian-food-lab-recipe.html", "description": "This is the bowl of vegetarian ramen I've been working towards ever since I first ventured into the vegetable-based foothills of Mount Ramen two years ago. It has a rich, creamy broth that's layered with flavor and thick enough to coat the noodles as they're slurped from the bowl, plus little pools of glistening, flavorful fat, and four different toppings that deliver on texture and flavor. This is hands-down the best bowl of ramen I've ever made. And it can all be yours, with a little bit of heavy-duty climbing, that is.", "totalTime": "3 hours", "recipeYield": "Makes enough broth and toppings for 4 to 6 servings", "recipeCategory": ["Dairy-Free", "Japanese", "Mains", "Ramen", "Soups and Stews", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Broth:</strong>", "1 small eggplant", "1 medium skin-on yellow onion, split in half", "2 whole heads garlic", "1 (4-inch) knob ginger, cut into 1/4- to 1/2-inch slices lengthwise", "1 tablespoon vegetable or canola oil", "Stems from 6 ounces fresh shiitake mushrooms (caps quartered and reserved for shiitake soy sauce, below)", "Stiff bottom stems from 6 ounces maitake or beech mushrooms (caps and tender stems reserved for roasted mushroom and sweet potatoes, below)", "1 (6-inch) segment kombu (see note)", "1/2 ounce dried porcini mushrooms", "1/2 ounce dried shiitake mushrooms", "6 leaves napa cabbage", "1 leek, roughly chopped", "6 scallions, roughly chopped", "<strong>For the Roasted Sweet Potato and Mushroom Topping:</strong>", "1 medium sweet potato cut into 1/2-inch dice", "Caps and tender stems from 6 ounces maitake or beech mushrooms", "2 tablespoons vegetable oil", "1 tablespoon <em>shichimi togarashi</em>, plus more to serve (see note)", "Kosher salt", "<strong>For the Shiitake-Soy Tare:</strong>", "Caps from 6 ounces fresh shiitake mushrooms, quartered", "1 (6-inch) segment kombu (see note)", "1 (4-inch) knob ginger, cut into 1/4- to 1/2-inch slices lengthwise", "6 scallions, very roughly chopped", "6 medium cloves garlic, unpeeled", "1/2 cup soy sauce", "1/2 cup mirin (see note)", "<strong>For the Mushroom-Scallion Oil:</strong>", "1/2 ounce dried porcini mushrooms", "1/2 ounce dried shiitake mushrooms", "6 scallions, very roughly chopped", "1/2 cup vegetable or canola oil", "<strong>For the Charred Eggplant Topping:</strong>", "1 tablespoon toasted sesame seeds", "<strong>To Finish:</strong>", "1/4 cup white or yellow miso paste", "3 tablespoons Japanese sesame paste or tahini", "2 medium cloves garlic, finely minced", "4 to 6 servings raw ramen noodles", "1 cup very thinly sliced scallions or Tokyo <em>negi</em> (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Broth:</strong> Adjust rack to 4 to 6 inches below broiler element and preheat broiler to high. Toss eggplant, onion, garlic, and ginger with 1 tablespoon oil until coated on all surfaces. Transfer to a foil-lined broiler pan or rimmed baking sheet. Broil, turning vegetables occasionally until all vegetables are well charred on all surfaces and eggplant is completely tender (a knife inserted into it should meet no resistance around the stem or base). Remove from oven, lower rack to center position, and adjust oven temperature to 400&deg;F. Wrap eggplant in aluminum foil and reserve for Charred Eggplant Topping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer onions, ginger, and garlic to a large stock pot or Dutch oven. Add shiitake and maitake mushroom stems, kombu, 1/2 ounce dried porcini mushrooms, 1/2 ounce dried shiitake mushrooms, cabbage, leek, and 6 scallions. Cover with water by 1 inch. Bring to a boil over high heat, reduce to a bare simmer, cover, and cook while making remaining toppings (about 1 1/2 hours).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, make the Roasted Sweet Potato and Mushroom Topping:</strong> Toss the sweet potato pieces and maitake or beech mushroom caps and tender stems in a large bowl with 2 tablespoons vegetable or canola oil, 1 tablespoon togarashi, and a big pinch of salt. Transfer to a foil-lined rimmed baking sheet and roast until potatoes are tender and mushrooms and potato are browned around their edges, about 25 minutes. Remove from oven and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Shiitake-Soy Tare:</strong> Combine shiitake mushroom caps, kombu, ginger, scallions, garlic, soy sauce, and mirin in a small saucepan. Bring to a bare simmer, cover, and cook, stirring occasionally, until liquid is reduced by about half and mushrooms are very tender and flavorful, about 30 minutes. Discard kombu, ginger, scallions, and garlic. Strain mushrooms through a fine mesh strainer set in a liquid measuring cup. Reserve mushrooms and cooking liquid separately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mushroom-Scallion Oil:</strong> Combine dried porcini, dried shiitake, scallions, and oil in a small saucepan. Place over medium heat and cook, stirring, until scallions and mushrooms are releasing a thin, steady stream of bubbles. Remove from heat, cover, and set aside to infuse.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Charred Eggplant Topping:</strong> Unwrap eggplant and slit skin lengthwise. Use a spoon to scoop out the flesh and transfer it to a salad spinner. Discard the skin. Spin eggplant to remove excess liquid. Add eggplant liquid to the pot of stock on the stovetop. Transfer eggplant flesh to a small bowl and stir in sesame seeds and 1 tablespoon of shiitake-soy tare. Season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Finish the Broth:</strong> Strain broth through a fine-mesh strainer or chinois into a clean pot. Reserve whole garlic heads and discard remaining vegetables. Cut the top off the garlic heads and squeeze out the cloves (they should be very tender). Discard skins. Transfer garlic and 1/2 cup of roasted sweet potato to the jar of a blender. Add 1 cup of strained stock. Blend, starting on low and increasing to high speed, until completely smooth, about 1 minute. Whisk garlic/sweet potato mixture into the finished broth. You should have a little over 2 quarts of finished broth. Season broth to taste gently with salt (we will be adding miso and soy sauce to it, so be very light on the seasoning).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> In a small bowl, stir together miso paste, sesame paste, minced garlic, and 6 tablespoons of shiitake-soy tare. Bring a large pot of salted water to a boil over high heat. Heat stock until just under a simmer on the stovetop. Preheat 6 serving bowls in the oven for 2 minutes. Remove from oven. Divide miso mixture evenly among the 6 bowls. Add 1 1/2 cups hot broth to each bowl and stir gently to incorporate miso mixture. Taste and adjust seasoning with salt or more shiitake-soy tare if necessary. Cook ramen noodles in the boiling water for 90 seconds. Drain carefully and divide evenly between the bowls. Drizzle each bowl with 1 tablespoon of the mushroom-scallion oil. Top with simmered shiitake caps, roasted sweet potato, roasted mushroom, eggplant mixture, and scallions. Sprinkle with more shichimi togarashi, if desired, and serve immediately.</p>"}]}