{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/01/FrozenFruitMousse.jpg", "author": {"@type": "Person", "name": "Nila Jones"}, "recipeCuisine": "", "keywords": ["berry", "dessert", "easy", "mousse", "quick", "raspberry", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5454545454545", "ratingCount": "11"}, "name": "Light and Easy 5-Minute Fruit Mousse", "link": "https://www.seriouseats.com/recipes/2015/01/light-and-easy-five-minute-fruit-mousse-dessert-recipe.html", "description": "This delicious fruit mousse is wonderfully light and incredibly easy to make. It just takes five minutes, three ingredients and a food processor. The result will delight even your pickiest guests.", "totalTime": "5 minutes", "recipeYield": "serves 4 to 6", "recipeCategory": ["Easter", "Father's Day", "Fruit Desserts", "Ice Cream and Frozen Treats", "Mother's Day", "Raspberry", "Valentine's Day"], "recipeIngredient": ["8 1/2 ounces (about 2 1/4 cups) frozen berries or other fruit", "2 tablespoons of sugar (or use sugar, honey, maple syrup or stevia extract to taste)", "1 large egg white", "Fresh berries and whipped cream for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add fruit to the bowl of a food processor. Process to a rough puree, about 1 minute. Add the sugar or another sweetener and pulse briefly to combine. If you're using a different sweetener, add a small amount at a time to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the egg white and process until smooth and fluffy and the mixture has lightened in color and doubled or tripled in volume, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the mixture clings to the sides of the food processor's bowl too much (this may happen if the blade doesn't extend all the way to the sides of the bowl), transfer the mixture to a normal medium-sized bowl and beat with a mixer fitted with the whisk attachment until fluffy. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the mousse into glasses and top or layer with fresh berries and/or whipped cream (optional). Serve immediately or store in the refrigerator for up to 2 hours (because this mousse has very little sugar in it, it's not very stable and it won't hold for longer than that). </p>"}]}