{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150715-salmon-a-la-nage-vicky-wasik-10.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["easy", "fish", "poach", "salmon", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Salmon à la Nage With Summer Vegetables", "link": "https://www.seriouseats.com/recipes/2015/07/salmon-a-la-nage-summer-vegetables-recipe.html", "description": "This light and delicately flavored dish of salmon poached in a broth with summer squash, fennel, white wine, and ginger, then finished with cherry tomatoes, is a perfect one-pot summer meal.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Mains", "Poaching", "Salmon"], "recipeIngredient": ["3 tablespoons extra-virgin olive oil, divided", "2 medium carrots, diced", "1 small head fennel, diced", "2 small summer squash and/or zucchini, diced", "1/2 medium yellow onion, diced", "1 (2-inch) knob peeled fresh ginger, cut into thick slices and gently bruised with blunt side of knife", "1 cup dry white wine", "3 cups water", "2 parsley sprigs", "2 tarragon sprigs", "4 (6-ounce) boneless, skinless salmon fillets", "Kosher salt and freshly ground black pepper", "1 cup cherry tomatoes, quartered", "1 scallion, white and light green parts only, thinly sliced on a bias", "Chopped parsley and tarragon, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, straight-sided sauté pan, heat 2 tablespoons olive oil over medium-high heat until shimmering. Add carrot, fennel, squash, onion, and ginger and cook, stirring, until vegetables are softened and onion is translucent, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and cook, stirring, until reduced by about half and raw alcohol smell has mostly cooked off, about 4 minutes. Add water, parsley sprigs, and tarragon sprigs. Season salmon fillets with salt and pepper, then nestle in cooking liquid; they should be partially submerged. Bring liquid to a simmer, then cover pan and lower heat. Cook, covered, until salmon is medium-rare and registers 120&deg;F on an instant-read thermometer, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small bowl, toss tomatoes with scallion and remaining 1 tablespoon olive oil. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a slotted spatula, transfer salmon fillets to bowls. Season cooking broth with salt and pepper and ladle around salmon along with the vegetables. Spoon tomatoes and scallions all around, garnish with chopped parsley and tarragon, and serve right away.</p>"}]}