{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150706-strawberry-ice-cream-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["ice cream", "strawberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5454545454545", "ratingCount": "11"}, "name": "The Best Strawberry Ice Cream", "link": "https://www.seriouseats.com/recipes/2015/07/best-strawberry-ice-cream-recipe.html", "description": "Even at the best ice cream shops, strawberry ice cream is usually the iciest flavor of the lot, and it often doesn't taste anything like fresh, sweet strawberries. This ice cream nails that fresh berry flavor without compromising on a rich, creamy texture.", "totalTime": "6 hours", "recipeYield": "Makes 1 quart", "recipeCategory": ["Father's Day", "Ice Cream and Frozen Treats", "Mother's Day", "Strawberry"], "recipeIngredient": ["30 ounces (1 quart plus a little extra) fresh strawberries, divided (see note)", "1 1/4 cups sugar, divided", "4 tablespoons 80-proof liquor such as vodka or, preferably, Cointreau", "2 cups half and half", "1/2 cup corn syrup", "1/2 teaspoon kosher salt, to taste", "Scant drops of lemon juice, if needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hull and quarter 6 ounces (about 1 cup) strawberries, then slice quarters crosswise into very thin pieces. In a mixing bowl, combine strawberries with 1/2 cup sugar and alcohol and let stand in refrigerator for at least 2 hours and up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hull remaining strawberries and purée at high speed in a blender until very smooth, about 30 seconds. Strain through a fine mesh strainer to filter out all seeds and fibers, then measure and reserve 1 1/2 cups purée. Extra purée, if there is any, can be put to another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean mixing bowl, whisk together 1 1/2 cups strawberry purée with half and half, corn syrup, and remaining 3/4 cup sugar until fully combined. Add salt to taste, and, if mixture is too sweet, a few drops of lemon juice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chill in refrigerator or ice bath until base is very cold, at least 45&deg;F, then churn in ice cream maker according to manufacturer's instructions. In the last minute of churning, retrieve strawberry mix-ins from the refrigerator, strain off syrup, and add mix-ins to the churn; reserve strawberry syrup for another use (it makes a great daiquiri). Transfer ice cream to airtight container and chill in freezer for at least 4 hours before serving.</p>"}]}