{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150115-green-chile-nachos-step-1-josh-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["chile verde chicken", "chili", "nacho"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Green Chile Chicken Nachos", "link": "https://www.seriouseats.com/recipes/2015/01/green-chile-chicken-nachos-recipe.html", "description": "A chile verde with chicken gives these nachos a hefty fruity, tangy, and spicy start, but it's the addition of a creamy pepper jack sauce, cooling avocado salsa, and fresh cilantro, onion, jalapeños, and radish that makes them incredible.", "totalTime": "3 hours", "recipeYield": "Serves 3 to 4 as a main course or 8 to 10 as an appetizer", "recipeCategory": ["Chicken", "Chili", "Snacks"], "recipeIngredient": ["<strong>For the Chips:</strong>", "2 to 3 cups canola oil", "20 fresh corn tortillas, cut into 6 wedges each", "<strong>For the Chile:</strong>", "3 poblano peppers", "1 cubanelle pepper", "1 jalapeño, halved, steemed, and seeded", "1 pound tomatillos, husked, washed, and halved", "1 tablespoon canola oil", "2 pounds bone-in, skin on chicken thighs (about 8 thighs)", "3/4 cup finely diced onion (about 1 small)", "3 medium cloves garlic, smashed", "1 teaspoon ground cumin", "1 1/2 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1/2 cup finely chopped fresh cilantro leaves and fine stems", "White sugar, kosher salt, and freshly ground black pepper to taste", "<strong>For the Cheese Sauce:</strong>", "8 ounces pepper Jack cheese, grated on large holes of a box grater", "1 tablespoon cornstarch", "1 (12-ounce) can evaporated milk", "1 tablespoon finely chopped pickled jalapeños", "<strong>For the Avocado Salsa:</strong>", "2 ripe Haas avocados, seeded and roughly diced", "2 medium cloves garlic", "1/2 cup Mexican crema or sour cream", "1/3 cup roughly chopped fresh cilantro leaves", "2 tablespoons lime juice", "Kosher salt", "<strong>To Serve:</strong>", "1/2 cup finely chopped white onion", "1/4 cup roughly chopped cilantro", "1 large radish, very thinly sliced", "1 jalapeño or serrano pepper, very thinly sliced", "1/4 cup cotija cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the chips:</strong> Heat oil in a 12-inch cast iron skillet, dutch oven, or wok over medium-high heat until it registers 375°F. Adjust flame to maintain temperature. Working in batches, add tortillas and fry, agitating with a metal spider, until edges just start to brown. Flip chips over and continue to cook until crisp and light golden brown. Transfer chips to a paper towel lined tray, sprinkle with salt to taste, and let sit for 2 to 3 minutes to drain. Repeat with remaining batches. Set aside until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the chile:</strong> Roast poblano and cubanelle peppers directly over the flame of a gas stove, grill, or under a hot broiler, turning occasionally, until skin is completely charred and blackened all over. Place in a bowl, cover with plastic wrap, and let sit until cool enough to handle, 10 to 15 minutes. Remove charred outer skin, then stem and seed peppers. Transfer to the workbowl of a food processor fitted with a steel blade.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler. Place tomatillos and jalapeño on a baking sheet, cut side-down. Broil until tomatillos have charred and softened, about 10 minutes. Transfer to food processor with peppers, along with any exuded liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a Dutch oven over high heat until shimmering. Season chicken all over with salt and pepper; place in Dutch oven, skin side down. Cook until skins have deeply browned and crisped, 6 to 8 minutes. Flip chicken and cook until second side has browned, about 4 minutes longer. Transfer chicken to a plate and pour out all but 1 tablespoon of fat from Dutch oven. Add onion and garlic and cook until onion has softened and lightly browned around the edges, about 5 minutes. Stir in cumin and cook until fragrant, about 30 seconds. Transfer to food processor with chiles and tomatillos and pulse until roughly pureed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return Dutch oven to high heat. Add chicken stock and scrape bottom of pan to release browned bits. Stir in chile mixture and bring to a boil. Reduce to a simmer. Nestle chicken in sauce, cover, and cook until thickest part of thigh registers between 175-185&deg;F on an instant read thermometer, about 30 minutes. Transfer chicken to plate and let sit until cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While chicken is cooling, increase heat to medium-high heat and let sauce boil until slightly thickened. Remove from heat and stir in cilantro and lime juice. Remove and discard chicken skins. Using hands, pull chicken from bone into thin shreds. Add chicken back to sauce and stir to combine. Season with sugar, salt, and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the cheese sauce:</strong> Place cheese in a medium bowl and toss with cornstarch until evenly coated. Transfer cheese to small sauce pan and add 1 cup evaporated milk. Place over low heat and cook, stirring constantly, until melted and thickened, about 5 minutes. Stir in pickled jalapeños and thin with additional evaporated milk to desired consistency. For a smoother, shinier cheese sauce, blend with a hand blender or in a standard blender for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To make the avocado salsa:</strong> Place avocados, garlic, crema, cilantro, and lime juice in the workbowl of a food processor fitted with a steel blade. Process until completely smooth. Season with salt to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To serve:</strong> Spread single layer of chips out on large baking sheet or serving platter. Spoon on cheese sauce, chile, and avocado salsa. Top with another layer of chips and spoon on additional sauce, chile, and salsa. Top with diced onion, cilantro, radish, pepper slices, and cotija cheese. Serve immediately.</p>"}]}