{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2014/12/Serious-Eats-Slow-Cooker-Tomato-Fennel-Braised-Pork-Shoulder-Jennifer-Olvera.jpg", "author": {"@type": "Person", "name": "Jennifer Olvera"}, "recipeCuisine": "Italian", "keywords": ["easy", "fennel", "Italian", "pasta", "pork", "slow cooker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Slow-Cooker Pork Shoulder With Tomatoes, Fennel, and Pasta", "link": "https://www.seriouseats.com/recipes/2015/01/slow-cooker-pork-shoulder-italian-pasta-tomato-mediterranean-fennel-recipe.html", "description": "Slow-cooked until meltingly tender, pork shoulder is braised in fragrant mix of sautéed fennel and onions, crushed tomatoes, Mediterranean herbs, and white wine. Once your slow cooker has 10 hours to work its magic, the pulled meat tops pasta, and the sauce is spooned on top. Add final shower of Parmesan, and you're golden.", "totalTime": "12 1/2 hours", "recipeYield": "Serves 10", "recipeCategory": ["Italian", "Mains", "Pork", "Slow Cooker"], "recipeIngredient": ["1 (6-pound) bone-in pork shoulder ", "Kosher salt and freshly ground black pepper", "1 1/2 tablespoons olive oil", "2 fennel bulbs, trimmed and thinly sliced", "1 large carrot, peeled and cut on the bias", "1 large onion, sliced", "6 cloves garlic, thinly sliced", "3/4 cup dry white wine", "1 tablespoon Worcestershire sauce", "1 (28-ounce) can crushed tomatoes", "2 tablespoons tomato paste", "4 sprigs fresh thyme", "2 bay leaves", "1/4 teaspoon crushed red pepper", "1/2 teaspoon dried oregano", "1/2 teaspoon dried rosemary, crushed", "1/2 teaspoon dried sage", "1 Parmesan rind", "1 1/2 pounds cooked pasta, such as penne or rigatoni", "1/2 cup shredded Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork all over with salt and pepper and place in the bowl of a large slow cooker.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a Dutch oven over medium-high heat. When oil is shimmering, add fennel and carrot and cook, stirring often, until vegetables start to brown, 6 to 10 minutes. Add onion and continue cooking until softened, about 4 minutes longer. Reduce heat to medium, add garlic and continue cooking, stirring frequently, until softened, about 3 minute longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and bring to a boil. Simmer for 1 minute, then add the Worcestershire sauce, tomatoes, tomato paste, thyme, bay leaves, 1 1/4 teaspoons of salt, 3/4 teaspoon black pepper, crushed red pepper, oregano, rosemary, sage, and Parmesan rind. Stir to combine and transfer to the slow cooker, pouring tomato mixture on top of the pork shoulder. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and cook on low setting for 10 to 12 hours, basting with tomato sauce occasionally. When pork is fall-apart tender, transfer meat to a bowl and discard thyme, bay leaves and Parmesan rind. Skim fat from the top of the sauce and adjust seasonings, if needed. (Meat can also be refrigerated in its braising liquid for up to three days. Skim before reheating)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When meat is cool enough to handle, shred using two forks, and discard the bone and any undesirable fat. Mound meat on top of pasta, spoon sauce on top and garnish with shredded Parmesan.</p>"}]}