{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/09/20150919-midautumnfeast-fiona-reilly-20150919-midautumnfeast-mushroomsandchestnuts-fiona-reilly.jpg", "author": {"@type": "Person", "name": "Fiona Reilly"}, "recipeCuisine": "Chinese", "keywords": ["chestnut", "Chinese", "mushroom", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Soy-Braised Fall Mushrooms With Chestnuts", "link": "https://www.seriouseats.com/recipes/2015/09/soy-sauce-fall-mushrooms-with-chestnuts.html", "description": "This dish celebrates the seasonal arrival of mushrooms and fresh-roasted chestnuts in the form of a simple soy-spiked braise. You can use any fresh fall mushrooms available to you, including enoki, shiitake, button mushrooms, Swiss browns, and chanterelles.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Mushrooms", "Nuts", "Sides", "Stir Frying", "Vegetarian"], "recipeIngredient": ["2 teaspoons corn starch", "3 1/2 ounces fresh chestnuts, peeled (about 1 cup)", "9 ounces assorted fresh mushrooms (such as button, beec, shiitake, or enoki), sliced (about 1 1/2 quarts)", "2 tablespoons vegetable oil", "1/2-inch knob ginger, peeled and finely sliced (about 2 teaspoons)", "1 clove garlic, peeled and finely sliced (about 1 teapoons)", "2 scallions, white parts only, finely sliced (about 3 tablespoons)", "2 teaspoons dark soy sauce", "2 teaspoons light soy sauce", "2 teaspoons sesame oil", "Kosher salt", "Steamed rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine corn starch with 2 tablespoons water and set aside. Meanwhile, bring a large pot of water to a boil over high heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook chestnuts in boiling water until tender, about 5 minutes. Remove with a strainer, drain, and set aside. Add mushrooms to boiling water, cook for 1 minute. Remove with a strainer, drain, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a wok over medium heat until shimmering. Add ginger, garlic, and scallions, and cook, stirring, over until fragrant, about 1 minute. Add chestnuts and continue stirring for 1 minute. Add mushrooms and stir for 1 additional minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to high. Add dark and light soy sauces, stirring to combine. Add cornflour and water mixture and reduce heat to medium. Cook, stirring, until sauce is thickened and coats the mushrooms and chestnuts, about 1 minute. Remove from heat. Stir in sesame oil, season to taste with salt if necessary, and serve immediately with steamed rice.</p>"}]}