{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150213-turnip-cake-law-bok-gow-shao-zhong-6.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "new year", "radish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chinese Turnip Cake With Sausage, Bacon and Mushrooms (Law Bok Gow)", "link": "https://www.seriouseats.com/recipes/2015/02/chinese-turnip-daikon-radish-cake-law-bock-gow-recipe.html", "description": "Studded with Chinese sausage, Chinese bacon, and shiitake mushrooms, this steamed (and then, optionally, pan-fried) daikon radish-based snack is a classic at both the Chinese New Year, and also on dim sum tables year-round.", "totalTime": "4 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Breakfast and Brunch", "Chinese", "Pork", "Sides", "Snacks"], "recipeIngredient": ["2 ounces dried shiitake mushrooms (about 10 mushrooms)", "5 ounces Chinese bacon (<em>lap yuk</em>), diced (see note)", "2 Chinese sausage, diced (see note)", "1/4 cup small dried shrimp, rinsed and patted dry (see note)", "1 tablespoon plus 2 teaspoons brown sugar, divided", "1 tablespoon soy sauce", "3 pounds daikon radish, peeled and finely grated on a box grater", "8 ounces rice flour", "Toasted sesame oil, for serving", "2 scallions, white and light green parts only, chopped", "1 bunch cilantro, leaves and tender stems only, chopped", "Toasted sesame seeds, for serving (optional)", "Hoisin sauce and Sriracha, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place dried shiitakes in a heatproof bowl and pour over enough hot water to cover. Soak for at least 2 hours and up to overnight. Drain mushrooms, rinse under cold running water, and squeeze out excess water. Trim and discard stems and dice caps. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a large pot, Dutch oven, or wok over medium-high heat and add diced shiitakes, bacon, sausage, and dried shrimp. Cook, stirring, until bacon and sausage have rendered some fat, about 5 to 7 minutes. Stir in 2 teaspoons brown sugar and the soy sauce and cook, stirring, for 2 minutes longer. Transfer everything to a bowl and set aside.<br />\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same Dutch oven or wok, add grated daikon. Stir to coat with any of the remaining fat. Lower heat to medium, cover and cook, stirring occasionally, until daikon is slightly translucent, about 20 minutes. Stir in remaining 1 tablespoon brown sugar until dissolved. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat. Stir in cooked shiitakes, bacon, sausage, and dried. Add rice flour in thirds, mixing thoroughly between additions (make sure no traces of flour are left at the bottom). If flour mixture becomes too difficult to stir, stir in up to 2 tablespoons of water to loosen slightly; the final texture should be sticky and tight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape mixture into two 7- by 5-inch baking dishes or disposable aluminum baking trays. Set up a steamer large enough to hold one of the baking dishes, then, working 1 baking dish at a time, steam turnip cake until cooked through, about 30 minutes. Repeat with remaining baking dish. Let cooked turnip cakes rest 20 minutes before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle turnip cakes with sesame oil and top with chopped scallions, cilantro, and sesame oil, if using. Slice and serve with hoisin sauce and/or Sriracha on the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The cooked turnip cake can be refrigerated for up to 2 days. To reheat, slice and pan-fry in a small amount of oil until golden and crisp on both sides.</p>"}]}