{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151108-pork-tenderloin-bourbon-soaked-figs-recipe-kenji-01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "fall", "pork", "quick", "tenderloin", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "9"}, "name": "Easy Pan-Roasted Pork Tenderloin With Bourbon-Soaked Figs", "link": "https://www.seriouseats.com/recipes/2015/11/pan-roasted-pork-tenderloin-bourbon-fig-glaze-recipe.html", "description": "This fall- and winter-friendly pork tenderloin roast with a bourbon and fig glaze looks and tastes like the type of dish that you'd make on a Sunday. But a simple stovetop technique means it's just as good for a Tuesday night when you've only got half an hour to spare in the kitchen.", "totalTime": "30 minutes", "recipeYield": "Serves 2 to 3 (see note)", "recipeCategory": ["Father's Day", "Mains", "Mother's Day", "Pork", "Quick Dinners", "Valentine's Day"], "recipeIngredient": ["1 cup dried figs, split in half lengthwise", "1/2 cup bourbon, rye whiskey, or brandy", "1 (.25-ounce) packet powdered gelatin (about 2 teaspoons)", "1 cup <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 whole pork tenderloin, trimmed of silverskin (about 1 pound)", "Kosher salt and freshly ground black pepper", "1/2 cup cornstarch", "1 tablespoon vegetable oil", "1 small shallot, minced", "1 tablespoon whole grain mustard", "1/2 cup maple syrup", "Pinch cayenne pepper", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place figs and bourbon in a small bowl and set aside. Sprinkle gelatin over chicken stock and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork on all sides with salt and pepper. Place cornstarch on a plate and dredge tenderloin until lightly coated on all sides. Heat oil in a 10-inch stainless steel skillet over high heat until shimmering. Add pork and cook, turning, until well browned on all sides, about 8 minutes total. (Reduce heat to medium if it threatens to burn.) Transfer to a large plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to medium-low heat. Add shallots and cook, stirring, until fragrant. Remove pan from heat and pour in bourbon and fig mixture. Allow it to stop bubbling, then very carefully return it to heat. Tilt the pan toward the flame or use a kitchen lighter to carefully ignite the bourbon. Cook, shaking the pan, until the flames die out. Add chicken stock mixture, mustard, maple syrup, and cayenne pepper and whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust flame to maintain a low simmer. Return pork to skillet and cook, turning occasionally, until the thickest part registers 130 to 135&deg;F on an instant-read thermometer for medium rare or 140 to 145&deg;F for medium well, 6 to 10 minutes after returning it to the skillet. Remove pork from skillet and set aside. Add butter to skillet and bring mixture to a boil over high heat. Cook until reduced to a thick, syrupy glaze, about 4 minutes. Return pork to skillet and turn to coat. Transfer to a cutting board, allow to rest 4 minutes, slice, and serve.</p>"}]}