{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150213-chicken-fried-steak-step-1-joshua-bousel.jpg", "author": {"@type": "Person", "name": "Joshua Bousel"}, "recipeCuisine": "", "keywords": ["beef", "deep fry", "gravy", "Southern", "steak", "texas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Tender and Beefy Chicken-Fried Steak", "link": "https://www.seriouseats.com/recipes/2015/02/chicken-fried-steak-recipe.html", "description": "Chicken-fried steak, at its worst, is an overcooked slab of tough beef coated in a greasy deep-fried coating made soggy by a gluey bland gravy. At its best, it's juicy and tender, rich with beef flavor, and coated in a crispy, crunchy shell that retains its bite even when doused with a flavorful, black pepper-spiked sauce. This recipe will get you the better of those two results.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Mains"], "recipeIngredient": ["<strong>For the Steaks:</strong>", "4 long, thin sirloin tip steaks (about 2 pounds)", "3/4 cup cornstarch", "1 egg", "1 cup buttermilk, divided", "2 cups all-purpose flour", "2 teaspoons kosher salt, plus more to taste ", "2 teaspoons paprika", "2 teaspoons freshly ground black pepper", "1 1/2 teaspoons onion powder", "1 1/2 teaspoons garlic powder", "1 teaspoon baking powder", "1/2 teaspoon cayenne pepper", "2 quarts peanut or canola oil", "<strong>For the Gravy:</strong>", "1/4 cup vegetable, canola, or peanut oil, for frying", "1/4 cup all-purpose flour", "2 1/2 cups whole milk", "1 tablespoon coarsely ground black pepper, plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Steaks:</strong> Pat steaks dry with paper towels. Place one steak in a resealable plastic bag. Using a meat pounder, rolling pin, or small skillet, pound steak out to an even 1/8- to 1/4-inch thickness. Repeat with remaining 3 steaks. Season steaks with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cornstarch in a shallow dish. Whisk together egg and 2/3 cup buttermilk in a separate shallow dish. Whisk together flour, 2 teaspoons salt, paprika, black pepper, onion powder, garlic powder, baking powder, and cayenne pepper in a third shallow dish. Drizzle remaining 1/3 cup of buttermilk into seasoned flour and rub with fingertips until mixture is coarse like wet sand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working 1 steak at a time, coat well in cornstarch. Lift steak, shake off excess cornstarch, then transfer to egg mixture. Coat steak well in egg mixture, lift steak, letting excess egg drain off, then transfer to seasoned buttermilk-flour mixture. Coat steak well, pressing seasoned flour all over to help it adhere to the meat. Lift steak, shake off excess flour, and transfer to a wire rack. Repeat with remaining steaks. Let steaks stand for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place oil in a large Dutch oven or wok and heat to 375&deg;F over high heat. Carefully lift 1 steak and gently slide into oil. Cook, flipping occasionally, until golden brown and crisp on both sides, 2 to 4 minutes total. Transfer steak to a paper towel-lined tray and season with salt to taste. Repeat with remaining 3 steaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the gravy:</strong> Transfer 1/4 cup of hot frying oil to a medium saucepan placed over medium high heat. Add flour and whisk constantly until mixture turns light brown, about 1 minute. Slowly whisk in milk. Stir in pepper and bring to a boil. Reduce to a simmer and cook, stirring occasionally, until slightly thickened, about 4 minutes. Remove from heat; season with salt and additional pepper to taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer steaks to plates, top with gravy, and serve immediately.</p>"}]}