{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150916-chicken-paprikash-kenji-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["central european", "chicken", "chicken paprikash", "comfort", "easy", "hungarian", "paprika", "spaetzle", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.125", "ratingCount": "8"}, "name": "Easy 4-Ingredient Chicken Paprikash", "link": "https://www.seriouseats.com/recipes/2015/11/easy-four-ingredient-chicken-paprikash-recipe.html", "description": "This version of chicken paprikash uses only four ingredients (okay, six if you count oil and salt), but it packs in the flavor by using high-quality paprika and a low-and-slow cooking technique to naturally draw flavorful juice out of the chicken as it cooks.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Mains", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["1 tablespoon vegetable oil", "1 large onion, diced or thinly sliced (about 1 1/2 cups)", "Kosher salt", "1/4 cup (1 ounce) high-quality Hungarian sweet paprika (see note)", "4 whole chicken legs, split into thighs and drumsticks (about 2 pounds)", "1/2 cup sour cream, plus more for garnish", "Egg noodles, boiled potatoes, or <a href=\"http://www.seriouseats.com/2011/05/how-to-make-spatzle-spaetzle-pasta.html\">spaetzle</a> for serving", "Minced fresh parsley leaves or dill (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large straight-sided sauté pan or Dutch oven over medium heat until shimmering. Add onions, season with salt, and cook, stirring, until completely softened and just starting to brown, about 8 minutes. Add paprika and cook, stirring, until nutty and fragrant, about 1 minute. Add chicken pieces, season with a little more salt, and turn them with tongs until well-coated in the onion/paprika mixture. Nestle the chicken in a single layer in the bottom of the pan, cover with a tight-fitting lid, reduce heat to the lowest setting, and cook until chicken is completely tender and pulls easily from the bone, 30 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken pieces and set aside on a large plate. Pour liquid into a 2-cup liquid measuring cup. Skim off excess fat and discard. There should be about 1 cup of liquid remaining in the cup. If not, add water or low-sodium chicken broth to the measuring cup for a total of 1 1/2 cups. Return liquid to the pan and whisk in the sour cream. Season to taste with salt and more paprika if desired. Return chicken to the pan and turn to coat in the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately over noodles, boiled potatoes, or <a href=\"http://www.seriouseats.com/2011/05/how-to-make-spatzle-spaetzle-pasta.html\">spaetzle</a>, tossing the noodles or potatoes with the sauce and placing the chicken on top. Garnish with more sour cream, paprika, and minced fresh parsley or dill (if using)</p>"}]}