{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150415-huevos-rancheros-easy-recipe-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["breakfast", "brunch", "easy", "egg", "huevos rancheros", "Mexican", "salsa", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8571428571429", "ratingCount": "7"}, "name": "Quick and Easy Huevos Rancheros With Tomato-Chili Salsa", "link": "https://www.seriouseats.com/recipes/2015/04/quick-and-easy-huevos-rancheros-recipe.html", "description": "Making <em>huevos rancheros</em>&mdash;\"rancher's-style\" eggs&mdash;is an inherently simple, impromptu affair at home. It's easy for me to think of it as a dish so darn casual that it doesn't even need a recipe. But then I wouldn't be doing my job, now would I? My goal was to come up with a recipe for huevos rancheros, with a smoky and wickedly spicy tomato and red-chili salsa, that requires nothing more than basic supermarket pantry staples. And I wanted it all in under half an hour, because who has time to wait for breakfast?", "totalTime": "25 minutes", "recipeYield": "Serves up to 6", "recipeCategory": ["Breakfast and Brunch", "Easter", "Eggs", "Father's Day", "Mexican", "Mother's Day", "Quick and Easy", "Stovetop", "The Food Lab", "Vegetarian"], "recipeIngredient": ["2 whole dried ancho chilies", "1/4 cup (60ml) canola oil, divided", "1 small yellow onion, thinly sliced", "4 medium cloves garlic, thinly sliced", "1/2 teaspoon dried oregano, preferably Mexican", "1 (14-ounce) can crushed tomatoes, preferably fire-roasted (such as Muir Glen)", "2 whole chipotle chilies packed in adobo, plus 2 tablespoons (30ml) sauce from can", "1/4 cup minced fresh cilantro leaves and fine stems (1/4 ounce; 7g), plus more for serving", "1 tablespoon (15ml) soy sauce", "1 tablespoon (15ml) juice from 1 lime, plus lime wedges for serving", "Kosher salt and freshly ground black pepper", "Up to 12 fresh corn tortillas (2 per serving)", "Up to 12 eggs (2 per serving)", "Crumbled Cotija cheese, for serving", "Hot store-bought or <a href=\"http://www.seriouseats.com/recipes/2014/04/perfect-refried-beans.html\">homemade</a> refried beans, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim tops of chilies and discard seeds (see <a href=\"http://www.seriouseats.com/2015/01/how-to-clean-and-prepare-dried-chilies-chili-powder-substitute.html\">here for more detailed instructions</a>). Place on a microwave-safe plate and microwave on high power until pliable and fragrant, about 15 seconds. Cut chilies into thin strips using kitchen shears or a sharp knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon oil in a medium saucepan over medium-high heat until shimmering. Add onions and garlic and cook, stirring, until softened and just starting to brown, about 5 minutes. Add oregano and chili strips and cook until fragrant, about 15 seconds. Add tomatoes and chipotle chilies with their sauce and bring to a simmer. Reduce heat to maintain a gentle simmer for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puré mixture with a hand blender or in a standing blender until a loose puree is formed. Stir in cilantro, soy sauce, and lime juice and season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 3 tablespoons oil in a medium cast iron or non-stick skillet over medium heat until shimmering. Working one at a time, fry corn tortillas until lightly browned but still pliable, about 15 seconds per side. Transfer to a paper towel to drain and stack them as you work. Cover with foil or a clean kitchen towel to keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When tortillas are cooked, reheat skillet over medium-high heat until oil is shimmering (add more oil if necessary). Fry eggs, using a spoon to baste the tops with hot oil as they cook in order to help set the upper whites while keeping the yolk completely liquid. Fry until crisp on the bottom, whites are set, and yolks are golden, about 1 1/2 minutes. Season with salt and pepper and slide onto a clean plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, place two tortillas on a serving plate. Top with two fried eggs. Spoon salsa all over the top, leaving the yolks exposed. Sprinkle with cotija cheese and more chopped cilantro. Serve immediately with refried beans.</p>"}]}