{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150408-chewy-new-england-ice-cream-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Max Falkowitz"}, "recipeCuisine": "", "keywords": ["dessert", "ice cream", "New England"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Dense, Chewy, and Rich New England-Style Ice Cream", "link": "https://www.seriouseats.com/recipes/2015/04/dense-rich-chewy-new-england-ice-cream-recipe.html", "description": "New England scoop shops are some of the country's best, in part because they tend to specialize in dense, rich ice creams with little added air and a distinct pleasant chewiness. Now you can MacGyver a batch of your own.", "totalTime": "6 hours to overnight", "recipeYield": "Makes 1 quart", "recipeCategory": ["Father's Day", "Ice Cream and Frozen Treats", "Mother's Day"], "recipeIngredient": ["8 large egg yolks", "3/4 cup sugar", "1/4 cup corn syrup", "1 1/2 cup heavy cream", "1 1/2 cup evaporated milk (a little more than 1 can), divided", "2 teaspoons arrowroot starch", "1 teaspoon vanilla extract", "1/2 to 1 teaspoon kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy-bottomed saucepan, whisk together egg yolks, sugar, and corn syrup until well combined. Add cream and 1 1/4 cups evaporated milk and whisk to combine. In a small bowl, stir remaining 1/4 cup evaporated milk with arrowroot starch until is dissolved and forms a slurry with no lumps. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place saucepan over medium-low heat and cook, whisking frequently, until the custard's temperature reaches 170&deg;F (custard is ready when it coats a spoon and a finger swiped across the back leaves a clean line).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and stir in arrowroot starch slurry, vanilla extract, and salt. Pour custard through a fine-mesh strainer into an airtight container and chill in an ice bath or refrigerator until temperature drops to 40&deg;F, about 4 hours for ice bath, up to overnight for refrigerator. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Churn ice cream until it just takes on a firm soft serve consistency without any runnyness; a spoon pressed across the top should leave a clean impression that doesn't collapse. Then, working very quickly, transfer ice cream to a wide, flat airtight container and chill in the bottom-back of a well-stocked freezer for at least 6 hours, preferably overnight. Avoid opening freezer door during hardening if possible. When ice cream is fully hardened, serve with plenty of mix-ins.</p>"}]}