{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150222-Tarte-Flambee-daniel-gritzer-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["cheese", "French", "onion", "pizza"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Tarte Flambée (Alsatian Pizza With Fresh Cheese, Onions, and Bacon)", "link": "https://www.seriouseats.com/recipes/2015/02/classic-tarte-flambee-alsatian-pizza-recipe.html", "description": "It looks like a pizza, it cooks like a pizza, but don't make the mistake of actually thinking it's a pizza. Tarte flambée, the Alsatian flatbread topped with fromage blanc (a fresh, tart, spreadable cheese), thinly sliced raw onions and bacon, is as Franco-Germanic in flavor as can be. This method delivers a classic tart, made on pizza dough rolled very thinly and cooked on a blazing hot Baking Steel or pizza stone right under the broiler.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes 4 (10- by 5-inch) flatbreads", "recipeCategory": ["Bacon", "Cheese", "French", "Mains", "Onion", "Pizza"], "recipeIngredient": ["1 cup fromage blanc (see note)", "1/2 cup crème fraîche (see note)", "Kosher salt and freshly ground black pepper", "Pinch freshly grated nutmeg", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/07/basic-new-york-style-pizza-dough.html\">Basic New York Pizza Dough</a> or 2 pounds store-bought pizza dough, divided into 4 even portions, proofed, and ready to stretch and top", "Flour, for dusting", "1 medium white or yellow onion, very thinly sliced", "1/4 pound sliced bacon, cut crosswise into thin strips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set <a href=\"http://www.bakingsteel.com/\" target=\"_blank\">Baking Steel</a> on oven rack 6 to 8 inches from broiler and preheat oven to 550&deg;F (or highest possible setting) for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large bowl, whisk fromage blanc with crème fraîche until thoroughly incorporated. Season with salt and pepper, Whisk in nutmeg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with 1 piece at a time, set dough on a lightly floured work surface. Using your hands and/or a rolling pin, work dough to a thin, roughly 10- by 5- inch oval. Transfer dough to a pizza peel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Switch broiler on to high. Spread one quarter of fromage blanc mixture over dough leaving a 1 centimeter border around the edge. Scatter a small handful of onion all over, followed by a small handful of bacon. Slide pizza onto baking stone and bake until toppings are browned spots and crust is golden brown and puffed, 3 to 5 minutes. Serve immediately, and repeat with remaining dough and toppings.</p>"}]}