{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150609-grilled-chicken-zaatar-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "grill", "Lebanese", "poultry", "sumac", "summer", "za'atar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Chicken With Za'atar", "link": "https://www.seriouseats.com/recipes/2015/06/grilled-whole-chicken-with-za-atar.html", "description": "Extra-juicy butterflied grilled chicken gets a flavor-packed kick with a fresh homemade za'atar-style spice blend made with fresh and dried herbs, sesame seeds, and sumac.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Grilled Chicken", "Grilling", "The Food Lab"], "recipeIngredient": ["1 tablespoon dried oregano", "1 tablespoon minced fresh thyme leaves", "1 tablespoon minced fresh savory", "2 tablespoons sesame seeds", "2 teaspoons ground sumac (see note)", "Kosher salt", "2 tablespoons extra-virgin olive oil, plus more for serving", "3 medium cloves garlic, minced (about 1 tablespoon)", "1 whole chicken, 3 1/2 to 4 pounds", "Lemon wedges, for serving", "<a href=\"http://www.seriouseats.com/recipes/2015/06/sumac-and-mint-aioli.html\">Sumac and mint aioli</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Za'atar:</strong> combine oregano, thyme, savory, sesame seeds, sumac, and 1 tablespoon kosher salt in a small bowl and stir with fingers until homogenous. Set aside half of mixture. Combine remaining half with 2 tablespoons olive oil and minced garlic until it forms a paste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken dry with paper towels and place breast-side-down on a large cutting board. Using sharp kitchen shears, remove the backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten the chicken. For added stability, run a metal or wooden skewer horizontally, entering through one thigh, going through both breast halves, and exiting through the other thigh. Tuck wing tips behind back. Season generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hands, rub herb and garlic paste evenly all over the surface of chicken, working it into every nook and cranny. Sprinkle reserved dry za'atar mixture evenly over all surfaces and gently pat down to adhere.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken skin-side up on cooler side of grill with legs facing towards hotter side. Cover grill with vents on lid open and aligned over the chicken. Open bottom vents of grill if using a charcoal grill. Cook until instant read thermometer inserted into deepest part of breast registers 120&deg;F, about 30-45 minutes. Carefully flip chicken and place skin-side-down on hotter side of grill with breasts pointed towards cooler side. If using a gas grill, reduce heat to medium-low. Press down firmly with a wide, stiff spatula to ensure good contact between bird and grill grates. Cover and cook until skin is crisp and instant read thermometer inserted into deepest part of breast registers 145 to 150&deg;F, about 10 minutes longer. If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to a cutting board and allow to rest for 5 to 10 minutes. Carve, drizzle with olive oil, and serve with lemon wedges and sumac-mint aioli.</p>"}]}