{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150217-shirataki-noodle-sichuan-sesame-vegan-recipe-5.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "easy", "noodle", "quick", "sesame", "sesame noodle", "shirataki", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Sichuan Shirataki Sesame Noodle Salad With Cucumber, Sichuan Peppercorn, Chili Oil, and Peanuts (Vegan)", "link": "https://www.seriouseats.com/recipes/2015/02/shirataki-noodle-salad-cucumber-sesame-sichuan-chili-vinegar-vegan-recipe.html", "description": "Slick shirataki noodles are perfect for cold noodle salads where their slippery texture helps keep each strand separate while simultaneously picking up plenty of flavor from a sauce of Sichuan peppercorn and chili-infused oil, black vinegar, garlic, soy sauce, and peanuts.", "totalTime": "15 minutes", "recipeYield": "Serves 2 as an appetizer or 1 as a light meal", "recipeCategory": ["Chinese", "Dairy-Free", "Mains", "Noodles", "Quick Dinners", "Salads", "Vegan", "Vegetarian"], "recipeIngredient": ["1 (8-ounce) package shirataki noodles, drained", "3 dried Thai chilies or 1 teaspoon chili flakes (more or less to taste) ", "1 tablespoon Sichuan peppercorns", "1/4 cup vegetable or canola oil", "1 medium clove garlic, minced (about 1 teaspoon)", "1 teaspoon minced fresh ginger", "3 tablespoons Chinese sesame paste or tahini", "1 tablespoon Chinese Chinkiang or black vinegar (see note)", "2 teaspoons soy sauce", "1 tablespoon sugar", "1 small cucumber, peeled, seeded, and cut into thin strips", "1/4 cup thinly sliced scallions (white and pale green parts only)", "1/2 cup chopped fresh cilantro leaves and thin stems", "1 tablespoon roasted sesame seeds", "1/4 cup roasted peanuts crushed lightly under a pan or in a mortar and pestle"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer shirataki noodles to a colander or strainer. Rinse under cold running water for 30 seconds, then set over a bowl to drain while you make the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Crush the dried chilies in a mortar and pestle or spice grinder until it has the texture of store-bought crushed red pepper flakes. Place in a heatproof container along with Sichuan peppercorns. Heat the oil in a small saucepan over medium-high heat until shimmering. Pour the hot oil over the chilies and Sichuan peppercorns (it should sizzle vigorously). Let stand 5 minutes while you prepare the rest of the sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine garlic, ginger, sesame paste, vinegar, soy sauce, and sugar in a large bowl and stir with a spoon to combine. Carefully pour the chili-infused oil into the bowl through a fine mesh strainer (add only half of the chili sauce if you prefer a less spicy dish). Discard dried chilies and Sichuan peppercorns. Stir sauce to emulsify, adding a few drops of water if it is very thick (sesame paste can vary in thickness). Add cucumbers, scallions, cilantro, sesame seeds, and drained noodles. Toss to coat, adjusting seasoning with more tahini, sugar, soy sauce, or vinegar to taste. Transfer to a serving platter, top with peanuts, and serve.</p>"}]}