{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2015/08/SuperFlakyBiscuts.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["baking", "biscuit", "bread", "buttermilk", "Southern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.25", "ratingCount": "4"}, "name": "The Food Lab's Buttermilk Biscuits", "link": "https://www.seriouseats.com/recipes/2015/08/the-food-lab-buttermilk-biscuits-recipe.html", "description": "I've been getting requests for my take on buttermilk biscuits for <em>years</em>, so I decided to spend a few weeks perfecting my recipe for the book. My version comes out tender and crisp, with tons of extra-flaky layers, and ready to incorporate any flavorings you like.", "totalTime": "50 minutes", "recipeYield": "Makes 8 large biscuits", "recipeCategory": ["Biscuit", "Christmas", "Thanksgiving", "The Food Lab"], "recipeIngredient": ["1/2 cup buttermilk", "1/2 cup sour cream", "10 ounces (2 cups) all-purpose flour, plus additional for dusting", "1 tablespoon baking powder", "1/4 teaspoon baking soda", "1 1/2 teaspoons kosher salt", "8 tablespoons (1 stick) cold unsalted butter, cut into 1/4-inch pats, plus 2 tablespoons melted unsalted butter for brushing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust an oven rack to the middle position and preheat the oven to 425&deg;F. Whisk together the buttermilk and sour cream in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine the flour, baking powder, baking soda, and salt and process until blended, about 2 seconds. Scatter the cold butter evenly over the flour and pulse until the mixture resembles coarse meal and the largest butter pieces are about 1/4 inch at their widest. Transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the buttermilk mixture to the flour mixture and fold with a rubber spatula until just combined. Transfer the dough to a floured work surface and knead until it just comes together, adding extra flour as necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a rolling pin, roll the dough into a 12-inch square. Using a bench scraper, fold the right third of the dough over the center, then fold the left third over so you end up with a 12-by-4-inch rectangle. Fold the top third down over the center, then fold the bottom third up so the whole thing is reduced to a 4-inch square. Press the square down and roll it out again into a 12-inch square. Repeat the folding process once more. (See note for Cheddar Cheese and Scallion variation.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough again into a 12-inch square. Cut six 4-inch rounds out of the dough with a floured biscuit cutter. Transfer the rounds to a parchment-lined baking sheet, spacing them about 1 inch apart. Form the dough scraps into a ball and knead gently 2 or 3 times, until smooth. Roll the dough out until it’s large enough to cut out 2 more 4-inch rounds, and transfer to the baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush the tops of the biscuits with the melted butter and bake until golden brown and well risen, about 15 minutes, rotating the pan halfway through. Allow to cool for 5 minutes and serve.</p>"}]}