{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/06/20150609-greek-grilled-chicken-lemon-oregano-olive-oil-09.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chicken", "greek", "grill", "lemon", "poultry", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.25", "ratingCount": "4"}, "name": "Greek-Style Grilled Chicken With Oregano, Garlic, Lemon, and Olive Oil", "link": "https://www.seriouseats.com/recipes/2015/06/best-grilled-chicken-greek-style-lemon-garlic-olive-oil.html", "description": "A whole chicken gets the Greek treatment with a simple marinade of olive oil and lemon along with plenty of garlic and oregano. The key to the juiciest meat and crispest skin? Butterflying the chicken and cooking it low and slow before finishing with a sear to crisp up the skin.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Gluten-Free", "Grilled Chicken", "Grilling", "Grilling, Smoking, and Barbecue", "July 4th", "Labor Day", "Lemon", "Mains", "Memorial Day", "Summer", "The Food Lab"], "recipeIngredient": ["3 whole lemons", "5 medium cloves garlic, minced (about 4 teaspoons; 20g)", "3 tablespoons minced fresh oregano", "1/4 cup (60ml) extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "1 whole chicken, 3 1/2 to 4 pounds (1.6 to 1.8kg)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grate 2 teaspoons zest from 1 lemon into a large bowl using a lemon zester or Microplane grater. Split that lemon and 1 more lemon in half and squeeze 3 tablespoons juice into bowl. Add garlic and oregano. Whisking constantly, slowly drizzle in olive oil to form an emulsified vinaigrette. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat chicken dry with paper towels and place chicken, breast side down, on a large cutting board. Using sharp kitchen shears, remove backbone by cutting along either side of it. Turn chicken over and lay out flat. Press firmly on breast to flatten chicken. For added stability, run a metal or wooden skewer horizontally through chicken, entering through one thigh, going through both breast halves, and exiting through the other thigh. Tuck wing tips behind back. Season generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your hands, rub half of vinaigrette evenly all over surface of chicken, working it into every nook and cranny.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1 chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken, skin side up, on cooler side of grill with legs facing toward hotter side. Cover grill with vents on lid open and aligned over chicken. Open bottom vents of grill if using a charcoal grill. Cook until an instant-read thermometer inserted into thickest part of breast registers 120&deg;F (49&deg;C), about 30 to 45 minutes. Carefully flip chicken and place on hotter side of grill, skin side down, with breasts pointed toward cooler side. If using a gas grill, reduce heat to medium-low. Press down firmly with a wide, stiff spatula to ensure good contact between bird and grill grates. Cover and cook until skin is crisp and an instant-read thermometer inserted into thickest part of breast registers 145 to 150&deg;F (63 to 66&deg;C), about 10 minutes longer. If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer chicken to a cutting board and allow to rest for 5 to 10 minutes. Meanwhile, split remaining lemon in half and place on hotter side of grill, cut side down. Grill until well browned, about 5 minutes. Carve chicken, drizzle with remaining vinaigrette, and serve immediately with grilled lemon halves.</p>"}]}