{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/01/20150123-bratwurst-beer-cheese-bacon-potato-skins-potatoes-finished-skins-2-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["beer", "beer cheese", "bratwurst", "potato", "potato skin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bacon, Bratwurst, and Beer Cheese Potato Skins", "link": "https://www.seriouseats.com/recipes/2015/01/bacon-bratwurst-beer-cheese-potato-skins-recipe.html", "description": "One of my go-to Game Day foods has always been potato skins. This time around, we can settle for nothing less that the ultimate champion of skins&mdash;the MVP of football feasts. If we're truly bringing our appetizer A-game, we need to mix it up a bit by drafting some beer right into our recipes. Brew-loving brothers and sisters, if you're with me, allow me to introduce an ale-filled appetizer just in time for the Super Bowl: Bacon, Bratwurst, and Beer Cheese Potato Skins.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Bacon", "Potato", "Snacks"], "recipeIngredient": ["6 slices bacon", "6 medium russet potatoes, washed and scrubbed", "2 teaspoons canola or vegetable oil", "1 white onion, thinly sliced", "Kosher salt and freshly ground black pepper", "1 (12-ounce) bottle beer, divided (see note)", "1/2 pound bratwurst", "8 ounces grated cheddar cheese (about 2 cups)", "2 teaspoons cornstarch", "1 teaspoon dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 400°F. Line a baking sheet with foil and lay the bacon on top, making sure not to overlap. Bake until crisp, 14 to 18 minutes, rotating the pan halfway through. Set the cooked bacon aside on a paper towel lined plate and pour the rendered grease from the pan into a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the potatoes on the same baking sheet and brush with about 2 tablespoons worth of  bacon grease. Bake the potatoes until tender, about 40 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, cook the onions</strong>: Heat 2 teaspoons canola oil oil in a large skillet over medium-high heat until shimmering. Add onions and cook, stirring, until softened but not browned, 4 to 5 minutes. Reduce heat to medium low and cook until completely tender and browned, about 20 minutes. Add 2 tableppoons beer and cook, stirring, until mostly evaporated. Season to taste with salt and pepper and transfer onions to a small bowl. Cover with foil and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Cook the bratwurst:</strong> Add bratwurst and another 1/4 cup beer to pan. Cover and cook over medium low heat, turning bratwurst occasionally, until nearly cooked through, about 5 minutes. Remove bratwurst from skillet, slice into thin disks, return to skillet, and continue cooking, covered, until cooked through. Keep warm until the potatoes are ready to be filled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the beer cheese:</strong> In a medium saucepan over medium heat, warm 1 cup of beer until gently steaming and simmering. In a medium bowl, toss the grated cheddar cheese with the cornstarch and then add to the beer, one small handful at a time, stirring constantly. You want the cheese to melt and stir in entirely before adding the next handful. Continue until all of the cheese has been stirred in. Reduce heat to medium-low and mix in the dijon mustard. Keep warm until thickened and the potatoes are ready to be filled, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are tender, remove them from the oven and allow to sit for a few minutes until they are cool enough to handle.  Cut the potatoes in half, lengthwise. Scoop out the insides of the potatoes, leaving about 1/4-inch of the potato in the skins (reserve scooped out flesh for another use). Brush the outside and insides of the potatoes again with bacon grease. Place the potato skins skin-side-up on the baking sheet and sprinkle with salt. Return to the oven and bake for 5 minutes, then flip and bake until the edges begin to brown, 3 to 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the potatoes from the oven and fill with beer cheese. Top with the caramelized onions and bratwurst slices. Crumble the reserved bacon and sprinkle on top. Serve immediately.</p>"}]}