{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/04/20150408-pork-chop-pan-leek-suace-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["easy", "leek", "pan sauce", "pork", "pork chop", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Pork Chops With White Wine and Leek Pan Sauce", "link": "https://www.seriouseats.com/recipes/2015/04/pork-chops-leek-pan-sauce-recipe.html", "description": "Creating a pan sauce that has body and richness doesn't just happen by mistake: You have to use certain techniques to get there. In this easy dinner, pork chops are served with a light, bright pan sauce made from leeks, white wine, chicken stock, and lemon zest. The leeks, though, add more than just flavor: they also fortify the sauce with bulk and texture, adding body and substance where there might not otherwise be any.", "totalTime": "1 hour 15 minutes (plus overnight if dry brining)", "recipeYield": "Serves 2", "recipeCategory": ["Father's Day", "Mains", "Mother's Day", "Pork", "Valentine's Day"], "recipeIngredient": ["2 bone-in pork chops (about 1 pound total)", "2 tablespoons kosher salt, plus more as needed", "1 tablespoon sugar", "Freshly ground black pepper", "2 tablespoons vegetable or canola oil", "1/2 cup dry white wine", "1/2 cup <a href=\"http://www.seriouseats.com/2014/10/how-to-make-rich-flavorful-easy-chicken-stock.html\">homemade</a> or store-bought low-sodium chicken stock", "1 teaspoon powdered gelatin (optional; see note)", "3 tablespoons unsalted butter, divided", "1 1/2 cups chopped leeks, white and light green parts only (from about 1 large leek)", "2 teaspoons minced garlic (from about 2 medium cloves)", "1 teaspoon finely grated zest from 1 lemon", "2 tablespoons finely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat pork chops dry with a paper towel. Combine salt and sugar in a small bowl. Season pork chops generously on all sides with salt/sugar mixture (you may have some seasoning mixture left over; reserve for another use or discard). Transfer to a wire rack set in a rimmed baking sheet. If dry-brining chops overnight, refrigerate, uncovered, at least 8 hours and up to 24; otherwise proceed immediately to Step 2.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook chops, preheat oven to 250&deg;F. Season chops with pepper. Place baking sheet with pork chops in oven and cook until an instant-read thermometer inserted into the center of the chops registers 100 to 110&deg;F for medium-rare, about 30 minutes, or 110 to 120&deg;F for medium, about 35 minutes. To prevent overcooking, start checking temperature 5 to 10 minutes before suggested time. Remove from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While pork cooks, combine wine and stock in a bowl or measuring cup and sprinkle gelatin all over, if using. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large stainless steel or cast iron skillet over high heat until lightly smoking. Place pork chops in skillet and cook, turning occasionally, until browned and an instant-read thermometer registers 120 to 130&deg;F for medium-rare or 130 to 140&deg;F for medium, about 3 minutes. Stack pork chops with tongs, hold them on their sides, and sear the fat caps on the edges until crisp, about 1 minute. Remove pan from heat, transfer chops to a clean rack set in a rimmed baking sheet, tent with foil, and let rest while making pan sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour off excess fat from skillet and return to medium-high heat. Add 1 tablespoon butter and melt. Add leeks and garlic and cook, stirring, until softened, about 5 minutes. Add wine and stock, bring to a boil, and cook, stirring occasionally, scraping up any browned bits from the bottom of the pan with a wooden spoon. Continue cooking until sauce is reduced by about two-thirds, 5 to 8 minutes. Stir in remaining 2 tablespoons butter and cook at a hard boil until emulsified, about 30 seconds. Stir in lemon zest and half of parsley, and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pork chops to plates, spooning sauce all over (if pan sauce took too long to make and pork chops have cooled significantly, return to oven for a few minutes to reheat, being careful not to let them get above the maximum temperature reached in step 4). Garnish with parsley and serve.</p>"}]}