{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/02/20150206-chickpea-vegan-pasta-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["bean", "chickpea", "Italian", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7142857142857", "ratingCount": "7"}, "name": "Pasta With Chickpea Sauce", "link": "https://www.seriouseats.com/recipes/2015/02/pasta-chickpea-sauce-recipe.html", "description": "Turning a bean purée into a pasta sauce may sound strange, but just think of it as a variation on the classic Italian soup <em>pasta e fagioli</em>, just with a lot more pasta and only enough \"soup\" to coat the noodles. It's delicious, and it just happens to be vegan (though we won't snitch if you decide to add grated parm to it).", "totalTime": "about 3 hours", "recipeYield": "Serves 4", "recipeCategory": ["Dairy-Free", "Italian", "Legumes", "Mains", "Pasta", "Vegan", "Vegetarian"], "recipeIngredient": ["12 ounce dried chickpeas, soaked overnight in salted water (see note)", "1 large onion, split in half", "1 head garlic, 3 clove thinly sliced, the rest left unpeeled", "3 sprigs rosemary", "Kosher salt and freshly ground black pepper", "3 tablespoons extra-virgin olive oil, plus more for drizzling", "1/2 teaspoon red pepper flakes", "4 cups cooked chickpeas (see note), divided", "1 1/2 cups chickpea-cooking liquid or <a href=\"http://www.seriouseats.com/recipes/2013/02/hearty-vegetable-stock-vegan-recipe.html\">vegetable broth</a>, plus more as needed", "1 pound short ruffled pasta, such as farfalle", "1/4 cup chopped parsley, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chickpeas in a large pot and cover with lightly salted water by at least 2 inches. Add unpeeled garlic, onion, and rosemary. Cover and bring to a boil over high heat. Reduce heat to a bare simmer and cook, topping up with water as necessary to keep beans submerged, until beans are very tender and creamy with no graininess left, about 2 hours. Beans can also be cooked in a pressure cooker at low pressure for 30 minutes. (See note if using canned beans.) Discard onions, garlic, and rosemary. Drain beans, reserving beans and liquid separately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine oil, garlic, and red pepper flakes and set over medium heat. Cook, stirring, until garlic is lightly golden, about 3 minutes. Add 3 cups chickpeas and chickpea-cooking liquid (or liquid from the cans) and bring to a simmer. Remove from heat and, using an immersion blender, blend to a smooth, saucy puree, adding more chickpea-cooking liquid if too thick. Stir in remaining 1 cup chickpeas, crushing some lightly with a wooden spoon or potato masher but leaving them mostly whole. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pot of salted boiling water, cook pasta until just short of al dente. Reserve 1 cup of pasta-cooking water, then drain pasta. Return pasta to pot and add chickpea sauce along with 1/4 cup of reserved pasta-cooking water. Set over medium heat and bring to a simmer, stirring until pasta is al dente and sauce has thickened just enough to coat pasta, about 3 minutes; add more reserved pasta-cooking water, 1 tablespoon at a time, if sauce becomes too thick. Remove from heat, stir in chopped parsley and drizzle in some fresh olive oil, stirring to blend. Season with salt and pepper. Spoon pasta and sauce into bowls, garnish with chopped parsley, and serve.</p>"}]}