{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151019-skillet-baked-ziti-recipe-01-kenji.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["comfort", "easy", "Italian", "italian american", "pasta", "quick", "skillet", "ziti"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8", "ratingCount": "10"}, "name": "Easy Skillet Baked Ziti With Sausage and Ricotta", "link": "https://www.seriouseats.com/recipes/2015/10/easy-skillet-baked-ziti-food-lab-recipe.html", "description": "Nothing says comfort like a baked pasta dish loaded with creamy sauce and cheese. If my full-fledged No-Boil Baked Ziti is the completist, <em>Super Mario 3</em> version of the dish, this week's skillet ziti is like using the magic whistle to jump straight to World 8. Not quite as satisfying, but a great alternative if time is of the essence.", "totalTime": "30 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Italian", "Mains", "Pasta", "Stovetop", "The Food Lab"], "recipeIngredient": ["1 pound dry ziti, penne, or other tubular pasta", "Kosher salt", "1 (28-ounce) can plus 1 (14-ounce) can whole peeled tomatoes", "1 cup heavy cream", "1 cup <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock, or water", "2 tablespoons extra-virgin olive oil", "2 tablespoons unsalted butter", "1 pound sweet or hot Italian sausage, removed from casing", "1 large onion, finely diced (about 1 1/2 cups)", "4 cloves garlic, minced (about 4 teaspoons)", "1 tablespoon dried oregano", "1 teaspoon crushed red pepper flakes", "1/4 cup finely minced fresh parsley leaves, divided", "12 ounces high-quality ricotta cheese (see note)", "1 pound low-moisture whole-milk mozzarella cheese, cut into 1/2-inch cubes", "3 ounces roughly grated Parmigiano-Reggiano, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pasta in a large bowl and cover with hot water. Season generously with salt. Let rest, stirring twice during the first 10 minutes, while you prepare the other ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a hand blender or countertop blender to process tomatoes until mostly smooth, but still a little chunky. Set aside 3/4 cup of tomatoes. Combine remaining tomatoes, heavy cream, and chicken stock in a medium bowl. Season to taste with salt and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil and butter in a large straight-sided sauté pan or Dutch oven over medium-high heat, swirling, until butter is mostly melted. Add sausage and cook, mashing with a potato masher or a whisk, until sausage is no longer pink, about 5 minutes. Add onion and garlic, reduce heat to medium, and cook, stirring frequently, until softened but not browned, about 5 minutes. Add oregano, red pepper flakes, and half of parsley and cook, stirring, until fragrant, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomato and cream mixture to pan with sausage. Drain noodles in a large colander set in the sink, then add to pan and stir to combine. Stir in half of ricotta, then rapidly stir in half of mozzarella cheese. (Do not over-stir, or the mixture will stretch and stick to your spoon.) Spoon reserved 3/4 cup tomatoes over top of pasta. Dollop with remaining ricotta and scatter remaining mozzarella over top. Sprinkle with half of Parmigiano-Reggiano. Cover and cook over the lowest possible heat for 3 minutes. Remove from heat and let rest, covered, for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Uncover, sprinkle with remaining Parmigiano-Reggiano and parsley, and serve immediately.</p>"}]}