{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150206-lions-head-shao-zhong-3.jpg", "author": {"@type": "Person", "name": "Shao Z."}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "meatball", "noodle", "pork", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Chinese Lion's Head Pork Meatballs With Vermicelli and Cabbage", "link": "https://www.seriouseats.com/recipes/2015/02/lions-head-pork-meatballs-shanghai-chinese-soup-recipe.html", "description": "Shanghai-style Lion's Head meatballs have a name that sounds intimidating, but they couldn't be easier to make. In this recipe, ground pork is mixed with mashed tofu (for tenderness), minced water chestnuts (for crunch), seared until golden, and then simmered in broth with vermicelli noodles, cabbage, and bok choi.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Mains", "Pork", "Soups and Stews"], "recipeIngredient": ["1 (4-ounce) block firm tofu, cut into 1/4-inch slices", "8 ounces ground pork, such as pork shoulder", "4 ounces ground or minced fatty pork, such as fresh pork belly", "1/4 cup drained canned water chestnuts, diced", "1 teaspoon minced peeled ginger", "2 scallions, white parts finely minced and green parts thinly sliced, divided", "1 egg yolk", "1/2 teaspoon sugar", "2 teaspoons Shaoxing wine", "1/2 teaspoon kosher salt", "3 teaspoons minced garlic (3 medium cloves), divided", "3/4 teaspoon ground white pepper, divided", "3 teaspoons soy sauce, divided", "2 1/2 teaspoons cornstarch, divided", "3 tablespoons plus 1 teaspoon canola, vegetable, or peanut oil, divided", "1 1/2 cups <a href=\"http://www.seriouseats.com/2014/10/how-to-make-rich-flavorful-easy-chicken-stock.html\">homemade chicken stock</a> or low-sodium broth", "5 heads baby bok choy, halved", "6 Napa cabbage leaves from 1 head, cut into 2-inch pieces, thick stalk and leafy parts separated", "2 (1.75-ounce) packs dried vermicelli noodles", "Cooked white rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tofu slices in a heatproof bowl, and pour boiling water on top to cover. Let stand for 30 seconds. Drain and transfer tofu to a paper towel-lined plate. Press gently on the tofu with paper towels to to dry thoroughly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer tofu slices to a bowl. Using a fork, mash tofu into fine pieces. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine ground pork, fatty ground pork, mashed tofu, diced water chestnuts, minced ginger, minced scallion whites, egg yolk, sugar, Shaoxing wine, salt, 2 teaspoons minced garlic, 1/2 teaspoon white pepper powder, 2 teaspoons soy sauce, and 1 teaspoon cornstarch, and gently mix until well combined, being careful not to over-mix. Refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with wet hands, form small handfuls of the meatball mixture into balls; you should have about 5 to 6 meatballs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil over medium-high heat in a non-stick pan. Working in batches to avoid overcrowding the pan, pan-fry the meatballs until golden brown, about 3 minutes. Flip meatballs and brown other side, about 3 minutes. Transfer meatballs to a large paper towel-lined plate.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl combine chicken broth, remaining 1/4 teaspoon white pepper, 1 teaspoon soy sauce, 1 1/2 teaspoons cornstarch, and 1 teaspoon minced garlic. Mix well and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot or Dutch oven, heat remaining 1 teaspoon oil over medium heat. Add bok choy and thick stem parts of the Napa cabbage. Season with salt and cook for 3 minutes. Arrange meatballs in the pot in a single layer, pour the chicken broth mixture in, and bring to a simmer. Cover and reduce heat to medium low. Cook until meatballs are cooked through, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, soak vermicelli noodles in warm water until softened, about 5 minutes. Drain well and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir vermicelli noodles and leafy parts of the Napa cabbage into the pot. Cover and simmer for 10 minutes longer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, bring the pot to the table or carefully transfer everything to a large serving bowl. Sprinkle the remaining sliced green part of the scallion on top and serve with white rice.</p>"}]}