{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/07/20150716-smoked-trout-bulgar-salad-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Maggie Mariolis"}, "recipeCuisine": "", "keywords": ["bulgur", "citrus", "fish", "grain salad", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Toasted-Bulgur Salad With Smoked Trout, Radishes, and Green Apple", "link": "https://www.seriouseats.com/recipes/2015/07/bulgur-salad-with-smoked-trout-radishes-recipe.html", "description": "You may think grain salads are humble by nature. But this one, filled with toasted bulgur, smoked trout, and an assertive mix of sliced radishes, red onion, green apple, parsley, and lemon segments mellowed and sweetened by a soak in simple syrup, proves they can be show-stoppers.", "totalTime": "55 minutes", "recipeYield": "Serves 4 as a main course", "recipeCategory": ["Apple", "Fish", "Lemon", "Other Grains", "Salads"], "recipeIngredient": ["<strong>For the Salad:</strong>", "3 lemons, cut into <a href=\"http://www.seriouseats.com/2014/04/knife-skills-how-to-cut-citrus-fruit-into-wedges-slices-and-supremes.html\">suprèmes</a> (see note)", "1/2 cup sugar", "1 3/4 cups water, divided", "1 cup bulgur wheat", "1/2 teaspoon kosher salt, plus more for seasoning", "8 ounces smoked trout, skin and bones removed, flaked into 1-inch chunks (about 1 cup)", "4 radishes (about 6 ounces), halved and thinly sliced", "1/2 small red onion (about 4 ounces), halved and thinly sliced", "1 medium Granny Smith apple (about 8 ounces), halved, cored, and thinly sliced, slices cut in half crosswise", "1 cup loosely packed flat-leaf parsley leaves, coarsely chopped", "Freshly ground black pepper", "<strong>For the Dressing:</strong>", "2 tablespoons fresh juice from 1 lemon", "1 tablespoon reserved lemon soaking syrup", "1/2 teaspoon lemon zest", "1/2 cup plus 1 tablespoon extra-virgin olive oil", "Kosher salt and freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salad:</strong> Gently tear each lemon segment into approximately 1/2-inch pieces and place them in a heatproof bowl. In a small saucepan, stir together sugar and 1/2 cup water. Bring to a boil over high heat, then simmer, stirring, until sugar has dissolved. Pour hot syrup over the lemon pieces and let stand for 45 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium skillet, toast the bulgur over moderately high heat, stirring frequently, until nutty-smelling, about 3 minutes. Transfer to a medium heatproof bowl. In a small saucepan, combine the remaining 1 1/4 cups water with 1/2 teaspoon salt and bring to a boil. Pour the boiling water over the bulgur and cover. Let stand, covered, for 20 minutes, then uncover, fluff with a fork, and let cool to room temperature, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss trout, radish, onion, apple, and parsley with the cooled bulgur. Drain the lemon segments, reserving 1 tablespoon of the lemon soaking syrup for the dressing and the rest for another use. Add the drained lemon pieces to the salad and toss gently to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dressing:</strong> In a medium bowl, whisk lemon juice with 1 tablespoon of reserved syrup and lemon zest. In a slow drizzle, pour in the olive oil, whisking constantly. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the dressing over the salad and toss gently to combine. Season with salt and pepper. Serve right away or cover and refrigerate overnight or up to 2 days. Serve chilled or at room temperature.</p>"}]}