{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160302-miso-soups-feature-vicky-wasik-10.jpg", "author": {"@type": "Person", "name": "Mari Uyehara"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "clam", "Japanese", "miso", "seafood", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Miso Soup With Clams", "link": "https://www.seriouseats.com/recipes/2016/03/miso-soup-clams-recipe.html", "description": "The briny juice of <em>asari</em> (Manila clams) is the star of this sophisticated miso soup, which is based on one served at Manhattan's EN Japanese Brasserie. Unlike many other kinds of <em>dashi</em>, the version here relies on clams instead of the more commonly used shaved bonito flakes.", "totalTime": "20 minutes plus clam-purging time", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Clams, Mussels, and Oysters", "Japanese", "Soups and Stews"], "recipeIngredient": ["1 pound (450g) small asari (Manila clams), cockles, or littleneck clams (about 2 dozen Manila clams or cockles, or 8 littlenecks)", "Cold water", "Kosher salt", "2/3 ounce dried kombu (20g; about one 6- by 6-inch piece), rinsed in cold water", "3 tablespoons (50g) mild miso, such as <em>shiro</em> (white) miso (see note)", "1 tablespoon (15g) dark miso, such as <em>aka</em> (red) miso (see note)", "<em><a href=\"http://www.seriouseats.com/2012/06/japanese-vegetables-shiso-wasabi-maitake-shisito-slideshow.html\">Mitsuba</a></em> or watercress leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse clams under cold running water. Fill a large bowl with cold water, season with salt until water is salty like the sea (about 3% salt by weight), and add clams. Let stand for 30 minutes. Lift clams from purging water and discard water. Rinse out bowl. Repeat as many times as necessary until no sand or grit collects in bottom of bowl (usually between 1 and 3 times).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine kombu and clams with 3 1/2 cups (830ml) cold water and bring to a bare simmer over medium heat, about 8 minutes. Remove kombu as soon as bare simmer begins and discard or reserve for another use. (Kombu can be thinly sliced and tossed into a salad.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue simmering, using tongs to transfer clams as they open to a large heatproof bowl, until all clams have opened. Skim any foam from the surface of the dashi. Return dashi to a clean medium saucepan and keep warm over low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk both misos with just enough dashi to form a thin paste. Off heat, whisk miso paste into dashi in saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide clams among warm bowls and spoon miso soup over them. Garnish with mitsuba or watercress leaves and serve right away.</p>"}]}