{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160607-potato-rajas-onion-hash-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "diner", "hash", "home fry", "potato", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Crispy Home Fries With Red Onions and Roasted Poblano Pepper", "link": "https://www.seriouseats.com/recipes/2016/06/crispy-potato-home-fries-red-onion-poblano-pepper-recipe.html", "description": "Every bite of soggy, greasy potatoes at a diner is a reminder of what great home fries <em>can</em> be. Every trip to the diner is like a unicorn hunt&mdash;we're chasing those perfect, crisp home fries, but rarely catch more than a glimpse of them. Home fries should be crisp on the outside and creamy in the middle, packed with potato flavor, with some herbs and onions mixed in. The good news: You don't even have to leave home to catch that unicorn.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Father's Day", "Mother's Day", "Potato", "Sides", "The Food Lab", "Vegetarian"], "recipeIngredient": ["1 medium fresh Poblano pepper (optional; see note)", "1 1/4 pounds (575g) small new or fingerling potatoes", "Kosher salt", "1 tablespoon (15ml) distilled white vinegar", "1/4 cup (60ml) vegetable oil, divided", "1 small red onion, cut into thick slices", "2 teaspoons (about 4g) minced fresh thyme", "Freshly ground black pepper", "Small handful minced fresh cilantro or parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using, place Poblano pepper directly over the flame of a gas burner, turning with tongs until well charred on all surfaces. Alternatively, place on a foil-lined rimmed baking sheet directly under a preheated broiler and broil, turning occasionally, until charred on all sides, about 8 minutes. Wrap charred pepper in foil to trap steam, and set aside. When cool enough to handle, carefully remove skin from pepper (it should slip right off). Remove and discard stems and seeds. Cut into strips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place potatoes in a pot and cover with 2 quarts (2L) of cold water. Add 2 tablespoons (30g) kosher salt and vinegar. Bring to a boil over high heat and boil until potatoes are tender, about 5 minutes after they reach a boil. Drain. As soon as potatoes are cool enough to handle, split into quarters and toss with 1 tablespoon (15ml) vegetable oil in a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Heat 2 tablespoons (30ml) vegetable oil in a large nonstick or cast iron skillet over medium-high heat until shimmering. Add potatoes and cook, tossing, until crisp and golden brown on all sides, about 6 minutes. Return to bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining tablespoon (15ml) oil to skillet and add red onion (see note). Cook, tossing occasionally, until softened and lightly browned, about 6 minutes. Add thyme and cook, stirring, until fragrant, about 30 seconds. Return potatoes to skillet and add roasted pepper strips, if using. Toss to combine and season to taste with plenty of salt and pepper. Add cilantro or parsley and toss to combine. Serve immediately.</p>"}]}