{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/10/sousvidelamb.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["lamb", "lamb rack", "rack of lamb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2", "ratingCount": "5"}, "name": "Sous Vide Rack of Lamb", "link": "https://www.seriouseats.com/recipes/2016/10/sous-vide-rack-of-lamb-recipe.html", "description": "Rack of lamb isn't cheap, so it's understandable that cooking it can be even more nerve-wracking than cooking a pricey steak. What's more, lamb tends to be leaner and smaller than a steak, which means that it's even more susceptible to accidental overcooking. All of this makes it an ideal candidate for cooking sous vide, which makes overcooking nearly impossible and perfectly edge-to-edge medium-rare results the norm.", "totalTime": "1 1/2 to 4 1/2 hours", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Christmas", "Easter", "Gluten-Free", "Lamb", "Mains", "Sous Vide", "Spring", "The Food Lab"], "recipeIngredient": ["2 (8-bone) racks of lamb, about 2 pounds (900g) total", "Kosher salt and freshly ground black pepper", "Aromatics, such as fresh thyme or rosemary sprigs, sliced shallots, and sliced garlic (optional)", "2 tablespoons (30ml) vegetable, canola, or rice bran oil", "2 tablespoons (30g) unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a sous vide cooker to desired final temperature according to chart above. Season lamb generously with salt and pepper. Place racks in two individual sous vide bags, along with herbs, garlic, and shallots (if using), and distribute evenly. Seal bags using a vacuum sealer, or seal plastic zipper-lock bags using the <a href=\"http://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">water displacement method</a>. Place bags in preheated water bath for desired time according to chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lamb from bags and carefully pat dry with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn on your vents and open your windows. Add vegetable, canola, or rice bran oil to a heavy cast iron or stainless steel skillet set over the hottest burner you have. Preheat skillet until it starts to smoke. Gently place lamb, meaty side down, in skillet, using your fingers or a set of tongs. (Work in batches if pan is not large enough to accommodate both racks.) Add 1 tablespoon butter per rack, along with fresh aromatics. Sear first side, moving rack around pan and basting it with hot melted butter and herbs, until well browned, 30 to 45 seconds. Flip and brown second side, about 30 seconds longer. Transfer to a wire rack set in a rimmed baking sheet to rest, then repeat with second rack if necessary, using fresh butter and aromatics.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lamb can be immediately carved and served as directed in step 5. Alternatively, allow it to rest for up to 10 minutes while you set the table. To re-crisp, reheat pan drippings until smoking-hot, then pour them over resting lamb racks just before carving and serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cooked lamb to a cutting board. Carve it by holding rack upright (the bones make a good handle) and slicing down after every two rib bones with a sharp knife. You'll have to work your knife around a little bit to find the joint between the vertebrae as you reach the bottom. (Don't force your knife through a bone, or you may chip or dull it.) Serve immediately.</p>"}]}