{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160225-hostess-donuts-vicky-wasik-28.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "breakfast", "coconut oil", "dessert", "donette", "fry", "frying", "greek yogurt", "hostess"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "DIY Donettes (Mini Sugar-Coated Doughnuts)", "link": "https://www.seriouseats.com/recipes/2016/04/diy-donettes-doughnut-recipe.html", "description": "Like the ones made by Hostess, my Donettes are fluffy bites of yellow cake swaddled in a messy coat of powdered sugar, and small enough to eat by the handful. They're a little tangy like the original, but from thick Greek yogurt rather than some mystery additive, with a vibrant color and custardy richness from egg yolks. But the real secret is refined coconut oil, which is odorless at high heat and happens to be the tastiest fry oil around.", "totalTime": "45 minutes", "recipeYield": "Makes about 36 mini doughnuts", "recipeCategory": ["Breakfast Sweets", "Cakes", "Deep Frying", "Desserts", "Doughnuts", "Father's Day", "Mother's Day"], "recipeIngredient": ["3 1/2 ounces granulated sugar (1/2 cup; 100g)", "1 teaspoon (4g) baking powder", "1/2 teaspoon (3g) baking soda", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1 ounce unsalted butter (2 tablespoons; 30g), melted", "1/4 ounce vanilla extract (1 1/2 teaspoons; 7ml)", "3 large egg yolks, preferably free-range for color", "4 ounces plain, unsweetened nonfat Greek yogurt (1/2 cup; 110g), room temperature", "6 1/2 ounces low-protein, all-purpose flour (shy 1 1/4 cup; 185g), such as Gold Medal, plus more for dusting", "Refined coconut oil, enough to reach a 2” depth; about 32 ounces (1L) in an 8” pot", "4 ounces powdered sugar (1 cup; 115g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Making and Shaping the Dough:</strong> Combine granulated sugar, baking powder, baking soda, and salt in a medium bowl, then stir in melted butter, vanilla, egg yolks, and Greek yogurt. When well combined, sift in flour and stir to form a soft dough, no more than 30 seconds. Turn onto a lightly floured work surface and knead until easy to handle. Dusting with as much flour as needed, roll to 3/8 inch thick. Brush off excess flour with a damp pastry brush and cut into 1 3/4&ndash;inch rounds. Arrange upside down on a paper towel&ndash;lined baking sheet, then brush away excess flour. Gather scraps, briefly knead, and repeat as before.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Forming the Hole:</strong> With a damp fingertip, press an indentation into the center of each doughnut, then flip the doughnuts and repeat. Take one doughnut in both hands and use a finger to gently pull open a hole in the center. (The paper-thin centers will give way at the slightest touch.) Smooth the ragged edges if you like and repeat with the remaining doughnuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Preparing the Oil:</strong> Melt refined coconut oil in a microwave, then pour into a roughly 8- to 10-inch stainless steel pot to a depth of at least 2 inches. (This gives cake doughnuts room to sink, allowing them to fry more quickly and absorb less oil.) Clip on digital thermometer and warm to 365&deg;F over medium heat. Meanwhile, line a baking sheet with 3 layers of paper towels and have the powdered sugar ready in a fine-mesh sieve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Frying the Doughnuts:</strong> When oil reaches 365&deg;F, practice maintaining that temperature for a few minutes before beginning to fry. Once you're comfortable with the controls, slip a test doughnut into the hot oil and fry until pale gold, turning frequently with tongs to ensure even color, about 60 seconds. Transfer to a paper towel&ndash;lined baking sheet, then sprinkle generously with powdered sugar. Taste to see how you like the results, adding or subtracting a few seconds if needed to perfect subsequent batches. Fry remaining doughnuts, up to 6 or 7 at a time, and enjoy warm with powdered sugar. Store leftovers in an airtight container for up to 36 hours at room temperature (these are best dunked in milk or coffee).</p>"}]}