{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160608-satay-pork-malaysia-recipe-spice-paste.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Asian", "keywords": ["grill", "Indonesian", "pork", "satay", "skewer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Balinese Pork Satay (<em>Sate Babi</em>) With Sweet Soy Glaze and Peanut Sauce", "link": "https://www.seriouseats.com/recipes/2016/07/indonesian-balinese-pork-satay-sate-babi-soy-glaze-peanut-recipe.html", "description": "We all know what satay is, right? Little chunks of marinated meat threaded onto bamboo skewers, grilled over coals until charred, then served with a sweet-and-spicy peanut-based dipping sauce? What we know in the States is really only the tiny tip of a vast iceberg of regional variations, and my wife, Adri, and I made it a point to follow our noses to every satay vendor we could find in Indonesia, Malaysia, and Singapore. By the time we left the region a few weeks later, I'd made up my mind: I was going to re-create as many of my favorite versions as I possibly could. First on the list: the delicious pork satay I'd had at a night market on the north shore of Bali.", "totalTime": "2 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Asian", "Grilling, Smoking, and Barbecue", "Mains", "Pork", "Snacks", "Summer", "The Food Lab"], "recipeIngredient": ["<strong>For the Spice Paste:</strong>", "One (1-inch) knob fresh turmeric, peeled (about 10g), or 1 teaspoon (4g) ground turmeric", "2 stalks lemongrass, bottom 4 inches only, outer layers and root removed, thinly sliced (about 80g)", "8 medium cloves garlic, sliced (about 60g)", "2 small shallots, sliced (about 75g)", "3 whole dried <em>pasilla</em> or <em>guajillo</em> chilies, stems and seeds removed, roughly chopped (about 40g)", "2 tablespoons (about 30g) <dorado id=\"palm-sugar\" class=\"text\">palm sugar</dorado> or brown sugar", "2 teaspoons (about 6g) whole coriander seed", "1 tablespoon (about 9g) whole white peppercorns", "Kosher salt", "2 pounds (1kg) boneless pork shoulder, cut into 3/4-inch cubes", "<strong>For the Glaze:</strong>", "1 cup <em>kecap manis</em> (8 ounces; 240ml); see note", "1/4 cup sugar (about 2 ounces; 50g), plus more if needed", "One (2-inch) knob ginger, roughly chopped", "4 medium cloves garlic, roughly chopped", "<strong>For the Dipping Sauce:</strong>", "10 ounces roasted peanuts (285g; about 1 1/2 cups)", "1/4 cup (60ml) vegetable or canola oil, divided", "1 ounce (30g) tamarind pulp, soaked and strained (see note), or 2 teaspoons (10ml) tamarind concentrate", "1 tablespoon (15ml) kecap manis or fish sauce", "Water, as necessary", "Sugar, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spice Paste:</strong> Combine turmeric, lemongrass, garlic, shallots, chilies, sugar, coriander, white peppercorns, and 2 teaspoons (8g) kosher salt using a <dorado id=\"mortar-and-pestle\" class=\"text\">mortar and pestle</dorado>, working in batches if necessary. Pound into a fine paste. (For an easier method, pound with the mortar and pestle until a rough paste is formed, then transfer to a <a href=\"https://www.seriouseats.com/2017/10/best-food-processor-equipment-review.html\">food processor</a> to reduce to a fine paste. I do not recommend using the food processor alone if you want maximum flavor.) Divide mixture into thirds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pork and one-third of spice paste in a large bowl and toss with your hands until all of pork is thoroughly coated in the mixture. Cover and refrigerate for at least 45 minutes or up to overnight. Thread pork onto <dorado id=\"flat-metal-skewers\" class=\"text\">skewers</dorado>. To do this efficiently, cut an onion or potato in half and place it on your cutting board. Place a piece of pork on top of it and push through it with the skewer. Repeat until each skewer has about 6 inches of pork threaded onto it. Pork should be pushed together quite tightly. Discard onion half (or grill it) after use. Keep pork skewers refrigerated until ready to cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Glaze:</strong> Meanwhile, combine <em>kecap manis</em>, sugar, ginger, and garlic in a small saucepan and bring to a simmer over medium-low heat. Cook until glaze is thick enough to coat the back of a spoon. Stir in one-third of spice paste and adjust seasoning with more sugar as necessary. Strain mixture through a fine-mesh strainer, using the back of a spoon to extract as much liquid as possible. Discard solids. Leftover glaze can be stored indefinitely in a covered container in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dipping Sauce:</strong> Pound peanuts with the mortar and pestle until reduced to a rough powder. Heat 2 tablespoons (30ml) oil in a medium skillet over medium-high heat until shimmering. Add remaining third of spice paste and cook, stirring, until fragrant, about 1 minute. Add peanuts, tamarind juice, remaining oil, kecap manis or fish sauce, and 1/2 cup (120ml) water. Stir to combine. Once liquid comes to a simmer and turns creamy, adjust consistency with more water as necessary to produce a creamy sauce that just barely flows. Season to taste with a little sugar if desired. Leftover sauce can be stored for several weeks in a covered container in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches as necessary, place pork directly over hot side of grill. Immediately start fanning coals or flames with a large piece of cardboard or with the hose of a Shop-Vac to prevent flare-ups. Cook, fanning constantly and turning pork occasionally, until pork is cooked through and browned on all sides, about 6 minutes total. Transfer pork to cooler side of grill and brush on all sides with glaze. Return to hot side of grill and cook, turning, just until glaze starts to bubble and get sticky, about 45 seconds. Transfer skewers to a serving platter and repeat until all pork is cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush pork with another layer of glaze just before serving and serve with peanut sauce on the side or spooned on top.</p>"}]}