{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160316-vegan-migas-vigas-recipe-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Tex-Mex", "keywords": ["breakfast", "easy", "Mexican", "migas", "quick", "tex-mex", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Vegan Migas (Mexican-Style Fried Tortillas With Tofu)", "link": "https://www.seriouseats.com/recipes/2016/03/vegan-migas-mexican-style-fried-tortillas-tofu-recipe.html", "description": "On weekends, I want something for breakfast that I can really dig into&mdash;something that wouldn't feel out of place with a Bloody Mary or a michelada on the side. Enter <em>vigas</em>. That'd be vegan migas (and I'm only a little bit sorry for the terrible wordplay). Migas, the Tex-Mex dish of eggs scrambled with fried tortillas, onions, and chilies, is nearly ideal for veganizing because of the way the eggs are treated.", "totalTime": "20 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Breakfast and Brunch", "Dairy-Free", "Easter", "Father's Day", "Mexican", "Mother's Day", "Tex-Mex", "Tofu", "Vegan", "Vegetarian"], "recipeIngredient": ["2 medium plum tomatoes, diced (about 6 ounces; 170g)", "Kosher salt", "8 corn tortillas, cut into 1 1/2- by 3/4-inch strips, plus more for serving", "1/4 cup (60ml) vegetable oil, divided", "1 medium yellow or white onion, finely chopped (about 8 ounces; 225g)", "1 poblano pepper, stemmed, seeded, and finely chopped (about 4 ounces; 120g)", "2 serrano chilies or 1 jalapeño, stemmed and finely chopped", "1/2 teaspoon (2g) paprika", "Pinch of ground cumin", "1 block soft or medium silken tofu, drained of excess water", "1/2 cup (120ml) <a href=\"http://www.seriouseats.com/recipes/2016/01/charred-salsa-verde-tomatillo-salsa.html\">homemade</a> or store-bought salsa verde, plus more for serving", "Handful cilantro leaves and tender stems, finely chopped", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss tomatoes with 1/2 teaspoon salt in a large bowl. Transfer to a colander or fine-mesh strainer, set strainer over a bowl or the sink, and allow tomatoes to drain. Meanwhile, heat 3 tablespoons (45ml) vegetable oil in a large nonstick or cast iron skillet until shimmering. Add tortilla strips and cook, tossing and stirring frequently, until crisp, about 4 minutes total. Transfer to a paper towel&ndash;lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to heat and add remaining 1 tablespoon (15ml) vegetable oil. Add onion, poblano, and serrano peppers and cook, stirring, until softened but not browned, about 4 minutes. Stir in paprika and cumin. Add tofu and break it up into large chunks. Stir in drained tomatoes, tortilla strips, and salsa. Cook, folding ingredients gently, until tortilla strips have absorbed moisture and softened and mixture has a tender, spoonable consistency that is not runny, about 4 minutes. Stir in cilantro and season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately with warm tortillas and extra salsa for making tacos.</p>"}]}