{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/03/BraisedLambShanks.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["braise", "fall", "lamb", "spring", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Tender Braised Lamb Shanks With Bitter Herb Salad", "link": "https://www.seriouseats.com/recipes/2016/03/braised-lamb-shanks-herb-salad-recipe.html", "description": "Like winter into spring, lamb shanks are a cut that undergoes a transformation, from tough to meltingly tender. The secret is a long, slow braise. These are rubbed with a fragrant spice mixture, then braised with vegetables, white wine, and chicken stock and served with a bright spring salad.", "totalTime": "3 1/2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Braising and Stewing", "Christmas", "Easter", "Lamb", "Mains", "Mother's Day"], "recipeIngredient": ["<strong>For the Braised Lamb:</strong>", "1 1/2 teaspoons (5g) ground coriander seed", "1 1/2 teaspoons (5g) ground fennel seed", "3/4 teaspoon (3g) ground cumin ", "1/4 teaspoon (1g) smoked paprika", "4 bone-in lamb shanks (about 6 pounds; 2.75kg)", "Kosher salt and freshly ground black pepper", "4 tablespoons (60ml) extra-virgin olive oil, divided, plus more if needed", "3 medium carrots (12 ounces; 250g), cut into large dice", "2 large stalks celery (5 ounces; 150g), cut into large dice", "1 medium yellow onion (9 ounces; 250g), cut into large dice", "4 medium cloves garlic, crushed", "3 oil-packed anchovy fillets, chopped", "2 tablespoons (30ml) tomato paste ", "1 cup (230ml) dry white wine ", "4 cups (950ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought chicken stock", "1 sprig rosemary", "1 bay leaf", "<strong>For the Herb Salad:</strong>", "2 small heads (about 150g each) red and/or white endive, cored and very thinly sliced crosswise", "1 large stalk celery (about 75g), sliced thinly on the bias", "3 cups loosely packed herb leaves (3 ounces; 85g), such as cilantro, parsley, mint, and basil", "1 tablespoon (15ml) fresh juice from 1 lemon ", "3 tablespoons (45ml) extra-virgin olive oil", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Braised Lamb:</strong> Preheat oven to 300&deg;F. In a small bowl, stir together coriander seed, fennel seed, cumin, and smoked paprika until thoroughly combined. Season lamb shanks all over with salt and pepper, then rub spice mixture all over meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons (30ml) oil in a large Dutch oven or roasting pan over medium-high heat until shimmering. Add shanks, working in batches if necessary to avoid crowding the pan, and brown on both sides, about 4 minutes per side. Reduce heat if necessary to prevent spices from scorching; add more oil if needed. Transfer browned shanks to a rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 2 tablespoons (30ml) oil to Dutch oven or roasting pan, along with carrots, celery, onion, and garlic, and cook over medium-high heat until vegetables are softened and just starting to brown, about 8 minutes. Add anchovies and tomato paste and cook, stirring, for 1 minute. Add wine, scrape up browned bits from bottom of pan, bring to a simmer, and cook until raw alcohol smell has mostly cooked off, about 2 minutes. Arrange shanks in Dutch oven, nestling them among the vegetables; add any accumulated juices from the baking sheet to the pot. Add stock, rosemary, and bay leaf and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cut a piece of parchment paper just slightly smaller than the opening of the Dutch oven or roasting pan, with a hole in the center, and set it directly on top of the shanks and braising liquid. (This parchment paper lid will allow a limited amount of evaporation.) To do this, fold a large square of parchment paper in half twice. Fold the resulting square into a triangle, keeping the center of the original square at one of the acute tips of the triangle. Fold into a narrower triangle, keeping the original center of the square at the acute tip. Fold into a narrower triangle one more time. Hold the tip of the triangle over the center of the Dutch oven and trim off the back edge where it meets the edge of the pot with a pair of scissors. Cut off the tip of the triangle. Unfold the parchment, and it should fit perfectly inside the Dutch oven. Alternatively, cover the pot with a lid, leaving it partially cracked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer shanks to oven and cook until very tender, about 3 hours. Discard rosemary and bay leaf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer shanks to a clean rimmed baking sheet. Working in batches to prevent overfilling blender, ladle braising liquid and vegetables into a blender jar. Remove center cap of blender lid, then place lid on blender jar. Cover with a clean kitchen towel and turn blender on, starting at its lowest speed and gradually increasing to high. Blend until very smooth; for an extra-smooth texture, pass blended braising sauce through a fine-mesh strainer. Repeat with remaining braising mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer braising sauce to a clean saucepan and season with salt and pepper. If too thick, adjust texture by thinning with water or stock; if too thin, simmer until thickened and reduced sufficiently. Baste shanks with sauce, coating them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Herb Salad:</strong> Just before serving, make salad by combining sliced endive, celery, and herbs in a large mixing bowl. Add lemon juice and oil and toss well. Season with salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer warm shanks to a serving platter or plates, spooning their sauce all over. Arrange salad on top and serve right away.</p>"}]}