{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/09/20160921-manicotti-crepe-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["crepe", "Italian", "italian american", "manicotti", "pasta", "ragu", "veal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Crepe Manicotti With Veal Ragù", "link": "https://www.seriouseats.com/recipes/2016/09/crepe-manicotti-veal-ragu-recipe.html", "description": "This crepe-style manicotti dish features tender thin pancakes rolled around a rich and creamy veal <em>ragù</em>, layered with tomato sauce, and baked until bubbling and browned.", "totalTime": "3 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Beef", "Fall", "Italian", "Mains", "Other Meats", "Pasta", "Winter"], "recipeIngredient": ["<strong>For the Ragù:</strong>", "3 tablespoons (45ml) extra-virgin olive oil", "1 large (9-ounce; 275g) yellow onion, minced", "1 medium (5-ounce; 150g) carrot, minced", "4 medium cloves garlic, minced", "2 fresh rosemary sprigs, stems discarded and needles minced", "2 pounds (900g) ground veal, divided", "Kosher salt and freshly ground black pepper", "1 cup (240ml) dry white wine", "1 cup (240ml) whole milk", "1 bay leaf", "<strong>For the Crepes:</strong>", "2 cups all-purpose flour (10 ounces; 280g)", "4 large eggs", "2 1/2 cups (600ml) whole milk", "Kosher salt", "Unsalted butter, for the pan", "<strong>For the Béchamel:</strong>", "4 tablespoons (60g) unsalted butter", "4 tablespoons (60g) all-purpose flour", "2 cups (480ml) whole milk", "Kosher salt and freshly ground black pepper", "Pinch freshly grated nutmeg", "<strong>To Assemble:</strong>", "2 cups (480ml) tomato sauce, such as <a href=\"http://www.seriouseats.com/recipes/2014/09/easy-italian-amercian-red-sauce-recipe.html\">Quick and Easy Italian-American Red Sauce</a>, <a href=\"http://www.seriouseats.com/recipes/2014/09/the-best-slow-cooked-italian-american-tomato-sauce-red-sauce-recipe.html\">Slow-Cooked Tomato Sauce</a>, or <a href=\"http://www.seriouseats.com/recipes/2014/08/the-best-fresh-tomato-sauce-for-pasta-recipe.html\">Fresh Tomato Sauce</a>, divided", "Parmigiano Reggiano, for grating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Ragù:</strong> In a Dutch oven, heat olive oil over medium-high heat until shimmering. Add onion, carrot, and garlic and cook, stirring frequently, until softened and beginning to turn golden, about 6 minutes. Add rosemary and half of veal and cook, stirring and scraping the bottom of the pot frequently, until well browned, 8 to 10 minutes; make sure to break up veal into tiny bits as you go. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining veal and cook, breaking it up into small bits while scraping bottom of pot, until just cooked through, about 5 minutes. Add white wine and cook, scraping up any browned bits from bottom and sides of pot, until raw alcohol smell cooks off, about 5 minutes. Add milk and bay leaf, bring to a simmer, then lower heat and cook at a bare simmer, stirring occasionally, until ragù is thick and meat is tender, about 30 minutes. Discard bay leaf and season with salt and pepper; keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, Make the Crepes:</strong> Line a large plate or baking sheet with parchment paper. In a medium bowl, whisk together flour, eggs, milk, and a large pinch of salt until smooth. Heat a 10-inch nonstick or crepe pan over medium-high heat. Add a small pat of butter and cook until melted, swirling to fully coat pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a ladleful of batter (about 3/4 cup; 175ml) to pan and immediately swirl to form a large, thin pancake. Cook until top of crepe begins to look dry and bottom is starting to brown, about 1 minute. Using a spatula, make sure crepe is free of pan, then flip with a spatula or your fingertips. (You can also toss and catch the crepe if you feel comfortable doing that.) Cook until second side is lightly browned, then transfer to parchment-lined plate or baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue making crepes with remaining batter, adding more butter to pan each time and stacking crepes as you go. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Béchamel:</strong> In a small saucepan, melt butter over medium-high heat (do not allow it to brown). Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring, until sauce is thick enough to coat the back of a wooden spoon, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season with salt and pepper. Add nutmeg. If any lumps form, whisk thoroughly to remove them and smooth out sauce, or use a hand blender or countertop blender if lumps are particularly large or tough. Keep béchamel warm and press plastic wrap against its surface to prevent a skin from forming.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Preheat oven to 350&deg;F (177&deg;C). Mix 1 1/4 cups (300ml) béchamel sauce into veal ragù. In a 9- by 13-inch baking dish, spread 1 cup (240ml) tomato sauce in an even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with 1 crepe at a time, set a crepe on a work surface and spoon a generous amount of ragù in a line slightly off center. Roll up crepe to form a stuffed tube and carefully transfer to baking dish. Continue filling and rolling crepes and arranging them alongside each other in baking dish until dish is full. You will likely have several crepes (this recipe intentionally makes extra to allow for a few duds and mistakes) and a small amount of ragù left over, which can be reserved for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon remaining béchamel in an even layer on top of rolled crepes, then top with an even layer of remaining tomato sauce. Grate Parmigiano Reggiano all over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake manicotti in oven until heated through and lightly browned on top, about 25 minutes. Serve.</p>"}]}