{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20161028-baked-macaroni-cheese-sodium-citrate-vicky-wasik-21.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "American", "keywords": ["american", "cheese", "essential", "mac and cheese", "macaroni", "macaroni and cheese", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1578947368421", "ratingCount": "19"}, "name": "Modern Baked Mac and Cheese With Cheddar and Gruyère", "link": "https://www.seriouseats.com/recipes/2016/11/sodium-citrate-baked-mac-and-cheese.html", "description": "This baked macaroni and cheese recipe harnesses the amazing emulsifying powers of sodium citrate, the same salt used to make American cheese so incredibly meltable. Simply blend the grated cheese of your choice (we use cheddar) into water that has sodium citrate dissolved into it, and the gooiest, smoothest, and silkiest cheese sauce emerges.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes one 9- by 13-inch baking dish, serving 8", "recipeCategory": ["American", "Baking", "Cheese", "Christmas", "Easter", "Fall", "Game Day", "Mac and Cheese", "Mains", "Recipes", "Sides", "Thanksgiving", "Vegetarian", "Winter"], "recipeIngredient": ["Kosher salt", "1 pound (450g) elbow macaroni", "5 tablespoons (75g) unsalted butter, divided", "4 teaspoons (20g) sodium citrate (see note)", "1 1/2 pounds (680g) grated sharp cheddar cheese (see note)", "1 teaspoon (5ml) hot sauce, such as Frank's RedHot", "1/2 teaspoon (2g) mustard powder", "1/4 teaspoon (1g) garlic powder", "1/2 pound (225g) grated Gruyère cheese (see note)", "1 cup panko bread crumbs (2 ounces; 55g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F (200&deg;C). In a medium pot of salted boiling water, cook elbow macaroni until just shy of al dente, about 2 minutes less than cooking time indicated on package. Drain, then transfer pasta to a large mixing bowl and toss with 2 tablespoons (30g) butter until butter is melted and pasta is evenly coated. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, bring 3 cups (720ml) water to a simmer. Whisk in sodium citrate until fully dissolved. While maintaining a gentle simmer, add cheddar cheese in small increments, using an immersion blender to incorporate it completely into the sauce before the next addition. When all the cheese is added and the sauce is smooth and glossy, blend in hot sauce, mustard powder, and garlic powder. Season with salt, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape cheese sauce into pasta and mix until evenly coated. Let cool slightly, then add grated Gruyère and mix well. Scrape pasta into a 9- by 13-inch baking dish and smooth surface into an even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add panko to a small mixing bowl. Melt remaining 3 tablespoons butter, then add to panko and mix until evenly coated. Season with salt. Scatter panko all over surface of mac and cheese in an even layer. Bake on top rack of oven until browned and bubbling, about 45 minutes (ovens can vary; check often to prevent top from burning).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let mac and cheese rest 15 minutes, then serve. Leftover mac and cheese can be refrigerated for up to 5 days; it reheats surprisingly well in the microwave or oven.</p>"}]}