{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/02/20160211-pasta-arrabiata-vicky-wasik-010.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["easy", "Italian", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Penne With Hot-as-You-Dare Arrabbiata Sauce", "link": "https://www.seriouseats.com/recipes/2016/02/penne-pasta-arrabbiata-sauce-recipe.html", "description": "Exceedingly simple in concept and execution, <em>arrabbiata</em> sauce is tomato sauce with the distinction of being spicy enough to earn its \"angry\" moniker. Here's how to make it, from start to finish.", "totalTime": "15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Italian", "Mains", "Pasta", "Quick Dinners", "Vegetarian"], "recipeIngredient": ["Kosher salt", "1 pound (450g) penne pasta", "3 tablespoons (45ml) extra-virgin olive oil, plus more as desired", "1 medium clove garlic, crushed", "As much crushed red pepper as you dare (see note)", "1 (28-ounce; 794g) can whole peeled tomatoes, crushed by hand (see note)", "2 ounces (60g) finely grated Parmesan cheese, plus more for serving", "Small handful minced flat-leaf parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan of boiling salted water, cook penne until just short of al dente, about 1 minute less than the package recommends.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large skillet, combine oil, garlic, and pepper flakes. Cook over medium heat until garlic is very lightly golden, about 5 minutes. (Adjust heat as necessary to keep it gently sizzling.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomatoes, stir to combine, and bring to a bare simmer. When pasta is ready, transfer it to sauce using a strainer or slotted spoon. (Alternatively, drain pasta through a colander, reserving 1 cup of cooking water. Add drained pasta to sauce.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add about 1/4 cup pasta water to sauce and increase heat to bring pasta and sauce to a vigorous simmer. Cook, stirring and shaking the pan and adding more pasta water as necessary to keep sauce loose, until pasta is perfectly al dente, 1 to 2 minutes longer. (The pasta will cook more slowly in the sauce than it did in the water.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking pasta until sauce thickens and begins to coat noodles, then remove from heat and toss in cheese and parsley, stirring vigorously to incorporate. Stir in a drizzle of fresh olive oil, if desired. Season with salt and serve right away, passing more cheese at the table.</p>"}]}