{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20161107-beet-salad-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["apple", "beet", "fall", "grain", "grain salad", "make ahead", "salad", "thanksgiving", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.25", "ratingCount": "4"}, "name": "Beet and Wheat Berry Salad With Pickled Apples and Pecans", "link": "https://www.seriouseats.com/recipes/2016/11/beet-wheat-berry-salad-apple-recipe.html", "description": "The key to make-ahead salads like this one is to use ingredients that can hold their shape and freshness over time. That means lettuces are out. In this hearty option, we combine chewy whole red winter wheat, roasted beets and their sautéed greens, pickled apples, and toasted pecans. It's a perfect, filling vegetarian option for autumn and winter tables.", "totalTime": "3 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Apple", "Christmas", "Dairy-Free", "Fall", "Mains", "Other Grains", "Other Vegetables", "Salads", "Seasonal and Holiday", "Sides", "Thanksgiving", "Vegan", "Vegetarian", "Winter"], "recipeIngredient": ["1 1/2 cups whole red winter wheat berries or other whole grain (12 ounces; 340g) (see note)", "Kosher salt", "3 1/2 pounds (1.5kg) beet roots with their greens, roots and leafy stalks separated, 8 ounces' (225g) worth of leaves and stalks washed and chopped coarsely, remainder reserved for another use (see note)", "1 tablespoon (15ml) extra-virgin olive oil, plus more for drizzling", "2 medium cloves garlic, minced", "1 cup white wine vinegar (8 ounces; 235ml)", "2 tablespoons (25g) sugar", "2 sprigs tarragon", "3/4 pound (340g) very crisp apples, such as Honeycrisps, cored and diced", "4 medium shallots, minced (6 ounces; 170g)", "1 1/2 cups pecans (6 ounces; 170g), toasted and roughly crumbled", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/10/simple-vinaigrette-recipe.html\">Simple Vinaigrette</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 425&deg;F (218&deg;C). In a medium pot, add wheat berries and cover by at least 2 inches of cold water. Add enough salt to taste, bring to a boil over high heat, then reduce to a simmer and cook until berries are tender with a pleasant chewiness, about 1 1/2 hours. Drain and set aside or place in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place trimmed beet roots in a roasting pan, add a couple of tablespoons of water, and drizzle with enough olive oil to coat each beet root. Cover pan with aluminum foil and roast until beets are easily pierced by a fork or paring knife, about 1 hour. Let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel beets, trim ends, and cut into 1/2-inch pieces. (The peels should rub off fairly easily with paper towels; if desired, wear latex gloves when peeling red beets to prevent staining fingers.) Set aside or place in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, heat remaining 1 tablespoon (15ml) olive oil in a large skillet over medium heat until shimmering. Add garlic and cook until fragrant but not browned, about 30 seconds. Add chopped beet greens and stems and cook, stirring often, until leaves are fully wilted and stalks are tender, about 10 minutes. Lower heat if necessary to prevent scorching. Season with salt. Set aside or place in refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine white wine vinegar with 1 cup (235ml) water, sugar, 1 teaspoon (4g) kosher salt, and tarragon sprigs. Bring to a simmer over medium-high heat, stirring to dissolve sugar and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place apples and shallots in a stainless steel mixing bowl nested in a larger mixing bowl full of ice water. Pour hot vinegar brine over apples, stirring to chill rapidly. Once cool, discard tarragon and press a clean paper towel against the surface to fully submerge apples. Set aside or place in refrigerator for at least 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to assemble, drain apples and shallots. Combine cooked wheat berries, diced beets, sautéed beet greens, pickled apples and shallots, and toasted pecans in a large serving bowl. Toss well. Dress with enough vinaigrette to coat, drizzling on extra olive oil at any point to refresh salad if it appears dry. Season with salt and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make Ahead:</strong> Salad components can each be made up to 3 days in advance and refrigerated separately until ready to combine and serve. This salad can also be assembled fully in advance, as it improves with time as the wheat berries absorb flavors from the dressing and other ingredients. If desired, assemble up to 3 days in advance and keep refrigerated. (Red beets will stain everything more if salad is assembled in advance, but otherwise there are no downsides.)</p>"}]}