{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/21060307-tofu-pinenut-jicama-lettuce-wrap-recipe-vegan-07-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Chinese", "lettuce", "mushroom", "pine nut", "shiitake", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Cantonese-Style Tofu, Pine Nut, and Jicama Lettuce Cups (San Choi Bao)", "link": "https://www.seriouseats.com/recipes/2016/03/tofu-pine-nut-jicama-lettuce-cups-recipe.html", "description": "The inspiration for this recipe comes from the version of <em>san choi bao</em> I grew up eating at the original Phoenix Garden in New York's Chinatown. That version features minced squab stir-fried with pine nuts and finely diced water chestnuts and vegetables. This thing is all about texture as the mix of crunchy, crisp, and tender bits comes together in your mouth, and it works just as well with a new set of vegetable-based ingredients.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Chinese", "Dairy-Free", "Mains", "Mushrooms", "Nuts", "Quick Dinners", "Tofu", "Vegan", "Vegetarian"], "recipeIngredient": ["1 (14-ounce; 400g) block firm tofu ", "1 tablespoon (15ml) Shaoxing wine or dry sherry ", "1 tablespoon (15ml) dark soy sauce ", "2 teaspoons (10ml) Chinese black vinegar or cider vinegar ", "4 tablespoons (60ml) hoisin sauce, plus more for serving ", "2 teaspoons (10ml) chili sauce, such as Sriracha or sambal oelek (optional)", "1 teaspoon (about 3g) cornstarch", "1 1/2 ounces pine nuts (40g; about 1/4 cup)", "1/4 cup (60ml) vegetable oil, divided", "2 1/2 ounces shiitake mushrooms, stems removed, cut into 1/4-inch dice (70g; about 1 cup diced)", "3 scallions, white and pale green parts only, thinly sliced", "3 medium cloves garlic, minced (about 1 tablespoon; 15ml)", "1 (1-inch) knob ginger, minced (about 1 tablespoon; 15ml)", "4 ounces jicama, peeled and cut into 1/4-inch dice (about 1/2 of an apple-sized jicama; 120g) (see note)", "2 ounces celery, cut into 1/4-inch dice (about 1 large stalk; 60g)", "Handful chopped fresh cilantro leaves", "Kosher salt", "Ground white pepper", "1 head iceberg or green leaf lettuce, picked into individual leaves, stored in ice water until ready to use"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut tofu into 1/4-inch slabs. Press firmly between paper towels to remove excess moisture, then cut into 1/4-inch dice. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine Shaoxing wine, soy sauce, vinegar, hoisin sauce, chili sauce (if using), cornstarch, and 1 tablespoon (15ml) water in a small bowl and mix with a fork until homogeneous. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pine nuts and 1 tablespoon (15ml) oil in a wok and place over medium heat. Cook, stirring frequently, until nuts are well toasted, about 5 minutes. Transfer to a large bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 tablespoon oil to wok and heat over high heat until lightly smoking. Add tofu and cook, stirring occasionally, until tofu is well browned all over, 6 to 8 minutes. Transfer to bowl with pine nuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 1 tablespoon oil to wok and heat over high heat until lightly smoking. Add shiitakes and cook, stirring occasionally, until well browned all over, about 3 minutes. Transfer to bowl with tofu and pine nuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining tablespoon oil in wok over high heat until lightly smoking. Add scallions, garlic, and ginger and cook, stirring and tossing constantly, until fragrant, about 15 seconds. Add jicama and celery and toss to combine. Return tofu, mushrooms, and pine nuts to wok and toss to combine. Stir sauce with a fork to reintegrate any cornstarch that may have settled to the bottom, then add to wok. Cook, tossing and stirring constantly, until all vegetables are evenly coated in sauce. Stir in cilantro (reserve a little for garnish) and season to taste with salt and white pepper. Transfer to a warm serving platter and sprinkle with reserved cilantro.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately. To eat, spread a little hoisin sauce on the bottom of a lettuce leaf and spoon the filling into the lettuce. Eat with your hands.</p>"}]}