{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/10/20161006-fried-pork-chops-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["cutlet", "easy", "fry", "panko", "pork", "pork chop", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.3333333333333", "ratingCount": "3"}, "name": "Breaded Fried Pork Chops", "link": "https://www.seriouseats.com/recipes/2016/10/breaded-fried-pork-chops-recipe.html", "description": "These thin pork chops are coated in a flavorful mixture of panko bread crumbs, Parmesan cheese, and fresh sage, then fried until supremely crisp on the outside and tender and juicy within. If you have a large cast iron skillet, now's the time to break it out.", "totalTime": "20 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Deep Frying", "Mains", "Pork", "Quick Dinners", "Stovetop"], "recipeIngredient": ["8 (1/2-inch-thick) bone-in rib or center-cut pork chops (about 6 ounces/170g each)", "Kosher salt and freshly ground black pepper", "1 cup all-purpose flour (4 1/2 ounces; 120g)", "4 large eggs, beaten", "2 cups panko bread crumbs (4 ounces; 115g), roughly crushed by hand if very large", "1 ounce (30g) grated Parmigiano-Reggiano cheese", "1 tablespoon minced fresh sage leaves (about 10 leaves)", "About 1 to 1 1/2 cups (240 to 360ml) vegetable or canola oil, or <a href=\"http://www.seriouseats.com/recipes/2015/08/clarified-butter-recipe.html\">clarified butter</a>, for frying (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork all over with salt and pepper. Set 3 wide, shallow bowls on a work surface. Add flour to the first one; beaten eggs to the second; and panko, Parmesan cheese, and sage to the third. Season panko and Parmesan with salt and pepper and mix thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with one chop at a time, dredge a pork chop in flour with your left hand, shaking off excess. Transfer to egg dish, then turn pork with your right hand to coat both sides. Lift with your right hand and allow excess egg to drain off, then transfer to bread crumb mixture. With your left hand, scoop bread crumbs on top of pork, then gently press, turning pork to ensure a good layer of crumbs on both sides. Transfer pork to a clean parchment-lined baking sheet with your left hand and repeat with remaining cutlets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large cast iron skillet or straight-sided sauté pan with 1/4 inch oil or clarified butter. (To speed things up even more, use 2 skillets simultaneously.) Heat cooking fat over high heat until shimmering and just shy of smoking. A bread crumb dropped in it should sizzle and foam immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs or your fingers, gently lower chops into hot fat, laying them down away from you to prevent hot fat from splashing toward you. (Work in batches if necessary.) Fry, gently swirling pan and rotating chops for even browning, and adjusting heat as necessary for a steady, vigorous bubble, until bottom sides are browned and crisp, about 3 minutes. Flip chops and fry until other sides are browned and crisp, about 3 minutes longer. Transfer to paper towels to drain and season lightly with salt right away. Repeat with remaining chops. Serve.</p>"}]}