{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/04/20160322-strata-vicky-wasik--11.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["bread", "breakfast", "brunch", "easy", "egg"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Spring Strata With Asparagus, Leeks, Sausage, and Cheese", "link": "https://www.seriouseats.com/recipes/2016/04/strata-asparagus-mushroom-leek-sausage-recipe.html", "description": "Best described as a savory bread pudding, strata can be prepared ahead and then thrown in the oven shortly before serving. This one features bread baked with an eggy custard, asparagus, leeks, mushrooms, sausage, and Gruyère cheese.", "totalTime": "30 minutes plus 1 hour (or up to overnight) to rest", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Bread Pudding", "Breakfast and Brunch", "Easter", "Eggs", "Father's Day", "Mains", "Mother's Day", "Sides"], "recipeIngredient": ["1 pound white bread loaf, cut into 1 1/2-inch cubes (1 loaf; 450g)", "5 tablespoons (75ml) vegetable oil, divided", "1 large leek, white and pale green parts only, diced (about 8 ounces; 225g)", "2 medium cloves garlic, thinly sliced", "1 pound (450g) asparagus, woody ends trimmed and asparagus cut into 1-inch lengths", "Kosher salt and freshly ground black pepper", "1/2 pound (225g) cremini mushrooms, trimmed and sliced", "1 pound (450g) Italian sausage, casings discarded", "8 ounces Gruyère cheese, 6 ounces (170g) diced and 2 ounces (55g) grated, divided (225g total)", "2 tablespoons (about 4g) minced flat-leaf parsley", "1 teaspoon (about 1g) minced fresh thyme leaves", "10 large eggs", "2 1/2 cups (600ml) milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to lower-middle and upper-middle positions. Preheat oven to 275&deg;F. Spread bread evenly over two rimmed baking sheets. Stagger trays on oven racks and bake until mostly dried, about 35 minutes, rotating trays and stirring bread cubes several times during baking. Remove from oven and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large skillet, heat 2 tablespoons (30ml) oil over medium-high heat until shimmering. Add leek and garlic and cook, stirring, until just starting to soften, 1 to 2 minutes. Add asparagus, season with salt and pepper, and cook until crisp-tender, about 3 minutes. Scrape into a large mixing bowl. Wipe out skillet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same skillet, heat remaining 3 tablespoons (45ml) oil over medium-high heat until shimmering. Add mushrooms and cook, stirring, until liquid has been released and has evaporated and mushrooms are starting to brown, about 6 minutes. Add sausage and cook, using spatula or spoon to break up into small pieces, until cooked through, about 5 minutes. Scrape into bowl with asparagus and add cubed cheese, parsley, and thyme.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk eggs with milk until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add dried bread to asparagus and sausage mixture, pour egg mixture on top, season with salt and pepper, and mix until well combined. Transfer to a 9- by 13-inch baking dish, cover with plastic, and refrigerate for at least 1 hour and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, preheat oven to 325&deg;F. Remove plastic from baking dish and bake strata until egg is cooked through to center, about 35 minutes. Sprinkle grated cheese on top, turn on broiler, and broil on top rack just until cheese is melted and surface of strata is lightly browned in spots, about 2 minutes. Serve.</p>"}]}