{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161221-seven-layer-salad-yogurt-endive-recipe-22.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["celery", "chickpea", "cucumber", "easy", "endive", "make ahead", "quick @vegetarian-salad", "radish", "salad", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Seven-Layer Make-Ahead Salad With Chickpeas, Endive, and Yogurt Dressing", "link": "https://www.seriouseats.com/recipes/2016/12/seven-layer-make-ahead-salad-chickpeas-endive-recipe.html", "description": "Let's admit it: A seven-layer salad is really just garnished mayonnaise. Not that that's necessarily a bad thing, but it's potluck food&mdash;not exactly the kind of dish you'd serve at a dinner party or holiday gathering. It's too bad, because the seven-layer salad offers one really serious advantage to the harried home cook: It's meant to be made ahead. You can assemble the whole thing several hours in advance and place it on the table with no need for further dressing or futzing. I decided to take the concept and upgrade it a bit with some more seasonal and holiday meal-appropriate ingredients.", "totalTime": "20 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Christmas", "Cucumber", "Legumes", "New Year", "No-Cook", "Quick Dinners", "Salads", "Thanksgiving", "Winter"], "recipeIngredient": ["1 small red onion, thinly sliced (about 4 ounces; 110g)", "3 tablespoons red wine vinegar (45ml)", "1 tablespoon sugar", "1 medium cucumber, peeled, seeds removed, and cut into 1/2-inch dice (about 6 ounces; 170g)", "Kosher salt", "3/4 cup Greek-style yogurt (175ml) ", "2 teaspoons juice from 1 lemon (10ml)", "Handful chopped fresh dill, plus a few small fronds reserved for garnish", "Handful chopped fresh mint leaves, plus a few small leaves reserved for garnish", "2 tablespoons extra-virgin olive oil (30ml)", "1 (15-ounce; 440 ml) can chickpeas, drained, rinsed, and dried", "1 large Belgian endive, core removed, thinly sliced lengthwise (about 6 ounces; 170g)", "2 large stalks celery, peeled and cut into thin slices on a sharp bias (about 3 ounces; 90g), plus a few celery leaves reserved for garnish", "6 to 8 radishes, scrubbed, trimmed, and cut into thin wedges (about 3 ounces; 90g)", "3 ounces crumbled feta or blue cheese (90g)", "3 tablespoons pomegranate seeds (45ml)", "2 tablespoons toasted sunflower seeds (30ml)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine onion, vinegar, and sugar in a small bowl and turn to coat. Set aside for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, toss cucumbers with a large pinch of salt. Transfer to a strainer, set it back over the bowl, and set aside to drain for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine yogurt, lemon juice, chopped dill, chopped mint leaves, and olive oil in a medium bowl. When the cucumbers are drained, pour drained liquid into the yogurt mixture and stir to combine. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To construct the salad, place the chickpeas on the bottom of a large serving bowl. Add endive, spreading it into an even layer, followed by cucumber. Add onion, discarding any excess vinegar that isn't sticking to their surface. Add celery and radishes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the yogurt mixture on top of the salad, spreading it with the back of a spoon or <a href=\"https://www.amazon.com/Ateco-0-75-Inch-Small-Sized-Spatula/dp/B0000VLEU4/?tag=serieats-20\">a small offset spatula</a> into an even layer. Sprinkle with crumbled cheese. Salad can be made up to a day ahead. Wrap with plastic and store in the refrigerator until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, sprinkle with pomegranate and sunflower seeds. Garnish with mint leaves, dill sprigs, and celery leaves. Serve.</p>"}]}