{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/12/20151201-egg-en-cocotte-vicky-wasik-016.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["brunch", "easy", "egg", "eggs en cocotte", "mushroom", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Mushroom and Gruyère Eggs en Cocotte", "link": "https://www.seriouseats.com/recipes/2016/01/mushroom-gruyere-eggs-en-cocotte-recipe.html", "description": "These easy, individually baked eggs start with a base layer of mushroom <em>duxelles</em> and are topped with a coating of melted Gruyère cheese. The duxelles is made by sautéing minced mushrooms, shallots, and garlic in butter with thyme until they've released all their liquid and then browned and deepened in flavor. A splash of cream adds a silky richness.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Easter", "Eggs", "Father's Day", "Mushrooms", "Vegetarian"], "recipeIngredient": ["10 ounces (280g) cremini mushrooms, woody stems trimmed and caps roughly chopped", "1 medium shallot, roughly chopped", "1 medium clove garlic, roughly chopped", "2 tablespoons unsalted butter (1 ounce; 30g), plus more for greasing ramekins", "1 teaspoon (5ml) fresh thyme leaves, minced", "2 tablespoons (30ml) heavy cream, plus more for drizzling into each ramekin", "Kosher salt and freshly ground black pepper", "4 large eggs", "2 ounces (55g) grated Gruyère cheese", "Boiling water", "Minced flat-leaf parsley leaves and tender stems, for garnish", "Toasted bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (175&deg;C). In a food processor, process mushrooms, shallot, and garlic until finely chopped, 6 to 8 short pulses.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, melt butter over medium heat until foaming. Add mushroom mixture and minced thyme and cook, stirring frequently, until mushrooms' water releases and cooks off and mushrooms begin to darken and brown, about 15 minutes total. Stir heavy cream into mushrooms and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grease 4 (4-ounce) ramekins with butter. Lightly sprinkle salt on the bottom and side of each ramekin. Scoop enough mushroom duxelles to form a thin, even layer on the bottom of each ramekin. Form a circular depression in the center of the mushroom duxelles in each ramekin. (This will help cradle the egg yolk and keep it centered.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently slide an egg into each ramekin. Drizzle a small amount of cream around each egg, then season with salt and pepper. Top each egg with a light layer of grated cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place ramekins in a baking dish and transfer to oven. Carefully pour enough boiling water into baking dish to submerge ramekins 3/4 of the way. Bake eggs en cocotte until whites are just set and yolks are still jiggly, about 15 minutes. Very carefully remove baking dish from oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a very thin metal spatula and tongs, lift each ramekin out of the hot water. Set ramekins on a clean kitchen towel to dry bottoms, then transfer to plates. Garnish with parsley and serve right away with toasts.</p>"}]}