{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160329-schug-yemenite-hot-sauce-falafel-recipe-02-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Middle Eastern", "keywords": ["condiment", "easy", "falafel", "hot sauce", "israeli", "middle eastern", "quick", "sauce", "schug", "yemenite", "zhug"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7272727272727", "ratingCount": "11"}, "name": "Zhug (Yemenite Hot Sauce With Cilantro and Parsley)", "link": "https://www.seriouseats.com/recipes/2016/03/schug-zhug-srug-yemenite-israeli-hot-sauce-recipe.html", "description": "This Yemenite sauce is fresh and bright from herbs, while also having an intensely spicy kick to it. It's the ideal accompaniment for falafel or <em>sabich</em> sandwiches, but it also goes great with a variety of grilled vegetables, fish, meat, and eggs. And it should last a few weeks in the fridge (though I've never had a jar linger long enough to actually find out).", "totalTime": "10 minutes", "recipeYield": "Makes about 1 cup", "recipeCategory": ["Condiments and Sauces", "Dairy-Free", "Middle Eastern", "Vegan", "Vegetarian"], "recipeIngredient": ["1/4 teaspoon whole coriander seed", "1/2 teaspoon whole cumin seeds", "1/4 teaspoon freshly ground black pepper", "3 green cardamom pods, small internal seeds only, toasted (optional)", "4 medium cloves garlic, roughly chopped", "4 to 6 fresh Thai bird chilies, red or green (to taste), roughly chopped; or 4 dried <em>chiles de árbol</em>, stemmed, seeded, and torn into fine pieces", "1 teaspoon kosher salt, plus more to taste", "2 ounces fresh parsley and cilantro leaves and fine stems (about 2 loosely packed cups of mixed herbs)", "1/2 cup (120ml) extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine coriander seed, cumin, black pepper, and cardamom seeds (if using) in a mortar and pestle and grind into a powder using a firm, circular motion. Add garlic, chilies, and salt and pound into a rough paste. Add cilantro and parsley one small handful at a time and continue pounding into a rough paste. (By the time you're done, there should be no pieces of chilies or herbs larger than 1/8 inch remaining.) Pounding constantly, slowly drizzle in olive oil to form an emulsion. Season to taste with more salt. Zhug can be served immediately or stored in an airtight container in the refrigerator for several weeks.</p>"}]}