{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161205-rolled-sugar-cookies-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "baking", "Christmas", "cookie", "cutout", "rolled", "sugar cookie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Rolled Sugar Cookie Cutouts", "link": "https://www.seriouseats.com/recipes/2016/12/rolled-sugar-cookie-recipe.html", "description": "These tender sugar cookies owe their richness and shelf life to a blend of butter and coconut oil, which also helps amplify the vanilla taste.", "totalTime": "3 hours", "recipeYield": "Makes 36 (3-inch) cookies or 70 (1 1/2–inch) cookies (see note)", "recipeCategory": ["Christmas", "Cookies"], "recipeIngredient": ["4 ounces unsalted butter (8 tablespoons; 115g), pliable but cool, about 60°F (16°C)", "3 1/2 ounces refined coconut oil (about 1/2 cup; 100g), firm but creamy, about 70°F (21°C)", "8 ounces sugar (about 1 cup plus 2 tablespoons; 225g)", "1 1/4 teaspoons (5g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1/4 ounce vanilla extract (1 1/2 teaspoons; 7g)", "1 vanilla bean, split and scraped, pod reserved for another use (optional)", "1/4 teaspoon baking powder", "1/8 teaspoon baking soda", "1/8 teaspoon almond extract", "1 large egg, straight from the fridge (about 1/34 ounces; 50g)", "12 1/2 ounces all-purpose flour (about 2 1/2 cups; 355g), plus more for dusting", "Powdered sugar, for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine butter, coconut oil, sugar, salt, vanilla extract, vanilla seeds (if using), baking powder, baking soda, and almond extract in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then increase speed to medium and beat until fluffy and light, about 5 minutes. Pause to scrape the bowl with a flexible spatula, then beat a minute more. In chilly winter months, this process may take longer (see our <a href=\"https://www.seriouseats.com/2018/01/how-to-troubleshoot-winter-baking-projects.html\">guide to winter baking</a> for more info).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer running, crack in the egg and continue beating until smooth. Reduce speed to low, add flour, and mix until dough begins to gather around the paddle but the flour hasn't quite disappeared. Fold once or twice with a flexible spatula to ensure the dough is well combined. Divide in half and proceed to the next step, or wrap in plastic and refrigerate up to 1 week. Refrigerated dough should be left to stand at room temperature until soft and pliable, then lightly kneaded to restore its plasticity before rolling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to bake, adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). On a generously floured surface, roll a portion of the dough to a thickness of 1/4 inch; check with a ruler to make sure your dough isn't too thin, or else the finished cookies will be more inclined to break. Slide an offset spatula underneath the dough to loosen. Cut with assorted cookie cutters and transfer to a parchment-lined half-sheet pan, leaving at least an inch of space in between cookies. Knead scraps together, then roll and cut as before. Repeat with remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to oven to bake. For soft cookies, bake until puffed and firm but perfectly pale, about 12 minutes. For crisp cookies, continue baking until pale gold around the very edges, about 3 minutes more. Let the cookies cool to room temperature directly on the sheet pan, about 30 minutes. The true flavor and texture of the cookies will take another 30 minutes to develop. If you like, finish with a dusting of powdered sugar, or decorate with my favorite not-too-sweet <a href=\"http://www.seriouseats.com/2016/12/how-to-make-better-royal-icing-for-cookies.html\">Royal Icing</a> (full decorating tutorial <a href=\"http://www.seriouseats.com/2016/12/decorating-cookies-with-royal-icing-tutorial.html\">here</a>). Store in an airtight container up to 1 week at room temperature.</p>"}]}