{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/11/74d4c32bdebe11416870f5bc1ecec539.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "cinnamon", "nutmeg", "pastry", "pie", "sweet potato", "thanksgiving"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8666666666667", "ratingCount": "15"}, "name": "Silky Sweet Potato Pie", "link": "https://www.seriouseats.com/recipes/2016/11/sweet-potato-pie-recipe.html", "description": "Sweet potato pie is a Southern staple, fragrant with cinnamon, nutmeg, and vanilla. Most versions pair roasted sweet potatoes with evaporated milk, but my DIY approach simmers  them with whole spices in milk and cream. By the time the potatoes are fall-apart tender, the dairy will have fully condensed, enriching the silky custard with notes of toffee and spice. Thanks to my rich, high-moisture crust, you never have to worry about a soggy pie; even under the custard, it will stay flaky and crisp for days.", "totalTime": "2 hours (with a prebaked crust)", "recipeYield": "Serves 12", "recipeCategory": ["Baking", "Christmas", "Fall", "Pies, Tarts, and Crumbles", "Puddings and Custards", "Sweet Potatoes and Yams", "Thanksgiving", "Winter"], "recipeIngredient": ["16 ounces peeled, roughly diced sweet potatoes (3 1/3 cups; 455g), from 2 medium sweet potatoes (see note)", "1 vanilla bean, split and scraped, seeds reserved for <a href=\"http://www.seriouseats.com/recipes/2016/11/brown-sugar-whipped-cream-recipe.html\">whipped cream topping</a>", "2 or 3 cinnamon sticks (about 6 inches total)", "1 whole nutmeg (see note)", "26 ounces milk (3 1/4 cups; 740g), any percentage will do", "6 ounces heavy cream (3/4 cup; 170g)", "7 ounces white or <a href=\"http://www.seriouseats.com/recipes/2016/05/dry-toasted-sugar-granulated-caramel-recipe.html\">lightly toasted</a> sugar (1 cup; 195g)", "1 tablespoon ground cinnamon", "1 teaspoon freshly grated nutmeg (see note)", "1/2 teaspoon Diamond Crystal kosher salt; use half as much if iodized", "1/2 ounce vanilla extract (1 tablespoon; 14g)", "3 large eggs", "<a href=\"http://www.seriouseats.com/recipes/2016/06/old-fashioned-flaky-pie-dough-recipe.html\">Old-Fashioned Flaky Pie Dough</a>, prepared as for a <a href=\"http://www.seriouseats.com/2016/10/how-to-blind-bake-a-pie-crust.html\">blind-baked pie</a>", "<a href=\"http://www.seriouseats.com/recipes/2016/11/brown-sugar-whipped-cream-recipe.html\">Brown Sugar Whipped Cream</a> (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 3-quart stainless steel saucier, combine sweet potatoes, empty vanilla pod, cinnamon sticks, whole nutmeg, milk, cream, and sugar. If you have a scale, write down the weight of the saucier and combined ingredients so you can precisely measure the reduction.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil over high heat, then adjust to medium-low and maintain a gentle simmer (higher heat may cause the milk to curdle). Scrape frequently with a flexible spatula to prevent milk solids from building up around the side, and simmer until sweet potatoes are fall-apart tender and dairy has condensed into a thick sauce, about 55 minutes. The saucier should weigh 19 ounces (535g) less than when you started. (Alternatively, total volume, including cooked sweet potato, should be 3 2/3 cups when finished.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat to 350&deg;F (177&deg;C). Remove vanilla bean and spices from saucier and purée sweet potato and dairy mixture with an immersion blender until smooth. (If needed, transfer to a smaller container to avoid splashing.) Whisk in ground cinnamon, grated nutmeg, salt, and vanilla, followed by eggs. If you like, strain through a fine-mesh strainer before pouring into prepared pie crust. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake pie until gently set in the middle (with an internal temperature of 195&deg;F or 91&deg;C), about 40 minutes. Cool at least 20 minutes before slicing with a chef's knife, pausing to wipe the blade clean as needed. If desired, serve with dollops of Brown Sugar Whipped Cream. Wrapped in plastic, sweet potato pie will keep up to 3 days at cool room temperature. </p>"}]}