{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/01/20160105-guinness-beef-stew-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["beef", "beef stew", "beer", "braise", "irish", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2307692307692", "ratingCount": "13"}, "name": "Rich and Flavorful Guinness Beef Stew With Potatoes", "link": "https://www.seriouseats.com/recipes/2016/01/irish-guinness-beef-stew-recipe.html", "description": "Irish beef stew made with Guinness is a pub classic, but the truth is that Guinness loses a lot of its already-mild roasted flavor during the time it takes to cook a stew. This version fixes that by reinforcing the beer's flavors.", "totalTime": "3 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Beef", "Beef Stew", "Braising and Stewing", "Mains"], "recipeIngredient": ["1 cup (250ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium broth (see note)", "4 packets unflavored powdered gelatin (3 tablespoons plus 1 teaspoon; 30g) (see note)", "4 tablespoons (60ml) vegetable oil, divided", "3 pounds (1.25kg) whole boneless beef chuck roast, cut into 3 steaks", "Kosher salt and freshly ground black pepper", "1 1/4 pounds carrots (500g; about 3 large carrots), 1/2 pound (250g) peeled and split lengthwise, 3/4 pound (350g) cut into large dice (about 1 1/2 cups)", "6 ounces parsnips (175g; about 2 small), half peeled and split lengthwise, half cut into large dice (about 1/2 cup)", "1 pound yellow onions (500g; about 4 medium), half peeled and split in half through the root, half cut into large dice (about 1 cup)", "4 medium cloves garlic, lightly crushed", "1/4 cup (60ml) espresso or strong brewed coffee", "1 ounce (30g) bittersweet chocolate", "2 (15-ounce) cans Guinness Draught beer (900ml)", "1 bouquet garnis (about 4 sprigs thyme, 3 sprigs parsley, and 1 bay leaf, tied together with kitchen twine)", "1 tablespoon (15ml) Asian fish sauce", "1 tablespoon (15ml) soy sauce ", "1 tablespoon (15ml) Worcestershire sauce ", "2 tablespoons (20g) all-purpose flour ", "8 ounces small waxy potatoes (225g; about 20), such as baby Yukon Golds", "Minced flat-leaf parsley leaves and tender stems, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F (150&deg;C). Pour chicken stock into a medium bowl and sprinkle gelatin evenly all over surface, allowing each packet's worth of gelatin to soak up stock before sprinkling next one on (if the gelatin clumps instead of dissolving evenly, you can use a blender to fix it). Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven, heat 2 tablespoons (30ml) oil over medium-high heat until shimmering. Season beef all over with salt and pepper and add to Dutch oven. Cook, turning occasionally, until beef is well browned on 2 sides, about 10 minutes. Transfer beef to a rimmed baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add split carrots, split parsnip, halved onions, and garlic to Dutch oven and cook, turning occasionally, until lightly browned, about 4 minutes; lower heat if browned bits on bottom of Dutch oven threaten to burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape chicken stock and all gelatin into Dutch oven. Add coffee, chocolate, Guinness, bouquet garnis, fish sauce, soy sauce, and Worcestershire sauce and bring to a simmer, then lower heat to maintain simmer. Meanwhile, cut beef into 2-inch chunks and transfer to a large mixing bowl. Add flour and stir until beef is evenly coated in a floury paste. Add beef and any accumulated juices to Dutch oven. Transfer to oven, cover with lid partially open, and cook for 1 hour, stirring every 30 minutes. Add potatoes and continue to cook until beef is starting to become tender, about 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large skillet, heat remaining 2 tablespoons (30ml) oil. Add diced carrot, parsnip, and onion and cook, stirring occasionally, until lightly browned, about 5 minutes. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove stew from oven. Using tongs, fish out and discard large pieces of carrot, parsnip, and onion. Discard bouquet garnis. Using a ladle, skim off and discard accumulated fat on surface. Add reserved sautéed diced vegetables to stew, return to oven, and cover with lid slightly cracked. Continue to cook until beef and potatoes are tender, about 45 minutes longer, removing lid for last 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove stew from oven. If serving right away, skim off any additional fat from surface. Season with salt and pepper, if needed. Allow to cool slightly before serving, then serve topped with parsley. If making ahead, cool down stew, then chill in refrigerator; remove solid fat cap from surface once fully chilled. Reheat stew on the stovetop or in a low oven.</p>"}]}