{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160518-red-curry-marinated-halibut-vinaigrette-easy-summer-recipe-04.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["curry", "easy", "fish", "grill", "halibut", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Red Curry-Rubbed Grilled Halibut With Curry Vinaigrette", "link": "https://www.seriouseats.com/recipes/2016/06/red-curry-rubbed-grilled-halibut-recipe.html", "description": "The big ol' batch of red curry paste I had in my fridge was something I'd originally made for my <a href=\"http://www.seriouseats.com/recipes/2016/03/phat-phrik-khing-with-tofu-long-beans-dry-fry-thai-curry-vegan-recipe.html\"><em>phat phrik khing</em> recipe</a>, but there's only so much stir-fried green beans and tofu one can eat. So, the other night, I came up with a new approach: using it as both a marinade and the base for a sauce for grilled halibut.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Fish", "Mains", "Quick Dinners", "Thai"], "recipeIngredient": ["<strong>For the Curry Paste:</strong>", "3 dried <em>guajillo</em>, California, or <em>pasilla</em> chilies, stemmed and seeded (20g)", "3 medium cloves garlic, roughly chopped (15g)", "1 medium shallot, peeled and roughly chopped (30g)", "1 to 3 fresh red Thai bird chilies (to taste), roughly chopped", "1/2 large bunch cilantro stems (about 1/2 ounce; 15g), roughly chopped", "1 stalk fresh lemongrass, bottom 3 to 5 inches only (40g), tough outer leaves removed and discarded, tender core thinly sliced", "1 (1-inch) knob ginger, peeled", "1/2 teaspoon (2g) freshly ground white or black pepper", "Kosher salt", "<strong>For the Fish:</strong>", "4 tablespoons (60ml) extra-virgin olive oil, divided", "1 tablespoon (15ml) fresh juice from 1 lemon", "1/4 cup (60g) chopped fresh mint and/or cilantro, plus more for garnish if desired", "4 (5- to 6-ounce) halibut fillets (see note)", "Nonstick spray or vegetable oil, for greasing grill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Curry Paste:</strong> Place dried chilies in a heatproof container and cover with boiling water. Cover and set aside for 10 minutes, then drain. Place rehydrated chilies, garlic, shallot, Thai chilies, cilantro, lemongrass, ginger, ground pepper, and 1/2 teaspoon salt in the jar of a blender or food processor. Process until a paste is formed, adding water 1 tablespoon at a time if the mixture is too thick. Season to taste with more salt (the mixture should be quite salty). Curry paste can be made several days in advance and stored in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fish:</strong> In a large bowl, whisk together 3 tablespoons (45ml) curry paste with 3 tablespoons (45ml) olive oil, plus lemon juice. Add mint and/or cilantro and whisk to combine. Thin mixture with water, 1 teaspoon at a time, until a chunky but loose texture is achieved. Season to taste with salt and pepper and set aside. This will be the sauce for the cooked fish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine remaining curry paste with remaining 1 tablespoon (15ml) olive oil. Add fish and turn to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 2/3 chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate, rubbing several coats of oil onto the grates.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add fish to the hot side of grill and let cook with the lid down until first side is well marked and fish releases relatively easily when lifted with a thin metal spatula, 3 to 5 minutes. Turn fish and brush or spoon some of sauce on top. Cook on second side until fish is just cooked through and registers 140&deg;F at its coolest point on an instant-read thermometer, 3 to 5 minutes longer. Fish should show no resistance when a thin metal skewer is inserted, and the flesh should flake easily. Serve immediately, spooning sauce over fish and spreading it over the surface with the back of a spoon. Sprinkle with additional herbs if desired.</p>"}]}