{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160826-sous-vide-halibut-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["fish", "halibut", "low carb", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Butter-Basted Sous Vide Halibut", "link": "https://www.seriouseats.com/recipes/2016/09/sous-vide-seared-halibut-recipe.html", "description": "Halibut aren't terribly fun to fish (think: reeling up a 200-pound bath mat through hundreds of feet of icy-cold water), but man, are they delicious! Firm yet flaky, with a heartier texture and flavor than other widely available white fish on the market. Halibut cooks more like a thick steak&mdash;well-browned and -crusted on the outside, with a juicy, tender center. And, just like with <a href=\"http://www.seriouseats.com/2015/06/food-lab-complete-guide-to-sous-vide-steak.html\">a steak</a>, cooking sous vide can help you nail that medium-rare center every time. Here's how to do it.", "totalTime": "About 1 hour 15 minutes, or up to overnight", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Fish", "Gluten-Free", "Mains", "Sous Vide", "The Food Lab"], "recipeIngredient": ["4 halibut fillets, about 6 ounces (170g) each", "Kosher salt and freshly ground black pepper", "Fresh herbs, such as thyme, parsley, or dill (optional)", "Aromatics, such as sliced shallots or grated citrus zest (optional)", "4 tablespoons (55g) unsalted butter, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season halibut generously on all sides with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place halibut portions in a single layer inside 1 or more zipper-lock bags. Divide 2 tablespoons butter evenly between bags. Add some gentle aromatics if desired, such as thyme, parsley, or dill; thinly sliced shallots; or grated citrus zest. (Do not add large chunks of food, which can damage the shape of the fish, or acidic ingredients, which damage the texture.) Close bag(s) and let halibut rest in the refrigerator for at least 30 minutes and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the temperature on your sous vide cooker according to the <a href=\"#chart\">chart</a> and allow it to preheat while halibut rests. Remove all air from bag(s) using the <a href=\"http://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">water displacement method</a>, then add bagged halibut to preheated water bath. Cook for 30 to 45 minutes for 1-inch fillets, or 45 minutes to an hour for fillets up to 2 inches thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove halibut from bag(s) using your hands or a fish spatula. Place it on a double layer of paper towels, then use another paper towel to gently blot surface dry. Discard aromatics, if used, and remove and discard halibut skin.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 2 tablespoons butter in a heavy skillet over medium-high heat until foaming subsides. Carefully add halibut, presentation side down, and cook, without moving, until lightly browned, 30 to 45 seconds. (You can sear between 1 and 4 pieces at a time.) Add aromatics if desired, such as thyme, garlic, and shallots, and continue to cook, tilting pan and basting halibut with the hot butter, until first side is well browned, about 1 1/2 minutes total. Flip and let second side brown for 15 to 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer halibut to a paper towel to blot off excess fat. Serve immediately.</p>"}]}