{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160623-cuban-roast-pork-mojo-recipe-01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Latin American", "keywords": ["Cuban", "easy", "Latin American", "low carb", "pork", "roast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "6"}, "name": "Cuban-Style Roast Pork Shoulder With Mojo", "link": "https://www.seriouseats.com/recipes/2016/06/cuban-roast-pork-shoulder-mojo-recipe.html", "description": "The first time I cooked a Cuban-style pork shoulder, what came out of the oven had a glistening, charred, crisp crust, but as soon as I started carving, I realized that the stuff was rubber. It wasn't until several years later that I tasted Cuban <em>mojo</em>-marinated roast pork as it <em>should</em> be: juicy, succulent, intensely porky, and melt-in-your-mouth tender. That's when I decided to work on my own recipe.", "totalTime": "6 to 7 hours, or up to overnight with optional refrigeration", "recipeYield": "Serves 6 to 10", "recipeCategory": ["Caribbean", "Dairy-Free", "Latin American", "Mains", "Pork", "Roasting", "The Food Lab"], "recipeIngredient": ["<strong>For the Mojo:</strong>", "8 medium cloves garlic, minced", "2 teaspoons (8g) ground cumin ", "2 teaspoons (8g) freshly ground black pepper", "1/4 cup (about 1 small handful) minced fresh oregano leaves", "1/2 cup (120ml) fresh juice from 1 to 2 oranges (see note)", "1/4 cup (60ml) fresh juice from 3 to 4 limes (see note)", "1/4 cup (60ml) extra-virgin olive oil", "Kosher salt", "<strong>For the Pork and to Finish:</strong>", "1 (6- to 8-pound; 3 to 3.5kg) boneless pork shoulder roast, rind removed", "1/4 cup (about 1 small handful) finely chopped fresh mint leaves", "3 tablespoons (about 3 very large pinches) finely chopped fresh oregano leaves", "Lime wedges, for serving", "Steamed rice, <a href=\"http://www.seriouseats.com/recipes/2014/09/the-lazy-cooks-black-beans-easy-recipe.html\">black beans</a>, and <em><a href=\"http://www.seriouseats.com/recipes/2013/03/maduros-mint-mojo-fried-plantains-vegan-recipe.html\">maduros</a></em>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mojo:</strong> Combine garlic, cumin, pepper, oregano, orange juice, lime juice, and olive oil in a large bowl and whisk. Season to taste generously with salt. Transfer half of mojo to a sealed container and reserve in the refrigerator. Add pork to remaining mojo and turn to coat. If desired, transfer pork and marinade to a gallon-sized zipper-lock bag and refrigerate 2 hours or up to overnight before continuing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pork and to Finish:</strong> Adjust oven rack to lower-middle position and preheat oven to 275&deg;F. Line a rimmed baking sheet with a double layer of heavy-duty aluminum foil. Place pork and juices on top and fold up foil, crimping to seal loosely but making sure that there is room for air to circulate inside. Place in oven and roast for 3 hours. Fold back foil, increase oven temperature to 325&deg;F, and continue roasting, basting pork with pan juices occasionally, until pork shows almost no resistance when a metal skewer or knife is inserted into it and the surface is crackly and brown, 2 to 3 hours longer. Remove pork from oven and let rest for 10 to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour accumulated pork juices into a bowl and discard all except 1 cup. Add reserved mojo to pork drippings, along with fresh chopped mint and oregano. Whisk together and season to taste with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve pork by slicing or shredding, passing mint mojo and lime wedges on the side. Serve rice and plantains on the side. Reserve any leftovers for sandwiches.</p>"}]}