{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/04/20160418-american-omelet-ham-and-cheese-21.JPG", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "American", "keywords": ["breakfast", "brunch", "cheese", "diner", "easy", "egg", "ham", "low carb", "omelette", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Diner-Style Ham and Cheese Omelette for Two", "link": "https://www.seriouseats.com/recipes/2016/04/diner-style-ham-and-cheese-omelette-for-two-recipe-food-lab.html", "description": "Just as with scrambled eggs, the method by which the eggs are heated and stirred is the primary factor that determines what kind of omelette you end up with. This is my basic technique for diner-style omelettes with large, tender, browned curds and plenty of space for fillings.", "totalTime": "15 minutes", "recipeYield": "Serves 2", "recipeCategory": ["American", "Breakfast and Brunch", "Cheese", "Father's Day", "Ham", "Mother's Day", "Omelettes", "The Food Lab"], "recipeIngredient": ["4 or 5 large eggs", "Kosher salt and freshly ground black pepper", "Small bunch chopped chives, tarragon, or parsley", "2 tablespoons (25g) unsalted butter, divided", "4 ounces (110g) ham steak, diced", "2 to 3 ounces (80g) grated cheddar cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine eggs, salt, pepper, and herbs in a medium bowl and whisk until homogeneous and frothy, about 1 minute. Allow to rest at room temperature for 10 to 15 minutes. The eggs should darken in color significantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 1 tablespoon butter in a 10-inch nonstick skillet over medium heat, swirling, until lightly browned. Add ham and cook, stirring frequently, until it has begun to brown on the edges, about 3 minutes. Transfer ham to a small bowl, add cheese, and toss to combine. Wipe out skillet with a paper towel and return it to medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 1 tablespoon butter to pan and cook until lightly browned. Re-whisk eggs until foamy, then add to skillet and cook, using a silicone spatula to push the edges in toward the center as they set and tilting the pan to spread the uncooked egg underneath. Continue pushing in the edges of the eggs and tilting the skillet, working all around the pan, until omelette is almost set, about 45 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle ham and cheese over half of omelette, remove from heat, cover, and let omelette sit until it reaches the desired consistency, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using silicone spatula, loosen the edges of the omelette from skillet and shake skillet to ensure that it's not stuck. Carefully fold omelette in half, then slide it onto a serving plate and serve immediately.</p>"}]}