{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/07/20160719-omurice-vicky-wasik-17.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "chicken", "easy", "egg", "fried rice", "gluten free", "Japanese", "omelette", "quick", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Japanese Omelette-Topped Ketchup Fried Rice With Chicken (<em>Omurice</em>)", "link": "https://www.seriouseats.com/recipes/2016/08/japanese-omelette-chicken-ketchup-fried-rice-omurice-recipe.html", "description": "<em>Omurice</em>, or fried rice topped with an omelette, is as easy to make at home as it is addictive. In this recipe, we fry the rice with onion, carrot, and diced chicken, then toss it with an unlikely ingredient&mdash;ketchup&mdash;to form a flavorful glaze.", "totalTime": "30 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Chicken", "Fried Rice", "Gluten-Free", "Japanese", "Mains", "Omelettes", "Quick and Easy", "Quick Dinners"], "recipeIngredient": ["2 cups cooked white sushi rice (12 ounces; 350g); see note", "5 tablespoons (75ml) vegetable or canola oil, divided", "1/2 cup minced yellow onion (100g; about 1/2 medium onion)", "1/2 cup diced carrot (100g; about 1 large carrot)", "3 ounces diced skinless, boneless chicken thigh (80g; about 1/2 cup)", "1/4 cup ketchup (60ml), thinned with 1 tablespoon (15ml) water, plus more ketchup for serving", "1 scallion, thinly sliced", "Kosher salt and freshly ground black pepper", "4 large eggs, beaten with a pinch of salt", "Kewpie mayonnaise, for serving (optional; see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using day-old rice, transfer to a medium bowl and break rice up with your hands into individual grains before proceeding. Heat 1 tablespoon (15ml) vegetable oil in a 10-inch carbon steel or nonstick skillet over high heat until lightly smoking. Add half of rice and cook, stirring and tossing, until rice is pale brown and toasted and has a lightly chewy texture, about 3 minutes. Transfer to a medium bowl. Repeat with another tablespoon (15ml) oil and remaining rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 more tablespoons (30ml) oil to skillet, return to high heat, and heat until smoking. Add onion and carrot and cook, stirring and tossing, until just tender and lightly browned in spots, about 3 minutes. Add chicken and cook, stirring, until cooked through and starting to lightly brown, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return rice to pan and toss until well combined with vegetables. Add thinned ketchup and cook, stirring and tossing, until ketchup sauce is reduced and each grain of rice is separate and coated in a shiny sheen of ketchup. Toss in scallion, then season with salt and pepper. Scrape rice mixture into a small heatproof bowl, packing it down. Invert a serving plate on top of the bowl of rice, then rotate both so that bowl is sitting inverted on top of plate. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet with a paper towel and return to medium-high heat. Add remaining 1 tablespoon (15ml) oil and heat until shimmering. Add eggs and stir rapidly with a spatula, while shaking pan to agitate eggs; make sure to move spatula all around pan to break up curds and scrape them from bottom of skillet as they form. Stop stirring as soon as eggs are very softly scrambled and creamy (but still loose enough to come together into a single mass), 1 to 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using spatula, gently spread egg in an even layer around skillet and scrape down any wispy bits around the edges. The top surface should be loose and creamy, but if it looks too liquid and raw, let cook, undisturbed, for another few seconds. (If it still flows, you can swirl skillet to send loose egg to the edges, where it will set more quickly.) Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift bowl from rice; rice should hold a mound-like form. Slide open-face omelette on top of rice mound. Garnish with a squeeze of ketchup and Kewpie mayonnaise, if using. Serve right away.</p>"}]}