{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/07/20160710-scrapcook-pork-fried-rice-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "corn", "easy", "fried rice", "ham", "pork", "quick", "rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Quick and Easy Pork Fried Rice With Corn and Shishito Peppers", "link": "https://www.seriouseats.com/recipes/2016/07/quick-easy-pork-fried-rice-corn-shishito-pepper-recipe.html", "description": "Fried rice is like the hash of dinnertime. It's the easiest and tastiest way to cleanse your fridge of leftovers. A couple of weeks back, my fridge happened to be full of leftover sous vide pork tenderloin. It's also summer, which means that I have a near-endless supply of corn and <em>shishito</em> peppers in my fridge at all times (those two are <em>fantastic</em> partners in crime). Put it all together, and what do you get? This simple pork fried rice with charred corn and peppers.", "totalTime": "15 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Chinese", "Corn", "Fried Rice", "Ham", "Mains", "Pork", "Quick Dinners"], "recipeIngredient": ["2 cups cooked white rice (12 ounces; 350g) (see note) ", "2 1/2 tablespoons (40ml) vegetable or canola oil, divided", "6 ounces (170g) fresh corn kernels, cut from 1 to 2 ears of corn", "2 scallions, sliced, whites and greens reserved separately (1 ounce; 30g)", "12 shishito peppers, thinly sliced, or 1 green bell pepper, finely diced (about 6 ounces; 170g)", "6 ounces (170g) leftover roast pork or ham, finely diced", "1 teaspoon (5ml) soy sauce ", "1 teaspoon (5ml) toasted sesame oil", "Kosher salt", "Ground white pepper", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using day-old rice, transfer to a medium bowl and break rice up into individual grains with your hands before proceeding. Heat 1/2 tablespoon vegetable oil in a large wok over high heat until smoking. Add half of rice and cook, stirring and tossing, until rice is pale brown and toasted and has a lightly chewy texture, about 3 minutes. Transfer to a medium bowl. Repeat with another 1/2 tablespoon oil and remaining rice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return wok to heat and add 1/2 tablespoon oil. Add corn and cook, stirring occasionally, until lightly charred on several surfaces, about 4 minutes. Transfer to bowl with rice and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return all rice and corn to wok and press it up the sides, leaving a space in the middle. Add 1/2 tablespoon oil to the space. Add scallion whites, peppers, and pork and cook, stirring gently, until lightly softened and fragrant, about 1 minute. Toss with rice to combine. Add soy sauce and sesame oil and toss to coat. Season to taste with salt and white pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push rice to the side of wok and add remaining 1/2 tablespoon oil. Break egg into oil and season with a little salt. Use a spatula to scramble egg, breaking it up into small bits. Toss egg and rice together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add scallion greens and toss to combine. Serve immediately.</p>"}]}