{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160929-manicotti-pasta-style-recipe-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["baked pasta", "Italian", "italian american", "manicotti", "pasta", "ricotta", "spinach", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Spinach and Ricotta Manicotti", "link": "https://www.seriouseats.com/recipes/2016/10/spinach-and-ricotta-manicotti-recipe.html", "description": "Spinach and ricotta manicotti is one of those dishes that are edible&mdash;dare I say, enjoyable&mdash;even under the most inauspicious of circumstances (think: cafeteria steam tables). So how great would it be if you optimized every ingredient and served it fresh from the oven? (Hint: really, really great.)", "totalTime": "2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cheese", "Italian", "Mains", "Pasta", "Spinach", "Tomato", "Vegetables", "Vegetarian", "Winter"], "recipeIngredient": ["1 pound (450g) high-quality ricotta cheese (see note)", "Kosher salt", "1 pound fresh <a href=\"http://www.seriouseats.com/recipes/2015/01/fresh-egg-pasta.html\">homemade</a> or store-bought lasagna noodles, cut into twelve 4- by 4-inch squares, or 6 sheets no-boil dry lasagna noodles", "8 ounces (225g) fresh spinach, washed", "8 ounces (225g) fresh arugula, washed", "12 ounces (340g) shredded low-moisture mozzarella cheese, divided", "4 ounces (120g) grated Parmigiano-Reggiano, divided", "1 large egg", "1 medium clove garlic, minced", "1 teaspoon freshly grated nutmeg", "Freshly ground black pepper", "2 cups (480ml) tomato sauce, such as <a href=\"http://www.seriouseats.com/recipes/2014/09/easy-italian-amercian-red-sauce-recipe.html\">Quick and Easy Italian-American Red Sauce</a>, <a href=\"http://www.seriouseats.com/recipes/2014/09/the-best-slow-cooked-italian-american-tomato-sauce-red-sauce-recipe.html\">Slow-Cooked Tomato Sauce</a>, or <a href=\"http://www.seriouseats.com/recipes/2014/08/the-best-fresh-tomato-sauce-for-pasta-recipe.html\">Fresh Tomato Sauce</a>, divided", "Small handful minced fresh parsley or basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 375&deg;F (190&deg;C). Line a large plate or a rimmed baking sheet with a triple layer of paper towels or a clean kitchen towel. Spread ricotta on top and cover with more paper towels or another clean kitchen towel. Let drain for 5 minutes, then remove towels and transfer ricotta to a large bowl. (You may need to use a spatula to scrape all of the ricotta off the towels.) Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using Fresh Pasta:</strong> Bring a large pot of salted water to a boil over high heat. Working in batches, add pasta squares to boiling water, 6 at a time. Cook for 30 seconds, then, using tongs, transfer to a clean kitchen towel to drain, laying them out in a single layer. Repeat until all pasta squares are cooked, reserving boiling water for step 4. Set aside, keeping squares separated from each other. Continue with step 4.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using No-Boil Lasagna Noodles:</strong> Bring a large pot of salted water to a boil over high heat. Place noodles in a 9- by 13-inch casserole dish. Using a ladle, transfer just enough boiling water from the pot to cover noodles. (Keep remaining boiling water to boil spinach and arugula in step 4, adding more if water level gets too low.) Let pasta sit, agitating occasionally, until pliable but not mushy, about 5 minutes. Drain pasta, then dry on a clean kitchen towel. Cut each noodle in half crosswise to make twelve 4- by 4-inch squares of pasta. Set aside, keeping them separated from each other to avoid sticking. Wipe casserole dish dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add spinach and arugula to boiling water and cook just until wilted, about 20 seconds. Drain greens into the bowl of a salad spinner set in the sink. Run under cold water until thoroughly chilled, then spin in salad spinner to dry. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread greens over a clean kitchen towel or a double layer of paper towels and roll into a tight tube, pressing to remove excess moisture. Transfer to a cutting board and roughly chop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add greens to bowl with ricotta. Add half of mozzarella, half of Parmesan, egg, garlic, and nutmeg. Season with a large pinch of salt and a few grinds of black pepper, then fold with a wooden spoon or spatula to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread half of tomato sauce in an even layer in casserole dish. Working with 1 square of pasta at a time, place a few tablespoons of ricotta mixture in a row along the center of the square, then roll it up. Place roll, seam side down, in casserole dish. Continue until all of pasta and filling are used up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon remaining sauce over manicotti, keeping it tidy along the center of each row of rolls. Sprinkle remaining mozzarella cheese over sauce. Sprinkle all over with remaining Parmesan. Cover tightly with foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in oven and bake for 30 minutes. Remove foil and continue baking until cheese is well browned and bubbly, about 15 minutes longer. Remove from oven and let rest for 10 minutes. Sprinkle with parsley or basil and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Manicotti can be prepared through step 8 and refrigerated for up to 3 days before baking. Bake as directed in step 9.</p>"}]}