{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20161007-mint-cumin-mustard-sous-vide-lamb-leg-01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chimichurri", "lamb", "leg of lamb", "low carb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Sous Vide Leg of Lamb With Mint, Cumin, and Black Mustard", "link": "https://www.seriouseats.com/recipes/2016/10/sous-vide-leg-of-lamb-mint-cumin-black-mustard-recipe.html", "description": "A butterflied leg of lamb is ideal for stuffing and rolling with other ingredients, and, because lamb is so robustly flavored on its own, you don't have to be shy or subtle about it. Today we're stuffing a lamb leg with crispy fried mustard seed and cumin seeds, then cooking it sous vide for perfectly foolproof results.", "totalTime": "2 hours 45 minutes to 6 hours 45 minutes", "recipeYield": "Serves 8", "recipeCategory": ["Chimichurri", "Christmas", "Easter", "Gluten-Free", "Lamb", "Mains", "New Year", "Sous Vide", "Spring", "The Food Lab"], "recipeIngredient": ["3 tablespoons (45ml) vegetable or canola oil, divided", "1 tablespoon (12g) whole black mustard seeds", "2 teaspoons (8g) whole cumin seeds", "Kosher salt and freshly ground black pepper", "1/2 butterflied boneless leg of lamb (4 to 5 pounds; 1.8 to 2.2kg) (see note)", "1 ounce (30g) picked fresh mint leaves (about 1 cup), finely chopped", "1 ounce (30g) picked fresh cilantro leaves and tender stems (about 1 cup), finely chopped", "1 small shallot, finely minced", "1 medium clove garlic, finely minced", "1 red jalapeño or Fresno chili, finely minced", "1 tablespoon (15ml) red wine vinegar", "3 tablespoons (45ml) extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons (30ml) vegetable oil in a small skillet over medium-high heat until shimmering. Add mustard and cumin and cook, stirring constantly, until fragrant, about 30 seconds. Immediately transfer to an empty skillet or heatproof bowl and let rest until cool enough to handle. Season mixture generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread half of spice mixture evenly over inside of lamb leg, then carefully roll it back up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Secure lamb leg with butcher's twine at 1- to 1 1/2&ndash;inch intervals, starting from both ends and working toward the center. Season exterior generously with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a sous vide water bath to desired temperature according to chart above. Seal lamb inside a vacuum bag, or a <a href=\"http://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">zipper-lock bag using the water displacement method</a>, then submerge and cook for desired time according to chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make the chimichurri by combining remaining cumin and mustard mixture with mint, cilantro, shallot, garlic, chili, red wine vinegar, and olive oil in a medium bowl. Stir vigorously with a fork and season to taste with salt and pepper. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, remove lamb from bag and carefully pat dry with paper towels. In a cast iron, carbon steel, or nonstick skillet, heat remaining 1 tablespoon (15ml) vegetable or canola oil over high heat until lightly smoking, then add lamb and cook, turning occasionally, until well browned on all sides, about 4 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove twine, slice lamb, and serve immediately with chimichurri.</p>"}]}