{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160802-oyakodon-4.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["chicken", "donburi", "easy", "egg", "Japanese", "quick", "rice", "rice bowl"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "7"}, "name": "Oyakodon (Japanese Chicken and Egg Rice Bowl)", "link": "https://www.seriouseats.com/recipes/2016/08/oyakodon-japanese-chicken-and-egg-rice-bowl-recipe.html", "description": "Super popular both at restaurants and at home, <em>oyakodon</em> (Japanese chicken and egg rice bowl) is sort of like the pizza of Japan&mdash;if pizza were the kind of soul-satisfying comfort food that's easy to make at home, with minimal ingredients, in about 20 minutes. With the intense heat we've been getting on the Peninsula, and my equally intense schedule lately, this kind of quick and easy one-pot rice bowl has been a huge time-saver for me in the kitchen.", "totalTime": "20 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Chicken", "Dairy-Free", "Eggs", "Japanese", "Mains", "Quick Dinners", "Rice"], "recipeIngredient": ["1 cup (240ml) <a href=\"http://www.seriouseats.com/recipes/2016/07/basic-japanese-dashi-recipe.html\">homemade</a> dashi, or the equivalent in <a href=\"https://www.amazon.com/Hon-Dashi-Bonito-Fish-Soup-Stock/dp/B0000CNU0C/?tag=serieats-20\">Hondashi</a> (see note)", "1 tablespoon (15ml) soy sauce, plus more to taste", "2 tablespoons (30ml) dry sake", "1 tablespoon (15g) sugar, plus more to taste", "1 large onion, slivered (about 6 ounces; 170g)", "12 ounces (340g) boneless, skinless chicken thighs, thinly sliced (see note)", "3 thinly sliced scallions, divided", "2 stems mitsuba (optional; see note)", "3 to 4 large eggs (see note)", "<strong>To Serve:</strong>", "2 cups cooked white rice", "Togarashi (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine dashi, soy sauce, sake, and sugar in a small saucepan and bring to a simmer over high heat. Adjust heat to maintain a strong simmer. Stir in onion and cook, stirring occasionally, until onion is half tender, about 5 minutes. Add chicken pieces and cook, stirring and turning chicken occasionally, until chicken is cooked through and broth has reduced by about half, 5 to 7 minutes for chicken thighs or 3 to 4 minutes for chicken breast. Stir in half of scallions and all of mitsuba (if using), then season broth to taste with more soy sauce or sugar as desired. The sauce should have a balanced sweet-and-salty flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to a bare simmer. Beat eggs lightly with chopsticks in a medium bowl. Pour eggs into pot in a thin, steady stream (see note), holding your chopsticks over edge of bowl to help distribute eggs evenly (see video above). Cover and cook until eggs are cooked to desired doneness, about 1 minute for runny eggs or 3 minutes for medium-firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Transfer hot rice to a single large bowl or 2 individual serving bowls. Top with egg and chicken mixture, pouring out any excess broth from saucepan over rice. Add an extra egg yolk to center of each bowl, if desired (see note). Garnish with remaining half of sliced scallions and togarashi. Serve immediately.</p>"}]}