{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161210-shrimp-cakes-nerds-with-knives-emily-matt-clifton-1.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "Thai", "keywords": ["appetizer", "hors d'oeuvre", "shrimp cake", "thai", "thai shrimp cake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thai-Style Shrimp Cakes With Sweet Chili Dipping Sauce", "link": "https://www.seriouseats.com/recipes/2016/12/thai-shrimp-cake-sweet-chili-dipping-sauce-recipe.html", "description": "We love making shrimp cakes as a full dinner&mdash;they're a lot cheaper than crab cakes and work with a good variety of flavor combinations. Here we miniaturize them down to party-appetizer size, combine them with Thai seasonings, and serve with a tangy chili dip.", "totalTime": "60 minutes", "recipeYield": "Makes 12 to 16 shrimp cakes", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "New Year", "Shrimp", "Snacks", "Thai"], "recipeIngredient": ["1 pound (500g) medium or large shrimp, shelled and de-veined", "3 scallions, thinly sliced", "2 medium garlic cloves, minced or grated", "1 jalapeño pepper, seeded and minced", "Large handful fresh cilantro leaves and tender stems (plus extra for garnish)", "Finely grated zest of 1 lime", "Kosher salt", "1 tablespoon (15ml) mayonnaise", "2 tablespoons (20g) cornstarch", "1 large egg white", "1/4 to 1/2 cup (100 to 200g) panko-style breadcrumbs", "Peanut or canola oil, for frying", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/04/thai-style-sweet-chili-dipping-sauce-recipe.html\">Sweet Chili Dipping Sauce</a> (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coarsely chop shrimp into 1/2-inch pieces. Set aside. Reserve a few tablespoons of sliced scallion greens for serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine garlic, jalapeño, remaining scallions, cilantro, lime zest, and a large pinch of salt in the bowl of a food processor. Pulse until everything is finely minced. Add half of the shrimp, the mayo, the cornstarch, and the egg white. Pulse until the mixture forms a coarse paste, about 5 or 6 pulses. Add the remaining shrimp and pulse two or three times to combine everything. Some of the shrimp will be chunkier.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the mixture to a bowl and add 1/4 cup of the panko breadcrumbs. Fold in with a spatula or your hands. The mixture should be soft and should just hold its shape if you form a ball. If it’s too soft, add more breadcrumbs a little at a time until a ball just holds together. It will stiffen up more when it gets cold. Chill mixture for at least 30 minutes and up to a day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once chilled, use wet hands and a tablespoon (or portioning scoop) to form the mixture into bite-sized patties. Transfer to a large plate as you go. When all the patties are formed, heat a few tablespoons of oil in a large skillet over medium high heat until shimmering. Fry patties in batches until golden brown and cooked through, turning once, 3 to 4 minutes total. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm, scattered with cilantro and finely sliced scallions along with dipping sauce.</p>"}]}