{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160415-okonomiyaki-mixing-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "cabbage", "easy", "Japanese", "pancake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Okonomiyaki (Japanese Cabbage Pancake)", "link": "https://www.seriouseats.com/recipes/2016/05/okonomiyaki-japanese-pancake-cabbage-recipe.html", "description": "<em>Okonomi</em> means \"how you want it,\" and an <em>okonomiyaki</em> is one of the world's most infinitely adaptable dishes. The shredded or chopped cabbage in the base is a given, but beyond that, you can add whatever you'd like to the batter. Once you've got a few Japanese staples in your pantry (all of which have a shelf life of forever), making it at home is cheap, quick, easy, filling, and great for using up leftovers", "totalTime": "30 minutes", "recipeYield": "Makes 1 large okonomiyaki, serving 2 to 3", "recipeCategory": ["Cabbage", "Japanese", "Mains", "Snacks"], "recipeIngredient": ["1/2 small head cabbage, finely shredded (about 4 packed cups; 14 ounces; 400g)", "3 scallions, thinly sliced, dark green parts reserved separately", "2 ounces (50g) <a href=\"https://en.wikipedia.org/wiki/Beni_sh%C5%8Dga\">beni-shoga</a> (Japanese pickled red ginger), divided (see note)", "1/2 ounce (15g) katsuobushi, divided (see note)", "1/4 pound (120g) yamaimo, peeled and grated on the smallest holes of a box grater (optional; see note)", "2 large eggs", "1/2 cup (120ml) cold water or dashi (or use cold water with 2 teaspoons Hondashi; see note)", "3/4 cup all-purpose flour (3 3/4 ounces; 110g)", "8 to 10 thin slices uncured pork belly (optional; see note)", "2 tablespoons (30ml) vegetable oil (if not using pork belly)", "Ao-nori, okonomiyaki sauce, and Kewpie mayonnaise, for serving (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cabbage, scallion whites and half of greens, half of beni-shoga, 3/4 of katsuobushi, yamaimo, eggs, and water (or dashi) in a large bowl. Sprinkle with flour. Stir with a fork and beat heavily until a thick batter with plenty of bubbles forms. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using pork belly, cover the bottom of a 10-inch nonstick skillet with pork belly and set over medium heat. Add okonomiyaki mixture and spread into an even layer with a fork. If not using pork belly, heat vegetable oil in skillet over medium heat until shimmering. Add okonomiyaki mixture and spread into an even layer with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover and cook, shaking pan occasionally, until bottom layer is crisp and well browned, about 10 minutes, lowering heat as necessary if cabbage threatens to burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To flip, drain off any excess fat, then, working over a sink and holding the lid tightly against pan with a pot holder, flip entire pan and lid over so that okonomiyaki transfers to pan lid. Remove pan, then carefully slide okonomiyaki off lid and back into pan, browned side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return to heat, cover, and continue to cook, shaking gently, until both sides are browned and okonomiyaki is not runny but still custardy and tender in the center, about 8 minutes longer. Transfer to a serving platter, pork side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle with okonomiyaki sauce and mayonnaise; sprinkle with ao-nori, remaining beni-shoga, remaining katsuobushi, and remaining scallion greens; and serve immediately off of a communal plate.</p>"}]}