{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/05/20160503-samon-rillette-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["appetizer", "easy", "fish", "hors d'oeuvre", "salmon", "seafood", "snack", "spread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Salmon Rillettes With Chives and Shallots", "link": "https://www.seriouseats.com/recipes/2016/05/salmon-rillettes-recipe.html", "description": "While often made with pork, the French spread called <em>rillettes</em> is even more elegant (and easy) to make with salmon. This recipe folds poached and shredded salmon with mayo, cooked shallots, chives, and a touch of spices. It requires no special equipment, so you can whip it up in no time for a fancy hors d'oeuvre.", "totalTime": "30 minutes plus 2 hours chilling", "recipeYield": "Serves 6 to 8 as an hors d'oeuvre", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Salmon", "Snacks"], "recipeIngredient": ["1 1/4 pounds (550g) boneless, skinless salmon fillet, cut into 1-inch pieces (see note)", "Cold water", "2 tablespoons (30ml) juice from 1 lemon, plus juice from 1 lemon, divided (see note)", "1 medium leek or onion (about 6 ounces; 170g), halved (see note)", "1 large stalk celery (about 2 ounces; 55g), cut into large pieces (see note)", "1 bay leaf (see note)", "2 ounces unsalted butter (1/2 stick; 55g)", "1/4 cup minced shallot (about 4 small, 1-ounce/30g shallots)", "1/4 cup plus 2 tablespoons (90ml) mayonnaise ", "2 tablespoons (30ml) minced chives", "1/4 teaspoon ground coriander seed", "Pinch cayenne pepper", "Kosher salt and freshly ground black pepper", "<a href=\"http://www.seriouseats.com/recipes/2015/10/baguette-toast-crackers-recipe.html\">Toasts</a> or crackers, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, combine salmon with enough cold water to cover by 1 inch. Add juice from 1 lemon, leek or onion, celery, and bay leaf (if using). Set over medium heat and bring poaching liquid to 170&deg;F, using an instant-read thermometer if you have one; otherwise, bring liquid to just below a bare simmer. Adjusting heat to maintain water temperature, cook until salmon flakes easily when pressed, about 6 minutes. Drain, discard aromatics, and transfer salmon to a mixing bowl. Using your fingers, shred salmon roughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small skillet, melt butter over medium heat, add shallot, and cook, stirring, until softened but not browned, about 3 minutes. Scrape shallots and butter into bowl with salmon. Add mayonnaise, chives, remaining 2 tablespoons (30ml) lemon juice, coriander seed, and cayenne. Season with salt and pepper. Stir well until ingredients are thoroughly mixed and salmon is more finely shredded.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer rillettes to a large ramekin, crock, or other container, pressing down with a spoon and working it into the corners and against the walls to avoid trapping any air bubbles. Press plastic against the surface and refrigerate until thoroughly chilled, at least 2 hours. Serve with toasts or crackers. Rillettes can keep refrigerated for up to 5 days with plastic pressed firmly against the surface.</p>"}]}