{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20161118-lasagne-bolognese-vicky-wasik-19.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["baked pasta", "beef", "essential", "fall", "Italian", "lasagna", "pork", "veal", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Classic Baked Lasagna Bolognese (Lasagne alla Bolognese)", "link": "https://www.seriouseats.com/recipes/2016/12/lasagna-bolognese-al-forno-recipe.html", "description": "A classic Bolognese lasagna is different from the version most common in the United States. Instead of thick layers of ricotta and mozzarella cheese, <em>lasagne alla bolognese </em> features delicate layers of fresh pasta (spinach is traditional, but plain fresh egg pasta works fine, or even dried in a pinch) coated in a luxurious mix of hearty <em>ragù bolognese</em> (slow-cooked meat sauce) and creamy béchamel (white sauce). It's one of the world's great baked pastas.", "totalTime": "1 hour 20 minutes", "recipeYield": "Makes one 9- by 13-inch baking dish (serving 8)", "recipeCategory": ["Baking", "Beef", "Fall", "Italian", "Lasagna", "Mains", "Other Meats", "Pork", "Winter"], "recipeIngredient": ["4 tablespoons unsalted butter (2 ounces; 60g), plus more for greasing baking dish", "4 tablespoons all-purpose flour (1.25 ounces; 35g)", "3 cups (700ml) whole milk", "Kosher salt and freshly ground black pepper", "Pinch freshly grated nutmeg", "2 pounds (900g) fresh homemade <a href=\"http://www.seriouseats.com/recipes/2015/01/fresh-egg-pasta.html\">plain egg</a> or <a href=\"http://www.seriouseats.com/recipes/2015/04/spinach-colored-fresh-pasta-green-noodles-recipe.html\">spinach</a> pasta or store-bought fresh lasagna noodles, or 2 (450g) boxes dry lasagna noodles (see note)", "Vegetable oil, for greasing pasta", "1 1/2 quarts (1.5L) warm ragù bolognese (choose either this <a href=\"http://www.seriouseats.com/recipes/2016/12/basic-ragu-bolognese-recipe.html\">classic slow-cooked version</a>, this <a href=\"http://www.seriouseats.com/recipes/2014/12/the-best-slow-cooked-bolognese-sauce-recipe.html\">extra-rich oven-baked version</a>, or this <a href=\"http://www.seriouseats.com/recipes/2015/11/pressure-cooker-ragu-bolognese-sauce-italian-recipe.html\">pressure-cooker version</a>)", "3 ounces (85g) Parmigiano-Reggiano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, melt butter over medium-high heat (do not allow it to brown). Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring, until sauce is just thick enough to coat the back of a wooden spoon, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season with salt and pepper. Whisk in nutmeg. If any lumps form, simply whisk thoroughly to remove them and smooth out sauce, or use a hand blender or countertop blender if lumps are particularly large or tough. Use béchamel sauce right away, or press a piece of plastic wrap over surface of sauce to prevent a skin from forming and keep warm until ready to use. (Béchamel sauce can be cooled and stored in a sealed container in the refrigerator for several days. Reheat very gently on the stovetop or in a microwave to use.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using Homemade Pasta</strong>: Follow the recipe and instructions <a href=\"http://www.seriouseats.com/recipes/2015/01/fresh-egg-pasta.html\">here</a> through step 10 (you will end up with long sheets of fresh pasta), doubling the quantity to yield 2 pounds total (this will make more pasta than you will need, but it's best to have extra and avoid running out midway through assembly). Cut those sheets into roughly 8-inch-long rectangles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pot of salted boiling water, cook pasta, working in batches if necessary, until <em>al dente</em> (this will vary depending on the pasta you use, but for store-bought it's about 1 minute less than package instructions), then use a spider or mesh strainer to transfer immediately to a large ice bath to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain pasta well, then rub each sheet lightly on both sides with vegetable oil (to prevent sticking). You can hold the cooked pasta sheets for up to 3 hours, but if you're doing this, it's best to lay them out on a parchment-lined baking sheet, with layers of plastic wrap between the layers of pasta (once again, to prevent sticking).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using No-Boil Pasta:</strong> Soak in warm water for 30 minutes to partially hydrate, then drain on paper towels or kitchen towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble and bake lasagna, preheat oven to 375&deg;F (190&deg;C). Grease a 9- by 13-inch baking dish with butter. Spoon a thin, even layer of ragù on bottom of baking dish, then lay down a layer of lasagna noodles; if's okay if they overlap somewhat, but you can cut any sheets that are too large to avoid excessive doubling up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top pasta with another thin layer of ragù (thin enough that you can see the pasta through it in some spots). Drizzle a small amount of béchamel all over ragù, then top with a showering of grated Parmigiano-Reggiano. Repeat this layering process with pasta, ragù, béchamel, and grated cheese until baking dish is full; this should be about 6 layers. Finish with a top layer of pasta, then coat that with an even layer of the remaining béchamel sauce. Grate a final generous amount of cheese on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake lasagna until bubbling and browned on top, about 35 minutes (placing a rimmed baking sheet under the baking dish is good insurance in case anything bubbles over). Let rest 10 minutes, then serve.</p>"}]}