{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/09/20160901-bechamel-sauce-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["bechamel", "besciamella", "essential", "milk", "quick", "sauce", "white sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Smooth and Silky Béchamel (White Sauce)", "link": "https://www.seriouseats.com/recipes/2016/09/bechamel-white-sauce-recipe.html", "description": "Béchamel is one of the mother sauces in classic French cooking, and one of the most important sauces to learn for all sorts of dishes, French and otherwise. It's a key ingredient in soufflé, a classic Bolognese lasagna, and even old-school mac and cheese. And it's incredibly easy to make. Here's how.", "totalTime": "5 minutes", "recipeYield": "Makes about 1 cup", "recipeCategory": ["Condiments and Sauces", "French", "Recipes", "Stovetop", "Vegetarian"], "recipeIngredient": ["1 1/2 tablespoons unsalted butter (3/4 ounce; 20g) (see note)", "1 1/2 tablespoons (12g) all-purpose flour (see note)", "1 cup (240ml) whole milk", "Kosher salt and freshly ground black pepper", "Freshly grated nutmeg, to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, melt butter over medium-high heat (do not allow it to brown). Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring, until sauce is thick enough to coat the back of a wooden spoon, about 3 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season with salt and pepper. Add nutmeg to taste, if using. If any lumps form, simply whisk thoroughly to remove them and smooth out sauce, or use a hand blender or countertop blender if lumps are particularly large or tough. Use sauce right away, or press a piece of plastic wrap over surface of sauce to prevent a skin from forming and keep warm until ready to use. Sauce can be cooled and stored in a sealed container in the refrigerator for several days. Reheat very gently on the stovetop or in a microwave to use.</p>"}]}