{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/03/HotCrossBuns.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "bread", "breakfast", "bun", "candied orange", "dried fruit", "good friday", "greek yogurt", "hot cross bun", "roll"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Spiced Vanilla Hot Cross Buns", "link": "https://www.seriouseats.com/recipes/2016/03/spiced-vanilla-hot-cross-buns-recipe.html", "description": "Hot cross buns are traditionally served for breakfast on Good Friday, so it's easy to make and refrigerate the dough in advance, but procrastinators won't have any trouble throwing it all together in a single afternoon. Thanks to loads of aromatic vanilla, lemony coriander, cinnamon, allspice, candied orange peel, chewy cherries, and tart apricot, hot cross buns aren't dependent on a long, slow fermentation for flavor.", "totalTime": "4 hours", "recipeYield": "Makes 15 (two-ounce) buns", "recipeCategory": ["Baking", "Breakfast and Brunch", "Easter", "Mother's Day", "Rolls", "Spring"], "recipeIngredient": ["<strong>For the Dough:</strong>", "1 vanilla bean, split and scraped", "2 1/2 ounces sugar (rounded 1/3 cup; 70g)", "1 1/2 teaspoons (6g) instant dry yeast, such as <a href=\"https://www.amazon.com/Saf-Instant-Yeast-Pound-Pouch/dp/B0001CXUHW/?tag=serieats-20\">SAF</a>; not RapidRise or active dry (more info <a href=\"https://www.seriouseats.com/2018/03/all-about-dry-yeast-instant-active-dry-fast-acting-and-more.html\">here</a>)", "1 teaspoon (4g) Diamond Crystal kosher salt (for table salt, use the same weight or half as much by volume)", "12 ounces all-purpose flour (about 2 1/3 cups, spooned; 340g)", "3 ounces unsalted butter (6 tablespoons; 85g)", "3 ounces cold milk, any percentage fat content (1/3 cup; 85g)", "6 ounces cold plain Greek yogurt, any percentage fat content (2/3 cup; 170g); see note", "1 ounce store-bought or <a href=\"http://www.seriouseats.com/recipes/2012/01/orangettes-recipe-how-to-make-chocolate-orange.html\">homemade</a> candied orange peel (2 tablespoons; 30g)", "2 ounces dried apricots or other light fruit (1/4 cup; 55g), cut into 1/4-inch dice", "2 ounces dried cherries or other dark fruit (1/3 cup; 55g), cut into 1/4-inch dice", "1/2 teaspoon (1g) ground cinnamon", "1/4 teaspoon ground coriander", "1/8 teaspoon ground allspice", "1/8 teaspoon grated nutmeg", "<strong>For the Egg Wash:</strong>", "1 large egg yolk", "1 1/2 teaspoons heavy cream (1/4 ounce; 7ml)", "<strong>For the Frosting:</strong>", "4 ounces powdered sugar (about 1 cup; 115g), preferably organic", "Pinch of salt", "1 tablespoon heavy cream (1/2 ounce; 15ml)", "1/2 teaspoon (2.5ml) vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Dough:</strong> Rub vanilla seeds and sugar in the bowl of a stand mixer fitted with a dough hook attachment. Add yeast, salt, and flour and whisk to combine. Heat butter in a medium saucepan over medium-low heat, swirling, until butter starts bubbling. Remove from heat and stir in milk and Greek yogurt. Add to bowl with dry ingredients and stir with a wooden spoon or flexible spatula until a dry, shaggy dough has formed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn mixer on low speed and knead until a sticky ball has formed, about 1 minute. Continue about 6 minutes more. Increase speed to medium-low and continue kneading until dough is pliable and elastic enough to stretch relatively thin before it begins to tear, about 10 minutes longer. Add candied orange peel, dried apricots, dried cherries, cinnamon, coriander, allspice, and nutmeg and mix on low speed until evenly incorporated, about 1 minute. Remove hook, shape dough into a ball, place it in bottom of mixing bowl, cover with plastic, and set aside to rise until puffy and light, about 1 1/2 hours at room temperature. (The dough should retain a fingerprint when gently pressed; if it feels heavy or dense, continue letting it rise for another 15 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 9- by 13-inch aluminum brownie pan with parchment paper. Turn dough onto a clean, unfloured surface. Without kneading or rolling, divide into 15 roughly equal portions, about 2 ounces (55g) each. (They do not need to be exact; recutting and pinching will lead to dense bread.) Cup each portion beneath your palm and work in quick, circular motions to form a smooth ball. If the dough leaves a buttery residue behind, scrape clean with a bench knife from time to time. Arrange balls in baking pan, cover loosely with plastic, and allow to rise until each portion of dough feels puffy and light for its size, able to retain a shallow impression when gently pressed, with a distinctly \"cushy\" feel from the air cells trapped inside, about 1 1/2 hours total. If the dough feels dense, heavy, firm, or resilient, let it continue to rise another 15 minutes more. (See note for overnight rising instructions.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Egg Wash:</strong> Adjust oven rack to middle position and preheat to 350&deg;F (180&deg;C). Combine egg yolk and cream in a small bowl, stirring with a pastry brush until smooth. Gently paint the surface of each bun, taking care not to deflate dough. If you like, score with a sharp knife or razor to form a cross. (Skip this decorative step if your knife is dull.) Bake until buns are golden brown and approximately 210&deg;F (99&deg;C) inside, 30 to 35 minutes. Cool directly in pan until crumb is set, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Frosting:</strong> Combine powdered sugar, salt, cream, and vanilla in a small bowl. Stir with a flexible spatula until smooth and creamy, adding up to 1/2 teaspoon (2.5ml) water if too thick to pipe. Transfer half of frosting to a small parchment cone (instructions <a href=\"http://www.seriouseats.com/2014/07/diy-piping-how-to-make-a-cornet-paper-cone-decorate-cake-with-chocolate.html\">here</a>) and snip 1/4 inch from the tip. Pipe a line of frosting across each row of buns, then repeat the other way to form a cross. Serve warm, with additional frosting on the side if desired. Hot cross buns are best fresh and warm, but leftovers can be stored at room temperature up to 24 hours in an airtight container; briefly microwave with a damp paper towel to rewarm."}]}