{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160605-crispy-fried-egg-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "easy", "egg", "essential", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Crispy Fried Eggs", "link": "https://www.seriouseats.com/recipes/2016/06/crispy-fried-eggs-recipe.html", "description": "The first time I tasted <em>truly</em> fried eggs was in Thailand, where a lady with a mobile wok burner served me a plate of rice topped with <em>phat ka-phrao</em>. As I held the plate, she added more oil to the wok and heated it up until it was almost smoking before slipping an egg into it. Thirty seconds later, it was deposited on my plate with crisp, lacy edges, a tender center, and a runny yolk to mix in with my rice. It was a revelation.", "totalTime": "2 minutes", "recipeYield": "Serves 1", "recipeCategory": ["Breakfast and Brunch", "Fried Eggs", "Mother's Day"], "recipeIngredient": ["3 tablespoons (45ml) vegetable or olive oil", "2 eggs", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 10-inch cast iron, carbon steel, or nonstick skillet over medium-high heat until shimmering. (A small drop of water dropped into it should immediately sizzle.) Carefully break eggs into hot oil, dropping them from right above the surface to prevent hot oil from splashing. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tilt the skillet toward you so oil pools against the side of the pan. Using a spoon, baste eggs with hot oil, aiming at the uncooked portions of the egg whites and avoiding the yolk. Continue basting until eggs are puffy and cooked, 45 seconds to 1 minute. Transfer to a plate and serve.</p>"}]}