{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160419-corn-tortillas-vicky-wasik-soaking.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Mexican", "keywords": ["corn", "Mexican", "taco", "tortilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Easy Nixtamalized Corn Tortillas", "link": "https://www.seriouseats.com/recipes/2016/04/nixtamalized-corn-tortilla-masa-recipe.html", "description": "The key to great tacos is great tortillas, but all too often, the tortillas are the <em>worst</em> part. Turns out, once you've bought the two key ingredients, making nixtamalized corn dough for tortillas is incredibly easy. This recipe, designed for home cooks, requires dried corn, slaked lime (an alkali that improves the corn's digestibility and workability), and a food processor.", "totalTime": "1 hour plus about 1 hour simmering and overnight soaking", "recipeYield": "Makes about 20 (5-inch) tortillas (though exact yield will vary)", "recipeCategory": ["Bread", "Corn", "Gluten-Free", "Mexican", "Vegetarian"], "recipeIngredient": ["200g (7 ounces) dried white, yellow, or blue dent or field corn (see note)", "600ml (2 1/2 cups) water, plus more as needed", "3g <a href=\"http://www.amazon.com/Mrs-Wages-Pickling-Lime-Ounce/dp/B00H86N9O8/?tag=serieats-20\">pickling lime</a> (or other food-grade slaked lime) (see note)", "<a href=\"http://www.amazon.com/Instant-Corn-Masa-Mix-4-84/dp/B0000IJYK4/?tag=serieats-20\">Masa harina <em>para tortillas</a></em>, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium pot, combine corn and water; pick out any stones that may be hiding among the corn kernels. Add pickling lime and set over medium heat. Bring to a simmer, adjusting heat to maintain simmer. Cook until corn is tenderized but not overly soft, about 45 minutes. (You can chew a kernel up to test, or break one open: It's done when the kernel looks mostly hydrated but still has a tiny core of visible starchiness.) The timing can vary based on corn type, so start checking at 30 minutes and continue cooking beyond 45 minutes if it's still too raw. Top up with water as needed to keep corn submerged. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat, cover pot, and let corn stand at room temperature overnight. The bran on the corn should now rub off easily. Drain corn in a colander, set under running cold water, and rub kernels vigorously between hands to remove most of the bran; corn should turn a brighter shade as bran comes off. Allow to drain well, then transfer corn to a food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Process corn at high speed, adding as much water as you need, little by little, to help the blades process the corn, about 10 minutes; scrape down the sides of the bowl at least a few times during processing. The dough is ready when no large corn chunks remain and the purée has the texture of a thick hummus.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape corn dough into a mixing bowl and add masa harina, little by little, working it in with your hands, until corn dough has the texture of Play-Doh: soft and supple, but not wet. To test texture, roll a small ball of dough between your hands, then press it between your fingers: If the edges crack, it's too dry, but if it sticks to your skin, it's too wet. Work in more water or masa harina, little by little, until you hit that sweet spot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut 2 sides plus the zipper-top off of a zipper-lock bag, leaving it attached on only 1 side; line tortilla press with the plastic and trim to fit. Preheat well-seasoned griddle or cast iron skillet over medium-high heat. Working with one piece at a time, roll a portion of corn dough into a golf ball&ndash;sized ball, then flatten slightly. Set portioned corn dough between the sheets of plastic, then press flat using the tortilla press. Try not to press so hard that the tortilla edge becomes too thin; about 1mm in thickness or slightly less is what you want. Rotate plastic 180 degrees and press again to ensure even thickness.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully peel tortilla from plastic and place in preheated skillet. Cook until bottom side is dried, about 30 seconds, then flip using a thin metal spatula and cook other side until dried, about 30 seconds longer; tortilla may puff up and brown lightly in spots, which is fine. Adjust heat as necessary to prevent scorching. (If tortillas start to stick to griddle or skillet, rub cooking surface with a paper towel lightly moistened with vegetable oil, then buff away any excess oiliness.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stack tortillas as they are done, keeping them wrapped in a clean kitchen towel or tortilla holder to trap heat and steam. Serve immediately.</p>"}]}