{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/05/20160329-roasted-sugar-vicky-wasik--1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "caramel", "sugar", "toasted sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6875", "ratingCount": "16"}, "name": "Toasted Sugar", "link": "https://www.seriouseats.com/recipes/2016/05/dry-toasted-sugar-granulated-caramel-recipe.html", "description": "<p>Toasting sugar in a low oven allows it to slowly caramelize without sacrificing its crystalline structure. The result is a sort of \"granulated caramel\" that can be used in any recipe as a one-to-one substitution for plain sugar. A mere hour of toasting will dramatically tame the sugar's sweetness, while extended periods of time will build a more intense caramel flavor. This technique works best with large batches of sugar; for smaller batches, check out our guide to <a href=\"https://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">quick toasted sugar</a>. Whatever the case, play around and find out what style works best for you.</p>", "totalTime": "Up to 7 hours", "recipeYield": "Makes 4 pounds (9 cups; 1.8kg)", "recipeCategory": ["Desserts"], "recipeIngredient": ["4 pounds (9 cups; 1.8kg) granulated white sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 300&deg;F. Pour sugar into a 9- by 13-inch glass or ceramic baking dish. Toast until the sugar turns ivory, about 1 hour. Stir thoroughly and continue roasting, pausing to stir every 30 minutes. The sugar will produce steam as a byproduct of toasting, so it must be stirred well to allow that moisture to escape. Stirring should also help move hot sugar from the edges toward the center, and cool sugar from the center toward the edges, for even toasting. Continue toasting and stirring every 30 minutes until the sugar has darkened to the desired degree, from a light beige to the color of traditional brown sugar, between 2 and 4 hours more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sugar has finished toasting, set aside and cool to room temperature, stirring from time to time to speed the process and allow for continued evaporation of steam. Alternatively, the cooling process can be sped along by pouring the sugar into a large, heat safe container. Once fully cool, transfer to an airtight container and store as you would plain white sugar. It can be used interchangeably, by weight or volume, in any recipe that calls for white sugar.</p>\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Troubleshooting: In an oven that runs hot, or when using a different volume of sugar, or a different size baking dish, or a metal dish, the sugar will heat more rapidly, and may begin to liquify much sooner than expected. If this happens, immediately pour the dry sugar into a large stainless steel bowl, leaving the melted caramel behind. If the sugar is not stirred thoroughly throughout the toasting process, it may clump severely along the way and as it cools; should this happen, grind the cooled sugar in a food processor until powdery and fine. </p>"}]}