{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2015/12/20151202-dashi-salad-vicky-wasik-006.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Japanese", "keywords": ["dashi", "Japanese", "quick", "salad", "sweet potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Arugula, Sweet Potato, and Walnut Salad With Dashi \"Vinaigrette\"", "link": "https://www.seriouseats.com/recipes/2016/02/arugula-soy-shoyu-dashi-salad-recipe.html", "description": "Conventional wisdom says that salads should be dressed with vinaigrettes, which, by definition, balance an acid with a fat. Turns out you can break that rule by dropping the acid entirely. In this salad, we make a \"vinaigrette\" with shoyu-dashi&mdash;soy sauce mixed with dashi&mdash;for an easy, deeply flavorful dish.", "totalTime": "25 minutes", "recipeYield": "Serves 4 as a first course", "recipeCategory": ["Japanese", "Salads", "Sides", "Sweet Potatoes and Yams", "Thanksgiving"], "recipeIngredient": ["1 pound (500g) sweet potatoes in jackets, poked all over with a fork", "1 cup walnut halves (3 ounces; 90g), crumbled", "2 tablespoons (30ml) extra-virgin olive oil, plus more for drizzling", "2 cups (475ml) cold water", "1/4 ounce dried kombu (8g; about one 5- by 2-inch piece)", "1/4 ounce dried bonito flakes (8g; 1 loosely packed cup)", "2 tablespoons (30ml) soy sauce", "4 cups arugula (2 1/2 ounces; 70g)", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Microwave sweet potatoes until tender and easily pierced with a fork, about 5 minutes. Set aside to cool slightly. If desired, peel and discard jackets. Cut into medium cubes and allow to cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, on a microwave-safe plate, drizzle walnuts with just enough olive oil to lightly coat, toss well, and arrange in a single even layer. Microwave in 1-minute intervals at high power, tossing walnuts between intervals, until toasted and fragrant, about 3 minutes. Let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine water with kombu and cook over medium heat until just shy of a simmer. Remove and discard kombu using tongs. Remove from heat, add bonito flakes, and let steep for 10 minutes. Strain dashi into a heatproof container through a fine-mesh strainer. Discard bonito flakes. (See note.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk 1/4 cup dashi together with soy sauce (this is now shoyu-dashi). Reserve remaining dashi for another use. (It's good just as a warming broth, or can be used to make a <a href=\"http://www.seriouseats.com/recipes/2012/06/easy-one-pot-miso-soup-recipe.html\">quick miso soup</a>.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean small bowl, whisk together 3 tablespoons shoyu-dashi with 2 tablespoons olive oil. Reserve remaining shoyu-dashi for another use. (It's delicious as a broth for poached eggs, steamed fish, or simple steamed vegetables.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a salad bowl, combine sweet potato, walnuts, and arugula. Dress with shoyu-dashi/oil mixture, tossing well to coat. Season with salt and pepper and serve.</p>"}]}