{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160801-sous-vide-brisket-guide-07.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barbecue", "beef", "brisket", "grill", "low carb", "texas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.9545454545455", "ratingCount": "22"}, "name": "Sous Vide Smoked Brisket", "link": "https://www.seriouseats.com/recipes/2016/08/sous-vide-barbecue-smoked-bbq-brisket-texas-recipe.html", "description": "Good brisket is often called the Holy Grail of barbecue&mdash;an apt description, given how rarely you find good smoked beef brisket in the wild. Sous vide cooking changes all that by allowing even a novice to produce brisket that's as moist and tender as the very best stuff you'll find in Austin or Lockhart, with all the savory brisket rub and smoky flavor you could want.", "totalTime": "32 to 80 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Beef", "Christmas", "Dairy-Free", "Gluten-Free", "Grilling, Smoking, and Barbecue", "Mains", "Sous Vide", "The Food Lab"], "recipeIngredient": ["2 ounces coarsely ground black peppercorns (about 1/3 cup; 55g); see note", "2 1/4 ounces kosher salt (about 1/4 cup; 65g)", "1/4 ounce (10g) pink salt, such as <dorado id=\"pink-curing-salt\" class=\"text\">Prague Powder Curing Salt</dorado> (optional; see note)", "1 flat-cut or point-cut brisket, about 5 pounds (2.25kg); see note", "1/4 teaspoon liquid smoke, such as <dorado id=\"liquid-smoke\" class=\"text\">Wright's Liquid Smoke</dorado> (optional; see note)", "Dill pickles, sliced yellow onion, and white bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pepper, salt, and pink salt (if using) in a small bowl. Rub two-thirds of mixture evenly over surface of brisket. Reserve remaining one-third of mixture. Slice brisket in half crosswise in order to fit into large vacuum bags.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place each brisket half in a vacuum bag. (Fold over the top of each bag while you add brisket so that no rub or juices get on the edges of bags, which can weaken the seal.) Add 4 drops (about 1/8 teaspoon) liquid smoke, if using, to each bag. Seal bags using a vacuum sealer and let rest for 2 to 3 hours in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set your precision cooker to 135&deg;F (57&deg;C) for brisket with a tender, steak-like texture, or 155&deg;F (68&deg;C) for more traditionally textured brisket that falls apart when you pull at it. Add brisket to water bath and cover it with a lid, aluminum foil, or <a href=\"https://www.seriouseats.com/2017/01/how-to-insulate-sous-vide-water-bath.html\">table tennis balls</a>. Cook for 24 to 36 hours at 155&deg;F or 36 to 72 hours at 135&deg;F. Allow cooked brisket to cool at least to room temperature before proceeding (an ice bath can speed up this process). Brisket can be stored in the refrigerator at this stage for up to 1 week before finishing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on the Grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1/2 chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove brisket from bags and carefully blot dry with paper towels. (Liquid from bags can be added to your favorite <a href=\"https://www.seriouseats.com/recipes/2016/09/easy-basic-barbecue-rub-sauce-all-purpose-recipe.html\">barbecue sauce</a> and simmered down to provide extra flavor.) Rub reserved salt and pepper mixture into surface of brisket. Place brisket on cooler side of grill, fat cap up. Add 4 to 5 hardwood chunks to hotter side of grill. (If using a gas grill, wrap wood chunks loosely in aluminum foil before placing over hotter side of grill.) Cover and allow brisket to smoke, adjusting vents to maintain a temperature between 275 and 300&deg;F (135 and 149&deg;C) and adding 2 to 3 wood chunks twice during cooking. Smoke until a deep, dark bark has formed, about 3 hours. Continue with step 7.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish in the Oven:</strong> Adjust oven rack to lower-middle position and preheat oven to 300&deg;F (150&deg;C). (If your oven has a convection setting, turn it on and adjust heat to 275&deg;F/135&deg;C instead.) Remove brisket from sous vide bags and carefully blot dry with paper towels. (Liquid from bags can be added to your favorite <a href=\"https://www.seriouseats.com/recipes/2016/09/easy-basic-barbecue-rub-sauce-all-purpose-recipe.html\">barbecue sauce</a> and simmered down to provide extra flavor.) Rub reserved salt-and-pepper mixture into surface of brisket. Place brisket on a wire rack set in a rimmed baking sheet, fat cap up, and place in oven. Roast until a deep, dark bark has formed, about 2 hours. Continue with step 7.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer brisket to a cutting board and tent with foil. Allow to rest until the temperature drops to between 145 and 165°F (63 and 74&deg;C), about 30 minutes. Slice against the grain into thin strips and serve with white bread, dill pickles, and sliced onion.</p>"}]}