{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/06/20160608-cherry-pie-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "cherry", "pastry", "pie", "tapioca"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9090909090909", "ratingCount": "11"}, "name": "The Best Cherry Pie (With Fresh or Frozen Fruit)", "link": "https://www.seriouseats.com/recipes/2016/06/fresh-cherry-pie-filling-recipe.html", "description": "This recipe changed everything I knew about pie. Before I sorted out a truly scientific ratio of ingredients, fruit pies seemed to be a hit-or-miss proposition: some days soup, some days gloop. But, after cracking open the mechanics of starch, I can count on a flawless cherry pie every time, regardless of whether I'm using fresh or frozen fruit! It's always crispy on the bottom, flaky on the top, and nothing but sweet-tart perfection inside.", "totalTime": "About 5 hours", "recipeYield": "One double-crusted 9-inch pie", "recipeCategory": ["Cherry", "Easter", "Father's Day", "Fruit Desserts", "Pastry", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["<strong>For the Filling:</strong>", "28 ounces pitted cherries (5 heaping cups; 790g), from about 2 pounds whole fruit (6 heaping cups; 910g) (see note)", "1 ounce fresh lemon juice (2 tablespoons; 30g) from 1 small lemon", "7 ounces sugar (1 cup; 195g)", "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1 1/2 ounces tapioca starch, such as Bob's Red Mill (1/3 cup plus 1 teaspoon; 40g)", "<a href=\"http://www.seriouseats.com/recipes/2016/06/old-fashioned-flaky-pie-dough-recipe.html\">Old-Fashioned Flaky Pie Dough</a>, rolled and chilled as per the directions for a double crust", "<strong>For the Egg Wash (optional):</strong>", "1 large egg", "1 large egg yolk", "1/2 ounce heavy cream (1 tablespoon; 15g)", "1/8 teaspoon (1/2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "<strong>To Serve (optional):</strong>", "<a href=\"http://www.seriouseats.com/recipes/2016/06/cherry-pit-whipped-cream-recipe.html\">Cherry Pit Whipped Cream</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Combine pitted cherries, lemon juice, sugar, salt, and tapioca starch in a large bowl, folding with a flexible spatula until well combined. Scrape into prepared pie shell and top with remaining dough, using a solid sheet, cutouts, or a lattice-top design. (Check out my tutorials <a href=\"http://www.seriouseats.com/2016/06/how-to-weave-a-lattice-pie.html\">here</a>.) Trim away excess dough and refrigerate pie to ensure top crust is completely chilled, about 30 minutes. Meanwhile, adjust oven rack to lower-middle position and preheat to 400&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Egg Wash (if using):</strong> Whisk egg, egg yolk, cream, and salt in a small bowl. Brush over chilled top crust in a thin, even layer. This will give the crust a glossy, golden sheen, but it is not necessary in any way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chilled pie on a parchment-lined rimmed baking sheet. Bake until crust is golden, about 1 hour, then loosely cover with tented foil. (Alternatively, an empty baking sheet can be placed on the topmost rack of the oven to serve as a shield.) Continue baking until filling is bubbling even in the very center of the pie, about 15 minutes more. If crust completely covers filling, bake until pie reaches an internal temperature of 213&deg;F on a digital thermometer. The time can vary considerably depending on the thickness and type of pie plate, the amount of top crust, how long the pie was refrigerated, et cetera.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Cool pie until no warmer than 85&deg;F on a digital thermometer, about 3 hours depending on the type of pie plate (at higher temperatures, filling will be runny and thin). Slice into wedges with a sharp knife, pressing firmly against bottom and sides of pie plate to ensure the under-crust is completely cut. If you like, serve with <a href=\"http://www.seriouseats.com/recipes/2016/06/cherry-pit-whipped-cream-recipe.html\">Cherry Pit Whipped Cream</a>. Wrapped in foil, leftovers will keep up to 3 days at room temperature; warm 10 minutes in a 350&deg;F oven to revive crust before serving.</p>"}]}