{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160510-cochinita-pibil-recipe-05-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["barbecue", "cochinita pibil", "low carb", "merida", "Mexican", "pork", "pulled pork", "smoke", "taco", "yucatan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cochinita Pibil (Yucatán-Style Barbecued Pork)", "link": "https://www.seriouseats.com/recipes/2016/05/cochinita-pibil-yucatan-barbecue-mexican-smoked-pork-recipe.html", "description": "Real <em>cochinita pibil</em> is not spicy, but it has a uniquely sweet, earthy aroma imparted by Seville oranges, achiote, charred garlic, and spices. That earthiness is backed with the aroma of the banana leaves it's cooked in, along with smokiness from hours of cooking. Maybe you can't make cochinita pibil without an actual <em>pib</em>, but you can fake it pretty darn well, and that's what we're going to do today.", "totalTime": "7 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Dairy-Free", "Mains", "Mexican", "Pork", "The Food Lab"], "recipeIngredient": ["<strong>For the Marinade:</strong>", "1 whole head garlic, separated into individual unpeeled cloves", "2 tablespoons (30ml) lard or vegetable oil", "1/4 cup achiote (annatto) seeds (1 1/2 ounces; 40g)", "2 tablespoons (about 6g) Mexican oregano", "3 whole cloves", "1 (3-inch) Ceylon cinnamon stick, or a 1.5-inch piece of cassia cinnamon (see note)", "2 tablespoons (about 8g) whole black peppercorns", "1 tablespoon (about 4g) whole cumin seed", "1 tablespoon (about 4g) whole allspice berries", "3/4 cup (175ml) bitter (Seville) orange juice, or 1/4 cup (60ml) each lime, orange, and grapefruit juice", "1/4 cup (60ml) white vinegar", "1 tablespoon (15ml) soy sauce", "Kosher salt", "<strong>For the Pork:</strong>", "4 pounds (1.8kg) boneless pork shoulder or 6 pounds (2.7kg) bone-in pork shoulder, cut into 2-inch-thick slabs", "6 to 8 banana leaves (see note)", "2 Roma tomatoes, sliced", "1 red or green bell pepper, sliced", "1 white onion, sliced", "12 bay leaves", "<strong>To Serve:</strong>", "Warm corn tortillas", "<a href=\"http://www.seriouseats.com/2016/05/three-simple-yucatan-condiments-salsas.html\">Yucatán-style pickled onions and salsa</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thread garlic cloves onto a metal skewer and grill directly over the flame of a gas grill until completely blackened on all sides, 3 to 4 minutes. Alternatively, toss them in a dry skillet over high heat until blackened. Peel the blackened skins when cool enough to handle.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil or lard in a skillet over medium heat until shimmering. Add achiote, oregano, cloves, cinnamon, black peppercorns, cumin, and allspice and cook, tossing and stirring, until fragrant, about 2 minutes. Transfer to a blender along with peeled garlic, bitter-orange juice, vinegar, soy sauce, and a big pinch of salt. Blend until smooth. Season to taste with more salt. It should be quite salty and have a consistency like ketchup. If too thick, thin it with water until it flows slowly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour marinade over meat and rub it in with your hands. Cover, refrigerate, and let it rest at least 1 hour and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay out 2 to 3 overlapping banana leaves on a work surface. Place 1 piece of pork in the center and layer with some of the tomatoes, bell pepper, onion, and bay leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form a tight parcel by folding the bottom side up and the top side down, then rolling in the sides. Secure parcel with kitchen twine and transfer pork to an oven-safe baking sheet or disposable aluminum baking tray. Repeat with remaining pork and banana leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 3/4 chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium-high heat setting, cover, and preheat for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a few large hardwood chunks on the coals (no need to soak). Place aluminum tray or baking sheet on the side opposite the fire and close lid. Smoke pork, aiming for a temperature between 250 and 300&deg;F inside the chamber the whole time, until a metal skewer inserted into pork shows no resistance, 4 to 5 hours total. (Adjust heat by adding coals and/or adjusting the air vents.) Add extra wood chunks to the coals once per hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork from grill and transfer parcels to a deep platter, shallow bowl, or rimmed tray. Unwrap banana leaves and serve immediately, shredding pork with two forks, soaking it in drippings, and stuffing it into tortillas with pickled red onions and salsa.</p>"}]}