{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160221-fried-rice-crab-thai-recipe-kenji-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["crab", "easy", "fried rice", "quick", "rice", "seafood", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thai-Style Crab Fried Rice", "link": "https://www.seriouseats.com/recipes/2016/02/thai-style-fried-rice-crab-recipe.html", "description": "Southeast Asia is a great place for crab lovers, and there aren't many better ways to eat it than in Thai <em>khao phat buu</em>&mdash;fried rice with crab, made with fragrant jasmine rice that's gently seasoned with garlic and chilies, then tossed with scrambled egg, picked crabmeat, and scallions, finished with a little fish sauce, and served with cilantro and cucumbers.", "totalTime": "10 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Fried Rice", "Lobster and Crab", "Mains", "Thai", "The Food Lab"], "recipeIngredient": ["2 cups cooked jasmine rice (12 ounces; 350g) (see note)", "1 1/2 tablespoons (20ml) vegetable or canola oil, divided ", "1 to 3 Thai bird chilies (according to your heat tolerance), finely sliced, plus more for serving", "2 medium cloves garlic, minced (about 2 teaspoons; 5g)", "1 large egg", "Kosher salt", "4 ounces (115g) picked cooked crabmeat", "2 scallions, thinly sliced (1 ounce; 30g)", "2 teaspoons (10ml) Asian fish sauce, plus more for serving", "Ground white pepper", "1/4 cup (60ml) minced fresh cilantro leaves", "1 Japanese cucumber, thinly sliced, for serving", "1 lime, cut into 4 wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using day-old rice, transfer to a medium bowl and break rice up with your hands into individual grains before proceeding. Heat 1/2 tablespoon vegetable oil in a large wok over high heat until lightly smoking. Add chilies and garlic and cook, stirring, until fragrant, about 10 seconds. Immediately add half of rice and cook, stirring and tossing, until rice is pale brown, toasted, and has a lightly chewy texture, about 3 minutes. Transfer to a medium bowl. Heat another 1/2 tablespoon oil until smoking, add remaining rice, and cook, stirring, until it has the same texture as the first batch. Return first batch of rice to wok and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Push rice to side of wok and add another 1/2 tablespoon oil. Break egg into oil and season with a little salt. Use a spatula to scramble egg, breaking it up into small bits. Toss egg and rice together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add crabmeat, scallions, and fish sauce. Toss to combine and cook, tossing and stirring constantly, until crab is heated through and scallions are lightly softened, about 1 minute. Season to taste with white pepper and salt. Stir in cilantro.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately with sliced cucumber, lime wedges, additional fish sauce, and sliced Thai chilies at the table.</p>"}]}