{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/201605056-tacos-de-castacan-recipe-01-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["confit", "Mexican", "pork", "pork belly", "taco", "yucatan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Yucatecan Pork Belly and Cheese Tacos (Tacos de Castacán Con Queso)", "link": "https://www.seriouseats.com/recipes/2016/05/tacos-de-castacan-con-queso-pork-belly-cheese-tacos-recipe.html", "description": "<em>Castacán</em> is the Yucatecan version of crispy pork belly. These tacos, based on the ones I had at Wayan'e, a Mérida institution, are crisped up on a griddle, then topped with shredded cheese. As the cheese melts, it oozes into the cracks and spaces between the meat, binding the bits of pork belly together. The whole thing sizzles until the cheese is browned and crisped, lending an extra dimension of nutty flavor and texture to the taco.", "totalTime": "7 hours", "recipeYield": "Serves 4 to 6 as a main course, or 8 to 12 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Mains", "Mexican", "Pork"], "recipeIngredient": ["<strong>For the Castacán:</strong>", "2 pounds (1kg) fresh, skin-on pork belly", "Kosher salt and freshly ground black pepper", "1 cup (235ml) melted lard or vegetable oil", "4 cloves", "1 whole orange (preferably bitter Seville orange), cut into quarters", "1 cinnamon stick, broken into 4 shards", "4 medium cloves garlic", "<strong>To Finish and Serve:</strong>", "Kosher salt", "12 ounces (340g) shredded Oaxaca or low-moisture mozzarella cheese", "<a href=\"http://www.seriouseats.com/2011/10/video-the-right-way-to-warm-corn-tortillas.html\">Warm corn tortillas</a>", "<a href=\"http://www.seriouseats.com/recipes/2016/05/extra-hot-yucatan-style-salsa-recipe.html\">Yucatán-Style Habanero Salsa</a> (or your favorite <a href=\"http://www.seriouseats.com/tags/salsa\">salsa</a>)", "Lime wedges", "Chopped fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Castacán:</strong> Adjust oven rack to center position and preheat oven to 275&deg;F. Season pork with salt and pepper on both sides. Place in a cast iron skillet or baking dish not much larger than it. Pour melted lard or vegetable oil on top. Stick 1 clove and 1 cinnamon shard into each orange segment. Nestle oranges and garlic around pork. Cover with foil and place in oven. Cook until pork shows almost no resistance when poked with a knife, about 5 hours. Allow to cool completely at room temperature. Discard garlic and oranges. Drain fat and reserve for another use. Proceed to step 2, or wrap pork in foil and refrigerate for up to 5 days before proceeding as directed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450&deg;F. Place the cooked pork belly skin side up on a rimmed baking sheet lined with heavy-duty aluminum foil. Roast until skin is bubbly and crisp, 12 to 20 minutes, folding up foil to shield sides if they threaten to burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer crisp pork to a cutting board and cut into 1/2-inch lardons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish and Serve:</strong> Heat a griddle or a large cast iron pan over medium heat until hot. Add small piles (about 2 tablespoons each) of chopped pork. Season with a pinch of salt. Cook, stirring and flipping each pile, until brown and crisp on most sides, about 1 minute. Add a small pinch of shredded cheese to each pile, allow it to melt (about 30 seconds), then carefully flip, scraping up browned cheese from bottom of pan. Cook until second side is browned and crisp, about 1 minute. Transfer each pile to a warmed corn tortilla and serve immediately with <a href=\"http://www.seriouseats.com/recipes/2016/05/extra-hot-yucatan-style-salsa-recipe.html\">Yucatán-Style Habanero Salsa</a> or other salsa, lime wedges, and chopped cilantro.</p>"}]}