{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20161114-turkey-gravy-thanksgiving2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["gravy", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "The Best Turkey Gravy", "link": "https://www.seriouseats.com/recipes/2016/11/the-best-turkey-gravy-recipe.html", "description": "This simple recipe uses the trimmings from your turkey and a dash of umami-rich soy sauce to enhance the stock, forming a gravy that's intensely savory, with a texture that coats your turkey and mashed potatoes but doesn't feel heavy or starchy.", "totalTime": "1 1/2 hours", "recipeYield": "Makes about 3 cups (720ml)", "recipeCategory": ["Christmas", "Condiments and Sauces", "Stovetop", "Thanksgiving", "The Food Lab", "Turkey"], "recipeIngredient": ["Turkey neck, gizzards, and trimmings", "1 tablespoon (15ml) vegetable oil", "1 large onion, roughly chopped", "1 large carrot, peeled and roughly chopped", "2 ribs celery, roughly chopped", "1 1/2 quarts (about 1.5L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock, plus more as needed", "1 teaspoon (5ml) soy sauce", "A few sprigs mixed herbs, such as fresh parsley, thyme, or rosemary", "2 bay leaves", "3 tablespoons (45g) butter", "1/4 cup (1 1/2 ounces) flour", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Chop reserved turkey neck, gizzards, and trimmings into 1-inch chunks with a cleaver. Heat oil in a medium saucepan over medium-high heat until shimmering. Add turkey parts, onion, carrot, and celery and cook, stirring occasionally, until well browned, about 10 minutes total. Add stock, soy sauce, herbs, and bay leaves. Bring to a boil, then reduce to a simmer. Simmer for 1 hour, then strain through a fine-mesh strainer. Add any drippings from the roast turkey, then skim off excess fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You should have a little over 1 quart of fortified stock; if not, add water or more chicken stock to equal 1 quart. Discard solids and set stock aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a medium saucepan over medium heat. Add flour and cook, stirring constantly, until golden brown, about 3 minutes. Whisking constantly, add fortified broth in a thin, steady stream. Bring to a boil, reduce to a simmer, and cook until thickened and reduced to about 3 cups. Season to taste with salt and pepper. Gravy can be made up to 5 days in advance and stored in the refrigerator.</p>"}]}