{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160411-tahini-sauce-hummus-vegan-19.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Middle Eastern", "keywords": ["chickpea", "gluten free", "hummus", "israeli", "low carb", "middle eastern", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8695652173913", "ratingCount": "23"}, "name": "Israeli-Style Extra-Smooth Hummus", "link": "https://www.seriouseats.com/recipes/2016/03/israeli-style-extra-smooth-hummus-recipe.html", "description": "Store-bought versions of Israeli-style hummus&mdash;the kind made with tons of tahini and a touch of cumin&mdash;typically have a great, ultra-smooth and -creamy texture, but they lack flavor and aren't easily customizable to our own personal tastes. Homemade hummus, especially when made with dried chickpeas, may have amazing flavor that we can play with any way we like, but it's quite difficult to get it as smooth as the store-bought stuff. So what if you want hummus that is smooth <em>and</em> flavorful? Our recipe uses a few tricks to pack in flavor and give you great texture.", "totalTime": "2 hours 15 minutes, plus overnight soak if using dried chickpeas", "recipeYield": "Makes about 5 cups, serving 8 to 10", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Gluten-Free", "Hummus", "Legumes", "Middle Eastern", "Snacks", "Stovetop", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["1/2 pound dried chickpeas (1 generous cup; 225g); see note", "2 teaspoons (12g) baking soda, divided", "Kosher salt", "1 small onion, split in half", "1 small stalk celery", "1 small carrot", "2 medium cloves garlic", "2 bay leaves", "1 1/2 cups (350ml) <a href=\"http://www.seriouseats.com/recipes/2016/03/israeli-style-tahini-sauce-recipe.html\">Tahini Sauce With Garlic and Lemon</a>", "Extra-virgin olive oil, for serving", "Za'atar, paprika, warmed whole chickpeas, and/or chopped fresh parsley leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine beans, 1 teaspoon (6g) baking soda, and 2 tablespoons (24g) kosher salt in a large bowl and cover with 6 cups (1.4L) cold water. Stir to dissolve salt and baking soda. Let stand at room temperature overnight. Drain and rinse beans thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place beans in a large <a href=\"https://www.seriouseats.com/2017/11/best-cast-iron-dutch-ovens-equipment-review.html\">Dutch oven</a> or saucepan. Add remaining baking soda, 1 tablespoon (12g) salt, onion, celery, carrot, garlic, and bay leaves. Add 6 cups (1.4L) water and bring to a boil over high heat. Reduce to a simmer, cover with lid slightly cracked, and cook until beans are completely tender, to the point of falling apart, about 2 hours. Check on beans occasionally and top up with more water if necessary; they should be completely submerged at all times.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard onion, celery, and bay leaves. Transfer chickpeas, carrot, and garlic to a food processor or high-powered blender (such as a <a href=\"http://www.seriouseats.com/2014/12/high-end-blender-test-equipment-breville-vitamix-blendtec-review.html\">Vitamix, BlendTec, or Breville Boss</a>; see note) with enough cooking liquid to barely cover them. Cover blender, taking out the central insert on the blender lid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a folded kitchen towel over the hole in the center of the lid to allow steam to escape. Holding the towel down firmly, turn the blender to the lowest possible speed and slowly increase speed to high. If the mixture becomes too thick to blend, add cooking liquid until it has the texture of a very thick milkshake, always starting the blender on low speed before increasing to high. If your blender comes with a push-stick for thick purées, use it. Continue blending until completely smooth, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer hot chickpea mixture to a large bowl. Whisk in tahini sauce. Whisk in salt to taste. Transfer to a sealed container and allow to cool to room temperature. It should thicken up until it can hold its shape when spooned onto a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve hummus on a wide, shallow plate, drizzled with olive oil and sprinkled with za'atar, paprika, warmed whole chickpeas, and/or chopped parsley. Leftover hummus can be stored in the refrigerator for up to 1 week. Allow to come to room temperature before serving.</p>"}]}