{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160812-bruschetta-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["bruschetta", "easy", "Italian", "summer", "toast", "tomato", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fresh Summer Tomato Bruschetta", "link": "https://www.seriouseats.com/recipes/2016/08/fresh-tomato-bruschetta-recipe.html", "description": "These classic Italian tomato-topped toasts should be made only when tomatoes are at the peak of their season; the rest of the year, it's better to try my awesome <a href=\"http://www.seriouseats.com/recipes/2016/08/canned-tomato-bruschetta-recipe.html\">oven-roasted recipe using canned tomatoes</a>. The secret to this version is to use a mix of ripe heirloom varieties, and rub the garlic on the toasts instead of folding it into the tomatoes for a more even and less harsh garlic flavor.", "totalTime": "15 minutes", "recipeYield": "Makes 8 toasts", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Italian", "Snacks", "Tomato", "Vegan", "Vegetables", "Vegetarian"], "recipeIngredient": ["1 1/2 pounds (680g) best-quality, in-season fresh tomatoes, preferably a mix of varieties, cored and diced (see note)", "15 large basil leaves, thinly sliced into a chiffonade", "Extra-virgin olive oil, for the tomatoes and toasts", "Red or white wine vinegar or true balsamic vinegar, to taste (optional; see note)", "8 medium slices freshly toasted bread", "3 medium cloves garlic, halved", "Finishing sea salt (such as <em>fleur de sel</em>), kosher salt, or flaky salt (such as Maldon)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine tomatoes with basil and enough olive oil to generously coat. If using wine vinegar, add a splash. Toss gently, taste, and add more wine vinegar if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub garlic cloves on top surface of each toast; rub only as much as you want. (More will make the toasts more garlicky, while a lighter hand will deliver a more mild flavor.) Drizzle olive oil on each toast and season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon tomatoes onto each toast, including any liquid that has accumulated. Season generously with salt. If using true balsamic vinegar, drizzle it sparingly on top. Serve right away.</p>"}]}