{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161208-royal-icing-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["cookie", "easy", "egg white", "frosting", "gluten free", "icing", "quick", "royal", "royal icing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5714285714286", "ratingCount": "7"}, "name": "Perfect Royal Icing", "link": "https://www.seriouseats.com/recipes/2016/12/perfect-royal-icing-recipe.html", "description": "Royal icing is uniquely suited to <a href=\"http://www.seriouseats.com/2016/12/how-to-make-the-best-rolled-sugar-cookies.html\">decorating sugar cookies</a> because it dries glossy and firm, protecting your designs from smushing and smudging. It's typically considered little more than edible cement, but that doesn't have to be the case. With a bit of cream for richness, salt for balance, and cream of tartar for acidity, it tastes like more than a simple sugar bomb.", "totalTime": "30 minutes", "recipeYield": "Makes 2 1/2 cups", "recipeCategory": ["Christmas", "Cookies", "Frosting", "Gluten-Free", "Quick and Easy", "Seasonal and Holiday"], "recipeIngredient": ["18 ounces organic powdered sugar (4 1/2 cups; 510g), divided, plus more if needed (see note)", "2 1/2 ounces egg whites (1/4 cup; 70g), from 2 large eggs", "2 teaspoons (10ml) silver rum or water", "1 1/2 teaspoons (7ml) vanilla extract (see note)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1/4 teaspoon cream of tartar", "1 1/2 ounces heavy cream (3 tablespoons; 40g), plus more if needed (optional; for thinning royal icing, if desired)", "<a href=\"https://www.amazon.com/AmeriColor-Student-Paste-Color-Ounce/dp/B002K6XVXA/?tag=serieats-20\">Gel paste food coloring</a>, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Icing:</strong> Measure 16 ounces of powdered sugar (4 cups; 450g) and place in the bowl of a stand mixer, then add egg whites, rum, vanilla, salt, and cream of tartar. Stir with a flexible spatula to form a smooth paste, then set over a gently simmering water bath in a 3-quart saucier and stir until paste is hot to the touch, or about 150&deg;F (66&deg;C) on an instant-read thermometer. Transfer to stand mixer fitted with a paddle attachment, add remaining 2 ounces powdered sugar (1/2 cup; 60g), and mix at low speed to combine. Increase speed to medium and beat until thick and frosting-like, about 20 seconds or until the mixing bowl feels cool to the touch. Use immediately as a thick frosting or to make chunky decorations, like the buttons on a gingerbread man or little rosettes on a cake; color, if desired, according to instructions in step 3. For a thinner royal icing, used to make an even glaze for the tops of cookies, or to attempt a more ambitious, elegant design, thin according to instructions in step 2.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Thin the Icing:</strong> Reduce speed to low, add cream, and continue mixing until smooth. Remove bowl from mixer and lift paddle attachment, moving it in a figure 8 pattern as icing streams back into bowl. If the figure 8 disappears in exactly 8 seconds, the icing is ready to use as a cookie glaze. If it melts away faster, thicken by adding a spoonful of powdered sugar. If it takes longer than 8 seconds to disappear, thin by adding a few drops of cream. Repeat this test, making adjustments as you go, until the figure 8 takes exactly 8 seconds to disappear.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Color the Icing, if Desired:</strong> Divide icing among several small bowls, one for each color you'd like to prepare. Cover each with plastic wrap pressed directly against the surface. Working with one bowl at a time, stir in a few drops of gel paste. When your desired color has been achieved, immediately transfer to a disposable pastry bag fitted with a <a href=\"https://www.amazon.com/gp/product/B0000CFMXK/?tag=serieats-20\">#3</a> pastry tip, or a <a href=\"http://www.seriouseats.com/2014/07/diy-piping-how-to-make-a-cornet-paper-cone-decorate-cake-with-chocolate.html\">parchment cone</a>. (For ease of use, I like to stand the bag/cone upright in a small drinking glass.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Glaze the Tops of Sugar Cookies:</strong> Leaving a 1/8- to 1/4-inch margin (or more, depending on size of cookies), outline baked and fully cooled <a href=\"http://www.seriouseats.com/recipes/2016/12/rolled-sugar-cookie-recipe.html\">Rolled Sugar Cookie Cutouts</a> with royal icing, then roughly drizzle the interiors with more icing, using the piping tip to nudge it into an even layer. Work quickly if topping with sprinkles or a secondary icing color, as royal icing will form a crust within 90 seconds. If you'd like to read more on the basics of decorating, check out my <a href=\"http://www.seriouseats.com/2016/12/decorating-cookies-with-royal-icing-tutorial.html\">Royal Icing Tutorial</a> for lots of photos, videos, and ideas. For cookies to keep around the house, allow royal icing to air-dry until firm, about 4 hours. For cookies to package and ship, allow royal icing to dry until hardened through and through, about 6 to 8 hours more. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cookies frosted with royal icing can be stored up to 1 week at room temperature; in a pinch, their shelf life can be extended to about 10 days with refrigeration. Unfortunately, cookies with royal icing should not be frozen, as the water in the royal icing will form ice crystals that will melt as liquid water when thawed, creating a blotchy appearance on the surface of the frosting."}]}