{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/06/20160620-arnold-palmer-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Maggie Hoffman"}, "recipeCuisine": "", "keywords": ["citrus", "lemonade", "nonalcoholic", "summer", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "The Best Arnold Palmer (Half and Half Iced Tea + Lemonade)", "link": "https://www.seriouseats.com/recipes/2016/06/best-arnold-palmer-iced-tea-lemonade-recipe.html", "description": "This Arnold Palmer has a bold, rich tea flavor (without any bitterness) and a deeply lemony, tangy lemonade profile that's much more multifaceted than your standard-issue refresher.", "totalTime": "4 hours, or up to 13 hours (optional)", "recipeYield": "Makes 44 ounces (about 6 servings)", "recipeCategory": ["Father's Day", "Tea"], "recipeIngredient": ["3 pounds (1.3kg) lemons (10 to 14 medium lemons)", "14 ounces sugar (2 cups; 400g)", "4 cups <a href=\"https://www.seriouseats.com/recipes/2016/06/cold-brewed-iced-tea-recipe.html\">cold-brewed black tea</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring lemons to room temperature, then roll firmly against the counter to soften their rinds. Halve and juice; pour juice into a sealable container and refrigerate. Cut rinds into 1-inch chunks. Toss with sugar in a large nonreactive mixing bowl, cover tightly with plastic, and let stand at room temperature, stirring once every 45 minutes or so, until sugar has completely dissolved, about 3 hours. (You can let the mixture stand up to 12 hours, if desired.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 8 ounces (1 cup) of reserved lemon juice to rind mixture. Stir well, then strain through a nonreactive fine-mesh strainer or piece of cheesecloth into a glass or ceramic container. At this point, the concentrated lemonade can be refrigerated for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, pour concentrated lemonade and cold-brewed tea into a pitcher and stir. Serve in ice-filled glasses. (You will likely have some fresh lemon juice left over, which can be reserved for another use or added to individual glasses to make Arnold Palmer more tart to taste.)</p>"}]}