{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/10/20161020-roasted-sweet-potato-variations-brown-butter-rosemary-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["fall", "roast", "sweet potato", "thanksgiving", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Brown Butter Rosemary Roasted Sweet Potatoes", "link": "https://www.seriouseats.com/recipes/2016/10/brown-butter-rosemary-roasted-sweet-potatoes-recipe.html", "description": "An intense brown butter that's enriched with reduced chicken stock, infused with woodsy rosemary, and brightened with lemon juice adds incredible flavor to these intensely sweet roasted sweet potatoes.", "totalTime": "2 hours 15 minutes to 2 hours 30 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Christmas", "Easter", "Fall", "Gluten-Free", "Potato", "Roasting", "Sides", "Sweet Potatoes and Yams", "Thanksgiving", "Winter"], "recipeIngredient": ["3 pounds (1.4kg) sweet potatoes, peeled and cut into 1/2-inch chunks", "3 tablespoons (45ml) vegetable or canola oil", "Kosher salt and freshly ground black pepper", "1/2 packet unflavored gelatin (about 1 1/4 teaspoons; 4g)", "1/4 cup (60ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 stick unsalted butter (8 tablespoons; 115g)", "3 rosemary sprigs", "1 teaspoon (5ml) fresh juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place sweet potatoes in a large saucepan and cover with cold water. Heat water to 160&deg;F (70&deg;C) as registered on an instant-read thermometer. Cover and set aside for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven racks to upper-middle and lower-middle positions and preheat oven to 400&deg;F (200&deg;C). Drain sweet potatoes and transfer to a large bowl. Toss with oil and season to taste with salt and pepper. Spread sweet potatoes on 2 rimmed baking sheets and roast until bottom sides are browned, about 30 minutes. Carefully flip potatoes with a thin spatula and roast until second side is browned and potatoes are tender, about 20 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small container, sprinkle gelatin over chicken stock and let bloom for 5 minutes. Microwave until gelatin is dissolved, stopping and stirring as needed to help it dissolve, about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, melt butter over medium-high heat until foamy. Continue to cook, swirling pan, until milk solids in butter turn a deep hazelnut brown, 1 to 2 minutes. Remove from heat and add rosemary (don't be alarmed; butter will foam and fizzle when rosemary is added), swirling to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chicken stock to butter, return to medium heat, and bring to a simmer. Cook, swirling, until stock reduces slightly and sauce becomes rich and silky, about 3 minutes. Remove from heat, discard rosemary, and add lemon juice. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, toss potatoes with butter sauce and serve. Potatoes can be made in advance, tossed with sauce, and set aside until ready to serve; rewarm in the oven before serving.</p>"}]}