{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/10/chickencacciatore-1.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["braise", "chicken", "Italian", "italian american", "mushroom", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Chicken Cacciatore With Mushrooms, Tomato, and Onion", "link": "https://www.seriouseats.com/recipes/2016/10/chicken-cacciatore-mushrooms-recipe.html", "description": "An earthy, hearty version of the classic Italian dish, this recipe stars juicy, tender pieces of chicken leg, braised in white wine with mushrooms, onion, and tomato. It tastes like it spent hours in the oven, even though it's done in about an hour.", "totalTime": "1 hour 10 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Braising and Stewing", "Chicken", "Fall", "Italian", "Mains", "Mushrooms", "Stovetop", "Winter"], "recipeIngredient": ["3 to 4 pounds (1.4 to 1.8kg) bone-in, skin-on chicken legs, thighs and drumsticks split", "Kosher salt and freshly ground black pepper", "All-purpose flour, for dredging", "3 tablespoons (45ml) extra-virgin olive oil", "1 pound (450g) cremini mushrooms, washed, trimmed, and quartered", "1 medium (8-ounce; 225g) yellow onion, thinly sliced", "5 medium cloves garlic, thinly sliced", "3/4 cup (175ml) dry white wine", "1 (28-ounce; 795g) can peeled whole tomatoes, drained and crushed by hand, plus 1/2 cup (120ml) reserved juices from can", "2 sprigs fresh rosemary, sage, or thyme", "1 bay leaf", "Minced flat-leaf parsley, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (175&deg;C). Season chicken all over with salt and pepper. Pour a roughly 1/2-inch layer of flour into a wide, shallow bowl. Dredge each chicken piece in flour and tap off excess.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a Dutch oven or large straight-sided sauté pan, heat oil over medium-high heat until shimmering. Working in batches, add chicken and cook, turning occasionally, until browned all over, about 4 minutes per side. Transfer chicken to a platter as it finishes cooking and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mushrooms to pan and cook, scraping up browned bits with a wooden spoon and stirring occasionally, until browned all over, about 8 minutes. Add onion and garlic and cook, stirring and scraping up any browned bits, until softened, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and bring to a simmer. Add tomatoes and reserved juices, along with herb sprigs and bay leaf. Return to a simmer. Season with salt and pepper. Nestle chicken and any accumulated juices into liquid and vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to oven and cook, uncovered, until chicken is fully cooked through and tender and sauce is slightly reduced and thickened, about 30 minutes. Discard herb sprigs and bay leaf. Serve right away, garnishing with minced parsley if desired.</p>"}]}