{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/07/20160524-beet-sandwich-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["beet", "fennel", "sandwich", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roasted-Beet Sandwiches With Ginger, Fennel, and Goat Cheese", "link": "https://www.seriouseats.com/recipes/2016/07/beet-sandwich-goat-cheese-fennel-recipe.html", "description": "Beets may not be a common sandwich filling, but they add everything a good sandwich needs: a tender, juicy bite, and plenty of flavor. Here, their sweetness is balanced with fresh ginger, raw scallions, and a fennel salad dressed with a dash of mustard.", "totalTime": "2 hours", "recipeYield": "Makes 4 sandwiches", "recipeCategory": ["Sandwiches", "Vegetarian"], "recipeIngredient": ["4 large beets with their greens (2 pounds; 1 kg), greens and their stems cut from beet roots (see note)", "1/4 cup (60ml) extra-virgin olive oil, plus more for drizzling", "2 tablespoons (30ml) red wine vinegar", "1 (2-inch) knob fresh peeled ginger, grated", "1/2 teaspoon (3ml) Dijon mustard ", "Kosher salt and freshly ground black pepper", "4 large slices country bread, halved, drizzled with olive oil, and lightly toasted", "1 handful picked flat-leaf parsley leaves (about 1/4 packed cup)", "1 medium fennel bulb, <a href=\"http://www.seriouseats.com/2016/05/knife-skills-how-to-cut-fennel-slice-dice.html\">halved, cored, and thinly sliced</a>, plus 1 small handful picked fennel fronds", "1 scallion, thinly sliced", "1 ounce (30g) fresh goat cheese, crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (175&deg;C). Place beet roots in an oven-safe skillet or roasting pan, drizzle with olive oil to coat lightly, and add a couple of tablespoons of water. Cover tightly with foil and roast until a fork can be easily inserted into the center of each beet, about 1 1/2 hours. Remove from oven, uncover, and let beets rest until cool enough to handle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, separate beet stems from leaves. Bring a medium pot of salted water to a boil. Add stems and cook until tender, about 3 minutes, then transfer to ice bath to cool. Repeat with leaves, cooking about 1 minute. Drain leaves and stems well and squeeze dry of excess moisture. Roughly chop beet leaves and stems and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wearing latex gloves (to avoid staining your skin), use paper towels to rub off beet root skins. Trim off root ends and any other blemishes with a knife. Slice beets into 1/4-inch slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, whisk together 1/4 cup olive oil with vinegar, ginger, and mustard. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss sliced beets in dressing until coated. Arrange toasted bread on a work surface. Lift beet slices from dressing, allowing excess dressing to drain off, then layer them on half of the bread slices. Add the sliced fennel and its fronds, the parsley, the reserved beet greens and stems, and the scallions to the dressing and toss to coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mound the dressed salad on top of the beet slices. Crumble goat cheese all over, close sandwiches, and serve.</p>"}]}