{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20151218-braised-chicken-thigh-cabbage-pancetta-recipe-kenji-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["cabbage", "chicken", "comfort", "easy", "low carb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7692307692308", "ratingCount": "13"}, "name": "Crispy Braised Chicken Thighs With Cabbage and Bacon", "link": "https://www.seriouseats.com/recipes/2016/01/braised-chicken-thighs-cabbage-bacon-recipe.html", "description": "Some people have fallback recipes. The ones that they pull out again and again when they can't think of something new to make. I've got a couple of those, but I also have fallback techniques&mdash;basic blueprints for constructing a dish that can be infinitely variable depending on the specific ingredients you use. Braising chicken with crispy skin is one of those techniques. This time, I'm pairing it with cabbage and bacon.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Cabbage", "Chicken", "Mains", "Quick Dinners"], "recipeIngredient": ["2 1/2 pounds bone-in, skin-on chicken thighs (6 to 8 thighs; 1.15kg)", "Kosher salt and freshly ground black pepper", "1 tablespoon (15ml) vegetable oil", "8 ounces (225g) slab bacon or salt pork, cut into 1/2- by 1/4-inch lardons", "1 medium onion, thinly sliced (about 6 ounces; 170g)", "1 pound finely shredded cabbage (about 1 medium head; 450g)", "2 tablespoons (30ml) whole grain mustard", "1/2 cup (120ml) apple cider vinegar ", "3 cups  (700ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "3 tablespoons sugar", "2 bay leaves", "6 sprigs thyme", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350&deg;F (175&deg;C). Season chicken generously with salt and pepper. Heat oil in a 4- to 5-quart straight-sided sauté pan over medium-high heat until shimmering. Add chicken, skin side down, and cook without moving it until well browned and crisp, about 8 minutes total, lowering heat if it starts to smoke excessively. Flip chicken and brown lightly on second side, about 3 minutes. Transfer chicken to a large plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon to pan and cook, stirring, until lightly browned, about 3 minutes. Add onion and cook, stirring, until softened and starting to brown, about 4 minutes. Add cabbage and cook, stirring, until softened and starting to brown, about 4 minutes. Add mustard and vinegar and cook, stirring and scraping up browned bits from bottom of pan. Add chicken stock, sugar, bay leaves, and thyme sprigs and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nestle chicken back into sauté pan, leaving the skin above the liquid but submerging most of the meat. Transfer pan to oven and cook, uncovered, until chicken is totally tender and liquid has reduced by about half, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from oven and transfer chicken to a serving platter. Stir butter into sauté pan and season to taste with salt and pepper. Serve immediately, spooning cabbage and sauce into shallow bowls and topping with chicken.</p>"}]}