{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20161026-cauliflower-puree-vicky-wasik-17.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["cauliflower", "easy", "fall", "puree", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "Rich and Nutty Roasted-Cauliflower Purée", "link": "https://www.seriouseats.com/recipes/2016/11/rich-nutty-roasted-cauliflower-puree-recipe.html", "description": "By roasting the cauliflower for this purée, we bring out deep, nutty flavors. The resulting dish has a complex flavor that's suited to more of a starring role in a dish&mdash;say, as a bold accompaniment to a simple piece of protein, like steamed or poached fish or chicken. Alternatively, you could go all in on its more robust flavor, serving it with something that can stand up to it, like a thick, juicy steak with a deeply seared crust.", "totalTime": "45 minutes", "recipeYield": "Makes about 3 cups (720ml)", "recipeCategory": ["Cauliflower", "Christmas", "Fall", "Gluten-Free", "Roasting", "Seasonal and Holiday", "Sides", "Thanksgiving", "Vegetarian", "Winter"], "recipeIngredient": ["1 (2-pound; 925g) head cauliflower, trimmed and cut into florets", "3 tablespoons (45ml) extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "2 tablespoons (30g) unsalted butter", "1 large (8-ounce; 225g) yellow onion, thinly sliced", "4 medium cloves garlic, thinly sliced", "Pinch cayenne pepper", "1 cup (235ml) heavy cream or <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock (or a combination of the two; see note)", "1 sprig thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 500&deg;F (260&deg;C). Place cauliflower on a foil-lined rimmed baking sheet, toss with olive oil, and season with salt and pepper. Roast, flipping cauliflower with a thin metal spatula halfway through roasting, until cauliflower is tender and deeply browned on both sides, about 20 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, melt butter over medium-high heat. Add onion, garlic, and cayenne and cook, stirring often, until softened and just starting to turn golden, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cauliflower, cream and/or stock, and thyme. Bring to a simmer, then cook, adjusting heat to maintain simmer, until cauliflower has softened in the liquid, about 5 minutes. Discard thyme sprig.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a blender or immersion blender, blend cauliflower and liquid to form a very smooth purée. Season with salt and pepper. (You can adjust purée consistency as needed: Thicken by cooking down further while stirring often over low heat in a wide nonstick skillet, or thin by adding liquid, such as stock, cream, or water.) Serve warm.</p>"}]}