{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160603-tortilla-espanola-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Spanish", "keywords": ["egg", "omelette", "potato", "snack", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Tortilla Española (Spanish Egg and Potato Omelette)", "link": "https://www.seriouseats.com/recipes/2016/07/tortilla-espanola-spanish-potato-omelette-recipe.html", "description": "<em>Tortilla española</em>, one of Spain's most famous and beloved national dishes, is nothing more than egg, potato, and onion cooked in olive oil. And yet, when attention is paid to the technique, it's one of the most profoundly delicious dishes imaginable. Here's how to make it.", "totalTime": "45 minutes", "recipeYield": "Makes 1 (10-inch) tortilla", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Omelettes", "Potato", "Snacks", "Spanish", "Vegetarian"], "recipeIngredient": ["8 large eggs", "Kosher salt", "2 cups (475ml) extra-virgin olive oil (see note)", "1 1/2 pounds (700g) Yukon Gold potatoes, peeled, halved, and thinly sliced crosswise", "3/4 pound (350g) yellow onions, thinly sliced", "<em><a href=\"http://www.seriouseats.com/recipes/2015/01/two-minute-foolproof-aioli-recipe.html\">Allioli</a></em>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, beat eggs vigorously with a large pinch of salt until frothy. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a 10-inch nonstick or well-seasoned carbon steel skillet, heat oil over medium-high heat until shimmering. Add potatoes and onions; they should gently (but not vigorously) bubble in the oil. Regulating heat to maintain a gentle bubbling, cook, stirring occasionally, until potatoes and onions are meltingly tender, about 25 minutes. Set a fine-mesh strainer over a heatproof bowl and drain potatoes and onions of excess oil. Reserve oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer potatoes and onions to a medium heatproof bowl and season generously with salt, stirring well to combine. Beat eggs vigorously to re-froth, then scrape potato and onion in and stir until thoroughly combined. Set aside for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, wipe out skillet. Add 3 tablespoons (45ml) reserved frying oil to skillet and set over medium-high heat until shimmering. Scrape egg mixture into skillet and cook, swirling and shaking pan rapidly, until bottom and sides begin to set, about 3 minutes. Using a heatproof spatula, press the edges in to begin to form the tortilla's puck shape. Continue to cook, adjusting heat to prevent bottom of tortilla from burning, until beginning to set around edges, about 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working over a sink or garbage can, place a large overturned flat plate or lid on top of skillet, set hand on top (using a dish towel if you are sensitive to heat), and, in one very quick motion, invert tortilla onto it. Add 1 more tablespoon (15ml) reserved oil to skillet and return to heat. Carefully slide tortilla back into skillet and continue to cook until second side is beginning to firm up, about 2 minutes. Use rubber spatula to again press the sides in all around to form a rounded puck shape. Continue to cook tortilla until lightly browned on second side but still tender in the center when pressed with a finger, about 2 minutes longer. If desired, you can flip tortilla 2 to 3 more times during these last minutes of cooking, which helps to cook the center more evenly and reinforce the shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully slide tortilla out of skillet onto a clean plate (or invert it onto a clean plate using same method as before) and let stand at least 5 minutes before serving with <a href=\"http://www.seriouseats.com/recipes/2015/01/two-minute-foolproof-aioli-recipe.html\">allioli</a>. Tortilla can be cut into wedges for a larger meal or into cubes for an hors d'oeuvre&ndash;sized snack. It is just as good, if not better, at room temperature. Leftover tortilla can be refrigerated up to 3 days; allow to return to room temperature before serving. Remaining frying oil can be used in other dishes; it has an excellent flavor thanks to the long cooking with potato and onion.</p>"}]}