{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/07/20160623-potluck-dishes-lentil-salad-zucchini-poblano-peppers-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Kristin Donnelly"}, "recipeCuisine": "", "keywords": ["grilling", "lentil", "salad", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoky Lentil Salad With Zucchini and Poblano Peppers", "link": "https://www.seriouseats.com/recipes/2016/07/smoky-lentil-salad-zucchini-poblano-pepper-recipe.html", "description": "Poblano peppers add a subtle, sneaky heat to this hearty lentil salad that's perfect for feeding a crowd, while grilled or broiled vegetables add tons of flavor. Remember: Lentils taste best when they're nicely seasoned, so don't be too shy with the salt.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 6 to 8 as a side", "recipeCategory": ["Beans and Pulses", "Dairy-Free", "Salads", "Vegan", "Vegetarian"], "recipeIngredient": ["1 cup black or de Puy lentils (7.5 ounces; 200g)", "Kosher salt", "2 medium zucchini (about 1 pound; 450g total), sliced lengthwise about 1/2 inch thick", "1 bunch scallions (about 8 small scallions)", "1/4 cup plus 1 tablespoon (75ml) extra-virgin olive oil, divided", "1/2 teaspoon (2g) ground cumin", "2 medium Poblano peppers (about 8 ounces total)", "1/4 cup (60ml) apple cider vinegar", "1/8 teaspoon <em>pimentón de la Vera</em> or smoked paprika (about 1 large pinch)", "1/2 cup lightly packed picked cilantro leaves (about 1 handful), very roughly chopped, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, cover lentils with water by 2 inches and season with salt. Bring to a simmer over medium heat, then cook until lentils are just tender, about 25 minutes; adjust heat to maintain a low simmer. Drain well, transfer to a large serving bowl, and season with salt as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, toss zucchini and scallions with 1 tablespoon (15ml) olive oil and cumin. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, If Using a Grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set all burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill Poblanos over direct heat, turning occasionally, until blistered and charred all over, about 10 minutes. Transfer Poblanos to a heatproof bowl, cover with plastic, and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill zucchini over direct heat, turning once, until just tender, about 5 minutes; transfer to a work surface. Grill scallions over direct heat, turning once, until just barely softened and browned in spots, about 2 minutes. Transfer to a work surface. Continue to step 8.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using a Broiler:</strong> Set broiler to high heat and set oven rack in top position. Set Poblanos directly on oven rack and broil, turning occasionally, until blistered and charred all over, about 8 minutes. Transfer Poblanos to a heatproof bowl, cover with plastic, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange zucchini in an even layer on a rimmed baking sheet. Broil on one side only until lightly browned on top, about 10 minutes; transfer to a work surface. Arrange scallions in an even layer on the same baking sheet and broil on one side only until just barely softened and browned in spots, about 4 minutes; transfer to a work surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dice zucchini, thinly slice scallions crosswise, and add to lentils. Using paper towels, rub charred skins off Poblanos, then stem and seed them. Dice Poblanos and add to lentils.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vinegar, smoked paprika, 1/2 cup cilantro, and remaining 1/4 cup olive oil. Toss to combine. Season with salt. Garnish with cilantro leaves before serving warm or at room temperature.</p>"}]}