{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160802-scordalia-greek-potato-dip-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["dip", "garlic", "greek", "Mediterranean", "potato", "spread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Skordalia (Greek Garlic and Potato Spread)", "link": "https://www.seriouseats.com/recipes/2016/09/skordalia-greek-garlic-potato-spread-dip-recipe.html", "description": "Don't wait for the cold weather to set in to enjoy mashed potatoes: Take a page from the Greeks with <em>skordalia</em>, a garlicky, tangy mashed potato dip. Flavored with olive oil, vinegar, almonds, and plenty of raw garlic, then served chilled or at room temperature, it'll give you a whole new perspective on what mashed potatoes can be.", "totalTime": "35 minutes", "recipeYield": "Makes about 3 cups", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Dairy-Free", "Garlic", "Potato", "Snacks", "Vegan", "Vegetarian"], "recipeIngredient": ["2 medium russet potatoes (about 1 pound; 450g), peeled and cut into 3/4-inch cubes", "Kosher salt", "3 ounces whole blanched almonds (1/2 cup; 85g)", "4 to 6 medium cloves garlic (see note)", "1/4 cup plus 2 tablespoons (90ml) white wine vinegar and/or fresh lemon juice (from about 2 lemons; see note)", "3/4 cup (180ml) extra-virgin olive oil", "Minced flat-leaf parsley, for garnish", "Warmed pita and/or bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F. Set cubed potatoes in a colander and rinse under cold water until water runs clear. Transfer to a large saucepan and cover with cold water by at least 2 inches. Season water with salt until it is <a href=\"http://www.seriouseats.com/2014/05/how-salty-should-pasta-water-be.html\">salty like tears</a>. Bring water to a boil over high heat, then reduce heat to medium-low and simmer until a knife easily pierces potatoes with no resistance, 10 to 15 minutes. Drain potatoes in colander, then rinse with hot running water for 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a food processor, combine almonds, garlic, 2 tablespoons (30ml) cold water, and wine vinegar and/or lemon juice. Process until garlic and almonds are reduced to a paste. Season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread potatoes in an even layer on a rimmed baking sheet and transfer to oven until excess moisture has evaporated and surface of potatoes is dry, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a potato ricer or a food mill with the finest disk, mash potatoes into a large mixing bowl. Alternatively, thoroughly mash potatoes with a potato masher in a large mixing bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in olive oil and almond-garlic mixture until thoroughly incorporated. If skordalia looks like it's breaking slightly (i.e., if the oil does not fully incorporate to form a homogeneous mixture), stir in more cold water, 1 tablespoon at a time, beating well, until mixture is emulsified. Season with salt, then garnish with parsley and serve immediately with warm pita or bread, or chill until ready to serve.</p>"}]}