{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160827-sous-vide-tuna-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["fish", "seafood", "seared tuna", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.25", "ratingCount": "4"}, "name": "Sous Vide Tuna", "link": "https://www.seriouseats.com/recipes/2016/09/sous-vide-tuna-recipe.html", "description": "Rare seared tuna might have fallen off the menus of the most fashionable restaurants, where it ruled the scene from the late '90s through the 2000s, but that doesn't make it any less delicious. Usually, this meant tuna served in the style of <em>tataki</em>, a traditional Japanese preparation in which the bulk of the tuna is essentially cold and raw. With the precise control of a sous vide cooker, you have a few more options. Rather than cold and raw in the center, you can serve tuna that's heated just to the point of starting to firm up, giving it an even meatier bite while maintaining a gorgeous, translucent deep red color and moist texture.", "totalTime": "1 hour 15 minutes to 1 hour 45 minutes (depending on size of steaks), or up to overnight", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Fish", "Gluten-Free", "Mains", "Sous Vide", "The Food Lab"], "recipeIngredient": ["2 (10- to 12-ounce) tuna steaks (about 1 1/2 to 2 inches thick; 280 to 320g each) (see note)", "Kosher salt and freshly ground black pepper", "2 tablespoons (30ml) extra-virgin olive oil", "Aromatics such as fresh thyme, dill, parsley, thinly sliced shallots, and/or citrus zest (optional)", "1/2 cup (60g) black or white sesame seeds (optional; for searing)", "2 teaspoons (10ml) vegetable oil, if serving seared"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season tuna generously with salt and pepper on all sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tuna in a single layer in a gallon-size zipper-lock bag, or in 2 individual quart-size bags. Add olive oil to bag, or divide it between smaller bags, and turn tuna to coat. Add aromatics to bags, if using. Close bags, place in refrigerator, and let tuna rest for at least 30 minutes or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using your precision cooker, preheat a water bath according to the chart above. Remove the air from the zipper-lock bags using the <a href=\"http://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">water displacement method</a>: Seal bag almost all the way, leaving about an inch open. Slowly lower bag into water bath, holding the opened end above the water level. As bag is lowered, the water pressure should force air out of it. Just before it is fully submerged, seal bag completely. Use a rack, or clip bag to the side of cooking vessel using a binder clip, to prevent it from moving excessively.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook 30 to 45 minutes for steaks 1 inch thick or less, or 45 minutes to an hour for steaks between 1 and 2 inches. Carefully remove tuna from bags and transfer to a double layer of paper towels. Discard aromatics and gently blot top of tuna with more paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Sashimi- or Canned-Tuna-Style Fish:</strong> Wrap tuna in plastic wrap and chill in refrigerator for at least 2 hours and up to overnight. Serve rare tuna like sashimi, or well-done tuna in place of canned tuna in any recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Sear:</strong> Season tuna aggressively with freshly ground black pepper, or place sesame seeds in a shallow plate and roll tuna steaks to coat on all sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a cast iron, carbon steel, or nonstick skillet over high heat until lightly smoking. Carefully add tuna and cook, without moving, until golden, 30 to 45 seconds. Carefully flip and cook for an additional 30 to 45 seconds. Using tongs, hold tuna upright to sear edges all around. Transfer to paper towels to blot off excess oil, then serve immediately, serving one large steak for every 2 guests.</p>"}]}