{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160126-thai-beef-basil-02-composite-kenji.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Thai", "keywords": ["Asian", "basil", "beef", "quick", "stir fry", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "7"}, "name": "Thai-Style Beef With Basil and Chilies (Phat Bai Horapha)", "link": "https://www.seriouseats.com/recipes/2016/01/thai-style-beef-basil-chilies-recipe.html", "description": "<em>Phat ka-phrao</em> is a ubiquitous street dish in Thailand, where cooks wielding woks will stir-fry sliced or minced meat flavored with aromatics and Thai chilies, then finish it off with holy basil. But holy basil is tough to come by in the States, so I generally choose to accept the fact that when I make my own version, it's going to be <em>phat bai horapha</em> instead&mdash;still authentic, and darned delicious in its own right.", "totalTime": "30 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Beef", "Mains", "Quick Dinners", "Stir Frying", "Thai"], "recipeIngredient": ["1 pound (450g) flank steak, skirt steak, hanger steak, or flap meat, cut into 1/4-inch-thick strips", "1 tablespoon (15ml) soy sauce, divided", "5 teaspoons (25ml) Asian fish sauce, divided", "1 teaspoon (4g) white sugar", "4 to 6 fresh red or green Thai bird chilies, divided", "6 medium cloves garlic, divided", "1 1/2 tablespoons (20g) palm sugar (see note)", "1 small shallot, thinly sliced", "4 makrut lime leaves, very thinly sliced into hairs (central vein discarded), plus more for garnish (see note)", "2 tablespoons (30ml) vegetable or canola oil, divided ", "2 cups packed Thai purple basil (about 2 ounces; 55g)(see note)", "Dried Thai chili flakes or red pepper flakes to taste (optional)", "1/4 cup <a href=\"http://www.seriouseats.com/recipes/2013/02/thai-style-fried-shallots.html\">fried shallots</a> (see note)", "Kosher salt", "Cooked rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine beef, 1 teaspoon soy sauce, 2 teaspoons fish sauce, and white sugar in a bowl. Toss to combine and set in refrigerator to marinate for at least 15 minutes and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roughly chop half of Thai chilies and garlic and place inside a stone mortar with palm sugar. Grind with pestle until a mostly smooth paste has formed. Add remaining fish sauce and soy sauce and mash in mortar to form a sauce. Set aside. Finely slice remaining garlic and chilies and combine with shallot and lime leaves in a small bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, heat 1 tablespoon oil in a wok over high heat until smoking. Add half of beef and cook, without moving, until well seared, about 1 minute. Continue cooking, while stirring and tossing, until beef is lightly cooked but still pink in spots, about 1 minute. Transfer to a large bowl. Repeat with 1 more tablespoon oil and remaining beef, transferring beef to the same bowl. Wipe out wok.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat wok over high heat and add all of the beef, along with sliced garlic/chili/makrut lime mixture. Continue to cook, tossing and stirring constantly, until stir-fry is aromatic and shallots have completely softened, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sauce mixture to wok and cook, tossing and stirring constantly, until completely reduced. (The beef should look moist, but there should be no liquid in the bottom of the wok.) Immediately add basil and toss to combine. Season to taste with salt and and optional Thai chili or red pepper flakes. Transfer to a serving platter. Top with more makrut lime threads and fried shallots. Serve immediately with rice.</p>"}]}