{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20161208-sous-vide-lobster-02-breakdown.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["lobster", "seafood", "shellfish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8571428571429", "ratingCount": "7"}, "name": "Sous Vide Lobster", "link": "https://www.seriouseats.com/recipes/2016/12/sous-vide-lobster-recipe.html", "description": "If buttery, tender, sweet poached flavor is what you're after, there's no better way to cook it than sous vide. It's also a heck of a lot more foolproof than boiling or steaming, and affords the opportunity to infuse that lobster meat with extra flavor. Think: lobster with the butter built right into it. Doesn't that sound swell?", "totalTime": "40 minutes to 1 hour 20 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Christmas", "Father's Day", "Gluten-Free", "Lobster and Crab", "Mains", "Mother's Day", "New Year", "Sous Vide", "The Food Lab", "Valentine's Day"], "recipeIngredient": ["2 whole live lobsters, about 1 1/2 pounds each (see note)", "2 tablespoons (30g) unsalted butter", "2 sprigs fresh tarragon", "Lemon wedges, for serving", "1/4 cup (60ml) <a href=\"http://www.seriouseats.com/recipes/2015/08/clarified-butter-recipe.html\">Clarified Butter</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Kill each lobster by plunging a knife directly into its head, splitting its carapace in half. Twist off the tail and claws. Discard carapace or save for stock.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay tails flat against a cutting board and insert two stiff wooden or metal skewers along the length of the tails, keeping as close to the shell as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare an ice bath. Bring a large pot of water or a steamer to a rolling boil. Add lobster tails and claws and cook for 1 minute. Remove tails with tongs and transfer to ice bath. Continue cooking claws for 4 minutes longer, then transfer to ice bath.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shuck lobster tails by first squeezing sides of shell inward until they crack. Pull sides of shell outward. The shell should open up easily. Remove tail meat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To remove claw meat, break off the small pincer, being careful to get the meat out of it. Using kitchen shears or the spine of a heavy knife, crack bottom of shell to create an opening large enough to extract the meat. Carefully remove claw meat by shaking shell up and down, or by using the back of a wooden skewer to slide it out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To remove knuckle meat, snip open shells with kitchen shears and use the back of a wooden skewer to remove meat. If knuckles are especially spiky, use a kitchen towel to help grasp them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sous vide precision cooker, preheat a water bath to desired temperature according to the chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place meat in a heavy-duty zipper-lock bag or a vacuum bag. Add 2 tablespoons (30g) butter and tarragon sprigs. Remove all air from bag using the <a href=\"http://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">water displacement method</a> or a vacuum sealer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bagged meat to water bath and cook for at least 20 minutes and up to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lobster from bag, discard tarragon, and serve immediately with lemon wedges and hot clarified butter for dipping.</p>"}]}