{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160812-bruschetta-vicky-wasik-26.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["bruschetta", "essential", "fall", "Italian", "spring", "toast", "tomato", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Oven-Roasted Tomato Bruschetta", "link": "https://www.seriouseats.com/recipes/2016/08/canned-tomato-bruschetta-recipe.html", "description": "When fresh tomatoes are out of season, this should be your go-to bruschetta recipe. By gently oven-roasting canned tomatoes (which are packed when truly ripe), you end up with a deeply flavored, jammy, and delicious topping. You won't even miss the fresh tomatoes&mdash;guaranteed.", "totalTime": "1 hour 25 minutes", "recipeYield": "Makes about 2 cups", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Dairy-Free", "Italian", "Snacks", "Tomato", "Vegan", "Vegetables", "Vegetarian"], "recipeIngredient": ["2 (28-ounce; 794g) cans peeled whole tomatoes, drained, stem ends trimmed and any bits of skin removed", "Kosher salt", "1/4 cup (60ml) extra-virgin olive oil, plus more for drizzling", "15 large basil leaves, thinly sliced into a chiffonade", "Red wine vinegar, to taste", "Sugar, to taste", "Freshly toasted sliced bread, for serving", "Halved garlic cloves, for rubbing on toasts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F (150&deg;C). Line a rimmed baking sheet with parchment paper. Working over a bowl, using your fingers, tear each tomato in half and press out and discard the seeds. Arrange tomatoes on prepared baking sheet in one layer, season with salt, and drizzle all over with olive oil. Transfer to oven and cook until excess juices have evaporated and tomatoes look slightly dry on the exterior but still moist within, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer oven-roasted tomatoes to a work surface and chop finely. Transfer to a large mixing bowl. Add 1/4 cup olive oil and basil and stir well. Season with salt and add red wine vinegar, about 1 teaspoon at a time, until tomatoes are very lightly tart. Stir in a pinch of sugar to help pump up tomatoes' natural sweetness even more; add more sugar sparingly to taste, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rub top sides of toasts all over with garlic (rub more on for a stronger flavor, or less for a gentler one). Drizzle toasts with olive oil and season lightly with salt. Spoon tomatoes on top and serve.</p>"}]}