{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160105-homemade-egg-mcmuffin-recipe-kenji-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "breakfast sandwich", "easy", "egg", "McDonald's", "quick", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "15"}, "name": "Homemade Egg McMuffin", "link": "https://www.seriouseats.com/recipes/2016/01/homemade-egg-mcmuffin-mcdonalds-recipe.html", "description": "For all its recognition and all that it gets right, the McDonald's Egg McMuffin is an inherently flawed product. One that, with a little time and effort, can be improved upon at home. Here's how I make mine. Hopefully, we'll learn some lessons that can be applied to <em>all</em> breakfast sandwiches, not just Egg McMuffin clones.", "totalTime": "10 minutes", "recipeYield": "Makes 1 sandwich", "recipeCategory": ["Breakfast and Brunch", "Eggs", "Father's Day", "Mother's Day", "Recipes", "Sandwiches", "The Food Lab"], "recipeIngredient": ["1 tablespoon unsalted butter (1/2 ounce; 15g), softened, divided", "1 English muffin, split", "1 slice high-quality Canadian bacon", "Nonstick cooking spray", "1 large egg", "Kosher salt and freshly ground black pepper", "1 slice American, cheddar, Swiss, or Jack cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread 1 teaspoon butter on each half of the English muffin and place halves in a 10-inch nonstick or cast iron skillet over medium heat. Cook, swirling muffin halves and pressing gently to get good contact with pan, until both pieces are well browned, about 4 minutes. Transfer to a sheet of aluminum foil, split side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt remaining 1 teaspoon butter in the now-empty skillet and increase heat to medium-high. Add bacon and cook, turning frequently, until browned and crisp around the edges, about 1 1/2 minutes. Transfer bacon to lower muffin half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the lid of a quart-sized, wide-mouthed Mason jar (both the lid and the sealing ring) upside down in the now-empty skillet. (The side the jar screws onto should be facing up.) Spray the inside with nonstick cooking spray and break egg into it. Poke the egg yolk with a fork to break it and season with salt and pepper. Pour 3/4 cup (180ml) water into the skillet, cover, and cook until egg is set, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a thin spatula, transfer Mason jar lid to a paper towel&ndash;lined plate. Pour excess water out of the skillet and return it to the stovetop with the heat off. Flip Mason jar lid over and gently remove it to release egg. Place egg on top of bacon and top with cheese slice. Close sandwich, wrap in aluminum foil, and return to the now-empty skillet. Let it warm up in the skillet for 2 minutes with the heat off, flipping occasionally. Unwrap and serve immediately.</p>"}]}