{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160701-sous-vide-pulled-pork-03.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barbecue", "indoor barbecue", "low carb", "pork", "pulled pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4117647058824", "ratingCount": "17"}, "name": "Sous Vide Barbecue Pulled Pork Shoulder", "link": "https://www.seriouseats.com/recipes/2016/07/sous-vide-barbecue-pulled-pork-shoulder-recipe.html", "description": "Don't get me wrong. I like a good slow-smoked, true barbecue pork shoulder just as much as the next guy. In fact, I probably like the process way more than the next guy. Still, there are times when we want things a little more streamlined, a little more hands-off, a little more reliable. Not only that, but using a sous vide cooker to cook pork shoulder can allow you to achieve textures you can't get with traditional cooking methods.", "totalTime": "21 to 27 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Dairy-Free", "Mains", "Pork", "Sous Vide", "The Food Lab"], "recipeIngredient": ["<strong>For the Spice Rub:</strong>", "1/4 cup (50g) paprika", "1/4 cup (50g) dark brown sugar", "3 tablespoons (35g) kosher salt", "1/2 teaspoon (2g) <dorado id=\"pink-curing-salt\" class=\"text\">Prague Powder #1</dorado> (optional; see note)", "1 tablespoon (12g) whole yellow mustard seed ", "1 teaspoon (4g) freshly ground black pepper", "2 tablespoons (20g) granulated garlic powder ", "1 tablespoon (8g) dried oregano", "1 tablespoon (12g) whole coriander seed", "1 teaspoon (4g) red pepper flakes ", "<strong>For the Pork:</strong>", "1 whole boneless or bone-in pork butt (shoulder), 5 to 7 pounds total (2.25 to 3.25kg)", "1/2 teaspoon (3ml) liquid smoke, such as <dorado id=\"liquid-smoke\" class=\"text\">Wright's Liquid Smoke</dorado> (optional; see note)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spice Rub:</strong> Working in batches, combine paprika, brown sugar, salt, Prague Powder (if using), mustard seed, black pepper, garlic powder, oregano, coriander seed, and red pepper flakes in a spice grinder and reduce to a fine powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide mixture in half. Rub half of mixture evenly all over pork shoulder, pressing it in until it adheres. Place pork shoulder in a sous vide&ndash;safe vacuum-sealer bag. Add liquid smoke (if using) and seal bag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook:</strong> Set your precision cooker to 165&deg;F (74&deg;C) for more traditionally textured pulled pork, or 145&deg;F (63&deg;C)  for sliceable but tender pork. When the bath is at temperature, add sealed bag with pork and cover with foil or plastic wrap. Allow to cook for 18 to 24 hours. After this stage, pork can be refrigerated for up to 1 week before continuing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish in the Oven:</strong> Adjust oven rack to lower-middle position and preheat oven to 300&deg;F. Remove pork from sous vide bag and carefully blot dry with paper towels. (The liquid from the bag can be added to your favorite barbecue sauce and simmered down to provide extra flavor.) Rub reserved spice mixture into the surface of the pork. Place pork on a wire rack set in a rimmed baking sheet and place in oven. Roast until a deep, dark bark has formed, about 1 1/2 hours. Continue with step 7.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on the Grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1/2 chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove pork from bag and carefully blot dry with paper towels. (The liquid from the bag can be added to your favorite barbecue sauce and simmered down to provide extra flavor.) Rub reserved spice mixture into the surface of the pork. Place pork on the cooler side of grill. Add 4 to 5 hardwood chunks to the hotter side of grill. Cover and allow pork to smoke, adjusting vents to maintain a temperature between 275 and 300&deg;F and adding 2 to 3 wood chunks twice during cooking. Smoke until a deep, dark bark has formed, about 1 1/2 hours. Continue with step 7.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pork to a large bowl or cutting board. Using a couple of forks, shred meat into bite-size pieces (or, if you cooked it at 145&deg;F, use a knife to slice the pork). Season pulled pork to taste with salt and serve immediately, passing your favorite barbecue sauce at the table.</p>"}]}