{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160801-seekh-kebab-recipe-01-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Middle Eastern", "keywords": ["beef", "grill", "Indian", "kebab", "lamb", "Pakistani", "skewer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6", "ratingCount": "5"}, "name": "Seekh Kebabs (Pakistani Spicy Grilled Ground Meat Skewers)", "link": "https://www.seriouseats.com/recipes/2016/08/seekh-kebab-spiced-grilled-ground-beef-lamb-skewer-recipe.html", "description": "When a Pakistani friend of mine in college introduced me to the little packets of pre-blended <em>seekh kebab</em> spices at our local Indian market, it was something of a revelation. <em>Oh, <strong>this</strong> is what a balanced spice blend tastes like.</em> These days, though, I like to up the ante and cook seekh kebabs up from scratch, using a homemade mixture of spices.", "totalTime": "1 hour, plus up to 1 day for resting", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Beef", "Indian", "Lamb", "Mains", "Middle Eastern"], "recipeIngredient": ["<strong>For the Spice Blend:</strong>", "2 teaspoons (6g) whole black peppercorns", "1 1/2 teaspoons (4g) whole coriander seed ", "1 teaspoon (4g) whole cumin seed ", "2 whole cloves (1g)", "2 whole bay leaves", "2 teaspoons (8g) sweet paprika", "1/2 teaspoon (2g) cayenne pepper", "3 teaspoons (12g) kosher salt  (if using table salt, use 1 1/2 teaspoons by volume, or 12g by weight)", "1 teaspoon (4g) amchur powder (see note)", "<strong>For the Aromatics:</strong>", "1 medium red onion, roughly chopped (about 6 ounces; 170g)", "2 cups loosely packed fresh cilantro leaves (about 2 ounces; 55g)", "4 medium cloves garlic, roughly chopped (about 3/4 ounce; 20g)", "1 1/2 tablespoons grated fresh ginger, roughly chopped (about 3/4 ounce; 20g)", "1 to 4 green Thai bird chilies, stems removed (to taste; they are very spicy)", "1 1/2 teaspoons sugar (about 1/4 ounce; 7g)", "2 pounds (1kg) ground lamb or beef (about 20% fat content) ", "<strong>To Serve:</strong>", "Shredded cabbage or 1 recipe <a href=\"http://www.seriouseats.com/recipes/2016/08/spicy-cabbage-red-onion-slaw-recipe.html\">Spicy Cabbage and Red Onion Slaw</a>", "Sliced cucumbers, tomatoes (cut into bite-size pieces), and lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toast peppercorns, coriander, cumin, and cloves in a dry skillet over medium heat, tossing and shaking frequently, until fragrant, about 1 minute. Transfer to a spice grinder. Add bay leaves and grind to a fine powder. Transfer to the bowl of a food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add paprika, cayenne, salt, amchur, red onion, cilantro, garlic, ginger, chilies, and sugar to bowl of food processor and process until a fine paste has formed, about 30 seconds. Transfer mixture to a double layer of heavy-duty paper towels or a triple layer of cheesecloth. Fold towels over mixture and press gently to start extracting liquid. Lift up towels and form a bundle. Squeeze gently over sink to remove excess liquid. The remaining mixture should be dry enough to crumble when picked up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine ground beef or lamb with the spice/aromatic blend and massage with your hands until completely homogeneous and slightly tacky, about 4 minutes. Continue as directed, or, for better texture, let mixture rest, covered, in the refrigerator for several hours or up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide mixture into 12 even portions of about 3 ounces each. Roll into cylinders about 6 inches long and 3/4 inch wide and thread onto <a href=\"https://www.amazon.com/dp/B002YFV90Y/?tag=serieats-20\">metal</a> or <a href=\"https://www.amazon.com/dp/B005D6GCSA/?tag=serieats-20\">bamboo</a> skewers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate. Working in batches if necessary, place skewers over cooler side of grill, cover, and cook until they are nearly cooked through, about 5 minutes. (If you prefer, you can continue to let them cook through completely on cooler side, for more traditional, color-free results.) Open grill and transfer skewers to hot side. Continue to cook, turning frequently, until well browned on all sides, a few minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a serving platter and serve immediately with shredded cabbage or <a href=\"http://www.seriouseats.com/recipes/2016/08/spicy-cabbage-red-onion-slaw-recipe.html\">Spicy Cabbage and Red Onion Slaw</a>, cucumber, tomatoes, and lime wedges.</p>"}]}