{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/01/20160105-beef-bourguignon-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["beef", "beef stew", "essential", "French", "low carb", "stew", "wine", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5833333333333", "ratingCount": "12"}, "name": "Boeuf Bourguignon (Beef Stew With Red Wine, Mushrooms, and Bacon)", "link": "https://www.seriouseats.com/recipes/2016/01/beef-bourguignon-red-wine-stew-recipe.html", "description": "Classic <em>boeuf Bourguignon</em>, the French beef stew made with red wine, mushrooms, pearl onions, and bacon, is arguably the world's greatest beef stew. Here's how to make it with tender beef and a deep, rich flavor.", "totalTime": "3 1/2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Beef", "Beef Stew", "Braising and Stewing", "French", "Mains", "Mother's Day", "Valentine's Day"], "recipeIngredient": ["2 cups (500ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or store-bought low-sodium broth (see note)", "4 packets unflavored powdered gelatin (3 tablespoons plus 1 teaspoon; 30g) (see note)", "2 tablespoons (30ml) vegetable oil, plus more as needed", "3 pounds (1.25kg) whole boneless beef chuck roast, cut into 3 steaks", "Kosher salt and freshly ground black pepper", "1 1/4 pounds carrots (600g; about 3 large), 1/2 pound (250g) peeled and split lengthwise, 3/4 pound (350g) cut into large dice (about 1 1/2 cups)", "1/2 pound yellow onions (250g; about 2 medium), peeled and split in half through the root", "4 medium cloves garlic, lightly crushed", "1/4 cup (60ml) cognac or brandy (optional)", "3 cups (750ml) dry red wine", "1 tablespoon (15ml) Asian fish sauce", "1 tablespoon (15ml) soy sauce", "1 bouquet garnis (about 4 sprigs thyme, 3 sprigs parsley, and 1 bay leaf, tied together with kitchen twine)", "2 tablespoons (20g) all-purpose flour", "1/4 pound (110g) slab bacon or salt pork, cut into 1- by 1/4- by 1/4-inch sticks (see note)", "1 pound cremini mushrooms (450g), woody stems trimmed if necessary and caps quartered", "8 ounces white and/or red pearl onions (225g), peeled", "Minced flat-leaf parsley leaves and tender stems, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F. Pour chicken stock into a medium bowl and sprinkle gelatin evenly all over surface, allowing each packet's worth of gelatin to soak up stock before sprinkling next one on. Set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven, heat oil over medium-high heat until shimmering. Season beef all over with salt and pepper and add to Dutch oven. Cook, turning occasionally, until beef is well browned on 2 sides, about 10 minutes. Transfer beef to a rimmed baking sheet.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add split carrots, halved onions, and garlic to Dutch oven and cook, turning occasionally, until lightly browned, about 4 minutes; lower heat if browned bits on bottom of Dutch oven threaten to burn.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add brandy, if using, and boil until alcohol has nearly cooked off, about 2 minutes. (If not using brandy, proceed with next step.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape chicken stock and all gelatin into Dutch oven. Add red wine, fish sauce, soy sauce, and bouquet garnis and bring to a simmer, then lower heat to maintain simmer. Meanwhile, cut beef into 2-inch chunks and transfer to a large mixing bowl. Add flour and stir until beef is evenly coated in a floury paste. Add beef and any accumulated juices to Dutch oven. Transfer to oven, cover with lid partially open, and cook until beef is starting to become tender, about 1 hour 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large skillet, cook lardons over medium-high heat, stirring occasionally, until fat has rendered and lardons are lightly browned and crisp, about 6 minutes. Transfer lardons to a plate with a slotted spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mushrooms to skillet and cook, stirring occasionally, until mushrooms have released their liquid and browned, about 12 minutes; add oil as needed if pan becomes too dry. Add diced carrots and pearl onions and continue to cook, stirring occasionally, until lightly browned, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove stew from oven. Using tongs, fish out and discard large pieces of carrot and onion. Discard bouquet garnis. Using a ladle, skim off and discard accumulated fat on surface. Add reserved lardons and sautéed carrots, onions, and mushrooms to stew, return to oven, and continue to cook, uncovered, until beef is tender, about 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove stew from oven. If serving right away, skim off any additional fat from surface. Season with salt and pepper, if needed. Allow to cool slightly before serving, then serve topped with parsley. If making ahead, cool down stew, then chill in refrigerator; remove solid fat cap from surface once fully chilled. Reheat stew on the stovetop or in a low oven.</p>"}]}