{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/10/20161025-spatchcock-turkey-cajun-seasoning-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["cajun", "low carb", "roast", "Southern", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Cajun-Spiced Spatchcocked Turkey", "link": "https://www.seriouseats.com/recipes/2016/11/cajun-spiced-turkey-thanksgiving-recipe.html", "description": "Taking a page out of the Louisiana playbook, this turkey is rubbed all over with a fragrant, lightly spicy mix that includes paprika, cayenne pepper, coriander seed, cumin, black pepper, onion and garlic powders, and both dried oregano and dried thyme. The result is a rich, deeply flavored bird with a gorgeous rust-colored skin. It's different, yet recognizably all-American in the best sort of way.", "totalTime": "2 hours", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Christmas", "Fall", "Gluten-Free", "Mains", "Roasting", "Thanksgiving", "Turkey", "Winter"], "recipeIngredient": ["3 large onions, roughly chopped (about 1 1/2 quarts; 1 1/2 pounds; 680g), divided", "3 large carrots, peeled and roughly chopped (about 1 quart; 12 ounces; 340g), divided", "4 ribs celery, roughly chopped (about 1 quart; 12 ounces; 340g), divided", "12 thyme sprigs, divided", "1 tablespoon (12g) paprika ", "1 1/2 teaspoons (6g) cayenne pepper", "1 1/2 teaspoons (6g) ground coriander seed", "3/4 teaspoon (3g) ground cumin", "3/4 teaspoon (3g) onion powder", "3/4 teaspoon (3g) garlic powder", "1 1/2 teaspoons (3g) dried thyme ", "1 1/2 teaspoons (3g) dried oregano", "1 whole turkey (12 to 14 pounds total; 5.5 to 6.3kg), butterflied <a href=\"http://www.seriouseats.com/2012/11/how-to-spatchcock-cook-turkey-thanksgiving-fast-easy-way-spatchcocked-slideshow.html\">according to these instructions</a>, backbone, neck, and giblets reserved", "2 tablespoons (30ml) vegetable oil, divided", "Kosher salt and freshly ground black pepper", "1 1/2 quarts (1.4L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken or turkey stock", "2 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 450&deg;F (230&deg;C). Line a rimmed baking sheet with aluminum foil. Scatter two-thirds of onions, carrots, celery, and thyme sprigs across pan. Place a wire rack directly on top of vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spice grinder or mortar and pestle, combine paprika, cayenne pepper, coriander, cumin, onion powder, garlic powder, dried thyme, and dried oregano. Chop or crush to a powder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat turkey dry with paper towels. Rub turkey all over with spice rub. Rub 1 tablespoon (15ml) oil all over turkey, then season liberally on all surfaces with salt and black pepper. (If using a brined, salted, or kosher turkey, omit salting step; see note.) Tuck wing tips behind back. Place turkey on top of rack, arranging so that it does not overlap the edges, pressing down on breastbone to flatten breasts slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer turkey to oven and roast, rotating occasionally, until an instant-read thermometer inserted into deepest part of breast registers 150&deg;F (66&deg;C) and thighs register at least 165&deg;F (74&deg;C), about 1 hour 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While turkey roasts, make jus. Roughly chop reserved neck, backbone, and giblets. Heat remaining 1 tablespoon (15ml) oil in a 3-quart saucepan over high heat until shimmering. Add chopped turkey parts and cook, stirring occasionally, until lightly browned, about 5 minutes. Add remaining onions, carrots, and celery and continue to cook, stirring occasionally, until vegetables start to soften and brown in spots, about 5 minutes longer. Add chicken stock, remaining thyme sprigs, and bay leaves. Bring to a boil, then reduce to a bare simmer. Simmer until reduced by half, about 40 minutes. Strain through a fine-mesh strainer into a 2-quart liquid measuring cup and discard solids. Skim off any fat from surface of broth. Season jus to taste with salt and pepper, cover, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When turkey is cooked, remove from oven and transfer rack to a new baking sheet. Allow to rest at room temperature for 20 minutes before carving. Carefully pour any collected juices from pan through a fine-mesh strainer into a liquid measuring cup. Skim off excess fat and discard. Whisk juices into jus.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve turkey and serve with jus.</p>"}]}