{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160606-yakitori-negima-04.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["chicken", "easy", "grill", "Japanese", "scallion", "skewer", "yakitori"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Japanese Chicken Skewers With Scallion (Negima Yakitori)", "link": "https://www.seriouseats.com/recipes/2016/06/japanese-yakitori-negima-grilled-chicken-skewer-recipe.html", "description": "For my money, the easiest and most forgiving yakitori staple is <em>negima</em>: juicy chicken thigh alternately threaded onto a skewer with sections of scallion. Because thighs are naturally high in connective tissue and fat, they end up juicy even if you don't precisely measure temperature as they cook.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Grilled Chicken", "Japanese", "Mains", "Quick Dinners", "The Food Lab"], "recipeIngredient": ["2 pounds (1kg) boneless, skinless chicken thighs, cut into 1-inch dice", "Kosher salt and freshly ground white or black pepper", "1 bunch scallions, cut into 1-inch pieces", "1/2 cup (120ml) <a href=\"http://www.seriouseats.com/recipes/2012/03/teriyaki-sauce-how-to-make-at-home-recipe.html\">teriyaki sauce</a> (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss chicken pieces with 2 teaspoons kosher salt and a few grinds of pepper. Thread 2 to 3 pieces of chicken onto a skewer (enough to add up to around 1/2 to 3/4 inch when pressed tightly together), then thread a segment of scallion onto skewer. Continue alternating every few pieces of chicken with scallion until chicken and scallions are used up, using as many skewers as necessary. Make sure all the meat and scallions are tightly packed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 2/3 chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium-high heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken skewers directly over the hot portion of the grill, cover, and cook, turning frequently, until chicken is well browned, scallions are tender, and a piece of chicken looks cooked when removed and cut in half with a knife, about 10 minutes. Season with additional salt and pepper 2 to 3 times during the cooking process.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush chicken and scallions with teriyaki glaze and cook for 30 seconds. Turn, brush second side with teriyaki, and cook for 30 seconds longer. Remove chicken from grill and allow to rest for 1 to 2 minutes. Brush with additional glaze and serve immediately.</p>"}]}