{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160324-aquafaba-pancake-oatmeal-vegan-04-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["aquafaba", "breakfast", "brunch", "pancake", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Vegan Pancakes Made With Aquafaba", "link": "https://www.seriouseats.com/recipes/2016/04/vegan-aquafaba-pancake-recipe.html", "description": "In the world of vegan cooking, nothing has shaken things up like <em>aquafaba</em>&mdash;the recently coined term for the liquid inside a can of cooked beans. In a stand mixer, that liquid can be transformed into a creamy, fine, stable foam with the texture, density, and many of the cooking properties of an egg white&ndash;based meringue. Today, we're using it to make light, fluffy pancakes.", "totalTime": "30 minutes", "recipeYield": "Makes 16 pancakes", "recipeCategory": ["Dairy-Free", "Father's Day", "Mother's Day", "Pancake", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Basic Dry Pancake Mix:</strong>", "10 ounces all-purpose flour (about 2 cups; 280g)", "2 teaspoons (8g) baking powder", "1/2 teaspoon (3g) baking soda", "1 teaspoon (4g) kosher salt", "<strong>For Each Batch of Pancakes:</strong>", "4 tablespoons (60ml) liquid from 1 can of low-sodium chickpeas (reserve remaining liquid and chickpeas for another use)", "4 tablespoons (60g) sugar", "1 2/3 cups (about 14 ounces; 400ml) almond, rice, or soy milk", "1/4 cup (60ml) vegetable oil, plus more for cooking", "2 teaspoons (10ml) vanilla extract", "2 teaspoons (3g) zest from 1 lemon", "2 teaspoons (10ml) cider vinegar or distilled white vinegar", "Vegan butter substitute and maple syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dry Mix:</strong> Combine flour, baking powder, baking soda, and salt in a large bowl and whisk to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pancakes:</strong> Place chickpea liquid and sugar in the bowl of a stand mixer fitted with a whisk attachment. Whisk on high speed until stiff peaks form, about 6 minutes. Meanwhile, combine almond milk, vegetable oil, vanilla extract, lemon zest, and vinegar in a bowl. Add dry mix to wet mix and fold with a rubber spatula to combine (the mixture should remain lumpy). Fold in whipped chickpea liquid, being careful not to let it deflate too much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large heavy-bottomed nonstick skillet over medium heat for 5 minutes (or use an electric griddle). Add a small amount of vegan butter or oil to skillet or griddle and spread with a paper towel until no visible butter or oil remains. Reduce heat to low. Use a 1/4-cup dry measure to place 4 pancakes in skillet and cook until bubbles start to appear on top and the bottoms are golden brown, about 3 minutes. Carefully flip pancakes and cook on second side until golden brown and completely set, about 3 minutes longer. Serve pancakes immediately, or keep warm on a wire rack set on a rimmed baking sheet in a warm oven while you cook the remaining 3 batches. Serve with warm maple syrup and vegan butter.</p>"}]}