{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20161026-roasted-turkey-stock-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["broth", "leftover", "low carb", "stock"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Brown Turkey Stock", "link": "https://www.seriouseats.com/recipes/2016/11/brown-turkey-stock-recipe.html", "description": "Every year, home cooks across the country use their leftover Thanksgiving turkey bones to make stock. With just a couple of easy steps, though, you can make that stock much, much better. By roasting the bones and browning the vegetables, then adding a small amount of tomato paste, you end up with a deep, dark, rich, and flavorful stock that's perfect in meat braises and stews, pan sauces for roasted meats, and deeply savory soups, like French onion.", "totalTime": "3 hours 40 minutes, plus chilling time", "recipeYield": "Makes about 3 quarts/2.7L (though volume will vary depending on pot size and exact amount of turkey bones)", "recipeCategory": ["Fall", "Gluten-Free", "Recipes", "Thanksgiving", "Turkey", "Winter"], "recipeIngredient": ["Leftover carcass from 1 (12-pound; 5.5kg) roasted or fried turkey (see note)", "4 tablespoons (60ml) canola or vegetable oil, plus more for drizzling on bones", "2 to 3 large carrots, cut into large dice", "3 large celery ribs, cut into large dice", "2 large onions, cut into large dice", "4 medium cloves garlic, crushed", "2 tablespoons (30ml) tomato paste", "Parsley sprigs and/or thyme sprigs", "2 bay leaves", "5 black peppercorns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450&deg;F (230&deg;C). Drizzle turkey bones with oil, tossing to lightly coat. Arrange on 2 foil-lined rimmed baking sheets and roast until browned all over, about 45 minutes. (Check turkey often, since browning times can vary depending on the size and condition of the bones.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large heavy-bottomed stockpot, heat 3 tablespoons (45ml) oil over high heat until shimmering. Add half of carrot, celery, onion, and garlic and cook, stirring occasionally, until well browned in spots, about 6 minutes. Transfer to a plate, add remaining 1 tablespoon (15ml) oil, and repeat with remaining carrot, celery, onion, and garlic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lower heat to medium, return all cooked vegetables to pot, and add tomato paste. Cook, stirring, until tomato paste is fully mixed in, fragrant, and slightly darkened, about 2 minutes. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add roasted turkey bones, a few sprigs each of parsley and/or thyme, bay leaves, and peppercorns. Pour about 1/2 cup (120ml) hot water into each rimmed baking sheet and, using a metal spatula or wooden spoon, scrape up any browned bits from aluminum foil. Pour into stockpot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add enough water to just barely cover all the solids in the pot, set over medium-high heat, and bring to a bare simmer. Lower heat to maintain a bare simmer and cook, occasionally skimming fat and scum from surface, until stock has reduced slightly and is deep and rich, 2 to 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain stock through a fine-mesh strainer, let cool, then transfer to containers and refrigerate until completely chilled, about 6 hours; discard solids. Skim off and remove any fat and scum on the surface of the stock. Refrigerate for up to 5 days or freeze for up to 6 months.</p>"}]}