{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160721-chicken-cutlet-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["chicken", "cutlet", "easy", "essential", "fried chicken", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "Easy Breaded Fried Chicken Cutlets", "link": "https://www.seriouseats.com/recipes/2016/08/fried-breaded-chicken-cutlets-recipe.html", "description": "Fried chicken cutlets are a surprisingly fast and easy weeknight dinner. The secret to the richest, deepest flavor: Add clarified butter to the skillet instead of frying oil (though frying oil works fine, too). Once it's browned and crisp outside, the chicken here is served with a light salad made from bitter greens, like radicchio and watercress or arugula&mdash;their bitterness helps balance the richness of the fried cutlets.", "totalTime": "20 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Deep Frying", "Fried Chicken", "Mains", "Quick and Easy", "Quick Dinners", "Stovetop"], "recipeIngredient": ["1 cup all-purpose flour (5 ounces; 140g)", "3 large eggs, beaten", "1 cup panko bread crumbs (2 ounces; 60g), roughly crushed by hand if very large", "1 ounce (30g) grated Parmigiano-Reggiano cheese", "2 boneless, skinless chicken breast halves (5 to 7 ounces each), <a href=\"http://www.seriouseats.com/2015/07/knife-skills-how-to-cut-chicken-breasts-into-cutlets.html\">cut into 4 cutlets and pounded to about 1/4 inch thick each</a>", "Kosher salt and freshly ground black pepper", "<a href=\"http://www.seriouseats.com/recipes/2015/08/clarified-butter-recipe.html\">Clarified butter</a> or vegetable oil, for frying (about 1 to 1 1/2 cups; see note)", "<a href=\"http://www.seriouseats.com/recipes/2016/08/five-minute-radicchio-watercress-arugula-salad-recipe.html\">5-Minute Radicchio and Watercress Salad</a> (optional)", "Lemon wedges, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set 3 wide, shallow bowls on a work surface. Add flour to the first one, beaten eggs to the second, and panko and Parmesan cheese to the third. Mix panko and Parmesan thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season chicken cutlets all over with salt and pepper. Working with one at a time, dredge a cutlet in flour with your left hand, shaking off excess. Transfer to egg dish, then turn cutlet with your right hand to coat both sides. Lift and allow excess egg to drain off, then transfer to bread crumb mixture. With your left hand, scoop bread crumbs on top of chicken, then gently press, turning chicken to ensure a good layer of crumbs on both sides. Transfer cutlet to a clean plate and repeat with remaining cutlets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large cast iron skillet with 1/4 inch clarified butter or frying oil. (To speed things up even more, use 2 skillets simultaneously.) Heat cooking fat over high heat until shimmering and just shy of smoking, about 375&deg;F on an instant-read thermometer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs or your fingers, gently lower cutlets into the hot fat, laying them down away from you to prevent hot fat from splashing toward you. (Work in batches if necessary.) Fry, gently swirling pan and rotating cutlets for even browning, and adjusting heat as necessary for a steady, vigorous bubble, until bottom side is browned and crisp, about 3 minutes. Flip cutlets and fry until other side is browned and crisp, about 3 minutes longer. Transfer to paper towels to drain and season with salt right away. Repeat with remaining cutlets. Serve immediately with <a href=\"http://www.seriouseats.com/recipes/2016/08/five-minute-radicchio-watercress-arugula-salad-recipe.html\">5-Minute Radicchio and Watercress Salad</a> and lemon wedges on the side, if desired.</p>"}]}