{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160223-lemon-syrup-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["easy", "gluten free", "lemon", "meyer lemon", "no-cook", "one bowl", "syrup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "7"}, "name": "Fresh Lemon Syrup", "link": "https://www.seriouseats.com/recipes/2016/03/fresh-lemon-syrup-recipe.html", "description": "Whether you're juicing standard supermarket lemons or their seasonal Meyer cousins, save the rinds for this vibrant yellow syrup. It's pure sunshine in a bottle, made from nothing but sugar dissolved by the acidic pulp&mdash;no cooking required! Since there's no added juice, it tastes more sweet than sour, but is balanced by the subtle bitterness of lemon oil.", "totalTime": "3 hours", "recipeYield": "Makes about 8 ounces (1 scant cup; 230ml)", "recipeCategory": ["Cocktails", "Dairy-Free", "Fruit Desserts", "Gluten-Free", "Lemon", "Vegan"], "recipeIngredient": ["15 ounces (2 1/2 cups; 425g) \"used\" lemon rinds, from 6 medium lemons or 12 Meyer lemons (see note)", "7 ounces (1 cup; 200g) sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each lemon into a few chunks and toss with sugar in a large glass, ceramic, or stainless steel mixing bowl. Cover tightly and let stand at room temperature, stirring once every 45 minutes or so, until sugar has completely dissolved, about 3 hours (or up to 12 if timing is an issue).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a cheesecloth-lined or fine-mesh stainless steel strainer set over a nonreactive bowl, strain syrup. Working in batches, transfer rinds to a stainless steel potato ricer and squeeze to release any extra syrup, allowing it to pass through strainer into bowl; discard rinds. Refrigerate syrup for up to 3 months in a glass bottle or pint jar.</p>"}]}