{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160324-aquafaba-pancake-oatmeal-vegan-40.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["aquafaba", "breakfast", "brunch", "easy", "oatmeal", "pancake", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fluffy Vegan Oatmeal Pancakes Recipe (With Aquafaba)", "link": "https://www.seriouseats.com/recipes/2016/05/fluffy-vegan-oatmeal-pancakes-recipe-aquafaba.html", "description": "Oatmeal pancakes tend to be denser than their plain counterparts, which is why they are noticeably improved with the addition of whipped aquafaba, the goopy liquid inside a can of chickpeas. The light, foamy, vegan meringue produced by whipping can be folded with the other ingredients to produce the fluffiest oatmeal pancakes, and they just happen to be vegan, too.", "totalTime": "30 minutes", "recipeYield": "Makes 16 pancakes", "recipeCategory": ["Dairy-Free", "Easter", "Father's Day", "Mother's Day", "Pancake", "The Food Lab", "Vegan", "Vegetarian"], "recipeIngredient": ["5 ounces rolled oats (about 3/4 cup; 140g)", "5 ounces all-purpose flour (about 1 cup; 140g)", "2 teaspoons (8g) baking powder", "1/2 teaspoon (3g) baking soda", "1 teaspoon (4g) kosher salt", "4 tablespoons (60ml) liquid from 1 can of low-sodium chickpeas (reserve remaining liquid and chickpeas for another use)", "4 tablespoons (60g) sugar", "1 1/2 cups almond, rice, or soy milk (about 12 ounces; 355ml)", "1/4 cup (60ml) vegetable oil, plus more for cooking", "2 teaspoons (10ml) vanilla extract", "2 teaspoons (3g) zest from 1 lemon", "2 teaspoons (10ml) cider vinegar or distilled white vinegar", "Vegan butter substitute and maple syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oats in a medium skillet over medium heat, tossing and stirring frequently, until toasted and nutty, about 4 minutes. Transfer to the bowl of a food processor, let cool a few moments, and pulse until about half the oats are powdered but a few larger flakes remain, 10 to 12 short pulses. Add flour, baking powder, baking soda, and salt and pulse to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chickpea liquid and sugar in the bowl of a stand mixer fitted with a whisk attachment. Whisk on high speed until stiff peaks form, about 6 minutes. Meanwhile, combine almond milk, vegetable oil, vanilla extract, lemon zest, and vinegar in a bowl. Add dry mix to wet mix and fold with a rubber spatula to combine (the mixture should remain lumpy). Fold in whipped chickpea liquid, being careful not to let it deflate too much.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large, heavy-bottomed nonstick skillet over medium heat for 5 minutes (or use an electric griddle). Add a small amount of vegan butter or oil to skillet or griddle and spread with a paper towel until no visible butter or oil remains. Reduce heat to low. Use a 1/4-cup dry measure to place 4 pancakes in skillet and cook until bubbles start to appear on top and bottoms are golden brown, about 3 minutes. Carefully flip pancakes and cook on second side until golden brown and completely set, about 3 minutes longer. Serve pancakes immediately, or keep warm on a wire rack set on a rimmed baking sheet in a warm oven while you cook the remaining 3 batches. Serve with warm maple syrup and vegan butter.</p>"}]}