{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160301-tofu-avocado-grapefruit-zaatar-vegan-salad-recipe-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["avocado", "easy", "grapefruit", "kale salad", "miso", "salad", "Tahini", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Tofu and Kale Salad With Avocado, Grapefruit, and Miso-Tahini Dressing", "link": "https://www.seriouseats.com/recipes/2016/03/crispy-zaatar-tofu-kale-avocado-grapefruit-salad-recipe.html", "description": "I've been making versions of this salad with crispy tofu, avocado, and grapefruit, flavored with za'atar and topped with a miso and tahini dressing, on and off for the last couple of months, each time tweaking the ingredients a bit. I've come to the conclusion that the base is delicious no matter what you do with it, and it all comes down to the texture of those three main ingredients: crisp tofu, creamy avocado, and juicy grapefruit.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Avocado", "Dairy-Free", "Grapefruit", "Salads", "Tofu", "Vegan", "Vegetarian"], "recipeIngredient": ["1 (14-ounce; 400g) block firm (non-silken) tofu, cut into 1- by 2- by 1/2-inch squares", "5 tablespoons (75ml) extra-virgin olive oil, divided", "3/4 ounce (about 1/4 cup; 20g) <a href=\"http://www.amazon.com/Zaatar-Spice-Blend-Palestine-ounce/dp/B00CL5XP1S/?tag=serieats-20\">za'atar</a>, divided", "1 large grapefruit, cut into <a href=\"http://www.seriouseats.com/2014/04/knife-skills-how-to-cut-citrus-fruit-into-wedges-slices-and-supremes.html\">segments</a>, juice reserved separately", "2 tablespoons (30ml) sesame tahini", "1 tablespoon (15ml) white or yellow miso paste", "1 tablespoon (15ml) juice from 1 lemon", "1 teaspoon (5ml) honey or agave nectar", " Kosher salt and freshly ground black pepper", "1 avocado, cut into 1/2-inch chunks", "5 ounces greens, such as baby kale, spinach, or arugula (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place tofu in a large colander and set in the sink. Pour 1 quart boiling water over tofu and let rest for 1 minute. Transfer to a paper towel&ndash;lined tray and press dry. Heat 3 tablespoons olive oil in a large nonstick or cast iron skillet over medium-low heat until shimmering. Add tofu and cook, turning occasionally, until golden brown and crisp on all surfaces, about 10 minutes total. Sprinkle with half of za'atar and toss to coat. Transfer tofu to a paper towel&ndash;lined plate to drain. Scrape remaining contents of pan into a medium bowl and set aside to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 tablespoons reserved grapefruit juice, tahini, miso paste, lemon juice, and honey or agave nectar to bowl with reserved oil from cooking. Add 1 more tablespoon olive oil. Whisk until smooth, adding more grapefruit juice or water as necessary to achieve a smooth, pourable consistency about the texture of heavy paint. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine tofu, grapefruit segments, and avocado in a large bowl. Add remaining tablespoon olive oil and remaining za'atar, season with salt, and gently fold together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add greens and half of dressing and gently fold to combine. Serve immediately, drizzling remaining dressing on top.</p>"}]}