{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/02/20160209-tacos-arabes-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Mexican", "keywords": ["Mexican", "pork", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Tacos Árabes (Pita-Wrapped, Cumin-Marinated-Pork Tacos)", "link": "https://www.seriouseats.com/recipes/2016/02/tacos-arabes-pita-cumin-mexican-pork-recipe.html", "description": "Tacos <em>árabes</em>, a Pueblan specialty with Middle Eastern influence, feature juicy cumin-marinated pork in a warm pita-bread wrapper. This at-home recipe re-creates the spit-roasted flavor in the oven and on the stovetop. Splashes of spicy hot chipotle salsa and cooling garlic-yogurt sauce are the perfect complementary condiments.", "totalTime": "1 to 2 days", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Mains", "Mexican", "Pork"], "recipeIngredient": ["<strong>For the Pork:</strong>", "2 pounds (about 1kg) boneless blade-end loin or sirloin pork roast", "1/2 small yellow onion, thinly sliced", "2 tablespoons (30ml) fresh juice from 1 lime", "1 1/2 teaspoons (6g) ground cumin", "1 1/2 teaspoons (6g) ground dried oregano (preferably Mexican)", "2 teaspoons (8g) kosher salt", "8 ounces sliced bacon (1/2 pound; 225g)", "<strong>For the Chipotle Salsa:</strong>", "1 (7-ounce; 200g) can chipotle chilies in adobo sauce", "1 medium clove garlic", "2 teaspoons (10ml) distilled white vinegar", "1 teaspoon (4g) ground dried oregano (preferably Mexican)", "1/8 teaspoon (0.5g) ground cumin", "Water, as needed", "Kosher salt", "<strong>For the Yogurt Sauce:</strong>", "1 cup (240ml) full-fat yogurt", "1 tablespoon (15ml) fresh juice from 1 lemon or lime", "1 tablespoon (15ml) extra-virgin olive oil", "2 tablespoons (6g) minced flat-leaf parsley leaves and tender stems", "2 medium cloves garlic, minced", "Kosher salt and freshly ground black pepper", "<strong>For Serving:</strong>", "8 rounds pita bread, warmed (see note)", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pork:</strong> Using a very sharp chef's knife or slicing knife, slice pork as thinly as possible. If necessary, place meat in the freezer for 15 minutes to firm it up. Split the sides of a heavy-duty zipper-lock bag. Place one slice of meat inside bag and pound with the bottom of a heavy 8-inch skillet or a meat pounder until less than 1/4 inch thick. Transfer to a large bowl. Repeat with remaining meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion, lime juice, cumin, oregano, and salt to pork and toss with hands until every piece of meat is evenly coated in marinade.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom of a disposable aluminum loaf pan with bacon. Add a layer of thin-sliced marinated pork. Continue with alternating layers of marinated pork and bacon until all the meat is used up. Cover tightly with plastic wrap and refrigerate for at least 4 hours and up to 36.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook Indoors:</strong> Preheat oven to 275&deg;F. Uncover aluminum loaf pan and place on a foil-lined rimmed baking sheet. Transfer to oven and cook until meat is completely tender and an instant-read thermometer inserted into the center registers 180&deg;F, 2 to 3 hours (it will render lots of fat). Remove from oven, allow to cool slightly, cover with aluminum foil, and refrigerate for at least 2 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cook Outdoors:</strong> Light half a chimney of charcoal and allow to preheat until coals are mostly covered in gray ash. Spread out under one half of coal grate and place cooking grate on top. Alternatively, set one set of burners on a gas grill to low and leave the remaining burners off. Unwrap aluminum loaf pan and place directly over cooler side of grill, placing a drip pan underneath if desired. Cover grill and cook until loaf registers 180&deg;F in the center, about 3 hours, adding more coals to grill or adjusting burners as necessary to maintain an air temperature of around 275&deg;F for the duration of cooking. Remove from grill, allow to cool slightly, cover with aluminum foil, and refrigerate for at least 2 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chipotle Salsa:</strong> In a blender, combine chipotles and their sauce, garlic, vinegar, oregano, and cumin. Add 1 cup water and blend at high speed until a smooth purée forms; add more water as necessary, 1 tablespoon at a time, to reach a thick yet pourable consistency. Season with salt. Chipotle salsa can be refrigerated for up to 5 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Yogurt Sauce:</strong> In a medium bowl, whisk together yogurt, lemon or lime juice, olive oil, parsley, and garlic. Season with salt and pepper. Yogurt sauce can be refrigerated for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Remove cooked meat from aluminum loaf pan, scraping off any fat or jellied juices from its sides; reserve rendered fat and juices. Using a sharp chef's knife or slicing knife, slice meat as thinly as possible to create fine shavings of meat and fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer meat and 1 tablespoon of fat to a large cast iron or nonstick skillet. Heat over medium-high heat, stirring occasionally, until meat crisps and browns in spots. Add any reserved juices and toss to combine, allowing juices to cook until reduced to a moist glaze. Transfer meat to a warmed serving bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warmed meat right away with warmed pita bread, lime wedges, chipotle salsa, and yogurt sauce.</p>"}]}