{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161202-challah-bread-vicky-wasik-1-3.jpg", "author": {"@type": "Person", "name": "Max Bernstein"}, "recipeCuisine": "", "keywords": ["bread", "challah"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "7"}, "name": "The Best Challah", "link": "https://www.seriouseats.com/recipes/2016/12/challah-braided-jewish-bread-recipe.html", "description": "While you may not have trouble finding good challah at your local bakery, there are some compelling reasons to bake the iconic loaf yourself. For starters, it can be made easily in any home kitchen, with any experience level, in just a few hours, with delicious results. And, with patience and practice, there's no question that you can make a challah that's better than anything you'll buy in a store.", "totalTime": "6-12 hours", "recipeYield": "Makes 2 loaves", "recipeCategory": ["Baking", "Yeast Bread"], "recipeIngredient": ["35 ounces (1000 grams) all-purpose flour, plus more for dusting", "1 3/4 ounces (50 grams) sugar", "1 ounce (30 grams) kosher salt", "3/8 ounce (10 grams) active dry yeast", "9.5 ounces (270 grams) whole eggs, from approximately 5-6 large eggs", "8 ounces (230 grams) egg yolks, from approximately 15 large eggs", "5 ounces (150 grams) cold water", "3.5 ounces (100 grams) honey", "3 ounces (90 grams) light olive or vegetable oil", "1 whole egg, for egg wash"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer, whisk together flour, sugar, salt, and yeast. Add eggs, yolks, water, honey, and oil, stirring with a flexible spatula to form a shaggy dough. Fit the mixer with a dough hook and knead on low (speed 2 on a KitchenAid stand mixer), mixing until the dough is smooth and begins to pull away from the sides of the bowl, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough onto a lightly floured surface and scrape the bowl clean. Knead the dough by hand until elastic and smooth, no more than 3 minutes, and then round into a ball. Lightly oil the empty mixing bowl, place ball of dough inside, and cover tightly with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, set oven to 200&deg;F (93&deg;C) and set bowl near the air vent, aiming for a 75&deg;F/25&deg;C environment. Allow to rise by half, about one hour. (At 70&deg;F/21&deg;C, expect this to take roughly 90 minutes). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When dough is risen by half, flip the dough over inside the bowl and fold the top portion firmly into the middle. Next, fold the bottom portion of the dough into the center of the mass. Rotate the dough 90 degrees, and perform the same motions&mdash;top to middle, bottom to middle&mdash;pressing firmly each time with the palm of your hand and pushing it against the sides of the bowl to expel excess air. Cover again with plastic wrap and let rise another hour, and up to 90 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough onto a lightly floured work surface and cut into 8 pieces, about 230g each. Press each portion into a roughly 4-inch square and fold the top edge to the middle, pinching the dough along the seam to seal, then repeat with the bottom edge to form a cylinder. Set on a lightly greased baking sheet, cover with plastic, and repeat with the remaining dough. Let dough sit for 15 minutes at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a clean work surface, gently roll each portion of dough back and forth, using the palms of your hands to elongate each piece into a 14-inch strand, applying very little pressure in the middle, but enough at the ends to taper its shape. Once elongated, set aside, cover with plastic wrap, and repeat for the remaining strands. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove 4 strands and arrange them like spokes extending from the center of a wheel. Pinch together the strands to join at one end and anchor with a heavy jar or can.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mentally number the four strands, from left to right, as strand 1 through strand 4. Move strand 1 from the far left to the middle. Move strand 3 from its starting position to the far left. Move strand 4 from the far right to the middle. Move strand 2 from its starting position to the far right. Move strand 3 from the far left position to the middle. Move strand 1 from its current position to the far left. Move strand 2 from the far right to the middle. Move strand 4 from its current position to the far right. Repeat pattern, loosening tension at the middle of the braid, and increasing tension at the end for a symmetrical appearance.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place loaf on one end of a parchment lined baking sheet, laying it on the diagonal so the other loaf can fit as well. Cover with plastic and braid the remaining dough as before.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare egg wash by whisking remaining egg and water together in a small bowl, then brush lightly over the loaves, working to cover the surface of the dough but avoiding the nooks and crannies of the “joints” so as not to seal the strands together. Prepare a warm place for the dough to proof, and let it rise until roughly doubled in size, about 2 hours in a 75&deg;F (25&deg;C) environment, or up to 6 hours at cool room temperature (this can also be done overnight in the fridge if covered in plastic). During this time, you can egg wash the dough two additional times to build up a rich layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toward the end of the second rise, adjust oven rack to lower-middle position and preheat to oven to 375&deg;F (190&deg;C). Place the loaves in the oven and immediately reduce temperature to 325&deg;F (160&deg;C). Bake until a digital thermometer inserted into the center of each loaf reads 200&deg;F (93&deg;C), about 40 minutes, rotating loaves after the first 25 minutes. Transfer loaves to a wire rack and cool for one hour before slicing or serving. </p>"}]}