{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/05/20160512-octopus-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["boil", "grill", "octopus", "seafood", "sear"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8333333333333", "ratingCount": "6"}, "name": "Pressure-Cooker Octopus", "link": "https://www.seriouseats.com/recipes/2016/06/pressure-cooker-octopus-recipe.html", "description": "No ingredient has inspired as many wacky tricks to guarantee it will cook well as octopus. We're telling you now: Put away your corks and vinegar and rocks for pummeling it, because the pressure cooker is your best bet for making octopus  tender rapidly.", "totalTime": "25 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Other Seafood", "Pressure Cooker"], "recipeIngredient": ["1 (2 1/2-pound; 1kg) whole octopus, rinsed well (including inside head cavity)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place octopus in a pressure cooker and add just enough water to cover. (Be sure to keep water level below pressure cooker's maximum fill line.) Add a couple of large pinches of salt. Close pressure cooker and bring to high pressure (12 to 15 psi). Once cooker has reached high pressure, cook for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using steam-release valve, depressurize cooker rapidly. Check octopus for tenderness by sliding a paring knife into the thickest part of one of its tentacles; it should slide in easily with little resistance. If the octopus is not tender enough, return to high pressure and then cook for 5 minutes longer. (Fifteen minutes was the correct time based on all our tests, but variations in the octopus, such as size, and in the pressure cooker used may change the cooking time slightly.) Let octopus cool in its cooking liquid, then drain. Cooked octopus can be refrigerated in a sealed container for up to 2 days before use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To use cooked octopus, cut out and discard the hard beak (if it hasn't been removed already by the fishmonger), which is found in the center of the base of the octopus body, where the tentacles converge. Cut out and discard the section of the head with eyes; the rest of the head is edible. Separate tentacles into individual pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve Cold:</strong> Cut tentacles and head into pieces and add to a seafood salad or ceviche.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Sear:</strong> Leave tentacles whole (or, if very long, cut into manageable sections); cut head meat into large pieces. Heat a tablespoon or two of vegetable oil in a skillet over high heat until shimmering. Add octopus pieces and cook until well browned and crisp, about 3 minutes. Turn and brown on other side, about 3 minutes longer. Season with salt and serve as desired.</p>"}]}