{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/video-1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "egg white", "meringue", "pastry", "pie", "swiss meringue", "toasted sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2727272727273", "ratingCount": "11"}, "name": "Perfect Swiss Meringue", "link": "https://www.seriouseats.com/recipes/2016/11/easy-swiss-meringue-recipe.html", "description": "With the right technique, Swiss meringue is fluffier than a French meringue made with the same ratio of ingredients and every bit as stable as its Italian cousin. The trick is to warm the egg whites and sugar over a gently simmering water bath. With toasted sugar, cream of tartar, plenty of salt, and a little vanilla, the finished meringue whips up with lots of flavor, aroma, and a well-balanced sweetness, too. Use it in your favorite recipes for meringue cookies, Swiss buttercream, pavlova, and any meringue-topped pie.", "totalTime": "30 minutes", "recipeYield": "Makes 6 heaping cups", "recipeCategory": ["Dairy-Free", "Desserts", "Gluten-Free"], "recipeIngredient": ["6 ounces egg whites (2/3 cup; 170g), from 5 to 6 large eggs", "9 ounces plain or <a href=\"http://www.seriouseats.com/recipes/2016/05/dry-toasted-sugar-granulated-caramel-recipe.html\">lightly toasted</a> sugar (1 1/4 cups plus 1 tablespoon; 255g) (see note)", "1/4 teaspoon Diamond Crystal kosher salt; use half as much if iodized ", "1/4 teaspoon cream of tartar", "Scraped seeds from 1 split vanilla bean (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a wide pot with at least 1 1/2 inches of water, with a thick ring of crumpled tinfoil placed inside to act as a \"booster seat.\" Place over high heat until steaming-hot, then adjust temperature to maintain a gentle simmer. Combine egg whites, sugar, salt, cream of tartar, and vanilla seeds (if using) in the bowl of a stand mixer. Set over steaming water, stirring and scraping constantly with a flexible spatula, until egg whites hold steady at 175&deg;F (79&deg;C), between 8 and 10 minutes. Transfer to a stand mixer fitted with a whisk attachment and whip at high speed until meringue is glossy and beginning to ball up inside the whisk, about 5 minutes. Use immediately.</p>"}]}