{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/10/20161004-baked-potato-vicky-wasik-10.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["essential", "potato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Ultimate Baked Potato", "link": "https://www.seriouseats.com/recipes/2016/10/ultimate-baked-potato-recipe.html", "description": "Baked potatoes can be a wonder to behold, all soft and snowy-white. They can also be bland as bland as bland can be. Here's how to get the crispest skin and the creamiest, fluffiest flesh, and how to work the very best flavor into every last bite.", "totalTime": "45 minutes to 1 hour 20 minutes", "recipeYield": "Serves 2 to 4", "recipeCategory": ["Gluten-Free", "Mains", "Potato", "Roasting", "Sides", "Thanksgiving"], "recipeIngredient": ["4 (12-ounce; 340g) potatoes, preferably russets", "Canola, vegetable, or olive oil, for rubbing", "1 stick unsalted butter (4 ounces; 114g), diced", "Kosher salt and freshly ground black pepper", "Toppings of your choice, such as grated cheddar cheese, crispy diced bacon bits, minced chives, sliced scallions, and/or sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using Only the Oven (see note):</strong> Preheat oven to 375&deg;F (190&deg;C). Using a fork or paring knife, puncture potatoes in several spots. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet, or directly on an oven rack, and bake until a fork can easily be inserted into the center of each potato, about 1 hour. If setting potatoes directly on oven rack, set a sheet of foil on the rack below to catch any oil drips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using the Microwave and Oven (see note):</strong> Preheat oven to 450&deg;F (230&deg;C). Using a fork or paring knife, puncture potatoes in several spots. Microwave potatoes for 5 minutes. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet, or directly on an oven rack, and bake until a fork can easily be inserted into the center of each potato, about 20 minutes. If setting potatoes directly on oven rack, set a sheet of foil on the rack below to catch any oil drips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let potatoes rest 5 minutes. Slice each open lengthwise and scoop flesh into a mixing bowl. Add butter, season with salt and pepper, and roughly mash, just until butter is incorporated but potatoes are still chunky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop mashed potatoes back into skins. (You can refill each skin, making 4 smaller potatoes, or use all the mashed potato to refill only half the skins, making 2 overstuffed potatoes.) Using your hands, reshape each stuffed potato back into a classic baked-potato shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with toppings of your choice. To melt cheese, add it first, then return potatoes to oven until cheese melts, about 1 minute; alternatively, use a torch to melt cheese. Serve right away.</p>"}]}