{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160723-Mussels-Thai-Red-Curry-Broth-Rice-Noodles-emily-matt-clifton-13.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "Thai", "keywords": ["coconut", "curry", "easy", "mussel", "noodle", "quick", "seafood", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Mussels With Thai Red Curry Broth and Rice Noodles", "link": "https://www.seriouseats.com/recipes/2016/08/mussels-thai-red-curry-broth-recipe.html", "description": "Mussels are already winners for quick cooking, sustainability, and flavor; they also pair well with a wide range of other ingredients. Here, we bring Thai inspiration with a spicy red curry coconut broth and a shower of fresh herbs. Serving it with quick-cooking rice noodles brings the whole meal together in under 20 minutes.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Clams, Mussels, and Oysters", "Coconut", "Mains", "Soups and Stews", "Thai"], "recipeIngredient": ["1 (9-ounce; 255g) package vermicelli rice noodles", "2 tablespoons (30ml) coconut oil (or any neutral oil)", "2 large shallots, thinly sliced (about 1/2 cup; 75g)", "2 garlic cloves, minced (about 20g)", "2 to 4 tablespoons (30 to 60ml) Thai red curry paste, depending on your taste", "1/2 cup (115ml) dry white wine or lightly flavored lager or ale", "1 (15-ounce; 450ml) can unsweetened coconut milk", "2 tablespoons (30ml) fish sauce, plus more to taste", "2 tablespoons (30ml) fresh juice from 1 to 2 limes, plus more to taste", "1 teaspoon (5g) palm or brown sugar, plus more to taste", "2 1/2 to 3 pounds (1.1 to 1.35kg) mussels, de-bearded and scrubbed", "Small bunch cilantro leaves and tender stems, roughly chopped", "Small bunch sweet or Thai basil leaves, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Boil a kettle of water (or use very hot tap water). Place noodles in a large bowl and pour hot water over until they are covered. Separate strands with a fork and leave to soften, about 5 minutes. Drain and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a heavy Dutch oven (or heavy pot with a fitted lid) on medium-high heat until shimmering. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add shallots and garlic and cook until soft and translucent, about 3 minutes. Add curry paste and cook, stirring, until fragrant, about 30 seconds. Add wine or beer, coconut milk, fish sauce, lime juice, and sugar and bring to a simmer while stirring.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mussels, cover pot, and let steam until mussels open, about 5 minutes. Once mussels open, add cilantro and basil. Season broth to taste with more fish sauce, lime juice, or sugar as desired. Divide noodles into individual bowls, spoon mussels and broth on top, and serve.</p>"}]}