{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/01/FRENCHONIONSOUP.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "French", "keywords": ["easy", "French", "French onion soup", "onion soup", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.8333333333333", "ratingCount": "12"}, "name": "Pressure Cooker French Onion Soup", "link": "https://www.seriouseats.com/recipes/2016/01/pressure-cooker-french-onion-soup-recipe.html", "description": "Traditional techniques for caramelizing onions can take hours to deliver extra-sweet, complex flavor. The pressure cooker reduces that time down to about 30 minutes of hands-off cooking. Finishing off those onions with sherry, stock, and some aromatics transforms them into a soul-satisfying classic French onion soup.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["French", "Pressure Cooker", "Quick Dinners", "Soups and Stews", "The Food Lab"], "recipeIngredient": ["6 tablespoons unsalted butter, plus more for toasts (3 ounces; about 90g)", "3 pounds yellow or mixed onions, sliced 1/8 inch thick (1.4kg; about 4 to 5 large onions) (see note)", "1/2 teaspoon (2g) baking soda", "Kosher salt and freshly ground black pepper", "1/2 cup (120ml) dry sherry, such as Amontillado", "2 quarts (about 2L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 sprigs thyme", "1 bay leaf", "1 teaspoon (5ml) Asian fish sauce (optional)", "1 teaspoon (5ml) cider vinegar", "8 bowl-size slices rustic bread, toasted until crisp", "1 medium clove garlic", "1 pound (450g) Gruyère cheese, grated", "Freshly minced chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in an electric or stovetop pressure cooker over medium heat. Add onions and baking soda and stir to combine. Season with salt and pepper. Cook, stirring, until onions slightly soften and start to release liquid, about 3 minutes. Seal pressure cooker and heat to high pressure (12.5 to 15 psi). Cook at high pressure for 20 minutes. Release pressure by allowing steam to vent, then remove lid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue cooking with lid off, stirring constantly, until liquid inside has completely reduced and the onions are deep brown and sticky, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sherry and bring to a simmer, scraping up any browned bits. Cook until alcohol smell is mostly gone, about 3 minutes. Add stock, thyme, and bay leaf, raise heat to medium-high, and bring to a simmer. Lower heat and simmer for 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add fish sauce, if using, and cider vinegar and season with salt and pepper (if necessary). Discard thyme sprigs and bay leaf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Preheat broiler and move oven rack to top position. Butter toasts and rub with garlic clove until fragrant. Spoon a small amount of broth into the bottoms of 4 ovenproof serving bowls, then top with half the toasts. Sprinkle some grated Gruyère on top of toasts, then spoon more soup and onions on top, nearly filling the bowls. Set the remaining 4 toasts in each bowl, pushing to nearly submerge them. Top with remaining grated cheese and set bowls on a rimmed baking sheet. Broil until cheese is melted and browned in spots. Garnish with chives and serve.</p>"}]}