{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160418-american-omelet-bacon-asparagus-cheese-01.JPG", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "breakfast", "brunch", "diner", "easy", "egg", "gruyere", "omelette", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Diner-Style Asparagus, Bacon, and Gruyère Omelette for Two", "link": "https://www.seriouseats.com/recipes/2016/04/diner-style-asparagus-bacon-gruyere-cheese-omelette-recipe-food-lab.html", "description": "Just as with scrambled eggs, the method by which the eggs are heated and stirred is the primary factor that determines what kind of omelette you end up with. This smoky version, perfect for spring, uses my basic technique for diner-style omelettes with large, tender, browned curds and plenty of space for fillings.", "totalTime": "15 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Asparagus", "Bacon", "Breakfast and Brunch", "Easter", "Father's Day", "Mother's Day", "Omelettes", "The Food Lab"], "recipeIngredient": ["4 or 5 large eggs", "Kosher salt and freshly ground black pepper", "Small bunch chopped chives, tarragon, or parsley", "4 ounces (120g) bacon, diced", "6 ounces asparagus (170g; 6 to 8 stalks), trimmed and sliced thinly on a bias", "1 large shallot (about 2 ounces; 60g), thinly sliced", "2 to 3 ounces (80g) grated Gruyère cheese", "1 tablespoon (15g) unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the eggs, salt, pepper, and herbs in a medium bowl and whisk until homogeneous and frothy, about 1 minute. Allow to rest at room temperature for 10 to 15 minutes. The eggs should darken in color significantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cook bacon in a 10-inch nonstick skillet over medium heat, stirring until crisp and browned, about 5 minutes. Add asparagus and shallots, season to taste with salt and pepper, and continue to cook until asparagus is tender and starting to brown, about 2 minutes longer. Transfer mixture to a small bowl, add the cheese, and toss to combine. Wipe out the skillet with a paper towel and return it to medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the butter to the pan and cook until lightly browned. Re-whisk the eggs until foamy, then add to the skillet and cook, using a silicone spatula to push the edges in toward the center as they set and tilting the pan to spread the uncooked egg underneath. Continue pushing in the edges of the eggs and tilting the skillet, working all around the pan, until the omelette is almost set, about 45 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the asparagus and bacon over half of the omelette, remove from heat, cover, and let the omelette sit until it reaches the desired consistency, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a silicone spatula, loosen the edges of the omelette from the skillet and shake the skillet to ensure that it's not stuck. Carefully fold the omelette in half, then slide it onto a serving plate and serve immediately.</p>"}]}