{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160714-vanilla-pudding-pops-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["chocolate", "easy", "frozen dessert", "popsicle", "pudding", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "DIY Pudding Pops", "link": "https://www.seriouseats.com/recipes/2016/08/homemade-diy-pudding-pop-ice-cream-popsicle-bravetart-recipe.html", "description": "Few desserts are both rich and refreshing at the same time, but that's what pudding pops do best. They're as creamy as top-notch soft-serve, but light enough to feel just a little bracing on a hot summer's day. In fact, they turn out particularly nice with skim milk, which gives the pops an icy quality that I absolutely adore. If you like, dip 'em in melted chocolate cut with coconut oil to make a quick Klondike Bar&ndash;like treat.", "totalTime": "5 1/2 hours", "recipeYield": "Makes 10 popsicles", "recipeCategory": ["Chocolate", "Ice Cream and Frozen Treats", "Puddings and Custards"], "recipeIngredient": ["<strong>For the Pudding:</strong>", "18 ounces milk, any percentage will do (2 1/4 cups; 510g), divided", "6 ounces heavy cream (3/4 cup; 170g)", "1 vanilla bean, split and scraped, pod and seeds reserved separately (see note for instructions on using vanilla extract)", "7 ounces sugar (1 cup; 195g)", "1 ounce tapioca starch (1/4 cup; 28g)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "3 large eggs", "1/2 ounce rum, or your favorite liquor (1 tablespoon; 15g) (omit if using vanilla extract; see note)", "<strong>For the Chocolate Shell (optional):</strong>", "8 ounces dark or milk chocolate (1 1/2 cups; 225g), finely chopped", "2 ounces coconut oil (1/4 cup; 55g), refined or virgin (see note)", "Sprinkles, crushed peanuts, cocoa nibs, or other crunchy bits, to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pudding:</strong> Bring 10 ounces milk (1 1/4 cups; 280g), cream, and vanilla pod to a simmer over medium heat in a 3-quart stainless steel saucepan or saucier. Once the dairy begins to bubble, remove from heat, cover, and steep 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, blend together vanilla seeds, sugar, tapioca starch, and salt until well combined, then whisk in eggs. Remove vanilla pod from dairy and discard, then pour into egg mixture, whisking all the while.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return to saucepan and cook over medium heat, whisking constantly but not vigorously, until thick and just beginning to bubble. Immediately pour through a fine-mesh strainer into a quart-size measuring cup, then stir in remaining milk and rum (see note). Divide evenly between 10 three-fluid-ounce popsicle molds and freeze until just beginning to firm, about 30 minutes. Insert popsicle sticks and continue freezing until completely solid, about 4 hours. To unmold, place molds in hot tap water for a few seconds and jiggle sticks to release. Wrap individually in plastic and freeze up to 3 weeks, or arrange on a parchment-lined baking sheet and freeze while you prepare the chocolate shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chocolate Shell (optional): </strong> Microwave chopped chocolate with a few 15-second bursts, stirring well between each round, until fluid and warm. Stir in coconut oil with a flexible spatula and transfer to the smallest possible measuring cup or drinking glass that can accommodate a popsicle. Dip popsicles one by one, letting the excess run off. If you like, dip in sprinkles or other crunchy coating before chocolate starts to set. Return to baking sheet and freeze to ensure chocolate coating is completely hard, about 5 minutes. Transfer to individual sandwich bags and freeze up to 1 month.</p>"}]}