{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160801-sous-vide-barbecue-chuck-new-2.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barbecue", "beef", "brisket", "chuck", "grill", "texas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.9", "ratingCount": "10"}, "name": "Sous Vide Smoked Beef Chuck", "link": "https://www.seriouseats.com/recipes/2016/08/sous-vide-smoked-barbecue-bbq-beef-chuck-recipe.html", "description": "Beef chuck is an excellent alternative to brisket for barbecue. It's easier to find, cheaper, and more foolproof. Cooking it sous vide before smoking makes it even more foolproof, guaranteeing you tender and juicy results.", "totalTime": "About 42 hours", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Beef", "Mains", "Sous Vide", "The Food Lab"], "recipeIngredient": ["2 ounces coarsely ground black peppercorns (about 1/3 cup; 55g) (see note)", "2 1/4 ounces kosher salt (about 1/4 cup; 65g)", "1/4 ounce (10g) pink salt, such as <dorado id=\"pink-curing-salt\" class=\"text\">Prague Powder #1</dorado> (optional; see note)", "1 (4- to 5-pound; 1.8 to 2.25kg) piece beef chuck roll", "1/4 teaspoon liquid smoke, such as <dorado id=\"liquid-smoke\" class=\"text\">Wright's Liquid Smoke</dorado> (optional; see note)", "Dill pickles, sliced yellow onion, and white bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pepper, salt, and pink salt (if using) in a small bowl. Rub 2/3 of mixture evenly over surface of chuck. Reserve remaining 1/3 of mixture. Secure chuck roll with 2 to 3 pieces of twine tied around its circumference at 1- to 1 1/2-inch intervals.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chuck roll in a vacuum bag. (Fold over top of bag while you add beef so that no rub or juices get on edge of bag, which can weaken the seal.) Add 1/4 teaspoon liquid smoke to bag, if using. Seal bag using a vacuum sealer and let rest for 2 to 3 hours in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set your precision cooker to 155&deg;F (68&deg;C). Add chuck to water bath and cover it with a lid, aluminum foil, or table tennis balls. Cook for 36 hours. Allow cooked chuck to cool at least to room temperature before proceeding (an ice bath can speed up this process). Chuck can be stored in the refrigerator at this stage for up to 1 week before finishing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on the Grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1/2 chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to medium-high heat, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chuck from bag and carefully blot dry with paper towels. (Liquid from bag can be added to your favorite barbecue sauce and simmered down to provide extra flavor.) Rub reserved salt and pepper mixture into surface of chuck.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chuck on cooler side of grill. Add 4 to 5 hardwood chunks to hotter side of grill. (If using a gas grill, wrap wood chunks loosely in aluminum foil before placing over hotter side of grill.) Cover and allow chuck to smoke, adjusting vents to maintain a temperature between 275 and 300&deg;F (135 and 149&deg;C) and adding 2 to 3 wood chunks twice during cooking. Smoke until a deep, dark bark has formed, about 3 hours. Continue with step 8.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish in the Oven:</strong> Adjust oven rack to lower-middle position and preheat oven to 300&deg;F (149&deg;C). If your oven has a convection setting, turn it on and adjust heat to 275&deg;F (135&deg;C) instead. Remove chuck from sous vide bag and carefully blot dry with paper towels. (Liquid from bag can be added to your favorite barbecue sauce and simmered down to provide extra flavor.) Rub reserved salt and pepper mixture into surface of chuck. Place chuck on a wire rack set in a rimmed baking sheet and place in oven. Roast until a deep, dark bark has formed, about 2 hours. Continue with step 8.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat, transfer to a cutting board, tent with foil, and allow to cool until internal temperature drops to between 140 and 165&deg;F (60 and 74&deg;C) before serving, 30 minutes to 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, slice meat in half with its grain, running knife in between the two largest muscle groups to separate them. Discard twine and place the two halves cut side down on cutting board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice meat thinly against the grain, using a sharp chef's knife or slicing knife. Serve beef with sliced onion, pickles, and white bread. For best results, slice only what you are serving. Remaining chuck can be wrapped in foil and stored in the refrigerator for up to 1 week. Reheat leftover chuck in a 275&deg;F (135&deg;C) oven directly in the foil until hot, about 1 hour.</p>"}]}