{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160201-seafood-salad-vicky-wasik-17.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["Italian", "mussel", "scallop", "seafood", "shrimp", "squid"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Italian Seafood Salad (Insalata di Mare)", "link": "https://www.seriouseats.com/recipes/2016/03/italian-seafood-salad-recipe.html", "description": "Italy's classic light, bright salad of gently cooked and marinated seafood, including shrimp, squid, scallops, and mussels, with lemon juice, olive oil, parsley, and subtle spices.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 to 6 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Clams, Mussels, and Oysters", "Italian", "Other Seafood", "Salads", "Shrimp"], "recipeIngredient": ["1/2 pound (225g) dry-packed bay or sea scallops, cut into 1/2-inch pieces", "2 teaspoons grated zest and 1 cup (240ml) juice from 8 to 10 lemons, divided", "1 pound (450g) large shrimp, peeled and deveined", "1/2 teaspoon kosher salt, plus more to taste", "1/4 teaspoon baking soda", "4 medium cloves garlic, 2 crushed and 2 minced, divided", "1/2 cup plus 1 tablespoon (135ml) extra-virgin olive oil, divided", "2 pounds (1kg) mussels, de-bearded and scrubbed (see note)", "5 whole peppercorns", "2 bay leaves", "1 pound (450g) cleaned squid bodies and tentacles, bodies cut into 1/2-inch rings and large tentacles halved lengthwise", "1/4 cup packed minced flat-leaf parsley leaves and tender stems (3/4 ounce; 20g)", "Dash cayenne pepper", "Dash ground coriander seed (optional)", "Freshly ground black pepper", "2 stalks celery, sliced thinly on the bias (6 ounces; 170g)", "1/2 cored and peeled fennel bulb, cut lengthwise into quarters, then sliced thinly on the bias (4 ounces; 115g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a nonreactive bowl, combine scallops with 6 tablespoons (90ml) lemon juice and toss well. Refrigerate for at least 1 hour and up to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium bowl, toss shrimp with salt and baking soda and refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, heat 2 crushed cloves garlic in 1 tablespoon (15ml) oil over medium heat until golden, about 4 minutes. Add 1 cup (240ml) water and bring to a simmer over high heat. Add mussels, cover, and cook until all mussels have opened, about 3 minutes. Using a slotted spoon, transfer mussels to a large bowl and refrigerate until chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 4 cups (960ml) cold water to mussel-steaming liquid, along with 2 tablespoons (30ml) lemon juice, peppercorns, and bay leaves. Add shrimp (without rinsing) and squid to poaching liquid and set over medium-high heat. Cook over medium-high heat, stirring occasionally, until liquid temperature reaches 170&deg;F on an instant-read thermometer. Continue cooking until shrimp are cooked through and no longer translucent in the center. (They may already be cooked by the time your water reaches 170&deg;F; adjust heat to make sure temperature does not go over 170&deg;F otherwise.) Using a slotted spoon, transfer shrimp and squid to a large bowl, then refrigerate until chilled. Discard poaching liquid, peppercorns, and bay leaves.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick all but 10 mussels from their shells, discarding shells. Cut shrimp in half lengthwise down the middle. In a medium bowl, combine parsley, remaining 1/2 cup (120ml) lemon juice, lemon zest, remaining 1/2 cup (120ml) olive oil, remaining 2 minced cloves garlic, cayenne pepper, and coriander seed (if using). Whisk well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain scallops. In a large bowl, combine scallops, shrimp, squid, shelled mussels, and dressing. Season with salt and pepper and toss well. Mix in 10 shell-on mussels. Dressed seafood can be refrigerated for up to 2 days and will improve in flavor during that time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, add celery and fennel to seafood salad and toss well. (Celery and fennel can be added up to 30 minutes before serving, but any earlier and they'll soften too much.) Season with salt and pepper and serve chilled.</p>"}]}