{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/05/AngelFoodCake.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "cake", "egg white"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Effortless Angel Food Cake", "link": "https://www.seriouseats.com/recipes/2016/05/easy-angel-food-cake-recipe.html", "description": "Delicate, uber-fluffy angel food cake is one of the easiest recipes I know: Just throw some cold egg whites and sugar into a bowl, whip 'em up, and stop before they're stiff. After that, it's simply a matter of stirring cake flour into the glossy meringue and baking the whole thing off. With this approach, you <em>and</em> the egg white proteins stay relaxed, making collapsed cakes and angel food anxiety a thing of the past.", "totalTime": "3 hours", "recipeYield": "Makes one 10-inch tube cake", "recipeCategory": ["Cakes", "Christmas", "Desserts", "Easter", "Father's Day", "Mother's Day", "Valentine's Day"], "recipeIngredient": ["5 ounces bleached cake flour (1 cup plus 2 tablespoons; 140g) (see note)", "15 ounces cold egg whites (2 cups; 425g) from 12 large eggs", "15 ounces granulated sugar (2 cups; 425g)", "1 tablespoon (15ml) vanilla extract", "1 ounce freshly squeezed lemon juice (2 tablespoons; 25g) from 1 small lemon", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "<strong>To Serve:</strong>", "2 pints assorted fruit, such as blueberries, blackberries, and figs (optional)", "1 ounce <a href=\"http://www.seriouseats.com/recipes/2016/03/fresh-lemon-syrup-recipe.html\">Fresh Lemon Syrup</a> (2 tablespoons; 25g), optional", "6 ounces <a href=\"http://www.seriouseats.com/recipes/2016/03/lemon-chantilly-recipe.html\">Lemon Chantilly</a> (1 cup; 170g), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to the middle position and preheat to 350&deg;F (180&deg;C). Sift cake flour and set aside. Combine egg whites, sugar, and vanilla extract in the bowl of a stand mixer fitted with the whisk attachment. Mix on low to loosen, about 1 minute, then increase to medium-low (4 on a KitchenAid) and whip 3 minutes; the whites will be dense and dark.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer still running, add lemon juice and salt. Immediately increase to medium (6 on a KitchenAid) and whip 3 minutes more; the meringue will be thin but foamy. Increase to medium-high (8 on a KitchenAid) and continue whipping until the meringue is glossy white and thick enough that you can see the pattern left by the wire whisk. This can take between 2 and 4 minutes, depending on the freshness of the whites and the horsepower of your mixer. When meringue is ready, it should be soft enough to run off the wires when the whisk attachment is removed, but thick enough to mound up on itself like soft-serve in the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle cake flour on top and stir with a flexible spatula to roughly combine. Switch to a folding motion, scraping from the bottom up and folding through the center, until no pockets of flour remain. Scrape the batter into a 10-inch aluminum tube pan (do not butter or grease pan); if you notice any small pockets of unincorporated flour, simply pause to mix them in. Bake until the cake is puffed, golden blond, and firm to the touch, about 45 minutes, or to an internal temperature of 206&deg;F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Invert pan onto its stilts or onto a trio of cans (see note) and cool upside down until absolutely no trace of warmth remains, at least 2 hours. Slide an offset spatula around the sides of cake to loosen, remove the insert, and slide spatula under the bottom as well. Flip onto a serving plate, pulling gently on the sides of the cake to release it from the center tube. To serve, cut with a chef's knife, using a gentle sawing motion and only the slightest downward pressure. If you like, garnish with figs and berries tossed in <a href=\"http://www.seriouseats.com/recipes/2016/03/fresh-lemon-syrup-recipe.html\">Fresh Lemon Syrup</a> and finish with <a href=\"http://www.seriouseats.com/recipes/2016/03/lemon-chantilly-recipe.html\">Lemon Chantilly</a>. Wrapped tightly in plastic, leftovers will keep up to 1 week at room temperature.</p>"}]}