{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160302-risotto-milanese-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["Italian", "quick", "rice", "risotto"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Creamy Risotto <i>alla Milanese</i> (Saffron Risotto)", "link": "https://www.seriouseats.com/recipes/2016/03/risotto-alla-milanese-saffron-recipe.html", "description": "Saffron-scented risotto <em>alla milanese</em> is one of the most luxurious&mdash;and simplest&mdash;of risottos. This tradition-busting method guarantees the creamiest, silkiest, most delicious version possible.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Gluten-Free", "Italian", "Mains", "Quick and Easy", "Quick Dinners", "Rice", "Sides", "Stovetop"], "recipeIngredient": ["14 ounces risotto rice (400g; about 2 cups), preferably <em>carnaroli</em> or <em>vialone nano</em>", "4 cups (950ml) homemade or store-bought low-sodium <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">chicken stock</a> or homemade <a href=\"http://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable stock</a>, plus more as needed (see note)", "3 tablespoons (45ml) extra-virgin olive oil ", "1 small yellow onion, minced (about 200g; 7 ounces)", "1 cup (225ml) dry white wine ", "2 generous pinches saffron", "Kosher salt", "2 tablespoons (30g) unsalted butter", "1 1/2 ounces (40g) freshly grated Parmigiano-Reggiano cheese, plus more for serving", "1/2 cup (115ml) heavy cream, whipped to stiff peaks (optional; see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine rice and stock in a large bowl. Agitate rice with fingers or a whisk to release starch. Strain through a fine-mesh strainer set over a 2-quart liquid cup measure or large bowl. Allow to drain well, shaking rice of excess liquid.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a heavy 12-inch sauté pan over medium-high heat until shimmering. Add rice and cook, stirring and tossing frequently, until all liquid has evaporated and rice sizzles and takes on a nutty aroma, about 5 minutes. Add onion and continue to cook, stirring frequently, until aromatic, about 1 minute. Add wine and cook, stirring occasionally, until the pan is nearly dry, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Give reserved stock a good stir and pour all but 1 cup over rice. Add saffron and a large pinch of salt, increase heat to high, and bring to a simmer. Stir rice once, making sure no stray grains are clinging to side of pan above the liquid. Cover and reduce heat to lowest possible setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook rice for 10 minutes undisturbed. Stir once, shake pan gently to redistribute rice, cover, and continue cooking until liquid is mostly absorbed and rice is tender with just a faint bite, about 5 minutes longer. <br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid. Stir remaining 1 cup of stock to distribute starch, then stir into rice. Increase heat to high, add butter, and cook, stirring and shaking rice constantly until butter has melted and rice is thick and creamy; add more stock or water as necessary if risotto becomes too dry. Off heat, add cheese and stir rapidly to thoroughly incorporate. Fold in heavy cream, if using. Season with salt. Serve immediately on hot plates, passing more cheese at the table.</p>"}]}