{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/08/peachpie.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "galette", "peach", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4444444444444", "ratingCount": "9"}, "name": "Freeform Peach Pie (Galette)", "link": "https://www.seriouseats.com/recipes/2016/08/freeform-peach-pie-galette-recipe.html", "description": "Ripe summer peaches don't hold up well in the oven, so it's best to bake them as briefly as possible, which is why I prefer them as an open-faced pie&mdash;or galette, as the French would say. Without a pie plate to contend with, the crust bakes so quickly, the peach slices stay wonderfully tender, juicy, and fresh.", "totalTime": "3 to 25 hours, depending on chilling time", "recipeYield": "Serves 6", "recipeCategory": ["Father's Day", "Fruit Desserts", "Peach", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["1/2 batch <a href=\"http://www.seriouseats.com/recipes/2016/06/old-fashioned-flaky-pie-dough-recipe.html\">Old-Fashioned Flaky Pie Dough</a>", "<strong>For the Filling:</strong>", "4 large ripe peaches (about 24 ounces; 680g) (see note)", "1 ounce tapioca starch (1/4 cup; 28g)", "3 1/2 ounces sugar (1/2 cup; 100g) ", "Pinch of Diamond Crystal kosher salt", "<strong>For the Egg Wash and Rum:</strong>", "1 large egg", "1 large egg yolk", "1/2 ounce heavy cream (1 tablespoon; 15g)", "1/8 teaspoon (1/2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1/2 ounce silver rum (1 tablespoon; 15g)", "<strong>To Serve (optional):</strong>", "<a href=\"http://www.seriouseats.com/recipes/2016/08/super-thick-fruity-whipped-cream-recipe.html\">Super-Thick and Fruity Whipped Cream</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare Old-Fashioned Flaky Pie Dough according to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a 14-inch round. Transfer to a parchment-lined aluminum rimmed baking sheet, cover with plastic, and refrigerate to relax and chill dough, at least 2 hours or up to 24.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Wash peaches (no need to peel) and cut into 1/2-inch slices. Measure out 18 ounces (3 cups; 510g) in a medium bowl. Enjoy any extras as a snack; do not use more or you will overcrowd the pie. Sprinkle tapioca starch over peaches and toss until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat to 400&deg;F. Arrange peaches in a ring in the center of chilled dough, tiling slices like dominoes and leaving about a 2-inch border of dough all around. Sprinkle sugar on top of peaches and finish with a pinch of salt. With a sharp knife, cut a series of slits in the border of dough, each running from fruit to edge of dough, spacing them about 5 inches apart. Fold each segment of dough over peaches, tugging gently so the edge of each segment tightly overlaps the one that came before. Refrigerate pie while you prepare egg wash, but no longer than 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Egg Wash:</strong> Whisk egg, egg yolk, cream, and salt in a small bowl. Brush over chilled dough in a thin, even layer (including under each flap). This will give the crust a glossy, golden sheen and help bind the pieces together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until pie is quite juicy, about 20 minutes, then pause to brush rum over any undissolved pockets of sugar. (If sugar is well dissolved, just brush it over the sugar anyway.) Continue baking until golden brown around the edges and bubbling in the center, about 15 minutes longer. Let cool 5 minutes, then slice into wedges and serve warm, with a side of whipped cream if desired.</p>"}]}