{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/06/20160608-poke-tuna-hamachi-octopus-salmon-hawaii-recipe-12.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "hamachi", "Hawaiian", "poke", "quick", "seafood", "yellowtail"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Hamachi Poke With Cucumber and Avocado", "link": "https://www.seriouseats.com/recipes/2016/06/hamachi-yellowtail-poke-cucumber-avocado-recipe.html", "description": "<em>Hamachi</em> is a rich fish that's great eaten in small, <em>nigiri</em>- or sashimi-size bites on its own. In a slightly larger-format dish, like poke, it needs some bright, crunchy counterparts to balance out its richness. Diced cucumbers, chilies, and avocado are a good start, but the real key here is thin strips of lemon zest. Some good extra-virgin olive oil in place of the traditional sesame oil also gives the dish a lighter flavor.", "totalTime": "10 minutes", "recipeYield": "Serves 4 to 6 as an appetizer, or 2 to 3 as a main course with steamed rice", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fish", "Mains", "Quick Dinners", "Salads"], "recipeIngredient": ["12 ounces (340g) raw sashimi-grade hamachi, cut into 1/2-inch cubes", "3 ounces (85g) sweet onion, such as Maui or Vidalia, cut into 1/4-inch dice", "1 scallion, white and light green parts only, thinly sliced", "1 small Persian cucumber (about 4 ounces; 120g), peeled and seeded if skin or seeds are tough, cut into 1/2-inch cubes", "1 small avocado (about 5 ounces; 140g), cut into 1/2-inch dice ", "1 Thai bird or serrano chili, thinly sliced", "2 (1 1/2-inch) strips zest from 1 lemon, sliced as thinly as possible", "1 teaspoon (about 3g) white or black sesame seeds, or a mix", "4 teaspoons (20ml) soy sauce, more or less to taste", "2 teaspoons (10ml) extra-virgin olive oil, more or less to taste", "Kosher salt", "Steamed rice (if eating as a meal)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine hamachi, onion, scallion, cucumber, avocado, chili, lemon zest, sesame seeds, soy sauce, and olive oil in a medium bowl. Season with a small pinch of kosher salt and gently fold to combine. Taste and adjust with more soy sauce, olive oil, or salt as desired. Let stand 5 minutes at room temperature, then serve on its own or on top of steamed rice.</p>"}]}