{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/07/20160608-gluten-free-pie-crust-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "crust", "gluten free", "pastry", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Flaky and Crisp Gluten-Free Pie Crust", "link": "https://www.seriouseats.com/recipes/2016/07/best-gluten-free-pie-crust-recipe.html", "description": "This buttery dough bakes up tender and golden brown&mdash;perfect for all your favorite pies. The trick is <a href=\"https://www.amazon.com/gp/product/B0014UH7J2/?tag=serieats-20\">xanthan gum</a>, which adds strength and elasticity to the dough. Just take your time and work in stages, and your patience will be rewarded with a dough that's flaky, crisp, and beautiful to behold.", "totalTime": "2 1/2 hours", "recipeYield": "Makes 2 single- or 1 double-crusted 9-inch pie (regular or deep-dish)", "recipeCategory": ["Christmas", "Gluten-Free", "Pastry", "Pies, Tarts, and Crumbles", "Thanksgiving"], "recipeIngredient": ["4 ounces white rice flour (3/4 cup; 113g)", "2 1/2 ounces cornstarch (1/2 cup; 70g), plus more for dusting", "1 1/2 ounces tapioca flour (1/3 cup; 42g)", "1 ounce coconut flour (1/4 cup; 28g)", "1/2 ounce sugar (1 tablespoon; 15g)", "1 1/4 teaspoons (5g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1/2 teaspoon xanthan gum", "8 ounces unsalted butter (2 sticks; 225g), cold", "4 ounces cold water (1/2 cup; 115g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Whisk white rice flour, cornstarch, tapioca flour, coconut flour, sugar, salt, and xanthan gum together in a medium bowl. Cut butter into 1/2-inch cubes and toss with flour mixture to break up the pieces. With your fingertips, smash each cube into a thin sheet&mdash;that's it! Stir in water, then knead dough against the sides of the bowl until it comes together in a shaggy ball. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Layers:</strong> On a very generously dusted work surface, gently roll dough into a roughly 10- by 15-inch rectangle, sprinkling more cornstarch above and below to prevent sticking. Don't be shy! Fold the 10-inch sides to the center, then close the newly formed packet like a book. Fold in half once more, bringing the short sides together to create a thick block. The dough will crack along the creases, but that's just fine. Divide in half with a sharp knife or bench scraper. If dough is very soft or if you are working in a hot kitchen, refrigerate for 15 minutes before continuing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Single-Crusted Pies:</strong> Using as much cornstarch as needed, gently roll one piece into a 12-inch circle. Slide an offset spatula underneath it to loosen, then divide into quarters. Transfer to the pie plate one at a time, folding the top edge of each piece over to create a thick border that sits atop the rim of the pan. Press and pinch dough together along the seams to form a unified whole. Repeat with remaining dough. Wrap with plastic and refrigerate at least 2 hours and up to overnight. Use as directed in your favorite recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For a Double-Crusted Pie:</strong> Shape one piece of dough according to the directions above. For a solid top crust, roll remaining dough the same way, or roll into a 9- by 15-inch rectangle for a lattice-top pie. Divide into manageable pieces and transfer to a baking sheet or parchment-lined cutting board. (The parchment will prevent dough from absorbing any savory odors from the board.) Wrap both portions in plastic and refrigerate at least 2 hours and up to overnight. Use as directed in your favorite recipe. </p>"}]}