{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160831-homemade-mcrib-01-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["barbecue", "burger", "fast food", "grill", "mcrib", "pork", "sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "The Ultimate Homemade McRib (Smoked-Rib Sandwich)", "link": "https://www.seriouseats.com/recipes/2016/09/ultimate-homemade-diy-mcrib-recipe.html", "description": "McDonald's McRib is the rarely available pork-and-barbecue-sauce sandwich with a cultlike following. My goal? Take everything we love about the McRib and turn it up to 11, by starting from scratch with a few high-quality ingredients and a lot of good technique. It's a project, but it is oh-so-worth it.", "totalTime": "11 to 12 hours", "recipeYield": "Serves 8", "recipeCategory": ["Burger", "Game Day", "Grilling, Smoking, and Barbecue", "July 4th", "Labor Day", "Mains", "Memorial Day", "Pork", "Sandwiches", "Summer", "The Food Lab"], "recipeIngredient": ["2 (2-pound; 900g) racks baby back ribs", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2016/09/easy-basic-barbecue-rub-sauce-all-purpose-recipe.html\">Easy All-Purpose Barbecue Sauce and Rub</a> (see note)", "1 1/2 pounds (700g) boneless pork shoulder, cut into 1-inch cubes", "12g kosher salt (about 1/2 ounce; 1 tablespoon)", "12g sugar (about 1/2 ounce; 1 tablespoon)", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2015/05/cemitas-mexican-saseme-seed-sandwich-buns-recipe.html\">Cemita Buns</a> (see note)", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2016/09/quick-dill-pickle-chips-recipe.html\">Quick Dill Pickles</a> (see note)", "1 white onion, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place ribs, bone side up, on a cutting board. Using paper towels to grip, pull the transparent membrane off the bones. It should come off easily in one large strip (see photo for reference). Rub ribs generously on all surfaces with barbecue rub, then split them into 4- to 5-rib sections with a sharp chef's knife or boning knife. Transfer to a covered container and refrigerate for at least 4 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine pork shoulder, salt, and sugar in a large bowl and toss to coat. Transfer to a zipper-lock bag and refrigerate for at least 4 hours and up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1/3 chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Place a few wood chunks directly on top of charcoal, set grill grate in place, and arrange ribs, bone side down, on cooler side of grill. Cover, adjusting lid so that vents are over ribs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, adjusting upper and lower vents to maintain a temperature of between 225 and 275&deg;F (108 and 135&deg;C), adding more coals as necessary and adding a wood chunk every 45 minutes, until ribs show a gentle bend when you lift them and show only slight resistance when a toothpick is inserted between the bones, about 4 hours total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Paint ribs with barbecue sauce, cover, and continue cooking for 10 minutes. Repeat with 2 more coats of sauce, then transfer to a cutting board.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cool enough to handle, twist bones out of ribs and discard. Roughly chop the meat. Spread on a large plate in a single layer and refrigerate until thoroughly chilled, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When rib meat is chilled, combine 1/4 of rib meat with 1/4 of pork shoulder in the bowl of a food processor, making sure to keep the remaining meat well chilled in the refrigerator. Pulse until a rough grind is achieved, about 12 short pulses (see photo for reference). Transfer to a large bowl and repeat with remaining 3 batches of rib meat and shoulder meat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line 2 <a href=\"https://www.amazon.com/Nordic-Ware-Natural-Aluminum-Commercial/dp/B000RYPHRK/?tag=serieats-20\" >quarter sheet pans</a> or 1 <a href=\"https://www.amazon.com/Nordic-Ware-Natural-Aluminum-Commercial/dp/B000G0KJG4/?tag=serieats-20\" >half sheet pan</a> with <a href=\"https://www.amazon.com/2dayShip-Premium-Quilon-Parchmet-Baking/dp/B00UVTENI0/?tag=serieats-20\">parchment paper</a>. Divide meat mixture evenly between the 2 quarter sheet pans, or spread on the half sheet pan. Cover mixture with parchment paper, then, using your hands, spread mixture out to form two 9- by 9-inch squares (or one 9- by 18-inch rectangle in the half sheet pan).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide meat and parchment out onto a cutting board. Using a sharp chef's knife, cut into individual patties measuring 4 1/2 by 4 1/2 inches each. Patties can be stacked with their parchment paper intact and stored in the refrigerator for up to 3 days, or in a freezer bag in the freezer for several months. If freezing, cook directly from frozen.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1 chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set grill grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove parchment paper and place patties directly over hot side of grill. Sprinkle with more spice rub. Cook, turning occasionally and transferring patties to cooler side if they start to flare up excessively, until well charred on the exterior. Brush patties with barbecue sauce, cover, and cook until barbecue sauce forms a lacquered glaze. Split buns and toast cut sides on grill until golden brown. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Construct sandwiches by placing a patty on each bottom bun half, brushing with more sauce, and topping with pickles and onion. Close sandwiches and serve.</p>"}]}