{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20161028-baked-macaroni-cheese-bechamel-vicky-wasik-26.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "American", "keywords": ["american", "cheese", "essential", "mac and cheese", "macaroni", "macaroni and cheese", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "6"}, "name": "Classic Baked Macaroni and Cheese Casserole With Cheddar and Gruyère", "link": "https://www.seriouseats.com/recipes/2016/11/classic-bechamel-baked-mac-cheese-recipe.html", "description": "This classic béchamel-based mac and cheese is loaded to the hilt with cheese.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes one 9- by 13-inch baking dish, serving 8", "recipeCategory": ["American", "Baking", "Cheese", "Christmas", "Easter", "Fall", "Game Day", "Mac and Cheese", "Mains", "Recipes", "Sides", "Thanksgiving", "Vegetarian", "Winter"], "recipeIngredient": ["Kosher salt", "1 pound (450g) elbow macaroni", "7 tablespoons (105g) unsalted butter, divided", "2 tablespoons (16g) all-purpose flour", "2 cups (475ml) milk", "1 1/2 pounds (680g) grated sharp cheddar cheese (see note)", "1 teaspoon (5ml) hot sauce, such as Frank's RedHot", "1/2 teaspoon (2g) mustard powder", "1/4 teaspoon (1g) garlic powder", "1/2 pound (225g) grated Gruyère cheese (see note)", "1 cup panko bread crumbs (2 ounces; 55g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400&deg;F (200&deg;C). In a medium pot of salted boiling water, cook elbow macaroni until just shy of al dente, about 2 minutes less than cooking time indicated on package. Drain, then transfer pasta to a large mixing bowl and toss with 2 tablespoons (30g) butter until butter is melted and pasta is evenly coated. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, melt 2 tablespoons (30g) butter over medium-high heat (do not allow it to brown). Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream, whisking constantly and thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to medium-low and, working in increments, whisk in cheddar cheese until a smooth, emulsified cheese sauce forms; do not let sauce come to a boil once cheese is added. Whisk in hot sauce, mustard powder, and garlic powder. Season with salt if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape cheese sauce into pasta and mix until evenly coated. Let cool slightly, then add grated Gruyère and mix well. Scrape pasta into a 9- by 13-inch baking dish and smooth surface into an even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add panko to a small mixing bowl. Melt remaining 3 tablespoons (45g) butter, then add to panko and mix until evenly coated. Season with salt. Scatter panko all over surface of mac and cheese in an even layer. Bake on top rack of oven until browned and bubbling, about 45 minutes (ovens can vary; check often to prevent top from burning).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let mac and cheese rest 15 minutes, then serve. Leftover mac and cheese can be refrigerated for up to 5 days; it reheats surprisingly well in the microwave or oven.</p>"}]}