{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/05/20160509-morel-ramp-fried-egg-toast-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "easy", "morel", "quick", "ramp", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Fried Eggs With Ramps, Morels, and Bacon", "link": "https://www.seriouseats.com/recipes/2016/05/fried-eggs-ramps-morels-bacon-easy-spring-recipe.html", "description": "There's not really much to say about fried eggs with ramps and morels sautéed in butter (and a little bacon fat), other than that, with the exception perhaps of a perfectly fresh everything bagel with cream cheese, it's my favorite breakfast.", "totalTime": "10 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Easter", "Father's Day", "Fried Eggs", "Mother's Day"], "recipeIngredient": ["4 ounces (100g) diced bacon", "6 ounces morel mushrooms (about 3 cups; 160g), <a href=\"http://www.seriouseats.com/2015/05/how-to-clean-cook-prepare-morel-mushrooms.html\">cleaned, trimmed, and cut in half lengthwise</a>", "2 tablespoons (30g) unsalted butter, divided", "6 ounces ramps (about a dozen ramps; 160g), root ends trimmed, white bottoms separated from green tops", "1/2 teaspoon (2.5ml) soy sauce ", "1 teaspoon (5ml) fresh juice from 1 lemon ", "1 tablespoon (15ml) canola oil", "2 eggs", "Kosher salt and freshly ground black pepper", "2 slices hearty buttered toast", "Sliced fresh chives, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat bacon along with 1 tablespoon (15ml) water in a medium cast iron or stainless steel skillet over medium heat, stirring, until water evaporates, bacon fat renders, and bacon is completely crisp, about 5 minutes. Using a slotted spoon, transfer bacon to a bowl and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to medium-high heat until lightly smoking. Add morels and cook, stirring and tossing frequently, until barely starting to brown, about 2 minutes. Add 1 tablespoon (15g) butter and cook, stirring, until morels are nicely browned but not burnt, 1 to 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add ramps and cook, stirring and tossing frequently, until whites are browned and tender and greens are crisp in spots, about 2 minutes. Add 2 tablespoons (30ml) water, soy sauce, lemon juice, and remaining tablespoon butter. Remove from heat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat canola oil in a medium nonstick or well-seasoned cast iron skillet over medium-high heat until shimmering. Add eggs, season with salt and pepper, and cook, occasionally using a spoon to baste hot oil over the whites to help them cook, until whites are set, edges are crisp, and yolk is still runny.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a slice of toast on each of two plates. Top each with a fried egg. Return morel/ramp mixture to high heat and stir in bacon. Cook over high heat until liquid reduces to a creamy, emulsified sauce. Season to taste with salt and pepper. Spoon morels and ramps over and around fried eggs. Sprinkle with chives and serve.</p>"}]}