{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20161102-sous-vide-bacon-12.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["breakfast", "low carb", "pork"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "12"}, "name": "Overnight Sous Vide Bacon", "link": "https://www.seriouseats.com/recipes/2016/11/overnight-sous-vide-bacon-recipe.html", "description": "I was skeptical of the idea of sous vide bacon. I generally prefer my bacon cooked completely crisp, rather than trying to get bacon that's crisp and moist at the same time. But bacon cooked sous vide overnight is the first I've ever tasted that delivers on that moist-and-crisp promise. It's crispy on the exterior as you bite into it, but it quite literally melts in your mouth, like the finest confit pork belly, as you chew. Here's how to make it.", "totalTime": "Overnight, or up to 2 days", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Father's Day", "Gluten-Free", "Mother's Day", "Pork", "Sous Vide", "The Food Lab"], "recipeIngredient": ["1 pound (450g) thick-cut bacon, still in its package (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a sous vide water bath to 145&deg;F (63&deg;C). Place bacon, still in its original plastic packaging, directly in water bath and cook for at least 8 and up to 48 hours. When ready to serve, remove from water bath and proceed immediately to step 2, or chill in refrigerator or freezer for later use (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish, preheat a large skillet or griddle over medium-high heat for 5 minutes. Add bacon and cook, pressing gently with a press or the back of a spatula (just enough to keep it mostly flat), until brown and crisp on the first side, about 2 minutes. Turn bacon and briefly cook on second side, just to remove pale color (about 15 seconds).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a paper towel&ndash;lined plate to remove excess fat. Serve immediately.</p>"}]}