{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/10/20161004-beef-barley-soup-vicky-wasik-10.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["barley", "beef", "fall", "grain", "soup", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Rich and Hearty Beef Barley Soup", "link": "https://www.seriouseats.com/recipes/2016/10/beef-barley-soup-recipe.html", "description": "Beef barley soup should be deeply beefy, loaded with chunks of tender meat, plump grains of barley, and aromatic vegetables. The secret to those results is to make it much like a beef stew, choosing the right cut of beef, handling it the right way, and adding more complex layers of flavor.", "totalTime": "2 to 3 1/2 hours", "recipeYield": "Makes about 3 quarts (3L)", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Beef", "Beef Stew", "Fall", "Mains", "Other Grains", "Stovetop", "Winter"], "recipeIngredient": ["2 pounds (1kg) boneless beef chuck roast, cut into 1 1/2–inch steaks, or 3 pounds (1.3kg) bone-in beef short ribs, ribs removed and reserved (see note)", "Kosher salt and freshly ground black pepper", "1 tablespoon (15ml) canola oil", "3 large carrots (10 ounces; 280g), diced", "1 large yellow onion (12 ounces; 340g), diced", "2 ribs celery (6 ounces; 170g), diced", "4 medium cloves garlic, roughly chopped", "3 quarts (3L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought chicken stock (see note)", "Sachet of 2 sprigs fresh thyme, 1 bay leaf, and about 5 whole black peppercorns", "1 cup pearled barley (7 ounces; 200g)", "1/2 teaspoon (3ml) Asian fish sauce (optional)", "Minced fresh parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season beef with salt and pepper. In a large pot or Dutch oven, heat oil over high heat until lightly smoking. Working in batches if necessary, add beef and cook, turning occasionally, until well browned on all sides, about 5 minutes per side. Transfer to a large platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add carrot, onion, celery, and garlic to pot and cook, stirring and scraping up any browned bits from the bottom, until lightly browned, about 6 minutes. Scrape vegetables into a heatproof bowl and set aside. Add stock to pot, return to heat, and scrape up any browned bits from bottom of pot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cut beef into chunks and add to pot, along with reserved bones, if using, and herb sachet. Bring to a simmer, then reduce heat to maintain a low simmer and cook until beef is tender, 1 to 2 hours; skim any foam that rises to the top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Discard bones and herb sachet. Add barley, reserved vegetables, and fish sauce, if using, and simmer until barley and vegetables are tender, about 30 minutes. Season with salt and pepper. If soup is too dry, top up with water to achieve desired consistency. Serve, garnishing with parsley.</p>"}]}