{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160504-stir-fry-spring-vegetable-olive-recipe-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Chinese", "keywords": ["asparagus", "Chinese", "easy", "english pea", "morel", "pea", "quick", "sichuan", "snap pea", "spring", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stir-Fried Spring Vegetables With Black Olives and Sichuan Peppercorn", "link": "https://www.seriouseats.com/recipes/2016/05/stir-fried-spring-vegetables-black-olive-sichuan-peppercorn-recipe.html", "description": "Asparagus, fresh fava beans, English peas, snap peas, and morel mushrooms might not be typical menu items at your average Chengdu greasy spoon&mdash;but hey, we've managed to transform Western broccoli into the most common vegetable on the takeout menu, so why not branch out even further? This stir-fry uses the best Western spring produce and Chinese techniques and flavors for a unique dish to brighten up your table.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Asparagus", "Chinese", "Dairy-Free", "Legumes", "Mains", "Stir Frying", "Vegan", "Vegetarian"], "recipeIngredient": ["Kosher salt", "1/2 pound (225g) asparagus, cut on a bias into 2-inch pieces", "1/4 pound shelled fava beans (about 1 cup; 120g)", "1/4 pound shelled English peas (about 1 cup; 120g)", "1/2 pound sugar snap peas (about 2 cups; 225g), split in half on a sharp bias", "3 tablespoons (45ml) vegetable oil, divided", "1/4 pound morel mushrooms (1 cup; 120g), <a href=\"http://www.seriouseats.com/2015/05/how-to-clean-cook-prepare-morel-mushrooms.html\">trimmed</a> and split in half lengthwise", "6 whole <em>árbol</em> or Chinese hot dried chilies", "2 teaspoons (4g) ground Sichuan peppercorns", "1/4 cup pitted black olives (about 3 ounces; 80g), minced", "4 scallions, white and green parts only, finely minced (about 2 ounces; 55g)", "3 medium cloves garlic, finely minced (about 1/2 ounce; 10g)", "1 tablespoon minced peeled fresh ginger (about 1/2 ounce; 10g)", "2 tablespoons (30ml) Shaoxing wine or dry sherry ", "1 tablespoon (15ml) soy sauce", "2 tablespoons (10g) finely chopped fresh cilantro leaves ", "2 tablespoons (10g) finely chopped fresh mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil. Add asparagus and cook until bright green but still crisp, about 45 seconds. Use a fine-mesh strainer to transfer to a bowl of cold water. Cook fava beans, then peas, then sugar snap peas in succession until each is bright green but still crisp, transferring each batch of vegetables to cold water as they cook. Remove skins from fava beans and discard. Carefully drain all vegetables and transfer to a paper towel&ndash;lined tray to dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon (15ml) vegetable oil in a wok over high heat until lightly smoking. Add morels and cook, stirring and tossing frequently, until browned on multiple surfaces, about 45 seconds. Transfer to a large bowl. Add another tablespoon vegetable oil to wok and heat over high heat until lightly smoking. Add green vegetables and cook, stirring and tossing occasionally, until vegetables are blackened in spots and tender, about 90 seconds. Transfer to bowl with mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat final tablespoon oil in wok over high heat until shimmering. Add dried chilies and Sichuan peppercorns and cook until aromatic, about 10 seconds. Add olives, scallions, garlic, and ginger and cook, stirring frequently, until fragrant, about 30 seconds. Return mushrooms and vegetables to wok along with Shaoxing wine and soy sauce. Add cilantro and mint. Toss to combine and cook for 30 seconds. Season to taste with salt. Transfer to serving platter and serve immediately.</p>"}]}