{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/06/20160608-poke-tuna-hamachi-octopus-salmon-hawaii-recipe-14.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "Hawaiian", "poke", "quick", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Salmon Poke With Macadamia Nuts and Fried Shallots", "link": "https://www.seriouseats.com/recipes/2016/06/salmon-poke-macadamia-nut-fried-shallot-recipe.html", "description": "Salmon isn't a Hawaiian fish, but it's still great in <em>poke</em>, the Hawaiian raw-fish salad. Because of its fattier texture and more robust flavor, salmon can stand up to some stronger mix-ins at the poke bar.", "totalTime": "20 minutes", "recipeYield": "Serves 4 to 6 as an appetizer, or 2 to 3 as a main course with steamed rice", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Mains", "Salads", "Salmon"], "recipeIngredient": ["1 tablespoon (15ml) vegetable or canola oil", "1/2 cup roughly chopped macadamia nuts (about 2.5 ounces; 70g)", "12 ounces (340g) raw, skinless sashimi-grade salmon, cut into 1/2-inch cubes", "3 ounces (85g) sweet onion, such as Maui or Vidalia, cut into 1/4-inch dice", "1 scallion, thinly sliced", "1 teaspoon (about 3g) white or black sesame seeds, or a mix", "2 tablespoons store-bought or <a href=\"http://www.seriouseats.com/recipes/2013/02/thai-style-fried-shallots.html\">homemade</a> fried shallots (about 1/2 ounce; 15g)", "4 teaspoons (20ml) soy sauce, more or less to taste", "2 teaspoons (10ml) toasted sesame oil, more or less to taste", "1 teaspoon (5ml) chili garlic sauce, more or less to taste", "Kosher salt", "Steamed rice (if eating as a meal)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil and macadamia nuts in a small skillet over medium heat. Cook, tossing and stirring frequently, until nuts are golden brown on most surfaces, about 5 minutes. Transfer to a paper towel&ndash;lined plate and allow to cool for 5 minutes. Transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add salmon, onion, scallion, sesame seeds, shallots, soy sauce, sesame oil, and chili garlic sauce to bowl. Season with a small pinch of kosher salt and gently fold to combine. Taste and adjust with more soy sauce, sesame oil, or chili garlic sauce as desired. Let stand 5 minutes at room temperature, then serve on its own or on top of steamed rice.</p>"}]}