{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160323-mango-sticky-rice-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Thai", "keywords": ["Asian", "coconut", "dessert", "fruit", "mango", "rice", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Thai Coconut Sticky Rice With Mango (Khao Niao Mamuang)", "link": "https://www.seriouseats.com/recipes/2016/04/thai-coconut-sticky-rice-mango-recipe.html", "description": "This Thai dessert of glutinous sticky rice, seasoned with salty-sweet coconut milk and served with tender, fragrant slices of mango, will make an addict out of you.", "totalTime": "1 hour plus soaking time", "recipeYield": "Serves 4", "recipeCategory": ["Coconut", "Desserts", "Father's Day", "Fruit Desserts", "Mango", "Mother's Day", "Rice", "Thai", "Vegetarian"], "recipeIngredient": ["1 cup Thai sweet sticky rice (7 ounces; 200g) (see note)", "1 (14-ounce; 400ml) can full-fat coconut milk, blended well to incorporate fat, divided", "1/2 cup sugar (3 1/2 ounces; 100g), divided", "Kosher salt", "2 teaspoons (6g) cornstarch", "2 Ataúlfo mangoes (about 6 ounces or 170g each), peeled, pitted, and sliced (see note)", "Toasted sesame seeds, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, cover rice with water by several inches and let stand at room temperature 1 hour or up to overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain rice. Assemble a steamer, line with cheesecloth or a clean kitchen towel, and add rice, smoothing surface to form an even layer. Set over high heat, bring water in steamer to a boil, cover, and cook until rice is tender, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small saucepan, bring half the coconut milk to a simmer over medium heat, stirring frequently. Whisk in 1/4 cup plus 2 tablespoons sugar and a large pinch of salt until dissolved. The coconut milk should taste salty-sweet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer cooked rice to a large heatproof bowl and pour coconut milk mixture on top (it will look like too much liquid). Stir well to combine, cover with plastic, and let stand until liquid is absorbed, about 20 minutes. (You can let it stand up to 2 hours at room temperature.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, clean saucepan and add remaining coconut milk to it. Bring to a simmer over medium heat, stirring frequently. In a small bowl, combine cornstarch with a couple of teaspoons of the hot coconut milk and stir to form a slurry. Whisk cornstarch slurry into coconut milk and simmer until thickened, about 3 minutes. Whisk in remaining 2 tablespoons sugar and a large pinch of salt until dissolved. Keep coconut cream warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, mound coconut rice onto plates and arrange sliced mango alongside. Drizzle coconut cream all over rice and garnish with toasted sesame seeds. Serve right away.</p>"}]}