{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160703-chorizo-quesadilla-radish-fennel-salsa-Emily-Matt-Clifton-5.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "Tex-Mex", "keywords": ["cheese", "easy", "Mexican", "pork", "quick", "tex-mex"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Chorizo Quesadillas With Radish and Fennel Salsa", "link": "https://www.seriouseats.com/recipes/2016/08/chorizo-quesadillas-radish-fennel-salsa-recipe.html", "description": "Crispy tortillas filled with spicy chorizo and gooey cheese, these quesadillas are balanced by the fresh, unusual flavor of a radish and fennel salsa. It's a sophisticated pairing that elevates a familiar comfort food.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Mains", "Mexican", "Pork", "Quick Dinners", "Tex-Mex"], "recipeIngredient": ["<strong>For the Salsa:</strong>", "5 radishes, diced", "1/2 fennel bulb, diced (plus some fronds, if you have them)", "2 scallions, white and pale-green parts only, thinly sliced", "1/2 cup (20g) cilantro leaves and tender stems, chopped", "1/2 jalapeño pepper, seeds removed if desired, finely chopped", "2 tablespoons (30ml) fresh juice from 1 lime", "Kosher salt and freshly ground black pepper", "<strong>For the Quesadillas:</strong>", "1 tablespoon (15ml) extra-virgin olive oil, divided, plus more as needed", "8 ounces (225g) Spanish-style chorizo sausage (cured, not fresh), cut into 1/2-inch cubes", "4 (8-inch) flour tortillas", "2 cups mixed grated cheddar and pepper Jack cheeses (8 ounces; 225g), divided (see note)", "2 scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salsa:</strong> In a medium bowl, toss together radishes, fennel (plus fronds, if using), scallions, cilantro, jalapeño, and lime juice. Season with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Quesadillas:</strong> In a large cast iron skillet or on the flat side of a cast iron griddle, heat 1/2 tablespoon oil over medium-high heat until lightly smoking. Add chorizo and cook until browned, turning once, about 3 minutes. Remove from pan with a slotted spoon onto a paper towel&ndash;lined plate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set out 4 tortillas on a work surface and sprinkle approximately 1 ounce (28g) cheese over half of each tortilla. Scatter chorizo and scallions on top of cheese, then top with remaining cheese. Fold tortillas in half over filling to form a half-moon shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 1/2 tablespoon oil to skillet or griddle and heat over medium-high heat until lightly smoking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add quesadillas to skillet or griddle in a single layer, working in batches if necessary. Cook until lightly browned, about 4 minutes. Flip quesadillas and cook until second side is crisp and cheese is fully melted, about 3 minutes. Add more oil as needed if working in batches. While cooking any remaining batches, keep finished quesadillas warm by arranging them on a baking sheet in a single layer and holding them in a 250&deg;F oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut quesadillas into wedges and serve with radish and fennel salsa.</p>"}]}