{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/07/20160712-raspberry-whipped-cream-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["blueberry", "chantilly", "fruit dessert", "raspberry", "whipped cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "12"}, "name": "Super-Thick and Fruity Food Processor Whipped Cream", "link": "https://www.seriouseats.com/recipes/2016/08/super-thick-fruity-whipped-cream-recipe.html", "description": "With a handful of freeze-dried fruit, you can make a whipped cream that's as intensely fruity as it is colorful. Whether you choose blueberries, raspberries, or cherries, it's a quick and easy alternative to ice cream for topping your favorite summer pie. Because the dehydrated fruit helps bind the cream, it's also super stable, making it an ideal frosting for layer cakes and cupcakes. You can even refrigerate it for up to a week without having to re-whip!", "totalTime": "5 minutes", "recipeYield": "Makes 2 cups", "recipeCategory": ["Blueberry", "Condiments and Sauces", "Desserts", "Fruit Desserts", "Raspberry"], "recipeIngredient": ["1/2 ounce freeze-dried blueberries, raspberries, or other fruit (1/2 cup; 15g) (see note)", "1 3/4 ounces sugar (1/4 cup; 50g)", "16 ounces heavy whipping cream (2 cups; 455g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, grind freeze-dried fruit and sugar until powdery and fine, about 1 minute. Add cream and stir with a fork to be sure no dry pockets of sugar/fruit are stuck in the corners, then pulse until thick and creamy like Greek yogurt, less than 2 minutes. The time will vary with the horsepower of your machine, so watch it like a hawk to avoid making fruity butter by mistake. Once mixture is thick and creamy, enjoy immediately or transfer to an airtight container and refrigerate up to 1 week.</p>"}]}