{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/09/20160909-minestrone-18.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["bean", "Italian", "minestrone", "pasta", "soup", "squash", "summer squash", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Best Minestrone Soup", "link": "https://www.seriouseats.com/recipes/2016/09/the-best-minestrone-soup-recipe.html", "description": "If all were right in the world, there would be as many recipes for minestrone&mdash;the Italian soup of simmered mixed vegetables and beans&mdash;as there have been individual pots of it cooked. That's because it's really more of a process than a fixed recipe. It's a hearty, easy, delicious meal that you can make with a couple of pantry staples and whatever fresh vegetables you happen to have on hand.", "totalTime": "At least 1 hour 45 minutes and up to 4 hours 15 minutes, plus overnight soak for beans", "recipeYield": "Makes 2 1/2 quarts, serving 6", "recipeCategory": ["Dairy-Free", "Italian", "Mains", "Onion", "Other Vegetables", "Pasta", "Soups and Stews", "Spring", "Squash", "Stovetop", "Summer", "The Food Lab", "Tomato", "Vegan", "Vegetables", "Vegetarian", "Zucchini"], "recipeIngredient": ["<strong>For the Beans (see note):</strong>", "8 ounces (225g) dried cannellini, borlotti, or kidney beans", "Kosher salt", "1 medium onion, split in half (about 6 ounces; 175g)", "1 medium carrot (about 3 ounces; 85g)", "2 celery stalks (about 3 ounces; 85g)", "2 medium cloves garlic", "1 large sprig rosemary", "2 to 3 sprigs parsley", "1 bay leaf", "<strong>For the Soup Base:</strong>", "4 ounces (115g) salt pork or pancetta, cut into 1/4-inch dice (optional)", "2 tablespoons (30ml) extra-virgin olive oil, plus more as needed", "1 medium onion, finely chopped (about 6 ounces; 175g)", "1 medium carrot, peeled and finely diced (about 3 ounces; 85g)", "2 celery stalks, finely diced (about 3 ounces; 85g)", "1 tablespoon (15ml) minced fresh rosemary leaves", "2 medium cloves garlic, minced (about 2 teaspoons; 12g)", "1 pound (450g) ripe Roma tomatoes, <a href=\"http://www.seriouseats.com/2015/08/how-to-peel-tomatoes.html\">peeled</a>, seeded, and chopped (see note)", "1 Parmesan rind (optional; see note)", "<strong>To Finish:</strong>", "1 cup dried small pasta, such as <em>ditali</em>, macaroni, or orecchiette (about 3 1/2 ounces; 100g)", "1 medium zucchini, cut into bite-size pieces (about 4 ounces; 115g)", "1 medium summer squash, cut into bite-size pieces (about 4 ounces; 115g)", "4 ounces green beans, cut into 1/2-inch lengths (about 115g)", "4 ounces spinach, roughly chopped (about 4 cups loosely packed leaves; 115g)", "Chopped fresh herbs, such as basil, parsley, or rosemary, for serving", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Beans:</strong> In a medium bowl, cover beans with cold water by several inches and stir in 1 tablespoon salt. Let beans soak at least 12 hours and up to a day. Drain and rinse.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine beans, onion halves, carrot, celery, garlic cloves, rosemary, parsley, and bay leaf in a large pot and cover with water by several inches. Add a pinch of salt. Bring to a boil, reduce to a simmer, and cook, topping up with water as necessary, until beans are fully tender, about 45 minutes. Using tongs, discard vegetables and aromatics. Drain beans, reserving cooking liquid. Transfer bean-cooking liquid to a 2-quart measuring cup and add enough cold water to equal 2 full quarts (8 cups; 2L).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Soup Base:</strong> Heat pancetta (if using) and olive oil in a large Dutch oven or stockpot over medium-high heat. Cook, stirring, until pancetta has rendered fat and softened, but has not yet browned. (If omitting pancetta, heat oil just until shimmering.) Add onion, carrot, celery, and minced rosemary. Season with a big pinch of salt and cook, stirring, until vegetables are softened but not browned, 10 to 15 minutes, adding more oil if pot appears dry or if vegetables are starting to stick to the bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add garlic and cook, stirring, until fragrant, about 30 seconds. Add tomatoes and cook, stirring, until most of their moisture has evaporated and the mixture starts to fry. (The sound should change from a sputtering simmering sound to a sharper crackle as vegetables start to fry.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add reserved bean-cooking liquid, beans, and Parmesan rind, if using. Let broth simmer for at least 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add pasta (unless you are planning on simmering for a long time; see step 7), zucchini, squash, and green beans and simmer until pasta and vegetables are tender, about 10 minutes. Add spinach and cook, stirring occasionally, until spinach is wilted, about 5 minutes. Discard Parmesan rind, if used.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve soup immediately as is, or continue simmering for up to 2 1/2 hours for a heartier texture and flavor (if simmering for a long time, add the pasta 10 to 15 minutes before serving). Alternatively, reserve half of soup on the side, continue to simmer the other half in the pot for up to 2 1/2 hours, and stir reserved soup back in for a soup that is hearty, but still has plenty of bright vegetable flavor and texture. Stir in chopped herbs and season to taste with salt and pepper before serving.</p>"}]}