{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160422-chiles-rellenos-06composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Tex-Mex", "keywords": ["cal mex", "chile relleno", "chili", "Mexican", "tex-mex"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chiles Rellenos (Mexican-Style Cheese-Stuffed Chilies)", "link": "https://www.seriouseats.com/recipes/2016/04/chiles-rellenos-smothered-and-traditional-recipe.html", "description": "Chiles rellenos&mdash;Mexican-style stuffed and fried peppers in a roasted-tomato salsa&mdash;was one of the first dishes I learned how to cook, using my dad's method. It mostly involved cans. Both my recipe and my technique have improved since those early days: I've experimented with various chili-roasting methods and dozens of batter recipes and techniques, and I've finally nailed that salsa. Here's what I've learned.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Mains", "Mexican", "Tex-Mex"], "recipeIngredient": ["<strong>For the Salsa Ranchera and Chilies:</strong>", "6 Poblano peppers", "2 pounds Roma tomatoes (1kg; about 6 medium)", "1 small yellow onion (about 6 ounces; 170g), split in half, unpeeled", "2 to 3 serrano chilies", "6 medium cloves garlic, unpeeled", "1/2 cup (120ml) chicken stock or water", "1/2 cup loosely packed cilantro leaves and tender stems (1/2 ounce; 15g)", "1 tablespoon (15ml) lard or vegetable oil", "Kosher salt and freshly ground black pepper", "<strong>For the Filling:</strong>", "1 tablespoon (15ml) lard or vegetable oil", "1 small onion (about 6 ounces; 170g), finely diced", "1 teaspoon (about 2g) dried oregano", "1/2 pound (225g) fresh Mexican chorizo or ground pork", "Kosher salt and freshly ground black pepper", "10 ounces (285g) grated Jack, pepper Jack, Chihuahua, or cheddar cheese; 16 ounces (450g) if making smothered version (see note)", "<strong>To Fry:</strong>", "2 cups (475ml) vegetable oil", "4 large eggs, separated", "1 cup flour (5 ounces; 140g), divided "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Salsa Ranchera and Chilies:</strong> Adjust rack to 4 inches below broiler and preheat broiler to high. Place Poblanos, tomatoes, onion, serranos, and garlic on a foil-lined rimmed baking sheet. Broil until chilies are blackened on top, about 5 minutes. Flip chilies to expose another un-blackened surface and continue broiling for another 5 minutes. Turn chilies one more time, flip tomatoes, and continue broiling until chilies are blackened all over, a few minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer tomatoes, onion, garlic, serranos, stock, and cilantro to the bowl of a food processor or blender. Wrap Poblanos with foil from baking sheet and set them aside to steam. Process salsa until smooth but still a little chunky.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon (15ml) lard or oil in a medium saucepan until just starting to smoke. Immediately pour all of the salsa into pan (it will bubble very violently). Bring to a simmer and cook until reduced by about 1/2 cup. Season to taste with salt and pepper and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Heat 1 tablespoon (15ml) lard or vegetable oil in a large skillet over medium-high heat until shimmering. Add onion and cook, stirring, until softened and gently browned, about 4 minutes. Add oregano and chorizo or pork and cook, breaking it up with a wooden spoon, until cooked through, about 5 minutes. Season to taste with salt and pepper. Immediately transfer pork mixture to a bowl with grated cheese and toss to combine. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully peel chilies without tearing them. Make a slit in one and remove most of the seeds. Spoon cheese/pork mixture into the cavity and carefully close chili back up, slightly overlapping the edges. Repeat with remaining chilies. If you are making the smothered version, you should have about 1 cup of filling left over (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Fry:</strong> Heat oil in a large skillet over medium-high heat until it reaches 375&deg;F. Adjust heat to maintain temperature. Whisk egg whites until stiff peaks form. Whisk in yolks one at a time until incorporated (do not over-whisk). Sprinkle with 1/4 cup flour and whisk just until flour is incorporated. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place remaining flour on a shallow plate. Gently pick up one chili and roll it in flour to coat. Transfer to egg mixture and gently turn to coat. (You may have to spoon the mixture over the top if the chili is too fragile.) Using your hands or a flexible fish spatula, carefully slip one chili into hot oil. Repeat until pan is full, making sure not to crowd it. If there are any un-battered spots on the top surfaces of the chilies, dollop a small amount of batter on top to seal them. Cook until the bottom side is golden brown, about 2 minutes. Carefully turn and cook until second side is browned, about 2 minutes longer. Transfer cooked chilies to a paper towel&ndash;lined plate. Repeat until all chilies are cooked.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Traditional Version:</strong> Spoon salsa into the bottom of a casserole dish. Top with chilies and spoon a little more salsa over them. Serve immediately (or bake in a 375&deg;F oven for a few minutes to reheat if desired).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Smothered Version:</strong> Spoon salsa into the bottom of a casserole dish. Top with chilies and spoon a little more salsa over them. Spread remaining filling mixture over the top. Bake in a 375&deg;F oven until melted and bubbly, about 10 minutes. Serve immediately.</p>"}]}