{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/10/20161025-spatchcock-turkey-porchetta-flavor-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["Italian", "roast", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Porchetta-Flavored Spatchcocked Turkey", "link": "https://www.seriouseats.com/recipes/2016/11/porchetta-flavored-spatchcocked-turkey-recipe.html", "description": "The woodsy herb, fennel, and garlic flavors in a classic Italian <em>porchetta</em> are an absolutely natural match for turkey, which is why we stuff them under the skin in this easy recipe. It's such a great pairing, we're surprised the Pilgrims didn't think of it first.", "totalTime": "2 hours", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Christmas", "Fall", "Gluten-Free", "Italian", "Mains", "Roasting", "Thanksgiving", "Turkey", "Winter"], "recipeIngredient": ["3 large onions, roughly chopped (about 1 1/2 quarts; 1 1/2 pounds; 680g), divided", "3 large carrots, peeled and roughly chopped (about 1 quart; 12 ounces; 340g), divided", "4 ribs celery, roughly chopped (about 1 quart; 12 ounces; 340g), divided", "12 thyme sprigs, divided", "1/2 tablespoon black peppercorns (1/4 ounce; 6g)", "1 tablespoon fennel seed (1/4 ounce; 8g)", "1 teaspoon (2g) red pepper flakes ", "4 medium cloves garlic (3/4 ounce; 20g)", "1/2 cup fresh sage leaves (1/2 ounce; 15g)", "1 whole turkey (12 to 14 pounds total; 5.5 to 6.3kg), butterflied <a href=\"http://www.seriouseats.com/2012/11/how-to-spatchcock-cook-turkey-thanksgiving-fast-easy-way-spatchcocked-slideshow.html\">according to these instructions</a>, backbone, neck, and giblets reserved", "2 tablespoons (30ml) vegetable oil, divided", "Kosher salt and freshly ground black pepper", "1 1/2 quarts (1.4L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken or turkey stock", "2 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 450&deg;F (230&deg;C). Line a rimmed baking sheet with aluminum foil. Scatter two-thirds of onions, carrots, celery, and thyme sprigs across pan. Place a wire rack directly on top of vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a food processor or mortar and pestle, combine peppercorns, fennel seed, red pepper flakes, garlic, and sage leaves and process or crush until a rough paste is formed, scraping down sides as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat turkey dry with paper towels. Rub 1 tablespoon (15ml) oil all over turkey, then season liberally on all surfaces with salt and black pepper. (If using a brined, salted, or kosher turkey, omit salting step; see note.) Using your hands, carefully separate skin from turkey breast and leg meat while leaving it fully intact. Stuff three-quarters of herb mixture under skin, making sure to spread it around in an even layer that covers as much of the meat as possible; try to avoid leaving large clumps in any one place. Rub remaining herb mixture all over underside of turkey.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tuck wing tips behind back. Place turkey on top of rack, arranging so that it does not overlap the edges, pressing down on breastbone to flatten breasts slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer turkey to oven and roast, rotating occasionally, until an instant-read thermometer inserted into deepest part of breast registers 150&deg;F (66&deg;C) and thighs register at least 165&deg;F (74&deg;C), about 1 hour 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While turkey roasts, make jus. Roughly chop reserved neck, backbone, and giblets. Heat remaining 1 tablespoon (15ml) oil in a 3-quart saucepan over high heat until shimmering. Add chopped turkey parts and cook, stirring occasionally, until lightly browned, about 5 minutes. Add remaining onions, carrots, and celery and continue to cook, stirring occasionally, until vegetables start to soften and brown in spots, about 5 minutes longer. Add chicken stock, remaining thyme sprigs, and bay leaves. Bring to a boil, then reduce to a bare simmer. Simmer until reduced by half, about 40 minutes. Strain through a fine-mesh strainer into a 2-quart liquid measuring cup and discard solids. Skim off any fat from surface of broth. Season jus to taste with salt and pepper, cover, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When turkey is cooked, remove from oven and transfer rack to a new baking sheet. Allow to rest at room temperature for 20 minutes before carving. Carefully pour any collected juices from pan through a fine-mesh strainer into a liquid measuring cup. Skim off excess fat and discard. Whisk juices into jus.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve turkey and serve with jus.</p>"}]}