{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20150814-sous-vide-sausage-anova-kenji-13.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["anova", "easy", "pork", "sausage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Sous Vide Sausages", "link": "https://www.seriouseats.com/recipes/2016/02/sous-vide-beer-brat-recipe-food-lab.html", "description": "Sausages have a reputation for being easy. They've got the right ratio of fat to meat built in, and even a convenient skin to ensure that all those juices stay inside. But there's a difference between \"yeah, that's a good sausage\" sausages and \"holy crap, how did they fit an entire pig's worth of flavor and juices into this single five-inch tube\" sausages. It's the latter we're after, and the latter that sous vide cooking can help produce.", "totalTime": "1 hour 5 minutes to 4 hours 20 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Mains", "Pork", "Sous Vide", "The Food Lab"], "recipeIngredient": ["3 pounds (1.35kg) natural-casing raw sausage links, such as bratwurst or Italian", "6 ounces (170ml) beer (optional)", "Kosher salt (optional)", "1 tablespoon (15ml) butter or oil (if finishing on stovetop)", "Buns and condiments, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set your precision cooker to the desired temperature, between 140 and 160&deg;F (60 and 71&deg;C), according to the chart above. Place sausages inside vacuum-sealer bags or zipper-lock bags in a single layer. Optionally, add a few tablespoons beer to each bag, along with 2 teaspoons salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Seal the bags, making sure to stop vacuum sealer and seal bags immediately after the air has been removed&mdash;do not let the sausages get squeezed or the liquid get sucked up into the vacuum. Alternatively, use the water displacement method: Seal your zipper-lock bag almost all the way up, then gently lower it into a large pot of water, sealing off the bag just before the top is fully submerged.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sausages to water bath and cook for at least 45 minutes and up to 4 hours. Remove sausages from bags and discard juices. Dry sausages carefully on a paper towel&ndash;lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on the Stovetop:</strong> Heat 1 tablespoon oil or butter over medium heat in a skillet until shimmering. Add sausages and cook, turning occasionally, until well browned on all sides, about 3 minutes. Serve immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish on the Grill:</strong> Grill sausages over medium heat, turning occasionally, until well browned on all sides, about 3 minutes. Serve immediately.</p>"}]}