{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/03/20160318-poached-chicken-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["chicken", "easy", "poach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Juicy and Tender Poached Chicken With Watercress and Miso Dressing", "link": "https://www.seriouseats.com/recipes/2016/03/poached-chicken-miso-watercress-recipe.html", "description": "Poached chicken may not be as popular as fried, roasted, and braised chicken, but when it's done correctly, its tenderness and juiciness are unmatched. Served with a bright, flavorful dressing like this miso vinaigrette, it makes an easy, light, clean-tasting dinner or lunch.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4 as a light meal", "recipeCategory": ["Chicken", "Mains", "Poaching"], "recipeIngredient": ["2 quarts (2L) room-temperature water", "1 1/2 tablespoons (15g) kosher salt", "2 medium skin-on, bone-in chicken breast halves (about 1 1/2 pounds; 680g)", "1 whole scallion, root end trimmed, plus thinly sliced scallion for garnish", "1 (2-inch) knob peeled fresh ginger, thinly sliced", "2 tablespoons (30ml) vegetable oil", "2 tablespoons (30ml) fresh juice from 1 lemon", "2 teaspoons (10ml) white miso", "2 teaspoons (10ml) soy sauce", "1/2 teaspoon (3ml) toasted sesame oil", "7 ounces watercress (200g; about 2 quarts, loosely packed)", "Warm cooked rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan, combine water and salt, stirring to dissolve salt. Add chicken, scallion, and ginger and set over medium-high heat until water temperature reaches between 150 and 160&deg;F on an instant-read thermometer; adjust heat to maintain water temperature in the 150&ndash;160&deg;F range. (It's okay if the temperature bounces around a little, but try to keep it above 150 and below 170&deg;F.) Cook until thickest part of chicken registers 150&deg;F on an instant-read thermometer, about 1 hour. Remove chicken from broth and let rest. Strain broth through a fine-mesh strainer and save for sipping or another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small bowl, whisk together oil, lemon juice, miso, soy sauce, and sesame oil until smooth. In a medium bowl, toss watercress with just enough miso dressing to lightly coat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and discard chicken skin and cut chicken meat from bones; discard bones. Slice chicken crosswise into 1/2-inch pieces. Scoop rice into bowls and top with watercress and chicken slices. Drizzle miso vinaigrette onto chicken and garnish with sliced scallions. Serve.</p>"}]}