{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/05/20160520-japanese-turnips-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["easy", "quick", "root vegetable", "spring", "turnip"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sautéed Japanese Turnips With Turnip Greens", "link": "https://www.seriouseats.com/recipes/2016/06/japanese-turnips-saute-easy-side-dish-recipe.html", "description": "Japanese baby turnips are tender, sweet, and juicy as can be. By taking advantage of both their leaves and their bulbs, this insanely easy and delicious side dish requires very few other ingredients, allowing the turnip flavor to shine through.", "totalTime": "25 minutes", "recipeYield": "Serves 4 as a side dish", "recipeCategory": ["Dairy-Free", "Sides", "Vegan", "Vegetarian"], "recipeIngredient": ["Kosher salt", "1 1/2 pounds (675g) Japanese (Hakurei) baby turnips, with green tops", "3 tablespoons (45ml) extra-virgin olive oil, plus more for drizzling", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium pot of salted water to a boil. Meanwhile, cut greens from turnip bulbs, leaving a small portion of stem (less than 1/2 inch) attached to each bulb. Wash leafy greens and turnips well of any sand. Peel turnips. (You can also leave the turnip skin on, as it's edible, in which case, just wash and scrub them extra well.) Slice each turnip pole to pole into 4 to 6 wedges of 1/2 inch thick each.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add leafy greens to boiling water and cook just until tender, 1 to 2 minutes. Using tongs or a spider, transfer greens to cold water to chill, then drain, squeeze out excess water, and chop into small pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a cast iron, carbon steel, or stainless steel skillet over high heat, just until the first wisps of smoke appear. Add turnip wedges, season with salt and pepper, and cook, stirring and tossing occasionally, until well browned in spots, about 3 minutes; lower heat if turnips threaten to burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chopped greens and toss to combine, cooking just until greens are warmed through, about 1 minute longer. Drizzle with fresh oil, season with salt and pepper, and serve.</p>"}]}