{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/09/cheeseits.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "cheddar", "cheese", "cheez-it", "cracker"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "6"}, "name": "Homemade Cheez-Its", "link": "https://www.seriouseats.com/recipes/2016/09/homemade-diy-cheez-it-recipe.html", "description": "Because they incorporate cream instead of the more common butter, these homemade crackers brown more flavorfully as they bake, creating a deep, nutty, grilled cheese sort of vibe. Eat 'em out of hand, or serve with hearty soups, stews, and chilis.", "totalTime": "2 hours", "recipeYield": "Makes about 250 one-inch crackers", "recipeCategory": ["Cheese", "Christmas", "Snacks"], "recipeIngredient": ["<strong>For the Dough:</strong>", "6 3/4 ounces all-purpose flour (1 1/3 cups; 190g), plus more for dusting", "2 teaspoons baking powder", "2 teaspoons sugar", "1 1/2 teaspoons (6g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1 (8-ounce; 227g) block cheddar cheese, preferably sharp and yellow, grated finely (see note)", "8 ounces heavy cream (1 cup; 225g)", "<strong>For the Egg Wash:</strong>", "1 large egg", "1 large egg yolk", "1/2 ounce water (1 tablespoon; 15g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt, plus more for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Adjust oven rack to middle position and preheat to 375&deg;F (190&deg;C). Whisk flour, baking powder, sugar, and salt together in a medium bowl. Toss cheddar with dry ingredients until well combined. Stir in cream, mixing with a flexible spatula until dough comes together. Transfer to a lightly floured surface, knead until pliable and smooth, then divide in half. On a lightly floured surface, roll each portion into a roughly 15- by 11-inch rectangle, no more than 1/8-inch thick. Transfer each to a parchment-lined half sheet pan, then cut into 1-inch squares using a fluted pastry wheel.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Egg Wash:</strong> Whisk egg, yolk, water, and salt together in a small bowl. Brush over prepared dough, then sprinkle with additional salt to taste. Using a bamboo skewer or chopstick, press a small indentation into the center of each dough square. (This is strictly for a Cheez-It look and is therefore optional.) Bake until golden brown, about 24 minutes. Cool to room temperature and enjoy immediately, or store up to 1 month in an airtight container at room temperature.</p>"}]}