{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/06/047fa61e3e2e30afb880fb18c3c8848b.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["barbecue", "bean", "easy", "low carb", "Mexican", "potluck"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4444444444444", "ratingCount": "9"}, "name": "Frijoles Charros (Mexican Pinto Beans With Bacon and Chilies)", "link": "https://www.seriouseats.com/recipes/2016/06/frijoles-charros-mexican-pinto-beans-bacon-recipe.html", "description": "Do side dishes at potlucks and cookouts ever give you trouble? They're trouble for me. The ideal potluck or cookout dish is one that's easy to make in bulk and inexpensive, and doesn't degrade with extended heating or reheating. I nominate <em>frijoles charros</em>&mdash;Mexican cowboy beans cooked with onions, garlic, tomatoes, salted pork, and chilies&mdash;as one superlative potluck dish.", "totalTime": "1 hour 10 minutes, plus overnight soaking time for beans", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Bacon", "Dairy-Free", "Gluten-Free", "Mexican", "Sides", "Soups and Stews"], "recipeIngredient": ["1 pound (450g) dried pinto beans", "Kosher salt", "12 ounces (340g) diced bacon (see note)", "1 medium white or yellow onion, diced (about 8 ounces; 225g)", "2 serrano chilies or 1 jalapeño, minced (remove seeds and ribs if you prefer less heat)", "3 medium cloves garlic, minced (about 1 tablespoon; 12g)", "2 (14-ounce; 400g) cans diced fire-roasted tomatoes (see note)", "6 cups (1.4L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 bay leaves", "2 sprigs epazote (optional; see note)", "Large handful chopped fresh cilantro leaves and fine stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place beans in a large bowl and cover with water by double. Add 2 tablespoons (30g) kosher salt and stir to dissolve. Let soak 8 to 12 hours. Drain and rinse.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat bacon in a large Dutch oven over medium-high heat, stirring constantly, until fat is rendered and bacon is just starting to brown around the edges, about 5 minutes. Add onion and chilies and cook, stirring, until softened and just starting to brown, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add tomatoes (see note) and cook, stirring and scraping up browned bits from the bottom of the pan, until the liquid is thick and the mixture begins to sizzle, about 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add beans, stock, bay leaves, 2 teaspoons (10g) kosher salt, and epazote (if using). Bring to a boil over high heat, reduce to a bare simmer, cover, and cook until beans are just tender, about 45 minutes. Remove lid and continue cooking, stirring occasionally, until beans are completely creamy and liquid has thickened into a rich, creamy broth. Season to taste with salt. Discard bay leaves, stir in cilantro, and serve. Beans can be stored in the refrigerator for up to 1 week.</p>"}]}