{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/05/20160505-frittata-ramps-asparagus-fennel-vicky-wasik--10.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["asparagus", "easy", "egg", "Italian", "omelette", "quick", "ramp", "spring", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spring Ramp and Asparagus Frittata", "link": "https://www.seriouseats.com/recipes/2016/05/ramp-asparagus-frittata-spring-recipe.html", "description": "When you have amazing seasonal produce, a frittata is one of the best, and easiest, ways to showcase it. In this version, fresh-picked asparagus and ramps add a juicy green bite that's as pure a celebration of spring as you can get.", "totalTime": "15 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Asparagus", "Easter", "Italian", "Omelettes", "Sides", "Vegetarian"], "recipeIngredient": ["10 large eggs", "Kosher salt", "1 pound (450g) asparagus, woody ends trimmed", "3 tablespoons (45ml) extra-virgin olive oil", "8 ounces (225g) ramps, root ends trimmed, bulbs thinly sliced and leaves roughly chopped, divided (see note)", "1/2 teaspoon (about 1g) minced fresh thyme leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, beat eggs with 2 large pinches salt. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a pot of boiling salted water, blanch asparagus until crisp-tender, about 2 minutes. Using tongs, transfer asparagus to an ice bath or cold water to chill. Drain and cut asparagus into 1-inch lengths.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust rack to 4 inches below broiler and preheat broiler to high. Heat oil in a 10-inch oven-safe nonstick or well-seasoned cast iron or carbon steel skillet over medium heat until shimmering. Add sliced ramp bulbs and cook, stirring, until softened, about 3 minutes. Stir in ramp leaves and thyme and cook until leaves are just wilted, about 1 minute. Stir in asparagus and cook until warmed through, 30 seconds. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour eggs into skillet and cook, stirring and scraping pan all over, until loose curds form throughout, about 3 minutes; stop stirring before they permanently separate into scrambled eggs. Let cook until eggs on bottom are set, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place frittata under broiler and cook just until eggs on top are set. Shake pan to loosen frittata, using a spatula to separate the edges if necessary. Turn frittata out onto a plate or serve directly from skillet. Serve warm or at room temperature.</p>"}]}