{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/10/20161025-spatchcock-turkey-glaze-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "Chinese", "roast", "thanksgiving", "turkey"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chinese Red-Sauce-Glazed Spatchcocked Turkey", "link": "https://www.seriouseats.com/recipes/2016/11/chinese-red-sauce-glazed-turkey-thanksgiving-recipe.html", "description": "Inspired by a classic Chinese cooking technique of braising meat in a brothy mixture of soy sauce, Shaoxing wine, sugar, and aromatics like ginger, cinnamon, and star anise, this turkey recipe reimagines those flavors as a sticky, sweet-salty glaze. The result is a turkey with a deep, dark glaze that's profoundly savory and concentrated, infused with the aroma and flavor of the ginger and spices. It's also more than enough to fully season the bird, so there's no need to add any other salt at all.", "totalTime": "2 hours 15 minutes", "recipeYield": "Serves 10 to 12", "recipeCategory": ["Chinese", "Christmas", "Fall", "Mains", "Roasting", "Thanksgiving", "Turkey", "Winter"], "recipeIngredient": ["1 cup (235ml) dark soy sauce ", "1 cup (235ml) Shaoxing wine", "1 cup sugar (8 ounces; 225g)", "1 cinnamon stick", "2 pieces star anise", "2 (1-inch) knobs peeled fresh ginger, lightly crushed under the heel of a knife, divided", "4 scallions, divided", "3 large onions, roughly chopped (about 1 1/2 quarts; 1 1/2 pounds; 680g), divided", "4 ribs celery, roughly chopped (about 1 quart; 12 ounces; 340g), divided", "1 whole turkey (12 to 14 pounds total; 5.5 to 6.3kg), butterflied <a href=\"http://www.seriouseats.com/2012/11/how-to-spatchcock-cook-turkey-thanksgiving-fast-easy-way-spatchcocked-slideshow.html\">according to these instructions</a>, backbone, neck, and giblets reserved", "2 tablespoons (30ml) vegetable oil, divided", "1 1/2 quarts (1.4L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken or turkey stock ", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, stir together soy sauce, Shaoxing wine, and sugar until sugar is mostly dissolved. Add cinnamon, star anise, 1 knob of ginger, and 2 scallions. Set over medium-high heat and bring to a simmer. Lower heat to a bare simmer and cook, stirring occasionally, until mixture is lightly syrupy and coats the back of a spoon, about 40 minutes. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to middle position and preheat oven to 450&deg;F (230&deg;C). Line a rimmed baking sheet with aluminum foil. Scatter two-thirds of onions and celery across pan. Place a wire rack directly on top of vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat turkey dry with paper towels. Rub 1 tablespoon (15ml) oil all over turkey. Using a pastry brush, apply a thin layer of glaze to underside of turkey only. Place turkey skin side up on top of rack, tuck wing tips behind back, and arrange so turkey does not overlap the baking sheet edges, pressing down on breastbone to flatten breasts slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer turkey to oven and roast, rotating occasionally, until an instant-read thermometer inserted into deepest part of breast registers 150&deg;F (66&deg;C) and thighs register at least 165&deg;F (74&deg;C), about 1 hour 20 minutes. During last 20 minutes of cooking, apply several coats of glaze all over turkey skin with pastry brush, roasting for 5 minutes between each coat, until turkey is covered in a deep-brown, sticky glaze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While turkey roasts, make jus. Roughly chop reserved neck, backbone, and giblets. Heat remaining 1 tablespoon (15ml) oil in a 3-quart saucepan over high heat until shimmering. Add chopped turkey parts and cook, stirring occasionally, until lightly browned, about 5 minutes. Add remaining onions, celery, ginger, and scallions and continue to cook, stirring occasionally, until vegetables start to soften and brown in spots, about 5 minutes longer. Add chicken stock, bring to a boil, then reduce to a bare simmer. Simmer until reduced by half, about 40 minutes. Strain through a fine-mesh strainer into a 2-quart liquid measuring cup and discard solids. Skim off any fat from surface of broth. Season jus to taste with salt and pepper, cover, and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When turkey is cooked, remove from oven and transfer rack to a new baking sheet. Allow to rest at room temperature for 20 minutes before carving. Carefully pour any collected juices from pan through a fine-mesh strainer into a liquid measuring cup. Skim off excess fat and discard. Whisk juices into jus.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carve turkey and serve with jus.</p>"}]}