{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2016/09/CARAMELSAUCE.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "caramel", "caramel sauce", "easy", "quick", "sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "15"}, "name": "Easy Homemade Caramel Sauce", "link": "https://www.seriouseats.com/recipes/2016/09/easy-caramel-sauce-recipe.html", "description": "Real caramel sauce is a three-ingredient affair&mdash;nothing more than sugar, water, and cream. Okay, okay, salt and vanilla, too, but it hardly seems fair to count the seasonings. For a sweet and simple flavor, cook the sugar syrup until it's a pale, honey-colored hue. If you'd prefer a darker caramel with a slightly bitter edge, aim for a foxy amber hue. In either case, you're just 20 minutes away from the thick and gooey caramel sauce of your dreams.", "totalTime": "20 minutes", "recipeYield": "Makes 1 1/3 cups (14 ounces)", "recipeCategory": ["Condiments and Sauces", "Desserts", "Gluten-Free", "Quick and Easy"], "recipeIngredient": ["4 ounces water (1/2 cup; 115g)", "8 1/2 ounces sugar (1 1/4 cups; 240g)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1 vanilla pod, reserved from another project (optional)", "8 ounces heavy cream (1 cup; 225g)", "1 teaspoon (5g) vanilla extract (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 3-quart stainless steel saucier, combine water, sugar, and salt over medium heat. If you like, add an empty vanilla pod, too. Stir with a fork until syrup comes to a boil, about 4 minutes, then simmer without stirring until syrup is honey-colored, roughly 6 minutes, shaking and swirling as needed to ensure even caramelization. Continue cooking until syrup is light to medium amber, a minute more. Immediately add cream and reduce heat to medium-low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stirring constantly with a heat-resistant spatula to knock back the foam, simmer until caramel registers 225&deg;F (107&deg;C) on a digital thermometer, about 3 minutes. Transfer to a heat-resistant container, stir in vanilla extract (if using), and cool to room temperature. (No need to discard the vanilla bean; it will continue to infuse the caramel over time.) Caramel will be runny while warm, but thicken as it cools, turning just a little chewy when cold. Refrigerate up to 1 month in an airtight container.</p>"}]}