{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/08/20160824-fudgesicles-vicky-wasik-11.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "chocolate", "cocoa", "dessert", "frozen dessert", "fudge", "fudgsicle", "popsicle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "DIY Fudgsicles", "link": "https://www.seriouseats.com/recipes/2016/09/homemade-fudgsicle-recipe.html", "description": "Made with Dutched cocoa powder, these homemade Fudgsicles have an even deeper chocolate flavor than the original. Balanced by the butterscotch-y sweetness of brown sugar, they're especially refreshing and intense on a hot summer's day.", "totalTime": "About 4 hours", "recipeYield": "Makes 8 popsicles", "recipeCategory": ["Chocolate", "Gluten-Free", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>For the Gelatin:</strong>", "1/4 ounce unflavored gelatin powder (2 1/4 teaspoons; 7g)", "1 ounce milk (2 tablespoons; 30g), preferably skim (though any percentage will do)", "1/2 ounce vanilla extract or crème de cacao (1 tablespoon; 15g)", "<strong>For the Fudgsicle Base:</strong>", "5 ounces light brown sugar (2/3 cup; 140g)", "1 1/2 ounces Dutch process cocoa powder (1/2 cup; 40g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "18 ounces milk (2 1/4 cups; 510g), preferably skim (though any percentage will do), divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Gelatin:</strong> In a small bowl, combine gelatin, milk, and vanilla extract or crème de cacao, mixing with a fork until smooth. Set aside until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fudgsicle Base:</strong> Combine brown sugar, Dutched cocoa powder, and salt in a 3-quart stainless steel saucier, whisking to break up any lumps. Stir in approximately <em>half</em> the milk, then warm over medium heat until just beginning to steam, but not yet bubbling, less than 5 minutes. Immediately remove from heat and stir in gelatin mixture. When gelatin is fully melted, incorporate remaining milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease 8 three-fluid-ounce molds. Transfer Fudgsicle base to a quart-size measuring cup, then divide base between molds. Cover each with foil and freeze until slightly firm, about 45 minutes. Insert popsicle sticks through foil and continue freezing until completely solid, about 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To unmold, run molds under hot tap water for about 30 seconds, then slide a paring knife between the pop and the mold to let air slip in for an easier release. Enjoy immediately, or wrap individually in plastic and freeze up to 3 weeks.</p>"}]}