{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/05/20160428-homemade-cool-whip-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "cool whip", "gelatin", "gluten free", "whipped cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade Cool Whip", "link": "https://www.seriouseats.com/recipes/2016/06/copycat-cool-whip-recipe.html", "description": "Even if you've never cared for the real deal, homemade Cool Whip is something everyone can love. It's silky smooth and rich, but quite a bit lighter than traditional whipped cream. The real kicker is that it's freezer-safe and stable at warmer temperatures as well, making it the perfect make-ahead accompaniment for cookouts and holiday trips where refrigeration isn't always an option.", "totalTime": "3 hours", "recipeYield": "Makes about 5 cups", "recipeCategory": ["Desserts", "Gluten-Free"], "recipeIngredient": ["1 1/2 teaspoons powdered gelatin (see note)", "1 ounce cold water (2 tablespoons; 28g)", "2 ounces cold milk (1/4 cup; 55g); any percentage will do", "3/4 ounce powdered milk (3 tablespoons; 20g), such as Carnation", "1 1/2 teaspoons (7ml) vanilla extract", "2 ounces water (1/4 cup; 55g)", "2 3/4 ounces light corn syrup (1/4 cup; 75g)", "5 ounces sugar (3/4 cup; 140g)", "Heaping 1/4 teaspoon (just over 1g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "14 ounces chilled heavy cream (1 3/4 cups; 395g) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle gelatin over 1 ounce cold water (2 tablespoons; 28g) in a small bowl and stir with a fork to combine. In another bowl, mix together milk, powdered milk, and vanilla until relatively smooth. In a 1-quart stainless steel saucepan, combine the remaining 2 ounces water (1/4 cup; 55g) with corn syrup, sugar, and salt and set over medium heat. Stir with a fork until bubbling hard around the edges, about 3 minutes, then increase heat to medium-high. Clip a digital thermometer to the saucepan and cook, without stirring, until the clear syrup registers 250&deg;F (120&deg;C), about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately transfer to a large heat-safe bowl, scraping pot with a heat-resistant spatula, and cool to exactly 212&deg;F (100&deg;C), about 3 minutes. Add gelatin and whip with a hand mixer at medium-high speed until thick, snowy white, and roughly tripled in volume, about 5 minutes. Add vanilla milk in several small additions, letting each incorporate before adding the next. Once smooth, cover tightly and let stand at room temperature until firm, at least 2 and up to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish, drizzle in cream while mixing at low speed. Whip until mixture begins to thicken, about 5 minutes, then increase speed to medium and whip until cream can hold floppy peaks. Use immediately, or cover bowl with plastic (or transfer to an airtight container) and refrigerate up to 2 weeks. Alternatively, whipped cream can be frozen 3 months in an airtight container.</p>"}]}