{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20161008-broccoli-cheddar-soup-01-primary.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["American cheese", "broccoli", "cheddar", "cheese", "fall", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2857142857143", "ratingCount": "7"}, "name": "Broccoli Cheese Soup", "link": "https://www.seriouseats.com/recipes/2016/10/broccoli-cheddar-cheese-soup-food-lab-recipe.html", "description": "In the world of cheaty foods, broccoli cheese soup has always seemed like one of the cheatiest. There's nothing wrong with owning it: Cheese is delicious, and not every single lunch has to be virtuous. Still, I sometimes wish that the <em>broccoli</em> part of the whole thing was taken a little more seriously, if only for the purely selfish reason that I love broccoli. My goal here was to create a recipe for broccoli cheese soup that was as comforting as the ultra-cheesy kind you typically find, but simultaneously really tasted like broccoli.", "totalTime": "1 hour", "recipeYield": "Serves 6", "recipeCategory": ["Broccoli", "Cheese", "Fall", "Soups and Stews", "Stovetop", "The Food Lab", "Vegetarian", "Winter"], "recipeIngredient": ["1 1/2 pounds (700g) broccoli", "2 tablespoons (30ml) vegetable oil", "Kosher salt and freshly ground black pepper", "3 tablespoons (45g) unsalted butter", "1 medium onion, sliced (about 6 ounces; 170g)", "1 medium carrot, peeled and finely diced (about 4 ounces; 120g)", "3 medium cloves garlic, thinly sliced", "2 cups (475ml) water, or <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "3 cups (700ml) whole milk", "1 small russet potato, peeled and sliced (about 4 ounces; 120g)", "12 ounces (340g) sharp cheddar cheese, grated (see note)", "8 ounces (240g) deli-style American cheese, diced (see note)", "1 teaspoon (3g) mustard powder", "Dash of hot sauce, such as Frank's RedHot"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Separate broccoli into florets and stems. Cut florets into bite-size pieces and set aside. Roughly chop stems and reserve separately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a large Dutch oven over high heat until shimmering. Add broccoli florets and cook, without moving, until charred on the bottom, about 1 minute. Stir, season with salt and pepper, and continue cooking, stirring occasionally, until tender and charred on several surfaces, about 1 minute longer. Transfer to a rimmed baking sheet to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return Dutch oven to medium heat and add butter, onion, carrot, and broccoli stems. Season with salt and pepper and cook, stirring frequently, until tender but not browned, about 5 minutes, lowering heat if necessary. Add garlic and cook, stirring, until fragrant, about 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add water or chicken stock, milk, and potato and bring to a boil over high heat. Reduce to a bare simmer and cook, stirring occasionally, until broccoli and potato are completely tender, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss both cheeses together along with mustard powder. Using an immersion blender or working in batches with a countertop blender, blend soup, adding cheese a handful at a time, until completely smooth. Stir in hot sauce and season to taste with salt and pepper. Stir in reserved broccoli florets and pulse with blender a few more times until a few pieces are broken down, but most bite-size pieces remain. Serve immediately.</p>"}]}