{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20161018-best-way-to-bake-bacon-flat.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["low carb"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baked Bacon for a Crowd", "link": "https://www.seriouseats.com/recipes/2016/10/baked-bacon-for-a-crowd-recipe.html", "description": "Cooking bacon for one or two people is easy: Just grab a pan and cook over moderately low heat until it's as crisp as you want it. The problem comes when you're trying to cook bacon for a crowd, which is when we switch to the oven. But what's the best way to cook it in the oven? It depends on how you like your bacon! Here are my results.", "totalTime": "18 to 25 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Bacon", "Breakfast and Brunch", "Easter", "Father's Day", "Gluten-Free", "Pork", "The Food Lab"], "recipeIngredient": ["12 slices bacon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 425&deg;F (218&deg;C). (If doubling recipe, adjust two racks to upper- and lower-middle positions; see note.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Crisp, Wavy Bacon:</strong> Line a 13- by 18-inch rimmed baking sheet with aluminum foil. Arrange bacon strips on pan, overlapping as little as possible. Bake bacon for 10 minutes. Rotate pan and continue baking until bacon is as browned as you like it, 5 to 10 minutes longer for thin-cut or 10 to 15 minutes longer for thick-cut. Remove bacon from oven, transfer to a paper towel&ndash;lined plate to drain, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Chewy-Crisp Bacon:</strong> Tear off a 13- by 30-inch piece of aluminum foil and crimp it, accordion-style, into 1-inch sections. Stretch out foil and place it on a 13- by 18-inch rimmed baking sheet, folding up edges to catch drips. Arrange bacon strips on foil, overlapping as little as possible. Bake bacon for 10 minutes. Rotate pan and continue baking until bacon is as browned as you like it, 5 to 10 minutes longer for thin-cut, or 10 to 15 minutes longer for thick-cut. Remove bacon from oven, transfer to a paper towel&ndash;lined plate to drain, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Crisp, Flat Bacon for Sandwiches and Burgers:</strong> Line a 13- by 18-inch rimmed baking sheet with aluminum foil and top with a sheet of parchment paper. Arrange bacon strips on tray, overlapping as little as possible. Top with a second sheet of parchment paper; place a second baking sheet on top. Bake bacon until it's as crisp as you like it, 25 to 30 minutes for thin-cut, or 30 to 35 minutes for thick-cut. Remove trays from oven, carefully remove top tray using tongs and an oven mitt, transfer bacon to a paper towel&ndash;lined plate to drain, and serve.</p>"}]}