{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20160610-lofthouse-cookies-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "cookie", "frosting", "lofthouse", "sprinkle", "sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "10"}, "name": "Lofthouse-Style Frosted Sugar Cookies", "link": "https://www.seriouseats.com/recipes/2016/12/soft-frosted-sugar-cookies-homemade-lofthouse.html", "description": "These homemade Lofthouse-style cookies are so light and cake-like, it's not even fair to call them cookies. They're as puffy, soft, and sweet as a vanilla cupcake, with creamy frosting and rainbow sprinkles, too. Take care when scooping the soft batter, or else you'll wind up with cookies shaped like haphazard blobs. For best results, use a cookie scoop, scraped level against the side of the bowl.", "totalTime": "1 hour", "recipeYield": "Makes 24 (3-inch) cookies", "recipeCategory": ["Baking", "Christmas", "Cookies", "Desserts"], "recipeIngredient": ["<strong>For the Frosting:</strong>", "10 ounces powdered sugar (2 1/2 cups; 285g)", "1/4 teaspoon Diamond Crystal kosher salt; for table salt, use the same weight or half as much by volume", "2 1/2 ounces heavy cream (shy 1/3 cup; 70g)", "1 teaspoon (5ml) vanilla extract", "<strong>For the Cookie Dough:</strong>", "8 ounces unsalted butter (2 sticks; 225g), pliable but cool, about 60°F (16°C)", "7 ounces sugar (1 cup; 200g)", "2 teaspoons baking powder", "1 1/4 teaspoons (5g) Diamond Crystal kosher salt; for table salt, use the same weight or half as much by volume", "2 ounces egg white (1/4 cup; 55g), from about 2 large eggs", "1 ounce heavy cream (2 tablespoons; 30g)", "2 teaspoons (10ml) vanilla extract", "11 ounces bleached cake flour (2 3/4 cups; 310g), such as Swans Down (see note)", "Assorted food coloring, nonpareils, and sprinkles, for decorating (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Frosting:</strong> Combine powdered sugar, salt, cream, and vanilla in the bowl of a stand mixer fitted with a paddle attachment. Mix at low speed to moisten, then increase speed to medium and beat until creamy and soft, about 5 minutes. Using a spatula, scrape frosting into a small bowl, or as many bowls as you would like colors, and cover with plastic pressed directly against the surface. Set aside until needed, up to 24 hours at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Adjust oven rack to middle position and preheat to 350&deg;F (177&deg;C). Using the same bowl and paddle attachment used for frosting (no need to clean), combine butter, sugar, baking powder, and salt. Mix at low speed to moisten, then increase speed to medium and beat until fluffy, pale ivory, and soft, about 5 minutes. Meanwhile, whisk egg whites, cream, and vanilla in a glass measuring cup until homogeneous. With the mixer still running, add liquid mixture in 4 or 5 additions, pausing to scrape bowl and beater about halfway through. Decrease mixer to low speed, sprinkle in cake flour, and continue mixing to form a soft dough. Fold batter once or twice with a flexible spatula to make sure it's well mixed from the bottom up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a 2-tablespoon cookie scoop, divide dough into 24 level portions and carefully drop onto 2 parchment-lined aluminum half sheet pans, leaving 2 1/2 inches between each dough ball. If needed, pause to rinse scoop in hot water to ensure a clean release (misshapen scoops will spread into an irregular form). Bake until puffed and pale overall, but just barely golden around the very edges, about 15 minutes. Cool directly on sheet pans until no trace of warmth remains, about 15 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> If you like, tint frosting with a drop or two of gel paste. Working with one at a time, dollop a shy tablespoon of frosting (3/8 ounce; 10g) over each cookie, spread into an even layer with a palette knife or butter knife, and top with sprinkles, if desired. Repeat with remaining cookies and enjoy immediately. Let remaining cookies stand at room temperature until frosting forms a crust, then transfer to an airtight container with a sheet of wax paper between each layer. Store up to 3 days at room temperature.</p>"}]}