{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/10/20161009-gingerbread-house-dough-icing-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "gingerbread", "gingerbread house", "royal icing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sturdy Royal Icing for Gingerbread Houses", "link": "https://www.seriouseats.com/recipes/2016/10/sturdy-royal-icing-gingerbread-house-recipe.html", "description": "There are a lot of different types of royal icing out there, but if you're building and decorating a gingerbread house, you'll want one that's relatively low in moisture. That ensures it will dry out fast, which will keep your designs from smudging and your walls from budging (if you'll pardon the rhyme).", "totalTime": "5 minutes", "recipeYield": "Makes 2 cups", "recipeCategory": ["No-Cook", "Quick and Easy", "Seasonal and Holiday"], "recipeIngredient": ["1 ounce egg white (2 tablespoons; 28g) from 1 large egg", "12 ounces powdered sugar (3 cups; 340g), divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with a paddle attachment, combine egg white with <em>half</em> the powdered sugar. Mix at low speed until sugar disappears into a paste, then gradually sprinkle in the rest. Increase speed to medium and beat until smooth and light, about 2 minutes. If too stiff, thin icing with a few drops of water. Use immediately; keep covered tightly in plastic to prevent icing from drying in bowl. Royal icing can be kept in an airtight container at room temperature up to 12 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Coloring:</strong> To dye royal icing with gel paste (see note), divide into as many bowls as you wish to have colors. Cover each tightly with plastic. Working with 1 bowl at a time, add 1 drop gel paste to a batch of icing, then stir until fully incorporated before adjusting color with more gel. Cover bowls tightly when not in use.</p>"}]}