{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/05/20160424-star-crunch-no-bake-cookies-vicky-wasik-12.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["candy", "caramel", "chocolate", "cookie", "little debbie", "no bake", "rice krispie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "10"}, "name": "Homemade Star Crunch", "link": "https://www.seriouseats.com/recipes/2016/05/copycat-star-crunch-no-bake-cookie-recipe.html", "description": "With gooey homemade caramel, creamy milk chocolate, and crunchy rice, these no-bake cookies are as satisfying as a candy bar, but way easier to make. Just boil up sugar water until it turns thick and golden, then add some chilled cream and simmer a few minutes more. Once it's cool, stir in chopped milk chocolate and some Rice Krispies, and you're done! The hardest part is simply waiting for the molten \"batter\" to set.", "totalTime": "About 2 hours", "recipeYield": "Makes 15 cookies", "recipeCategory": ["Candy", "Chocolate", "Christmas", "Cookies", "Desserts", "No-Cook"], "recipeIngredient": ["4 ounces water (1/2 cup; 115g)", "7 ounces sugar (1 cup; 200g)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; other salts may contain additives that induce crystallization", "10 ounces heavy cream (1 1/4 cup; 280g), straight from the fridge", "3 ounces milk chocolate, minimum 26% cocoa butter (2/3 cup; 85g), very finely chopped (see note)", "1 1/2 ounces Rice Krispies (1 1/2 cups; 45g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine water, sugar, and salt in a 3-quart stainless steel saucier over medium-high heat. Stir occasionally with a fork until sugar dissolves and syrup is bubbling hard, about 2 minutes. Stop stirring and simmer until syrup turns pale gold, like clover honey, roughly 8 minutes. Meanwhile, measure out cream so it will be ready to add at a moment's notice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When syrup turns pale gold, add cream and reduce heat to medium-low. Cook, stirring constantly with a heat-resistant spatula, until the foam subsides and the boiling caramel seems more molten than foamy, about 6 minutes. Clip-on a digital thermometer and continue cooking, stirring occasionally, until caramel registers 245&deg;F, about 5 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately transfer caramel to a heat-resistant bowl and allow to cool until it registers 140&deg;F on a digital thermometer, about 40 minutes. Stir in milk chocolate until fully melted, then fold in rice. Divide into about 15 one-ounce (2-tablespoon) portions and arrange on a parchment-lined half sheet pan or cutting board, then flatten into disks with the palm of your hand. Let stand at room temperature until fully set, about 1 hour, and transfer to an airtight container with a sheet of parchment between each layer. Star Crunch will keep up to a week at room temperature, or a month if refrigerated.<br />\r\n</p>"}]}