{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/11/20161103-hard-dinner-rolls-vicky-wasik-21.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "bread", "dinner roll", "french roll", "hard roll", "roll", "yeast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7777777777778", "ratingCount": "9"}, "name": "The Best Dinner Rolls (Fluffy, Crusty, and Chewy)", "link": "https://www.seriouseats.com/recipes/2016/11/crusty-dinner-rolls-recipe.html", "description": "These aren't exactly classic French rolls, but I'm positive their crackly crust and fluffy interiors will win you over. The trick is something I pulled straight from the bagel playbook&mdash;boiling the dough to create a moist skin that bakes up glossy and crisp. The result is simple hard rolls that are perfect for mopping up gravy, dunking in soup, or sandwiching around thick slices of your favorite cheese.", "totalTime": "Up to 15 hours", "recipeYield": "Makes 12 (2-ounce) rolls", "recipeCategory": ["Baking", "Christmas", "Rolls", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["<strong>For the Yukone:</strong>", "6 ounces cold water (3/4 cup; 170g)", "2 1/2 ounces bread flour (1/2 cup; 70g) ", "<strong>For the Dough:</strong>", "13 3/4 ounces bread flour (2 3/4 cups; 380g)", "1/2 ounce sugar (1 tablespoon; 15g)", "2 1/2 teaspoons (9g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1 1/2 teaspoons (6g) instant dry yeast, such as <dorado id=\"instant-yeast\" class=\"text\">SAF</dorado>; not RapidRise or active dry (more info <a href=\"https://www.seriouseats.com/2018/03/all-about-dry-yeast-instant-active-dry-fast-acting-and-more.html\">here</a>)", "6 ounces cold water (3/4 cup; 170g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Yukone:</strong> In a 2-quart stainless steel saucier or 10-inch skillet, combine water and flour. Cook over medium heat, whisking constantly, until mixture comes together in a thick, mashed potato&ndash;like paste, about 2 minutes. Scrape onto a plate, spread into a 1-inch layer, and cool until no warmer than 100&deg;F (38&deg;C), about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Pulse flour, sugar, salt, and yeast in a food processor fitted with a metal blade. Once combined, add cooled yukone and water. Process until dough is smooth, about 90 seconds. Transfer to a lightly greased bowl (the dough will be slightly warm and incredibly sticky), cover with plastic, and refrigerate until roughly doubled in bulk, between 60 and 90 minutes depending on temperature of yukone. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough onto a clean, un-floured surface, but do not deflate. Cut into 12 roughly equal portions (2 1/4 ounces or 60g each), cupping each beneath your palm and working in quick circular motions to form a smooth ball. Arrange on a parchment-lined half sheet pan, cover with plastic, and refrigerate overnight until puffy and soft, between 8 and 10 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Adjust oven rack to lower-middle position and preheat to 400&deg;F (204&deg;C). Fill a deep pot with about 3 inches of water and bring to a boil over high heat. Meanwhile, line a baking sheet or cutting board with a thick layer of paper towels. Cut parchment between each roll with a pair of scissors. Working with 4 dough pieces at a time, use parchment to lift and drop rolls into boiling water so that they are upside down. Boil exactly 60 seconds, then flip right side up with a slotted spoon (so the bottoms can skin over) and transfer to paper towels. (Along the way, the parchment squares can be gently tugged free or allowed to slip off on their own.) Arrange rolls on a parchment-lined half sheet pan; these can be baked immediately or left at room temperature up to 4 hours. Bake until blistered and golden brown all over, about 35 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rolls can be served immediately or held at room temperature for up to 6 hours. Reheat in a hot oven for 5 to 10 minutes before serving if rolls have cooled and you prefer them hot.</p>"}]}