{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160710-vegetable-tortilla-steps.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "cheese", "egg", "frittata", "ham", "omelette", "spanish tortilla", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Flipped Frittata With Asparagus, Spinach, Ham, and Cheese", "link": "https://www.seriouseats.com/recipes/2016/07/flipped-frittata-egg-spanish-tortilla-asparagus-ham-spinach-cheese.html", "description": "On a hot summer night, you might not want to turn on your oven or broiler. But you can still make this vegetable-packed frittata: Just flip it like a Spanish tortilla. Compared to a normal finished-in-the-oven frittata which can take on a poofy, souffléd texture, flipping produces a much creamier, denser omelette. It's a texture I actually prefer.", "totalTime": "20 minutes", "recipeYield": "Serves 3 to 4", "recipeCategory": ["Asparagus", "Breakfast and Brunch", "Cheese", "Easter", "Ham", "Mains", "Omelettes", "Quick Dinners", "Spinach"], "recipeIngredient": ["6 eggs", "Kosher salt and freshly ground black pepper", "4 tablespoons extra-virgin olive oil, divided (60ml)", "4 stalks asparagus, sliced on a bias into 1-inch pieces", "6 shishito peppers or one green bell pepper, diced", "3 medium cloves garlic, sliced", "1/2 medium red onion, sliced (about 4 ounces; 120g)", "1 cup packed spinach leaves, roughly chopped (about 2 ounces; 55g)", "3 ounces sliced ham, cut into 1/2-inch pieces (90g) (optional)", "4 ounces medium-firm cheese such as cheddar or Jack, cut into 1/2-inch cubes (120g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly beat eggs with a large pinch of salt and a few grinds of black pepper in a large bowl. Set aside. Heat 1 tablespoon (15ml) olive oil in a 10-inch non-stick, cast iron, or carbon steel skillet over medium-high heat until shimmering. Add asparagus and peppers, season with salt and pepper, and cook, tossing and stirring frequently, until asparagus is tender-crisp, about 2 minutes. Transfer to the bowl with the eggs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon (15ml) oil in the now-empty skillet over medium-high heat until shimmering. Add onions and cook, stirring, until starting to brown around the edges, about 2 minutes. Add garlic and cook, stirring, until onions and garlic are lightly browned, about 1 minute longer. Add spinach and cook, stirring, until wilted, about 1 minutes. Transfer to the bowl with the eggs. Add ham (if using) and cheese to the eggs and stir the mixture until everything is evenly combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out skillet. Add remaining 2 tablespoons (30ml) oil to skillet and set over medium-high heat until shimmering. Scrape egg mixture into skillet and cook, swirling and shaking pan rapidly, until bottom and sides begin to set, about 3 minutes. Using a heatproof spatula, press the edges in to begin to form the frittata's puck shape. Continue to cook, adjusting heat to prevent bottom of frittata from burning, until beginning to set around edges, about 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working over a sink or garbage can, place a large overturned flat plate or lid on top of skillet, set hand on top (using a dish towel if you are sensitive to heat), and, in one very quick motion, invert frittata onto it. Carefully slide frittata back into skillet and continue to cook until second side is beginning to firm up, about 2 minutes. Use rubber spatula to again press the sides in all around to form a rounded puck shape. Continue to cook frittata until lightly browned on second side but still tender in the center when pressed with a finger, about 2 minutes longer. If desired, you can flip frittata 2 to 3 more times during these last minutes of cooking, which helps to cook the center more evenly and reinforce the shape.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully slide frittata out of skillet onto a clean plate, and serve.</p>"}]}