{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160606-yakitori-negima-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["Japanese", "mushroom", "skewer", "yakitori"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled King Oyster Mushrooms With Bacon and Teriyaki Glaze", "link": "https://www.seriouseats.com/recipes/2016/06/grilled-king-oyster-mushrooms-bacon-teriyaki-glaze-recipe.html", "description": "Mushrooms are often skewered whole and gently grilled in yakitori restaurants, but I decided to see if I could up the flavor factor by alternately skewering slices of king oyster mushroom and slices of bacon, stacking the slices of mushroom on the skewers so that they ended up reassembling themselves. As the bacon crisps up, it renders its juices, which are subsequently absorbed into the juice-hungry mushrooms.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Bacon", "Japanese", "Mushrooms", "Sides"], "recipeIngredient": ["1 pound (500g) king oyster mushrooms ", "12 ounces (340g) bacon, cut into 1-inch pieces", "Kosher salt and freshly ground black pepper", "1/4 cup (60ml) <a href=\"http://www.seriouseats.com/recipes/2012/03/teriyaki-sauce-how-to-make-at-home-recipe.html\">teriyaki sauce</a> (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut mushrooms into 1-inch lengths, keeping the pieces next to each other so that you can reconstruct the mushrooms on a skewer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thread mushroom pieces onto metal or wooden skewers, alternating mushrooms with 1 to 2 pieces of bacon. When threaded, mushrooms should be reconstructions of themselves, with bacon in between each section. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 2/3 chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium-high heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place mushrooms directly over hot side of grill and cook, turning frequently and sprinkling with salt and pepper 2 to 3 times during grilling, until mushrooms are fully tender and browned on the exterior and bacon is crisp, about 15 minutes total. Brush mushrooms with teriyaki glaze and cook for 30 seconds. Turn and brush second side with teriyaki and cook for 30 seconds longer. Remove from grill and allow to rest for 1 to 2 minutes. Brush with additional glaze and serve immediately.</p>"}]}