{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160630-pork-tenderloin-sous-vide-5-doneness-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "low carb", "pork", "pork tenderloin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Sous Vide Pork Tenderloin", "link": "https://www.seriouseats.com/recipes/2016/07/sous-vide-pork-tenderloin-recipe.html", "description": "Small enough to cook relatively quickly, but large and elegant enough to make a centerpiece roast, pork tenderloin is the kind of dish to pull out when you're feeling extra fancy on a weeknight. Sous vide is the most foolproof way to get it on the table with consistently great flavor and a buttery, ultra-tender texture.", "totalTime": "1 1/2 to 4 1/2 hours", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Mains", "Pork", "Sous Vide", "The Food Lab"], "recipeIngredient": ["1 whole pork tenderloin, about 1 pound (450g)", "Kosher salt and freshly ground black pepper", "6 to 8 sprigs fresh herbs, such as fresh thyme, oregano, or rosemary, divided (optional)", "2 garlic cloves, divided (optional)", "2 small shallots, sliced, divided (optional)", "1 tablespoon (15ml) vegetable, canola, or rice bran oil", "1 tablespoon (15g) unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sous vide precision cooker, preheat a water bath to the desired finishing temperature according to the chart below.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season pork generously with salt and pepper. Place in sous vide bags along with half of herbs, garlic, and shallots (if using) and distribute evenly. Seal bags and place in water bath for time recommended in chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Turn on your vents and open your windows. Remove pork from water bath and bag. Discard aromatics from bag; reserve liquid from bag if making optional pan sauce (see note). Carefully pat pork dry with paper towels. Add vegetable, canola, or rice bran oil to a heavy cast iron or stainless steel skillet, place it over the hottest burner you have, and preheat skillet until it starts to very lightly smoke. Lay pork in skillet, using your fingers or a set of tongs. Cook, turning occasionally, until browned on most sides, about 2 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When pork is mostly browned, add butter and reserved half of garlic, shallots, and herbs (if using) and cook, tilting pan and using a spoon to baste pork with the flavorful butter, until pork is well browned on all sides, about 30 seconds longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pork to a rack set in a rimmed baking sheet and pour the drippings on top. Allow to rest for 1 to 2 minutes, then slice and serve.</p>"}]}