{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/07/20170705-julep-variations-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["cocktail", "julep", "mint", "rum", "spring", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dark and Stormy Julep Cocktail (With Ginger and Rum)", "link": "https://www.seriouseats.com/recipes/2017/07/dark-and-stormy-julep-cocktail-ginger-rum-recipe.html", "description": "A Dark and Stormy is made with Gosling's rum, ginger beer, and lime, so the idea here is to loosely play with those flavors in the format of a mint julep. The result has the rich, round, sweet base flavors of rum and maple syrup, the freshness of the mint, and then that zesty spiciness of ginger, which wakes the whole thing up and pulls the sweetness into focus.", "totalTime": "5 minutes", "recipeYield": "Makes 1 cocktail", "recipeCategory": ["Ginger", "July 4th", "Labor Day", "Memorial Day", "Rum", "Spring", "Summer"], "recipeIngredient": ["2 thin, quarter-size rounds peeled fresh ginger (about 1/8 ounce; 3g), see note", "10 mint leaves, plus a generous bouquet of mint sprigs for garnish", "1 teaspoon (5ml) maple syrup ", "2 ounces (60ml) aged rum ", "Crushed or shaved ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a julep cup or large rocks glass, muddle ginger until it is well crushed and juices are expressed. Add mint leaves and maple syrup and muddle until mint is lightly bruised, then swab the glass's sides with the mint's aromatic oils. Add rum and stir well. Half-fill glass with crushed ice and stir to combine. Fill glass completely with crushed ice and stir until outside of glass frosts. Add more crushed ice, heaping generously, then garnish with sprigs of fresh mint. Serve, adding a short straw if desired so that the fragrance of the mint bouquet will greet the drinker with each sip.</p>"}]}