{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160330-vegan-saag-paneer-tofu-composite-01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Indian", "keywords": ["Indian", "saag paneer", "spinach", "tofu", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "7"}, "name": "Creamy Vegan Saag Paneer (With Tofu)", "link": "https://www.seriouseats.com/recipes/2017/03/creamy-vegan-saag-paneer-tofu-recipe.html", "description": "The wonderful thing about <em>saag paneer</em>&mdash;the Indian staple of greens and fresh cheese in a creamy sauce&mdash;is that, in my experience, it's almost universally loved by vegetarians and meat-eaters alike. But what if we wanted to make a completely dairy-free version, so that vegetarians, meat-eaters, <em>and</em> vegans can all enjoy a meal together? This recipe recruits the power of cauliflower, a variety of greens, and marinated tofu to do just that.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cauliflower", "Dairy-Free", "Indian", "Mains", "Mother's Day", "Other Vegetables", "Quick Dinners", "Sides", "Soups and Stews", "Spinach", "Stovetop", "Tofu", "Valentine's Day", "Vegan", "Vegetarian"], "recipeIngredient": ["12 ounces (350g) extra-firm tofu ", "1 tablespoon (15g) yellow miso paste", "3 tablespoons (45ml) lemon juice, divided, plus 1 tablespoon (5g) zest, from 2 to 3 lemons", "3 tablespoons (45ml) vegetable oil, divided", "Kosher salt and freshly ground black pepper", "6 ounces almond, soy, rice, or cashew milk (2/3 cup; 170ml)", "6 ounces cauliflower florets or peeled sunchokes (170g; about 1/3 of a small head of cauliflower)", "4 medium cloves garlic (about 20g), finely minced", "1 (1-inch) knob ginger (about 20g), peeled and finely minced", "1 to 4 green or red Thai chilies (depending on your heat preference), stemmed and finely minced", "1 teaspoon ground coriander seed", "1 teaspoon ground cumin seed", "1 teaspoon ground turmeric", "1 cardamom pod, smashed", "8 ounces (225g) mature spinach, curly if available (see note)", "8 ounces (225g) arugula or mustard greens, tough mustard green stems removed and discarded (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tofu \"Paneer\":</strong> Adjust oven rack to center position and preheat oven to 375&deg;F (190&deg;C). Press tofu firmly between paper towels to remove excess moisture. Cut into 1 1/2&ndash;inch cubes and set aside. In a medium bowl, whisk together miso paste, 2 tablespoons (30ml) lemon juice, lemon zest, and 1 tablespoon (15ml) oil. Season generously with salt and pepper. Add tofu and toss to coat. Spread tofu evenly over a foil-lined rimmed baking sheet. Place in oven and bake until golden brown, about 20 minutes. Sauce may darken a little against the foil; this is fine. Set tofu aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Cauliflower Purée:</strong> Combine nut milk and cauliflower in a small saucepan. Season with salt and bring to a simmer. Cook until cauliflower is tender, about 10 minutes. Purée mixture using a hand blender or countertop blender. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Spinach:</strong> Heat remaining 2 tablespoons (30ml) vegetable oil in a large saucepan or saucier over medium heat until shimmering. Add garlic, ginger, and chilies and cook, stirring, until fragrant and lightly browned, about 1 minute. Add coriander, cumin, turmeric, and cardamom pod and cook, stirring, until fragrant, about 30 seconds. Add spinach and arugula or mustard greens one handful at a time, stirring and adding more as the greens wilt (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reduce heat to low and cook, stirring occasionally, until greens are fully wilted, about 5 minutes. Stir in cauliflower purée and continue to cook until greens are very tender, about 5 minutes longer. Stir in tofu cubes and heat through. Stir in remaining lemon juice, season with salt, adjust consistency with a little water if necessary, and serve.</p>"}]}