{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/09/20170729-cookies-and-cream-cookies-vicky-wasik-21.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "baking", "BraveTart", "chocolate", "coconut oil", "cookie", "dessert", "Oreo"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "BraveTart's Cookies 'n' Cream Cookies", "link": "https://www.seriouseats.com/recipes/2017/10/cookies-and-cream-cookies-recipe.html", "description": "Chocolaty chunks of crunchy Oreo bits turn these soft and chewy vanilla cookies into a fresh-baked version of cookies 'n' cream.", "totalTime": "1 hour", "recipeYield": "Makes 26 (3 1/2–inch) cookies", "recipeCategory": ["Baking", "Chocolate", "Christmas", "Cookies"], "recipeIngredient": ["4 ounces unsalted butter (8 tablespoons; 115g), pliable but cool (about 60°F; 16°C) ", "3 1/2 ounces refined or virgin coconut oil (about 1/2 cup; 100g), solid but creamy (about 70°F; 21°C); see note", "10 1/2 ounces sugar (about 1 1/2 cups; 295g) ", "1 1/4 teaspoons (5g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1 teaspoon baking powder", "1/2 ounce vanilla extract (1 tablespoon; 15g)", "1 large egg, straight from the fridge", "10 1/2 ounces all-purpose flour, such as Gold Medal (about 2 1/3 cups, spooned; 295g)", "8 ounces Oreos, store-bought or <a href=\"http://www.seriouseats.com/2017/08/how-to-make-oreo-style-cookies-from-scratch.html\">homemade</a> (about 20 sandwich cookies; 225g), chopped and frozen until cold"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Dough:</strong> Adjust oven rack to middle position and preheat to 350&deg;F (180&deg;C). Combine butter, coconut oil, sugar, salt, baking powder, and vanilla in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then increase to medium and beat until light and fluffy, about 5 minutes, pausing to scrape bowl with a flexible spatula halfway through. With mixer running, add egg and continue beating until smooth. Reduce speed to low, add flour, and mix to form a stiff dough, then add frozen cookie pieces and continue mixing until well combined.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Portion the Dough:</strong> With a scoop, divide dough into 2-tablespoon portions. With your hands, roll each piece smooth and round. (If you like, portioned dough can be refrigerated in a heavy-duty zipper-lock bag up to 1 week, or frozen 6 months. Stand at room temperature until quite soft, about 70&deg;F/21&deg;C, and proceed as directed.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Bake the Dough:</strong> Arrange portions on a parchment-lined half sheet pan, leaving 2 inches between cookies to account for spread. With the palm of your hand, flatten each into a 1/2-inch disk; if you like, garnish with extra Oreo crumbs. Bake until puffed and firm around the edges, and pale overall but with a hint of browning around the very edges, about 12 minutes. Cool directly on baking sheet until crumb is set, about 5 minutes. Enjoy warm or store in an airtight container up to 3 days at room temperature.</p>"}]}