{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/08/20170627-strawberry-cake-vicky-wasik-23.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "birthday", "cake", "cake flour", "dessert", "freeze dried", "fruit", "layer cake", "party", "strawberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9333333333333", "ratingCount": "15"}, "name": "Double-Strawberry Cake", "link": "https://www.seriouseats.com/recipes/2017/08/strawberry-cake-recipe.html", "description": "A double whammy of fresh strawberry purée and freeze-dried strawberries gives this pale-pink layer cake an all-natural flavor and color, without interfering with its light and fluffy crumb.", "totalTime": "3 hours", "recipeYield": "Serves 15", "recipeCategory": ["Baking", "Cakes", "Easter", "Father's Day", "Fruit Desserts", "Mother's Day", "Strawberry", "Summer", "Valentine's Day"], "recipeIngredient": ["16 1/2 ounces bleached cake flour (3 2/3 cups, spooned; 470g), such as <a href=\"https://www.amazon.com/Swans-Down-Cake-Flour-32oz/dp/B00D1RPES2/?tag=serieats-20\">Swans Down</a> (see note)", "2 1/4 ounces freeze-dried strawberries (about 3 heaping cups; 65g), such as <a href=\"https://www.amazon.com/Trader-Joes-Strawberries-Unsweetened-Unsulfured/dp/B00BIBO19G/?tag=serieats-20\">Trader Joe's</a> (see note)", "18 ounces hulled strawberries (about 3 1/2 cups quartered fruit; 510g), brought to about 70°F (21°C); see note", "12 ounces unsalted butter (about 3 sticks; 340g), soft but cool, about 65°F (18°C)", "15 3/4 ounces sugar (about 2 1/4 cups; 445g)", "3 1/4 teaspoons baking powder", "3/4 teaspoon baking soda", "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon Chinese five-spice powder", "6 ounces egg whites (about 2/3 cup; 170g), from about 5 large eggs, brought to about 70°F (21°C)", "<strong>To Serve:</strong>", "1 batch <a href=\"https://www.seriouseats.com/recipes/2017/05/swiss-meringue-buttercream-frosting-recipe.html\">Swiss Buttercream</a>, a triple batch of <a href=\"https://www.seriouseats.com/recipes/2016/08/super-thick-fruity-whipped-cream-recipe.html\">strawberry whipped cream</a>, or a triple batch of <a href=\"https://www.seriouseats.com/recipes/2017/08/cream-cheese-frosting-recipe.html\">Cream Cheese Frosting</a> ", "Additional <a href=\"https://www.amazon.com/Trader-Joes-Strawberries-Unsweetened-Unsulfured/dp/B00BIBO19G/?tag=serieats-20\">freeze-dried strawberries</a>, to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Prepare:</strong> Combine cake flour and freeze-dried strawberries in a <a href=\"https://www.seriouseats.com/2017/10/best-food-processor-equipment-review.html\">food processor</a> and grind to form a powdery, pale pink flour with no visible pieces of fruit. Purée fresh strawberries with an <a href=\"https://www.seriouseats.com/2017/11/best-immersion-blenders.html\">immersion blender</a>, food processor, or <a href=\"https://www.seriouseats.com/2018/04/the-best-blender-for-you-expensive-vs-budget-buys-tested.html\">countertop blender</a> until perfectly smooth; bring to about 70&deg;F (21&deg;C) before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). Lightly grease 3 eight-inch anodized-aluminum cake pans and <a href=\"https://www.seriouseats.com/2017/06/how-to-cut-a-parchment-round.html\">line with parchment</a>. If you don’t have 3 pans, it’s okay to bake the cakes in stages, as the batter will keep at room temperature until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Cake:</strong> In the bowl of a stand mixer fitted with the paddle attachment, combine butter, sugar, baking powder, baking soda, salt, and Chinese five-spice powder. Mix on low speed to roughly incorporate, then increase to medium and beat until fluffy and light, about 5 minutes. About halfway through, pause to scrape bowl and beater with a flexible spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With mixer still running, add egg whites a little at a time, letting each addition fully incorporate before proceeding to the next. Scrape bowl and beater with flexible spatula, then resume mixing on low. Sprinkle in about one-third of strawberry flour, then drizzle in one-third of strawberry purée. Repeat with remaining flour and fruit, working in thirds as before.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape bowl and beater with flexible spatula and resume mixing on medium speed for about 3 seconds to ensure everything is well combined. The batter should look creamy and thick, registering between 65 and 68&deg;F (18 and 20&deg;C) on a digital thermometer. (Significant deviation indicates ingredients were too warm or too cold, which can lead to textural problems with the cake.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold batter once or twice from the bottom up, using a flexible spatula, until the color is completely homogeneous, then divide evenly between prepared cake pans (about 23 ounces/655g each if you have a scale). Stagger pans together on oven rack and bake until puffed and firm, about 30 minutes or to an internal temperature of 200&deg;F (93&deg;C). If your oven has very uneven heat, pause to rotate pans after about 20 minutes. Alternatively, bake 2 layers at once and finish the third when they’re done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool cakes directly in their pans for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off parchment, and return cakes right side up. (Covered in plastic, the cakes can be left at room temperature for a few hours.) Meanwhile, prepare your frosting of choice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crumb Coat:</strong> Level cakes with a serrated knife (full instructions <a href=\"http://www.seriouseats.com/2017/05/how-to-level-a-cake.html\">here</a>) and set the scraps aside for snacking. Place 1 layer on a heavy cast iron turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with exactly 1 cup frosting, using an offset spatula to spread it evenly from edge to edge. Repeat with the second and third layers, then cover sides of cake with another cup of frosting, spreading it as smoothly as you can (tutorial <a href=\"http://www.seriouseats.com/2017/05/how-to-crumb-coat-cake.html\">here</a>). Refrigerate cake until frosting is firm, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Decorate chilled cake with remaining frosting (excess can be paired with scraps for a snack), then let cake stand at room temperature until about 70&deg;F to serve. Immediately before slicing, garnish with crushed freeze-dried strawberries. Cut into wedges with a chef’s knife to serve. Cover exposed cake with extra frosting to keep leftovers moist. The cake will keep about 24 hours at room temperature. Wrapped in plastic, it can be refrigerated up to 5 days; return to room temperature to serve.</p>"}]}