{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/08/20170808-preservation-acid-pickling-vicky-wasik-12.jpg", "author": {"@type": "Person", "name": "Christina Ward"}, "recipeCuisine": "", "keywords": ["brine", "cucumber", "pickle", "preservation", "vinegar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Milwaukee Dill Refrigerator Pickles", "link": "https://www.seriouseats.com/recipes/2017/08/milwaukee-dill-pickles-cucmber-recipe.html", "description": "These classic Milwaukee-style refrigerator pickles are flavored with layers upon layers of spice along with dill, garlic, and onion. Feel free to adjust the spice blend and aromatics to suite your own tastes. Don't like onion or garlic? Don't add them.", "totalTime": "30 minutes plus 3 weeks pickling time", "recipeYield": "Makes two 1-quart jars", "recipeCategory": ["Cucumber", "Pickling", "Snacks", "Stovetop", "Summer", "Vegetarian"], "recipeIngredient": ["<strong>For the Cold-Water Soak:</strong>", "About 25 small \"number one\" cucumbers (about 2 pounds/1kg; see note)", "1 cup <a href=\"https://www.amazon.com/Ball-Pickling-Salt-Jarden-Brands/dp/B002YI20NG/?tag=serieats-20\">pickling</a> or other pure salt (about 8 3/4 ounces/250g; see note)", "<strong>For the Pickling Spice Mix and Brine:</strong>", "4 tablespoons whole mustard seed, divided", "1 tablespoon whole allspice", "1 tablespoon whole juniper berries", "1 tablespoon ground turmeric", "2 teaspoons coriander seeds", "5 whole cloves", "1 teaspoon ground ginger", "2 bay leaves, crushed", "1 small (2-inch) cinnamon stick, broken into pieces", "1 whole star anise, broken into pieces (optional)", "1 1/2 cups distilled white vinegar at 5% acidity (355ml)", "2 tablespoons <a href=\"https://www.amazon.com/Ball-Pickling-Salt-Jarden-Brands/dp/B002YI20NG/?tag=serieats-20\">pickling</a> or other pure salt (about 1 ounce/30g; see note)", "1 tablespoon sugar (optional)", "1/4 cup thinly sliced white onion (from about 1/4 medium onion)", "4 medium cloves garlic", "2 large tufts dill weed, flowers removed and reserved, or baby dill (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cold-Water Soak:</strong> In a large bowl, combine 1 gallon (4 liters) cold water with the 1 cup salt, stirring to dissolve the salt. Meanwhile, wash cucumbers, then trim off the flower-end (opposite of the stem) using a paring knife. Place cucumbers in cold saltwater bath. Let stand while you prepare the brine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Pickling Spice Mix and Brine:</strong> In a small bowl, stir together 2 tablespoons mustard seed with the allspice, juniper, turmeric, coriander, cloves, ground ginger, bay leaves, cinnamon, and star anise, if using. Measure out 1 tablespoon pickling spice blend and wrap in a either a cheesecloth sachet or metal tea strainer. Reserve remaining pickling spice for a future batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium stainless-steel saucepan, combine vinegar with 2 cups (475ml) water, the 2 tablespoons salt, and sugar, if using (sugar rounds out the sharp vinegar flavor, but is optional and a matter of personal preference). Add spice-mix sachet and set over medium heat, cover, and bring to about 115&degF (46&deg;F) (just warm enough to dissolve the salt and sugar and infuse the brine with spice flavor). Remove from heat and let stand 15 minutes, then remove and discard spice sachet. Let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash 2 (1-quart) glass canning jars with warm soapy water and rinse well. Divide the sliced onion, garlic, dill, and remaining 2 tablespoons mustard seed between the two jars, pressing firmly into the bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain cucumbers. Pack each jar with cucumbers, making sure the cucumbers do not rise above the shoulder of the jar (the curve just under the opening). Pickles should be packed firmly enough that the don't move around at all when the jar is shaken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour cooled brine into each jar, making sure cucumbers are completely covered by the brine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Close jars and transfer to refrigerator. Pickles will be ready after 3 weeks, and will keep refrigerated for up to 2 months.</p>"}]}