{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161204-sous-vide-shrimp-22.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["seafood", "shellfish", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2", "ratingCount": "5"}, "name": "Sous Vide Poached Shrimp", "link": "https://www.seriouseats.com/recipes/2017/01/sous-vide-poached-shrimp.html", "description": "Shrimp cooked through traditional methods can be fantastic but nailing the perfect temperature can be a bit hit or miss. With a sous vide cooker, you don't have this issue because that short window of time between perfect and overcooked stretches out to a good half hour or so. Sous vide also allows you to achieve textures that you can't really achieve through more traditional methods and affords you the opportunity to infuse the shrimp with flavor while they cook.", "totalTime": "25 minutes to 1 hour 10 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Mains", "Shrimp", "Sous Vide", "The Food Lab"], "recipeIngredient": ["1 1/2 pounds large peeled shrimp (about 700g)(see note)", "Kosher salt", "1/2 teaspoon baking soda", "Extra virgin olive oil or butter (optional)", "Aromatics such as garlic, shallots, tarragon, or parsley (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set your sous vide water bath to desired temperature according to the chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss shrimp with 1/2 teaspoon kosher salt and the baking soda. Place shrimp in a heavy duty zipper-lock bag or a vacuum bag. If desired, add 1 to 2 tablespoons (15 to 30ml) olive oil or butter and aromatics. Remove all air from bag using the <a href=\"http://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">water displacement method</a> or a vacuum sealer. Press shrimp into a single layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bagged shrimp to preheated water bath and cook for at least 15 minutes and up to 1 hour (the texture should show very little variation within this time frame). Remove shrimp from bag to a paper towel-lined plates. Serve hot, or chill and serve cold.</p>"}]}