{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/03/20170327-deviled-eggs-canal-house-11.jpg", "author": {"@type": "Person", "name": "Canal House"}, "recipeCuisine": "", "keywords": ["appetizer", "canal house", "deviled egg", "egg", "entertaining", "hors d'oeuvre", "snack", "spring", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Choose-Your-Own-Adventure Deviled Eggs", "link": "https://www.seriouseats.com/recipes/2017/03/canal-house-deviled-eggs-asparagus-caviar-olive-recipe.html", "description": "Great deviled eggs stand on their own without garnishes, but embellishing the tops is half the fun. Here's a master recipe for deviled eggs with filling that's fluffy and light, plus some ideas for toppings&mdash;though you'll undoubtedly come up with your own, too.", "totalTime": "30 minutes", "recipeYield": "Makes 24 deviled eggs", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Deviled Eggs", "Gluten-Free", "Snacks", "Spring", "Stovetop", "Vegetarian"], "recipeIngredient": ["12 large eggs", "1/2 cup (120ml) mayonnaise ", "2 to 3 tablespoons (30 to 45ml) sour cream ", "2 teaspoons (10ml) Dijon mustard ", "Kosher salt and freshly ground black pepper", "Optional garnishes: salmon roe and fresh dill sprigs; anchovy-stuffed olives and minced fresh chives; diced ham, Major Grey's–style mango chutney, and thinly sliced scallions; blanched asparagus tips, minced preserved lemon rind, and minced fresh chives (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a gentle boil (a vigorous boil could crack the eggs) and prepare an ice water bath in a large mixing bowl. Using a large spoon, carefully lower eggs into boiling water and cook, maintaining a gentle boil, for 12 minutes. Drain eggs, then transfer to ice bath to chill. Unpeeled boiled eggs can be stored in a sealed container in the refrigerator for up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to make deviled eggs, crack hard-boiled eggs all over and peel, starting from wider end (where the air sac is). Peeling under cold running water can help get stubborn shell off. Blot peeled eggs dry on clean paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve boiled eggs lengthwise. Pop egg yolks out from whites into the bowl of a food processor. Arrange whites on a paper towel&ndash;lined baking sheet, cut side down, and cover with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add mayonnaise, 2 tablespoons (30ml) sour cream, and mustard to egg yolks. Purée until very smooth. Season with salt and pepper; add 1 more tablespoon (15ml) sour cream if you want a lighter, slightly tangier filling. Transfer filling to a small bowl and press plastic wrap directly against the surface until you are ready to fill the eggs. (Instead of using a food processor, you can also press cooked yolks through a fine-mesh strainer, using a wooden spoon or rubber spatula, then fold in mayonnaise, sour cream, mustard, and seasonings.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a small spoon, scoop up a dollop of filling, then use a second small spoon to push it into an egg white half. Continue with remaining egg white halves and filling until all are complete. Garnish as desired, then serve.</p>"}]}