{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/01/SEAFOODSTUFFEDSHELLS.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["baked pasta", "crab", "pasta", "scallop", "seafood", "shellfish", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Seafood-Stuffed Shells", "link": "https://www.seriouseats.com/recipes/2017/01/seafood-stuffed-shells-crab-shrimp-scallops-recipe.html", "description": "These rich stuffed shells are packed with a mixture of crabmeat, shrimp, and scallops, then baked with a creamy sauce and golden, buttery bread crumbs. It's like a crab cake stuffed into pasta.", "totalTime": "1 hour 20 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Baking", "Lobster and Crab", "Mains", "Other Seafood", "Pasta", "Shrimp"], "recipeIngredient": ["Kosher salt", "6 ounces dry jumbo pasta shells (about 25 shells; 170g) (see note)", "Extra-virgin olive oil, for drizzling and greasing the baking dish", "8 ounces (225g) peeled and deveined shrimp", "1 pound (450g) lump crabmeat, picked over for shells", "8 ounces (225g) dry-packed sea scallops, cut into small pieces (see note)", "2 tablespoons (30ml) Dijon mustard", "1/2 cup (120ml) mayonnaise", "Dash of Old Bay seasoning", "1 medium shallot (about 2 ounces; 60g), minced", "Small handful minced flat-leaf parsley, plus more for garnish", "Freshly ground black pepper", "3 1/2 tablespoons (50g) unsalted butter, divided", "1 1/2 tablespoons (12g) all-purpose flour", "1 1/2 cups (360ml) milk", "1 bay leaf", "1 cup panko bread crumbs (about 3 1/2 ounces; 100g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325&deg;F (163&deg;C) and set rack to middle position. In a large pot of salted boiling water, cook shells according to package instructions for baked shells. (Many packages of jumbo shells will give a specific boiling time for dishes that are to be subsequently baked; if yours does not, cook shells for 3 minutes less than the package's recommended cooking time.) Using a spider, slotted spoon, or mesh strainer, carefully transfer shells to a large bowl of cold water until cooled slightly, then drain. (Reserve pasta-cooking water for next step.) Drizzle shells very lightly with oil and toss to coat. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with ice water. Poach shrimp in same pot of pasta water until just barely cooked through, 1 to 2 minutes. Drain, chill in ice bath, then drain again. Chop shrimp into small pieces.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a mixing bowl, combine crabmeat with shrimp, scallops, Dijon, mayo, Old Bay, shallot, and parsley. Mix well and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, melt 1 1/2 tablespoons (20g) butter over medium-high heat (do not allow it to brown). Add flour and whisk to form a paste. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisking constantly, add milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of pan to maintain a homogeneous texture. The sauce will initially be very thick, then get very thin once all the milk is added. Add bay leaf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring, until sauce is thick enough to lightly coat the back of a wooden spoon, about 3 minutes. Season with salt and pepper. Discard bay leaf.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease a 9- by 13-inch baking dish with oil. Spread 1/2 cup (120ml) béchamel sauce in an even layer on bottom of baking dish. Using a spoon, fill a shell with a large scoop of seafood mixture and place in baking dish with the opening side up. Repeat until baking dish is full. (You should be able to fit about 18 stuffed shells in the dish, and may have a few pasta shells left over.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon remaining 1 cup (240ml) béchamel sauce on top of shells. Melt remaining 2 tablespoons (30g) butter and toss with bread crumbs in a small bowl; season with salt. Sprinkle bread crumbs all over shells.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake shells until heated through, about 25 minutes. Switch oven to broiler setting and, watching very closely to prevent burning, broil until bread crumbs turn golden on top, rotating baking dish occasionally for even browning. Scatter minced parsley on top for garnish and serve.</p>"}]}