{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161201-brussels-sprouts-hazelnut-goat-cheese-tangerine-salad-vicky-wasik-11.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["brussels sprout", "cabbage", "fall", "salad", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Salt-Wilted Brussels Sprout Salad With Hazelnuts and Goat Cheese", "link": "https://www.seriouseats.com/recipes/2017/01/wilted-brussels-sprouts-salad-hazelnuts-goat-cheese-recipe.html", "description": "Many of the best salads bring together a wide variety of ingredients, each with its own distinct textures and flavors. But sometimes it's fun to play with a single ingredient, using more than one technique to bring out different qualities in it. Such is the case in this shredded Brussels sprout salad, in which half the sprouts are shredded and left raw and the other half tossed with salt until soft and wilted. Together, they're much greater than the sum of their parts.", "totalTime": "40 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Cabbage", "Christmas", "Easter", "Fall", "Gluten-Free", "Mother's Day", "Salads", "Seasonal and Holiday", "Thanksgiving", "Valentine's Day", "Vegetarian", "Winter"], "recipeIngredient": ["1 3/4 pounds (800g) Brussels sprouts, trimmed and thinly shredded on a <a href=\"http://www.seriouseats.com/2015/01/what-are-the-best-cheap-mandoline-vegetable-fruit-slicers.html\">mandoline</a>, divided", "2 teaspoons (8g) kosher salt, plus more to taste", "1 tangerine (about 5 ounces; 150g)", "1/2 medium shallot (about 3 ounces; 90g), minced ", "1 teaspoon (5ml) Dijon mustard ", "2 tablespoons (30ml) white wine vinegar ", "6 tablespoons (90ml) extra-virgin olive oil", "Freshly ground black pepper", "3/4 cup (170g) skin-on hazelnuts", "4 ounces (115g) fresh goat cheese, crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium mixing bowl, toss half the shredded Brussels sprouts with the 2 teaspoons salt. Knead and squeeze salted sprouts, softening them and releasing their liquid, about 2 minutes. Juice tangerine, reserving half of peel for zesting later, and add juice to salted sprouts. Toss to coat, cover, then transfer to the refrigerator for at least 15 minutes and up to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine shallot, Dijon, vinegar, and the finely grated zest of reserved tangerine peel. Whisk in olive oil, season with salt and pepper, then set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet, toast hazelnuts over medium-high heat, stirring and shaking pan constantly, until skins are just beginning to take on a light roasted, campfire smell (being careful not to burn them or darken them to the point of developing an unpleasant flavor), about 4 minutes. Let cool slightly. Transfer nuts to a zipper-lock bag, then gently crush under the weight of a heavy pan or skillet to form large broken chunks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove salted sprouts from refrigerator. Knead and squeeze once more, then drain and squeeze well to remove any excess moisture. Transfer to a serving bowl. Toss with remaining shredded raw Brussels sprouts and toasted hazelnuts. Whisk dressing, then drizzle all over salad. (Add just enough dressing to lightly coat everything in the salad bowl; you may have a small amount left over.) Season with salt and pepper, then add crumbled goat cheese, toss gently to combine, and serve right away.</p>"}]}