{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20170127-chocolate-cherry-cake-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "cake", "chantilly", "cherry", "chocolate", "cocoa", "dutch cocoa", "layer cake", "whipped cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1818181818182", "ratingCount": "11"}, "name": "Chocolate Cherry Layer Cake", "link": "https://www.seriouseats.com/recipes/2017/02/chocolate-cherry-layer-cake-recipe.html", "description": "If you love chocolate-covered cherries, this festive layer cake is just for you. With tart cherry juice in the batter and freeze-dried cherries in the whipped cream frosting, it's a bright and fruity twist on an otherwise classic chocolate cake. The flavor of the cake itself depends on rich, full-flavored cocoa powder, whether natural or Dutch-process.", "totalTime": "2 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Baking", "Cakes", "Cherry", "Chocolate", "Christmas", "Desserts", "Easter", "Father's Day", "Fruit Desserts", "Mother's Day", "Quick and Easy", "Valentine's Day"], "recipeIngredient": ["<strong>For the Cakes:</strong> ", "4 1/2 ounces all-purpose flour, such as Gold Medal (about 1 cup, spooned; 125g)", "4 ounces high-fat cocoa powder, natural or Dutch (about 1 1/3 cups; 115g)", "8 ounces sugar (about 1 cup plus 2 tablespoons; 225g)", "2 teaspoons (10ml) pure vanilla extract", "1 1/2 teaspoons baking soda", "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1/2 teaspoon cinnamon", "1/4 teaspoon almond extract", "4 large eggs, straight from the fridge (about 7 ounces; 200g)", "6 ounces neutral oil, such as safflower or sunflower (about 3/4 cup plus 2 tablespoons; 170g)", "6 ounces pure, unsweetened tart cherry juice (3/4 cup; 170g) (see note)", "<strong>For the Cherry Whipped Cream:</strong>", "2 ounces freeze-dried cherries (about 1 cup; 55g), plus more for garnishing (see note)", "3 1/2 ounces sugar (about 1/2 cup; 100g)", "24 ounces heavy cream (3 cups; 680g)", "1/8 teaspoon almond extract, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cakes:</strong> Adjust oven rack to middle position and preheat oven to 350&deg;F (177&deg;C). Lightly grease two 8-inch anodized aluminum cake pans and line with parchment (explanation and tutorial <a href=\"http://www.seriouseats.com/2017/06/how-to-cut-a-parchment-round.html\">here</a>). Sift flour and cocoa together to combine. In the bowl of a stand mixer fitted with a whisk attachment, combine sugar, vanilla extract, baking soda, salt, cinnamon, almond extract, and eggs. Whip on medium-high until foamy and light, about 5 minutes, then drizzle in oil. Reduce speed to low and add tart cherry juice, followed by sifted flour/cocoa mixture. When mixture is well combined, divide between prepared cake pans, adding about 17 3/4 ounces (505g) to each. Bake until puffed and firm, about 22 minutes; a toothpick inserted into the center of a cake will leave a few crumbs attached. Cool cakes in their pans until no trace of warmth remains, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cherry Whipped Cream:</strong> In the bowl of a food processor, grind freeze-dried fruit and sugar until powdery and fine, about 90 seconds. Add cream and almond extract (if using), and stir with a fork to ensure no dry pockets of sugar/fruit are stuck in the corners, then pulse until thick and creamy like Greek yogurt, about 5 minutes. The time will vary with the horsepower of your machine, so watch it like a hawk to avoid making fruity butter by mistake. Cover with plastic and refrigerate until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble the Cake:</strong> Using a serrated bread knife, trim the dome from each cake so that the layers stack neatly and can absorb moisture from the cream. Place 1 cake (cut side up) on a serving plate, cake stand, or cast iron turntable. Top with 1 cup cherry whipped cream and spread into an even layer with an offset spatula. Place second cake (cut side down) on top. Smooth cream around sides, then wipe spatula clean. Spread another cup of cherry whipped cream in an even layer on top of cake, then use remaining whipped cream to generously cover sides and decorate by swirling cream with the back of a spoon. If you like, sprinkle with freeze-dried cherries just before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Under a cake dome or loosely wrapped in plastic, the cake will keep up to 24 hours at room temperature. Alternatively, the cake can be wrapped in plastic and refrigerated up to 3 days, then brought to room temperature to serve.</p>"}]}