{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/08/20170727-cocoa-butter-sugar-cookies-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "baking", "chocolate", "cocoa", "cocoa butter", "cookie", "dessert", "drop cookie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Cocoa Butter Cookies With Chocolate Chips", "link": "https://www.seriouseats.com/recipes/2017/11/chocolate-cocoa-butter-sugar-cookies-recipe.html", "description": "Unrefined cocoa butter is a solid oil with an unbelievable richness and delicate chocolate aroma. As the backbone of this cookie dough, it lends a chocolaty essence that pairs well with mellow milk or blond chocolate, which won't overwhelm its unique fragrance.", "totalTime": "45 minutes", "recipeYield": "Makes 28 (3-inch) cookies", "recipeCategory": ["Baking", "Chocolate", "Christmas", "Cookies"], "recipeIngredient": ["4 ounces raw cocoa butter (about 1/2 cup, roughly chopped; 115g), from brands such as <a href=\"https://www.amazon.com/Terrasoul-Superfoods-Organic-Butter-Pounds/dp/B014VGMLCI/?tag=serieats-20\">Terrasoul</a> or <a href=\"https://www.amazon.com/gp/product/B013VVXDYE/?tag=serieats-20\">Wild Foods</a> (see note)", "8 3/4 ounces plain or <a href=\"http://www.seriouseats.com/2016/05/how-to-make-caramel-without-melting-sugar.html\">lightly toasted</a> sugar (about 1 1/4 cups; 250g)", "1 3/4 teaspoons (7g) Diamond Crystal kosher salt, plus more for sprinkling; for table salt, use about half as much by volume or the same weight", "1 teaspoon baking powder", "1/4 teaspoon baking soda", "1/8 teaspoon freshly grated nutmeg", "4 ounces unsalted butter (8 tablespoons; 115g), soft but cool, about 60°F (16°C)", "1 large egg, straight from the fridge", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "10 1/2 ounces all-purpose flour, such as Gold Medal (about 2 1/3 cups, spooned; 300g)", "6 1/2 ounces chopped milk chocolate or chocolate candies, such as M&M's (about 3/4 cup; 185g), plus more for garnishing", "1 ounce cocoa nibs, from brands such as <a href=\"https://www.amazon.com/gp/product/B004EKHMXU/?tag=serieats-20\">Healthworks</a> (about 1/4 cup; 30g), plus more for garnishing (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 1-quart stainless steel saucier, melt cocoa butter over medium-low heat, stirring frequently with a flexible spatula to speed the process along. When cocoa butter is fully melted, pour into the bowl of a stand mixer and cool to approximately 90&deg;F (32&deg;C). Meanwhile, adjust oven rack to middle position and preheat oven to 350&deg;F (180&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When cocoa butter has cooled, add sugar, salt, baking powder, baking soda, nutmeg, and butter. Fit mixer with a paddle attachment and cream until mixture is fluffy and light, about 3 minutes. With mixer still running, add egg, followed by vanilla, and continue beating just until well combined. Pause to scrape bowl and beater with flexible spatula, then resume mixing on low. Add flour; once combined, shut off mixer and fold in chocolate and cocoa nibs (if using).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a cookie scoop or scale, divide dough into 28 portions (about 2 tablespoons, 1 1/2 ounces, or 40g each). If you like, these can be transferred to a zipper-lock bag and refrigerated for up to 1 week, or frozen 3 months; soften to about 68&deg;F (20&deg;C) before baking. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange portions on a parchment-lined half sheet pan, leaving about 2 inches between cookies to account for spread. Without flattening the portions, top each with a few extra portions of chocolate and cocoa nibs and sprinkle with a tiny pinch of kosher salt. Bake until puffed and firm around the edges, though rather pale overall, about 15 minutes. (Due to their low lactose content, these cookies will not brown as you might expect. When fully baked, they will still be quite pale but crisp around the edges.) Cool directly on baking sheet until crumb is set, about 5 minutes. Store in an airtight container up to 4 days at room temperature.</p>"}]}