{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/11/20171102-cunapes-cheesy-bread-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Latin American", "keywords": ["bread", "cheese", "cunapes", "gluten free", "pao de queijo", "tapioca"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Cuñapes/Pão de Queijo (South American Cheesy Bread)", "link": "https://www.seriouseats.com/recipes/2017/12/south-american-cheesy-bread-recipe.html", "description": "This cheesy and addictive South American bread goes by many names, but whether you call it <em>pão de queijo</em>, <em>cuñapes</em>, or <em>pan de bono</em>, it's always equally delicious. This version is made with Brazilian fermented tapioca starch for extra tang and an authentic flavor. A combination of chopped Cheddar and Grana Padano cheeses add both a stretch texture and salty bite. Best of all, they bake up perfectly from frozen so you can always have a stash on hand to quell even the most aggressive cheese cravings.", "totalTime": "24 hours", "recipeYield": "Makes about 18 rolls", "recipeCategory": ["Baking", "Cheese", "Christmas", "Gluten-Free", "Latin American", "Quick Bread", "Snacks"], "recipeIngredient": ["320 grams (about 2 1/4 cups) <a href=\"https://www.amazon.com/dp/B005CBRPIW/?tag=serieats-20\">sour tapioca starch</a> (see note)", "8 grams (2 teaspoons) Diamond crystal kosher salt; for table salt, use about half as much by volume or the same by weight", "4 grams (1 teaspoon) baking powder", "160 grams (2/3 cup) whole milk, cold or scalded", "30 grams (2 tablespoons) unsalted butter, melted", "2 large eggs", "100 grams (3 1/2 ounces) sharp Cheddar cheese, chopped", "160 grams (5.7 ounces) Grana Padano cheese, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine tapioca starch, salt, baking powder, milk, butter, and eggs (for an evenly textured bread use scalded milk; for pops of crusty cheese use cold milk&mdash;the choice is yours). Using your hands, knead dough until thoroughly combined, about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chopped cheddar and Grana Padano to the dough. Knead gently to evenly distribute the cheeses while allowing some larger chunks of cheese to remain, about 2 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover the tapioca dough with plastic wrap pressed directly onto the dough's surface. Refrigerate overnight to allow the starch to fully hydrate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375&deg;F (190&deg;C) and adjust oven rack to the center position. Remove the tapioca dough from the refrigerator and roll into 2-inch balls using the palms of you hands. Make an indentation in the bottom of each roll using the back of a wooden spoon or your thumb.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a parchment-lined rimmed baking sheet, arrange the rolls leaving one inch of space between them. Bake until puffed and golden brown, about 20 minutes, rotating the pan once during baking. Alternatively, freeze the rolls on the sheet tray until hard, then transfer to a zipper-lock bag to store in the freezer. Bake from frozen as directed above. </p>"}]}