{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/03/20170210-creamy-kale-eggs-emily-matt-clifton-3.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "", "keywords": ["breakfast", "brunch", "cheese", "egg", "green", "kale", "mushroom", "spinach", "swiss chard", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Baked Eggs With Creamy Greens, Mushrooms, and Cheese", "link": "https://www.seriouseats.com/recipes/2017/03/baked-eggs-creamy-greens-swiss-chard-kale-spinach-mushrooms-recipe.html", "description": "Three kinds of leafy greens combine with mushrooms, garlic, leeks, mustard, and spices to form the base for a baked-egg dish that's a bit like an omelette turned inside out. It's an ideal recipe for brunch, or really any meal of the day.", "totalTime": "50 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Baking", "Breakfast and Brunch", "Cheese", "Easter", "Eggs", "Father's Day", "Kale", "Mains", "Mother's Day", "Mushrooms", "Other Vegetables", "Quick Dinners", "Spinach", "Vegetarian"], "recipeIngredient": ["Kosher salt", "1 large bunch <em>lacinato</em> kale, tough stems removed, leaves roughly chopped (about 6 ounces; 180g after stemming)", "1 large bunch Swiss chard, tough stems removed, leaves roughly chopped (about 7 ounces; 200g after stemming)", "5 ounces (140g) baby spinach", "3 tablespoons (45g) unsalted butter, divided", "8 ounces (225g) button or cremini mushrooms, stems trimmed and caps sliced", "Freshly ground black pepper", "2 leeks, white and light green parts only, washed well and thinly sliced (about 9 ounces; 250g total)", "3 medium cloves garlic, 2 minced or grated and 1 left whole for toast, divided", "2 tablespoons (45g) all-purpose flour", "1 cup (235ml) half and half", "1/2 cup (120ml) milk", "3 tablespoons (45ml) dry white wine", "1/8 teaspoon freshly grated nutmeg", "2 teaspoons (10ml) Dijon mustard ", "3/4 cup grated Gruyère cheese (2 1/2 ounces; 75g)", "4 to 6 large eggs", "Pinch of red chili flakes, for garnish", "4 to 6 slices toasted and buttered bread, such as from a baguette"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F (190&deg;C). Bring a large pot of salted water to a boil. Working in batches if necessary, add kale, chard, and spinach to pot and cook for 1 minute. Using a spider or strainer, lift greens from water and transfer to a colander. Immediately run under cold water to stop the cooking. Repeat with remaining greens if necessary. Using your hands, squeeze greens to remove as much excess liquid as possible. Roughly chop greens and set aside. You should have about 10 1/2 ounces (300g) of cooked, squeezed greens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large skillet, melt 1 tablespoon (15g) butter over medium-high heat until foaming. Add mushrooms and cook, stirring only occasionally, until well browned, about 6 minutes. Season with salt and pepper, then transfer to a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 2 tablespoons (30g) butter to skillet and melt over medium-high heat until foaming. Add leeks and cook, stirring often, until softened but not browned. Stir in minced garlic and cook 30 seconds. Sprinkle flour over leeks and cook, stirring, until raw flour smell has cooked off, about 1 minute. Stir in half and half and milk. Bring to a simmer and cook until sauce thickens, 1 to 2 minutes. Stir in wine, nutmeg, mustard, reserved mushrooms, and reserved greens and return to a simmer. Season with salt and pepper. Remove skillet from heat. If mixture is very thick, add a bit more water or milk to thin slightly (this will depend on how much water you squeezed out of the greens). You should have about 4 cups of creamed greens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If baking in the same skillet, sprinkle Gruyère on top of greens. (You can also divide greens into smaller individual skillets or baking dishes.) If using a baking dish, scrape creamy greens into it, smooth into an even layer, and sprinkle Gruyère on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a spoon, make egg-sized indentations in greens, one for each egg. Crack an egg into each well and season with salt. Bake until egg whites are just set and yolks are still runny, 10 to 20 minutes. Check eggs frequently to make sure they don’t overcook. Remove from oven and sprinkle a pinch of red chili flakes over each egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While toast is still warm, gently rub one side of each slice with remaining clove of garlic. Serve, using toast to scoop up greens and eggs.</p>"}]}