{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20170128-bagel-bites-cheese-pepperoni-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["bagel", "Bake", "bread", "mozzarella", "pizza", "snack", "tangzhong", "yukone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Homemade Bagel Bites", "link": "https://www.seriouseats.com/recipes/2017/02/homemade-bagel-bites-recipe.html", "description": "If you can't understand the allure of made-from-scratch Bagel Bites, there's nothing I can say or do to convince you. This is a recipe for the hardcore fans, those of us who've longed for bite-size pizza poppers that taste as good as we remember&mdash;chewy, cheesy, salty, and crisp.", "totalTime": "25 hours, including time to make bagel dough (45 minutes with premade bagels)", "recipeYield": "Makes thirty-two 1 1/2–inch bagel pizzas", "recipeCategory": ["Baking", "Cheese", "Game Day", "Pizza", "Snacks", "Yeast Bread"], "recipeIngredient": ["<a href=\"http://www.seriouseats.com/recipes/2017/01/homemade-bagels-recipe.html\">Homemade Bagel</a> dough", "1 ounce barley malt syrup (4 teaspoons; 30g), optional", "<a href=\"http://www.seriouseats.com/recipes/2014/09/easy-italian-amercian-red-sauce-recipe.html\">Quick and Easy Italian-American Red Sauce</a>", "Salt, pepper, and fennel seed to taste", "12 ounces finely shredded mozzarella cheese (3 cups; 340g)", "6 ounces pepperoni, such as <a href=\"https://www.amazon.com/Vermont-Smoke-Cure-Pepperoni-Uncured/dp/B01HEHVKKU/?tag=serieats-20\">Vermont Smoke & Cure</a> (1 link; 170g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mini Bagels:</strong> Prepare dough as directed, then divide into 16 equal portions, about 1 1/2 ounces or 43g each. Cup a portion of dough beneath your palm and work in quick, circular motions to form a tight skin around the ball, with only a tiny seam along the bottom. If the seam is large or irregular, continue rounding until the bottom is nearly smooth. Cover with plastic and let rest 15 minutes. Poke a hole into the center of each portion with a damp fingertip, then gently stretch into a 1 1/2&ndash;inch ring, wetting your hands in cold water as needed to prevent sticking. Arrange on a well-greased, parchment-lined half sheet pan, cover with plastic, and refrigerate 24 to 36 hours, depending on your schedule.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Boil and Bake:</strong> Adjust oven rack to lower-middle position and preheat to 425&deg;F (218&deg;C). Nest a wire baking rack in a half sheet pan, then cover with parchment. Fill a stainless steel pot with about 3 inches of water, stir in malt (if using), and bring to a boil over high heat. Meanwhile, line a baking sheet or cutting board with a thick layer of paper towels. Working with three or four at a time, boil the bagels, about 15 seconds per side. Place on paper towels, then immediately transfer to the prepared half sheet pan. (If left on the paper towels too long, the bagels will stick; if this happens, quickly dip the bagel back into the hot water, and the wet paper towel will peel right off.) Bake until blistered and golden brown all over, about 18 minutes. Cool at least 15 minutes before proceeding to the next step, or store mini bagels up to 36 hours in a paper bag.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Adjust oven rack to lower-middle position and preheat to 450&deg;F (232&deg;C). Split mini bagels horizontally with a serrated knife, arrange half on a parchment-lined baking sheet, and toast only until their surface is a little dry, about 5 minutes. Top each with a few tablespoons of red sauce, followed by a sprinkle of salt, pepper, and fennel seed, followed by a generous mound of cheese and a small handful of diced pepperoni. Bake until the cheese is melted and golden brown, about 16 minutes, and serve immediately. Repeat with remaining bagel halves for round two.</p>"}]}