{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/08/20170713-misticanza-wild-greens-salad-vicky-wasik-11.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["chicory", "green", "herb", "Italian", "lettuce", "Roman", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Roman-Inspired Mixed-Green Salad (Misticanza alla Romana)", "link": "https://www.seriouseats.com/recipes/2017/08/roman-mixed-green-salad-misticanza-recipe.html", "description": "Want a truly great mixed green salad full of vibrant lettuces, flavorful herbs, and bitter greens? You're not going to find it in the pre-mixed salad section of your supermarket. Instead, make your own with the freshest whole heads of lettuce, radicchio, herbs, dandelion, and more. This incredibly simple recipe is inspired by the Roman salad called <em>misticanza</em>, which traditionally combines several wild greens. It's unlikely most of us outside of Rome can find those greens, but we can capture the same spirit by combining a good mix of tender, bitter, and herbaceous greens.", "totalTime": "15 minutes", "recipeYield": "Makes as much salad as you want", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Easter", "Fall", "Italian", "No-Cook", "Other Vegetables", "Salads", "Spring", "Summer", "Vegan", "Vegetarian"], "recipeIngredient": ["Mixed of wild and/or cultivated leafy greens and tender fresh herbs, such as lettuces, chicory, endive, raddichio, dandelion, purslane, frisée, kale, fennel fronds, parsley, tarragon, chervil, basil, mint, and more, preferably grown locally and at peak season and freshness (see note)", "Extra-virgin olive oil", "Fresh lemon juice", "Kosher or sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pick over the leafy vegetables, discarding any wilted or damaged leaves. Cut lettuce leaves free of their cores, pick the tender herbs from stems, and quarter, core, and slice tight leafy heads like radicchio and endive. Wash everything in several changes of water until no dirt or grit remains. Dry well in a salad spinner.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large serving bowl, gently toss salad with just enough olive oil to gently coat leaves. Add a splash of lemon juice and salt to taste, tossing to combine. Serve.</p>"}]}