{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/07/20170707-ajo-blanco-cold-soup-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Spanish", "keywords": ["almond", "bread", "gazpacho", "quick", "soup", "spanish", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Ajo Blanco (Spanish Chilled Bread and Almond Soup)", "link": "https://www.seriouseats.com/recipes/2017/07/ajo-blanco-spanish-bread-almond-cold-soup-recipe.html", "description": "Made with bread, almonds, garlic, olive oil, and a splash of vinegar, then topped with refreshing green grapes, <em>ajo blanco</em> is Spain's other perfect warm-weather bread soup, and it just happens to be 100% vegan.", "totalTime": "10 minutes, plus at least 2 hours chilling time", "recipeYield": "Makes about 6 cups (1.4L)", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cold Soup", "Dairy-Free", "Gazpacho", "No-Cook", "Nuts", "Quick and Easy", "Seasonal and Holiday", "Spanish", "Summer", "Vegan", "Vegetarian"], "recipeIngredient": ["1 cup blanched or <a href=\"https://www.amazon.com/California-Grown-Marcona-Almonds-Bag/dp/B01N05HZ7G/?tag=serieats-20\">Marcona almonds</a> (6 ounces; 170g), see note", "3 cups (720ml) cold water", "1 to 2 medium cloves garlic (depending on how strong you want the garlic flavor to be)", "1/2 pound (225g) fresh, crustless rustic bread (see note), cut into 1-inch cubes (about 3 cups)", "Kosher salt", "1 1/2 teaspoons (7ml) sherry vinegar, plus more if desired", "1 1/2 tablespoons (22ml) extra-virgin olive oil, plus more for garnish and for serving", "Green seedless grapes, crushed toasted almonds, and thinly sliced fresh mint leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a blender, combine almonds with water and garlic and blend at high speed until milky; you may need to stop and scrape down sides of blender jar once or twice. Add bread and blend until very smooth. Season with salt, then blend in vinegar and olive oil. If using a less powerful blender, you may want to pass the soup through a fine-mesh strainer at this point; with a high-powered blender, that won't be necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer soup to a sealed container and refrigerate until very well chilled, at least 2 hours and up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Cut up grapes into smaller pieces and toss with almonds, mint, and just enough olive oil to coat. Season garnish with salt. Shake or stir soup well. Check consistency and thin with cold water, if desired. Adjust seasoning, adding more salt and/or vinegar, if desired. Pour into chilled serving bowls. Spoon grape garnish on top, lightly drizzling more olive oil onto each serving in a decorative manner. Serve.</p>"}]}