{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/09/20170914-sweetened-condensed-milk-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["condensed", "condensed milk", "condiment", "dairy", "gluten free", "milk", "sweetened", "sweetened condensed"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "6"}, "name": "BraveTart: Sweetened Condensed Milk", "link": "https://www.seriouseats.com/recipes/2017/10/bravetart-sweetened-condensed-milk-recipe.html", "description": "Homemade sweetened condensed milk traditionally requires ultra-low heat and up to six hours of constant stirring, but with a splash of heavy cream to prevent scorching, you can crank up the heat and be done in 45 minutes flat. The result is thicker, creamier, and more luscious than anything from a can, with a rich dairy flavor and subtle notes of toffee.", "totalTime": "45 minutes", "recipeYield": "Makes 2 cups or 19 ounces", "recipeCategory": ["Breakfast and Brunch", "Condiments and Sauces", "Desserts", "Gluten-Free", "Stovetop"], "recipeIngredient": ["32 ounces milk, <a href=\"http://www.seriouseats.com/2017/01/is-it-okay-to-bake-with-skim-milk.html\">any percentage will do</a> (4 cups; 910g)", "6 ounces heavy cream (3/4 cup; 170g)", "7 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted</a> sugar (1 cup; 195g)", "1/8 teaspoon Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "Aromatics such as a vanilla bean, split lengthways, or cinnamon stick (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk, cream, sugar, salt, and vanilla bean or cinnamon (if using) in a 5-quart stainless steel saucier. If you have a scale, weigh the pot and ingredients together so you can digitally track the reduction. Place over medium heat, stirring occasionally with a heat-resistant spatula, until the milk begins to simmer, about 12 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue simmering an additional 30 minutes, scraping continuously to prevent a milky buildup from forming around the sides. When the thickened milk syrup suddenly turns foamy, it’s almost done. Keep cooking and stirring until the foam subsides and the dairy has condensed to exactly 2 cups or 19 ounces. If using a scale, the pot will weigh 26 ounces less than when you started.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Troubleshooting:</strong> Should the dairy reduce too far, top it off with enough milk to reach 2 cups or 19 ounces, then remove aromatics and blitz with an <dorado id=\"hand-blender\" class=\"text\">immersion blender</dorado> to emulsify.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into an airtight container, seal to prevent evaporation, and refrigerate until needed, up to 1 month. To mimic the consistency of canned milk, bring to room temperature before use.</p>"}]}