{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161212-caldo-verde-portuguese-potato-kale-soup-recipe-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["caldo verde", "easy", "fall", "kale", "one pot", "Portuguese", "potato", "quick", "sausage", "soup", "stew", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "<em>Caldo Verde</em> (Portuguese Potato and Kale Soup With Sausage)", "link": "https://www.seriouseats.com/recipes/2017/01/caldo-verde-portuguese-potato-kale-soup-recipe.html", "description": "<em>Caldo verde</em>, a potato and kale soup from northern Portugal, is one of those dishes that seem custom-made for lazy rainy days, when you want something hearty and comforting but don't feel like putting in a ton of effort. It's made with a few cheap and simple ingredients, it takes all of maybe 10 minutes of prep work, and it's ready to eat just half an hour later. Oh, and it's all made in a single pot, too. And did I mention delicious? It's delicious.", "totalTime": "30 minutes", "recipeYield": "Serves 6", "recipeCategory": ["Fall", "Gluten-Free", "Kale", "Mains", "Pork", "Potato", "Quick and Easy", "Quick Dinners", "Soups and Stews", "Stovetop", "Winter"], "recipeIngredient": ["2 tablespoons (30g) unsalted butter", "1 medium yellow onion or large leek, finely diced (about 8 ounces; 225g)", "3 medium cloves garlic, sliced (about 1 tablespoon; 15g)", "Kosher salt and freshly ground black pepper", "About 6 tablespoons (90ml) extra-virgin olive oil ", "1 large russet potato, peeled, quartered, and cut into 1/4-inch slices (about 1/2 pound; 225g)", "2 medium Yukon Gold potatoes, peeled, quartered, and cut into 1/4-inch slices (about 1/2 pound; 225g)", "6 cups (1.4L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock (see note)", "1 bunch curly or <em>lacinato</em> kale, tough stems removed, leaves roughly chopped (about 3/4 pound; 340g)", "12 ounces (340g) cooked <em>linguiça</em> or other garlicky pork sausage, cut into 1/4- to 1/2-inch slices (see note)", "Minced fresh chives, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in a large Dutch oven or saucepan over medium heat until melted. Add onion (or leek) and garlic, season with salt and pepper, and cook, stirring frequently, until softened but not browned, about 5 minutes, adding olive oil as necessary to keep the mixture loose and moist.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add potatoes and stock and bring to a simmer, stirring occasionally. Add kale and continue to cook until russet potato slices have completely broken down (you can press them with a spoon or potato masher for an even thicker texture), the Yukon Golds are tender, the greens have softened, and the soup has thickened to a creamy consistency, 25 to 30 minutes. Stir in sausage. Season soup to taste with salt and pepper and serve garnished with chives, if desired.</p>"}]}