{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/05/20170420-baked-salmon-harissa-lime-aioli-vicky-wasik-10.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["broil", "easy", "fish", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7777777777778", "ratingCount": "9"}, "name": "Broiled Salmon With Chili-Lime Mayonnaise", "link": "https://www.seriouseats.com/recipes/2017/05/baked-broiled-salmon-harissa-mayonnaise.html", "description": "Baked salmon offers an easy and convenient way to cook the fish, but, more often than not, broiling is your best option&mdash;it promises a more intensely browned surface while leaving the center of the salmon tender and juicy. This recipe coats the fish in a thin layer of flavorful mayonnaise seasoned with harissa chili paste and fresh lime, and works with either individual portions of fish or a large party-size fillet.", "totalTime": "15 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Easter", "Father's Day", "Gluten-Free", "Mains", "Mother's Day", "Quick and Easy", "Quick Dinners", "Roasting", "Salmon", "Valentine's Day"], "recipeIngredient": ["1 cup mayonnaise (235ml)", "2 tablespoons harissa chili paste (30ml), plus more if desired", "Finely grated zest of 2 limes plus 2 teaspoons fresh lime juice (10ml)", "1/2 teaspoon ground coriander seed", "2 pounds boneless center-cut salmon fillet (900g), with or without skin and either whole or divided into individual portions (see note)", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler and set oven rack to about 6 inches below broiler element. Meanwhile, in a small bowl, stir together mayonnaise, harissa, lime zest and juice, and coriander seed. Season with salt and pepper; feel free to adjust flavor and heat level by adding more harissa, if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a rimmed baking sheet with aluminum foil. Lightly season salmon all over with salt and pepper. Set salmon on prepared baking sheet and rub a thin, even layer of harissa mayo all over the surface and sides.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Broil salmon until browned on top and the center registers 115 to 125&deg;F for medium-rare to medium, respectively, about 5 minutes; it can help to keep the oven door cracked while salmon is cooking to prevent the broiler from cycling on and off (though not all ovens function this way). If salmon becomes well browned on top before it is cooked enough in the center, switch off the broiler and set the oven to 425&deg;F, then continue cooking until done (this shouldn't take more than 1 to 2 minutes longer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer salmon to plates or a platter and serve.</p>"}]}