{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/05/20170413-biscoff-ice-cream-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "Biscoff", "BraveTart", "cinnamon", "cookie", "ice cream", "speculoos", "spice", "summer", "toasted sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Homemade Speculoos Ice Cream", "link": "https://www.seriouseats.com/recipes/2017/06/biscoff-ice-cream-recipe.html", "description": "Biscoff cookies, whether real or copycat, give this silky ice cream an intriguing caramel flavor, while dairy dilutes the spices into something mellow and mild. With a shot of espresso, it makes an amazing twist on <em>affogato</em>.", "totalTime": "5 hours", "recipeYield": "Makes 1 heaping quart", "recipeCategory": ["Cookies", "Ice Cream and Frozen Treats", "Summer"], "recipeIngredient": ["5 1/2 ounces <a href=\"http://www.seriouseats.com/recipes/2016/05/dry-toasted-sugar-granulated-caramel-recipe.html\">Toasted Sugar</a> (about 3/4 cup; 145g), see note", "4 ounces egg yolk (about 1/2 cup; 110g), from about 8 large eggs", "3/4 teaspoon (3g) Diamond Crystal kosher salt, plus more as needed; for table salt, use half as much by volume or use the same weight", "1/8 teaspoon baking soda", "6 3/4 ounces Biscoff crumbs (about 1 1/2 cups; 190g), from store-bought or <a href=\"http://www.seriouseats.com/recipes/2017/06/homemade-biscoff-recipe.html\">homemade cookies</a>", "9 ounces heavy cream (about 1 cup plus 2 tablespoons; 255g)", "11 ounces whole milk (about 1 1/4 cups plus 2 tablespoons; 310g)", "1/4 ounce bourbon or rye whiskey, or whatever sounds tasty (about 1/2 tablespoon; 7g), optional", "1 teaspoon (5ml) vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine toasted sugar, egg yolks, salt, and baking soda in a 3-quart stainless steel saucier, then whisk in cookie crumbs, cream, and milk. Cook over medium-low heat for a few minutes, until warm to the touch. Increase heat to medium, stirring and scraping constantly with a flexible spatula, and cook until steaming-hot, about 8 minutes or to 155&deg;F (68&deg;C). Pour through a fine-mesh sieve into a large stainless steel bowl, pressing gently with a flexible spatula to release the liquid trapped in the crumbs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a sink compartment or extra-large bowl with a few inches of ice water and place bowl with custard inside, stirring from time to time, until cool, about 30 minutes. Cover and refrigerate until no warmer than 40&deg;F (4&deg;C), about 4 hours. (The ice cream base can be kept refrigerated for up to 1 week.) Stir in whiskey and vanilla and season to taste with more salt if desired. Churn in an ice cream machine according to the manufacturer’s directions. Meanwhile, place a 1-quart container and flexible spatula in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ice cream looks thick and light, shut off the machine and scrape ice cream into chilled container, using chilled spatula. Enjoy as soft-serve, or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until hard, about 4 hours. </p>"}]}