{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/06/20170608-radler-cocktails-grapefruit-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Maggie Hoffman"}, "recipeCuisine": "", "keywords": ["beer", "citrus", "drink", "grapefruit", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fresh Grapefruit Radler (Shandy)", "link": "https://www.seriouseats.com/recipes/2017/06/fresh-grapefruit-radler-shandy-beer-recipe.html", "description": "A radler is the German word for what is sometimes known as a shandy: a mix of light, cold beer and sparkling lemonade (or, in this case, Grapefruit-ade). You can buy a premixed grapefruit radler but it lacks the pop of juicy flavor you get from this fresh version. Here, the grapefruit soda is made not just with the juice but also the citrus oils from the citrus skin; a dose of lemon juice ensures it's tart enough.", "totalTime": "4 hours or up to 13 hours", "recipeYield": "Makes 1 radler and enough soda for 4 servings", "recipeCategory": ["Beer and Wine", "Father's Day", "Grapefruit"], "recipeIngredient": ["<strong>For the Fresh Grapefruit Soda:</strong>", "2 pounds ruby red grapefruits (about 3 medium)", "150 grams (3/4 cup) sugar", "3 ounces (90ml) fresh lemon juice from about 3 lemons", "12 ounces cold sparkling water", "<strong>For Each Radler:</strong>", "9 ounces chilled beer (265ml), such as pilsner", "6 ounces Fresh Grapefruit Soda (175ml)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fresh Grapefruit Soda</strong>: Bring grapefruits to room temperature, then roll firmly against the counter to soften their rinds. Halve or quarter and juice one grapefruit; set aside others for juicing later. Pour juice into a sealable container and refrigerate. Cut juiced grapefruit rind into 1-inch chunks. Toss with sugar in a large nonreactive mixing bowl, cover tightly with plastic, and let stand at room temperature, stirring once every 45 minutes or so, until sugar has completely dissolved, about 3 hours. (You can let the mixture stand up to 12 hours, if desired.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Measure reserved grapefruit juice and juice additional grapefruits to yield 10 ounces (1 1/4 cups) of fresh juice. Add to sugar mixture along with lemon juice and stir well, then strain through a nonreactive fine-mesh strainer or piece of cheesecloth into a glass or ceramic container. At this point, the concentrated grapefruit syrup can be refrigerated for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, add sparkling water to concentrated grapefruit syrup. Adjust to taste with additional sparkling water, grapefruit, or lemon juice; bear in mind that a tart soda tastes best when mixed with beer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Each Radler:</strong> Add beer and Grapefruit Soda to a 16-ounce pint glass. Serve immediately. </p>"}]}