{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20161219-choucroute-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["alsatian", "braise", "cabbage", "fall", "French", "meat", "pork", "sauerkraut", "sausage", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Choucroute Garnie à l'Alsacienne (Alsatian Braised Sauerkraut With Mixed Meats and Sausages)", "link": "https://www.seriouseats.com/recipes/2017/01/choucroute-garnie-alsatian-braised-sauerkraut-meat-sausage-recipe.html", "description": "Meat and sauerkraut: It's a combo we all know and love, but no version takes it to such exalted heights as Alsatian <em>choucroute garnie</em>. Making it requires knowing a thing or two about all the cuts of meat involved and how best to handle them. This recipe will ensure that your lean cuts don't dry out and that your tough ones become meltingly tender.", "totalTime": "4 hours 15 minutes, plus up to 2 days if pre-salting fresh meats", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Bacon", "Braising and Stewing", "Cabbage", "Fall", "French", "Gluten-Free", "Mains", "Other Meats", "Pork", "Winter"], "recipeIngredient": ["1 pound (450g) boneless pork loin", "1 pound (450g) boneless pork shoulder", "Kosher salt", "1/4 cup plus 2 tablespoons (90ml) lard, goose fat, duck fat, or vegetable oil, divided", "2 medium yellow onions, thinly sliced (about 12 ounces; 350g total)", "2 cups (480ml) dry white wine, such as Riesling or Silvaner (see note)", "1 cup (240ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> chicken stock or low-sodium chicken broth", "1 cheesecloth sachet containing 2 crushed medium cloves garlic, 10 juniper berries, 2 cloves, 1/2 teaspoon caraway seed, and 2 bay leaves", "1 pound (450g) slab bacon", "1 ham hock (about 3/4 pound; 340g)", "1 (8-ounce; 225g) piece salt pork from the belly or side (not fatback; optional)", "5 pounds (2.25kg) good-quality store-bought or <a href=\"http://www.seriouseats.com/recipes/2016/12/homemade-fermented-sauerkraut-recipe.html\">homemade</a> sauerkraut, drained", "1 1/2 pounds (680g) mixed French- and/or German-style emulsified sausages, such as frankfurters, bratwurst, <em>weisswurst</em>, <em>boudin blanc</em>, <em>boudin noir</em>, or knackwurst", "2 smoked pork chops (about 1 1/4 pounds; 560g total)", "5 small Yukon Gold potatoes, peeled, halved, and simmered in salted water until tender", "2 tablespoons (30ml) kirsch (cherry brandy; optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously season pork loin and shoulder all over with salt. You can either proceed with the rest of the recipe right away, or, if you have time, place both cuts on a wire rack set over a rimmed baking sheet and refrigerate, uncovered, for up to 2 days. (Pre-salting the fresh cuts of pork will season them deeply and help them retain juiciness later.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 250&deg;F (121&deg;C). In a large Dutch oven, heat 1/4 cup (60ml) goose fat (or duck fat, lard, or oil) over medium-low heat until shimmering. Add onions and cook, stirring often, until softened but not browned, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine, stock, and cheesecloth sachet to onions. Nestle pork shoulder, slab bacon, and ham hock in onions and braising liquids and bring to a simmer over medium-high heat. Cut a <a href=\"http://www.seriouseats.com/2016/04/how-to-make-a-parchment-paper-lid.html\">parchment paper lid</a> sized to fit Dutch oven and set directly on top of meats and liquid. Transfer to oven and cook for 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, Cook Pork Loin:</strong> Place pork loin in a small ovenproof skillet or on a rimmed baking sheet and cook on a separate rack in oven until an instant-read thermometer inserted in center registers 120&deg;F (49&deg;C), about 1 hour. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, Prepare Salt Pork (if using):</strong> Fill a large saucepan with water, add salt pork, and bring to a gentle simmer. Continue to cook at a very gentle simmer for 1 hour, then transfer salt pork to Dutch oven for remainder of cooking time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, Prepare Sauerkraut:</strong> In a colander, lightly rinse sauerkraut under cold running water, then taste; depending on how much of its sour flavor you want to preserve, you can stop here or continue to rinse until desired flavor is reached. (This will depend on the age and flavor of the sauerkraut and your personal preference.) Using your hands, squeeze sauerkraut dry of excess water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After meats in Dutch oven have cooked for 1 1/2 hours, per instructions in step 3, add sauerkraut to Dutch oven, mixing it into braising liquids and meats. Raise oven temperature to 300&deg;F (149&deg;C), re-cover with parchment paper lid, and cook until meats are very tender, about 1 hour longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish the Dish:</strong> Fill a large saucepan with water and bring to a bare simmer over medium-high heat. Add sausages, lower heat to maintain a bare simmer, and cook until heated through, about 10 minutes. Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet, heat remaining 2 tablespoons (30ml) fat or oil over high heat until shimmering. Add reserved pork loin from step 4 and sear, turning often, until well browned all over, about 3 minutes per side. Slice into medallions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove parchment paper lid from Dutch oven and add pork loin medallions, smoked pork chops, and potatoes. Return to oven and cook until chops and loin are just heated through, 10 to 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove all meats from Dutch oven and set aside on a clean rimmed baking sheet. Discard cheesecloth sachet. Season sauerkraut with salt and stir in kirsch, if using. Using a slotted spoon, heap sauerkraut onto a large warmed serving platter, allowing any excess juices to drain off and arranging potatoes throughout. Drain poached sausages. Arrange meats and sausages all over mound of sauerkraut and serve.</p>"}]}