{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/05/BlackberryFrenchToast.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["berry", "blackberry", "breakfast", "brunch", "French toast", "lemon", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "French Toast With Quick Blackberry Compote and Lemon Ricotta", "link": "https://www.seriouseats.com/recipes/2017/05/french-toast-quick-blackberry-compote-recipe.html", "description": "If you've got enough time to make a proper batch of French toast, then you've got enough time to throw in a pair of toppings&mdash;in this case, lemon ricotta and a quick berry compote&mdash;that will take that French toast from Tuesday-morning staple to weekend blowout.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Father's Day", "French Toast", "Lemon", "Mother's Day", "Quick and Easy", "Stovetop", "Summer"], "recipeIngredient": ["<strong>For the Blackberry Compote:</strong>", "8 ounces (225g) blackberries, carefully washed", "3 tablespoons (40g) sugar, plus more to taste", "Pinch kosher salt", "1 tablespoon (8g) finely grated zest and 1 tablespoon (15ml) fresh juice from 1 lemon, divided (reserve 2 teaspoons zest for ricotta), plus additional zest for garnish if desired", "<strong>For the Lemon Ricotta:</strong>", "6 ounces (170g) high-quality fresh ricotta cheese (see note)", "Whole milk, as needed, for thinning ricotta", "<strong>For the French Toast:</strong>", "6 large eggs", "4 tablespoons (50g) sugar, plus more for sprinkling", "Pinch kosher salt", "Pinch ground cinnamon", "Pinch freshly grated cardamom or nutmeg", "2 cups (450ml) whole milk", "4 tablespoons (60g) unsalted butter, for the pan", "8 (1/2-inch-thick) slices bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Blackberry Compote:</strong> Combine blackberries, 3 tablespoons sugar, pinch salt, and 1/4 cup (60ml) water in a small saucepan or skillet over medium-high heat. Cook, smashing berries with a potato masher or whisk, until a dark, syrupy mash has formed, about 5 minutes. Stir in 1 teaspoon lemon zest and 1 tablespoon lemon juice. Add more sugar to taste, if needed. Compote should be sweet and tart. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lemon Ricotta:</strong> Combine ricotta and remaining 2 teaspoons lemon zest in a bowl and stir with a spoon. Add a few splashes of milk, if necessary, to adjust mixture to a consistency that is not runny but spreads very slowly when you pile it up with a spoon. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the French Toast:</strong> Set a wire rack on a rimmed baking sheet in the oven and preheat to 200&deg;F (95&deg;C). If using very fresh, moist bread, arrange slices in a single layer on rack and cook in oven, turning once, until lightly toasted, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large mixing bowl, whisk together eggs, sugar, salt, cinnamon, and cardamom or nutmeg until thoroughly combined. Add milk and whisk to blend.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 1 tablespoon (15g) butter in a large nonstick or cast iron skillet over medium heat, swirling skillet, until foaming subsides, about 5 minutes. Meanwhile, soak 2 slices of bread in egg bath, turning, until saturated. Add soaked bread to skillet and cook, swirling occasionally, until browned on bottom side, about 3 minutes. Sprinkle top side of bread with sugar, flip, and continue to cook, swirling occasionally, until browned on second side, about 3 minutes longer. Transfer French toast to rack in oven, arranging in a single layer, to keep warm. Repeat with remaining slices of bread and egg bath.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve French toast with ricotta and compote spooned on top. Garnish with more lemon zest, if desired.</p>"}]}