{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/07/20170627-cream-cheese-frosting-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "cake", "cream cheese", "dessert", "easy", "frosting", "icing"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2307692307692", "ratingCount": "26"}, "name": "Fast and Easy Cream Cheese Frosting", "link": "https://www.seriouseats.com/recipes/2017/08/cream-cheese-frosting-recipe.html", "description": "This silky frosting is fluffy and light, but thick enough to hold its shape for days when piped over cupcakes in generous swirls. It's tangy and fresh, like pure cream cheese with just a hint of vanilla. Even better, it takes only about 10 minutes to prepare. If you like, the recipe can be safely doubled, or even tripled.", "totalTime": "10 minutes", "recipeYield": "Makes about 2 cups", "recipeCategory": ["Cakes", "Frosting", "Gluten-Free", "No-Cook", "Pastry", "Quick and Easy"], "recipeIngredient": ["3 1/2 ounces sugar (about 1/2 cup; 100g); see note", "5 ounces heavy cream (shy 2/3 cup; 140g)", "1 teaspoon (5g) vanilla extract", "1/8 teaspoon Diamond Crystal kosher salt; for table salt, use about half as much by volume", "8 ounces plain, full-fat Philadelphia cream cheese, cold (one 8-ounce brick; 225g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With kitchen temperatures above 74&deg;F (23&deg;C), start by refrigerating the mixing bowl and sugar until they have cooled to 70&deg;F (21&deg;C). At elevated temperatures, these ingredients and equipment can act as a heat source to the cream, preventing full aeration.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with the whisk attachment, or using a hand mixer, combine sugar, cream, vanilla, and salt. Mix at medium-low speed until sugar is dissolved, about 2 minutes. Increase speed to high and continue beating until cream is about as thick as Greek yogurt, about 2 minutes longer. Begin adding cream cheese 2 tablespoons at a time; this should take about 30 seconds all together. Once it is incorporated, shut off the mixer. The frosting will look a bit curdled, like cottage cheese; this is the result of incomplete mixing rather than over-whipping, so don’t be alarmed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thoroughly scrape bowl and whisk, then continue whipping on high until frosting is smooth and light, with only a few small flecks of cream cheese (they will disappear into the frosting over time). This may take 2 to 3 minutes with a stand mixer, or more if using a hand mixer. After whipping, the frosting should be about 60&deg;F (16&deg;C). Use immediately or refrigerate until needed.</p>"}]}