{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/05/20170517-spring-salad-labne03.JPG", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "fava", "labne", "mozzarella", "pea", "salad", "snap pea", "spring", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spring Vegetable and Arugula Salad With Labne and Cucumbers", "link": "https://www.seriouseats.com/recipes/2017/05/spring-vegetable-arugula-salad-labne-asparagus-peas-favas-recipe.html", "description": "Come spring, it helps to keep the fridge stocked with the season's best produce, already blanched and chilled and at the ready. Here we combine sweet peas, grassy asparagus, green fava beans, crisp snap peas, and broccolini, along with some peppery arugula, a juicy cucumber, a red onion, and some fresh mozzarella cheese. Served with a good dressing and some labne and we have a spring salad that eats like a meal.", "totalTime": "30 minutes", "recipeYield": "Serves 4 as a meal or 6 to 8 as a side dish or appetizer", "recipeCategory": ["Asparagus", "Cucumber", "Easter", "Legumes", "Mains", "Onion", "Quick Dinners", "Salads", "Spring", "Stovetop", "Vegetarian"], "recipeIngredient": ["2 medium Persian cucumbers, split lengthwise and cut into 1/4-inch disks (about 6 ounces; 170g)", "Kosher salt", "1 small red onion, thinly sliced (about 4 ounces; 115g)", "12 ounces fava beans in their pods or 4 ounces shucked fava beans (120g shucked beans)", "12 ounces English peas in their pods or 4 ounces shucked peas (120g shucked peas)", "8 ounces asparagus, woody ends removed, stalks cut on a sharp bias into 1-inch pieces (225g)", "6 ounces snap peas, strings removed, sliced on a sharp bias into 1/2-inch slices (170g)", "8 ounces broccolini, woody ends removed, cut on a sharp bias into 1-inch pieces (170g)", "1 tablespoon (15ml) fresh juice and 2 teaspoons (5g) finely grated zest from 1 lemon", "2 teaspoons Dijon mustard (10g)", "3 tablespoons extra-virgin olive oil (45ml), plus more for serving", "4 ounce arugula (115g; about 4 packed cups of leaves)", "3 ounces toasted sunflower seeds (85g)", "6 ounces fresh mozzarella cheese, cut or torn into 1/2-inch chunks (170g)", "8 ounces labne or Greek yogurt (225g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season cucumber slices with kosher salt and set in a fine mesh strainer or colander over the sink or a bowl. Set aside while you prepare the rest of the vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place red onions in a 1- to 2-quart container and cover with hot tap water. Set aside while you prepare the rest of the vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using fava beans and English peas in their pods, shuck the beans and peas from their pods, keeping them separate. Discard the pods. Bring a large pot of salted water to a boil and prepare an ice bath. Working with one vegetable at a time, blanch the favas, peas, asparagus, snap peas, and broccolini in the boiling water for 1 minute each, transfer to the ice bath to cool, then transfer to a paper towel-lined tray and pat dry. Remove and discard the skins from each individual fava bean. Set vegetables aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together lemon juice and mustard. Whisking constantly, slowly drizzle in olive oil. Season to taste with salt and pepper. Drain, rinse, and dry the cucumber and red onion. Add blanched vegetables, cucumber, onion, arugula, sunflower seeds, and mozzarella to the dressing, and toss to combine, adjusting seasoning with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, spread a spoonful of labne on the bottom of individual plates, or cover the bottom of a large serving platter with the labne. Drizzle the labne with olive oil, then pile the salad on top. Serve immediately.</p>"}]}