{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160101-carnitas-cochinita-pibil-sous-vide-recipe09.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Mexican", "keywords": ["carnita", "easy", "low carb", "Mexican", "pork", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5882352941176", "ratingCount": "17"}, "name": "Sous Vide Carnitas for Tacos (Crispy Mexican-Style Pulled Pork)", "link": "https://www.seriouseats.com/recipes/2017/01/sous-vide-carnitas-crispy-mexican-style-pulled-pork-recipe.html", "description": "I've said it before, and I'll say it again: <em>Carnitas</em> are the undisputed king of the taco cart. The Mexican answer to American pulled pork, at their best they're moist, juicy, and ultra porky, with the rich, tender texture of a French confit, and riddled with plenty of well-browned, crisp edges. At home, I've been making them for years using my <a href=\"http://www.seriouseats.com/recipes/2010/07/no-waste-tacos-de-carnitas-with-salsa-verde-recipe.html\">oven-based recipe</a>, and, while it's a fantastic and easy method, I'd venture to say it's even easier using a sous vide cooker. Here's how to do it.", "totalTime": "8 1/2 to 36 1/2 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Dairy-Free", "Gluten-Free", "Mains", "Mexican", "Pork", "Snacks", "Sous Vide", "The Food Lab"], "recipeIngredient": ["4 pounds (1.8kg) boneless pork shoulder, cut into 2-inch-thick slabs", "1 medium onion, roughly chopped", "6 medium cloves garlic", "1 stick cinnamon, broken into 3 to 4 pieces", "2 bay leaves", "1 medium orange, peel intact", "Kosher salt", "<strong>To Serve:</strong>", "Warm corn tortillas", "Lime wedges", "Chopped white onion and fresh cilantro leaves", "<a href=\"http://www.seriouseats.com/recipes/2016/01/charred-salsa-verde-tomatillo-salsa.html\">Charred Salsa Verde</a> or other salsa"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine pork, onion, garlic, cinnamon stick, and bay leaves in a large bowl. Split orange into quarters and squeeze juice into bowl before adding rest of orange. Season generously with kosher salt and toss to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer contents to a vacuum bag and seal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to cook, set sous vide cooker to desired temperature according to chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bag to sous vide bath and cook for recommended time according to chart above. Make sure to top water up occasionally as it evaporates, and keep bag completely submerged. If bag floats, weigh it down by placing a wet kitchen towel on top of it. Alternatively, <a href=\"http://www.seriouseats.com/2017/01/how-to-keep-sous-vide-bags-submerged.html\">use a heavy-duty binder clip</a> to attach a metal spoon or knife to bottom of bag as a weight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When meat is cooked, remove from water bath and transfer contents of bag to a large bowl. Pick out chunks of meat with a set of tongs and transfer them to a rimmed baking sheet. (Discard aromatics and excess liquid, or reserve liquid and blend it in with your salsa.) When it is cool enough to handle, shred meat roughly using 2 forks or your fingers. Spread evenly over baking sheet. Pork can be prepared up to this point and refrigerated in a sealed container for up to 5 days before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, adjust an oven rack to 3 inches below the broiler element and preheat broiler to high. Place pork under broiler and cook, using a spoon to flip pieces occasionally, until meat is browned and crisp on most sides, about 10 minutes total. Alternatively, working in batches, heat carnitas in a cast iron or nonstick skillet over medium heat, turning occasionally, until crisp, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve carnitas with warm tortillas, lime wedges, chopped onion and cilantro, and salsa.</p>"}]}