{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20170417-make-ahead-risotto-15.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["asparagus", "easy", "Italian", "mushroom", "rice", "risotto", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "Mushroom and Asparagus Risotto", "link": "https://www.seriouseats.com/recipes/2017/04/mushroom-asparagus-risotto-recipe.html", "description": "Turning a classic mushroom risotto into a mushroom and asparagus risotto is as easy as it sounds: just add asparagus. The only key is to add that asparagus right at the end for the best flavor and texture.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Asparagus", "Father's Day", "Italian", "Mains", "Mother's Day", "Mushrooms", "Rice", "Stovetop", "The Food Lab", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["1 quart <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock (1 liter)", "1 ounce (30g) dried porcini or morel mushrooms (optional)", "1 1/2 cups (about 300g) risotto rice, such as arborio or <em>vialone nano</em>", "1 1/2 pounds (700g) mixed mushrooms, such as shiitake, cremini, oyster, and chanterelle, trimmed and thinly sliced", "4 tablespoons (60ml) extra-virgin olive oil", "4 tablespoons (50g) unsalted butter", "Kosher salt and freshly ground black pepper", "1 medium yellow onion, finely chopped (about 6 ounces; 170g)", "2 medium cloves garlic, finely minced ", "2 teaspoons (10ml) soy sauce", "1 tablespoon (15ml) light miso paste", "3/4 cup (175ml) dry white wine", "1 pound trimmed asparagus, cut into 1-inch pieces (450g)", "1/4 cup (60ml) heavy cream (optional; see note)", "1 ounce (30g) finely grated Parmigiano-Reggiano cheese, plus more for serving", "2 tablespoons minced fresh parsley leaves (about 8g)", "2 tablespoons minced fresh tarragon leaves (about 8g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the chicken stock and dried mushrooms (if using) in a microwave-safe container and microwave on high power until simmering, about 5 minutes. Remove from microwave. Using a slotted spoon, transfer rehydrated mushrooms to a cutting board and roughly chop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rice to chicken stock and stir with a wooden spoon to release starch. Strain through a fine-mesh strainer set over a 2-quart liquid cup measure or large bowl. Allow to drain well, shaking rice of excess liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil and butter in a heavy 12-inch sauté pan over medium-high heat swirling, until foaming subsides. Add fresh mushrooms, season with salt and pepper, and cook, stirring occasionally, until excess moisture has evaporated and mushrooms are well browned, about 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion, garlic, and chopped rehydrated mushrooms (if using) and cook, stirring frequently, until onions are softened and aromatic, about 4 minutes. Add rice and cook, stirring, until rice is evenly coated in oil and toasted but not browned, 3 to 4 minutes. (Rice grains should start to look like tiny ice cubes: translucent around the edges and cloudy in the center.) Stir in soy sauce and miso paste until evenly incorporated. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and cook, stirring, until raw alcohol smell has cooked off and wine has almost fully evaporated, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Give reserved stock a good stir and pour all but 1 cup over rice. Add a large pinch of salt, increase heat to high, and bring to a simmer. Stir rice once, making sure no stray grains are clinging to the side of the pan above the liquid. Cover and reduce heat to lowest possible setting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook rice for 10 minutes undisturbed. Stir once, shake pan gently to redistribute rice, cover, and continue cooking until liquid is mostly absorbed and rice is tender with just a faint bite, about 5 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid. Stir remaining 1 cup of stock to distribute starch, then stir into rice. Increase heat to high, add asparagus, and cook, stirring and shaking rice constantly until asparagus is tender-crisp and rice is thick and creamy; add more stock or water as necessary if risotto becomes too thick and dry. Off heat, add cheese and stir rapidly to thoroughly incorporate. Fold in heavy cream, if using. Season with salt and stir in the herbs. Serve immediately on hot plates, passing more cheese and olive oil at the table.</p>"}]}