{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/10/20170922-french-lentils-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["bean", "French", "legume", "lentil", "side"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Easy French Lentils With Garlic and Herbs", "link": "https://www.seriouseats.com/recipes/2017/11/basic-french-lentil-recipe.html", "description": "With the right technique, these simple, earthy lentils shine bright with layers of complex flavor. The secret is using the right aromatics and herbs, and then enriching it all with butter and vinegar.", "totalTime": "45 minutes", "recipeYield": "Serves 4 to 6 as a side", "recipeCategory": ["Beans and Pulses", "French", "Other Vegetables", "Sides", "Stovetop", "Vegetarian"], "recipeIngredient": ["<strong>For the Lentils:</strong>", "1 cup (7 ounces/200g) French Le Puy Lentils, picked over for stones", "1 medium carrot, trimmed and peeled", "1 medium yellow onion, halved through the root", "1 medium rib celery", "2 medium cloves garlic", "2 or 3 sprigs rosemary, thyme, or sage (or some combination)", "Kosher salt", "<strong>To Finish:</strong>", "2 tablespoons unsalted butter", "1/2 pound (225g) very finely diced combination of shallot, carrot, celery, and turnip (from about 3/4 pound/340g total vegetables)", "Red wine vinegar, to taste", "Kosher salt and freshly ground black pepper", "Small handful minced flat-leaf parsley leaves and tender stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Lentils:</strong> In a large saucepan, combine lentils with carrot, onion, and celery. Tie garlic cloves and herbs into a cheesecloth sachet and add to pot. Cover lentils with at least 2 inches of water, season generously with salt (the water should taste as salty as you like your food to be), and set over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a simmer, then reduce heat to medium-low and cook at a bare simmer until lentils are just tender enough that you can smash one against the roof of your mouth with your tongue, about 25 minutes (begin checking around 15 minutes, then continue checking until lentils are perfectly cooked).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add a handful of ice cubes or a generous splash of cold water to the bean pot to lower the water's temperature and halt cooking. The lentils can be refrigerated in their cooking liquid at this point for up to 2 days before continuing with recipe. Discard carrot, onion, celery, and herb sachet before continuing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> In a large saucepan, melt butter over medium heat until foaming. Add finely diced vegetables and cook, stirring, until barely tender, about 2 minutes. Add drained lentils along with just enough of their cooking liquid (about 1/4 cup) to moisten slightly. Bring to a simmer, then cook until lentils are heated through and enough liquid has evaporated that the lentils are coated in a creamy glaze.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add vinegar 1 teaspoon at a time until the lentils have a pleasant bright flavor (it should taste like a light contrasting tang, but not strongly sour).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season with salt and pepper. Stir in parsley and serve warm.</p>"}]}