{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20170124-Baked-Brie-Apple-Compote-1-matt-emily-clifton.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "", "keywords": ["appetizer", "apple", "Bake", "brie", "cheese", "party", "pear", "snack", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8571428571429", "ratingCount": "7"}, "name": "Baked Brie en Croûte With Apple and Pear Compote", "link": "https://www.seriouseats.com/recipes/2017/01/baked-brie-en-croute-puff-pastry-apple-pear-jam-recipe.html", "description": "Offering maximum impact with minimal effort, a baked Brie turns a mild-mannered cheese into the superhero of a gathering: a warm, gooey communal comfort food. This version wraps the cheese in a shell of flaky puff pastry, along with two sweet-tart layers of apple-pear compote.", "totalTime": "1 hour 30 minutes (or 2 hours, if re-chilling is needed)", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Apple", "Baking", "Cheese", "Christmas", "Fall", "Pear", "Seasonal and Holiday", "Snacks", "Vegetarian", "Videos", "Winter"], "recipeIngredient": ["1 tablespoon (15g) unsalted butter", "1 apple, peeled, cored, and cut into 1/2-inch dice", "1 pear, peeled, cored, and cut into 1/2-inch dice", "1/4 cup (60g) sugar", "1 small cinnamon stick (or 1/2 teaspoon ground cinnamon)", "1/4 teaspoon ground ginger", "1/8 teaspoon ground cardamom", "1 (6- to 8-ounce; 170 to 225g) round Brie or Camembert cheese, slightly chilled (see note)", "All-purpose flour, for dusting", "10-inch square puff pastry dough, kept cold, rolled out to 1/4-inch thickness", "1 egg beaten with 1 tablespoon (15ml) water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a medium saucepan over medium heat, add butter, and swirl until melted. Add apple and pear and cook, stirring occasionally, until fruit is tender and has released most of its liquid, 5 to 7 minutes. Stir in sugar, cinnamon stick or ground cinnamon, ginger, and cardamom and cook, stirring occasionally, until most of the liquid has evaporated, 12 to 15 minutes longer. Discard cinnamon stick, if used. Remove from heat and let compote cool to room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F (190&deg;C). Line a baking sheet with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a sharp knife, cut cheese in half horizontally (through the middle). Lay one half on a work surface, cut side up, and spread 3 tablespoons (45ml) of compote evenly over it. Place second half on top and spread another 3 tablespoons (45ml) compote over it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place puff pastry on a lightly floured work surface and roll to an even 1/4-inch thickness. Set prepared cheese in center of square, fold dough up and over, and pleat it together on top to enclose cheese. Gently pinch dough together in center to seal gathered pleats. You can tie a bit of kitchen twine on top to hold pleats together if you like, but this is not essential. If dough is no longer cold, chill wrapped cheese for at least 20 minutes. (Cheese can be wrapped tightly with plastic wrap and refrigerated until ready to bake.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set prepared cheese wheel on prepared baking sheet. Brush dough evenly with egg wash. Bake until pastry is crisp and golden brown all over, 25 to 35 minutes. Let rest 5 minutes, then transfer to a platter. Serve any remaining compote alongside.</p>"}]}