{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/02/20170111-radicchio-risotto-vicky-wasik-17.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["chicory", "Italian", "nut", "radicchio", "rice", "risotto", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Veneto-Style Radicchio Risotto With Walnuts and Blue Cheese", "link": "https://www.seriouseats.com/recipes/2017/03/radicchio-risotto-blue-cheese-walnuts-thyme-veneto-recipe.html", "description": "This classic risotto dish from the Veneto region of Italy is made by cooking shredded radicchio into the rice, along with wine, cheese, and shallots. This version is topped with a combination of toasted walnuts, thyme, and blue cheese.", "totalTime": "40 minutes", "recipeYield": "Makes 4 servings", "recipeCategory": ["Fall", "Italian", "Mains", "Mother's Day", "Other Vegetables", "Rice", "Stovetop", "Valentine's Day", "Vegetarian", "Winter"], "recipeIngredient": ["2 cups risotto rice (14 ounces; 400g), such as <em>carnaroli</em>", "4 cups (945ml) homemade <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">chicken</a> or <a href=\"http://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable</a> stock, or low-sodium store-bought broth (see note)", "5 tablespoons unsalted butter or extra-virgin olive oil (75g; 75ml), divided (see note)", "2 large shallots (about 5 ounces; 140g total), minced", "1 cup (235ml) dry red or white wine", "1 cup walnut halves (3 ounces; 85g), crushed by hand", "1 teaspoon minced fresh thyme leaves", "Kosher salt", "1 (7-ounce; 200g) head radicchio, quartered, cored, and thinly sliced", "Freshly ground black or white pepper", "1 1/2 ounces (40g) freshly grated Parmigiano-Reggiano cheese, plus more for garnish (see note)", "Crumbled sharp but creamy blue cheese, such as Gorgonzola, for garnish (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine rice and stock. Agitate rice with fingers or a whisk to release starch. Strain through a fine-mesh strainer set in a large liquid cup measure or in another large bowl. Allow to drain 5 minutes, stirring rice occasionally. Reserve starchy stock liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 3 tablespoons butter or oil (45g; 45ml) in a heavy saucepan over medium-high heat until foaming (if butter) or shimmering (if oil). Add rice and cook, stirring and tossing frequently, until all liquid has evaporated and rice has begun to take on a golden-blond color and nutty aroma, about 5 minutes. Add shallots and continue to cook, stirring frequently, until softened, about 1 minute. Add wine and cook, stirring, until mostly evaporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir reserved stock well, then pour all but 1 cup over rice. Increase heat to high and bring to a simmer. Stir rice once, cover, and reduce heat to lowest possible setting. Cook rice for 10 minutes undisturbed, then stir once, shaking pan gently to redistribute rice. Cover and continue cooking until liquid is mostly absorbed and rice is tender with just a faint bite, about 10 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a small skillet, heat remaining 2 tablespoons butter or oil (30g; 30ml) over medium heat until melted or shimmering. Add walnuts and cook, tossing frequently, until they smell toasted and nutty, about 2 minutes. Add thyme and toss well. Season with salt and remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove lid from rice and add remaining 1 cup stock, along with radicchio. Increase heat to high and cook, stirring and shaking rice constantly, until thick and creamy. (If rice is too thick, thin with small additions of water or stock.) Season with salt and pepper. Remove from heat and stir in grated Parmigiano-Reggiano. Spoon risotto onto warmed plates and top with walnut mixture, more grated cheese, and bits of crumbled blue cheese. Serve right away.</p>"}]}