{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20161022-chicken-scarpariello-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["chicken", "easy", "Italian", "italian american", "One Pot Wonder", "sausage", "skillet", "sweet and sour"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6428571428571", "ratingCount": "14"}, "name": "Chicken Scarpariello (Braised Chicken With Sausage and Peppers)", "link": "https://www.seriouseats.com/recipes/2017/01/chicken-scarpariello-sweet-and-sour-chicken-italian-recipe.html", "description": "Chicken <em>scarpariello</em>, the Italian-American dish of chicken braised with sausage and peppers in a sweet-and-sour sauce, is one of those perfect Tuesday-night meals. It's punchy, it's not for the timid, but it's ultimately very easy to make, requiring just a single sauté pan or Dutch oven, about 25 minutes on the stovetop, and a half hour in the oven.", "totalTime": "55 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Braising and Stewing", "Chicken", "Fall", "Gluten-Free", "Italian", "Mains", "Quick Dinners", "Winter"], "recipeIngredient": ["2 1/2 pounds (1.15kg) bone-in, skin-on chicken thighs (6 to 8 thighs)", "Kosher salt and freshly ground black pepper", "1 tablespoon (15ml) vegetable oil", "3 to 4 links sweet or hot Italian sausage (about 1 1/2 pounds; 700g)", "1 medium onion, thinly sliced (about 6 ounces; 170g)", "1 large red bell pepper, thinly sliced (about 6 ounces; 170g)", "2 tablespoons finely minced fresh sage leaves (about 1/4 ounce; 8g)", "6 cloves garlic, thinly sliced", "8 hot or sweet <a href=\"https://www.amazon.com/Mezzetta-Sweet-Cherry-Peppers-16/dp/B00MN3GAMY/?tag=serieats-20\">pickled cherry peppers</a>, thinly sliced, along with 1/4 cup (60ml) pickling liquid from the jar", "1 cup (240ml) dry white wine", "1 cup (240ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "2 tablespoons (28g) sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to center position and preheat oven to 350&deg;F (175&deg;C). Season chicken generously with salt and pepper. Heat oil in a 4- to 5-quart straight-sided sauté pan or Dutch oven over medium-high heat until shimmering. Add chicken, skin side down, and cook, without moving, until well browned and crisp, about 8 minutes total, lowering heat if pan starts to smoke excessively. Flip chicken and brown lightly on second side, about 3 minutes. Transfer chicken to a large plate and set aside.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return skillet to heat without draining it and add sausage. Cook until well browned on first side, about 1 1/2 minutes, reducing heat if it starts smoking. Flip sausage and cook on second side until browned, about 1 1/2 minutes longer. Remove pan from heat, transfer sausage to a cutting board, and cut each link into 3 to 4 slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return pan to heat, add onion and bell pepper, and cook, stirring and scraping up browned bits with a wooden spoon, until softened and starting to brown, about 4 minutes. Add sage and garlic, stir to combine, and cook until fragrant, about 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add pickled cherry peppers and their liquid, stirring and scraping up browned bits from bottom of pan with a wooden spoon. Add wine and cook until liquid is reduced by half, about 2 minutes. Add chicken stock and sugar and stir to combine. Return sausage to pan, toss to combine, then return chicken pieces to pan skin side up, nestling them down among sauce, vegetables, and sausage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to oven and cook until chicken is crisp and tender, about 30 minutes. Serve immediately, spooning sauce, vegetables, and sausage around chicken pieces.</p>"}]}