{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20170125_braised_short_ribs_1-emily-matt-clifton.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "Chinese", "keywords": ["Asian", "beef", "braise", "Chinese", "fall", "low carb", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4285714285714", "ratingCount": "7"}, "name": "Braised Chinese-Style Short Ribs With Soy, Orange, and 5-Spice Powder", "link": "https://www.seriouseats.com/recipes/2017/02/braised-beef-short-ribs-honey-soy-orange-recipe.html", "description": "These braised beef short ribs are layered with complex Chinese flavors, including soy, orange, five-spice powder, ginger, and more. Serve them on mashed potatoes one day; shred the meat and fold it into awesome tacos the next.", "totalTime": "3 hours 45 minutes (or up to 8 hours 45 minutes, if using a slow cooker)", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Beef", "Beef Stew", "Braising and Stewing", "Chinese", "Fall", "Mains", "Mother's Day", "Slow Cooker", "Valentine's Day", "Winter"], "recipeIngredient": ["5 pounds (2.25kg) beef short ribs (see note)", "Kosher salt and freshly ground black pepper", "2 tablespoons (30ml) neutral oil, such as vegetable or canola", "1 large yellow onion, chopped (about 1 1/2 cups)", "3 tablespoons peeled and grated fresh ginger (from about one 3-inch knob)", "6 large cloves garlic, roughly chopped", "1 tablespoon (12g) Chinese five-spice powder ", "Zest of 2 oranges, one in wide strips, one finely grated, divided", "1/2 cup (120ml) fresh juice from about 2 medium oranges, divided", "1/2 cup (120ml) Shaoxing rice wine (or dry sherry)", "1 cup (240ml) low-sodium soy sauce", "1/4 cup (60ml) unseasoned rice wine vinegar", "1/2 cup (120ml) honey", "2 tablespoons (30ml) <em>sambal</em> chili paste or Chinese chili-garlic sauce", "1/4 cup (60ml) hoisin sauce", "3 1/2 cups (830ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock or water, plus more as needed", "1 1/2 tablespoons (18g) cornstarch mixed with 1 1/2 tablespoons (20ml) cold water", "3 scallions, white and light green parts only, thinly sliced, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (177&deg;C). Alternatively, plug in a slow cooker.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat short ribs dry with clean towels. Lightly season short ribs on both sides with salt and more generously with black pepper. Heat oil in a Dutch oven over medium-high heat until shimmering. Add short ribs in a single layer, working in batches if necessary to avoid crowding the pot. Brown well on all sides, then transfer to a plate and set aside. Pour off all but 2 tablespoons (30ml) fat from Dutch oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion, ginger, garlic, and five-spice powder to Dutch oven and cook over medium-high heat, stirring, until onions are slightly softened and fragrant, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add strips of orange zest and 1/4 cup (60ml) orange juice along with rice wine or sherry, soy sauce, rice wine vinegar, honey, chili paste, hoisin, and chicken stock or water. Stir to combine. Return ribs to Dutch oven along with any accumulated juices. (Alternatively, add ribs, vegetables, and liquid to slow cooker.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using a Slow Cooker:</strong> Set slow cooker to high and cook until meat is tender and frees easily from bones, 6 to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using a Dutch Oven:</strong> Bring contents to a boil, cover, and transfer to oven. Cook until short ribs are tender, about 3 hours. Check periodically during cooking process and add more stock or water if needed. Remove lid during the last 20 minutes of cooking. The meat should be very tender but not completely falling apart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When meat is cooked, remove ribs and keep warm in a serving dish. Strain braising liquid into a fat separator (or strain braising liquid, then spoon off as much fat as possible), then pour strained, defatted sauce back into pot. Discard aromatic vegetables. Stir in remaining 1/4 cup (60ml) orange juice. You should have about 3 cups (720ml) total braising liquid; if not, simmer until reduced to 3 cups. Whisk in just enough of cornstarch mixture to slightly thicken sauce, adding it in 1-tablespoon increments (you may not need the whole amount).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return short ribs and reduced sauce to Dutch oven, coating short ribs well with sauce. Sprinkle with scallions and remaining grated orange zest and serve with <a href=\"http://www.seriouseats.com/2010/11/how-to-make-mashed-potatoes-thanksgiving-sides-fluffy-creamy.html\">mashed potatoes</a> or <a href=\"http://www.seriouseats.com/2015/05/how-to-make-the-best-polenta.html\">polenta</a>. Leftover ribs can be reheated before serving, or meat can be boned, shredded, tossed with braising liquid, and folded into tacos.</p>"}]}