{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/06/Chilaquiles__20170531_3.jpeg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "Mexican", "keywords": ["breakfast", "brunch", "egg", "Mexican", "salsa", "tomatillo", "tortilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chorizo and Egg Chilaquiles With Salsa Verde", "link": "https://www.seriouseats.com/recipes/2017/06/chorizo-egg-salsa-verde-chilaquiles-recipe.html", "description": "Tortilla chips don't get enough respect. Most often bought in bag form and eaten as a snack, their potential to form part of a tasty meal is overlooked. Combine home-fried chips, salsa verde, spicy chorizo, and eggs, then serve it up with fresh radishes and vinegary pickled onions, and you have yourself a chilaquiles dish that'll make you think twice the next time you're tempted in the snack aisle.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Breakfast and Brunch", "Easter", "Eggs", "Father's Day", "Mains", "Mexican", "Mother's Day", "Quick Dinners", "Salsa", "Stovetop"], "recipeIngredient": ["Vegetable, canola, or peanut oil, for frying and sautéing", "16 soft corn tortillas, cut into 6 wedges each", "Kosher salt", "1/2 pound (225g) fresh Mexican chorizo, casing removed, if necessary", "2 cups (475ml) Mexican salsa verde, <a href=\"http://www.seriouseats.com/recipes/2013/02/basic-salsa-verde-mexican-tomatillo-recipe.html\">homemade</a> or store-bought", "1 cup (240ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> chicken stock or low-sodium chicken broth or water", "4 large eggs", "1/2 cup (60g) shredded Monterey Jack cheese or crumbled <em>cotija</em> cheese", "1/2 cup (120ml) Mexican crema or sour cream", "<a href=\"http://www.seriouseats.com/recipes/2016/07/quick-pickle-rapid-pickled-onion-recipe.html\">Rapid-pickled red onions</a>, for garnish", "4 radishes, thinly sliced", "1/4 cup chopped fresh cilantro leaves, for garnish", "Sliced limes, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat about 3 inches of vegetable oil to 375&deg;F in a in a large Dutch oven, wok, or deep fryer. Adjust flame to maintain temperature. Line a large rimmed baking sheet with paper towels. Working in batches to avoid crowding the oil, fry tortilla wedges, using a metal spider to agitate and turn them as they cook. Cook until bubbling slows to a trickle, chips are pale golden brown and very crisp, about 3 minutes per batch. Transfer to the baking sheet and immediately season with kosher salt. Repeat with remaining batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat broiler to high heat and set an oven rack 6 or 7 inches from flame. In a large (12-inch) straight-sided sauté pan or cast iron skillet, heat 1 tablespoon oil over medium-high heat. Add chorizo and cook, crumbling with a wooden spoon, until brown and cooked through. Using a slotted spoon, transfer chorizo to a plate and set aside. Drain all but 1 tablespoon fat from skillet. Add salsa verde and chicken broth and heat over medium heat until simmering. Add three-quarters of the chips and toss gently to coat. Cover and set aside while you make the eggs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large non-stick pan, cook 4 eggs until whites are set but yolks are still runny, about 3 minutes. Season with salt. Transfer to a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the remaining tortilla chips to the chilaquiles pan and season to taste with salt if necessary. Sprinkle with cheese and the reserved crumbled chorizo. Broil until cheese is melted (if using Jack) and the tops of a few of the tortillas brown, 1 to 3 minutes (if using cotija, the cheese won't melt well, so you can skip this broiling step). Divide onto plates or serve family-style from the skillet, topping with fried eggs, sour cream, pickled red onions, sliced radishes, and cilantro. Serve immediately with lime wedges, for squeezing.</p>"}]}