{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160515-garlic-focaccia-recipe-01.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["Bake", "bread", "easy", "focaccia", "garlic", "garlic bread", "Italian", "italian american", "no-knead bread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "8"}, "name": "Easy Roasted-Garlic Focaccia", "link": "https://www.seriouseats.com/recipes/2017/04/easy-roasted-garlic-focaccia-no-knead-bread-recipe.html", "description": "This garlic focaccia is a riff on garlic bread, complete with roasted garlic cloves studded throughout and garlic butter brushed across the top. It takes only a few minutes of real work and produces soft, tender, chewy focaccia that's as good as any you've tasted.", "totalTime": "At least 12 hours and up to 28 hours", "recipeYield": "Makes 1 (12-inch) loaf of focaccia, serving 6 to 8", "recipeCategory": ["Baking", "Garlic", "Italian", "Sides", "Thanksgiving", "Vegetarian", "Yeast Bread"], "recipeIngredient": ["<strong>For the Focaccia:</strong>", "1 whole head garlic", "5 tablespoons (75ml) extra-virgin olive oil, divided", "Kosher salt, for seasoning", "500g all-purpose or bread flour (17 1/2 ounces; about 3 1/4 cups)", "15g kosher salt (1/2 ounce; about 1 tablespoon)", "4g instant yeast (0.15 ounce; about 1 teaspoon)", "325g water (11 1/2 ounces; about 1 1/2 cups minus 1 tablespoon)", "<strong>For the Garlic Butter:</strong>", "2 tablespoons (30g) unsalted butter", "2 teaspoons dried oregano", "1/2 teaspoon red pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Focaccia:</strong> Adjust oven rack to center position and preheat oven to 350&deg;F (180&deg;C). Remove 4 cloves garlic from head and set aside. Place remaining head in the center of a sheet of aluminum foil. Drizzle with 1 tablespoon (15ml) olive oil and season with salt. Wrap tightly with foil and place in an oven-safe cast iron, carbon steel, or stainless steel skillet, then transfer to oven. Roast until garlic is completely tender, about 1 hour. Remove from oven and refrigerate until ready to use the next day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, salt, yeast, and water in a large bowl. (To account for rising, the bowl should be at least 4 to 6 times the volume of the dough.) Mix with hands or a wooden spoon until no dry flour remains. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover bowl tightly with plastic wrap, making sure that edges are well sealed, then let rest on the countertop for at least 8 hours and up to 24 hours. Dough should rise dramatically and fill bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 3 tablespoons (45ml) olive oil to a 12-inch cast iron skillet or large cake pan. Transfer dough to pan by tipping it out of the bowl in one large blob. Turn dough to coat in oil. Using a flat palm, press dough around skillet, flattening it slightly and spreading oil around the entire bottom and sides of pan. Cover tightly with plastic wrap and let dough stand at room temperature for 2 hours. After the first hour, adjust oven rack to middle position and preheat oven to 550&deg;F (290&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At the end of the 2 hours, dough should mostly fill skillet, up to its edge. Use your fingertips to press it around until it fills every corner, popping any large bubbles that appear. Lift up one edge of dough to let any air bubbles underneath escape. Repeat, moving around dough, until no air bubbles are left underneath and dough is evenly spread around skillet. Peel roasted garlic cloves and break up large cloves into 2 or 3 pieces each. Scatter roasted garlic evenly over surface of dough, then push down on each clove until it is embedded in a deep well of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer skillet to oven and bake until top is golden brown and bubbly and bottom appears golden brown and crisp when you lift it with a thin spatula, 16 to 24 minutes. If bottom is not as crisp as desired, place pan on a burner and cook over medium heat, moving pan around to cook evenly, until bottom of focaccia is crisp, 1 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, Make the Garlic Butter:</strong> Mince 4 reserved raw cloves of garlic. Combine remaining 1 tablespoon (15ml) olive oil with butter in a small skillet and melt over medium-low heat. Add garlic, oregano, and pepper flakes and cook, stirring, until fragrant and garlic is just beginning to brown, about 1 minute. Transfer to a small bowl and season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When focaccia has finished baking, spread garlic butter over top with a spoon. Transfer to a cutting board, allow to cool slightly, slice, and serve. Extra bread should be stored in a brown paper bag at room temperature for up to 2 days. Reheat in a 300&deg;F (150&deg;C) oven for about 10 minutes before serving.</p>"}]}