{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20170109-oven-roasted-grapes-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["Bake", "fruit", "grape", "raisin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Oven-Dried Grapes (a.k.a. Raisins)", "link": "https://www.seriouseats.com/recipes/2017/02/oven-dried-grapes-raisins-recipe.html", "description": "It may seem ridiculous to dry your own grapes in the oven, but doing so gives you much more control over the result and opens up a range of flavor and texture possibilities. The homemade kind can come out plumper and juicier, with a flavor that's truer to that of a fresh grape, only more intense. Toss them into baked goods like muffins, serve them on a cheese board at a party, or make them a regular addition to salads.", "totalTime": "4 hours (see note)", "recipeYield": "Makes about 1 1/2 cups", "recipeCategory": ["Baking", "Fall", "Gluten-Free", "Grapes", "Snacks", "Vegetarian"], "recipeIngredient": ["3 large bunches seedless grapes, preferably mixed colors, stemmed", "Vegetable or canola oil, for greasing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 225&deg;F (110&deg;C). Very lightly grease 2 rimmed baking sheets with oil, then scatter grapes all over. Bake, checking periodically for doneness, until grapes are nicely shriveled and semi-dried but still slightly plump, about 4 hours (see note). (The exact time will depend on your grapes, your oven, and your preferred degree of dryness.) Let cool. Use a thin metal spatula to free any grapes that are stuck to the baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The dried grapes can be refrigerated in a sealed container for about 3 weeks. (How long they keep will also depend on their degree of dryness; drier grapes will keep longer.)</p>"}]}