{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/08/20170729-whole-wheat-pie-crust-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "crust", "dough", "pastry", "pie", "whole wheat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Flaky, Tender, and Nutty Whole Wheat Pie Crust", "link": "https://www.seriouseats.com/recipes/2017/08/whole-wheat-pie-crust-recipe.html", "description": "Whole wheat flour makes this flaky crust especially tender, with the nutty, toasted aroma of whole wheat bread. Its heartiness is perfect for savory applications like chicken pot pie and quiche, but it's graham-like flavor is an excellent match for fall fruit pies like apple and pear.", "totalTime": "2 1/2 hours", "recipeYield": "Makes 2 single- or 1 double-crusted 9-inch pie (regular or deep-dish)", "recipeCategory": ["Pastry", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["4 ounces all-purpose flour (about 1 cup minus 1 tablespoon; 110g)", "4 ounces whole wheat flour (about 1 cup minus 1 tablespoon; 115g), plus more for dusting", "1/2 ounce sugar (1 tablespoon; 15g)", "1 teaspoon (4g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "6 ounces unsalted butter (about 12 tablespoons; 170g), cold", "5 ounces cold tap water (1/2 cup plus 2 tablespoons; 140g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Whisk all-purpose flour, whole wheat flour, sugar, and salt together in a medium bowl. Cut butter into 1/2-inch cubes (this size is important, as smaller pieces will melt too fast) and toss with flour mixture to break up the pieces. Using your fingertips, smash each cube flat&mdash;that's it! No rubbing or cutting. Stir in water, then knead dough against the sides of the bowl until it comes together in a shaggy ball. Dough temperature should register between 65 and 70&deg;F (18 and 21&deg;C); if not, refrigerate briefly before rolling and folding (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Make the Layers:</strong> On a generously floured work surface, roll dough into a roughly 10- by 15-inch rectangle. Fold the 10-inch sides to the center, then close the newly formed packet like a book. Fold in half once more, bringing the short sides together to create a thick block. Divide in half with a sharp knife or bench scraper. Dough temperature should still be somewhere between 65 and 70&deg;F (18 and 21&deg;C); if not, refrigerate briefly before proceeding (see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Single-Crusted Pies:</strong> Using as much flour as needed for dusting, roll one piece into a 14-inch circle and drape across a 9-inch pie plate; it will be super easy to lift by hand. Dust off excess flour with a pastry brush, using it to nestle dough into the very corners of the pan. With scissors or kitchen shears, trim the edge so that it overhangs by 1 1/4 inches all around. Fold overhang over itself to create a thick border that sits atop the rim of the pan. Crimp or shape crust as desired. Repeat with remaining dough. Wrap with plastic and refrigerate at least 2 hours and up to overnight. Use as directed in your favorite recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For a Double-Crusted Pie:</strong> Using as much flour as needed for dusting, roll one piece into a 14-inch circle and drape across a 9-inch pie plate; it will be super easy to lift by hand. Dust off excess flour with a pastry brush, using it to nestle dough into the very corners of the pan. With scissors or kitchen shears, trim the edge so that it overhangs by 1 inch all around. For a solid top crust, roll remaining dough as before, or roll into a 9- by 15-inch rectangle for a lattice-top pie. Transfer the entire sheet, uncut, to a baking sheet or parchment-lined cutting board. (The parchment will prevent dough from absorbing any savory odors from the board.) Wrap both portions in plastic and refrigerate at least 2 hours and up to overnight. Use as directed in your favorite recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For a Blind-Baked Pie:</strong> Adjust oven rack to lower-middle position and preheat to 350&deg;F (177&deg;C). Line chilled pie shell with a large sheet of aluminum foil, pressing so it conforms to the curves of the plate (a second sheet of aluminum may be needed for full coverage). Fill to the brim with sugar, transfer to a half sheet pan, and bake until fully set and golden around the edges, 60 to 75 minutes. Fold long sides of foil toward the middle, gather short sides, and use both hands to carefully transfer sugar to a heat-safe bowl. Let sugar cool to room temperature. If needed, continue baking crust a few minutes more to brown along the bottom. A full explanation of this process can be found <a href=\"http://www.seriouseats.com/2016/10/how-to-blind-bake-a-pie-crust.html\">here</a>.</p>"}]}