{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/04/20170410-coffee-cake-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "breakfast", "cake", "coffee cake", "crumb", "crumble", "easy", "greek yogurt", "streusel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "14"}, "name": "Easy One-Bowl Coffee Cake", "link": "https://www.seriouseats.com/recipes/2017/05/easy-coffee-cake-recipe.html", "description": "Greek yogurt produces a remarkably tender crumb in this no-fuss, one-bowl coffee cake, while a touch of cardamom opens up the aromas of both cinnamon and coffee.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes enough for about 12 pieces", "recipeCategory": ["Baking", "Breakfast and Brunch", "Cakes", "Christmas", "Easter", "Father's Day", "Mother's Day", "Pastry", "Snacks"], "recipeIngredient": ["<strong>For the Topping:</strong>", "4 ounces light brown sugar (about 1/2 cup, packed; 115g)", "2 1/2 ounces whole wheat flour (about 1/2 cup, spooned; 70g)", "1 tablespoon (5g) ground cinnamon", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "Shy 1/4 teaspoon ground cardamom", "2 ounces unsalted butter (about 4 tablespoons; 55g), soft, about 70°F (21°C)", "<strong>For the Coffee Cake:</strong>", "14 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">quick-toasted</a> sugar (2 cups; 395g)", "6 ounces unsalted butter (about 12 tablespoons; 170g), about 65°F (18°C)", "4 teaspoons baking powder", "1 teaspoon (4g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1/2 ounce vanilla extract (1 tablespoon; 15g)", "3 large eggs, brought to about 65°F (about 5 1/4 ounces; 150g), see note", "12 ounces all-purpose flour, such as Gold Medal (about 2 2/3 cups, spooned; 340g)", "14 ounces plain Greek yogurt (about 1 3/4 cup; 395g), any percentage will do, brought to about 65°F (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Topping:</strong> In the bowl of a stand mixer fitted with a paddle attachment, combine brown sugar, whole wheat flour, cinnamon, salt, cardamom, and butter. Mix on low speed until sandy and well combined. Scrape onto a large plate or sheet of parchment. Alternatively, the crumb topping can be transferred to an airtight container and refrigerated for up to one week, or frozen for six months. Wipe bowl and paddle with a paper towel and proceed to the next step&mdash;no need to wash!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Coffee Cake:</strong> Adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). In the bowl of a stand mixer fitted with a paddle attachment, combine sugar, butter, baking powder, salt, and vanilla. Mix on low to moisten, then increase speed to medium and cream until soft and light, about 10 minutes. Pause to scrape bowl and beater with a flexible spatula, then resume mixing on medium speed. Add eggs one at a time, allowing each to fully incorporate before adding the next. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape bowl and beater with a flexible spatula, then resume mixing on low. Sprinkle in about 1/3 of flour, then add 1/3 of Greek yogurt. Repeat with remaining flour and yogurt, working in thirds as before. Fold batter once or twice with a flexible spatula, then scrape into a parchment-lined 9- by 13- by 2-inch anodized-aluminum baking pan. Spread in an even layer, then cover with prepared topping, a handful at a time, squeezing each addition in your palm to help form streusel nuggets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until coffee cake is puffed and firm, about 40 minutes (a toothpick inserted into the center should emerge with a few moist crumbs). Cool cake directly in pan about 30 minutes before serving, as it will be soft and gummy until its crumb has had a chance to set. Cut into squares with a butter knife and lift parchment to help fit an angled spatula under the first slice. To keep coffee cake as fresh as possible, cut only as much as you plan to serve at one time. With plastic wrap or wax paper pressed against cut surface, and top of pan covered with a sheet of aluminum foil, leftovers will keep up to 3 days at room temperature. </p>"}]}