{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/10/20171015-toast-and-eggs-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["baby", "breakfast", "egg", "toast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Nested Egg-in-a-Hole for 1 1/2 Eaters", "link": "https://www.seriouseats.com/recipes/2017/11/nested-egg-in-the-hole-for-1-12-eaters.html", "description": "Teeny-tiny portions of food, like this egg and toast dish, are about as cute as baby teeth are sharp (that is to say, very). Even better, this recipe can make an adult-size portion with the same piece of bread.", "totalTime": "15 minutes", "recipeYield": "Serves 1 parent and 1 infant", "recipeCategory": ["Bread", "Breakfast and Brunch", "Eggs", "Mother's Day", "Stovetop"], "recipeIngredient": ["1 slice of high-quality sandwich bread, such as <em>shokupan</em>", "1 tablespoon (12g) unsalted butter, divided", "1 chicken egg", "1 quail egg (see note)", "Kosher salt, black pepper, and herbs (such as chives) as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a cast iron or non-stick griddle or skillet over medium-low heat for 5 minutes. Meanwhile, cut a circular hole out of the center of the slice of bread using a biscuit cutter or empty jar that leaves about 1/2-inch clearance on the sides. Set the slice of bread with the hole missing aside. Using a smaller biscuit cutter or empty jar, cut a smaller hole inside the circular piece of bread. You should now have three pieces of bread: a large rectangle with a circle missing, a circle with a smaller circle missing, and a very small circle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half the butter to the skillet or griddle, spread it around, then add the bread. Cook, moving the bread around occasionally, until the bottom side is golden brown, about 4 minutes. Slide the bread to the side of the griddle or set it aside on a plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the remaining butter and spread it around. Return the bread to the butter with the browned-side-up. Crack a chicken egg into the large hole and a quail egg into the smaller hole. Season both with salt. Cover with a domed lid and cook until the bottom is browned and the top has barely set. Alternatively, cook uncovered until the bottom is browned, then carefully flip the egg and toast to cook the egg through.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season to taste with black pepper and herbs, and serve immediately.</p>"}]}