{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/05/20161104-swiss-meringue-buttercream-vicky-wasik-step1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "butter", "buttercream", "cake", "egg white", "frosting", "icing", "meringue", "swiss", "toasted sugar", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "14"}, "name": "BraveTart Swiss Meringue Buttercream", "link": "https://www.seriouseats.com/recipes/2017/05/swiss-meringue-buttercream-frosting-recipe.html", "description": "This light and silky buttercream is none too sweet, and beautifully stable at room temperature. The finished product can be customized with a splash of extract, a drizzle of melted chocolate, concentrated fruit purées, or just about whatever you crave.", "totalTime": "40 minutes", "recipeYield": "Makes about 6 heaping cups", "recipeCategory": ["Cakes", "Desserts", "Eggs", "Gluten-Free", "Pastry", "Stovetop"], "recipeIngredient": ["6 ounces egg whites (2/3 cup; 170g), from 5 to 6 large eggs", "11 ounces plain or <a href=\"http://www.seriouseats.com/recipes/2016/05/dry-toasted-sugar-granulated-caramel-recipe.html\">lightly toasted</a> sugar (about 1 2/3 cups; 310g) (see note)", "3/4 teaspoon (3g) Diamond Crystal kosher salt; use half as much if iodized", "1/4 teaspoon cream of tartar", "Scraped seeds from 1 split vanilla bean (optional)", "20 ounces unsalted butter (5 sticks; 565g), softened to about 65°F (18°C)", "1 teaspoon (5ml) vanilla extract", "1/4 teaspoon almond extract (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a wide pot with at least 1 1/2 inches of water, with a thick ring of crumpled tinfoil placed on the bottom to act as a \"booster seat\" that will prevent the bowl from touching the bottom of the pot. Place over high heat until steaming-hot, then adjust temperature to maintain a gentle simmer. Combine egg whites, sugar, salt, cream of tartar, and vanilla seeds (if using) in the bowl of a stand mixer. Set over steaming water, stirring and scraping constantly with a flexible spatula, until egg whites hold steady at 185&deg;F (85&deg;C). This should take only 10 to 12 minutes, so if mixture seems to be moving slowly, simply turn up the heat. Once ready, transfer to a stand mixer fitted with a whisk attachment and whip at high speed about 10 minutes, until meringue is glossy, stiff, and cool to the touch, around 90&deg;F (32&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With mixer still running, add butter, 1 or 2 tablespoons at a time. Initially, the volume of the meringue will decrease dramatically; it may even seem soupy along the way, but as the cool butter is added, the mixture will begin to thicken and cool. In the end, buttercream should be thick, creamy, and soft but not runny, around 72&deg;F (22&deg;C). Mix in vanilla extract and almond extract (if using) on low speed until well combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use buttercream right away, or transfer to a large zipper-lock bag, press out the air, and seal. Buttercream can be refrigerated for up to 2 weeks and frozen for up to several months. (The main issue with longer storage in the freezer is odor absorption, not spoilage.) Rewarm to 72&deg;F and re-whip before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Troubleshooting:</strong> If warmer than 74&deg;F (23&deg;C), the buttercream will be soft and loose; pop it in the fridge for 15 minutes and re-whip to help it thicken and cool. If colder than 68&deg;F (20&deg;C), the buttercream will be firm and dense, making it difficult to spread over cakes and slow to melt on the tongue, creating a greasy mouthfeel; to warm, briefly set over a pan of steaming water, just until you see the edges melting slightly, then re-whip to help it soften and warm. Full troubleshooting guide and video <a href=\"http://www.seriouseats.com/2017/05/how-to-fix-a-broken-swiss-meringue-buttercream.html\">here</a>.</p>"}]}