{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/08/20170714-eggs-en-meurette-vicky-wasik-12B.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["egg", "French", "poached egg", "wine"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Eggs en Meurette (Poached Eggs in Red Wine Sauce)", "link": "https://www.seriouseats.com/recipes/2017/09/poached-eggs-en-meurette-french-recipe.html", "description": "Eggs en meurette is a classic Burgundian dish of poached eggs in a rich and flavorful red wine sauce. It's a lot like beef bourguignon or coq au vin, just without the beef or chicken, and a lot quicker and easier.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4", "recipeCategory": ["French", "Mains", "Poached Eggs", "Poaching", "Stovetop"], "recipeIngredient": ["1 1/2 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium broth", "1 packet (1/4 ounce; 7g) powdered unflavored gelatin (only if chicken stock is low in gelatin or store-bought; see note)", "4 ounces slab bacon (115g), cut into lardons (small batons)", "6 ounces cremini mushrooms (170g), stems reserved and caps quartered", "Vegetable oil, as needed", "Kosher salt and freshly ground black pepper", "2 medium carrots (3 ounces/85g each), 1 cut into 1/2-inch dice and 1 cut into 1-inch pieces, divided", "4 ounces defrosted frozen pearl onions (115g; about 40 small), see note", "2 medium shallots, cut into roughly 1-inch pieces", "2 medium cloves garlic, divided", "1 sprig thyme", "2 cups dry red wine (475ml)", "2 tablespoons unsalted butter (30g), softened", "1 1/2 tablespoons all-purpose flour", "Pinch sugar (optional)", "4 pieces toasted country bread", "8 <a href=\"http://www.seriouseats.com/recipes/2014/04/foolproof-poached-eggs-food-lab-recipe.html\">poached large eggs</a>", "Minced flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If adding powdered gelatin to chicken stock, pour stock into a measuring cup or medium bowl and sprinkle gelatin all over the surface. Let stand.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 3-quart saucier or saucepan, cook bacon over medium-high heat, stirring occasionally, until browned and starting to crisp, about 5 minutes. Using a slotted spoon, transfer bacon to a plate, leaving rendered bacon fat in the saucier.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add diced mushroom caps and cook, stirring, until they release their water and then brown all over, about 6 minutes; add oil as needed at any point if saucepan becomes too dry. Season with salt and pepper. Scrape sautéed mushrooms onto plate with bacon and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add small diced carrot and pearl onions to the saucier, and cook, stirring, until just softened, about 5 minutes; add oil at any point if the pan becomes too dry. Transfer carrots and pearl onions to plate with bacon and mushrooms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add reserved mushroom stems, large diced carrots, shallots, 1 clove garlic, and thyme sprig to saucier and cook, stirring, until just starting to brown; lower heat and/or add oil to saucier at any point to prevent scorching. Add red wine and bring to a simmer, scraping up any browned bits from bottom of the pan. Continue to simmer until wine is reduced by half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, mix butter with flour until thoroughly incorporated; keep cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chicken stock and gelatin to saucier and return to a simmer. Continue cooking until reduced by one third. Strain sauce into a heatproof bowl, discard solids, then return to the saucier. Whisk in butter-flour mixture, then simmer until sauce begins to thicken and coats the back of a spoon, about 3 minutes. If sauce is thin, you can reduce further, or whisk in additional butter-flour mixture. Season with salt and pepper. If it tastes too sharp or acidic, you can whisk in a pinch of sugar to round out the flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bacon and vegetable garnishes to the sauce and heat through. Rub toasts with remaining clove of garlic, then set on serving plates. Slide 2 poached eggs onto each toast. Spoon the sauce and garnishes all over, sprinkle with parsley, and serve right away.</p>"}]}