{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/10/20170912-bravetart-pumpkin-cake-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["autumn", "Bake", "baking", "BraveTart", "cake", "cream cheese", "fall", "holiday", "layer cake", "spice cake", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Pumpkin Layer Cake", "link": "https://www.seriouseats.com/recipes/2017/10/bravetart-pumpkin-spice-layer-cake-recipe.html", "description": "Made with plenty of egg yolks, spices, and pumpkin purée, this light and fluffy cake has all the depth and flavor of a classic pumpkin pie. A generous layer of tangy cream cheese buttercream offsets the hearty cake, while a scattering of toasted pecans adds a welcome dose of flavor and crunch.", "totalTime": "3 1/2 hours", "recipeYield": "Serves 14", "recipeCategory": ["Baking", "Cakes", "Christmas", "Fall", "Pumpkin", "Squash", "Thanksgiving", "Winter"], "recipeIngredient": ["<strong>For the Cake:</strong>", "8 ounces unsalted butter (about 2 sticks; 225g), softened to about 70°F (21°C)", "14 ounces plain or <a href=\"http://www.seriouseats.com/recipes/2016/05/dry-toasted-sugar-granulated-caramel-recipe.html\">toasted sugar</a> (about 2 cups; 395g)", "1 tablespoon baking powder", "1 tablespoon potato flour, such as <a href=\"https://www.amazon.com/Bobs-Red-Mill-Potato-Flour/dp/B0013JQOKW/?tag=serieats-20\">Bob's Red Mill</a> (not potato flakes or starch; see note)", "1 teaspoon (4g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "2 teaspoons ground ginger", "2 teaspoons ground cinnamon", "1/2 teaspoon ground cloves", "5 ounces organic egg yolk (about 1/2 cup; 140g), from about 8 large eggs, brought to about 70°F (21°C)", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "3 ounces milk, brought to about 70°F/21°C (about 1/3 cup; 85g), <a href=\"http://www.seriouseats.com/2017/01/is-it-okay-to-bake-with-skim-milk.html\">any percentage will do</a> ", "12 ounces pumpkin or butternut squash purée (about 1 1/3 cups; 340g), canned or homemade", "13 1/2 ounces bleached cake flour (about 3 1/3 cups, spooned; 385g), such as Swans Down", "<strong>To Finish:</strong>", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2017/10/cream-cheese-buttercream-recipe.html\">Cream Cheese Buttercream</a>", "Ground cinnamon, to taste (optional)", "5 ounces toasted pecan pieces (about 1 cup; 140g), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Getting Ready:</strong> To better synchronize the downtime in both recipes, prepare the <a href=\"http://www.seriouseats.com/recipes/2017/10/cream-cheese-buttercream-recipe.html\">Cream Cheese Buttercream</a> before the cake. Adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). Lightly grease two 8-inch anodized aluminum cake pans and line with parchment (explanation and tutorial <a href=\"http://www.seriouseats.com/2017/06/how-to-cut-a-parchment-round.html\">here</a>).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> Combine butter, sugar, baking powder, potato flour, salt, ginger, cinnamon, and cloves in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then increase to medium and cream until the mixture is fluffy, light, and soft, about 8 minutes, pausing to scrape bowl and beater halfway through. With mixer running, add egg yolks one at a time, followed by vanilla. Take care not to overbeat at this stage.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, combine milk and pumpkin purée and whisk until smooth. Reduce speed to low and sprinkle in a third of the cake flour, followed by a third of the pumpkin/milk mixture. Alternate between the two, allowing each addition to roughly incorporate before adding the next. Once batter is smooth, fold with a flexible spatula to ensure it’s well mixed from the bottom up. Divide between prepared cake pans, adding just about 27 ounces (756g) to each one.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until cakes are well risen and firm to the touch, about 35 minutes or to 200&deg;F (93&deg;C). A toothpick inserted into the center will have a few crumbs still attached. Cool until no trace of warmth remains, about 2 hours due to the cakes' thickness. Run a butter knife around edges to loosen, then invert cakes onto a wire rack, peel off parchment, and return cakes right side up. (Covered in plastic, the cakes can be left at room temperature for a few hours.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crumb Coat:</strong> Level cakes with a serrated knife (full directions <a href=\"http://www.seriouseats.com/2017/05/how-to-level-a-cake.html\">here</a>) and set scraps aside for snacking. (These can also be crumbled into a batch of freshly churned <a href=\"https://www.seriouseats.com/recipes/2018/08/buttermilk-ice-cream.html\">Buttermilk Ice Cream</a>.) Place 1 layer on a heavy cast iron turntable; if you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with exactly 1 cup buttercream, using an offset spatula to spread it evenly from edge to edge. Repeat with second layer, then cover sides of cake with another cup of buttercream, spreading it as smoothly as you can (watch our <a href=\"http://www.seriouseats.com/2017/05/how-to-crumb-coat-cake.html\">crumb-coating tutorial</a> for more info). Refrigerate cake until buttercream hardens, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Re-whip remaining buttercream to restore its creamy consistency, then use to decorate chilled cake as desired; finish with a sprinkling of cinnamon and toasted pecans, if desired. Let cake return to cool room temperature before serving. Cut with a chef’s knife to serve and cover exposed edges with leftover buttercream to keep cake moist. Under a cake dome, the cake will keep for 3 days at room temperature.</p>"}]}