{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/10/20170912-bravetart-carrot-cake-vicky-wasik-24.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["cake", "carrot", "decorating", "dessert", "garnish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Twisted Carrot Roses From \"BraveTart\"", "link": "https://www.seriouseats.com/recipes/2017/10/carrot-rose-recipe.html", "description": "Carrot cakes are often topped with carrot-shaped squiggles of frosting or marzipan, but you don't need any special ingredients to create these simple carrot roses. For a rainbow bouquet, grab packs of orange, red, and purple \"confetti carrots\" at the grocery or farmers market.", "totalTime": "About 30 minutes", "recipeYield": "Makes 12 to 30 roses, depending on size", "recipeCategory": ["Carrot", "Poaching", "Vegetables"], "recipeIngredient": ["About 6 large carrots, at least 1 inch thick and preferably 7 to 8 inches in length", "8 ounces water (about 1 cup; 225g)", "7 ounces sugar (about 1 cup; 200g)", "1/4 teaspoon Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel the carrots, then place on a cutting board; with a vegetable peeler pressed firmly against the root end, drag the blade down its length. Discard the first few thin and irregular strips, and continue peeling to amass a pile of thick, even ribbons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine water, sugar, and salt in a 2-quart stainless steel saucier over medium heat, and bring to a boil. Drop carrot ribbons into the bubbling syrup, simmer 30 seconds, then shut off the heat. When cool enough to handle, fish out a ribbon and let the excess syrup drip off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Holding the skinny end with your dominant hand, twist and wrap a carrot ribbon around itself to form a \"bud.\" Continue twisting and wrapping to create the remaining petals, then tuck the end of the strip underneath itself. If you like, more strips can be added to create a larger rose. Place on a fully frosted <a href=\"https://www.seriouseats.com/recipes/2017/10/carrot-cake-recipe.html\">Brown Butter Carrot Cake</a>, repeating with additional carrot roses to create a lush bouquet.</p>"}]}