{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20170127-bagels-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["bagel", "baking", "bread", "tangzhong", "yukone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9130434782609", "ratingCount": "23"}, "name": "Homemade Bagels", "link": "https://www.seriouseats.com/recipes/2017/01/homemade-bagels-recipe.html", "description": "My method isn't exactly traditional, but it's a surefire way to guarantee homemade bagels that stay fresh long enough to enjoy them a few days in a row. They're chewy but tender, with a blistered crust that's eggshell thin and perfectly crisp. The trick is to pre-cook a portion of the flour and water on the stovetop, which improves browning and moisture retention and leads to bagels that won't turn into bricks overnight.", "totalTime": "25 hours", "recipeYield": "makes 8 three-inch bagels", "recipeCategory": ["Breakfast and Brunch", "Dairy-Free", "Easter", "Father's Day", "Vegan", "Vegetarian", "Yeast Bread"], "recipeIngredient": ["<strong>For the Yukone:</strong>", "6 ounces cold water (3/4 cup; 170g)", "3 1/2 ounces bread flour (about 3/4 cup, spooned; 100g) ", "<strong>For the Dough:</strong>", "12 1/2 ounces bread flour (about 2 3/4 cups, spooned; 355g)", "1/2 ounce sugar (1 tablespoon; 15g)", "2 1/2 teaspoons (9g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1 teaspoon (4g) instant dry yeast, such as <dorado id=\"instant-yeast\" class=\"text\">SAF</dorado>; not RapidRise or active dry (more info <a href=\"https://www.seriouseats.com/2018/03/all-about-dry-yeast-instant-active-dry-fast-acting-and-more.html\">here</a>)", "3 1/2 ounces water (1/2 cup minus 1 tablespoon; 100g)", "<strong>To Boil:</strong>", "1 ounce barley malt syrup (4 teaspoons; 30g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Yukone:</strong> In a 10-inch skillet, whisk water and flour over medium heat until thick, like mashed potatoes, about 2 minutes. Scrape onto a plate, spread into a 1-inch layer, cover and cool until to about 75&deg;F (23&deg;C), around 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Pulse flour, sugar, salt, and instant yeast in a food processor fitted with a metal blade. Once combined, add cooled yukone and water. Process until dough is silky smooth, and a small piece can be stretched into a sheet without tearing, about 90 seconds. The exact timing will vary with the power and capacity of a given machine. For smaller machines, the reduced capacity and power will necessitate dividing dough in half to process in stages.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Shape:</strong> Turn dough onto a clean, un-floured surface, and divide into 8 roughly equal portions (3 ounces or 85g each) and cover with plastic. Cup a portion of dough beneath your palm and work in quick, circular motions to form a tight ball, with only a tiny seam along the bottom. If the seam is large or irregular, continue rounding until the bottom is nearly smooth. Keep the shaped dough covered in plastic and let rest 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form the bagels, poke a hole into the center of each portion with a damp fingertip, then gently stretch into a 3 1/4-inch ring, wetting your hands in cold water as needed to prevent sticking. Arrange on a well greased, parchment-lined half sheet pan, cover with plastic, and refrigerate 24 to 36 hours, depending on your schedule.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Boil:</strong> Adjust oven rack to lower-middle position and preheat to 425&deg;F (218&deg;C). Fill a stainless steel pot with about 3 inches of water, stir in barley malt syrup, and bring to a boil over high heat. Meanwhile, line a baking sheet or cutting board with a thick layer of paper towels. Working two or three at a time, boil the bagels about 30 seconds per side. Drain on paper towels for two or three seconds, then transfer to a parchment-lined half sheet pan (if left on the paper towels too long, the bagels will stick; if this happens, quickly dip the bagel back into the hot water, and the wet paper towel will peel right off).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Bake the bagels until blistered and golden brown all over, about 25 minutes. Cool at least 15 minutes. To serve, split horizontally with a serrated knife. Uncut, bagels can be stored up to 48 hours in a paper bag (or loosely wrapped in parchment), then sliced and briefly toasted to serve.</p>"}]}