{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/07/cheesecake2.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "American", "keywords": ["Biscoff", "cheesecake", "cracker", "graham", "no bake", "pie"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Easy No-Bake Cheesecake", "link": "https://www.seriouseats.com/recipes/2017/07/no-bake-cheesecake-recipe.html", "description": "This no-bake cheesecake is as simple as they come&mdash;no fancy ingredients or techniques involved. We love the caramelized flavor of Biscoff cookies rather than graham crackers in the crust, but whatever you decide to use, the filling itself is refreshing, tart, and only lightly sweetened.", "totalTime": "6 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["American", "Baking", "Easter", "Fruit Desserts", "Mother's Day", "No-Cook", "Pies, Tarts, and Crumbles", "Summer", "Valentine's Day"], "recipeIngredient": ["<strong>For the Crust:</strong>", "8 3/4 ounces graham cracker or Biscoff crumbs (see note), store-bought or <a href=\"http://www.seriouseats.com/2017/06/how-to-make-speculoos-cookies.html\">homemade</a> (about 2 cups; 250g)", "2 1/2 ounces unsalted butter, melted (about 5 tablespoons; 70g)", "Kosher salt, to taste", "<strong>For the Filling:</strong>", "16 ounces plain, full-fat cream cheese (two 8-ounce packages; 455g)", "5 1/4 ounces sugar (about 3/4 cup; 150g)", "3/4 ounce fresh juice from 1 lemon (about 4 1/2 teaspoons; 20g)", "1/4 teaspoon vanilla extract", "1/8 teaspoon Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "12 ounces heavy cream (about 1 1/2 cups; 340g)", "<strong>To Serve:</strong>", "12 ounces fresh fruit (about 2 cups; 340g), washed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Combine cookie crumbs and melted butter in a small bowl, then stir in a pinch of salt to taste. Sprinkle into a 9-inch tart pan or pie plate, spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup; this will naturally push the crumbs up the sides of the pan. Keep pressing until the crumbs are in a compact, even layer across the bottom and sides of the pan. Refrigerate until needed. (The crust can be made and held for a day or two if wrapped in plastic.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> Combine cream cheese, sugar, lemon juice, vanilla, and salt in the bowl of a stand mixer fitted with a paddle attachment. Mix at low speed to form a thick paste, then increase to medium speed until soft and smooth.</p> "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape bowl and beater with a flexible spatula, then switch to the whisk attachment and pour in cream. Mix at low speed to combine, then increase to high and whip until the mixture can hold stiff peaks, 3 to 5 minutes depending on the horsepower of your mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape filling into prepared crust and spread into an even layer, using the back of a spoon to sculpt filling into swoops and swirls. Cover with plastic and refrigerate until the filling is firm and cold, about 6 hours or to an internal temperature of 40&deg;F (4&deg;C). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Top with fresh fruit and cut into wedges with a hot <a href=\"https://www.seriouseats.com/2018/06/the-best-chefs-knives.html\">chef’s knife</a>, rinsing the knife under hot running water between slices. Carefully slide a pie server under the crust, making sure it reaches all the way to the tip of the wedge (the first slice will be the most difficult and messy to remove).</p>"}]}