{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/10/20171010_Thanksgiving-Punch-Fig-EmilyDryden-0583.jpg", "author": {"@type": "Person", "name": "Maggie Hoffman"}, "recipeCuisine": "", "keywords": ["cocktail", "fall", "fig", "madeira", "punch", "rum", "spice", "tea"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Make-Ahead Fig and Cinnamon Punch", "link": "https://www.seriouseats.com/recipes/2017/11/fig-cinnamon-punch-cocktail-recipe.html", "description": "This warmly spiced rum punch, adapted from bartender A. Minetta Gould of Ste. Ellie in Denver, balances the bitterness of black tea with the nutty sweetness of dried figs and Madeira.", "totalTime": "55 minutes (can be made in advance and kept refrigerated)", "recipeYield": "Makes about 12 servings", "recipeCategory": ["Christmas", "Fall", "Liqueur and Fortified Wines", "Rum", "Thanksgiving", "Winter"], "recipeIngredient": ["12 ounces (340g) dried figs (about 35 figs), halved", "6 (4-inch) cinnamon sticks", "6 black tea bags", "1 (750ml) bottle aged rum, such as Plantation Barbados 5-Year ", "4 1/2 ounces (135ml) Bual Madeira, such as <a href=\"https://www.amazon.com/Blandys-Year-Bual-Madeira-Wine/dp/B01IO3E5F0/?tag=serieats-20\">Blandy's</a>", "Up to 1/2 ounce maple syrup (0 to 22ml), to taste (optional; see note)", "3 lemons, sliced thinly into wheels, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 1 day before you want to serve the punch, make a large ice block by freezing water (filtered if desired) in a cake pan or tupperware container that will fit in your serving vessel. Alternately, make several trays of large ice cubes. In addition, you'll want about 4 standard trays of ice cubes for serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, combine halved figs, cinnamon sticks, and 4 1/2 cups (1.06L) water and bring to a gentle simmer over medium-high heat, stirring occasionally. Let simmer 1 minute. Add tea bags, remove pan from heat, and let steep 5 minutes. Discard teabags, then allow cinnamon-fig tea to stand for 45 minutes. Fine strain into a sealable container, pressing on solids with a spoon to extract as much liquid as possible. Refrigerate at least 1 hour to chill, and up to 24 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make Punch:</strong> In a large bowl, 3-quart pitcher, or other large container, stir together rum, Madeira, and cooled fig tea. Taste, adding optional maple syrup in 1/4-ounce additions until desired sweetness level is reached (you may not need any, depending on the sweetness of your rum and Madeira). The punch can be served right away or refrigerated, well sealed, up to 6 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, transfer punch to a punch bowl and stir well. Add the prepared large ice block or several trays of large ice cubes, plus all but 12 of the lemon wheels. Serve punch in ice-filled cups, garnishing each with a reserved lemon wheel.</p>"}]}