{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20161219-stuffed-shells-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["baked pasta", "Italian", "italian american", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Classic Italian-American Stuffed Shells With Ricotta and Spinach", "link": "https://www.seriouseats.com/recipes/2017/01/classic-italian-american-stuffed-shells.html", "description": "Italian-American stuffed shells, a classic baked pasta dish, are plump with a flavorful ricotta and spinach filling, coated in tomato sauce, and draped in melted mozzarella cheese. It's comfort food at its best.", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Baking", "Italian", "Mains", "Pasta"], "recipeIngredient": ["6 ounces dry jumbo pasta shells (about 25 shells; see note)", "Kosher salt", "Extra-virgin olive oil, for drizzling and greasing the baking dish", "10 ounces (280g) tender fresh greens, such as arugula, spinach, or a combination", "1 pound (450g) good quality ricotta, such as Calabro or from a local Italian dairy", "12 ounces (340g) fresh or low-moisture mozzarella, shredded, divided (see note)", "2 ounces (55g) grated Parmigiano-Reggiano cheese, divided", "1 medium clove garlic, minced", "Pinch freshly grated nutmeg", "Freshly ground black pepper", "1 1/2 cups (355ml) tomato sauce, such as <a href=\"http://www.seriouseats.com/recipes/2014/09/easy-italian-amercian-red-sauce-recipe.html\">Quick Tomato Sauce</a>, <a href=\"http://www.seriouseats.com/recipes/2014/08/the-best-fresh-tomato-sauce-for-pasta-recipe.html\">Fresh Tomato Sauce</a>, or <a href=\"http://www.seriouseats.com/recipes/2014/09/the-best-slow-cooked-italian-american-tomato-sauce-red-sauce-recipe.html\">Slow Cooked Tomato Sauce</a>, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F. In a large pot of salted boiling water, cook shells according to package instructions for baked shells (many packages of jumbo shells will give a specific boiling time for dishes that are subsequently baked; if not, cook the shells for 3 minutes fewer than the stated cooking time). Using a spider, slotted spoon, or mesh strainer, carefully transfer shells to a large bowl of cold water until cooled slightly, then drain. Drizzle shells very lightly with oil and toss to coat. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the same pot of water, cook the greens until fully wilted, about 30 seconds. Drain greens into the bowl of a salad spinner set in the sink. Run under cold water until thoroughly chilled, then spin in salad spinner to dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread greens over a clean kitchen towel or a double layer of paper towels and roll into a tight tube, pressing to remove excess moisture. Transfer to a cutting board and roughly chop.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a large plate or a rimmed baking sheet with a triple layer of paper towels or a clean kitchen towel. Spread ricotta on top and cover with more paper towels or another clean kitchen towel. Let drain for 5 minutes, then remove towels and transfer ricotta to a large bowl. (You may need to use a spatula to scrape all of the ricotta off the towels.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add spinach, 8 ounces shredded mozzarella, 1 1/2 ounces grated Parmigiano-Reggiano, garlic, and nutmeg to ricotta. Season with salt and pepper and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease a 9- by 13-inch baking dish with oil. Spread 1/2 cup tomato sauce in an even layer on bottom of baking dish. Using a spoon, fill each shell with a large scoop of ricotta filling and place opening side up in baking dish. Repeat until baking dish is full (you should be able to fit about 18 stuffed shells in the dish, and may have a few pasta shells leftover).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon the remaining 1 cup tomato sauce on top of shells. Top with remaining 4 ounces shredded mozzarella and 1/2 ounce grated Parmigiano-Reggiano cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until shells are heated through and cheese is bubbling and lightly browned on top, about 40 minutes. Let cool slightly, then serve.</p>"}]}