{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/07/20170629-roasted-cherry-ice-cream-25.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["cherry", "cream", "dessert", "eggless", "grill", "ice cream", "roast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "8"}, "name": "Cherry Ice Cream", "link": "https://www.seriouseats.com/recipes/2017/07/roasted-cherry-ice-cream-recipe.html", "description": "Without any egg yolks to get in the way, this ice cream tastes like pure cherry and nothing more&mdash;although if you'd like a hint of smoke try throwing the cherries on a hot grill until wilted and soft.", "totalTime": "5 hours", "recipeYield": "Makes 1 quart", "recipeCategory": ["Baking", "Cherry", "Fruit Desserts", "Grilling, Smoking, and Barbecue", "Ice Cream and Frozen Treats", "Roasting", "Stovetop", "Summer"], "recipeIngredient": ["56 ounces whole cherries, washed and stemmed but not pitted (about 10 cups; 1.58kg)", "5 1/4 ounces sugar (about 3/4 cup; 145g)", "1/8 teaspoon (.5g) Diamond Crystal kosher salt, or more to taste; for table salt, use about half as much by volume or the same weight", "14 ounces heavy cream (about 1 3/4 cups; 395g)", "1/2 ounce fresh juice from 1 lemon, or more to taste (about 1 tablespoon; 15g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Oven-Roasted Cherries:</strong> Adjust oven rack to middle position and preheat to 450&deg;F. Combine cherries and sugar in a deep, 10-inch stainless steel skillet. Roast, stirring occasionally, until cherries are wilted, tender, and juicy, about 40 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Fire-Roasted Cherries:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Combine cherries and sugar in a deep 10-inch stainless steel skillet or a large, <a href=\"http://www.seriouseats.com/2016/09/how-to-season-cast-iron-pans-skillets-cookware.html\">well-seasoned cast iron pan</a> (new or poorly seasoned cast iron will impart a metallic flavor to the acidic fruit). Set skillet over the hot side of grill, cover, and cook, stirring occasionally, until cherries are wilted, tender, and juicy; if cherries threaten to burn at any point, move skillet to cooler side of the grill and continue cooking there. Time will vary depending on the grill heat, so check often.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set cherries aside until cool enough to handle, then pit by hand (ideally wearing a pair of food-safe gloves) by gently squeezing the soft fruit. Transfer pits to a 1-quart stainless steel saucier or saucepan and place pitted cherries in a tall, narrow container or the bowl of a food processor; reserve roasting juices in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add cream to the pits, bring to a simmer over medium heat, then cover and set aside. Roughly chop the pitted cherries with a few pulses from an immersion blender or food processor, but do not purée. The idea is to simply break up the larger pieces of fruit to help release their juices. Return the chopped fruit to the reserved pan of roasted cherry juices and bring to a simmer on the stovetop over medium heat. Continue cooking, stirring frequently with a heat-resistant spatula, until the fruit looks a little jammy but not dry, 5 to 10 minutes depending on the degree of roasting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour cherries through a fine-mesh strainer set over a medium bowl, pressing on the cherries with a flexible spatula until they give up their juices. In the end, you should have about 20 ounces (565g) cherry concentrate and around 15 ounces (425g) leftover pulp. If you have more than 20 ounces (565g) cherry concentrate, return to pan and continue cooking until reduced to 20 ounces; if you have less, top up with water to total 20 ounces. Transfer cherry pulp to a clean jar, season with a pinch of salt, and reserve for another use;  kept refrigerated, the cherry pulp can last up to 3 weeks and be used like jam. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the reserved cherry pit-infused cream into the reduction, then discard pits or reserve for a batch of <a href=\"http://www.seriouseats.com/2016/06/how-to-make-cherry-pit-whipped-cream.html\">cherry pit whipped cream</a> (they still have plenty of flavor left to give). Whisk until smooth, then add lemon juice and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a sink compartment or extra-large bowl with a few inches of ice water and place bowl with ice cream base inside, stirring from time to time, until cool, about 30 minutes. Cover and refrigerate until no warmer than 40&deg;F (4&deg;C), about 4 hours. (The ice cream base can be kept refrigerated for up to 1 week.) Season to taste with additional salt or lemon juice if desired. Churn in an ice cream machine according to the manufacturer’s directions. Meanwhile, place a 1-quart container and flexible spatula in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ice cream looks thick and light, shut off the machine and scrape ice cream into chilled container, using chilled spatula. Enjoy as soft-serve, or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until chilled to 0&deg;F, about 4 hours.</p>"}]}