{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/10/20170921-chaat-vicky-wasik-66.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Indian", "keywords": ["Asian", "bean", "chickpea", "chutney", "Indian", "potato", "south asian", "spice", "street food"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Papri Chaat (Indian Street Snack With Potato, Chickpeas, and Chutneys)", "link": "https://www.seriouseats.com/recipes/2017/11/papri-chaat-indian-street-snack-recipe.html", "description": "<em>Papri chaat</em> is a traditional street snack found all over India, with crunchy, soft, and fluffy textures, all smothered in tangy, sweet, and hot chutneys.", "totalTime": "2 hours", "recipeYield": "Serves 4 to 6 as a snack", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Indian", "Legumes", "Potato", "Snacks", "Vegetarian"], "recipeIngredient": ["<strong>For the Papris:</strong>", "2 cups (260g) atta flour (Indian wheat flour) or whole wheat flour", "1 teaspoon (4g) baking powder", "1 1/2 teaspoons (7g) kosher salt", "1 teaspoon (5g) nigella seeds", "1 tablespoon (12g) vegetable oil", "1 1/2 quarts (1.4L) oil for frying, such as canola, peanut, or vegetable", "<strong>For the Mint Chutney:</strong>", "1 bunch (60g) cilantro", "1 bunch (60g) mint", "Juice from 1 lime (about 30ml)", "1 medium (20g) serrano pepper, sliced", "<strong>For the Tamarind Chutney:</strong>", "4 medjool dates (40g), pitted", "1/3 cup (85g) tamarind paste (not concentrate)", "1/2 teaspoon (2g) ginger powder", "1/4 teaspoon (1g) <a href=\"https://www.amazon.com/dp/B00MYRUYAI?tag=serieats-20\">Kashmiri red chili powder</a> (see note)", "1/3 cup (100g) palm sugar or light brown sugar", "<strong>For the Sev:</strong>", "1 cup (115g) chickpea flour", "1/2 teaspoon (2g) <a href=\"https://www.amazon.com/dp/B00MYRUYAI?tag=serieats-20\">Kashmiri red chili powder</a> (see note)", "1/4 teaspoon (1g) freshly ground black pepper", "<strong>To Assemble:</strong>", "1 cup (about 250g) boiled, peeled, and cubed russet potato", "1 can (434g) chickpeas, drained (or equivalent freshly cooked from dried)", "<a href=\"http://www.seriouseats.com/recipes/2017/11/chaat-masala-spice-blend-recipe.html\">Chaat Masala spice mixture</a>, to taste", "1 pint (450g) whole-milk yogurt", "1 small onion, diced", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Papris:</strong> In a large bowl, whisk together flour, baking powder, salt, and nigella seeds. Add warm water, a little at a time, until a soft dough forms (it should be the consistency of Play-Doh). Knead in the bowl until mixture comes together into a smooth dough, about 5 minutes. Wrap dough in plastic wrap and let rest for at least 1 hour and up to 12 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured work surface, roll out dough until it is approximately 2 millimeters thick. (You can use the nigella seeds as your guide: The dough should be just barely thicker than the seeds themselves.) Using a fork, prick all over surface of dough. (Alternatively, if left un-pricked, the papris will puff up when fried, and can then be stuffed for <em>sev puri</em> chaat and <em>panipuri</em>.) Using a 1 1/2&ndash;inch round cookie cutter, cut rounds from dough and set aside on a floured surface. Any scraps can be gathered and re-rolled until you have no more dough left.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, wok, or Dutch oven, heat oil to 375&deg;F (190&deg;C). Working in batches of 6 to 8 pieces, fry papris, turning occasionally, until golden brown, about 2 minutes. Drain onto a paper towel&ndash;lined sheet tray and season with salt while still warm. Reserve frying oil for sev (below), if making from scratch. The papris will stay crisp in an airtight container for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mint Chutney:</strong> Prepare an ice bath. In a pot of salted boiling water, blanch cilantro and mint until they turn bright green, about 20 seconds. Shock herbs in ice bath to stop the cooking, then drain well. Squeeze out any excess liquid from herbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove and discard the thick mint stems, then roughly chop herbs and remaining tender stems. In a blender, purée blanched herbs with lime juice, serrano pepper, and just enough cold water to bring the mixture together, taking care not to over-blend and heat up the chutney, which can lead to discoloration. Season with salt to taste. The chutney will stay fresh in the refrigerator for 2 to 3 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Tamarind Chutney:</strong> In a small saucepan, combine dates, tamarind paste, ginger powder, chili powder, and sugar and bring to a boil. Remove from heat and set aside, covered, for 10 minutes to soften the tamarind paste and dates. Using a blender, purée until smooth, then pass through a fine-mesh strainer to remove any fibrous bits. The chutney will keep in an airtight container in the refrigerator for up to 2 weeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Sev:</strong> In a medium mixing bowl, whisk together chickpea flour, chili powder, black pepper, and enough water (1/3 cup to 1/2 cup) to form a mixture with the thickness of pancake batter. Add batter to a piping bag fitted with a number 2 plain round tip, or use a zipper-lock bag with one corner snipped off to create a small opening.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using the same frying oil as for the papris, heat oil to 375&deg;F (190&deg;C). Pipe squiggles of batter into oil, like a funnel cake, and fry until bubbling ceases. Using a spider or strainer, lift fried sev and transfer to a paper towel&ndash;lined sheet tray to drain. Repeat with remaining sev batter. The sev will stay crisp in an airtight container for up to 1 month.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> On a large serving plate, spread papris in a single even layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, toss potatoes and chickpeas with chaat masala to taste. Spread potatoes and chickpeas all over papris.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, combine yogurt with chaat masala to taste and spoon over potatoes, chickpeas, and papris.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with diced onion, mint and tamarind chutneys, and sev. Sprinkle more chaat masala on top and serve right away, preferably with sweet, milky black tea.</p>"}]}