{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/05/20170502-buckwheat-crepes-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["breakfast", "brunch", "buckwheat", "crepe", "egg", "French", "ham", "pancake"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Savory Buckwheat Crepes", "link": "https://www.seriouseats.com/recipes/2017/05/savory-buckwheat-crepes-galettes-bretonnes-recipe.html", "description": "Buckwheat adds extra mineral depth to these crepes, making them great for filling with eggs, cheese, ham, and other savory ingredients. They come together in just under half an hour, too.", "totalTime": "25 minutes", "recipeYield": "Makes about 8 crepes", "recipeCategory": ["Crepe", "Eggs", "Father's Day", "French", "Ham", "Mains", "Mother's Day", "Quick and Easy", "Quick Dinners", "Stovetop"], "recipeIngredient": ["150g buckwheat flour (5.3 ounces; about 3/4 cup plus 3 tablespoons)", "100g all-purpose flour (3.5 ounces; about 3/4 cup, spooned)", "7g kosher salt (1/4 ounce; about 1 1/2 teaspoons)", "1 large egg", "300ml (1 1/4 cups) whole milk", "325ml (1 1/3 cups) water", "Unsalted butter, for cooking", "Optional: fried eggs, grated Gruyère cheese, and thinly sliced ham, for filling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together buckwheat flour, all-purpose flour, and salt. Add egg, milk, and water and whisk until thoroughly combined and slightly aerated. (Small bubbles should initially form on surface when batter is left to stand.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a nonstick skillet or well-seasoned carbon steel crepe pan, melt about 1/2 tablespoon (7g) butter over high heat until browned and starting to smoke. Add just enough batter to thinly coat bottom of pan (about 80ml; 1/3 cup), swirling to evenly cover. Return to heat and let cook until bottom is beginning to brown well and top looks dry, 30 seconds to 1 minute. (To make sure, check the bottom for browning by gently lifting an edge of the crepe.) Reduce heat at any point to prevent burning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Fill the Crepes:</strong> Start by spreading a small handful of grated Gruyère cheese around the center of the crepe while it's still in the pan, on the heat. Lay a slice of ham on top of cheese and slide a fried egg on top of ham. Using a <a href=\"https://www.amazon.com/dp/B000931ENU/?tag=serieats-20\">thin metal spatula</a> (being extra careful not to scratch pan if nonstick), fold sides of crepe in to form a rectangular shape with egg yolk exposed. Continue to cook until bottom is well browned and crisp, about 30 seconds. Serve, then repeat with remaining crepe batter, butter, and fillings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make Crepes for Another Purpose:</strong> Carefully free crepe from pan with a thin metal spatula (being careful not to scratch pan if nonstick), then flip and cook other side for about 10 seconds. Transfer to a plate. Continue with remaining crepe batter and butter. Keep cooked crepes stacked and covered with a clean kitchen towel while cooking remaining crepes. Crepes can be held for about 1 hour before using, then quickly reheated in a skillet.</p>"}]}