{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20160820-summer-vegetable-bread-soup-recipe-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["Italian", "soup", "squash", "stew", "summer", "tuscan", "vegetarian", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Tuscan Ribollita With Summer Vegetables", "link": "https://www.seriouseats.com/recipes/2017/06/ribollita-italian-summer-vegetables-stew-recipe.html", "description": "Every summer we find ourselves with more vegetables than we know what to do with. The solution? An Italian soup called <em>ribollita</em>. Actually, it's an Italian stew. Or actually, an Italian pancake. It's all three of those things, depending on how long you cook it.", "totalTime": "45 minutes or longer, depending on your preferred consistency", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Dairy-Free", "Easter", "Italian", "Quick Dinners", "Sides", "Soups and Stews", "Squash", "Stovetop", "Summer", "Vegan", "Vegetarian", "Zucchini"], "recipeIngredient": ["3 tablespoons (45ml) extra-virgin olive oil, plus more as needed", "3 medium cloves garlic, thinly sliced", "1 medium yellow onion, thinly sliced (about 8 ounces; 240g)", "1 large leek, white and light green parts only, diced (about 13 ounces; 370g)", "2 large carrots, peeled and diced (about 12 ounces; 340g)", "3 large celery stalks, diced (about 8 ounces; 240g)", "Kosher salt", "2 to 3 sprigs fresh rosemary or thyme", "1 tablespoon tomato paste (15ml)", "Water", "2 bay leaves", "1 chunk Parmigiano-Reggiano rind, about 2 inches squared (optional)", "2 medium zucchini, cut into bite-size pieces (about 8 ounces; 240g)", "2 medium summer squash, cut into bite-size pieces (about 8 ounces; 240g)", "8 ounces green beans, cut into 1-inch pieces (about 240g)", "4 ounces spinach, roughly chopped (about 4 cups loosely packed leaves; 115g)", "1 cup roughly chopped fresh basil leaves (about 1 ounce; 30g)", "Freshly ground black pepper", "1/4 pound (110g) fresh or stale rustic crusty bread, cut into 1-inch cubes", "Freshly grated Parmigiano-Reggiano, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven or soup pot, heat olive oil over medium-low heat with garlic. Cook, stirring, until garlic is fragrant and very lightly golden. Add onion, leek, carrots, celery, and rosemary or thyme sprigs. Season gently with salt and cook, stirring, until the vegetables are fully softened but not browned, about 10 minutes, adding more oil as necessary if the pot looks dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add tomato paste and stir until it is incorporated, about 30 seconds. Add 6 cups of water, bay leaves, Parmesan rind, zucchini, summer squash, green beans, spinach, and basil. Bring to a simmer and cook, stirring frequently, until the vegetables are fully tender, about 10 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bread, stir well, and simmer until bread is very soft and breaking down, about 15 minutes. Add water, 1/2 cup at a time, if soup becomes too thick and dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season again with salt, pepper, and a generous shaving of Parmesan (if using). The soup can be served at varying consistencies: more wet and brothy, like a thick, chunky soup, or cooked down until thickened like a porridge. Once reduced to a thick porridge, you can ladle some of it into a small (8-inch) nonstick skillet with 1 tablespoon oil and cook over medium-high heat, stirring frequently, until it coalesces into a dense mass; it will eventually take the shape of a pancake. (If your flipping skills are good, you can flip it to serve it browned side up.) Slide it onto a plate. To serve at any consistency, discard bay leaves, rosemary or thyme sprigs, and Parmesan rind, drizzle with fresh olive oil and top with freshly ground black pepper and more grated cheese (optional).</p>"}]}