{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/02/20170130_Seared_Scallops_Leek_Risotto_4.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "Italian", "keywords": ["leek", "risotto", "scallop", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "5"}, "name": "Seared Sea Scallops With Leek Risotto and Lemon-Brown Butter Sauce", "link": "https://www.seriouseats.com/recipes/2017/02/sea-scallops-leek-risotto-recipe.html", "description": "Seared sea scallops, a rich and creamy leek risotto, and an easy but flavorful brown butter and lemon sauce come together for a show-stopping Valentine's Day dinner that doesn't require hours and hours of cooking.", "totalTime": "1 hour 15 minutes", "recipeYield": "Makes 2 servings (see note)", "recipeCategory": ["Father's Day", "Italian", "Mains", "Mother's Day", "Other Seafood", "Rice", "Stovetop", "Valentine's Day"], "recipeIngredient": ["<strong>For the Leek Risotto:</strong>", "1 tablespoon extra-virgin olive oil (15ml)", "1 1/2 cups Arborio or Carnaroli rice (300g)", "4 tablespoons unsalted butter (60g), divided", "2 large leeks, white and light green parts only, washed well and diced (about 2 1/2 cups)", "1/2 cup dry white wine (120ml)", "5 to 6 cups homemade or store-bought low-sodium <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">chicken</a> or <a href=\"http://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable</a> stock or water, kept warm", "3 tablespoons mascarpone cheese (45ml)", "1/2 cup grated Parmigiano-Reggiano cheese (about 2 ounces)", "2 teaspoons lemon zest, finely grated (from about 1 large lemon)", "1 tablespoon fresh juice from 1 lemon (15ml)", "Kosher salt and freshly ground black pepper", "<strong>For the Lemon-Brown Butter Sauce:</strong>", "5 tablespoons unsalted butter (75g)", "1 medium clove garlic, minced", "1 tablespoon fresh juice from 1 lemon (15ml)", "Kosher salt and freshly ground black pepper", "<strong>For the Scallops:</strong>", "8 to 10 large dry-packed sea scallops (about 3/4 pound), dried thoroughly with towels", "Kosher salt", "1 tablespoon neutral oil, such as vegetable, canola, or grape seed (15ml)", "2 tablespoons <a href=\"https://www.amazon.com/Sweety-Drop-Miniature-Peppers-ounce/dp/B00C4Y1I24/?tag=serieats-20\">teardrop</a> or other pickled pepper (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Leek Risotto:</strong> In a medium saucepan, heat olive oil over medium heat until shimmering. Add rice and cook, stirring, until they turn translucent around the edges, about 3 minutes. Add 2 tablespoons butter and leeks and cook, stirring, until butter is melted and leeks are tender but not browned, about 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine and simmer, stirring, until it has evaporated, about 3 minutes. Add 1/2 cup warm stock and stir until almost all the liquid has been absorbed. Continue cooking the rice, adding the broth in 1/2-cup additions, and stirring until the liquid is absorbed before the next addition, until rice is al dente, about 20 minutes. The rice can be kept warm at this point until ready to finish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to finish, stir in enough warm stock to loosen risotto to a creamy consistency. Stir in the remaining 2 tablespoons butter, mascarpone, Parmigiano-Reggiano, and lemon zest and juice. Season with salt and pepper. When finished, the grains of rice should be suspended in a thick and creamy sauce; if risotto thickens too much, simply add additional warm stock or water to restore proper consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Lemon-Brown Butter Sauce:</strong> Add butter to a small saucepan set over medium heat. Cook, stirring and swirling the pan every few seconds, until the foam subsides and the butter begins to turn golden brown and smells nutty, about 3 minutes. Off the heat, stir in garlic and let it sizzle for about 10-15 seconds, then add lemon juice. Season with salt and pepper; keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Scallops:</strong> Season scallops with salt. Let stand in the refrigerator for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove salted scallops from the refrigerator and pat dry. Season lightly with a little more salt. Heat vegetable oil in a large stainless steel or cast iron skillet over high heat until lightly smoking. Add scallops, leaving space between each one. Press each scallop down very lightly with a spatula to ensure good contact with the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook scallops without moving them until well browned on first side, 1-2 minutes. Carefully flip scallops and cook until seared on opposite side and medium-rare within, about 1 minute longer. Transfer scallops to a paper towel-lined plate to drain. To serve, scoop risotto into warmed bowls, top with scallops, and drizzle with the sauce. Top with a few peppers, if using.</p>"}]}