{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/03/20170316-poached-chicken-aspargus-canal-house-10.jpg", "author": {"@type": "Person", "name": "Canal House"}, "recipeCuisine": "", "keywords": ["asparagus", "canal house", "chicken", "green goddess", "poach", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Poached Chicken and Asparagus With Green Goddess Sauce", "link": "https://www.seriouseats.com/recipes/2017/03/poached-chicken-asparagus-green-goddess-sauce-recipe.html", "description": "This easy meal of tender and juicy poached chicken with asparagus and a creamy green goddess sauce is light and fresh, perfect for marking the beginning of spring. For this dish, we lightened the green goddess with whipped cream, which softens the herbaceous flavor, making it more delicate, and lends a luscious, mousse-like consistency. (If you like, make just the dressing according to the instructions in step 4, omitting the whipped cream, and serve it with sturdy lettuces for salads.)", "totalTime": "1 hour 15 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Asparagus", "Chicken", "Condiments and Sauces", "Gluten-Free", "Mains", "Poaching", "Quick Dinners", "Spring", "Stovetop"], "recipeIngredient": ["<strong>For the Chicken and Asparagus:</strong>", "4 bone-in, skin-on, split chicken breast halves (about 4 pounds; 1.8kg)", "1 carrot, peeled and cut into large dice", "1 celery rib, cut into large dice ", "1 leek, white and light green parts only, washed well and cut into large dice", "2 large sprigs fresh tarragon", "1 cup (235ml) dry white wine", "1 1/2 tablespoons (15g) kosher salt, plus more for seasoning", "1/2 teaspoon (3g) whole black peppercorns", "12 large spears asparagus (about 1/2 pound; 225g), washed well, woody ends trimmed and stalks peeled", "4 tablespoons (60g) unsalted butter, melted", "<strong>For the Green Goddess Sauce:</strong>", "3/4 cup (170g) mayonnaise ", "1/4 cup (55g) sour cream ", "1 tablespoon (15ml) rice wine vinegar", "1/2 bunch watercress (about 2 ounces; 55g), leaves only", "1/4 cup fresh tarragon leaves", "1/4 cup flat-leaf parsley leaves and tender stems", "10 fresh chives, plus minced chives for garnish", "4 oil-packed anchovy fillets, drained", "Kosher salt and freshly ground black pepper", "1 cup (240ml) heavy whipping cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Chicken and Asparagus:</strong> In a large saucepan, combine chicken with carrot, celery, leek, tarragon sprigs, wine, salt, and peppercorns. Add enough water to cover chicken and other ingredients by about 1 inch. Set over medium-high heat until water temperature reaches between 150 and 160&deg;F (66 and 71&deg;C) on an instant-read thermometer; adjust heat to maintain water temperature in the 150&ndash;160&deg;F range. It's okay if the temperature bounces around a little, but try to keep it above 150 and below 170&deg;F (77&deg;C). Cook until thickest part of chicken registers 150&deg;F (66&deg;C) on an instant-read thermometer, about 1 hour. Remove chicken from broth and let rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When chicken is cool enough to handle, remove skin and bones. (If you want, return skin and bones to poaching liquid and simmer for 30 minutes longer, then strain and reserve liquid as a broth for another use.) Cover chicken breasts with plastic wrap, pressing plastic directly and firmly against the surface of the meat, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a skillet large enough to accommodate asparagus with cold water, add a large pinch of salt, then bring to a boil over medium-high heat. Add asparagus and cook until tender, about 4 minutes. Transfer asparagus to a paper towel&ndash;lined plate to drain, then discard paper towels. Drizzle asparagus with melted butter and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Green Goddess Sauce:</strong> Using a blender or food processor, purée mayonnaise, sour cream, vinegar, watercress, tarragon, parsley, chives, and anchovies until smooth. Season with salt and a generous grinding of black pepper. Dressing will keep, covered, in the refrigerator for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 1 hour before serving, allow dressing to come to room temperature. Before serving, use a whisk or electric mixer to whip cream in a large metal bowl until soft peaks form. Fold whipped cream into dressing to suit your taste. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Slice warm or room-temperature chicken breasts against the grain. Spoon some sauce onto a large platter. Arrange chicken on top of sauce and arrange warm or room-temperature buttered asparagus around chicken. Spoon more sauce over chicken. Season with salt and pepper and garnish with minced fresh chives. If you prefer, you can also serve on individual plates. Serve any extra green goddess sauce on the side. </p>"}]}