{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/11/20171108-ropa-vieja-vicky-wasik-23.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Latin American", "keywords": ["beef", "Cuban", "Latin American", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "<em>Ropa Vieja</em>", "link": "https://www.seriouseats.com/recipes/2017/11/ropa-vieja-cuban-latin-american-beef-stew-recipe.html", "description": "<em>Ropa vieja</em>, a dish famous in Cuba and popular throughout the Latin Caribbean, features thin strands of shredded beef in a rich and flavorful sauce of tomatoes, onions, bell peppers, and spices. This recipe updates the classic technique for improved efficiency and flavor.", "totalTime": "2 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Beef Stew", "Braising and Stewing", "Caribbean", "Gluten-Free", "Latin American", "Mains", "Winter"], "recipeIngredient": ["2 1/2 pounds (1.1kg) beef flank steak (see note)", "Kosher salt and freshly ground black pepper", "3 tablespoons (45ml) vegetable oil, plus more if needed", "1 large yellow onion (about 15 ounces; 415g), sliced", "3 red, yellow, and/or orange bell peppers (about 8 3/4 ounces; 250g each), stemmed, seeded, and thinly sliced", "8 medium cloves garlic (3/4 ounce; 25g), minced", "1 tablespoon (15ml) tomato paste", "1 teaspoon ground cumin", "1 teaspoon dried oregano", "1/2 teaspoon ground allspice", "1/2 cup (120ml) dry white wine", "1 (14-ounce; 396g) can peeled whole tomatoes in their juices, crushed", "1 cup (240ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought chicken stock, plus more if needed", "2 bay leaves", "1 medium carrot, halved crosswise", "1 celery rib, halved crosswise", "1/2 cup (90g) pimento-stuffed olives, sliced into thirds", "1 small handful chopped cilantro leaves and tender stems (about 1/2 loosely packed cup)", "Cooked rice and pinto or black beans, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (180&deg;C). Cut flank steak into large pieces that will fit on the bottom of a Dutch oven in 2 batches. Season with salt and pepper. Heat oil in Dutch oven over medium-high heat until shimmering. Working in batches, add steak and cook, turning, until browned, about 6 minutes per batch. Transfer steak to a plate and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add onion and bell peppers to Dutch oven and cook, stirring and scraping up browned bits from bottom of pot, until onion and peppers are tender, about 8 minutes. Add garlic and cook for 1 minute longer; lower heat and/or add more oil at any point if ingredients threaten to burn.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in tomato paste, cumin, oregano, and allspice and cook, stirring and scraping, for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add white wine and bring to a simmer, scraping up any browned bits from bottom of pot. Boil until raw alcohol smell has cooked off from wine, about 2 minutes, then add canned tomatoes and stock. Return beef to pot, nestling it under the liquid among onions and peppers, along with any of its accumulated juices. Nestle bay leaves, carrot, and celery into pot. Add more stock, just enough to cover all the ingredients, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover Dutch oven and transfer to oven, then let cook until beef is very tender, about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove bay leaves, carrot, and celery from pot and discard. Remove beef from pot and, using 2 forks, pull apart into very thin, long shreds. Return beef to pot, stirring to combine with vegetables and cooking liquid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in olives, return Dutch oven to medium heat, and simmer until juices have reduced just enough to coat the beef in a rich, saucy glaze. Season with salt and pepper. Stir in cilantro, then serve with rice and beans.</p>"}]}