{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/11/artichokepotato.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["artichoke", "baked potato", "dip", "potato", "spinach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Spinach and Artichoke Dip Baked Potatoes", "link": "https://www.seriouseats.com/recipes/2017/11/spinach-artichoke-dip-baked-potatoes-recipe.html", "description": "Potato chips with spinach and artichoke dip is quintessential party food, but swap out the chips for ultimate baked potatoes, and suddenly the combination is perfect for a weekday dinner. By scooping out the potato flesh and mashing it with the dip before re-stuffing, you get a ton of flavor in every bite of baked potato.", "totalTime": "1 hour to 1 hour 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Baking", "Christmas", "Mains", "Other Vegetables", "Potato", "Sides", "Spinach", "Vegetarian"], "recipeIngredient": ["4 (12-ounce; 340g) potatoes, preferably russets", "Canola, vegetable, or olive oil, for rubbing", "1/2 cup (115g) sour cream", "4 ounces (115g) cream cheese, softened at room temperature", "1/4 cup (25g) grated Parmigiano-Reggiano cheese", "1 small shallot, minced", "2 medium cloves garlic, minced", "Kosher salt and freshly ground black pepper", "1 1/2 cups (6 ounces) shredded mozzarella cheese", "2 cups (4 ounces) raw baby spinach, chopped", "8 ounces (225g) canned artichokes, drained and chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using Only the Oven:</strong> Preheat oven to 375&deg;F (190&deg;C). Using a fork or paring knife, puncture potatoes in several spots. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet, or directly on an oven rack, and bake until a fork can easily be inserted into the center of each potato, about 1 hour. If setting potatoes directly on oven rack, set a sheet of foil on the rack below to catch any oil drips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using the Microwave and Oven:</strong> Preheat oven to 450&deg;F (230&deg;C). Using a fork or paring knife, puncture potatoes in several spots. Microwave potatoes for 5 minutes. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet, or directly on an oven rack, and bake until a fork can easily be inserted into the center of each potato, about 20 minutes. If setting potatoes directly on oven rack, set a sheet of foil on the rack below to catch any oil drips.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let potatoes rest 5 minutes. Meanwhile, in a large mixing bowl, stir together sour cream, cream cheese, parmesan cheese, shallot, and garlic. Season with salt and pepper. Slice each potato open lengthwise and carefully scoop flesh into the mixing bowl with the dip base. Mash the potatoes with a fork while mixing with the other ingredients, then fold in mozzarella cheese, artichokes, and spinach.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop potato mixture back into the baked potato skins and shape back into the classic baked potato shape. Return to oven and cook until the cheese has melted and begun to brown in spots, about 5 minutes. Serve warm.</p>"}]}