{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/08/oreoicecream.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["BraveTart", "cookie", "dessert", "ice cream", "Oreo"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Oreo Ice Cream", "link": "https://www.seriouseats.com/recipes/2017/08/homemade-oreo-ice-cream-recipe.html", "description": "This ice cream may look like plain chocolate, but it's not&mdash;it's a super concentrated version of cookies 'n cream. Its rich flavor and color come from crushed Oreo wafers (which you can feel free to buy or <a href=\"http://www.seriouseats.com/2017/08/how-to-make-oreo-style-cookies-from-scratch.html\">make from scratch</a>), with a handful of crushed sandwich cookies folded in at the end. It tastes just like Oreos, but in a creamy, scoop-shop form.", "totalTime": "5 hours", "recipeYield": "makes 1 quart", "recipeCategory": ["Chocolate", "Cookies", "Ice Cream and Frozen Treats", "Stovetop", "Thanksgiving"], "recipeIngredient": ["5 1/2 ounces plain or <a href=\"http://www.seriouseats.com/recipes/2016/05/dry-toasted-sugar-granulated-caramel-recipe.html\">Toasted Sugar</a> (about 3/4 cup; 145g)", "4 ounces egg yolk (about 1/2 cup; 110g), from about 8 large eggs", "3/4 teaspoon (3g) Diamond Crystal kosher salt, plus more as needed; for table salt, use half as much by volume or use the same weight", "6 3/4 ounces Oreo wafer crumbs (about 1 1/2 cups; 190g), from store-bought or <a href=\"http://www.seriouseats.com/recipes/2017/08/bravetart-homemade-oreo-style-cookies-recipe.html\">homemade cookies</a>", "11 ounces whole milk (about 1 1/4 cups plus 2 tablespoons; 310g)", "9 ounces heavy cream (about 1 cup plus 2 tablespoons; 255g)", "1/4 ounce vanilla extract (about 1/2 tablespoon; 7g)", "3 ounces roughly chopped Oreo sandwich cookies (about 1/2 cup; 85g), from store-bought or <a href=\"http://www.seriouseats.com/recipes/2017/08/bravetart-homemade-oreo-style-cookies-recipe.html\">homemade cookies</a> (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine sugar, egg yolks, and salt in a 3-quart stainless steel saucier, then whisk in cookie crumbs, milk, and cream. Cook over medium-low heat for a few minutes, until warm to the touch. Increase heat to medium and cook, stirring and scraping constantly with a flexible spatula, until you can see steam rising from the custard and it registers 155&deg;F (68&deg;C) on an instant-read thermometer, about 8 minutes. Pour through a fine-mesh sieve into a large stainless steel bowl, pressing gently with a flexible spatula to release the liquid trapped in the crumbs, then stir in the vanilla.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a sink compartment or extra-large bowl with a few inches of ice water and place bowl with custard inside, stirring from time to time, until cool, about 30 minutes. Cover and refrigerate until no warmer than 40&deg;F (4&deg;C), about 4 hours. (The ice cream base can be kept refrigerated for up to 1 week.) Churn in an ice cream machine according to the manufacturer’s directions. Meanwhile, place a 1-quart container and flexible spatula in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ice cream looks thick and light, shut off the machine; if desired, fold in crushed cookies with the chilled spatula, then transfer ice cream to the chilled container. Enjoy as soft-serve, or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until hard, about 4 hours. </p>"}]}