{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/06/buttermilkgranola.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "breakfast", "buttermilk", "chia", "dried", "granola", "oat", "rolled oat", "wheat germ"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.7777777777778", "ratingCount": "18"}, "name": "Crisp Homemade Granola", "link": "https://www.seriouseats.com/recipes/2017/06/crispy-homemade-granola-recipe.html", "description": "Say hello to the lightest, crispiest, clumpiest granola around. The secret is buttermilk, which soaks into the grains to tenderize them from the inside out, giving this granola a wonderfully delicate crunch. The oats bake low and slow, picking up notes of caramel and brown butter along the way, with a deep graham flavor from a bit of added wheat germ.", "totalTime": "About 3 1/2 hours", "recipeYield": "Makes 9 1/2 cups", "recipeCategory": ["Baking", "Breakfast and Brunch", "Father's Day", "Granola", "Mother's Day", "Other Grains"], "recipeIngredient": ["<strong>For the Granola:</strong>", "12 ounces old-fashioned rolled oats, not instant, quick, or steel-cut (about 3 1/2 cups; 340g)", "1 1/2 ounces wheat germ (about 1/3 cup plus 1 tablespoon; 40g)", "1 ounce flax seeds, optional (about 3 tablespoons; 30g)", "1/2 ounce chia seeds (about 1 heaping tablespoons; 15g)", "8 ounces buttermilk (about 1 cup; 225g)", "4 ounces unsalted butter, melted (about 8 tablespoons; 115g)", "7 ounces plain or toasted sugar (about 1 cup; 200g)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "<strong>For the Mix-Ins:</strong>", "4 1/4 ounces raw pumpkin seeds (about 3/4 cup; 120g)", "2 1/2 ounces chopped almonds (about 1/2 cup; 70g)", "2 1/4 ounces pecan pieces (about 1/2 cup; 65g)", "1 teaspoon neutral oil, such as safflower", "1/8 teaspoon Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "4 ounces dried apricots, quartered (about 1/2 cup, firmly packed; 115g)", "3 ounces dried tart cherries (about 1/2 cup; 85g)", "2 ounces dried blueberries (about 1/3 cup, firmly packed; 55g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Granola: </strong> In a medium bowl, combine rolled oats, wheat germ, flax seeds (if using), and chia. Toss with a flexible spatula to combine, then stir in buttermilk and melted butter. Cover with plastic or a kitchen towel and set aside until oats are stiff and dry, about 20 minutes (the chia will look a little fuzzy, but that's normal). Stir in sugar and salt, cover, and let stand until the mixture looks loose and damp from the dissolved sugar, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mix-Ins: </strong> Meanwhile, adjust oven rack to middle position and preheat to 350&deg;F. Combine pumpkin seeds, chopped almonds, and pecan pieces on a parchment-lined half-sheet pan and toast until fragrant and just beginning to brown, about 10 minutes. Transfer to a large bowl, toss with oil, then sprinkle with salt; reserve the parchment-lined half-sheet pan. Stir in dried apricots, dried cherries, and dried blueberries too.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Bake the Granola: </strong> Reduce oven temperature to 300&deg;F. When the sugar has dissolved, scrape oats onto the parchment-lined half-sheet pan and spread into an even layer. Bake until uniformly golden brown and dry to the touch, about 100 minutes, pausing every 25 minutes or so to take the mixture from the oven to stir well with a pair of forks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the oats are golden brown and dry to the touch, transfer to the bowl of fruit and nuts. Toss with a flexible spatula until well combined, then return to the baking sheet and spread in an even layer to cool, about 45 minutes. As soon as the granola has cooled, transfer to an airtight container and store up to 6 weeks at room temperature.</p>"}]}