{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/07/20170711-crostini-matt-clifton-12.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "Italian", "keywords": ["burrata", "cheese", "crostini", "Italian", "mozzarella", "summer", "toast", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crostini With Blistered Cherry Tomatoes, Burrata and Chive Oil", "link": "https://www.seriouseats.com/recipes/2017/07/crostini-blistered-cherry-tomatoes-burrata-recipe.html", "description": "The building blocks of a classic Caprese salad are re-imagined in these summery toasts. First, cherry tomatoes are blistered in a skillet until bursting with juice. Then creamier burrata takes the place of the more standard mozzarella. And in place of basil leaves, a quick and easy chive oil adds an herbal accent. The result makes for a great snack or light meal.", "totalTime": "40 minutes", "recipeYield": "Makes 10-12 crostini", "recipeCategory": ["Cheese", "Italian", "Snacks", "Stovetop", "Summer", "Tomato", "Vegetarian"], "recipeIngredient": ["1 large bunch fresh chives (2 1/4 ounces/65g)", "1/2 cup canola or other neutral oil", "2 pints heirloom cherry tomatoes (1 1/4 pounds/565g)", "1/2 cup extra-virgin olive oil (120ml), plus more for drizzling and brushing", "3 medium cloves garlic, sliced", "Kosher salt and freshly ground black pepper", "1 baguette, cut on a bias into about twelve 1/4 inch thick slices", "1 large ball burrata (see note), torn into large chunks", "Micro greens or minced chives, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (175&deg;C). Bring a medium pot of water to a full boil and prepare an ice bath. Blanch the chives in boiling water for 1 minute, then transfer to the ice water. Once cold, drain and dry chives as much as possible in paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put chives in a blender with the canola oil and blend at high speed until completely smooth, about 1 minute. Let stand 15 minutes. Strain into a clean bowl through a fine-mesh strainer (or cheese cloth-lined sieve), pressing gently to extract all the oil; discard solids. Transfer chive oil to a jar or plastic squeeze bottle. The oil can be refrigerated for up to 3 weeks; bring to room temperature before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 10-inch cast iron or other heavy skillet, heat oil over high heat until shimmering. Add tomatoes and cook without stirring until they blister and char on bottom side, about 1 minute. Stir gently and cook until blistered in a few more spots, 1 to 2 minutes longer (they should be blistered and lightly browned in spots, but not falling apart). Remove from heat, add garlic and stir until the tomatoes soften and the garlic is fragrant, about 1 minute (if the pan isn’t hot enough, return to low heat). Season with salt and pepper. Transfer to a bowl, drizzle with fresh olive oil and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush both sides of each baguette slice with olive oil. Arrange on a baking sheet and bake for 5 minutes. Flip and cook until toasts are light golden brown, about 3 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top each toast with tomatoes and their juices. Drape a piece of burrata on top of each toast, then drizzle on chive oil. Season with salt and pepper, and garnish with micro greens or minced chives, if desired.</p>"}]}