{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/06/IMG_0023-3%20export.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "Korean", "keywords": ["beef", "burger", "grilling", "kimchi", "Korean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2", "ratingCount": "5"}, "name": "Grilled Korean Bulgogi Burgers With Kimchi Mayo and Pickled Daikon", "link": "https://www.seriouseats.com/recipes/2017/06/korean-bulgogi-burgers-recipe.html", "description": "When we want the flavors of Korean <em>bulgogi</em> (grilled marinated beef) and the convenient outdoor grilling method of a burger, there's an easy solution: combine them. By sticking with a classic burger patty, glazing it with a flavorful sauce, and stacking it with spicy kimchi mayo and pickled daikon radish, you can keep the best of both worlds without offending culinary purists.", "totalTime": "1 hour", "recipeYield": "Makes 4 burgers", "recipeCategory": ["Beef", "Burger", "Grilling, Smoking, and Barbecue", "Korean", "Summer"], "recipeIngredient": ["<strong>For the Bulgogi Sauce:</strong>", "1/2 cup (120ml) soy sauce", "1 1/2 tablespoons (20ml) <em>gochujang</em> (spicy Korean red pepper paste)", "3 large cloves garlic, grated or minced", "1 tablespoon grated peeled fresh ginger (from about one 2-inch knob)", "1 tablespoon (15ml) rice wine vinegar", "1/4 cup (50g) brown sugar", "2 teaspoons (10ml) toasted sesame oil", "<strong>For the Kimchi Mayo:</strong>", "1 cup (215g) mayonnaise", "2 tablespoons (30ml) kimchi brine", "1/2 cup finely diced drained kimchi (100g)", "1 teaspoon (4g) sugar", "1 tablespoon (15ml) toasted sesame oil", "1 small clove garlic, grated or minced", "2 scallions, white and light green parts only, finely chopped (about 40g)", "<strong>For the Burgers:</strong>", "1 1/2 pounds (680g) fresh ground beef chuck (about 80% lean)", "Kosher salt", "Vegetable oil, for oiling the grill", "2 tablespoons (10g) toasted sesame seeds", "4 sesame seed buns, split", "2 cups (about 200g) finely shredded quartered and cored red cabbage", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2017/03/danmuji-korean-pickled-daikon-radish-recipe.html\">danmuji</a> (Korean pickled daikon radish), prepared following the recipe but using thin rounds of daikon instead of strips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Bulgogi Sauce:</strong> In a small saucepan, mix soy sauce, gochujang, garlic, ginger, vinegar, and brown sugar together. Bring mixture to a boil over medium-high heat, reduce to a simmer, and cook until thickened enough to coat a spoon, 5 to 7 minutes. Remove from heat, add sesame oil and let cool. Use immediately or refrigerate in an airtight container for up to 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Kimchi Mayo:</strong> In a medium mixing bowl, stir together mayonnaise, kimchi brine, kimchi, sugar, sesame oil, garlic, and scallions until well combined. Refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Burgers:</strong> Form beef into 4 patties, about 1/2 inch wider than the burger buns. Using your thumb, press a depression into the center of each patty to prevent bulging during cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place patties directly over hot coals, cover with vents open, and cook, turning occasionally. When patties are well charred and the centers register 110&deg;F on an instant-read thermometer, brush each with the bulgogi sauce on both sides. Continue cooking burgers, flipping and brushing with sauce occasionally, until they register 120&deg;F for medium-rare or 130&deg;F for medium.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove patties from grill and brush with more sauce on both sides until well glazed and coated. Sprinkle all over with sesame seeds and let rest 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, toast burger buns over moderate heat on grill until light golden brown. Spread bottom and top buns with kimchi mayonnaise. Layer bottom buns with half the cabbage followed by the danmuji, and patties. Brush top side of patties once more with bulgogi sauce, then top with remaining cabbage, close top buns, and serve.</p>"}]}