{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/03/20170224-one-pan-salmon-curried-leeks-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Indian", "keywords": ["easy", "fish", "leek", "one pot", "One Pot Wonder", "quick", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "One-Skillet Salmon With Curried Leeks and Yogurt-Herb Sauce", "link": "https://www.seriouseats.com/recipes/2017/04/one-pot-salmon-curried-leeks-yogurt-sauce-recipe.html", "description": "This easy one-pan dinner&mdash;seared salmon on a bed of curried leeks, with a cooling cucumber-yogurt sauce on the side&mdash;doesn't sacrifice flavor for convenience.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Father's Day", "Gluten-Free", "Indian", "Mains", "Mother's Day", "One-Pot Wonders", "Other Vegetables", "Quick and Easy", "Quick Dinners", "Salmon", "Stovetop"], "recipeIngredient": ["4 (6-ounce; 170g) skin-on, center-cut salmon fillets", "Kosher salt and freshly ground black pepper", "4 tablespoons (60ml) extra-virgin olive oil, divided", "3 pounds leeks (1.4kg; about 4 medium leeks), white and light green parts only, cut into long, thin strips (about 4 inches by 1/4 inch)", "1 1/2 teaspoons curry powder", "3/4 cup (180ml) yogurt", "1 (4-ounce; 115g) piece English cucumber (from one 10-ounce cucumber), peeled and very finely minced or grated", "1 small clove garlic, minced", "1 packed tablespoon minced fresh herbs, such as mint, dill, and/or parsley", "Juice of 1 lemon, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325&deg;F (163&deg;C). Dry salmon very well with paper towels, then season all over with salt and pepper. In a large cast iron, carbon steel, or stainless steel skillet, heat 2 tablespoons (30ml) oil over medium-high heat until shimmering. Reduce heat to medium-low, then add a salmon fillet, skin side down. Press firmly in place for 10 seconds, using the back of a flexible fish spatula, to prevent skin from buckling. Add remaining fillets one at a time, pressing each with spatula for 10 seconds, until all fillets are in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, pressing gently on back of fillets occasionally to ensure skin makes good contact with pan, until skin releases easily from pan and is crispy, about 6 minutes. Transfer salmon, skin side up, to a platter and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add remaining 2 tablespoons (30ml) oil to skillet and heat over medium-high heat until shimmering. Add leeks and cook, stirring, until they begin to soften and compress (tongs can help move them around more efficiently), about 3 minutes. Add curry powder and stir well to combine. Continue cooking until leeks are very tender, about 6 to 8 minutes longer. Lower heat at any point to prevent scorching. Season with salt and pepper (be careful, as some curry powders contain salt).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange salmon on top of leeks, skin side up, and transfer to oven. Cook salmon until an instant-read thermometer registers 110&deg;F (43&deg;C) in the very center for rare, 120&deg;F (49&deg;C) for medium-rare, or 130&deg;F (54&deg;C) for medium, 5 to 7 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a medium bowl, whisk together yogurt, cucumber, garlic, and herbs. Season with salt and pepper, then add lemon juice, 1 teaspoon at a time, to taste. (Yogurt sauce can also be made in advance and refrigerated up to 5 hours before serving.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer salmon and curried leeks to plates and spoon cold yogurt sauce alongside. Serve.</p>"}]}