{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/04/20170405-salisbury-steak-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "American", "keywords": ["american", "beef", "mushroom", "pan sauce", "pork", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2222222222222", "ratingCount": "9"}, "name": "Salisbury Steak With Mushroom Brown Gravy", "link": "https://www.seriouseats.com/recipes/2017/04/salisbury-steak-brown-gravy-pan-sauce-recipe.html", "description": "A flavorful mixture of beef and pork, formed into a steak-like patty, pan-fried, and served with a rich and meaty mushroom brown gravy.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["American", "Beef", "Father's Day", "Mains", "Mother's Day", "Mushrooms", "Pork", "Quick Dinners", "Stovetop"], "recipeIngredient": ["4 ounces crustless white sandwich bread (115g; about 4 slices), diced", "1/3 cup (80ml) milk", "1 teaspoon (about 4g) cornstarch", "1 1/2 cups (355ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> chicken stock or store-bought low-sodium chicken broth (see note)", "1 1/2 pounds (680g) ground beef, preferably about 20% fat", "1/2 pound (225g) ground pork", "1 medium yellow onion (10 ounces; 285g), half finely minced and half diced, divided", "2 large egg yolks", "4 teaspoons (18g) Diamond Crystal kosher salt (for table salt, use half as much by volume or use the same weight), plus more as needed", "Freshly ground black pepper", "1 teaspoon (about 4g) onion powder", "1 teaspoon (about 4g) garlic powder ", "1/4 teaspoon (1ml) good-quality liquid smoke, such as Wright's or Colgin (optional; see note)", "2 tablespoons (30ml) vegetable oil or other neutral cooking oil, plus more if needed", "10 ounces (285g) cremini or button mushrooms, stemmed, caps thinly sliced", "2 teaspoons (10ml) ketchup or tomato paste ", "2 teaspoons (10ml) Worcestershire sauce", "1 tablespoon (15g) unsalted butter ", "Apple cider vinegar, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine bread with milk and soak well, breaking up bread pieces with your fingers until no firm or dry bits remain. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a measuring cup or medium bowl, combine cornstarch with a couple tablespoons chicken stock, stirring to form a smooth slurry with no lumps. Add remaining stock, stir well, and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixing bowl, combine ground beef, ground pork, minced yellow onion, egg yolks, salt, a very generous grating of black pepper, onion powder, garlic powder, and liquid smoke (if using). Add bread mixture, along with any liquid. Using clean hands, mix well until all ingredients are thoroughly combined. (Alternatively, you can use a stand mixer fitted with a paddle attachment to combine these ingredients; scrape down sides occasionally.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a grape-sized ball of meat mixture on a small plate and cook in microwave or in a small nonstick skillet on the stovetop until cooked through (about 15 seconds on high power if using microwave). Taste, then adjust seasoning if desired. Cook another small sample and adjust again if desired. (This recipe purposely makes a tiny bit more meat mixture than you will need so that you can taste and adjust seasonings as necessary.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Form meat mixture into 4 baseball-sized balls; you may have a small amount left, depending on how much you used for the samples. Flatten each ball into an oblong, steak-like shape about 3/4 inch thick and place on a parchment-lined baking sheet. Using a finger, form dimples all over top side of each ground-meat steak.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large cast iron skillet, heat oil over medium-high heat until shimmering. Add ground-meat steaks, dimpled side up, and lower heat to medium. Cook, using a thin metal spatula to rotate steaks for even browning, until browned on one side, about 8 minutes. Flip steaks and repeat on other side until browned, about 8 minutes longer. Adjust heat as necessary to ensure steaks brown but don't burn on either side. Continue cooking and turning steaks every couple minutes until an instant-read thermometer inserted into the center of the steaks registers 145&deg;F (63&deg;C). Transfer steaks to a platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Increase heat to medium-high and add mushrooms to skillet, scraping and stirring until mushrooms release their liquid and you can scrape up browned bits on bottom of pan, about 1 minute; add extra oil at any point if pan seems too dry. Continue cooking, stirring occasionally, until mushroom liquid has evaporated and mushrooms begin to brown, about 6 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add diced onion and cook, stirring, until onion releases its liquid and you can scrape up browned bits from mushrooms on bottom of pan, about 1 minute. Continue cooking until onion liquid evaporates and onion is softened and beginning to turn lightly golden, about 2 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in ketchup or tomato paste and cook, stirring, for 30 seconds. Stir stock mixture to lift any settled cornstarch from the bottom, then add to skillet and bring to a simmer, stirring and scraping up any browned bits. Continue to cook until stock has reduced by about one-third and has thickened slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in Worcestershire sauce and season with salt and pepper. Lower heat and add butter, stirring vigorously, until butter has melted and a smooth, emulsified sauce forms that lightly coats the back of a spoon. Add just enough vinegar to taste to balance out the sauce. (Use small increments of about 1/2 teaspoon, tasting after each addition to ensure you don't add too much.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return steaks to skillet along with any accumulated juices, spoon sauce all over, and simmer gently until warmed through. Serve right away.</p>"}]}