{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20170125-tonkatsu-japanese-pork-chicken-katsu-cutlet-recipe-02-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Japanese", "keywords": ["chicken", "cutlet", "easy", "fried chicken", "Japanese", "katsu", "pork", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Tonkatsu or Chicken Katsu (Japanese Breaded Pork or Chicken Cutlets)", "link": "https://www.seriouseats.com/recipes/2017/04/tonkatsu-chicken-pork-katsu-japanese-breaded-cutlets-recipe.html", "description": "Crispy, golden-brown, and juicy breaded and fried pork or chicken cutlets, Japanese-style.", "totalTime": "30 minutes (plus 4 to 8 hours, if resting meat before cooking)", "recipeYield": "Serves 2", "recipeCategory": ["Deep Frying", "Fried Chicken", "Japanese", "Mains", "Pork", "Quick and Easy", "Quick Dinners", "Stovetop", "The Food Lab"], "recipeIngredient": ["2 boneless, skinless chicken breast halves, about 8 ounces (225g) each; or 4 boneless, skinless chicken thighs, 4 to 5 ounces (110 to 140g) each; or 4 boneless pork sirloin cutlets, 4 to 5 ounces (110 to 140g) each", "Kosher salt and freshly ground black pepper", "1 cup all-purpose flour (about 5 ounces; 140g)", "3 large eggs, thoroughly beaten", "1 1/2 cups Japanese-style panko bread crumbs (about 5 ounces; 140g)", "Vegetable, canola, or peanut oil, for frying", "<strong>To Serve:</strong>", "Finely shredded green cabbage", "Lemon wedges", "Steamed white rice", "Japanese-style pickles (<em>sunomono</em>), optional", "<a href=\"http://www.seriouseats.com/recipes/2012/09/tonkatsu-sauce-japanese-barbecue-recipe.html\">Homemade</a> or store-bought <em>tonkatsu</em> sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using Chicken Breasts:</strong> Cut each breast half into 2 cutlets. Place them, one at a time, in a heavy-duty zipper-lock bag and pound gently to 1/4-inch thickness, using a meat pounder or the bottom of a heavy 8-inch skillet. (See <a href=\"http://www.seriouseats.com/2015/07/knife-skills-how-to-cut-chicken-breasts-into-cutlets.html\">this guide</a> for step-by-step directions.) Season generously with salt and pepper. For best results, let them rest in the refrigerator for at least 4 hours and up to overnight after seasoning. Proceed to step 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using Thighs or Pork Cutlets:</strong> Place thighs or cutlets, one at a time, in a heavy-duty zipper-lock bag and pound gently to 1/4-inch thickness, using a meat pounder or the bottom of a heavy 8-inch skillet. Season generously with salt and pepper. Proceed immediately to step 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill 3 wide, shallow bowls or high-rimmed plates with flour, beaten eggs, and panko, respectively. Working with one thigh or cutlet at a time, dredge in flour with your first hand, shaking off excess. Transfer to egg dish, then turn thigh or cutlet with your second hand to coat both sides. Lift and allow excess egg to drain off, then transfer to bread crumb mixture. With your first hand, scoop bread crumbs on top of thigh or cutlet, then gently press, turning to ensure a good layer of crumbs on both sides. Transfer thigh or cutlet to a clean plate and repeat with remaining meat. If this is done properly, your first hand should touch only dry ingredients, while your second hand should touch only wet, making the process less messy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large cast iron or stainless steel skillet with 1/3 inch oil. (To speed things up even more, use 2 skillets simultaneously.) Heat over high heat until shimmering and just shy of smoking, about 350&deg;F (175&deg;C) on an instant-read thermometer.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs or your fingers, gently lower cutlets into hot fat, laying them down away from you to prevent hot fat from splashing toward you. (Work in batches if necessary.) Fry, gently swirling pan and rotating cutlets for even browning, and adjusting heat as necessary for a steady, vigorous bubble (around 300 to 325&deg;F; 150 to 160&deg;C), until bottom side is set, about 1 1/2 minutes. Flip cutlets and fry until other side is set, about 1 1/2 minutes longer. Continue cooking, swirling frequently and flipping occasionally, until well browned on both sides, about 3 minutes longer. Transfer to paper towels to drain and season with salt right away. Repeat with remaining cutlets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice katsu into thin strips and serve immediately with shredded cabbage, lemon wedges, white rice, Japanese pickles (if desired), and tonkatsu sauce.</p>"}]}