{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/11/cranberryscotchpunch.jpg", "author": {"@type": "Person", "name": "Maggie Hoffman"}, "recipeCuisine": "", "keywords": ["cocktail", "cranberry", "punch", "scotch"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sweater Weather Punch (Scotch and Cranberry Cocktail)", "link": "https://www.seriouseats.com/recipes/2017/11/thanksgiving-easy-punch-large-batch-cocktail-scotch-whisky-cranberry-spice-recipe.html", "description": "This punch smacks you with tartness, with the drying tannins of cranberry. This punch whirls with spices: It's gingery and cinnamon-y, with hidden herbs and a cleansing bitter edge. This is a real cocktail, dressed up in festive garb.", "totalTime": "55 minutes plus one day freezing for ice block", "recipeYield": "Makes 12 servings", "recipeCategory": ["Christmas", "Cranberry", "Fall", "Liqueur and Fortified Wines", "Thanksgiving", "Whiskey", "Winter"], "recipeIngredient": ["4 1/2 ounces (130ml) marmalade ", "9 ounces (270ml) unsweetened 100% cranberry juice, such as Knudsen Just Cranberry", "12 ounces (360ml) oloroso sherry", "6 ounces (180ml) Becherovka (see note)", "6 ounces (180ml) blended Scotch", "1 pinch kosher salt", "3 dashes Angostura bitters ", "3 ounces (90ml) fresh juice from 3 lemons", "6 ounces (180ml) fresh juice from 3 to 4 oranges", "Thinly sliced lemon wheels and whole cranberries, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, bring 4 1/2 ounces (130ml) water to a boil over medium-high heat, then add marmalade and whisk until fully incorporated. Remove from heat and let cool. (If you prefer a punch without any orange bits in it, use an immersion blender to blend until smooth.) Refrigerate in a sealed container up to 1 week.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At least 1 day before serving, make a large ice block by freezing water in a cake pan or Tupperware container that will fit in your punch bowl. Alternately, make several trays of large ice cubes. In addition, you'll want about 4 standard trays of ice cubes for serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 2 1/2- or 3-quart pitcher or other large container, stir together marmalade syrup, unsweetened cranberry juice, 8 ounces (240ml) water, sherry, Becherovka, and Scotch. The punch can be refrigerated, covered, up to 24 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, stir punch well. Add salt, Angostura bitters, lemon juice, and orange juice and stir again. Pour into a large punch bowl and add ice block or large ice cubes. Garnish bowl with lemon wheels and cranberries. Ladle into ice-filled glasses to serve. </p>"}]}