{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/07/20170718-zucchini-fritters-matt-clifton9.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "", "keywords": ["corn", "fritter", "summer", "summer squash", "zucchini"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Zucchini-and-Corn Fritters With Herb Sour Cream", "link": "https://www.seriouseats.com/recipes/2017/07/zucchini-corn-fritters-herb-sour-cream-recipe.html", "description": "If you grow your own summer squash, belong to a CSA, or just shop at a farmers market, the weekly haul of zucchini and corn can be overwhelming. Our solution? Shred it, squeeze it, mix it into a cheesy batter, and fritter it away. Literally. Next thing you know, you'll be wanting even more.", "totalTime": "40 minutes", "recipeYield": "Makes about 15 fritters", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Corn", "Sides", "Stovetop", "Summer", "Vegetarian", "Zucchini"], "recipeIngredient": ["<strong>For the Herb Sour Cream:</strong>", "1 cup sour cream or Greek yogurt (8 ounces)", "1/2 teaspoon lemon zest (about half a lemon)", "3 tablespoons minced fresh basil leaves", "2 tablespoons minced fresh chives", "1 anchovy fillet, finely minced (optional; omit to keep the dish vegetarian)", "Kosher salt and freshly ground black pepper", "<strong>For the Fritters:</strong>", "​2 pounds (900g; about 4 medium) zucchini or other summer squash, ends trimmed", "1 medium yellow onion (10 ounces/280g), peeled ", "1 1/2 teaspoons kosher salt, divided", "2 ears corn, kernels cut from cob (about 1 cup; 8 ounces/225g)", "2 large eggs, lightly beaten", "1 large garlic clove, grated or minced", "1/4 teaspoon freshly ground black pepper", "1 cup all-purpose flour (4 1/4 ounces/120g)", "1 teaspoon baking powder", "1 cup (4 ounces/115g) shredded Gruyère or cheddar cheese", "Olive oil or vegetable oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Herb Sour Cream:</strong> In a medium bowl, mix together sour cream (or yogurt), lemon zest, basil, chives, and anchovy (if using). Season with salt and pepper. Set aside or refrigerate until ready to serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fritters:</strong> Preheat oven to 250&deg;F (120&deg;C) and set a wire rack in a rimmed baking sheet. Grate zucchini on the large holes of a box grater, or use the shredding blade of a food processor. Transfer shredded zucchini to colander set over a bowl or in the sink. Repeat with the onion, then add to the zucchini.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss zucchini and onion with 1 teaspoon salt and let stand for 10 minutes. Using your hands or a clean dish towel, squeeze out as much of the liquid  from the zucchini and onion as possible. Transfer zucchini mixture to a large bowl and add corn kernels. Stir in eggs, garlic, black pepper, flour, baking powder, and shredded cheese until thoroughly combined and no dry flour remains.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large cast iron or heavy stainless steel skillet, heat 2 tablespoons oil over medium-high heat until shimmering. Working in batches to avoid crowding the pan, carefully drop scant 1/3 cupfuls of the zucchini batter into the skillet, then press down on them with the cup measure to flatten them to about 1/4 inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook until the bottom side is golden brown, about 4 minutes (the corn will have a tendency to pop in the hot pan, so be careful; you may want to use a splatter guard or lid to shield yourself). If the fritters darken too quickly, reduce the heat to medium. Flip the fritters and cook until browned on the other side, 2 to 3 minutes longer. Transfer fritters to the prepared baking sheet then keep warm in the oven. Repeat with remaining batter, keeping the pan well-oiled as you go.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve fritters warm, with a dollop of herb sour cream on top.</p>"}]}