{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/01/BAKEDBRIE.jpg", "author": {"@type": "Person", "name": "Emily and Matt Clifton"}, "recipeCuisine": "", "keywords": ["appetizer", "Bake", "brie", "cheese", "party", "snack", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Baked Brie en Croûte With Thyme and Fig Jam", "link": "https://www.seriouseats.com/recipes/2017/01/baked-brie-en-croute-puff-pastry-fig-jam-thyme-recipe.html", "description": "Offering maximum impact with minimal effort, a baked Brie turns a mild-mannered cheese into the superhero of a gathering: a warm, gooey communal comfort food. This version wraps the cheese in a shell of flaky puff pastry, along with a sweet-tart layer of fig jam and fresh thyme leaves.", "totalTime": "40 minutes (or 1 hour, if re-chilling is needed)", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Baking", "Cheese", "Christmas", "Fall", "Seasonal and Holiday", "Snacks", "Vegetarian", "Videos", "Winter"], "recipeIngredient": ["1 (6- to 8-ounce; 170 to 225g) round Brie or Camembert cheese, slightly chilled (see note)", "10-inch square chilled puff pastry dough", "All-purpose flour, for dusting", "Fig jam, for topping", "1/2 teaspoon picked fresh thyme leaves (from 2 medium stems)", "1 large egg beaten with 1 tablespoon (15ml) water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350&deg;F (177&deg;C). Using a sharp knife, score top rind of cheese in a crisscross pattern, spacing cuts about 1 inch apart.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place puff pastry on a lightly floured work surface and roll to an even 1/4-inch thickness. Set cheese in center of square, top with a few tablespoons of fig jam, and sprinkle thyme leaves on top. Fold dough up and over sides of cheese, pleating it neatly on top to enclose cheese. Gently pinch dough together in center to seal gathered pleats. You can tie a bit of kitchen twine on top to hold pleats together if you like, but this is not essential. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If dough is no longer cold, chill wrapped cheese for at least 20 minutes. (Prepared cheese wheel can be wrapped tightly with plastic wrap and refrigerated until ready to bake.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a baking sheet with parchment paper. Place wrapped cheese wheel on prepared baking sheet and brush evenly with egg wash. Bake until pastry is crisp and golden brown all over, 25 to 35 minutes. Let rest 5 minutes, then serve.</p>"}]}