{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20170419-spring-salad-crispy-egg-composite-1.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["asparagus", "egg", "fava", "pea", "poached egg", "salad", "snap pea", "spring", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Spring Vegetable Salad With Poached Egg and Crispy Bread Crumbs", "link": "https://www.seriouseats.com/recipes/2017/05/spring-vegetables-salad-with-poached-egg.html", "description": "The other day I had a salad of spring vegetables served with a soft boiled egg that had been breaded and deep fried until the outside was crispy golden brown but the interior was still soft and runny. It was delicious, but definitely not a dish designed for cooking at home.\r\n\r\nThis quick, cheaty version of the dish made with toasted breadcrumbs comes with all of that great texture and flavor, but without the hassle.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Asparagus", "Legumes", "Mains", "Poached Eggs", "Quick and Easy", "Quick Dinners", "Salads", "Spring", "Stovetop", "Vegetarian"], "recipeIngredient": ["12 ounces fava beans in their pods or 4 ounces shucked fava beans (120g shucked beans)", "12 ounces English peas in their pods or 4 ounces shucked peas (120g shucked peas)", "Kosher salt", "8 ounces asparagus, woody ends removed, stalks cut on a sharp bias at 1-inch intervals pieces (225g)", "6 ounces snap peas, strings removed, sliced on a sharp bias into 1/2-inch slices (170g)", "8 ounces broccolini, woody ends removed, cut on a sharp bias at 1-inch intervals pieces (170g)", "6 ounces stale hearty bread, crusts removed (170g)", "3 tablespoons unsalted butter (25g)", "2 tablespoons minced shallot, divided (about 1 small; 30g)", "2 tablespoons minced fresh parsley leaves", "2 tablespoons minced fresh chives", "Freshly ground black pepper", "1 tablespoon (15ml) juice and 2 teaspoons (5g) zest from 1 lemon", "3 tablespoons extra-virgin olive oil (45ml)", "4 <a href=\"http://www.seriouseats.com/recipes/2014/04/foolproof-poached-eggs-food-lab-recipe.html\">poached eggs</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using fava beans and peas in their pods, shuck the beans and peas from their pods, keeping them separate. Discard the pods. Bring a large pot of salted water to a boil and prepare an ice bath. Working with one vegetable at a time, blanch the favas, peas, asparagus, snap peas, and broccolini in the boiling water for 1 minute, transfer to the ice bath to cool, then transfer to a paper towel-lined tray and pat dry. Remove and discard the skins from each individual fava bean. Set vegetables aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tear the bread into small pieces and transfer to the bowl of a food processor, mini-chopper, or blender. Pulse until reduced to fine bread crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in a small skillet over medium heat until melted, then add bread crumbs and cook, stirring and tossing frequently, until golden brown and crisp, about 5 minutes. Add half of shallots and cook, stirring, until fragrant, about 30 seconds. Remove from heat, add half of parsley and half of chives, and toss to combine. Season mixture to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together lemon juice, lemon zest, and remaining shallot, parsley, and chives. Slowly drizzle in the olive oil, whisking constantly. Add the blanched vegetables, toss to combine, and season to taste with salt and pepper. Divide the vegetables between four serving plates or bowls, making a small indentation to place the egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the poached eggs to the skillet with the bread crumbs and turn them carefully to coat in crumbs. Place the eggs on top of the salad and spoon any remaining crumbs on top. Serve immediately.</p>"}]}