{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2017/12/CHOCOLATEMOUSSE.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["chocolate", "cream", "dairy", "dark chocolate", "milk", "mousse"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Eggless Chocolate Mousse", "link": "https://www.seriouseats.com/recipes/2017/12/eggless-chocolate-mousse.html", "description": "The creamy toffee notes of homemade condensed milk set this recipe apart from the custardy, yolk-rich profile of traditional chocolate mousse. The result is a dark, silky smooth chocolate custard that lightens to a mousse-like texture with the addition of freshly whipped cream. If you like, the chocolate base can be made up to a week in advance to help streamline dessert prep for special occasions.", "totalTime": "2 1/2 hours", "recipeYield": "Six 5 1/2 ounce portions", "recipeCategory": ["Chocolate", "Easter", "Father's Day", "Mother's Day", "Passover", "Puddings and Custards", "Stovetop", "Valentine's Day"], "recipeIngredient": ["<strong>For the Base:</strong>", "7 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted</a> sugar (1 cup; 195g)", "2 ounces Dutch cocoa powder, such as Cacao Barry Extra Brute (about 2/3 cup, spooned; 55g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "32 ounces milk, <a href=\"http://www.seriouseats.com/2017/01/is-it-okay-to-bake-with-skim-milk.html\">any percentage will do</a> (4 cups; 910g)", "6 ounces heavy cream (3/4 cup; 170g)", "<strong>For the Mousse:</strong>", "10 ounces heavy cream (about 1 1/4 cups; 285g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Base:</strong> Combine sugar, Dutch cocoa, and salt in a 5-quart stainless steel or enameled Dutch oven. When the cocoa is distributed into the sugar, whisk in the milk and cream. If you have a scale, weigh the pot and ingredients together so you can digitally track the reduction. Place over medium heat, stirring occasionally with a heat resistant spatula, until the milk begins to simmer, about 12 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Continue simmering an additional 30 minutes, scraping continuously to prevent a milky buildup from forming around the sides, until the mixture is as thick and dark as chocolate pudding and reduced to about 2 1/3 cups or 24 ounces. If using a scale, the pot will weigh 23 ounces less than when you started. Transfer to a wide dish, such as a 7- by 11-inch casserole, cover with plastic, and refrigerate until thick and cold, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with a whisk attachment, whip remaining cream to medium-stiff peaks. Meanwhile, stir the chilled cocoa-base until smooth. Fold in about half of the whipped cream, and, when well combined, gently fold in the rest. Immediately divide between individual dishes, using a pastry bag fitted with a star tip, if you prefer, then cover and refrigerate at least 30 minutes before serving. If you like, garnish with shaved chocolate, <a href=\"https://www.valrhona-chocolate.com/valrhona-chocolate-pearls-value-pack.html\">Crunchy Pearls</a>, fresh fruit, or dollops of unsweetened whipped cream.</p>"}]}