{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/02/20150126-mushroom-soup08.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "mushroom", "quick", "soup", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Quick and Easy Creamy Mushroom Soup", "link": "https://www.seriouseats.com/recipes/2017/02/easy-creamy-mushroom-soup-quick.html", "description": "The other I discovered some old mushrooms in the bottom of my fridge, most of them bruised and discolored. The bad news is that once mushrooms start showing discoloration or soft spots like that, they're not really any good for roasting or salads or even pizzas, where those flaws and soft spots make them kinda unappetizing. The good news is that they're still perfectly fine for creamy mushroom soup, where those flaws get blended away anyway. This recipe will work with pretty much any variety of mushroom I can think of, so go with whatever you like best.", "totalTime": "40 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Mushrooms", "Quick and Easy", "Sides", "Soups and Stews", "Stovetop", "Thanksgiving", "The Food Lab", "Vegetarian"], "recipeIngredient": ["4 tablespoons unsalted butter (50g)", "2 pounds mixed mushrooms such as button, cremini, portabello, or shiitake (1kg), sliced", "Kosher salt and freshly ground black pepper", "1 medium onion, finely chopped (about 8 ounces; 225g)", "4 medium cloves garlic, minced", "2 tablespoons flour (45g)", "1 cup dry sherry or white wine (235ml)", "1 cup milk (235ml)", "5 cups (1.2L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock, or water", "2 bay leaves", "2 sprigs fresh thyme", "Squeeze of lemon juice (optional)", "Minced fresh herbs such as parsley, chervil, tarragon, and chives for serving.", "Drizzle extra-virgin olive oil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a large saucepan or Dutch oven over medium-high heat. Add mushrooms, season with salt and pepper, and cook, stirring frequently, until liquid has evaporated and mushrooms are well-browned, about 12 minutes total. Add onion and cook, stirring, until softened, about 3 minutes. Add garlic and cook until fragrant, about 30 seconds. Add flour and stir to combine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sherry or wine and cook until reduced by about half, scraping up browned bits from the bottom of the pan. Add milk, chicken stock, bay leaves, and thyme sprigs and stir to combine. Bring to a bare simmer and cook for 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using tongs, remove bay leaves and thyme. Blend soup with an immersion blender or in batches using a countertop blender. Season to taste with more salt and pepper and a squeeze of lemon juice (if desired). Serve immediately, garnished with minced herbs and olive oil.</p>"}]}