{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/06/20170526-tiramisu-vicky-wasik-40.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "Italian", "keywords": ["Bake", "chocolate", "coffee", "custard", "dessert", "espresso", "Italian", "ladyfinger", "mascarpone", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4285714285714", "ratingCount": "7"}, "name": "Rich and Creamy Tiramisu", "link": "https://www.seriouseats.com/recipes/2017/06/best-tiramisu-recipe.html", "description": "Creamy, rich, and bursting with bold coffee flavors, tiramisu is one of my all-time favorite desserts. My version is less eggy than typical recipes, putting the mellow flavor of mascarpone front and center.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Chocolate", "Easter", "Italian", "Mother's Day", "Pastry", "Puddings and Custards", "Stovetop", "Thanksgiving", "Valentine's Day"], "recipeIngredient": ["<strong>For the Coffee Syrup:</strong>", "3/4 ounce Dutch-processed cocoa powder (about 1/4 cup; 20g), such as <a href=\"https://www.valrhona-chocolate.com/baking-products/valrhona-cocoa-powder-100.html\">Valrhona</a>", "5 ounces espresso or strong brewed coffee (about 2/3 cup; 140g), piping-hot", "2 ounces crème de cacao or other dark liqueur (about 1/4 cup; 55g); see note", "2 ounces Cardamaro or other mild amaro (about 1/4 cup; 55g); see note", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "<strong>For the Mascarpone Filling:</strong>", "5 large eggs (about 8 3/4 ounces; 245g)", "3 1/2 ounces sugar (about 1/2 cup; 100g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "24 ounces mascarpone (three 8-ounce containers; 680g), straight from the fridge", "<strong>To Assemble:</strong>", "About 30 ladyfingers, store-bought or <a href=\"http://www.seriouseats.com/2017/06/how-to-make-lady-fingers.html\">homemade</a>", "Dutch-processed cocoa powder, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Coffee Syrup:</strong> In a deep bowl, whisk together cocoa powder, hot espresso, crème de cacao, Cardamaro, and vanilla extract until homogeneous. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mascarpone Filling:</strong> Fill a 2- or 3-quart saucier with a few inches of water; bring to a boil, then lower heat and adjust to maintain a steady supply of steam. Combine eggs, sugar, and salt in the bowl of a stand mixer, using a flexible spatula to stir. Place over the steaming pot (if the bowl touches the bottom, crumple a strip of foil into a ring to act as a booster seat) and cook, stirring and scraping constantly, until warmed to 160&deg;F (71&deg;C), about 5 minutes. This should not take significantly longer; major delays simply indicate insufficient heat/lack of steam.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a stand mixer fitted with a whisk attachment. Whip on high speed until eggs are foamy, more than quadrupled in size, and thick enough to briefly mound up like soft-serve ice cream when dropped from the whisk, between 5 and 10 minutes depending on the horsepower of your mixer. Reduce speed to medium and begin adding mascarpone roughly 1/4 cup at a time; no need to wait between additions. Once mascarpone is incorporated, pause to scrape bowl with a flexible spatula, then resume whipping on medium-high until mixture is homogeneous and thick, about 5 to 10 seconds more. Don’t fret over small flecks of mascarpone, since they will smooth out on their own over time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble:</strong> Working with one at a time, dunk each ladyfinger in coffee syrup with a fork, giving it a second or two to absorb the liquid, then place in the bottom of a 7- by 11-inch baking dish. Top with about half the mascarpone filling, spread into an even layer, and dust lightly with cocoa powder. Repeat with remaining ladyfingers until syrup is gone, then top with remaining mascarpone filling and spread smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Decorate:</strong> Lay a long piece of butcher's twine on top of the smooth filling, curling it into swoops and swirls to create whatever sort of design you like, and dust generously with additional cocoa powder. Starting from the <em>end</em> of your design, carefully peel up twine and discard. (This twine step is optional; if you want, you can simply dust the top with cocoa powder.) Cover with plastic wrap and refrigerate until ready to serve, at least 1 hour. Serve with a large spoon or angled spatula. Tiramisu can be refrigerated for up to 10 days.</p>"}]}