{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/01/20170105-osso-bucco-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["braise", "fall", "Italian", "shank", "veal", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Osso Buco (Italian Braised Veal Shanks)", "link": "https://www.seriouseats.com/recipes/2017/02/osso-buco-italian-braised-veal-shanks-recipe.html", "description": "Osso buco is a classic Milanese dish of braised veal shanks in a hearty wine- and vegetable-based sauce. The marrow in the shank bones bathes everything in its rich flavor as it renders during the braise, while a bright mixture of parsley, lemon zest, and garlic (known as <em>gremolada</em> in Italian) finishes the dish off.", "totalTime": "4 hours", "recipeYield": "Serves 6", "recipeCategory": ["Beef", "Braising and Stewing", "Fall", "Italian", "Mains", "Mother's Day", "Other Meats", "Seasonal and Holiday", "Valentine's Day", "Winter"], "recipeIngredient": ["6 (1- to 1 1/2-inch-thick) pieces osso buco (veal shanks) (about 4 pounds; 1.8kg total)", "Kosher salt and freshly ground black pepper", "1 cup all-purpose flour (5 ounces; 140g)", "1/4 cup (60ml) extra-virgin olive oil, plus more if needed", "1 tablespoon unsalted butter (1/2 ounce; 15g)", "1 large yellow onion, minced (12 ounces; 340g)", "2 medium carrots, minced (6 ounces; 170g)", "1 celery rib, minced (4 ounces; 120g)", "3 medium cloves garlic, minced", "1 cup (235ml) dry white wine ", "3/4 cup (175ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken stock", "1 (28-ounce; 800g) can peeled whole tomatoes, seeded and drained, tomato flesh crushed by hand", "3 fresh thyme sprigs", "1 bay leaf", "<strong>For the Gremolada:</strong>", "2 tablespoons (about 20g) finely minced flat-leaf parsley leaves and tender stems", "Zest of 1 lemon, finely minced", "6 medium cloves garlic, finely minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 325&deg;F (163&deg;C). Season veal shanks all over with salt and pepper. If you have butcher's twine, you can tie a length of it tightly around the circumference of each shank; this can help them hold their shape during cooking, but is not absolutely necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add flour to a shallow bowl. In a large Dutch oven, heat olive oil over medium-high heat until shimmering. Working in batches, lightly dredge shanks all over in flour, shaking off excess, and add to Dutch oven; be careful not to over-crown the shanks. Cook shanks, turning occasionally, until lightly browned on both sides, about 4 minutes per side; lower heat as necessary at any point to prevent scorching. Transfer browned shanks to a platter and repeat with remaining shanks; add more oil to Dutch oven at any point if it becomes too dry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter to Dutch oven, along with onion, carrot, celery, and garlic. Cook, stirring, over medium-high heat until vegetables are softened and just starting to turn a light golden color, about 6 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add wine, stock, and tomatoes to Dutch oven, along with veal shanks and any accumulated juices. Try to arrange the shanks in as even a layer as possible (a little overlap is okay to make them fit). The liquid should nearly but not totally cover the shanks; if it doesn't, add more stock or water until it does. Add thyme and bay leaf. Bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare a parchment paper lid <a href=\"http://www.seriouseats.com/2016/04/how-to-make-a-parchment-paper-lid.html\">following these instructions</a> Cover shanks with parchment lid and transfer to oven. Cook for 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Gremolada:</strong> In a small bowl, stir together parsley, lemon zest, and garlic. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove parchment paper lid from shanks and continue cooking until they are fork-tender, about 1 hour longer. If the pot becomes too dry, add more stock or water as needed to keep it moist; evaporation and reduction are good, but the pot shouldn't go dry. Feel free to move the shanks around so that any that are submerged can be exposed to the oven air. During the last 20 minutes of cooking, stir in 1 to 2 teaspoons (5 to 10ml) gremolada, depending on how strong you want the lemon and garlic flavor to be.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully transfer shanks to a platter. (Using a spatula and tongs together can help prevent them from falling apart.) Using a spoon, carefully scrape off any excess fat on surface of braising juices. The liquid should be saucy and thick; you can adjust the consistency by adding either water or stock to thin the sauce, or simmering it on the stovetop until more fully reduced. Discard thyme and bay leaf and season with salt and pepper if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove twine from shanks, if used. Serve shanks on plates, spooning braising sauce on top and passing remaining gremolada at the table for diners to sprinkle as a garnish to their own taste; make sure to offer small spoons for scooping out marrow from bones. Osso buco is traditionally served with <a href=\"http://www.seriouseats.com/recipes/2016/03/risotto-alla-milanese-saffron-recipe.html\">Risotto alla Milanese</a>.</p>"}]}