{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/12/20171201_Rugelach-EmilyDryden-61.jpg", "author": {"@type": "Person", "name": "Cathy Barrow"}, "recipeCuisine": "Kosher", "keywords": ["Bake", "baking", "cookie", "hanukkah", "holiday", "Jewish", "pastry", "rugelach"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Everything-Bagel Rugelach With Onion Jam", "link": "https://www.seriouseats.com/recipes/2017/12/everything-bagel-rugelach-onion-jam-recipe.html", "description": "Who says rugelach have to be sweet? The dough easily switches teams when introduced to this savory onion jam&mdash;sultry and sticky, tangy and rich.", "totalTime": "3 hours", "recipeYield": "Makes 12 or 16 cookies, depending on form", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Baking", "Christmas", "Cookies", "Kosher", "Onion", "Snacks"], "recipeIngredient": ["<strong>For the Dough:</strong>", "4 1/4 ounces all-purpose flour (about 1 cup, spooned; 118g), plus more for dusting ", "4 ounces cold unsalted butter (8 tablespoons; 115g), cut into large cubes", "4 ounces cold cream cheese (8 tablespoons; 115g), cut into large cubes", "1/8 teaspoon Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "<strong>For the Filling:</strong>", "2 tablespoons (30ml) grapeseed or other neutral oil", "1 pound yellow onion, cut into 1/2-inch dice (about 3 cups)", "1 3/4 ounces (about 1/4 cup, firmly packed) light brown sugar", "2 tablespoons (30g) unsalted butter", "1/2 cup (120ml) black coffee", "1/4 cup (60ml) unsulfured molasses, <a href=\"http://www.seriouseats.com/2017/02/what-is-blackstrap-molasses.html\">not blackstrap</a>", "1/4 cup (60ml) apple cider vinegar", "1/2 teaspoon kosher salt", "1/4 teaspoon black pepper", "2 tablespoons sour cream or crème fraîche", "2 tablespoons fresh bread crumbs", "<strong>For the Everything-Bagel Spice Mix and to Finish (see note):</strong> ", "1 teaspoon poppy seeds", "1 teaspoon sesame seeds", "1 teaspoon coarse sea salt or pretzel salt", "1/2 teaspoon caraway or nigella seeds", "1/2 teaspoon dehydrated onion", "1/4 teaspoon dehydrated garlic", "1 egg yolk whisked with 1 teaspoon (5ml) cool water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> In the work bowl of a food processor, combine flour, butter, cream cheese, and salt. Pulse 4 to 5 times, then turn the processor on and process until the dough forms a shaggy ball, about 1 minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer dough to a lightly floured sheet of plastic wrap and lightly flour your hands. If making crescent cookies, gently form a disk 5 inches in diameter. If making sliced cookies, form dough into a 3- by 4-inch rectangle. Dust surface with flour and wrap tightly. Lightly press with a rolling pin to smooth, then lightly tap the disk or rectangle's edges on the counter. The smoother the edges, the less prone they will be to cracking later on. Chill until the dough registers 40&deg;F (4&deg;C) on an instant-read thermometer, about 1 hour. The dough may be frozen for 3 months; defrost overnight in the refrigerator to proceed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, adjust oven rack to middle position and preheat to 375&deg;F (190&deg;C). Stack 2 baking sheets and line the top one with parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> In a large heavy pan, such as a Dutch oven, heat oil over medium heat until shimmering. Add onions and stir to coat with oil. Cook, stirring regularly, until translucent. Add brown sugar and butter and increase heat to medium-high, cooking and stirring regularly, until onions are deep golden brown and smell sweet, about 8 to 10 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add coffee, molasses, vinegar, salt, and pepper. Bring to a boil, reduce heat to medium, and simmer until onions are jammy and very little liquid remains, about 20 minutes. Spread jam across a sheet tray to cool more quickly, cover, and refrigerate until cool, about 30 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, combine 4 ounces (1/2 cup) of onion jam with sour cream or crème fraîche and stir to combine. Remaining jam can be stored in a container in the refrigerator for up to 1 month.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Crescent-Style Rugelach:</strong> On a lightly floured surface, roll dough into a 9-inch circle, using a dinner plate and paring knife to trim edges. Spread filling over surface of dough using an offset spatula, leaving a 1/2-inch border. Sprinkle bread crumbs evenly over filling. Using a sharp knife, pastry wheel, or pizza cutter, cut disk into 16 equal wedges. Starting from the wide end of each long triangle, roll up and press on the pointy end to seal. Place seam side down on baking sheet. Repeat with remaining triangles, working quickly and placing cookies about 2 inches apart. Transfer baking sheet to the freezer for at least 20 minutes before proceeding. Alternatively, freeze hard and transfer to freezer bags or containers for up to 6 months; defrost in the refrigerator overnight to proceed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For Sliced Rugelach:</strong> On a lightly floured surface, roll dough into a 4- by 12-inch rectangle. Spread filling over surface of dough using an offset spatula, leaving a 1/2-inch border along the two 12-inch edges. Sprinkle bread crumbs evenly over filling. Starting at one 12-inch edge, tightly roll dough into a spiral. Aim to make 3 full revolutions, pressing seam firmly to seal. Place roll on baking sheet and freeze or refrigerate for at least 30 and no more than 45 minutes. (If chilled for longer, allow dough to warm very slightly at room temperature, so it will not crack when sliced.) Using a sharp knife, pastry wheel, or pizza cutter, cut roll into 12 cookies, each the shape of an <a href=\"https://www.mathsisfun.com/geometry/trapezoid.html\">isosceles trapezoid</a>. Keep the smaller edge of the trapezoid no less than 1/2 inch in length, and the larger edge no more than 1 1/2 inches in length. Place seam side down on baking sheet and transfer to freezer for at least 20 minutes before proceeding. Alternatively, freeze hard and transfer to freezer bags or containers for up to 6 months; defrost in the refrigerator overnight to proceed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Make the Everything-Bagel Spice Mix:</strong> Combine poppy seeds, sesame seeds, salt, caraway, onion, and garlic in a tightly sealed jar. The mixture will keep indefinitely.<br />\r\n</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish and Bake:</strong> Brush cookies' surface with egg wash using a small pastry brush. Sprinkle 3/4 teaspoon Everything-Bagel Spice Mix evenly over surface of cookies. Bake until browned and flaky, about 22 to 25 minutes. Some filling may squish out; that’s okay. The bottoms of the rugelach should be caramelized, not blackened. Transfer the cookies (still on the parchment) to a rack to cool completely, about 1 hour. Store in an airtight container, layered between sheets of wax paper, for up to 3 weeks, or freeze for up to 1 month.</p>"}]}