{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/02/20170210-buckwheat-custard-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "buckwheat", "custard", "dessert", "egg", "Japanese", "pudding"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Roasted-Buckwheat Custards (Soba-Cha Puddings)", "link": "https://www.seriouseats.com/recipes/2017/03/buckwheat-custards-pudding-soba-cha-dessert-recipe.html", "description": "These egg custards are rich and dense, with a silky-smooth texture. The secret ingredient is Japanese toasted-buckwheat tea (called <em>soba-cha</em>). Somewhat similar to chestnuts, the buckwheat adds a deeply nutty, roasted flavor that pairs beautifully with the lightly sweet dairy in the custards.", "totalTime": "5 hours 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Desserts", "Eggs", "Father's Day", "Gluten-Free", "Japanese", "Mother's Day", "Puddings and Custards"], "recipeIngredient": ["12 ounces heavy cream (1 1/2 cups; 355ml), plus more as needed", "1 1/2 ounces soba-cha, or roasted-buckwheat tea (1/4 cup; 45g), plus more for garnish (see note)", "Pinch kosher salt", "6 large egg yolks (about 4 ounces; 115g)", "3 ounces sugar (7 tablespoons; 85g)", "Whipped cream, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300&deg;F (150&deg;C). Bring a kettle of water to a boil. In a medium saucier or saucepan, combine cream with soba-cha and bring to a bare simmer over medium heat, stirring and scraping the bottom and sides frequently with a rubber or silicone spatula to prevent scorching. Remove from heat and let steep for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fine-strain infused cream into a heatproof measuring cup, pressing down on soba-cha to extract as much liquid as possible. Discard soba-cha. Add enough fresh cream to infused cream to top it up to 1 1/2 cups total. Season with a scant pinch of salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a clean medium saucier or saucepan (you can also use the same one from step 1, as long as it has cooled sufficiently that it won't cook the yolks), whisk egg yolks with sugar, then pour hot infused cream into egg yolk mixture while whisking constantly. Set over medium-low heat and cook, stirring and scraping bottom and sides of pot with a rubber or silicone spatula, until custard registers 140&deg;F (60&deg;C) on an instant-read thermometer. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fine-strain custard, then divide into ramekins and set ramekins in a baking dish. Cover baking dish with aluminum foil, leaving a small opening in the foil, and transfer to oven. Pour prepared boiling water into baking dish, being careful not to splash it into ramekins, until water comes about 3/4 of the way up the ramekin sides. Seal foil and bake custards until just set, 30 to 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully remove baking dish from oven, making sure not to slosh water, and let custards cool in water bath for about 1 hour. Remove ramekins from water bath, cover with plastic, and refrigerate until fully chilled, at least 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Custards can be refrigerated for up to 5 days. To serve, top with whipped cream and garnish with a few stray roasted buckwheat seeds.</p>"}]}