{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/09/20170825-artichokes-ala-romana-vicky-wasik-3-2.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["artichoke", "braise", "easy", "Italian", "Roman", "spring", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Easy Roman Braised Artichoke Hearts (Carciofi alla Romana)", "link": "https://www.seriouseats.com/recipes/2017/10/carciofi-alla-romana-roman-italian-braised-artichoke-recipe.html", "description": "<em>Carciofi alla romana</em> is one of Italy's most famous artichoke recipes. It's made with little more than olive oil, wine, garlic, and herbs, but the result is gently cooked, supremely tender artichoke hearts in a fragrant bath of their own cooking juices.", "totalTime": "1 hour", "recipeYield": "Serves 2 to 4 as a side dish", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Braising and Stewing", "Dairy-Free", "Father's Day", "Italian", "Mother's Day", "Other Vegetables", "Quick and Easy", "Sides", "Spring", "Stovetop", "Valentine's Day", "Vegan", "Vegetarian"], "recipeIngredient": ["2 whole lemons (for maintaining artichokes' color)", "4 large or 12 small artichokes (2 pounds; 1kg)", "1/4 cup (7g) minced flat-leaf parsley leaves", "2 tablespoons minced fresh mint leaves", "2 tablespoons minced fresh oregano leaves", "3 medium cloves garlic, minced", "1/4 cup (60ml) extra-virgin olive oil, plus more for drizzling", "1/4 cup (60ml) dry white wine ", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a large bowl with water; halve and squeeze 2 lemons into it. Trim artichokes by cleaning them down to the hearts, following the <a href=\"http://www.seriouseats.com/2015/03/how-to-prepare-cut-trim-clean-artichokes-hearts.html\">guidelines shown here</a>: Using a serrated knife, cut off top of artichoke and bottommost part of stem. Using a paring knife or sharp vegetable peeler, trim away the tough outer leaves to expose the tender inner leaves and heart. Trim away fibrous outer layer around stem to expose tender inner core (if stem breaks off, that's okay; just save it and cook it alongside the hearts). Using a spoon, scrape out the inedible, hairy choke in the center of each heart. Transfer cleaned artichokes to bowl of lemon water as you work, covering them with a clean kitchen towel to keep them completely submerged.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together parsley, mint, oregano, and garlic. Rub concave side of each artichoke heart with herb mixture, packing it into any leafy crevices. Set aside remaining herb mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add olive oil and wine to a pot just large enough to hold all the artichokes closely side by side, so that they can sit flat with their stem sides up. Arrange artichokes in pot and season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring pot to a simmer over medium-high heat, then lower heat to a bare simmer, cover, and cook until artichokes are fork-tender, 20 to 30 minutes. (Smaller artichokes may not take as long.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove from heat and transfer artichokes to a platter, stem sides up. Drizzle with cooking juices, along with some fresh olive oil and a light sprinkling of reserved herb mixture. Serve warm or at room temperature.</p>"}]}