{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20170111-salmon-chowder-02-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["chowder", "easy", "fish", "quick", "salmon", "soup", "weeknight"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "7"}, "name": "Easy, Creamy One-Pot Salmon Chowder", "link": "https://www.seriouseats.com/recipes/2017/02/easy-creamy-one-pot-weeknight-salmon-chowder-recipe.html", "description": "As a born-and-bred Boston kid, chowder holds a special place in my heart, and fish-based chowders doubly so, as a fish chowder was the very first dish I ever got to stick on a real restaurant menu. It was creamy, rich, and satisfying, and totally impractical for any kind of home cooking. At home, I take a much more traditional one-pot approach to chowder-making. While the resulting dish it may not quite reach the lofty heights of fine dining, the results are still creamy, satisfying, delicious, a great use of leftovers or inexpensive fish, and&mdash;most important&mdash;really, really easy.", "totalTime": "30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Mains", "Quick Dinners", "Salmon", "Soups and Stews", "Stovetop", "The Food Lab"], "recipeIngredient": ["1/2 pound salt pork or bacon, cut into 1/2-inch pieces (225g)", "2 tablespoons water (30ml)", "1 medium onion, finely chopped (about 8 ounces; 225g)", "2 large ribs celery, finely chopped (about 6 ounces; 170g)", "Kosher salt and freshly ground black pepper", "2 tablespoons all-purpose flour (about 20g)", "1 cup bottled clam juice (235ml)", "1 quart whole milk (900ml)", "1 pound russet or Yukon gold potatoes, peeled and cut into 1/2-inch cubes (450g)", "1 bay leaf", "3/4 to 1 pound boneless, skinless fish scraps, such as salmon, cod, or halibut, cut into 3/4-inch chunks (350-450g)", "Minced fresh herbs such as parsley, dill, or chives, for serving", "Hot sauce, for serving", "Crackers, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine salt pork or bacon and water in a heavy-bottomed stock pot or Dutch oven over medium heat and cook, stirring occasionally, until water has evaporated and pork has begun to brown and crisp in spots, about 8 minutes. Add onion, and celery. Season gently with salt and pepper and continue to cook, stirring occasionally, until onions are softened but not browned, about 4 minutes longer. Add flour and cook, stirring, until no pockets of raw flour remain. Stir in clam juice, followed by milk. Add potatoes and bay leaf and bring to a simmer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer chowder, stirring occasionally, until potatoes are fully tender, about 15 minutes. Stir in fish chunks and simmer just until cooked through, about 3 minutes. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, garnished with minced fresh herbs, hot sauce, and crackers.</p>"}]}