{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2016/12/20161201-kale-raisin-walnut-bleu-cheese-salad-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["blue cheese", "fruit", "grape", "kale", "kale salad", "raisin", "salad", "walnut"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Kale Salad With Oven-Dried Grapes, Toasted Walnuts, and Blue Cheese", "link": "https://www.seriouseats.com/recipes/2017/01/kale-salad-slow-roasted-grapes-walnuts-blue-cheese-recipe.html", "description": "The blue cheese, dried fruit, and nuts in this kale salad are a classic ingredient combination, but the pairing is made extraordinary here thanks to oven-dried grapes, which remain plumper and juicier than conventional raisins. Oil-rubbing the kale leaves, meanwhile, tenderizes them just enough. The result is a deeply familiar set of flavors, made better.", "totalTime": "3 hours 30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Baking", "Cheese", "Fall", "Gluten-Free", "Grapes", "Kale", "Nuts", "Salads", "Seasonal and Holiday", "Sides", "Thanksgiving", "Vegetarian", "Winter"], "recipeIngredient": ["Extra-virgin olive oil, for greasing baking sheet and massaging kale leaves", "12 ounces (340g) red seedless grapes (about 1 large bunch; see note)", "12 ounces (340g) kale leaves, hard ribs removed and leaves cut into large pieces", "Kosher salt", "1 1/4 cups walnut halves (4 ounces; 115g)", "4 ounces (115g) creamy, salty-sweet blue cheese, such as Bleu d'Auvergne, Cashel Blue, or Maytag Blue, crumbled", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2014/10/simple-vinaigrette-recipe.html\">Simple Vinaigrette</a>", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 225&deg;F/107&deg;C (or 200&deg;F/93&deg;C if using convection). Very lightly grease a rimmed baking sheet with olive oil, then scatter grapes all over. Cook in oven, checking periodically for doneness, until grapes are nicely shriveled and semi-dried but still slightly plump, about 3 hours. Let cool. Use a thin metal spatula to free any grapes that are stuck to the baking sheet. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a large bowl, drizzle kale leaves with just enough olive oil to coat very lightly, then season with salt. Using your hands, massage kale leaves all over with oil, making sure to coat all surfaces and kneading with your hands to help break down the tougher pieces, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium skillet, heat walnuts over medium-high heat, tossing frequently, until lightly toasted, about 3 minutes. Alternatively, toast nuts in the microwave <a href=\"http://www.seriouseats.com/2014/11/toast-nuts-in-the-microwave.html\">following these directions</a>. Let cool, then crumble roughly in your hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, toss kale with oven-dried grapes, walnuts, and cheese. Drizzle with just enough Simple Vinaigrette to lightly coat, tossing to combine. Season with salt and pepper and toss in more vinaigrette if desired. Serve.</p>"}]}