{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/Anova-Temperature-Set07.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Spanish", "keywords": ["gambas al ajillo", "seafood", "shellfish", "shrimp", "spanish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sous Vide Shrimp With Garlic, Sherry, and Smoked Paprika", "link": "https://www.seriouseats.com/recipes/2017/01/sous-vide-shrimp-garlic-sherry-smoked-paprika-recipe.html", "description": "Shrimp cooked through traditional methods can be fantastic but nailing the perfect temperature can be a bit hit or miss. With a sous vide cooker, you don't have this issue because that short window of time between perfect and overcooked stretches out to a good half hour or so. Sous vide also allows you to achieve textures that you can't really get through more traditional methods and affords you the opportunity to infuse the shrimp with flavor while they cook, like this version flavored Spanish-style with extra-virgin olive oil, garlic, smoked paprika, and sherry.", "totalTime": "35 minutes to 1 hour 20 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Mains", "Shrimp", "Sous Vide", "Spanish", "The Food Lab"], "recipeIngredient": ["1 1/2 pounds large peeled shrimp (about 700g) (see note)", "Kosher salt", "1/2 teaspoon baking soda", "6 tablespoons (90ml) extra-virgin olive oil", "6 medium cloves garlic, thinly sliced", "1 tablespoon sweet smoked Spanish paprika (about 6g)", "2 bay leaves", "3 tablespoons (45ml) sherry", "1 1/2 teaspoons (6ml) sherry vinegar", "2 tablespoons (30g) butter", "Crusty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set your sous vide water bath to desired temperature according to the chart above.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss shrimp with 1/2 teaspoon kosher salt and the baking soda. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat olive oil and garlic in a large skillet over medium-low heat. Cook, stirring, until garlic sizzles and softens but is not browned, about 3 minutes. Add paprika and bay leaves and cook, stirring, until fragrant, about 30 seconds. Add sherry and sherry vinegar, increase heat to high, and cook until the liquid is reduced and sauce starts to emulsify, about 2 minutes. Remove from heat and stir in butter. Season to taste with salt. Let cool about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place shrimp in a heavy duty zipper-lock bag or a vacuum bag. Pour in oil/garlic mixture. Remove all air from bag using the <a href=\"http://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">water displacement method</a> or a vacuum sealer. Press shrimp into a single layer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add bagged shrimp to preheated water bath and cook for at least 15 minutes and up to 1 hour (the texture should show very little variation within this time frame).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour cooked shrimp and sauce into a warm bowl and serve. Alternatively, preheat a cast iron skillet over high heat until a bead of water dropped in sizzles immediately. Place on a trivet and pour in the shrimp/oil mixture. Serve immediately, passing bread for sopping up the extra sauce.</p>"}]}