{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/08/20170621-peach-gastrique-grilled-pound-cake-vinegar-vicky-wasik-10.jpg", "author": {"@type": "Person", "name": "Michael Harlan Turkell"}, "recipeCuisine": "", "keywords": ["baking", "cake", "dessert", "fruit", "grill", "grilling", "grilling with vinegar", "peach", "poundcake", "sauce", "summer", "vinegar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Peaches and Pound Cake With Cider Vinegar Caramel Sauce", "link": "https://www.seriouseats.com/recipes/2017/09/grilled-peaches-pound-cake-cider-vinegar-caramel-sauce-recipe.html", "description": "Smoky and sweet grilled peaches, tender and toasted grilled poundcake, and even a sweet-tart caramel sauce spiked with cider vinegar that's whipped up on the grill. If this isn't the perfect summer dessert, we don't know what is.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Cakes", "Fruit Desserts", "Grilling, Smoking, and Barbecue", "Peach", "Summer"], "recipeIngredient": ["4 small to medium firm-but-ripe freestone peaches, halved and pits removed", "1 cup sugar (7 ounces/200g), plus more for dipping peaches", "1 cup apple cider vinegar (235ml)", "4 tablespoons unsalted butter (60g), cut into 4 pieces", "Kosher salt", "4 (1 1/2 inch thick) slices <a href=\"http://www.seriouseats.com/2017/06/how-to-make-sour-cream-pound-cake.html\">homemade</a> or store-bought poundcake", "Whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread an even layer of sugar on a small plate and dip the cut side of each peach half into it to coat lightly; top up sugar if needed. Set peaches, sugar side down, near but not directly over the coals (about medium to medium-high heat) and cook until the sugar coating has turned a deep caramel brown in spots, about 3 minutes; take care to make sure they don’t burn. Flip the peaches and move them to the cooler side of the grill. Cook until peaches are softened throughout but still hold their shape, 5 to 10 minutes. Keep warm. (You can move the peaches closer to and farther from the fire as needed to ensure they cook through and then remain warm without overcooking.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set an oven-proof 10-inch stainless steel skillet over the hot side of the grill and add the 1 cup sugar to it. Shake to spread sugar in an even layer, then cook until the sugar has melted and formed an amber caramel, about 10 minutes (timing can vary heavily depending on the grill's heat).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully and slowly add the vinegar; the liquid will splatter and bubble a bit. Try not to inhale the vapor from the boiling vinegar; it can be very potent. Cook, swirling gently from time to time, until the vinegar and caramel come together to form a uniform sauce; it's best not to stir during this time, as the caramel can clump onto the stirring utensil. Continue cooking until the sauce coats the back of a spoon. Whisk in 1 piece of butter at a time, whisking constantly until each is fully incorporated before adding the next. Season with salt. Remove the caramel from the grill and let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set poundcake slices over medium heat zone of the grill and cook until toasted, about 1 minute. Flip and repeat on other side. Be careful as the cake can burn quickly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble, place pound cake on plates. Top with grilled peach halves, then pour a generous amount of caramel over the peaches. Top with a dollop of whipped cream and serve.<br />\n</p>"}]}