{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/09/20170908-tomato-preservation-vicky-wasik-17.jpg", "author": {"@type": "Person", "name": "Christina Ward"}, "recipeCuisine": "", "keywords": ["canning", "preservation", "science of preservation", "summer", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Canned Whole Tomatoes (Using a Pressure Canner or Boiling-Water Bath)", "link": "https://www.seriouseats.com/recipes/2017/09/canned-whole-tomatoes-preservation-recipe.html", "description": "The key to safely canning tomatoes is to ensure, first, that they're at a safe acidity level, and then to process them at the right temperature for the right amount of time. This recipe is designed to work with either a boiling-water bath (i.e., a large pot filled with boiling water) or a dedicated pressure canner for safe long-term preservation of ripe whole summer tomatoes.", "totalTime": "1 1/2 hours to 2 hours 45 minutes, depending on elevation and method (excluding 24-hour rest before final inspection)", "recipeYield": "Makes 2 pints (1 quart) canned whole tomatoes (this recipe can be scaled to make as many jars as you like; preparation times will stay the same)", "recipeCategory": ["Stovetop", "Summer", "Tomato", "Vegetarian"], "recipeIngredient": ["About 2 pounds (1kg) whole, ripe plum tomatoes, free of all damage", "2 tablespoons (30ml) lemon juice or 1/2 teaspoon <a href=\"https://www.amazon.com/Milliard-Citric-Acid-Pound-NON-GMO/dp/B00EYFKNL8/?tag=serieats-20\">citric acid</a>", "1 teaspoon 100% pure sea salt or kosher salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of water to a boil and fill a large bowl with ice water. Meanwhile, wash tomatoes, discarding any leaf and stem remnants. Using a paring knife, score skin of each tomato by making an X at the top of each. Carefully lower tomatoes into boiling water and let stand until skins show the first signs of loosening around the edges of the score marks, about 1 minute. Using a slotted spoon, transfer tomatoes to ice water and let cool; their skins should loosen even more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pull off tomato skins and discard, or <a href=\"http://www.seriouseats.com/recipes/2015/08/tomato-powder-from-tomato-skins.html\">reserve for dehydrating</a>. Place peeled tomatoes in a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash a 1-quart glass canning jar (or two 1-pint jars) in hot soapy water, rinse, and set aside. Alternatively, run jar(s) through the dishwasher and leave in machine until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add lemon juice or citric acid to jar, or divide evenly between jars if using the pint size. If using, add salt to jar or divide evenly between jars; salt seasons the tomatoes but can be omitted if desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop skinned tomatoes into jars. Gently press them in, trying not to break them (they will still be edible even if they do break), until jar is filled to a 1/2-inch headspace. Slide a thin plastic or metal blade in and out of jars to remove air bubbles. If headspace decreases from 1/2 inch, add any accumulated liquid from tomato bowl (or water, if you don't have enough tomato liquid) to bring contents back to 1/2-inch headspace.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe rims of jars with a damp towel. Place lids on top, then screw on rings only to finger-tightness. Over-tightening lids can prevent the canning process from working.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using a Boiling-Water Bath:</strong> Set a rack on the bottom of a stockpot, making sure the pot is large enough to hold the jars and allow at least 2 inches of water above them. Fill pot about halfway with water. Bring to a rolling boil. Meanwhile, bring a kettle of water to a boil as well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When water is boiling, carefully lower jars into pot using jar-lifting tongs. When all jars are in the pot, if water does not cover them by at least 2 inches, add more boiling water from kettle until they are covered by 2 inches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover pot and return to a rolling boil. Process tomatoes at a boil for 85 minutes at sea level; add 5 minutes to this time for every 1,000 feet above sea level. Remove jars when processing time is complete.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If Using a Pressure Canner:</strong> Set canner's rack in the bottom of pressure canner and add about 4 inches water. Using jar-lifting tongs, carefully lower jars into pressure canner. Seal canner lid following manufacturer's instructions. If using a weighted-gauge pressure canner, bring to 10 psi and process for 25 minutes. If using a dial-gauge pressure canner, bring to 11 psi and process for 25 minutes. If above an elevation of 1,000 feet, increase pressure setting to 15 psi for a weighted-gauge canner or 12 psi for a dial-gauge canner. (Follow manufacturer's instructions exactly for specifics on how to operate your canner.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow pressure canner to depressurize by venting it following manufacturer's instructions. Once fully vented to 0 psi, let stand for 10 minutes. Attempt to remove lid only once canner has fully depressurized and has sat for 10 minutes. Attempting to open a pressure canner before it has depressurized is extremely dangerous; do not do it. The 10-minute rest at 0 psi allows the jars to acclimate to lower pressure; skipping this by attempting to move the jars too soon can cause siphoning (loss of liquid in the jar). When ready, carefully remove pressure canner lid. Let jars rest 15 minutes inside canner before removing with the jar-lifter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let jars stand for 24 hours, then check their seal. Lids should be taut, with no flex or give when you press down on them, and each jar should be at least halfway filled with liquid. If your jars do not pass the test, transfer to refrigerator and use tomatoes within 1 week. If they do pass the test, tomatoes can be stored in a dark, cool place for 12 to 18 months.</p>"}]}