{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/05/20170414-DIY-biscoff-cookies-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "Biscoff", "BraveTart", "cookie", "copycat", "speculoos"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Homemade Biscoff (Belgian <em>Speculoos</em> Cookies)", "link": "https://www.seriouseats.com/recipes/2017/06/homemade-biscoff-recipe.html", "description": "These crispy cookies are rich and aromatic thanks to the floral character of Ceylon cinnamon and the deeply caramelized sweetness of well toasted sugar or Belgian-style brown sugar, sometimes called candi sugar or cassonade&mdash;accept no substitutions! The spice blend is subtle, but vital to capturing the gentle spiciness of the real deal, so be sure to use level measurements or else bust out a microscale if you have one.", "totalTime": "45 minute", "recipeYield": "Makes thirty-two 1 1/2 by 2 1/2-inch cookies", "recipeCategory": ["Baking", "Christmas", "Cookies", "Pastry"], "recipeIngredient": ["5 1/4 ounces light brown candi sugar, such as <a href=\"https://www.amazon.com/Brewers-Best-Fonce-Candi-Sugar/dp/B00A2W9ZLG/?tag=serieats-20\">Brewer's Best</a>, or deeply <a href=\"http://www.seriouseats.com/2016/05/how-to-make-caramel-without-melting-sugar.html\">toasted sugar</a> (about 2/3 cup, firmly packed; 150g)", "3 ounces unsalted butter, soft but cool, about 70°F (6 tablespoons; 85g) ", "3/4 teaspoon baking soda (4.75g)", "3/4 teaspoon ceylon cinnamon (1.5g)", "1/2 teaspoon kinako (roasted soybean flour; 1g), such as <a href=\"https://www.amazon.com/Shirakiku-Kinako-roasted-bean-flour/dp/B0006B4IGU/?tag=serieats-20\">Shirakiku</a>, optional", "1/4 teaspoon ground or freshly grated nutmeg (0.25g)", "Shy 1/8 teaspoon (0.35g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "Shy 1/8 teaspoon ground cloves (0.15g)", "1/16 teaspoon ground cardamom (0.10g)", "1/16 teaspoon ground anise (0.10g)", "1/2 ounce tap water (about 1 tablespoon; 15g)", "5 1/2 ounces ounces all-purpose flour (about 1 1/4 cups; 155g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower middle position, and preheat to 350&deg;F. In the bowl of a stand mixer fitted with a paddle attachment, combine candi or toasted sugar with butter, baking soda, cinnamon, kinako, nutmeg, salt, cloves, cardamom, and anise. Cream on medium speed until fluffy, soft, and pale, about 10 minutes, pausing to scrape the bowl and paddle as needed if the sugar seems dense and compacted at the bottom of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While creaming on medium speed, slowly splash in the water a little at a time. Once it disappears into the fluffy butter/sugar mix, reduce speed to low and add the flour all at once. Continue mixing until the dough begins to gather around the paddle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the dough onto a clean surface, and knead gently to form a ball. Pat into a rectangular shape, then dust with flour, above and below. Roll to a thickness of 3/16-inch, using a ruler for guidance. Slide an offset spatula beneath the dough to loosen, and brush away the excess flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a fluted pastry wheel, cut the dough into 3/4-inch strips, then cut crossways to form 2-inch rectangles. With the offset spatula, transfer the cutouts and scraps to a parchment-lined half sheet pan, leaving an inch between each piece to account for spread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until cookies are golden brown, about 16 minutes, rotating the pan halfway through if needed to ensure even browning. Cool to room temperature directly on the baking sheet; the cookies will not crisp until fully cool. Enjoy with coffee, and store leftovers in an airtight container up to 1 month at room temperature; the scraps can be ground to use for crumbs and frozen in an airtight container for up to 3 months. </p>"}]}