{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/04/20170407-lobster-bisque-vicky-wasik-32.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["bisque", "broth", "French", "lobster", "seafood", "shellfish", "soup", "stock"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.25", "ratingCount": "8"}, "name": "Rich and Creamy Lobster Bisque", "link": "https://www.seriouseats.com/recipes/2017/05/lobster-bisque-recipe.html", "description": "This recipe streamlines the traditionally complicated process of making a bisque, while still delivering a deeply rich and flavorful soup, velvety-smooth and packed with tender chunks of lobster meat.", "totalTime": "2 hours 30 minutes", "recipeYield": "Makes about 2 quarts (1.9L), serving 6 to 8", "recipeCategory": ["French", "Gluten-Free", "Lobster and Crab", "Mother's Day", "Sides", "Soups and Stews", "Stovetop", "Valentine's Day"], "recipeIngredient": ["4 (1 1/4–pound; 560g) live lobsters", "1 (4-ounce; 115g) stick unsalted butter, plus more for garnish", "1/3 cup (80ml) extra-virgin olive oil", "2 medium carrots (about 12 ounces; 340g), diced", "2 medium yellow onions (about 1 pound; 450g), diced", "4 large celery ribs (about 6 ounces; 170g), diced", "4 medium cloves garlic, crushed", "2 tablespoons (25g) tomato paste", "1/4 cup (60ml) brandy", "1 cup (240ml) dry white wine ", "5 cups (1.2L) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or store-bought low-sodium chicken broth", "3 sprigs flat-leaf parsley, plus minced leaves and tender stems for garnish", "3 sprigs tarragon, plus minced leaves for garnish", "1 bay leaf", "1/2 cup (120ml) heavy cream", "Kosher salt and freshly ground white or black pepper", "Cayenne pepper, to taste", "Minced fresh chives, for garnish", "Ground coriander seed, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a hefty chef's knife, kill each lobster by pressing the tip of the knife in the indentation just behind and between the eyes. Press down firmly, then split head in half. Using kitchen towels, twist off tail and claws (including knuckles) from each lobster carapace.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a cutting board in a rimmed baking sheet on a work surface. Place a steamer insert in the bottom of a large lidded stockpot and add 1 inch of water. Bring to a boil over high heat. Add lobster tails, cover, and cook for 2 minutes 30 seconds. Remove tails and transfer to cutting board. Make sure water is still at a full boil, then add claws, cover pot, and cook for 3 minutes. Remove claws and transfer to cutting board. Reserve water in bottom of steamer; it will now be infused with lobster juices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>As soon as lobster is cool enough to handle, remove tail, claw, and knuckle meat from shells using kitchen shears, lobster crackers, and/or the back of a heavy cleaver to help crack shells. (It's okay if the meat gets a little mangled.) Reserve shells; separately reserve any accumulated liquids in the rimmed baking sheet. Cut lobster meat into 1-inch pieces and transfer to the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a heavy chef's knife, cut lobster bodies into large pieces (do not discard any part).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large Dutch oven or stockpot, combine butter with olive oil and heat over medium-high heat until butter is fully melted and foaming. Add just enough lobster bodies and shells to cover bottom of pot in a single layer and cook, stirring and scraping, until browned, about 5 minutes. Add remaining lobster bodies and shells and cook, stirring and scraping frequently, until all lobster pieces are bright red, fully cooked, and browning on bottom of pot, about 8 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add carrot, onion, celery, and garlic and cook, stirring and scraping bottom of pot, until vegetables are beginning to soften and a new layer of browning has formed on bottom of pot, about 5 minutes. Stir in tomato paste and cook for 1 minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add brandy (be careful if working over a gas flame not to accidentally ignite it) and cook, stirring and scraping bottom of pot, until brandy has mostly evaporated and raw alcohol smell has cooked off. Add white wine, bring to a simmer, and cook, stirring and scraping up any browned bits, until alcohol smell has cooked off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add reserved lobster-steaming water and collected lobster juices (you should have around 3 or 4 cups lobster liquid) along with chicken stock. There should be just enough liquid to barely cover shells; if not, add enough water to barely cover. Add parsley sprigs, tarragon sprigs, and bay leaf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring to a boil, then reduce heat and gently simmer, uncovered, for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain lobster stock, pressing well on shells to extract as much liquid as possible; reserve solids. Working in batches if necessary, add lobster stock to a blender. Pick out about 2 cups cooked aromatic vegetables from reserved stock solids and add to blender. Add cream and blend, starting at low speed and gradually increasing to high speed, until soup is completely smooth. Repeat with any remaining lobster stock. If you want the broth even thicker, blend in more aromatic vegetables from stock (or cooked rice; see note).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pass blended soup through a fine-mesh strainer into a clean pot, using a wooden spoon or ladle to work everything through; you should be left with only some tiny bits of lobster shell caught in the strainer when you're done. (This can be a slow process, but it's worth it to eliminate any shell remnants.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat soup, being careful not to let it boil to avoid curdling the cream. Season with salt and pepper, plus just enough cayenne pepper to give the soup a subtle warmth (it shouldn't be overtly spicy). Keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to serve, melt about 2 tablespoons (30g) unsalted butter per serving in a skillet over medium-high heat until foaming. Add lobster meat (about 1/4 cup per serving) and cook, stirring and tossing, until just cooked through, 1 to 2 minutes. Add a mixture of minced parsley, tarragon, and chives, tossing to coat. Season with salt and pepper, along with a pinch or two of ground coriander to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle broth into warmed bowls and spoon lobster meat garnish and herb butter into each bowl. If you don't serve it all right away, the soup base and reserved par-cooked lobster meat can be refrigerated, separately, up to 2 days. Reheat soup (without boiling) and finish remaining lobster meat as directed to serve.</p>"}]}