{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/06/20170523-chocolate-popcorn-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["brittle", "candy", "chocolate", "golden syrup", "no bake", "popcorn", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Crispy Chocolate Popcorn", "link": "https://www.seriouseats.com/recipes/2017/09/chocolate-popcorn-recipe.html", "description": "With a handful of simple ingredients you can turn plain popcorn into a crisp and crunchy chocolate candy. It only takes a few simple ingredients, most of which are probably in your pantry right now.", "totalTime": "1 hour", "recipeYield": "Makes 8 cups", "recipeCategory": ["Candy", "Chocolate", "Corn", "Gluten-Free", "Popcorn", "Stovetop"], "recipeIngredient": ["2 ounces unsalted butter (about 4 tablespoons; 55g) or 1 1/2 ounces raw cocoa butter (shy 1/4 cup; 40g), plus more for greasing", "1 3/4 ounces freshly popped popcorn (about 7 cups once popped; 50g)", "3 ounces water (about 1/3 cup; 85g)", "4 ounces <a href=\"https://www.amazon.com/Lyles-Golden-Original-All-Natural-Cooking/dp/B0000EYP2U/?tag=serieats-20\">golden syrup</a> or light corn syrup (about 1/3 cup; 110g)", "9 ounces sugar (about 1 1/4 cups; 255g)", "3 ounces 72% dark chocolate, finely chopped (about 1/2 cup; 85g)", "3/4 teaspoon baking soda", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly grease a large bowl, and add freshly popped popcorn. You should have about 7 cups; if significantly less, this may be a sign the the popcorn is dense and stale and that a newer batch of kernels is in order. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 3-quart stainless steel saucier, combine water, golden or corn syrup, butter or cocoa butter, and sugar over medium heat. Stir with a fork until bubbling hot, about 4 minutes. Increase to medium-high, clip on a digital thermometer and cook without stirring until the syrup is 340&deg;F, about 10 minutes. If the process is taking too long, simply increase the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, lightly grease a rimmed half sheet pan, and prepare the remaining ingredients so they’re ready to add at a moment’s notice. When the syrup comes to temperature, remove from heat, stir in chocolate with a heat-resistant spatula, followed by the baking soda and salt. When the mixture is foamy, pour over the popcorn and fold until the pieces are thoroughly coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape onto the prepared baking sheet, pulling the chunks of popcorn into bite-sized clusters with a pair of metal forks. Cool until the soft candy shell is hard and crisp, about 45 minutes, then transfer to an airtight container. It’s best to store the popcorn as soon as it's cooled, as excessive exposure to air may cause it to soften from humidity. Store up to 2 weeks at room temperature, or 1 month in the fridge.</p>"}]}