{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/08/20170728-chicken-and-peach-saltimbocca-skewers-morgan-eisenberg-4.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "Italian", "keywords": ["chicken", "grill", "grilling", "Italian", "kebab", "peach", "prosciutto", "skewer", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.3333333333333", "ratingCount": "3"}, "name": "Grilled Chicken and Peach Saltimbocca Skewers", "link": "https://www.seriouseats.com/recipes/2017/09/grilled-chicken-peach-saltimbocca-skewers-recipe.html", "description": "Classic chicken saltimbocca gets a summertime twist with this grilled-skewer recipe, which uses fresh peaches to balance the salty, buttery prosciutto. A white wine marinade helps flavor the chicken breast and allows it to maintain moisture as it grills, then gets reduced to create a sauce for serving.", "totalTime": "1 hour 5 minutes", "recipeYield": "Makes 6 skewers", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Grilled Chicken", "Grilling, Smoking, and Barbecue", "Italian", "Mains", "Peach", "Snacks", "Summer"], "recipeIngredient": ["<strong>For the Marinade:</strong>", "1 cup (240ml) dry white wine", "Juice of 1 lemon (about 2 tablespoons; 30ml)", "2 teaspoons (10ml) low-sodium soy sauce ", "2 teaspoons chopped fresh sage", "1 small shallot, minced", "2 tablespoons (30ml) extra-virgin olive oil", "1/4 to 1/2 teaspoon crushed red pepper flakes (use more or less depending on their intensity and your heat tolerance)", "1 teaspoon kosher salt, or to taste", "<strong>For the Skewers:</strong>", "1 1/2 pounds (680g) boneless, skinless chicken breasts, cut into 1-inch cubes", "2 large semifirm peaches, halved, pitted, and cut into 1-inch chunks", "6 ounces (170g) thinly sliced prosciutto ", "12 sage leaves, or more as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Marinade:</strong> In a large bowl, combine wine, lemon juice, soy sauce, chopped sage, and shallot. Whisk in olive oil and red pepper flakes, then season with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Skewers:</strong> Add chicken and peach cubes to bowl of marinade. Cover and refrigerate for at least 30 minutes and up to 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1 chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, working with one slice at a time, place prosciutto slices on a flat surface and lay 1 to 2 sage leaves on top of each. Fold prosciutto slices in half lengthwise so that sage is sandwiched inside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove chicken and peaches from marinade and reserve marinade. Using a skewer, pierce one end of sage-stuffed prosciutto. Place a piece of chicken right where the skewer pierced the prosciutto and slide skewer through the chicken as well, then slide skewer through prosciutto again, on the other side of the chicken. Next, slide a peach cube onto skewer, then weave prosciutto and pierce once more on the far side of the peach cube. Repeat, alternating chicken and peach chunks, with prosciutto snaking back and forth around them along the length of the skewer. Repeat until all 6 skewers are assembled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour marinade into a small saucepan and cook over high heat. Bring to a full, rolling boil for 2 minutes, then reduce to a simmer. Cook, whisking occasionally, until reduced and thickened to a sauce-like consistency. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grill skewers over high heat until prosciutto crisps and chicken has cooked through, about 3 minutes on each side. If skewers threaten to burn, move them to the cooler side of the grill to finish cooking. Serve skewers warm with the dipping sauce made from the marinade. </p>"}]}