{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/03/20170227-cinnamon-raisin-bagels-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["bagel", "Bake", "barley malt", "bread", "breakfast", "brunch", "cinnamon", "golden raisin", "raisin", "tangzhong", "whole wheat", "yukone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Cinnamon Raisin Bagels", "link": "https://www.seriouseats.com/recipes/2017/03/homemade-cinnamon-raisin-bagels-recipe.html", "description": "The cinnamon raisin bagels I grew up with included a touch of whole wheat, which made them slightly more tender&mdash;presumably to offset the inherent chewiness of dried fruit. Aside from providing a heartier flavor to underscore the aromatic cinnamon, whole wheat helps the dough absorb a little more water, so you'll notice the ratios are somewhat different from what you'd see in a batch of <a href=\"http://www.seriouseats.com/recipes/2017/01/homemade-bagels-recipe.html\">plain bagels</a>.", "totalTime": "25 hours", "recipeYield": "Makes 8 (3-inch) bagels", "recipeCategory": ["Baking", "Breakfast and Brunch", "Dairy-Free", "Easter", "Father's Day", "Mother's Day", "Vegan", "Yeast Bread"], "recipeIngredient": ["<strong>For the Yukone:</strong>", "6 ounces cold water (3/4 cup; 170g)", "3 1/2 ounces bread flour (about 3/4 cup, spooned; 100g) ", "<strong>For the Dough:</strong>", "10 ounces bread flour (about 2 1/4 cups, spooned; 280g)", "2 1/2 ounces whole wheat flour (about 1/2 cup, spooned; 70g)", "1/2 ounce sugar (about 1 tablespoon; 15g)", "2 3/4 teaspoons ground cinnamon", "2 1/2 teaspoons (9g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1 teaspoon (4g) instant dry yeast", "4 ounces water (1/2 cup; 110g)", "4 1/2 ounces golden raisins (about 3/4 cup; 125g)", "1 ounce barley malt syrup (4 teaspoons; 30g), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Yukone:</strong> In a 10-inch skillet, whisk water and flour over medium heat until paste becomes a thick lump, about 2 minutes. Scrape onto a plate, spread into a 1-inch layer, cover, and cool until it reaches about 75&deg;F (23&deg;C) on an instant-read thermometer, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Pulse bread flour, whole wheat flour, sugar, cinnamon, salt, and instant yeast in a food processor fitted with a metal blade. Once ingredients are combined, add cooled yukone and water. (If using active dry yeast, first dissolve with the water.) Process until dough is smooth, about 90 seconds. Turn dough onto a clean, un-floured surface and knead in raisins; it will seem an impossible task at first, but keep at it. Divide dough into 8 roughly equal portions (3 3/4 ounces or 105g each).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Shape:</strong> Cup a portion of dough beneath your palm and work in quick, circular motions to form a tight skin around the ball, with only a tiny seam along the bottom. If seam is large or irregular, continue rounding until bottom is nearly smooth. Cover with plastic and let rest 15 minutes. Poke a hole into the center of each portion with a damp fingertip, then gently stretch into a 3-inch ring, wetting your hands in cold water as needed to prevent sticking. Arrange on a well-greased, parchment-lined half sheet pan, then cover with plastic and refrigerate 24 to 36 hours, depending on your schedule.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Boil:</strong> Adjust oven rack to lower-middle position and preheat oven to 425&deg;F (218&deg;C). Fill a stainless steel pot with about 3 inches of water, stir in barley malt (if using), and bring to a boil over high heat. Meanwhile, line a baking sheet or cutting board with a thick layer of paper towels. Working with 2 or 3 bagels at a time, boil bagels, about 30 seconds per side. Place on paper towels, then immediately transfer to a parchment-lined half sheet pan. (If left on paper towels too long, bagels will stick; if this happens, quickly dip bagel back into hot water, and the wet paper towel will peel right off.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Bake bagels until glossy and golden brown, about 25 minutes. Let cool at least 15 minutes. To serve, split horizontally with a serrated knife. Unsliced bagels can be stored up to 48 hours in a paper bag (or loosely wrapped in parchment), then sliced and briefly toasted to serve.</p>"}]}