{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20170419-pasta-primavera-06.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Italian", "keywords": ["asparagus", "fava", "italian american", "pasta", "pasta primavera", "pea", "spring", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pasta Primavera (Pasta With Spring Vegetables)", "link": "https://www.seriouseats.com/recipes/2017/05/pasta-primavera-spring-vegetables-asparagus-fava-pea-recipe.html", "description": "Combining a mixture of bright spring produce and a light but creamy sauce, <em>pasta primavera</em> is the ideal dish for a warm May evening.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Asparagus", "Italian", "Mains", "Other Vegetables", "Pasta", "Quick Dinners", "Spring", "Stovetop", "Vegetarian"], "recipeIngredient": ["12 ounces fava beans in their pods, or 4 ounces shucked fava beans (120g shucked beans)", "12 ounces English peas in their pods, or 4 ounces shucked peas (120g shucked peas)", "Kosher salt", "8 ounces (225g) asparagus, <a href=\"http://www.seriouseats.com/2017/04/how-to-trim-asparagus-stalks-spears.html\">woody ends removed</a>, stalks cut on a sharp bias into 1-inch pieces", "6 ounces (170g) snap peas, strings removed, cut on a sharp bias into 1/2-inch slices", "8 ounces (170g) broccolini, woody ends removed, cut on a sharp bias into 1-inch pieces", "4 tablespoons (50g) unsalted butter", "2 tablespoons (30ml) extra-virgin olive oil, plus more for serving", "2 whole cloves garlic, lightly smashed with the side of a knife", "3 ounces (90g) pine nuts ", "1 pound (450g) fresh egg pasta, such as fettuccine, penne, or <em>gemelli</em> (see note)", "6 ounces (170ml) crème fraîche ", "2 teaspoons (5g) finely grated zest and 1 teaspoon (5ml) fresh juice from 1 lemon", "1/2 ounce minced fresh basil leaves (about 1/2 cup packed leaves; 15g)", "1/2 ounce minced fresh parsley leaves (about 1/2 cup packed leaves; 15g)", "Freshly grated Parmigiano-Reggiano, to taste", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using fava beans and peas in their pods, shuck beans and peas from pods, keeping beans and peas separate. Discard pods. Bring a large pot of salted water to a boil and prepare an ice bath. Working with one vegetable at a time, blanch favas, peas, asparagus, snap peas, and broccolini in boiling water for 1 minute each, transfer to ice bath to cool, then transfer to a paper towel&ndash;lined tray and pat dry. Remove and discard skin from each individual fava bean. Set vegetables aside. Empty pot, refill it with fresh water, season generously with salt, and return to a boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a 3- to 4-quart saucier or a 12-inch skillet, heat butter, olive oil, garlic, and pine nuts over low heat until gently sizzling. Cook, swirling pan constantly, until pine nuts just start to brown and garlic aroma is very strong. Do not let butter brown; remove it from heat occasionally if it starts to sizzle too rapidly. Discard garlic cloves. Add blanched vegetables to pan and toss to combine. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When water is boiling, add pasta and cook until just shy of al dente, about 1 minute total for most fresh pasta (see note). Drain pasta, reserving 1 cup cooking liquid. Transfer pasta to pan with vegetables and add crème fraîche, lemon zest, lemon juice, basil, and parsley. Set over high heat and cook, stirring and tossing constantly and adjusting the consistency as necessary with a few splashes of the starchy pasta water, until liquid reduces to a creamy sauce. The sauce should coat the pasta and leave a creamy trail on the bottom of the pan when you drag a wooden spoon through it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Off heat, stir in a generous shaving of fresh Parmigiano-Reggiano and season to taste with salt and pepper. Serve immediately, drizzling with olive oil and sprinkling with freshly ground black pepper and grated Parmigiano-Reggiano at the table.</p>"}]}