{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/07/20170705-julep-variations-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["basil", "cocktail", "cucumber", "jalapeño", "julep", "mezcal", "spring", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "El Derby Ahumado (Basil Julep With Cucumber, Jalapeño, and Mezcal)", "link": "https://www.seriouseats.com/recipes/2017/07/smoked-derby-julep-cucumber-jalapeno-mezcal-recipe.html", "description": "This cocktail is admittedly quite far from classic julep territory, but it's as drinkable as it is atypical. The name means \"the smoked derby\" in Spanish, a nod to the mezcal that lends the drink its campfire aroma. Mixed with it are muddled cucumber (for thirst-quenching freshness); jalapeño (for green, vegetal spice); basil (for an herbal note); and agave syrup&mdash;which is made from the same Mexican succulent that mezcal is, though sugar would work just fine in its place.", "totalTime": "5 minutes", "recipeYield": "Makes 1 cocktail", "recipeCategory": ["Cinco de Mayo", "Cucumber", "Father's Day", "July 4th", "Labor Day", "Memorial Day", "Mezcal", "Mother's Day", "Spring", "Summer"], "recipeIngredient": ["1 (1/2-inch) round peeled cucumber (about 3/4 ounce; 20g), plus 1 cucumber stick for garnish", "1 thin round jalapeño pepper, with seeds (the size of this round of jalapeño will determine the spiciness of the drink)", "6 fresh basil leaves, plus a large tuft of basil sprigs", "2 teaspoons (10ml) agave syrup", "2 1/2 ounces (75ml) mezcal", "Crushed or shaved ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a julep cup or large rocks glass, muddle cucumber round and jalapeño until they are well crushed and juices are expressed. Add basil leaves and agave syrup and muddle until basil is lightly bruised, then swab the glass's sides with the basil's aromatic oils. Add mezcal and stir well. Half-fill glass with crushed ice and stir to combine. Fill glass completely with crushed ice and stir until outside of glass frosts. Add more crushed ice, heaping generously, then garnish with sprigs of fresh basil and cucumber stick. Serve, adding a short straw if desired so that the fragrance of the basil bouquet will greet the drinker with each sip.</p>"}]}