{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20170109-pan-seared-salmon-05.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["easy", "essential", "fish", "low carb", "quick", "salmon", "sear"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "6"}, "name": "Crispy Pan-Seared Salmon Fillets", "link": "https://www.seriouseats.com/recipes/2017/01/crispy-pan-seared-salmon-fillets-recipe.html", "description": "Perfect pan-seared salmon should have crisp skin, moist and tender flesh, and fat that has been fully rendered. This technique produces excellent results with minimal fuss. The key is to cook the salmon most of the way through with the skin side down in order to insulate the delicate flesh from the direct heat of the pan.", "totalTime": "10 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Easter", "Gluten-Free", "Mains", "Passover", "Quick and Easy", "Salmon", "Stovetop", "The Food Lab"], "recipeIngredient": ["4 skin-on salmon fillets, about 6 ounces (170g) each", "Kosher salt and freshly ground black pepper", "2 tablespoons (30ml) vegetable, canola, or light olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press salmon fillets between paper towels to dry surfaces thoroughly. Season on all sides with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large stainless, cast iron, or carbon steel skillet, heat oil over medium-high heat until shimmering. Reduce heat to medium-low, then add a salmon fillet, skin side down. Press firmly in place for 10 seconds, using the back of a flexible fish spatula, to prevent the skin from buckling. Add remaining fillets one at a time, pressing each with spatula for 10 seconds, until all fillets are in the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook, pressing gently on back of fillets occasionally to ensure good contact with skin, until skin releases easily from pan, about 4 minutes. If skin shows resistance when you attempt to lift a corner with spatula, allow it to continue to cook until it lifts easily. Continue to cook until salmon registers 110&deg;F (43&deg;C) in the very center for rare, 120&deg;F (49&deg;C) for medium-rare, or 130&deg;F (54&deg;C) for medium, 5 to 7 minutes total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using spatula and a fork, flip salmon fillets and cook on second side for 15 seconds, then transfer to a paper towel&ndash;lined plate to drain. Serve immediately.</p>"}]}