{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/02/20170131-beet-pistachio-ricotta-citrus-salad-10.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beet", "citrus", "fall", "grapefruit", "ricotta", "roast", "salad", "vegetarian", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Roasted-Beet and Citrus Salad With Ricotta and Pistachio Vinaigrette", "link": "https://www.seriouseats.com/recipes/2017/02/roasted-beet-pistachio-ricotta-grapefruit-citrus-salad-recipe.html", "description": "There's a reason beets and citrus are a staple of winter salads: They go insanely well together. But within those constraints, there's pretty much no end to the combinations of salads you can make. This salad is made with roasted beets, grapefruit and oranges, fresh ricotta, and a pistachio vinaigrette.", "totalTime": "2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Fall", "Gluten-Free", "Grapefruit", "Mother's Day", "Other Vegetables", "Roasting", "Salads", "Seasonal and Holiday", "Thanksgiving", "Valentine's Day", "Vegetarian", "Winter"], "recipeIngredient": ["2 pounds (about 1kg) beets, unpeeled, greens removed, scrubbed clean", "1/4 cup (60ml) extra-virgin olive oil, divided", "2 sprigs thyme or rosemary (optional)", "Kosher salt and freshly ground black pepper", "1/4 cup toasted shelled pistachios (about 2 ounces; 55g)", "1 grapefruit, <a href=\"http://www.seriouseats.com/2014/04/knife-skills-how-to-cut-citrus-fruit-into-wedges-slices-and-supremes.html\">cut into <em>suprèmes</em> or wedges</a>, 1 tablespoon (15ml) juice reserved separately", "1 orange, <a href=\"http://www.seriouseats.com/2014/04/knife-skills-how-to-cut-citrus-fruit-into-wedges-slices-and-supremes.html\">cut into suprèmes or wedges</a>, 1 tablespoon (15ml) juice reserved separately", "2 teaspoons (10ml) juice from 1 lemon", "1 small shallot, finely minced (about 1 ounce; 30g)", "2 tablespoons (about 15g) minced fresh parsley, tarragon, or chervil", "1 tablespoon (15ml) honey ", "1/2 cup (100g) fresh ricotta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375&deg;F (190&deg;C). Fold a 12- by 24-inch sheet of aluminum foil in half to form a square. Crimp two edges to form a pouch. Toss beets, 1 tablespoon (15ml) olive oil, rosemary or thyme sprigs (if using), and salt and pepper to taste in a medium bowl until beets are coated. Add to pouch and crimp remaining edge to seal. (If using multiple colors of beets, roast in separate pouches.) Transfer to a rimmed baking sheet and place in oven. Roast until beets are completely tender and a toothpick or cake tester inserted into a beet through foil meets little to no resistance, about 1 1/2 hours. Remove from oven and allow to cool. When beets are cool enough to handle, peel by gently rubbing skin under cold running water. Cut beets into 1 1/2&ndash;inch chunks. Beets can be cooked and stored in the refrigerator for up to 5 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place pistachios in a mortar and pound with pestle until lightly crushed but not totally pulverized. (You can also chop them with a knife.) Transfer half of nuts to a large bowl and reserve the rest for garnish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add grapefruit juice, orange juice, lemon juice, shallot, minced herbs, and honey to bowl with pistachios and whisk to combine. Drizzle in remaining 3 tablespoons (45ml) olive oil while whisking constantly. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Toss beets and citrus with vinaigrette in a large bowl (if using red beets, toss them separately from everything else) and season to taste with salt and pepper. Spread half of ricotta over a serving platter, place dressed beets and citrus on top, dollop with remaining ricotta, sprinkle with reserved pistachios, and serve.</p>"}]}