{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/07/20170707-pina-colada-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Latin American", "keywords": ["cocktail", "coconut", "frozen cocktail", "frozen drink", "pineapple", "rum", "summer", "tropical"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Ultra-Tropical Piña Colada", "link": "https://www.seriouseats.com/recipes/2017/07/pina-colada-tropical-rum-cocktail-pineapple-coconut-recipe.html", "description": "A good piña colada should instantly transport you to warm sandy beaches and turquoise waters. What we don't want is a drink that tastes weak and watery, nor artificially tropical, as if someone dumped a bottle of tanning oil into the blender. This version produces a slushy frozen cocktail full of ripe pineapple and rich coconut flavor. Plus a good, strong hit of rum.", "totalTime": "10 minutes plus 1 hour freezing", "recipeYield": "Makes one large drink", "recipeCategory": ["Coconut", "Father's Day", "July 4th", "Latin American", "Mother's Day", "Pineapple", "Rum", "Summer"], "recipeIngredient": ["5 ounces (140g) very ripe peeled and cored fresh pineapple, frozen pineapple, or drained canned pineapple chunks (see note)", "1 3/4 ounces (50ml) unsweetened coconut cream, shaken or stirred well to incorporate fat", "1 ounce (30ml) simple syrup (see note)", "3/4 to 1 ounce (20-30ml) fresh juice from 1 lime", "2 1/2 ounces (75ml) white or gold rum, kept in freezer until freezer-cold", "4 ounces (115g) ice cubes", "Pineapple slice and/or maraschino cherry, for garnish", "Paper umbrella and straw, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an airtight plastic container, combine pineapple, coconut cream, simple syrup, and 3/4 ounce lime juice, and transfer to freezer until frozen, at least one hour (the sugar in the mixture may prevent it from freezing solid; this is okay).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a blender, combine frozen pineapple mixture with ice-cold rum and ice and blend until thick and slushy. Taste, then blend in the remaining 1/4 ounce lime juice, if desired. Pour into a large glass, garnish with pineapple and/or a cherry, and serve, with or without an paper umbrella and straw.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you want to make multiple drinks, you can pre-batch up to a double recipe (a blender may not hold much more than that easily) in a single container, then divide after blending; for more than two drinks, use separate containers to hold more servings.</p>"}]}