{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/20170623-steak-sandwich-chacarero07-composite.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "Latin American", "keywords": ["beef", "chacarero", "Chilean", "green bean", "grill", "Latin American", "sandwich", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "<em>Chacarero Chileno</em> (Chilean Steak and Bean Sandwiches)", "link": "https://www.seriouseats.com/recipes/2017/06/chacarero-chileno-steak-sandwich.html", "description": "On paper, the <em>chacarero chileno</em> sandwich seems...weird. Grilled beef, sliced tomato, and cooked green beans. But when done properly, it <em>works</em>. Prove it to yourself by trying this recipe.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Grilling, Smoking, and Barbecue", "Latin American", "Legumes", "Mains", "Quick Dinners", "Sandwiches", "Summer"], "recipeIngredient": ["Kosher salt", "1/2 pound (225g) green beans, cut on a sharp bias into long, thin strips", "1 cup jarred pickled <em>peperoncini</em> or pickled banana peppers, with their liquid, peppers cut into rings", "1 1/2 pounds (680g) skirt steak, hanger steak, or flap meat (see note)", "3/4 cup (175ml) mayonnaise ", "3 medium cloves garlic, minced", "3 tablespoons (45ml) extra-virgin olive oil ", "Freshly ground black pepper", "4 sturdy rolls, such as <em>telera</em> or ciabatta rolls", "Sliced fresh tomato"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a rolling boil. Add beans and cook until tender (they should be slightly softer than al dente), about 4 minutes. Drain beans and run under cold water to halt cooking. Transfer to a medium bowl. Add peperoncini and their liquid and toss to combine. Set aside at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with one piece at a time, place a piece of steak between 2 sheets of plastic wrap or inside a heavy-duty zipper-lock bag and pound gently with the bottom of a skillet until the meat is less than 1/4 inch thick. Cut each steak into lengths that slightly overhang the length of your bread. Set meat aside on a large tray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together mayonnaise, garlic, and olive oil. Season generously with black pepper. Transfer half of mixture to a covered container and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a pastry brush, brush steak pieces on both sides with remaining mayonnaise mixture. Season generously with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working in batches if necessary, place meat directly over hot side of grill and cook without moving until well charred on first side, about 2 minutes. Flip and cook until charred on second side, about 2 minutes longer. Transfer steak to a clean plate as it finishes cooking. When steak is cooked, toast buns, cut side down, on grill until crisp and lightly charred.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Assemble the Sandwiches:</strong> Slather top and bottom buns with remaining mayonnaise mixture. Layer meat, tomatoes, and bean/pepper mixture on bottom buns, then close firmly with top buns. Cut sandwiches in half on a bias (remember: <a href=\"http://www.seriouseats.com/2016/11/triangles-taste-better-charity-t-shirt-sale-la-cocina.html\">triangles taste better!</a>) and serve.</p>"}]}