{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/05/20170502-pulled-lamb-sandwiches-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["cabbage", "lamb", "sandwich", "slaw"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Indian-Spiced Oven-Cooked Pulled Lamb Sandwiches", "link": "https://www.seriouseats.com/recipes/2017/05/pulled-lamb-sandwiches-oven-recipe.html", "description": "Instead of the classic pork shoulder, we turn to lamb shoulder, cooking it until meltingly tender and shreddable. A bold barbecue sauce spiked with Indian spices stands up to the lamb's gamey flavor, while a bright, crunchy slaw provides all the contrast the slow-cooked meat needs.", "totalTime": "3 hours 30 minutes", "recipeYield": "Makes 8 sandwiches", "recipeCategory": ["Braising and Stewing", "Cabbage", "Lamb", "Mains", "Sandwiches"], "recipeIngredient": ["3 tablespoons dark brown sugar (40g), plus more to taste", "1 tablespoon (6g) kosher salt, plus more to taste", "2 teaspoons garam masala", "1 1/2 teaspoons paprika", "1 1/2 teaspoons ground turmeric", "1/2 teaspoon ground ginger", "1/2 teaspoon onion powder", "1/2 teaspoon garlic powder", "1/2 teaspoon ground cumin", "Large pinch cayenne pepper", "3 1/2 pounds boneless lamb shoulder", "1/4 cup ketchup (60ml)", "3 tablespoons tomato paste (45ml)", "1 tablespoon Worcestershire sauce (15ml)", "1 tablespoon Dijon mustard (15ml)", "1 tablespoon molasses (15ml)", "1 tablespoon cider vinegar (15ml), plus more to taste", "2 teaspoons good quality liquid smoke (10ml), such as <a href=\"http://amzn.to/2qsk3fl\">Wright's</a> or <a href=\"http://amzn.to/2rrbFL6\">Colgin</a>, plus more to taste", "2 teaspoons hot sauce (10ml), such as Tabasco", "1 teaspoon Asian fish sauce (5ml)", "3 tablespoons vegetable oil or other neutral oil", "1 medium yellow onion, diced", "1 cup <a href=\"http://www.seriouseats.com/2014/10/how-to-make-rich-flavorful-easy-chicken-stock.html\">homemade chicken stock</a> or low-sodium store-bought broth (240ml)", "<strong>For the Slaw:</strong>", "8 ounces (225g) shredded green cabbage (about a quarter of a cored 3-pound cabbage)", "1 medium (4-ounce; 110g) carrot, grated on a box grater", "Small handful flat-leaf parsley leaves", "3 tablespoons cider vinegar (45ml)", "3 tablespoons mayonnaise (45ml)", "1 tablespoon caraways seeds", "1/2 teaspoon ground mustard seeds or dry mustard powder", "Kosher salt and freshly ground black pepper", "8 potato buns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to lower position and preheat oven to 300&deg;F (150&deg;C). In a small bowl, combine brown sugar, salt, garam masala, paprika, turmeric, ground ginger, onion powder, garlic powder, cumin, and cayenne pepper. If lamb is tied up, remove twine and unfurl on a work surface. Season lamb all over with 2 to 3 tablespoons spice mixture, making sure to rub it on all sides. Reserve remaining spice mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using butcher's twine, tie up lamb shoulder into an even cylinder.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together ketchup, tomato paste, Worcestershire, Dijon, molasses, cider vinegar, liquid smoke, hot sauce, and fish sauce. Stir in 1/4 cup of reserved spice mixture. Season with salt, if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a Dutch oven over medium-high heat until shimmering. Add lamb and cook, turning occasionally, until well browned on all sides, about 5 minutes total. (Lamb will brown fast because of the sugar; do not let it burn.) Add onion and cook, stirring and scraping up browned bits from the bottom of the pan, until softened, about 2 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add half of sauce mixture and chicken stock to Dutch oven, stirring to blend; reserve remaining sauce. Cover, transfer to oven, and cook until lamb is just starting to turn tender, about 2 hours. Remove lid and continue cooking until a knife or fork shows very little resistance when twisted inside the meat and a dark bark has formed, about 1 hour longer; add a small dose of water if at any point the pot goes dry during the last hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Meanwhile, for the Slaw:</strong> In a large bowl, combine cabbage, carrot, parsley, cider vinegar, mayonnaise, caraway, and mustard seeds, tossing to combine thoroughly. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer lamb to a large bowl, reserving liquid in pot. Using a ladle, skim off excess fat from liquid and discard. Add reserved sauce to pot and whisk to combine. When lamb is cool enough to handle, shred with two forks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ladle sauce into lamb, tossing until meat is nicely coated; you may not need to add all the sauce. Season to taste with more salt, sugar, liquid smoke, or cider vinegar, as desired.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pile pulled lamb onto the bottom half of each bun. If you have extra sauce, you can ladle some onto each pile of lamb; you can also lightly sprinkle with any remaining spice rub. Top with slaw, close buns, and serve.</p>"}]}