{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/09/cryoblanch-beans-3.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["blanch", "cryo-blanch", "fried garlic", "green bean", "the food lab book", "vegetable"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "The Food Lab: Cryo-Blanched Green Beans", "link": "https://www.seriouseats.com/recipes/2017/09/food-lab-cryo-blanched-green-beans-fried-garlic-recipe.html", "description": "Cryo-blanching before sautéing softens these green beans in much the same way that par-cooking would, leaving them with a fresh, green flavor and a slight crunch. A sprinkling of golden-brown fried garlic is a nice touch on these or, well, pretty much any vegetable.", "totalTime": "1 1/2 hours (if making fried garlic; excluding time to cryo-blanch the green beans)", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Garlic", "Gluten-Free", "Legumes", "Other Vegetables", "Sides", "Stovetop", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["1 pound (450g) trimmed green beans (see note)", "<strong>For the Fried Garlic (optional):</strong>", "1 pound (450g) peeled whole garlic cloves", "2 cups (480ml) canola oil", "Kosher salt", "<strong>To Finish the Green Beans:</strong>", "1 tablespoon (15ml) extra-virgin olive oil, plus more for drizzling if desired", "2 cloves garlic, thinly sliced", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Cryo-Blanch the Green Beans:</strong> Lay green beans out in a single layer on a rimmed baking sheet and place them in the freezer, uncovered. Once they are completely frozen, after about 3 hours, transfer them to a zipper-lock freezer bag, squeeze out any excess air, seal, and return to the freezer; they should be good for at least a few months and can be cooked directly from frozen. To proceed with this recipe, thaw green beans for about 30 minutes, then dry thoroughly with paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fried Garlic (if using):</strong> While green beans are thawing, line a rimmed baking sheet with 6 layers of paper towels. Place garlic in the bowl of a food processor and pulse 8 to 10 times, scraping down sides and redistributing garlic as necessary, until it is chopped into pieces no larger than 1/8 inch across. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine chopped garlic and oil in a wok or medium nonstick saucepan. Place over high heat and cook, stirring frequently, until garlic is completely soft, about 20 minutes. Continue to cook, stirring constantly, until garlic is light golden brown, about 8 minutes. Do not let garlic get beyond golden brown, or it will become very bitter. About 15 to 20 seconds before you think the garlic is done, transfer it immediately to a fine-mesh strainer set over a heatproof bowl or saucepan; set garlic oil aside to cool and reserve for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer fried garlic to the paper towels. Lift up one end of top layer of towels and roll garlic off onto the second one. Blot with first towel to absorb excess oil, then repeat, transferring garlic from one layer of paper towels to the next, until only one layer remains. Season well with salt and allow to cool completely, about 45 minutes. Once it has cooled, transfer garlic to an airtight container and store at room temperature for up to 3 months. (You will not need the full yield of fried garlic for this recipe.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish the Green Beans:</strong> Heat olive oil in a 12-inch skillet over medium-high heat until shimmering. Add beans and cook, without stirring, until lightly blistered on first side, about 1 minute. Add sliced garlic and cook, stirring and tossing, until garlic is light golden brown. Season to taste with salt and pepper. Drizzle with additional olive oil, if desired, and sprinkle with 2 tablespoons fried garlic, if using. Serve.</p>"}]}