{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/05/20170420-broccoli-radicchio-parmesan-pistachio-salad-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["blanch", "broccoli", "nut", "pistachio", "radicchio", "salad"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Broccoli Salad With Radicchio, Basil, and Pistachios", "link": "https://www.seriouseats.com/recipes/2017/05/broccoli-salad-radicchio-basil-pistachio-recipe.html", "description": "The secret to the success of this broccoli salad is that it handles the florets and stems differently. The florets are blanched briefly, just long enough to soften them and make them juicy, while still preserving their crisp, fresh bite. The stems, meanwhile, are left raw, for a refreshing crunch. Tossed with radicchio and a bold vinaigrette made from basil and pistachios, this is a salad to make you love all the parts of broccoli.", "totalTime": "25 minutes", "recipeYield": "Serves 6 to 8 as a starter and 4 as a main", "recipeCategory": ["Broccoli", "Easter", "Gluten-Free", "Nuts", "Quick and Easy", "Salads", "Stovetop", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["3 pounds broccoli, stems peeled and cut into thin strips, florets reserved", "1 cup roasted shelled pistachios (2 ounces; 60g), divided", "3 tablespoons white wine vinegar (45ml)", "1 teaspoon Dijon mustard (5ml)", "2 medium cloves garlic", "1/2 cup vegetable oil (120ml)", "5 large basil leaves", "1/4 cup extra-virgin olive oil (60ml), divided", "Kosher salt and freshly ground black pepper", "1 (10-ounce; 280g) head radicchio, quartered, cored, and leaves cut into wide strips", "Shaved Parmigiano-Reggiano cheese, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare an ice bath. In a medium or large pot of salted boiling water and working in batches, cook broccoli florets until just barely softened and bright green, 1 minute. Using a strainer, transfer immediately to ice bath and repeat with remaining broccoli florets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once broccoli is fully chilled, drain very well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, in a blender, combine 1/4 cup (1/2 ounce; 15g) of the toasted pistachios with vinegar, Dijon, garlic, and vegetable oil. Blend at high speed, stopping to scrape down the blender jar sides if necessary, until pistachios are mostly pureed with only some small chunks left. Add basil leaves and blend until finely chopped. Add olive oil and blend at the slowest speed until incorporated. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly crush or chop remaining pistachios. In a large salad bowl, combine drained broccoli florets, broccoli stems, crushed pistachios, radicchio, and a generous shaving of Parmesan cheese. Stir dressing well (or mix it briefly in the blender at slow speed to stir), then add just enough to lightly coat all the salad ingredients. Toss well and season with salt and pepper. If more dressing is needed, add more. Top with more fresh shavings of Parmesan and serve.</p>"}]}