{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/04/20180405-asparagus-alla-milanese-variations-vicky-wasik-19.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["asparagus", "cheese", "egg", "Italian", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Broiled Asparagus With Fried Egg and Gorgonzola", "link": "https://www.seriouseats.com/recipes/2018/04/broiled-asparagus-with-fried-egg-and-gorgonzola.html", "description": "Inspired by classic asparagus <em>alla Milanese</em>, this easy dish features asparagus that's been blistered in the broiler for an intense, woodsy flavor. On top are pieces of sweet and creamy gorgonzola cheese, which gently melt from the heat from the asparagus, a fried egg, grated Parmigiano-Reggiano, and toasted bread crumbs for a light, crunchy texture.", "totalTime": "25 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Asparagus", "Cheese", "Easter", "Fried Eggs", "Italian", "Sides", "Spring", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["2 tablespoons (30ml) extra-virgin olive oil, plus more for drizzling", "Large pinch red pepper flakes", "3 sage leaves, very thinly sliced crosswise", "1/2 cup (1 ounce/30g) panko bread crumbs", "Kosher salt", "1/2 pound (225g) asparagus, <a href=\"https://www.seriouseats.com/2017/04/how-to-trim-asparagus-stalks-spears.html\">woody ends trimmed</a>", "1 1/2 tablespoons (22g) unsalted butter", "1 large egg", "1 ounce (30g) gorgonzola dolce cheese", "Parmigiano-reggiano, for grating", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler and position rack about 4 to 6 inches from it. In a small skillet, heat olive oil with red pepper flakes over medium-high heat until shimmering. Add sage and let frizzle until pan goes silent. Add bread crumbs and cook, tossing and stirring constantly, until toasted. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a rimmed baking sheet, drizzle asparagus with oil and toss to coat. Season with salt. Broil asparagus, shaking and rotating pan occasionally to cook them evenly on all sides, until asparagus is blistered, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small nonstick or cast iron skillet, melt butter over medium-high heat until foaming. Add egg and cook until whites are set and have a thin crispy ring around their edge, and the yolk is still runny. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange asparagus on a plate in a single, even layer. Drizzle with fresh olive oil and season with salt and pepper. Break gorgonzola into small chunks and scatter them all over the asparagus. Scatter some seasoned bread crumbs all over, then top with some grated Parmigiano-Reggiano cheese. Slide the egg on top, then drizzle with more oil and top with more bread crumbs and grated cheese. Finish with freshly ground black pepper, then serve."}]}