{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/04/harissashrimp.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["beer", "butter", "harissa", "shrimp"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Quick Broiled Shrimp With Harissa and Beer", "link": "https://www.seriouseats.com/recipes/2018/04/harissa-and-beer-broiled-shrimp.html", "description": "Shrimp and butter have always been the ultimate combo, but the addition of bitter, hoppy beer paired with a spicy homemade harissa pack this simple dish with flavor. The shrimp are cooked shell-on under a broiler, yielding plump and juicy flesh. The resulting butter and beer sauce is begging to be mopped up with crusty bread. You won't even need a plate for this one, just dig right into the piping hot skillet.  ", "totalTime": "20 minutes ", "recipeYield": "Serves 2 - 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Father's Day", "Mains", "Mother's Day", "Quick and Easy", "Quick Dinners", "Shrimp", "Valentine's Day"], "recipeIngredient": ["1 pound 16/20 shrimp, shell-on, deveined", "1 1/2 teaspoons kosher salt", "1/2 bottle (6 ounces) beer, whatever kind you're drinking ", "2 cloves garlic, thinly sliced", "1/2 cup (4 ounces) butter, room temperature, cut into 1-inch pieces", "1/4 cup (2 ounces) <a href=\"https://www.seriouseats.com/recipes/2018/04/fresh-chili-harissa.html\">fresh chili harissa</a> (see note)", "1/4 cup (2 ounces) <a href=\"https://www.seriouseats.com/recipes/2018/04/dried-chili-harissa.html\">dried chili harissa</a>", "bread and more beer to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a sheet tray lined with foil or a large cast iron skillet under the broiler to preheat. Toss the cleaned shrimp with salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beer and garlic to a small, 2-quart saucepan over medium-high heat. Reduce until it is sticky and only about 3 tablespoons in volume, about 5 minutes. The beer will foam up while boiling. Set the pot askew on the burner to prevent it from boiling over. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter to the beer one tablespoon at a time while constantly swirling until incorporated and thick, about 2 minutes. Remove from heat and stir in the harissas. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the butter sauce over the shrimp and toss to combine. Pour the shrimp and all the sauce on the preheated sheet tray or skillet. It will hiss and sputter. Make sure the shrimp is in one even layer and place the tray or the skillet under the broiler until shrimp are opaque and cooked through, about 4 minutes. Serve immediately. "}]}