{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/homemaderaisins.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["cherry tomato", "olive oil", "oven-dried", "raisin", "roasted tomato", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Tomato Raisins (Oven-Dried Whole Cherry Tomatoes)", "link": "https://www.seriouseats.com/recipes/2018/08/tomato-raisins-oven-dried-whole-cherry-tomatoes.html", "description": "Little cherry tomatoes are slowly roasted until they become plump, concentrated, sweet-savory tomato raisins. ", "totalTime": "3 to 7 hours", "recipeYield": "Makes about 1 pint", "recipeCategory": ["Condiments and Sauces", "Gluten-Free", "Sides", "Snacks", "Summer", "Tomato", "Vegetarian"], "recipeIngredient": ["3 pounds (1360g) cherry tomatoes", "1/4 cup (50g) sugar", "1 tablespoon (12g) kosher salt", "2 tablespoons (1 ounce; 30g) extra-virgin olive oil, plus more to cover finished tomatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large stock pot of water to boil and prepare an ice bath in a large bowl. Line two rimmed baking sheets with parchment paper. Adjust two oven racks to the upper and lower middles of the oven and preheat to 250&deg;F (120&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, using a sharp paring, tourne, or utility knife, remove the core from the stem end of each tomato and score the skin on the opposite end with an \"X.\""}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one large handful of tomatoes at a time, drop them into the boiling water until their skins begin to separate from the flesh at the \"X,\" 30 seconds to 1 minute. Using a large kitchen spider, transfer the tomatoes to the ice bath to halt the cooking. Continue with all the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small paring knife or your fingers, peel each tomato and line them up on the rimmed baking sheets. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the sugar and salt with 2 teaspoons of water until the mixture resembles wet sand. Stir in the olive oil. (Not all of the sugar and salt will dissolve; this is okay.) Using a pastry brush, dab each peeled tomato with a the glaze mixture. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast trays of tomatoes until they are a quarter of their original size, stopping to brush with additional glaze and rotating the baking sheets every hour.  Depending on your oven, it can take anywhere from 2 to 6 hours for the tomatoes to reduce in size. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Eat right away, or transfer to a sealable container and cover with extra virgin olive oil. Tomato raisins will keep covered in oil in the fridge for up to two weeks or bagged and frozen for six months. "}]}