{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/01/20180112-duck-breast-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["duck", "duck breast", "low carb", "poultry", "sear"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Pan-Seared Duck Breast", "link": "https://www.seriouseats.com/recipes/2018/02/pan-seared-duck-breast.html", "description": "Cooking duck breast at home is as easy as one, two, three. First, score the skin so the fat can quickly render away. Second, cook it low and slow for tender meat and a crispy skin. Third, use the tasty browned bits that develop during cooking to make a quick pan sauce to top it all off. ", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Duck", "Father's Day", "Gluten-Free", "Mains", "Mother's Day", "Other Meats", "Quick and Easy", "Quick Dinners", "Stovetop", "Valentine's Day"], "recipeIngredient": ["4 duck breasts, 4 to 5 ounces (112 to 140g) each", "Kosher salt", "1/2 cup dry white wine (4 fluid ounces; 120ml)", "1 1/2 cups <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or store-bought stock combined with 1 tablespoon powdered <a href=\"http://www.seriouseats.com/2016/11/how-to-use-gelatin-better-stock-sauce-dessert.html\">gelatin</a> (12 fluid ounces; 360ml)", "4 tablespoons unsalted butter (2 ounces; 60g)", "1/4 cup (60ml) freshly squeezed orange juice from 1 orange", "1 teaspoon freshly grated orange zest", "Freshly ground black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With a sharp knife, gently score duck breast skin in a tight crosshatch pattern, keeping the scores 1/8 inch apart. If you prefer a little fat left on the breasts after cooking, just barely score the skin; to render more fat, score more deeply, taking care not to expose the flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season duck breasts with salt, heavily on the skin side and lightly on the flesh side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place duck breasts, skin side down, in a large, cold sauté pan. Place pan over low to medium-low heat. To keep the edges from curling up, press duck breasts down with the help of a smaller sauté pan. After about 5 minutes, the fat should begin to gently bubble. If the fat is either silent or spitting, adjust heat accordingly. Maintain the gentle bubble of fat, pouring out excess rendered fat throughout the cooking process, until much of the fat has rendered, skin is golden brown, and duck's internal temperature is 125&deg;F (52&deg;C), about 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium and further brown skin if needed, about 1 minute, before flipping and cooking on the flesh side. For medium-rare meat, cook until breast registers 130&deg;F (54&deg;C) on an instant-read thermometer, about 1 to 2 minutes. Continue cooking until duck registers 140&deg;F (60&deg;C) for medium or 155&deg;F (68&deg;F) for well-done. Remove duck from pan and set aside to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Pan Sauce:</strong> Over high heat, deglaze sauté pan with white wine. Scrape up any brown bits stuck to pan and let wine reduce until pan is almost dry and only 1 to 2 tablespoons remain, about 2 minutes. Add chicken stock and let reduce by half, until sauce is sticky and rich, about 2 minutes. Remove sauce from heat and swirl in butter until melted and evenly incorporated. Season sauce with orange juice and zest, salt, and black pepper. Serve with duck breast. "}]}