{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180808-klondike-bars-vicky-wasik-39.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["chocolate", "coconut oil", "dessert", "frozen treat", "ice cream", "ice cream bar", "klondike bar", "meringue", "milk chocolate", "no-churn", "swiss meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Homemade Klondike Bars", "link": "https://www.seriouseats.com/recipes/2018/09/homemade-klondike-ice-cream-bars-recipe.html", "description": "The secret to making homemade ice cream that's as fluffy as what's inside a real Klondike Bar is that the stuff inside the bar isn't ice cream at all, but <a href=\"https://www.seriouseats.com/recipes/2016/11/easy-swiss-meringue-recipe.html\">Swiss meringue</a>. Cut with milk and cream, it becomes a light and airy no-churn ice cream that's easy to slice into bars for dipping. Thanks to a generous helping of refined coconut oil, the milk chocolate coating is crisp, glossy, and whisper-thin. ", "totalTime": "13 hours", "recipeYield": "Nine 2 1/2–inch squares", "recipeCategory": ["Chocolate", "Gluten-Free", "Ice Cream and Frozen Treats", "Summer", "Valentine's Day"], "recipeIngredient": ["<strong>For the Filling:</strong>", "3 ounces egg whites (from about 3 large eggs; 85g)", "3 3/4 ounces sugar (about 1/2 cup; 105g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon cream of tartar, or 1/4 ounce lemon juice (about 1 1/2 teaspoons; 7g)", "8 ounces heavy cream (about 1 cup; 225g)", "2 1/2 ounces milk (about 1/4 cup plus 1 tablespoon; 70g), any percentage will do", "1/8 teaspoon vanilla extract", "<strong>For the Chocolate Coating:</strong>", "7 ounces dark milk chocolate, such as <a href=\"https://www.amazon.com/dp/B000EUJK34/?tag=serieats-20\">Endangered Species 48%</a>, finely chopped (about 1 cup; about 200g)", "3 1/2 ounces refined coconut oil (shy 1/2 cup; about 99g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> Line an 8-inch-square cake pan with two 8- by 14-inch sheets of parchment paper so that the parchment completely covers the bottom and sides of the pan, with a little excess all around. These flaps will be essential in removing the \"ice cream\" later on; wax paper and tinfoil should not be used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a water bath in a wide pot, with a thick ring of crumpled tinfoil set inside to later prevent the bowl from touching the bottom of the pot or the water itself. Place pot over high heat until water is bubbling-hot, then adjust to maintain a gentle simmer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Filling:</strong> Combine egg whites, sugar, salt, and cream of tartar in the bowl of a stand mixer. Place bowl over the water bath so it sits on the foil ring (the bowl should not touch the water). Cook, stirring and scraping continuously with a flexible spatula, until egg white mixture reaches 165°F (74&deg;C). This should take about 6 minutes in a metal bowl; if it takes substantially longer, it simply means the heat is too low. If the mixture cooks too fast, or scrambles despite constant stirring, this indicates that the water has come to a boil, or that the water is able to touch the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mixture reaches 165°F, transfer bowl to a stand mixer fitted with a whisk attachment and whip at high speed until meringue is glossy, stiff, and thick, about 5 minutes. (The timing will vary depending on the power of a given stand mixer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once meringue is thick and stiff, whip the heavy cream to stiff peaks, as well. (This can be done in a separate bowl by hand or with a hand mixer, or in the original stand mixer bowl if the meringue is transferred to a second bowl; no need to wash the whisk.) Add milk and vanilla to meringue and whisk to combine. Add whipped cream and continue whisking until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately pour \"ice cream\" mixture into prepared pan and spread into an even layer. Cover with foil (the foil should not touch the ice cream) and freeze overnight or until 0&deg;F (-18&deg;C). Meanwhile, freeze a cutting board large enough to accommodate the pan as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the excess parchment, tug the chilled ice cream from the pan. Remove one sheet of parchment and place over the surface of the ice cream, then invert ice cream onto the chilled cutting board. Peel off remaining parchment and cut ice cream into 9 squares with a large <a href=\"https://www.seriouseats.com/2018/06/the-best-chefs-knives.html\">chef's knife</a>, wiping the blade clean with a paper towel between slices. Drape with a sheet of plastic wrap and return ice cream bars to the freezer until needed. (If this will be longer than 1 hour, be sure to wrap the bars tightly in plastic to prevent odor absorption.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Chocolate Coating:</strong> Melt chocolate over a water bath or in a microwave-safe bowl, using two or three 15-second bursts on normal power and stirring well between rounds. Add coconut oil and stir until fully melted and smooth. If any lumps refuse to melt, rewarm briefly and stir until they do. Pour approximately two-thirds of this mixture into a bowl or container approximately 4 1/2 inches wide and 2 1/2 inches deep (see note), and cool to about 80&deg;F (27&deg;C). The time needed for this stage will vary depending on the starting temperature of the coconut oil and melted chocolate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Assemble the Bars:</strong> When the chocolate has cooled, grab an extra sheet of parchment and remove prepared ice cream bars from freezer. Working with one at a time, use an offset spatula to loosen each bar and transfer to the dish of chocolate coating. Using a fork, dunk each portion under the chocolate, then lift and allow the excess to run off. Transfer to a clean sheet of parchment set on the free edge of the cutting board. This setup will work something like a conveyor belt, as the dipped bars slowly outnumber the un-dipped bars and take up new space on the chilled board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue until all bars have been coated, adding reserved chocolate to dipping bowl as needed. Pause as needed throughout the process to re-freeze the bars if they seem to be melting or softening around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze the bars until the chocolate coating has fully set, about 15 minutes, then transfer to a gallon-sized, freezer-safe zip-top bag. If you like, the individual bars can be wrapped in a sheet of wax paper or thin <a href=\"https://www.amazon.com/gp/product/B07D8JYQ9H/?tag=serieats-20\">decorative foil</a>. Continue freezing until ice cream has fully hardened after its time outside the freezer, about 4 hours more. In an airtight container, the ice cream bars can be kept in the freezer for up to 1 month."}]}