{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/10/20180913-wild-rice-side-dish-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "American", "keywords": ["mushroom", "pine nut", "thanksgiving", "wild rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2", "ratingCount": "1"}, "name": "Wild Rice Salad With Mushrooms, Celery Root, and Pine Nuts", "link": "https://www.seriouseats.com/recipes/2018/10/wild-rice-salad-with-mushrooms-celery-root-and-pine-nuts.html", "description": "This easy wild rice salad (or dressing, or stuffing) is deeply savory and earthy, thanks to sautéed mushrooms, celery root, and toasted pine nuts.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 6 to 10 as a side", "recipeCategory": ["American", "Christmas", "Mushrooms", "Nuts", "Rice", "Salads", "Sides", "Stovetop", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["14 ounces wild rice (about 2 1/3 cups; 396g)", "Chicken stock, vegetable stock, or water, for cooking the rice (see note)", "Kosher salt and freshly ground black pepper", "1/4 cup (60ml) vegetable oil", "10 ounces (280g) cremini mushrooms, thinly sliced", "1 ounce (30g) dried mushrooms, such as porcini, soaked in boiling water, then drained, squeezed, and chopped (optional)", "4 sprigs thyme", "One 12-ounce (340g) medium celery root, peeled and cut into 1/4-inch dice (about 1 1/3 cups diced)", "One 8-ounce (225g) yellow onion, cut into 1/4-inch dice", "Two 2-ounce (55g) ribs celery, diced", "3 ounces (85g) pine nuts, toasted", "2 tablespoons minced flat-leaf parsley leaves and tender stems", "2 tablespoons minced chives", "1/4 cup (60ml) apple cider vinegar, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, combine wild rice with enough stock and/or water to cover by at least 2 inches. Season lightly with salt. Bring to a simmer, then continue to cook at a simmer until rice grows tender and many of the grains have ruptured, about 50 minutes; add more water at any point as needed to keep the rice covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large skillet, heat oil over high heat until shimmering. Add fresh and soaked dried mushrooms (if using) and thyme sprigs and cook, stirring, until mushrooms are golden, about 6 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to medium and add celery root, onion, and celery, and continue cooking, stirring frequently and scraping the bottom of the skillet, until vegetables are just tender, about 5 minutes. Season with salt and pepper. Discard thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fine-mesh strainer, drain wild rice well. Transfer to a large bowl and mix with the mushrooms and vegetables. Stir in pine nuts, parsley, and chives. Add the vinegar 1 tablespoon at a time until the salad has a subtle brightness, but not an obvious tang. Season once more with salt and pepper, if needed, then serve warm or at room temperature."}]}