{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/06/20180622-paratha-vicky-wasik-34-.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Indian", "keywords": ["bread", "butter", "flatbread", "flour", "ghee", "Indian", "maida", "paratha", "south asian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Paratha (Flaky South Asian Flatbread)", "link": "https://www.seriouseats.com/recipes/2018/07/paratha-flaky-south-asian-flatbread.html", "description": "Crispy, chewy, buttery, and comprised of innumerable flaky layers, the paratha is a flatbread that can complement almost any dish and can be eaten at any meal. ", "totalTime": "4 hours", "recipeYield": "Makes 8 parathas", "recipeCategory": ["Bread", "Indian", "Stovetop", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["3 cups (15 ounces; 420g) all-purpose flour, plus more for rolling (see note)", "1 tablespoon (12g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same by weight", "2 tablespoons (1 ounce; 30g) vegetable oil, or other neutral oil", "16 tablespoons (8 ounces; 112g) softened ghee, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make the Dough:</strong> In a large mixing bowl, whisk together the flour and kosher salt until combined, about 1 minute. Add the oil and rub evenly into flour, about 5 minutes. Make a well in the center of the flour and pour in 1 cup (240ml) of warm water. Roughly combine the flour and water with your fingers until just brought together, about 1 minute. Next, knead the dough until it forms a sticky ball, about 5 minutes. Leave the dough in the bowl and cover with plastic wrap or a moist towel. Set aside to rest at room temperature for at least 1 hour and up to 24 hours in the refrigerator. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the dough has rested, divide it into 8 equal portions. Work with one portion of dough at a time, keeping the remaining dough covered with a moist towel or plastic wrap while not handling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the First Roll:</strong> On a clean surface, roll out the dough until as thin as possible, sprinkling flour as needed to prevent the dough from sticking to the rolling pin. The final dimensions of the dough should be roughly 16 inches by 10 inches, and it should be paper thin and translucent. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small offset spatula, dab 1 tablespoon (15g) of softened ghee across the surface of the rolled out dough. Sprinkle a pinch of flour over the ghee. Starting from the top, roll down the dough sheet until it is all coiled into one long snake. Coil each end of the dough log inward until they meet at the center, then fold the two coils onto each other and press together firmly. Set aside the coiled dough ball to rest covered for at least one hour at room temperature and up to 24 hours in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Final Roll:</strong> On a lightly floured surface with a rolling pin, roll each coiled dough ball into a circle about 8 inches in diameter and 1/8-inch thick. Lightly dust the paratha, rolling pin, and counter with flour as needed to prevent sticking, dusting off any excess flour at the end. Rotate the paratha after each roll to maintain an even shape. Cook the rolled out parathas right away, or store between layers of parchment and wrapped in plastic wrap in the refrigerator for up to three days. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Cooking the Parathas:</strong> Preheat a heavy gauge 10- or 12-inch skillet over medium-low heat. Working with one paratha at a time, cook it in the dry skillet until dusty and dry to the touch, about 3 minutes per side. (After this first cook, the parathas can be stacked between sheets of parchment, wrapped in plastic, and stored in the refrigerator for 1 week or freezer for 3 months and cooked from frozen as needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the same skillet over medium-high heat. Add 1 tablespoon of ghee and cook 1 paratha at a time until golden brown and crispy, about 1 minute per side. Once cooked through, scrunch the paratha to release any built-up steam. Serve right away or hold warm wrapped in a kitchen towel and in a 250&deg;F (121&deg;C) oven for up to 1 hour.  "}]}