{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180810-white-chocolate-macadamia-nut-cookies-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["chocolate", "cookie", "drop cookie", "macadamia", "nut", "vanilla", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.875", "ratingCount": "8"}, "name": "White Chocolate Macadamia Nut Cookies", "link": "https://www.seriouseats.com/recipes/2018/08/white-chocolate-macadamia-nut-cookies.html", "description": "These soft, tender white chocolate macadamia nut cookies are loaded with vanilla flavor, thanks to white chocolate melted directly into the dough.", "totalTime": "About 45 minutes", "recipeYield": "Makes about 30 (3-inch) cookies", "recipeCategory": ["Baking", "Chocolate", "Christmas", "Cookies"], "recipeIngredient": ["4 ounces white chocolate, minimum 30% cocoa butter (about 1/2 cup, roughly chopped; 115g), from brands such as <a href=\"https://www.amazon.com/Green-Blacks-Organic-Chocolate-Vanilla/dp/B01ARIXPRE/?tag=serieats-20\">Green & Black's</a> (see note)", "8 3/4 ounces plain or <a href=\"https://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">lightly toasted</a> sugar (about 1 1/4 cups; 250g)", "1 3/4 teaspoons (7g) Diamond Crystal kosher salt, plus more for sprinkling; for table salt, use about half as much by volume or the same weight", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/8 teaspoon freshly grated nutmeg", "4 ounces unsalted butter (8 tablespoons; 115g), soft but cool, about 60°F (16°C)", "1 large egg (about 1 3/4 ounces; 50g), straight from the fridge", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "9 ounces all-purpose flour, such as Gold Medal (about 2 cups, spooned; 255g)", "8 ounces salted, dry-roasted macadamia nuts, roughly chopped (about 1 2/3 cups; 225g), from brands such as <a href=\"https://www.amazon.com/MacFarms-Roasted-Macadamia-Fresh-Hawaii/dp/B0796NG4N5/?tag=serieats-20\">MacFarms</a>, plus more for garnishing", "5 ounces roughly chopped white chocolate, minimum 30% cocoa butter (about 3/4 cup; 140g), from brands such as <a href=\"https://www.amazon.com/Green-Blacks-Organic-Chocolate-Vanilla/dp/B01ARIXPRE/?tag=serieats-20\">Green & Black's</a>, plus more for garnishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to middle position and preheat oven to 350°F (180°C). In a microwave-safe bowl, melt the white chocolate using three or four 15-second bursts at normal power; to prevent scorching, pause to stir the white chocolate between rounds. Transfer to the bowl of a stand mixer fitted with a paddle attachment, then add sugar, salt, baking powder, baking soda, nutmeg, and butter. Cream mixture on medium speed until fluffy and light, about 5 minutes, pausing at the halfway mark to scrape the bowl and beater with a flexible spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Resume mixing on medium speed. With mixer still running, add egg, followed by vanilla, and continue beating just until well combined. Pause to scrape bowl and beater with flexible spatula, then resume mixing on low. Add flour all at once; when flour is fully incorporated, use flexible spatula to fold in the macadamia nuts and the remainder of the white chocolate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a cookie scoop, divide dough into 2-tablespoon portions. If you like, these can be transferred to a zipper-lock bag and refrigerated for up to 1 week, or frozen for up to 3 months; soften to about 68&deg;F (20&deg;C) before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange portions on a parchment-lined half-sheet pan, leaving about 2 inches between cookies to account for spread. Gently flatten each portion into a disk, then top each with a few extra pieces of white chocolate and macadamia nuts and sprinkle lightly with salt. Bake until puffed and firm around the edges, though rather pale overall, about 12 minutes. (Due to their low lactose content, these cookies will not brown as you might expect. When fully baked, they will still be quite pale.) Cool directly on baking sheet until crumb is set, about 5 minutes. Store in an airtight container up to 3 days at room temperature."}]}