{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/20180530-basil-white-chocolate-mousse-vicky-wasik-31.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["basil", "cream", "cremeux", "dairy", "gelatin", "milk", "mousse", "pudding", "strawberry", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Fresh Basil Mousse", "link": "https://www.seriouseats.com/recipes/2018/06/fresh-basil-mousse.html", "description": "The flavor and color of this emerald green mousse comes from fresh basil, ground to a pulp with sugar, then steeped into an eggless custard base. White chocolate plays a supporting role, adding richness and body, while melding seamlessly with the herbal aroma. It's as creamy and light as a mousse should be, and the perfect showcase for fresh summer fruit, like strawberries, apricots, and nectarines. ", "totalTime": "5 hours", "recipeYield": "Eight 1/2-cup (3 1/4 ounce) servings", "recipeCategory": ["Chocolate", "Easter", "Father's Day", "Fruit Desserts", "Mother's Day", "Pastry", "Puddings and Custards", "Spring", "Stovetop", "Strawberry", "Summer", "Valentine's Day"], "recipeIngredient": ["<Strong>To Bloom the Gelatin:</strong>", "1/4 ounce unflavored gelatin powder, such as Knox or <a href=\"https://www.amazon.com/Now-Foods-Gelatin-Natural-Powder/dp/B000MGR302/?tag=serieats-20\">Now Foods</a> (about 2 1/4 teaspoons; 7g)", "\u20281 ounce cold milk, any percentage will do (about 2 tablespoons; 30g)", "<Strong>For the Mousse:</strong>", "3 1/2 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted sugar</a> (about 1/2 cup; 100g)", "1 1/2 ounces fresh basil (about 1 1/2 cups, loosely packed; 43g)\u2028", "1 teaspoon (4g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "4 ounces roughly chopped white chocolate, not chips (about 2/3 cup; 115g)\u2028", "\u202812 ounces milk, divided, any percentage will do (about 1 1/2 cups; 340g)", "8 ounces heavy cream (about 1 cup; 225g)", "Fresh fruit, such as sliced strawberries, apricots, or nectarines, for garnish", "Pine nuts or slivered almonds, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<Strong>To Bloom the Gelatin:</strong> In a small ramekin, mix gelatin with milk, stirring with a fork to break up the lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<Strong>Meanwhile, for the Mousse:</strong> In the bowl of a food processor, combine sugar and basil, then grind until reduced to wet pulp. In a 2-quart stainless steel saucier, combine basil-sugar with salt, white chocolate, and approximately one-third of the milk. Warm over medium heat, stirring constantly with a flexible spatula, until the white chocolate has fully dissolved and the mixture is hot to the touch, but not simmering. Remove from heat, add prepared gelatin, and stir until fully melted. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fine-mesh strainer set over a large heat-proof bowl, strain mixture, pressing on the basil solids with a flexible spatula to extract as much liquid as possible without forcing the pulp through the sieve; discard basil solids. Stir in the remaining milk, then cover and refrigerate until firm and cold, about 3 hours or to a temperature of 40°F (4°C). Alternatively, the mixture can be refrigerated for up to 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with a paddle attachment, beat the chilled base on medium speed until creamy and smooth, about 90 seconds; if needed, use a flexible spatula to remove any remaining lumps by smearing them against the side of the bowl. Scrape the smooth base back into its original bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cream to the stand mixer bowl (no need to wash) and whip with the whisk attachment until thick and stiff, about 3 minutes, although this will vary depending on the power of the mixer. Once thick, roughly fold approximately half the whipped cream into the basil mixture; then add the remainder and fold gently to combine. Transfer to a <a href=\"https://www.amazon.com/dp/B00CH33Z1Y/?tag=serieats-20\">disposable pastry bag</a>, snip off 1/4-inch from the tip, then pipe into serving dishes. Cover and refrigerate until firm, about 1 hour, or until needed, up to 12 hours. Serve with fresh fruit, sliced and macerated with sugar to taste, and/or nuts if you'd like."}]}