{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/09/20180823-bouillabaisse-french-fish-soup-liz-clayman-in-bowl.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["bouillabaisse", "broth", "fish", "French", "Provencal", "Provence", "saffron", "seafood", "soup", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Real Bouillabaisse (Bouillabaisse <em>Marseillaise</em>)", "link": "https://www.seriouseats.com/recipes/2018/09/bouillabaisse-marseillaise-fish-stew-recipe.html", "description": "There are many English-language recipes out there for bouillabaisse, but most are a far cry from the classic version made famous in the Provençal city of Marseille. This one shows you how to make a bouillabaisse that's much closer to the original, no matter where you live.", "totalTime": "3 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Clams, Mussels, and Oysters", "Father's Day", "Fish", "French", "Mains", "Mother's Day", "Soups and Stews", "Stovetop"], "recipeIngredient": ["<strong>For the Broth:</strong>", "1/2 cup (120ml) extra-virgin olive oil", "1 large yellow onion (12 ounces; 340g), <a href=\"https://www.seriouseats.com/2016/11/knife-skills-how-to-slice-and-dice-an-onion.html\">diced</a>", "1 large leek (1 pound; 450g), washed of any grit and <a href=\"https://www.seriouseats.com/2011/01/knife-skills-how-to-prepare-leeks.html\">diced</a>", "1 medium fennel bulb (8 ounces; 225g), <a href=\"https://www.seriouseats.com/2016/05/knife-skills-how-to-cut-fennel-slice-dice.html\">cored and diced</a>", "5 medium cloves garlic, crushed", "1/2 teaspoon whole fennel seeds", "2 large pinches saffron threads", "One (2-inch) strip zest from 1 orange", "Large pinch cayenne pepper or other red chili powder", "2 sprigs thyme", "2 tablespoons (30ml) tomato paste", "6 plum tomatoes (1 1/4 pounds; 565g), <a href=\"https://www.seriouseats.com/2016/10/how-to-peel-and-dice-tomatoes.html\">cored, seeded, and diced </a>", "2 pounds (900g) whole fish or fish bones and heads (see note)", "2 cups (475ml) dry white wine", "1/4 cup (60ml) Pernod or pastis (optional)", "2 quarts (1.9L) boiling water, or more as needed", "2 sprigs fresh flat-leaf parsley", "1 bay leaf", "Kosher or sea salt and freshly ground black pepper", "<strong>For the <em>Rouille</em>:</strong>", "2 medium cloves garlic", "1/4 cup crumbled stale bread or panko bread crumbs (1/2 ounce; 15g)", "Large pinch cayenne pepper or other red chili powder", "Pinch saffron threads", "1 large egg yolk", "Kosher or sea salt", "1/2 cup (120ml) extra-virgin olive oil", "<strong>To Finish:</strong>", "3 to 5 pounds (1.3 to 2.25kg) mixed whole and/or filleted fish (see note)", "1 pound (450g) mussels and/or crabs (optional; see note)", "Kosher or sea salt", "Baguette toasts, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make the Broth:</strong> In a large Dutch oven, heat olive oil over medium heat until shimmering. Add onion, leek, fennel, garlic, fennel seeds, saffron, orange zest, cayenne pepper, and thyme sprigs. Cook, stirring, until vegetables have softened, about 10 minutes; lower heat if necessary to prevent browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in tomato paste and cook, stirring, for 2 minutes. Add diced tomatoes and cook, stirring, for 3 minutes longer. Layer in whole fish and/or fish bones and heads, stirring to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add white wine and Pernod or pastis (if using), stirring to scrape up any bits from the bottom of the pot. Bring to a boil over medium-high heat, then boil until raw alcohol smell has cooked off, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough boiling water to fully cover all ingredients in the pot. Add parsley and bay leaf, increase heat to high, and bring broth to a vigorous boil. Allow to boil rapidly for 5 minutes. Lower heat to a simmer and continue to cook for 45 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Meanwhile, Make the Rouille:</strong> Using a <a href=\"https://www.seriouseats.com/2018/08/best-mortars-and-pestles.html\">mortar and pestle</a>, a <a href=\"https://www.seriouseats.com/2017/11/best-inexpensive-blenders-equipment-review.html\">blender</a>, or a <a href=\"https://www.seriouseats.com/2017/10/best-food-processor-equipment-review.html\">food processor</a>, process garlic, bread, cayenne pepper, saffron, and egg yolk to a paste. Work in 2 tablespoons (30ml) liquid from fish broth pot to thin paste slightly. (This can also help a blender or food processor work the mixture more effectively.) Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pounding with the pestle, or with the blender or processor running at its lowest speed, drizzle in the olive oil. If the mixture seems too thick at any point, add fish broth, 1 tablespoon (15ml) at a time, until a thick, mayonnaise-like consistency is reached. Refrigerate the rouille until ready to use, up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Finish:</strong> Working in batches, transfer broth and all ingredients, including fish bones, to a blender. Remove top vent from blender lid, cover with a folded clean kitchen towel, and turn blender on at lowest speed. (Keeping the blender fully sealed and turning it on at high speed immediately can be dangerous with hot liquids, so please don't do that.) Gradually increase speed to high, then blend until as smooth as possible. (This may take some time and will depend on your blender, but feel free to let it run for a minute or longer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer blended soup to a fine-mesh strainer set over a clean pot and, using a wooden spoon, work the broth through the strainer, scraping and pressing, until only bones and very dry fibrous material are left. Repeat with remaining broth and bones. Season strained broth with salt and pepper. Alternatively, you can work the broth and all the bones and solids through the fine disk of a food mill, but this will only work with a high-quality, commercial-grade food mill (see the \"Special Equipment\" section for a link)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return broth to heat and bring to a very gentle simmer. Working in batches if necessary, season the whole and filleted fish and fully submerge in broth. Poach until just cooked through, starting with the larger whole fish that will take the longest to cook and finishing with the fillets; feel free to check doneness by cutting into the thickest part of each fish or fillet. As each is done, transfer it to a serving platter and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using mussels or crabs, add to gently simmering broth and cook until mussels have just opened or crabs are cooked through. (This will depend on the size of your crabs; ask your fishmonger for advice if you need it.) Transfer to the serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the platter of fish to the table along with the broth in the soup pot or a tureen. Guests can eat the soup and fish separately, or together in the same bowl. The soup is best served with baguette toasts smeared with the rouille."}]}