{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/04/20180417-saltena-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Latin American", "keywords": ["chicken", "empanada", "hand pie", "salteña", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Salteñas (Bolivian Hand Pies Filled With Chicken Stew)", "link": "https://www.seriouseats.com/recipes/2018/04/saltenas-bolivian-hand-pies-filled-with-chicken-stew.html", "description": "These traditional Bolivian meat pies are part empanada and part soup dumpling, featuring a buttery pastry crust filled with a saucy chicken stew. The stew is seasoned with fruity aji panca chili powder and studded with raisins, which plump in the rich broth. The crust has a touch of sweetness, offering a delicate contrast to the savory filling.", "totalTime": "24 hours", "recipeYield": "Makes 9, 5-inch long salteñas", "recipeCategory": ["Baking", "Braising and Stewing", "Chicken", "Father's Day", "Latin American", "Mains", "Soups and Stews"], "recipeIngredient": ["<strong>For the stock:</strong>", "2 1/2 pounds (1.13kg) chicken wings", "1/2 small onion (5.3 ounces; 150g), roughly chopped", "2 cloves garlic (1/2 ounce; 12g), smashed", "1 medium red bell pepper (8.2 ounces; 230g), roughly chopped", "<strong>For the stew:</strong>", "2 tablespoons  reserved chicken fat (1 ounce; 30g)", "4 chicken thighs (about 1.8 pounds; 800g)", "kosher salt", "1 medium onion (10.7 ounces; 300g), chopped into 1/4 inch dice", "2 cloves garlic (1/2 ounce; 12g), minced finely", "1 teaspoon <em>aji panca</em> powder (or 1/2 teaspoon cayenne), see note", "1 teaspoon ground cumin", "1/2 teaspoon hot paprika", "1 tablespoon dried oregano", "1/4 teaspoon black pepper", "1 medium russet potato (5 ounces; 140g), peeled and chopped into 1/2-inch dice", "1/2 cup golden raisins (3.2 ounces; 90g) ", "1/2 cup frozen peas (3.5 ounces; 100g)", "<strong>For the dough:</strong>", "1 cup unsalted butter (8 ounces; 226g)", "2 teaspoons annatto powder ", "3 3/4 cups all-purpose flour (1 pound; 454g)", "2 teaspoons (.5 ounce; 12g) Diamond crystal kosher salt; for table salt, use about half as much by volume or the same by weight", "6 tablespoons sugar (2.7 ounces; 75g) ", "<strong>To assemble:</strong>", "3 hardboiled eggs, quartered", "9 black olives, halved", "1 egg white"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the stock:</strong> Preheat the oven to 500&deg;F (260&deg;C). Spread the chicken wings in a roasting pan and bake until deeply golden brown, about 40 minutes. Pour off any rendered chicken fat and reserve for cooking. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the wings from the roasting pan to a stock pot. Add 1 cup of water to the roasting pan and scrape up any brown bits with a wooden spoon. Pour the water and brown bits to a stockpot. Add enough water to cover the wings and simmer for 3 1/2 hours, adding more water if needed to keep chicken wings submerged. (Alternatively, simmer the wings in a pressure cooker at full pressure for 1 1/2 hours.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion, garlic, and bell pepper to the stock and simmer an additional 30 minutes. Strain the stock and reduce further or add more water until the yield is 5 cups. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the stew:</strong> Add the chicken fat to a 6-quart Dutch oven or similar heavy-bottomed, oven-safe pot and heat over medium-high until the fat shimmers. Season chicken thighs with salt and sear, skin side down, until golden brown, about 4 minutes. Flip chicken and sear on other side until browned, about 4 minutes longer. Transfer chicken to a plate and set aside. Drain any excess fat from pot and lower heat to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add diced onion and minced garlic to pot and cook, scraping up any browned bits from the chicken, until translucent and tender, about 5 minutes. Add aji panca or cayenne, cumin, paprika, oregano, and black pepper and cook until fragrant, about 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to high, then add chicken wing stock, diced potato, and raisins and bring to a simmer. Season with salt. Return chicken thighs to pot along with any accumulated juices. Reduce heat to low. Cover and gently simmer until chicken has cooked through, about 30 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the stew from heat and set aside until the chicken is cool enough to handle, about 1 hour (The chicken should be left to cool in the stew so that it doesn't dry out.) Using your hands, pick the meat from the chicken thighs and break into small pieces, discarding the skin and bones. Stir peas and picked chicken meat into the stew and refrigerate until the stew has solidified, about 4 hours, preferably overnight, and up to 3 days in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the dough:</strong> In a 2-quart saucepan, combine butter and annatto and melt to infuse the butter with color. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, whisk together the flour, salt, and sugar. Pour the melted butter into the flour mixture and, using your hands, mix until thoroughly combined and sandy. Add 3/4 cup (177mL) hot water to the flour mixture and mix until the dough comes together into a smooth ball. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 9 equal portions (about 100 grams each). Fold each portion of dough onto itself until it becomes smooth and pat into a disk. Cover with plastic wrap. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Assembly:</strong> Work with one portion of dough at a time, keeping the remaining pieces covered. Lightly dust your work surface with flour. Using a rolling pin, roll out one portion of dough into an 8-inch round about 1/8-inch thick. Loosen the dough from the work surface with an offset spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/9 (about 1 generous cup) of the chilled chicken stew to the center of the dough. Top it with a quarter of a hardboiled egg and two black olive halves. Brush the edges of the dough with egg white. Join the edges of the dough together over the filling. Press the edges together to encase the filling into a large football with a seam running across the top. Crimp the edges and transfer the salteña to a parchment-lined rimmed baking sheet. Repeat with the remaining dough and filling. Freeze the formed salteñas before baking at least 1 hour and up to 3 months in advance. (If freezing long-term, once the salteñas are fully frozen, wrap each in plastic and transfer to a zip lock freezer bag to prevent freezer burn.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Baking:</strong> If the salteñas have been frozen for only 1 hour, preheat your oven to 500&deg;F (260&deg;C). If the salteñas have been frozen solid for 4 hours or more, preheat your oven to 450&deg;F (232&deg;C). Line a rimmed baking sheet with parchment and spray lightly with cooking spray. Line the tray with the frozen salteñas. (Do not bake on the chilled baking sheet the salteñas were frozen on or the bottom of the pastry will not brown.) Brush the pastries with egg white and bake until the seam is blackened and the crust is golden brown, 15-20 minutes. Serve immediately. "}]}