{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180726-MHT-broiling-tomato-clams-vicky-wasik-14-.jpg", "author": {"@type": "Person", "name": "Michael Harlan Turkell"}, "recipeCuisine": "", "keywords": ["broil", "broiler", "clam", "easy", "seafood", "shellfish", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Broiled Clams With Tomatoes, Butter, and Tarragon", "link": "https://www.seriouseats.com/recipes/2018/08/broiled-clams-with-tomatoes-butter-and-tarragon.html", "description": "In just one skillet and with the broiler only briefly on, this recipe yields tender clams and juicy tomatoes in a buttery, herbal sauce.", "totalTime": "20 minutes, plus about 1 hour purging", "recipeYield": "Serves 2 as a light dinner or 4 as a first course", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fall", "Father's Day", "Mains", "Mother's Day", "Other Seafood", "Quick and Easy", "Quick Dinners", "Spring", "Summer", "Tomato", "Valentine's Day"], "recipeIngredient": ["Kosher or sea salt", "1 dozen littleneck clams (about 1 pound)", "1 tablespoon (15ml) extra-virgin olive oil", "4 medium cloves garlic, thinly sliced", "8 ounces (225 grams) grape or cherry tomatoes", "1/2 cup dry white vermouth (120ml)", "2 tablespoons (30g) unsalted butter", "1/4 cup tarragon leaves (about 5g)", "Crusty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with cold water and stir in enough salt to make it salty like the sea. Add clams and let stand 20 minutes. Lift clams from water and discard purging water; if there is sand in the bottom of the bowl, rinse it out and repeat this process until clams no longer release sand into the water (usually 2 to 3 purging cycles)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on the broiler and position the top rack 4 to 6 inches from the broiler element. In a 9-inch cast iron pan, add the olive oil and garlic. Broil for about 2 minutes, until the garlic is slightly browned, but not burnt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes and a large pinch of salt, tossing to coat. Broil until the tomatoes have burst and some of their juices have spilled into the pan, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add clams to the pan, nestling them between the tomatoes. Pour in the vermouth and add the butter in the center of the pan. Broil for 2 minutes, and then flip the clams, baste with the liquid and return to the broiler until all the clams have popped wide open, about 2 minutes longer (with an open-flame broiler, it's not impossible for the vermouth to briefly ignite; don't panic, just carefully blow out the flame and proceed). Broil for 1 additional minute after the last clam opens, then remove from broiler. Baste clams once more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the clams, tomatoes and all of the juices into a deep serving bowl. Garnish with the tarragon on top and let it stand for a 1 minute before eating so the anise-flavored herb has enough time to wilt and permeate the broth. Serve with crusty bread."}]}