{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/10/20181002-pork-cutlet-slaw-beer-pairing-IPA-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Michael Harlan Turkell"}, "recipeCuisine": "", "keywords": ["cutlet", "fry", "main", "pork", "schnitzel"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Pork Schnitzel (Breaded and Fried Pork Cutlet)", "link": "https://www.seriouseats.com/recipes/2018/10/pork-schnitzel-recipe.html", "description": "For hearty, down-to-earth fare to enjoy between sips of beer, you can't do much better than schnitzel, a breaded and fried cutlet that's traditionally big enough to overhang the sides of a plate. Though classic Viennese schnitzel is made with thinly pounded veal, pork is more accessible for most of us in the US, and just as tasty.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Father's Day", "Mains", "Pork", "Quick Dinners", "Stovetop"], "recipeIngredient": ["4 (one-inch-thick) boneless pork loin chops (about 8 ounces/225g each)", "Kosher salt and freshly ground black pepper", "1/2 cup all-purpose flour (2 1/2 ounces; 70g)", "3 large eggs, beaten", "2 cups (120g) panko bread crumbs", "3 cups (710ml) canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one pork chop at a time, trim fat and sinew off the chop, then make a cut lengthwise down the middle of one 1-inch-thick edge, about 3/4 of the way through the chop, without cutting it into 2 separate pieces, making a butterfly slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pork chop between two 12-inch-square pieces of plastic wrap and gently pound pork to 1/4-inch thickness, using a meat pounder or the bottom of a heavy 8-inch skillet. Repeat with remaining cutlets. Season pork cutlets with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a wide, shallow bowl or high-rimmed plate with flour, a second bowl or plate with beaten eggs, and a third bowl or plate with panko."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one cutlet at a time, dredge a cutlet in flour with your left hand, shaking off excess. Transfer to egg dish, then turn pork with your right hand to coat both sides. Lift with your right hand and allow excess egg to drain off, then transfer to bread crumbs. With your left hand, scoop bread crumbs on top of pork, then gently press, turning pork to ensure a good layer of crumbs on both sides. Using your left hand, transfer cutlet to a clean parchment-lined baking sheet, then repeat with remaining cutlets. Be careful not to over-bread the cutlets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a 12-inch cast iron skillet over medium-high heat until shimmering and just shy of smoking. Working with one cutlet at a time, gently lower cutlet into hot fat, laying it down away from you to prevent both hot oil from splashing toward you and the cutlet from sticking to the bottom of the skillet. This should also help “waves” develop in the cutlet&mdash;the sign of true schnitzel success."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry cutlet, adjusting heat as necessary to maintain a steady, vigorous bubble, until bottom side is browned and crisp, about 3 minutes. Flip cutlet and fry until second side is browned and crisp, about 3 minutes longer. Transfer to a wire rack set in a rimmed baking sheet and season lightly with salt. Repeat with remaining cutlets. Serve immediately with <a href=\"https://www.seriouseats.com/recipes/2018/10/coleslaw-creamy-chili-vinaigrette-recipe.html\">coleslaw </a> and a cold beer."}]}