{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20181113-homemade-ramen-dark-broth-miso-tori-paitan-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "chicken soup", "fall", "Japanese", "ramen", "soup", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Miso <em>Tori Paitan</em> Ramen (Creamy Chicken Broth Ramen)", "link": "https://www.seriouseats.com/recipes/2018/12/miso-chicken-paitan-ramen.html", "description": "This bowl of ramen features a creamy and rich chicken <em>paitan</em> broth flavored with a <em>tare</em>, or seasoning, made from a mixture of red miso, soy sauce, sake, dried fish, kelp, and fresh red chilies (optional).", "totalTime": "30 minutes", "recipeYield": "Makes 2 bowls of ramen", "recipeCategory": ["Dairy-Free", "Japanese", "Ramen", "Soups and Stews", "Stovetop"], "recipeIngredient": ["<strong>For the <em>Gyofun</em>:</strong>", "3 dried red chilies, such as <em>árbol</em>, Thai bird, Bangladeshi, or Kashmiri, stemmed (optional)", "5g (about 1 small handful) <em>katsuobushi</em> shavings (Japanese smoked, dried skipjack tuna)", "<strong>For the Miso <em>Tare</em>:</strong>", "1 tablespoon (15ml) <em>shoyu</em> tare (from the <a href=\"https://www.seriouseats.com/recipes/2018/12/chintan-shoyu-ramen-recipe.html\"><em>chintan shoyu</em> ramen recipe</a>)", "2 tablespoons (30ml) red miso paste", "2 fresh red Thai bird chilies, stemmed and thinly sliced crosswise (optional)", "<strong>To Serve:</strong>", "4 cups (about 950ml) <a href=\"https://www.seriouseats.com/recipes/2018/12/chicken-paitan-broth.html\">chicken <em>paitan</em> broth</a>", "4 teaspoons (20ml) aroma oil (from the <a href=\"https://www.seriouseats.com/recipes/2018/12/chintan-shoyu-ramen-recipe.html\">chintan shoyu ramen recipe</a>)", "2 servings ramen noodles, either store-bought or <a href=\"https://www.seriouseats.com/recipes/2018/11/homemade-ramen-noodles.html\">homemade</a>", "<strong>To Garnish:</strong>", "Sliced braised pork belly (from the <a href=\"https://www.seriouseats.com/recipes/2018/12/chintan-shoyu-ramen-recipe.html\">chintan shoyu ramen recipe</a>, warmed through and seared with a torch if desired); <a href=\"https://www.seriouseats.com/recipes/2012/03/ajitsuke-tamago-japanese-marinated-soft-boiled-egg-recipe.html\">marinated egg</a> (shelled and halved); and sheets of toasted nori (all optional)", "2 tablespoons finely diced white onion ", "2 scallions, sliced crosswise as thinly as possible", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the <em>Gyofun</em>:</strong> Place dried chilies (if using) and katsuobushi in a pan and set over medium heat. Toast until fragrant. Using a spice grinder or mortar and pestle, grind toasted chilies and katsuobushi to a fine powder. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Miso <em>Tare</em>:</strong> In a small bowl, stir together shoyu tare with miso paste and sliced fresh chilies (if using) until thoroughly combined. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Assemble the Ramen Bowls:</strong> Bring paitan broth to a boil. Bring a separate large pot of unsalted water to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add one ladleful of boiling water to each serving bowl to warm the bowls. Place noodles in pot of boiling water, stirring vigorously to prevent clumping, and cook as directed on packaging or as directed in recipe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, empty serving bowls of warming water. Place half of miso tare mixture and half of aroma oil in each bowl. Top each with 1 1/2 cups (350ml) boiling paitan broth. Using an immersion blender placed directly in each bowl, pulse the mixture 2 to 3 times, until broth is mixed and somewhat frothy. (Before beginning to assemble the bowls, it's a good idea to fill one with an equivalent volume of water and check that the liquid won't spill over when blended; see note for more info.) Alternatively, you can use a whisk to blend the broth, tare, and aroma oil in each bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain cooked noodles, shaking off as much excess water as possible, and add a portion to each bowl of hot broth. Using chopsticks, lift noodles up out of the bowl and fold them over, back into the broth. Garnish with any desired toppings, such as pork belly, a halved egg, and/or nori sheets. Garnish with diced white onion and sliced scallions. Add 1 teaspoon chili gyofun (or more, if you like) to each bowl. Serve immediately, with lime wedges alongside."}]}