{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/hummusfries.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "Middle Eastern", "keywords": ["chickpea", "chickpea flour", "French", "fry", "gluten free", "hummus", "middle eastern", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "1.5", "ratingCount": "2"}, "name": "Hummus Fries With Spicy Tahini Dip", "link": "https://www.seriouseats.com/recipes/2018/08/hummus-fries-with-spicy-tahini-dip.html", "description": "Inspired by <em>panisses</em>, chickpea-flour fritters from the south of France, these hummus fries use that same chickpea flour as a base, but get an extra hummus-like twist with the addition of tahini, garlic, lemon, and cumin. Once fried, the fries are crispy on the outside and super creamy on the inside. And though the fries are delicious by themselves, the easy, spicy tahini dip should not be skipped.", "totalTime": "3 hours 40 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Christmas", "Dairy-Free", "French", "Gluten-Free", "Legumes", "Middle Eastern", "Sides", "Snacks", "Stovetop", "Vegan", "Vegetarian"], "recipeIngredient": ["Olive oil or vegetable oil, for greasing the baking dish and frying (see note)", "6 medium cloves garlic, divided", "2 cups (475ml) tahini (sesame seed paste), divided", "1 tablespoon ground cumin, plus more to taste", "2 cups chickpea flour (3.15 ounces; 90g); see note", "1 teaspoon (4g) Diamond Crystal kosher salt, plus more as needed; for table salt, use half as much by volume or use the same weight", "1/2 teaspoon freshly ground black pepper", "Juice of 1 lemon", "1/3 cup (80ml) hot sauce of your choice, or to taste", "Paprika, for garnish", "Chopped flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 9- by 13-inch baking dish and set aside. Mince 5 cloves of the garlic and add to a large saucepan. Add 4 cups (950ml) water, 1 cup (235ml) tahini, and the cumin. Whisk to combine. Set over medium-high heat and bring to a gentle boil; lower heat to maintain gentle boil. Whisk in chickpea flour a little at a time until fully combined. Whisk in salt and pepper. Continue to cook, whisking often, until batter is thickened and just beginning to pull away from the edges of the pot. Whisk in lemon juice, adjust seasonings to taste, and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly transfer chickpea mixture to greased baking dish, using a spatula to spread it into an even layer. Cover with plastic wrap and refrigerate until firm, about 3 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine remaining 1 cup tahini, remaining 1 clove garlic, and hot sauce in the bowl of a <a href=\"https://www.seriouseats.com/2017/10/best-food-processor-equipment-review.html\">food processor</a> and process until well combined. Slowly stream in cold water, with food processor running, until mixture is thinned to the desired consistency. Alternatively, mince garlic and whisk with tahini and hot sauce in a large bowl until smooth, thinning with water as necessary. Transfer to a serving bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, heat 2 inches of oil to 350&deg;F (177&deg;C). Run a butter knife or thin spatula around the edges of the baking dish, then flip it over onto a cutting board to release the solidified chickpea base. Cut chickpea base in half lengthwise, then cut the halves crosswise into thin, fry-like slices. Working in batches, fry slices until golden all over, about 4 minutes per side. Transfer to a paper towel&ndash;lined plate to absorb excess oil. Sprinkle with salt while hummus fries are still hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle hummus fries and spicy tahini sauce with paprika and chopped parsley. Serve immediately."}]}