{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180327-fresh-harissa-vicky-wasik9.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["chili", "chili pepper", "condiment", "harissa"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fresh Chili Harissa", "link": "https://www.seriouseats.com/recipes/2018/04/fresh-chili-harissa.html", "description": "Harissa is a punchy North African chili paste. This version is made with an assortment of fresh chilies that are charred and blended together for smoke and spice. It's simply seasoned with the traditional additions of caraway and coriander, but feel free to jazz it up with anything from diced preserved lemon to pungent raw shallots. ", "totalTime": "25 minutes", "recipeYield": "Makes 2 cups", "recipeCategory": ["Condiments and Sauces", "Gluten-Free"], "recipeIngredient": ["2 red bell peppers (540g) (see note)", "1 poblano pepper (100g)", "4 Fresno chili peppers (160g)", "2 serrano chilies (30g)", "1 tablespoon (10g) neutral oil, such as canola, corn, or grape seed", "1 teaspoon (4g) ground coriander", "3/4 teaspoon (3g) ground caraway", "2 teaspoons (12g) Diamond crystal kosher salt; for table salt, use about half as much by volume or the same by weight", "3 tablespoons (45g) freshly squeezed lemon juice, from about 1 lemon", "3 tablespoons (25g) extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Line a rimmed baking sheet with foil and set the bell, poblano, fresno, and serrano peppers on it. Rub the peppers with the oil. Place under the broiler and cook the peppers, rotating as needed, until evenly charred all over, about 10 minutes. Transfer the charred peppers to a large bowl and cover with plastic wrap to steam. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a dry sauté pan, toast the coriander and caraway over medium heat until fragrant. Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the peppers are cool enough to handle, remove their skins, seeds, and stems with gloved hands. Place the cleaned peppers in a food processor and blend until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pepper paste to a bowl. Finish the harissa by mixing in the toasted coriander and caraway, salt, lemon, and olive oil. The harissa is best the next day and keeps in the refrigerator for a week."}]}