{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/07/20180710-steak-peach-dandelion-greens-vicky-wasik-12-.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["calabrian chili", "chili", "dandelion green", "easy", "flank steak", "pan-sear", "quick", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pan-Seared Flank Steak With Peaches and Dandelion Greens", "link": "https://www.seriouseats.com/recipes/2018/07/pan-seared-flank-steak-with-peaches-and-dandelion-greens.html", "description": "Don't let those tasty brown bits that develop after cooking steak go to waste! In this dish, all the <em>fond</em> that forms after pan-searing a flavorful flank steak is scraped up and used to coat dandelion greens and peaches. The sweetness from juicy peach wedges, along with fiery Calabrian chili and fresh lemon juice, balances the dandelion's bitter bite. Best of all, this easy one-pan dinner for two takes only 15 minutes and yields tons of flavor. ", "totalTime": "15 minutes", "recipeYield": "Serves 2", "recipeCategory": ["Gluten-Free", "Lemon", "Mains", "Other Vegetables", "Peach", "Quick and Easy", "Quick Dinners", "Steak", "Stovetop", "Summer", "Valentine's Day"], "recipeIngredient": ["One 1- to 1 1/2–pound (450 to 680g) flank steak", "Kosher salt and freshly ground black pepper, to taste", "2 tablespoons vegetable oil or other neutral oil (1 ounce; 30g)", "2 to 3 sprigs fresh thyme", "3 garlic cloves", "2 tablespoons butter (1 ounce; 30g)", "1 large peach (about 7 ounces; 200g), cut into 8 wedges", "1 tablespoon chopped <a href=\"https://www.amazon.com/dp/B004ROGVCG/?tag=serieats-20\">Calabrian chili</a> (1/2 ounce; 15g)", "2 tablespoons lemon juice (1 ounce; 30g), from 1/2 lemon", "1 bunch dandelion greens (about 6 ounces; 170g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a 12-inch heavy-gauge skillet or cast iron pan over high heat. Season flank steak generously with kosher salt and freshly ground pepper. Heat oil in pan until smoking-hot before carefully placing steak in hot pan, laying it down away from you. Cook steak, pressing the thicker part down with an <a href=\"https://www.seriouseats.com/2017/04/best-fish-spatula-slotted-offset-spatula.html\">offset spatula</a>, small pan, or <a href=\"https://www.seriouseats.com/2019/04/why-you-need-a-chefs-press.html\">cooking weight</a> and flipping every 30 seconds, until it develops a deeply browned crust and internal temperature is about 15&deg;F away from your desired final temperature, about 8 minutes. (We suggest cooking flank steak to medium doneness, or about 140&deg;F/60&deg;C.) Add thyme, garlic, and butter to pan and lower heat to medium. Using a large spoon, baste steak with butter until it is 5&deg;F away from your desired final temperature, about 4 minutes. Remove steak to a sheet tray fitted with a wire rack, pouring butter and aromatics over steak. Set aside to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return same pan to high heat and place peaches in pan, pressing cut sides of peaches onto the brown bits developed from cooking the steak. Sear peaches until golden brown, about 1 minute. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/2 cup (120ml) water to pan and use it to scrape up all the browned bits from the pan to form a pan sauce. Add Calabrian chili, lemon juice, and 2 tablespoons of the steak drippings to the pan, simmering and swirling to emulsify the sauce. Add dandelion greens and cook until gently wilted, about 1 minute. Slice steak and serve right away with greens, peaches, and sauce. "}]}