{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180807-ice-milk-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["dairy", "dessert", "eggless", "frozen", "ice cream", "ice milk", "milk", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Vanilla Ice Milk", "link": "https://www.seriouseats.com/recipes/2018/08/vanilla-ice-milk-recipe.html", "description": "Like sorbet, ice milk is light and refreshing on a hot summer's day, but with the creamy, soft consistency you'll find in the best ice cream.", "totalTime": "5 hours", "recipeYield": "Makes about 5 cups", "recipeCategory": ["Ice Cream and Frozen Treats", "Stovetop", "Summer", "Valentine's Day"], "recipeIngredient": ["9 1/4 ounces plain or very lightly <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted</a> sugar (about 1 1/3 cups; 262g)", "1 1/4 ounces cornstarch (about 1/4 cup; 35g)", "1 3/4 ounces powdered milk (about 1/4 cup; 50g)", "1 teaspoon (4g) Diamond Crystal kosher salt (plus more if desired); for table salt, use about half as much by volume or the same weight", "28 ounces whole milk (about 3 1/2 cups; 795g), divided ", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk sugar, cornstarch, powdered milk, and salt together in a 3-quart saucier. When no lumps of cornstarch remain, add exactly 14 ounces of the milk (about 1 2/3 cups; 396g) and whisk to combine. Cook over medium heat, whisking constantly but not vigorously, until it begins to simmer. This will take about 6 minutes; if the process seems to be moving slowly, simply turn up the heat. When the mixture comes to a boil, set a timer and continue cooking and whisking for exactly 1 minute. This ensures the cornstarch is fully hydrated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately transfer mixture to a large bowl, then whisk in remaining milk, along with the vanilla. Bearing in mind that the ice milk will taste substantially less sweet once frozen, season with an additional pinch of salt, if desired. Cover and refrigerate the base until cold, thick, and no warmer than 40°F (4&deg;C), about 3 hours. (This process can be sped along with an ice bath if time is of the essence; in that case, a <dorado id=\"stainless-steel-mixing-bowls\" class=\"text\">stainless steel bowl</dorado> will help cool the base even faster.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Churn in an ice cream maker according to the manufacturer’s directions. Meanwhile, place a quart-sized container and flexible spatula in the freezer. When the ice milk looks fluffy and thick, shut off the machine and, using the chilled spatula, scrape it into the chilled container. Enjoy as soft-serve, or cover with plastic pressed directly against the surface of the ice milk, then close lid and freeze until firm enough to scoop, about 4 hours. (The time will vary depending on the material and dimensions of the container.)"}]}