{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/04/20180327-pacific-razor-clams-chowder-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Becky Selengut"}, "recipeCuisine": "", "keywords": ["chowder", "clam", "clam chowder", "fish", "pacific razor clam", "quick", "razor clam", "shellfish", "soup", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pacific Razor Clam Chowder", "link": "https://www.seriouseats.com/recipes/2018/04/pacific-razor-clam-chowder.html", "description": "Pacific razor clams and buttery leeks sub in for the more commonly used Manila clams and onions in this classic chowder with a twist. Fresh thyme, dry vermouth, and a restrained hand with cream keep the chowder light and fresh, with just enough richness for a luxurious texture.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Clams, Mussels, and Oysters", "Fall", "Fish", "Soups and Stews", "Stovetop", "Winter"], "recipeIngredient": ["2 tablespoons (30g) unsalted butter", "4 slices bacon (about 4 ounces), cut into small dice", "1 large leek (about 3/4 pound), dark-green parts cut off and saved for stock, leek halved lengthwise, cleaned, and <a href=\"https://www.seriouseats.com/2011/01/knife-skills-how-to-prepare-leeks.html\">cut into small dice</a>", "2 celery ribs (4 ounces), cut into small dice, with 1/4 cup (7g) picked tender leaves reserved for garnish", "2 bay leaves", "1 tablespoon fresh thyme leaves, roughly chopped", "1/8 teaspoon cayenne pepper", "1 pound (450g) Yukon Gold potatoes, unpeeled, cut into medium dice", "1/4 cup (60ml) dry white vermouth", "One (8-ounce) bottle clam juice (see note)", "1 1/2 cups (360ml) heavy cream", "3/4 pound (340g) <a href=\"https://www.seriouseats.com/2018/04/razor-clam-guide.html\">cleaned</a> <a href=\"https://www.freshseafood.com/washington-razor-clams.html\">razor clam meat</a>, cut into small dice", "2 teaspoons (10ml) fish sauce (such as <a href=\"https://www.amazon.com/Red-Boat-Sauce-ounce-Bottle/dp/B00XISQQJK/?tag=serieats-20\">Red Boat brand</a>), optional", "Kosher salt", "Tabasco sauce or other hot sauce of your choice, for serving", "Buttery crackers (such as Ritz), broken up, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven, combine butter and bacon and cook over medium heat, stirring occasionally, until the bacon begins to brown and crisp, 7 to 10 minutes. Using a slotted spoon, transfer half the bacon to a paper towel&ndash;lined plate; reserve for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the leek to the remaining bacon in the Dutch oven and cook, stirring, until tender, about 3 minutes. Add the diced celery, bay leaves, thyme, and cayenne and cook for 1 minute. Add the potatoes and increase the heat to medium-high. Cook the potatoes for 3 minutes, stirring occasionally. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vermouth and bring to a boil, scraping up any brown bits from the bottom of the pot. Add the clam juice and just enough water to cover the potatoes (about 8 ounces/240ml). Bring to a boil, reduce to a simmer, then cook until the potatoes are tender. Add the cream, return to a simmer, then simmer for 10 minutes. Bring the chowder to a boil, turn off the heat, add the razor clam meat, cover the pot, and let stand for 1 minute; this will be enough to gently poach the clam meat without letting it become rubbery. Add fish sauce, if using. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle soup into bowls and top with reserved bacon and celery leaves. Serve, allowing diners to add hot sauce and crumbled crackers to their bowls as desired."}]}