{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/04/20180420-risotto-al-salto-pancake-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["easy", "Italian", "pancake", "rice", "risotto", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Risotto al Salto (Crispy Rice Pancake)", "link": "https://www.seriouseats.com/recipes/2018/05/risotto-al-salto-crispy-rice-pancake.html", "description": "Leftover risotto? Take a page from the Milanese kitchen by frying it in ample butter to form a beautiful golden pancake with a crispy, crunchy crust. The dish, known as risotto <em>al salto</em> is usually made from the saffron-scented risotto alla milanese, or sometimes from a basic risotto al parmigiano (risotto flavored simply with butter and Parmigiano-Reggiano).", "totalTime": "10 minutes", "recipeYield": "Serves 2 to 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Father's Day", "Fried Rice", "Italian", "Mains", "Mother's Day", "Quick and Easy", "Snacks", "Stovetop", "Valentine's Day"], "recipeIngredient": ["2 1/2 tablespoons (35g) unsalted butter", "2 cups leftover risotto (475g), such as <a href=\"https://www.seriouseats.com/recipes/2016/03/risotto-alla-milanese-saffron-recipe.html\">risotto alla milanese</a>, fully cooled", "Freshly grated Parmigiano-Reggiano or Grana Padano, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease two flat 10- or 11-inch plates (you can use any oil for this, or even some extra butter). In a well-seasoned 10-inch carbon steel skillet or a 10-inch nonstick skillet, melt butter over high heat until foaming. Add rice and, using a spatula, pat it down to form a round pancake shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue cooking over high heat, patting the top and sides to form a compact, pancake-like round, and swirling to keep the pancake moving and to avoid hot-spots (it should not stick), until very well browned on on the first side (you can tell it's ready when you see that it has browned around the edges). If the pancake comes apart as you swirl and jiggle it, simply use the spatula to press it back together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully slide the pancake out onto one of the prepared plates, then invert the other prepared plate on top of it. In one very quick motion, flip the plates, then lift off the top plate. Very carefully slide the pancake back into the skillet; using the spatula to patch up any spots that were damaged during the flip. Continue cooking, swirling, jiggling, and patting with the spatula, until well browned on the second side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully slide the pancake out onto a warmed serving plate and grate the cheese all over. Serve right away."}]}