{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/bluecheesefigs.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["appetizer", "cheese", "easy", "fig", "game day", "hors d'oeuvres", "party", "pork", "snack"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Bacon-Wrapped Figs With Blue Cheese and Bourbon", "link": "https://www.seriouseats.com/recipes/2018/03/bacon-wrapped-figs-with-blue-cheese-and-bourbon.html", "description": "These quick and easy-to-make hors d'oeuvres are the ultimate mash-up of sweet and salty, creamy and crisp. The combination of juicy fresh figs, rich blue cheese, crisp bacon, and a sweet bourbon caramel glaze gives you a little bit of everything in each bite. ", "totalTime": "25 minutes", "recipeYield": "Makes 16 stuffed fig halves", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Bacon", "Cheese", "Christmas", "Pork", "Quick and Easy", "Snacks", "Valentine's Day"], "recipeIngredient": ["8 slices thick-cut bacon, cut in half", "8 firm, ripe fresh figs, halved lengthwise", "6 ounces (170g) creamy blue cheese, crumbled (see note)", "1/2 cup (120ml) bourbon", "3/4 cup (6 ounces/170g) unsalted butter", "3/4 lightly packed cup light brown sugar (6 ounces/170g)", "Flaky salt, such as Maldon, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler and set oven rack in top position. Line a rimmed baking sheet with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, cook bacon until most of the fat has rendered but the bacon is still pliable. Transfer the bacon to a paper towel&ndash;lined plate to absorb excess grease. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a melon baller or small spoon, scoop out the center of each halved fig. Fill each hollowed fig half with blue cheese. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap a half-strip of bacon around each filled fig half and secure with toothpicks. Place, cut side up, on the prepared baking sheet. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, cook bourbon over medium heat until reduced by half. Whisk in the butter and brown sugar until butter is melted and brown sugar is dissolved. Continue to cook, whisking occasionally, until sauce is thick enough to coat the back of a spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pastry brush, brush bourbon glaze all over the top side of each bacon-wrapped fig. Broil until the bacon has browned, about 4 minutes. Sprinkle lightly with coarse sea salt, if desired, and serve warm."}]}