{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180309-Vegan-Greenbean-Casserole-Kristin-Donnelly-1.jpg", "author": {"@type": "Person", "name": "Kristin Donnelly"}, "recipeCuisine": "", "keywords": ["artichoke", "cauliflower", "spinach", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vegan Spinach and Artichoke Dip", "link": "https://www.seriouseats.com/recipes/2018/03/vegan-spinach-and-artichoke-dip.html", "description": "This vegan version of a classic spinach and artichoke dip harnesses the power of cauliflower and cashews to create a rich, thick, and creamy base for the vegetables. Nutritional yeast, mustard, lemon juice, and garlic in two forms come together to pull off the tangy, savory flavors of sour cream and cheese.", "totalTime": "1 hour", "recipeYield": "Makes 4 cups", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Baking", "Cauliflower", "Christmas", "Dairy-Free", "Game Day", "Other Vegetables", "Spinach", "Vegan", "Vegetarian"], "recipeIngredient": ["1 cup (235ml) <a href=\"https://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">homemade vegetable stock</a> or low-sodium vegetable broth", "1 pound (450g) cauliflower, cored and cut into medium florets (12 ounces/340g after prep)", "2 ounces raw cashews (55g; 1/2 cup)", "1/4 cup (60ml) <a href=\"https://www.seriouseats.com/recipes/2016/03/easy-vegan-mayo-aquafaba-recipe-vegan-experience.html\">homemade</a> or store-bought vegan mayonnaise", "2 tablespoons nutritional yeast", "1 tablespoon (15ml) Dijon mustard", "1 tablespoon (15ml) fresh lemon juice", "2 teaspoons garlic powder", "Kosher salt", "2 large cloves garlic, minced", "2 tablespoons (30ml) extra-virgin olive oil", "1 (10-ounce/285g) box frozen spinach, thawed and squeezed of excess liquid, or 12 ounces fresh spinach, trimmed or 10 ounces (340g) fresh baby spinach", "1 (14-ounce/395g) can artichokes, artichokes drained and halved", "Freshly ground black pepper", "Tortilla chips or pita chips, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350&deg;F (177&deg;C). In a large deep skillet, bring vegetable stock to a simmer over medium heat. Add cashews and cauliflower and stir to coat, then reduce the heat to medium low. Cover and cook until the cauliflower is very tender when pierced with a knife, about 10 minutes. (If the broth seems to be steaming from the lid, reduce the heat to low. You want to cook the cauliflower while retaining as much of the liquid as possible.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cauliflower, cashews, and liquid to a food processor and let cool for 1 minute. Purée until very smooth. (You need to keep the machine running for a minute or more, scraping down the sides periodically, to get a super smooth purée.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add mayonnaise, nutritional yeast, mustard, lemon juice, garlic powder, and process until incorporated. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the skillet. Add olive oil and heat over medium heat until warmed. Add minced garlic and cook, stirring, until fragrant and softened, 1 to 2 minutes. Add spinach, a large pinch of salt, and cook, stirring, until wilted, if fresh, or heated through, if frozen. Transfer spinach to a fine-mesh strainer and press or squeeze to drain any excess liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cooked spinach and artichokes to the food processor and pulse a few times, just until incorporated. Taste and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the dip into a 1-quart baking dish and bake for about 30 minutes, until just starting to brown around the edges. To brown the top, turn on the broiler and arrange the pan within 4 inches of the heat. Broil until the dip is browned to your liking, 2 to 3 minutes. (If you’re in a rush, you can skip the baking step and just serve the dip while it’s warm or room temperature, right from the food processor. Alternatively, you can make the dip a day ahead and bake it the following day. Just add 10 minutes to the cooking time.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot with chips. "}]}