{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/10/20180925-pumpkin-skillet-cake-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["butternut", "cast iron", "coffee cake", "malted milk powder", "streusel", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "Pumpkin Skillet Coffee Cake With Streusel Topping", "link": "https://www.seriouseats.com/recipes/2018/10/pumpkin-skillet-coffeecake-with-streusel-topping.html", "description": "Imagine a <a href=\"https://www.seriouseats.com/2016/10/how-to-make-pumpkin-spice-muffins.html\">pumpkin streusel muffin</a> crossed with a blondie, and you'll have a good idea what this curiously rich coffee cake is all about&mdash;hearty and satisfying, aromatic, and chewy, with a hint of fudgyness thanks to the effects of melted white chocolate in the dough. Malted milk powder bumps up the earthiness of pumpkin, and helps with browning too.", "totalTime": "3 1/2 hours", "recipeYield": "Makes about fourteen 2-inch wedges", "recipeCategory": ["Baking", "Breakfast and Brunch", "Breakfast Sweets", "Brownies and Bars", "Christmas", "Easter", "Fall", "Pumpkin", "Quick Bread", "Thanksgiving", "Valentine's Day", "Winter"], "recipeIngredient": ["<strong>For the Streusel Topping:</strong>", "1 1/2 ounces old fashioned rolled oats, not quick cooking or instant (about 1/3 cup; 45g)", "1/2 ounce all-purpose or whole wheat flour (about 1 shy tablespoon; 14g)", "1/2 ounce light brown sugar (about 1 tablespoon; 14g)", "1 1/2 teaspoons ground cinnamon", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon ground ginger", "1/4 teaspoon grated nutmeg", "1/8 teaspoon ground cloves", "1 ounce unsalted butter, softened to about 70°F/21°C (2 tablespoons; 30g)", "2 ounces white chocolate, such as <a href=\"https://www.amazon.com/Green-Blacks-Organic-Chocolate-Vanilla/dp/B000LKTPV4/?tag=serieats-20\">Green & Blacks</a> (about 1/3 cup; 55g), chopped into 1/4-inch pieces", "4 ounces raw pecan pieces (about 2/3 cup; 110g)", "<strong>For the Pumpkin Skillet Batter:</strong>", "9 ounces all-purpose flour, such as Gold Medal (about 2 cups, spooned; 255g)", "4 ounces white chocolate, such as <a href=\"https://www.amazon.com/Green-Blacks-Organic-Chocolate-Vanilla/dp/B000LKTPV4/?tag=serieats-20\">Green & Blacks</a> (about 2/3 cup finely chopped; 110g)", "1 1/2 ounces malted milk powder, such as Carnation or <a href=\"https://www.amazon.com/Old-fashioned-Malted-Hoosier-Hill-Farm/dp/B00BW0FRWI/?tag=serieats-20\">Hoosier Hill Farms</a>, (about 3 tablespoons; 45g)", "10 ounces light brown sugar (about 1 1/4 cups, gently packed; 280g)", "5 ounces unsalted butter, pliable but cool, about 60°F (about 10 tablespoons; 140g)", "1 1/2 teaspoons (6g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1 teaspoon baking powder", "1/8 teaspoon grated nutmeg", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "1 large egg, straight from the fridge (about 1 3/4 ounces; 50g)", "4 ounces pumpkin or butternut squash puree, canned or homemade (about 1/2 cup; 110g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Streusel Topping:</strong> In a medium bowl (or the bowl of a stand mixer), combine the rolled oats, flour, brown sugar, cinnamon, salt, ginger, nutmeg, cloves, and softened butter. Combine by hand (or with a paddle attachment) to smash the butter into the dry ingredients, until everything is coated and clumpy. Add the white chocolate and pecans and continue smashing (or mixing) to form a clumpy mix. Cover and refrigerate until needed, or transfer to a zip-top bag and freeze for up to 3 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Pumpkin Skillet Batter:</strong> In the bowl of a food processor, grind the flour, white chocolate, and malted milk powder to form a fine, dry mix with no visible lumps of white chocolate. Alternatively, grate the white chocolate with a Microplane, then whisk with flour and malted milk powder to combine. Set aside until needed, or transfer to an airtight container and store at cool room temperature until the date stamped on the bag of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to middle position and preheat to 350&deg;F. In the bowl of a stand mixer fitted with a paddle attachment, combine the brown sugar, butter, salt, baking powder, nutmeg, and vanilla. Mix on low to moisten, then increase speed to medium and beat until very soft, pale, and fluffy, about 8 minutes. Along the way, pause to scrape the bowl and beater with a flexible spatula as needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While mixing on medium speed, add the egg and continue beating until smooth. Reduce speed to low, and add the pumpkin purée. Once smooth, add the malted white chocolate-flour all at once, and continue mixing to form a thick batter. Scrape the bowl and beater with a flexible spatula, then fold once or twice to ensure it's well mixed from the bottom up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the batter into a lightly greased cast iron skillet (the leftover butter wrappers should do the trick), and spread into an even layer. Scatter the prepared streusel topping over the top in an even layer, and bake until the \"cake\" is puffed, golden brown, and approximately 205&deg;F in the center, about 35 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool to room temperature before serving, as the \"cake\" will seem gooey and wet while warm due to the molten cocoa butter in the white chocolate. When cool, cut into wedges with a sharp knife, and serve alongside a strong cup of coffee or tea for brunch or dessert. Individually wrapped in plastic, the portions will keep at room temperature for several days. "}]}