{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/06/20180625-no-churn-vanilla-ice-cream-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["dessert", "easy", "frozen", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.75", "ratingCount": "4"}, "name": "No-Churn Vanilla Ice Cream", "link": "https://www.seriouseats.com/recipes/2018/07/no-churn-vanilla-ice-cream.html", "description": "With just five ingredients, including vanilla and salt, this no-churn ice cream tastes pure and simple, with a fresh dairy flavor unlike recipes based on canned milk. Its lightness and custard flavor come from whipped eggs, which are briefly cooked over a water bath so they're safe to eat and easy to whip. The result is just like the ice cream you might pick up at the supermarket, ready to scoop straight from the freezer, with a classic vanilla profile everyone will love.", "totalTime": "8 hours", "recipeYield": "Makes about 1 quart", "recipeCategory": ["Easter", "Ice Cream and Frozen Treats", "Puddings and Custards", "Valentine's Day"], "recipeIngredient": ["6 ounces heavy cream (about 3/4 cup; 170g)", "3 large eggs (about 5 1/2 ounces; 155g)", "3 1/2 ounces sugar (about 1/2 cup; 100g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "3/4 teaspoon <a href=\"https://www.seriouseats.com/2017/12/how-to-choose-the-best-vanilla-extract.html\">vanilla extract</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with a whisk attachment, whip the cream until thick enough to hold stiff peaks; the time will vary depending on the power of a given mixer, so keep a close eye on the process. Transfer to a large, non-reactive container (this will be used to hold the ice cream later on), then cover and refrigerate until needed. Rinse the bowl and whisk, then wipe dry before re-using in step 2."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot or Dutch oven with a few inches of water; bring to a boil, then lower heat to maintain a simmer, and a steady supply of steam. Place eggs, sugar, and salt in the bowl of a stand mixer, and stir with a flexible spatula to combine. Set bowl over the steaming pot, using a crumpled strip of foil formed into a ring to act as a booster seat so that the bowl does not touch the bottom of the pot. Cook, stirring and scraping constantly, until warmed to 160&deg;F (71&deg;C), about 5 minutes. This should not take significantly longer; major delays simply indicate insufficient heat/lack of steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a stand mixer fitted with a whisk attachment, and add the vanilla extract. Whip on high speed until the mixture is foamy, more than quadrupled in size, and thick enough to briefly mound up like soft-serve ice cream when dropped from the whisk, between 5 to 8 minutes depending on the horsepower of the mixer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in the prepared whipped cream, working gently to incorporate it as thoroughly as possible without deflating or overmixing the base. Scrape into the now-chilled container, cover, and freeze until firm enough to scoop&mdash;approximately 0&deg;F. The time required will vary depending on the size and material of the container, but expect 6 to 8 hours. Once cold, scoop like ice cream and serve in chilled dishes."}]}