{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/10/20180925-pumpkin-bread-vicky-wasik-23-1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "American", "keywords": ["bread", "instant yeast", "loaf", "sandwich", "sandwich bread", "winter squash", "yeast"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.9090909090909", "ratingCount": "22"}, "name": "Yeasted Pumpkin Bread", "link": "https://www.seriouseats.com/recipes/2018/10/yeasted-pumpkin-bread.html", "description": "Beneath its colorful facade, this soft and chewy bread is nothing more than a white sandwich loaf with pumpkin purée taking the place of water in the dough. It lend a subtle earthiness to the bread, one that's mellow enough to keep the overall profile classic and mild. It's a versatile loaf that will add seasonal flair to any meal, whether you toast it up in the mornings to serve with butter and jam, slice it thin for grilled cheese, turn thick slabs into French toast, cube it into bread pudding, or tear it up for your favorite holiday stuffing.", "totalTime": "About 6 hours", "recipeYield": "One 8-inch loaf", "recipeCategory": ["American", "Baking", "Breakfast and Brunch", "Breakfast Sweets", "Christmas", "Dairy-Free", "Easter", "Pumpkin", "Thanksgiving", "Vegan", "Winter", "Yeast Bread"], "recipeIngredient": ["16 ounces bread flour (about 3 1/2 cups, spooned; 455g)", "2 1/4 teaspoons (9g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 ounce instant dry yeast, such as <dorado id=\"instant-yeast\" class=\"text\">SAF</dorado> (about 2 teaspoons; 7g yeast); not RapidRise or active dry (more info <a href=\"https://www.seriouseats.com/2018/03/all-about-dry-yeast-instant-active-dry-fast-acting-and-more.html\">here</a>)", "12 ounces pumpkin purée, canned or homemade (about 1 1/2 cups; 340g)", "2 ounces pure maple syrup (a shy 1/4 cup; 55g)", "2 ounces unsalted butter, melted (about 4 tablespoons; 55g), or 1 1/2 ounces neutral oil or roasted pumpkin seed oil (about 3 tablespoons; 42g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Making the Dough:</strong> In the bowl of a food processor, pulse the bread flour, salt, and instant yeast together to combine. Add pumpkin purée, maple syrup, and melted butter (or oil), and process until the dough comes together in a smooth, pliable ball; the timing can vary depending on the size and power of a given food processor, but expect about 75 seconds from start to finish. To test the dough, tear off a small piece and stretch gently in all directions; when the dough is ready, it can be pulled into a thin, translucent sheet. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Proofing the Dough:</strong> Lightly grease a medium bowl, then add the dough. Cover and proof at room temperature until doubled in bulk. This will take about 2 hours at around 72&deg;F; the process will move faster at warmer temperatures, and slower when it is cool. To test the dough, poke it gently with a flour-dusted fingertip; when the dough is ready, it will retain a shallow impression that springs back after a few minutes. If the dough is firm and springs back right away, continue proofing until the dough retains a shallow impression."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Shaping the Dough:</strong> Turn the dough onto a work surface with just the barest sprinkling of flour, and knead for a few seconds to deflate; this creates a more uniform crumb in the loaf by eliminating large pockets of air. Pat the dough into a 7-inch square, and form into a tight log, sealing the dough together with your heel. Nestle into a lightly greased loaf pan, seam side down, then cover and proof as before (for dinner rolls, see note on shaping below). The dough will be ready when it's puffy and light, and risen about 2 inches above the rim of the pan. This will take about 2 hours at around 72&deg;F; the process will move faster at warmer temperatures, and slower when it is cool; the dough's readiness can be tested as before. Near the end of this period, adjust oven rack to lower middle position and preheat to 350&deg;F.\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough is ready, uncover and bake until well-risen, golden brown, and hollow sounding when thumped; about 45 minutes, or to an internal temperature of approximately 205&deg;F. Immediately turn the loaf out onto a wire rack, and cool completely before slicing. The loaf will keep up to a week at room temperature in a bread box or paper bag."}]}