{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/12/20181204-blini-vicky-wasik-68.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": ["blini", "caviar", "new years", "New Years Eve", "pancake", "russian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Yeasted Blini", "link": "https://www.seriouseats.com/recipes/2018/12/yeasted-blini.html", "description": "These traditional Russian blini, perfect for serving with crème fraîche and caviar, use a yeasted batter that's further lightened with beaten egg whites.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes about 50 small blini", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "New Year", "Pancake", "Recipes", "Stovetop", "Winter"], "recipeIngredient": ["2 cups (475ml) whole milk", "1 packet active dry yeast (1/4 ounce; 7g)", "2 teaspoons (8g) sugar, divided", "1 1/2 cups all-purpose flour (7 1/2 ounces; 215g), divided", "1/2 teaspoon (2g) kosher salt", "2 tablespoons (28g) unsalted butter, melted", "1 tablespoon (15ml) vegetable oil, plus more for cooking", "2 large eggs (110g), separated", "Sour cream or crème fraîche, for serving", "Chilled caviar or smoked salmon, for serving", "Finely minced shallots, sliced chives, and/or chopped hard-boiled eggs, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, bring milk to a simmer over medium-high heat. Transfer milk to a large heatproof bowl and let cool until it registers between 105&deg;F (41&deg;C) and 115&deg;F (46&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add yeast and 1 teaspoon (4g) sugar to bowl of warm milk and let sit for 5 minutes. The mixture should froth and foam. (If it doesn't, this likely means your yeast has expired; buy a new packet before making this recipe.) Add half of flour (3/4 cup; 4 ounces; 113g) and whisk mixture until smooth. Cover bowl with plastic wrap and set aside in a warm spot until mixture has approximately doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 3/4 cup flour (4 ounces; 113g) and 1 teaspoon (4g) sugar, as well as salt, melted butter, vegetable oil, and egg yolks. Whisk until ingredients are well incorporated but batter is still slightly lumpy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl using a whisk, or using an electric mixer, whisk egg whites until they hold soft peaks. Using a rubber spatula, carefully fold egg whites into batter until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to middle position and preheat oven to 150&deg;F (66&deg;C) or its lowest possible setting. Heat a large nonstick skillet over medium heat for 5 minutes (or use an electric griddle set to 350&deg;F/177&deg;C). Add a small amount of vegetable oil to the skillet and spread with a paper towel until no visible oil remains. Using a spoon, place silver dollar pancake&ndash;sized circles of batter (about 2 1/2 inches in diameter) in the skillet. Cook until the bubbles that appear on the surface of the blini stop being reabsorbed into the batter and remain distinct, and bottom sides of blini are light golden brown, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully flip blini and cook on second side until light golden brown and completely set, about 2 minutes longer. Wrap finished blini in a clean kitchen towel, place towel on a wire rack set in a rimmed baking sheet, and transfer to oven to keep warm. Repeat blini-cooking process until all of the batter is used up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve blini with sour cream or crème fraîche, chilled caviar or smoked salmon, and traditional accompaniments, such as finely minced shallots, sliced chives, and chopped hard-boiled eggs."}]}