{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20180924-american-buttercream-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "American", "keywords": ["butter", "buttercream", "cake", "eggless", "frosting", "icing", "powdered sugar", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "American Buttercream", "link": "https://www.seriouseats.com/recipes/2018/11/american-buttercream-recipe.html", "description": "This quick and easy frosting comes together in less than ten minutes, with just five ingredients&mdash;including salt and vanilla! With a recipe that simple, details matter, so use the best ingredients and be patient when whipping the frosting to ensure that it's as light and fluffy as can be.", "totalTime": "About 8 minutes ", "recipeYield": "Makes about 4 1/2 cups", "recipeCategory": ["American", "Desserts", "Gluten-Free", "No-Cook", "Quick and Easy"], "recipeIngredient": ["12 ounces unsalted butter, softened to about 65°F/18°C  (3 sticks;  340g)", "12 ounces organic powdered sugar, preferably tapioca based, such as <a href=\"https://www.amazon.com/Wholesome-Sweeteners-Organic-Powdered-Confectioners/dp/B01LAX4V32/?tag=serieats-20\">Wholesome</a>; see note (about 3 cups, spooned; 340g)", "2 teaspoons vanilla extract", "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "3 ounces (85g) heavy cream, straight from the fridge", "Other extracts or gel-paste food coloring, such as <a href=\"https://www.amazon.com/dp/B00KCUXRLC/?tag=serieats-20\">Americolor</a>, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the butter in the bowl of a stand mixer, then sift the powdered sugar on top. Fit the machine with a paddle attachment, and mix on low until the powdered sugar is fully incorporated. Add vanilla and salt, then increase speed to medium and beat until the frosting is airy and light, pausing along the way to scrape the bowl and beater as needed. This will take about 6 minutes, although the exact timing will vary depending on the power of the machine. During this time, the mixture will have warmed to approximately 70&deg;F (21&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce speed to low, then drizzle in the cream. When fully incorporated, pause to scrape the bowl and beater, then continue beating a few seconds more on medium speed. Taste and adjust salt and vanilla as needed, or add whatever other extracts or gel colors are desired. Use immediately."}]}