{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180810-chipwich-ice-cream-sandwiches-vicky-wasik-22.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "American", "keywords": ["Chipwich", "chocolate", "chocolate chip", "cookie", "copycat", "eggless", "ice cream", "ice cream sandwich", "no-churn"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Homemade Chipwiches", "link": "https://www.seriouseats.com/recipes/2018/09/homemade-chipwiches.html", "description": "At room temperature, these cookies may seem weirdly soft and cakey, but once frozen they transform into the crunchy but tender basis for a classic twist on the ice cream sandwich. Whether filled with creamy fior di latte gelato, your favorite store bought ice cream, or perfectly cut wheels of no-churn ice cream, it's a frozen treat that can be customized to your heart's desire.", "totalTime": "about 1 hour", "recipeYield": "About 10 ice cream sandwiches", "recipeCategory": ["American", "Baking", "Chocolate", "Cookies", "Ice Cream and Frozen Treats"], "recipeIngredient": ["<strong>For the Cookies</strong>", "4 ounces unsalted butter, softened to about 65°F/18°C  (about 8 tablespoons; 115g)", "4 1/2 ounces light brown sugar (about 1/2 cup, firmly packed; 125g)", "1/2 ounce malted milk powder, such as Carnation or <a href=\"https://www.amazon.com/Old-fashioned-Malted-Hoosier-Hill-Farm/dp/B00BW0FRWI/?tag=serieats-20\">Hoosier Hill Farms</a> (about 2 tablespoons; 14g)", "1 teaspoon (4g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "3/4 teaspoon baking soda", "Pinch nutmeg", "6 1/2 ounces all-purpose flour, such as Gold  Medal (about 1 1/2 cups minus 1 tablespoon; 185g)", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "4 ounces milk, any percentage will do (about 1/2 cup; 115g)", "2 ounces bittersweet mini chocolate chips, (about 1/4 cup; 55g), plus more for garnishing", "<strong>For the Filling:</strong>", "1 recipe <a href=\"https://www.seriouseats.com/recipes/2018/09/homemade-klondike-ice-cream-bars-recipe.html\">Homemade Klondike Bar Filling</a>, prepared and frozen as directed", "Or 1 recipe <a href=\"https://www.seriouseats.com/recipes/2018/08/fior-di-latte-gelato.html\">Fior di Latte Gelato</a> (eggless)", "Or about 1 quart of commercial vanilla ice cream", "Additional mini chips, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Make the Dough:</strong> Adjust oven rack to middle position and preheat to 350&deg;F (180&deg;C). Combine butter, brown sugar, malted milk powder, salt, baking soda, and nutmeg in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then increase to medium and beat until light and fluffy, about 5 minutes. Pause to scrape the bowl and beater with a flexible spatula, then resume beating on medium low. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour all at once, followed by the vanilla, then drizzle in the milk to form a soft dough. Scrape the bowl with a flexible spatula, and continue mixing for a few seconds more. Off the mixer, fold the dough a few times from the bottom up to ensure there are no streaks of unmixed dough, then stir in the mini chips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Portion the Dough:</strong> With a cookie scoop, divide dough into 2-tablespoon portions, and arrange on a parchment-lined half sheet pan, leaving at least 2 inches between each cookie to account for spread. With moistened fingers, gently press each portion into a flat disc, about 1/2 inch thick, and sprinkle a few extra mini chips on top. Bake until the cookies are puffed and lightly golden all over, but still a little soft, about 18 minutes. Cool to room temperature, then transfer to an airtight container and freeze until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Form the Sandwiches:</strong> Pour reserved mini chips into a small dish. If using the Klondike-style, no-churn filling, cut into rounds with a cookie cutter approximately 1/4 inch smaller than the chocolate chip cookies. If using fior di latte gelato, scoop into approximately 1/4-cup portions. Sandwich the portioned ice cream between two frozen cookies, then roll the exposed edges in mini chips to coat. Freeze in an airtight container at least 1 hour. Serve, or wrap each in plastic and return to the airtight container to freeze up to 1 month. "}]}