{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180309-Vegan-Alfredo-Kristin-Donnelly-2.jpg", "author": {"@type": "Person", "name": "Kristin Donnelly"}, "recipeCuisine": "Italian", "keywords": ["Italian", "italian american", "pasta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vegan Fettuccine Alfredo", "link": "https://www.seriouseats.com/recipes/2018/03/vegan-fettuccine-alfredo.html", "description": "How do you make a vegan version of fettuccine Alfredo when you can't use any butter, cheese, or cream? The secret is cauliflower, which can be transformed into a silky and rich purée with the help of some cashews and nutritional yeast.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cauliflower", "Condiments and Sauces", "Dairy-Free", "Italian", "Mains", "Pasta", "Stovetop", "Valentine's Day", "Vegan", "Vegetarian"], "recipeIngredient": ["1 1/2 cups (355ml) unsweetened, unflavored almond or cashew milk or vegetable broth", "1 pound (455g) cauliflower, cored and cut into medium florets (12 ounces/340g florets)", "1/2 cup (2 ounces/55g) raw cashews", "2 tablespoons nutritional yeast", "Finely grated zest of 1/2 lemon (optional)", "Kosher salt", "1 to 2 large cloves garlic", "12 ounces (340g) dry fettuccine ", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, bring nut milk or broth to a simmer over medium heat. Add cauliflower and cashews and stir to coat with the liquid. Reduce heat to medium low, cover, and cook until the cauliflower is very tender when pierced with a knife, about 10 minutes. (If the liquid seems to be evaporating out from under the lid, reduce the heat to low; you want to cook the cauliflower while retaining as much of the liquid as possible.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cauliflower, cashews, and liquid to a blender or food processor and let cool until warm. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the saucepan, fill it with water, and bring to a boil over high heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée cauliflower and cashews until very smooth. (A high-powered blender will give you the best texture, but you can achieve a smooth purée if you let a food processor run for a solid minute or more, scraping down the sides occasionally.) Add nutritional yeast, lemon zest (if using), and a few large pinches of salt. Finely grate as much garlic as you want over the sauce and pulse just to combine. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the boiling water with salt and add fettuccine; cook until just al dente, then reserve about 1 cup (235ml) of the cooking water and drain. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the hot pasta to the pot. Add the vegan Alfredo sauce and about 1/4 cup (60ml) of cooking liquid and toss, adding more liquid as necessary to loosen the sauce to a creamy consistency. Put the pan over the heat for a few seconds to heat the pasta as necessary. Taste and season with salt. Transfer the fettuccine Alfredo to a large bowl, hit it with a few grinds of black pepper, and serve. "}]}