{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180410-gooey-chocolate-frosting-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["buttercream", "chocolate", "cocoa", "condensed milk", "cream", "dairy", "dutch cocoa", "frosting", "milk", "mousse"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Creamy Eggless Chocolate Frosting", "link": "https://www.seriouseats.com/recipes/2018/06/creamy-eggless-chocolate-frosting.html", "description": "This rich and creamy frosting is essentially our <a href=\"https://www.seriouseats.com/2017/12/how-to-make-dark-chocolate-mousse.html\">eggless chocolate mousse</a> finished with butter instead of cream. Its flavor hinges entirely on the deep, dark taste of top-notch Dutch cocoa, so don't expect the same results from a low-fat brand. ", "totalTime": "3 hours", "recipeYield": "About 5 cups (enough to fill and frost an 8-inch layer cake)", "recipeCategory": ["Chocolate", "Frosting", "Puddings and Custards", "Stovetop"], "recipeIngredient": ["7 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted</a> sugar (1 cup; 195g)", "2 ounces <a href=\"https://www.seriouseats.com/2018/12/best-dutch-cocoas.html\">Dutch cocoa powder</a>, such as <a href=\"https://www.amazon.com/Cacao-Barry-Cocoa-Powder-Extra/dp/B00BLTNL4Q/?tag=serieats-20\">Cacao Barry Extra Brute</a> (about 2/3 cup, spooned; 55g); see note", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "32 ounces milk, <a href=\"http://www.seriouseats.com/2017/01/is-it-okay-to-bake-with-skim-milk.html\">any percentage will do</a> (4 cups; 910g)", "6 ounces heavy cream (3/4 cup; 170g)", "12 ounces unsalted butter (about 3 sticks; 340g), softened to about 70°F (21°C)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Base:</strong> Combine sugar, Dutch cocoa, and salt in a 5-quart stainless steel or enameled Dutch oven. When the cocoa is distributed into the sugar, whisk in milk and cream. If you have a scale, weigh the pot and ingredients together so you can digitally track the reduction. Place over medium heat, stirring occasionally with a heat-resistant spatula, until milk begins to simmer, about 12 minutes. (If this takes substantially more or less time, adjust the heat accordingly to better match the pace of the cooking process in step 2.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Simmer, stirring and scraping continuously to prevent a milky buildup from forming around the sides or scorching along the bottom. Continue cooking and scraping until mixture is as thick and dark as chocolate pudding and reduced to about 2 1/3 cups (24 ounces), about 30 minutes. Again, if this process is moving too slowly or too rapidly, simply adjust the heat. If you're using a scale, the pot will weigh 25 ounces less than when you started. Transfer to a wide dish (such as a 7- by 11-inch baking dish), cover with plastic, and refrigerate until thick and cold, or approximately 70&deg;F (21&deg;C), about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a stand mixer fitted with a paddle attachment, beat chilled cocoa base until smooth, then add softened butter a few tablespoons at a time. When ingredients are well combined, switch to a whisk attachment and beat until frosting is creamy, smooth, and light. The frosting's ideal working temperature is about 70&deg;F. If its temperature is significantly below that, the frosting may seem greasy or curdled; significantly above, and it may seem soft and loose. Its consistency can be adjusted according to the <a href=\"https://www.seriouseats.com/2017/05/how-to-fix-a-broken-swiss-meringue-buttercream.html\">buttercream troubleshooting guide here</a>."}]}