{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/06/20180508-homemade-ricotta-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["cheese", "dairy", "Italian", "milk", "ricotta"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Homemade Ricotta", "link": "https://www.seriouseats.com/recipes/2018/06/homemade-ricotta.html", "description": "Most of us at home don't have easy access to a large supply of whey, but we <em>can</em> use milk and an acid like white vinegar to make a cheese that's remarkably similar to true ricotta. The keys to getting it right lie in using the right amount of acid, heating the milk to the right temperature, and holding it there long enough for a ricotta-like flavor to develop.", "totalTime": "30 minutes", "recipeYield": "Makes about 1 1/3 cups (12 ounces)", "recipeCategory": ["Cheese", "Italian", "Stovetop", "Vegetarian"], "recipeIngredient": ["1/2 gallon (1.9L) whole milk, not ultra-pasteurized (see note)", "Pinch kosher salt, optional (see note)", "2 tablespoons plus 2 teaspoons (40ml) distilled white vinegar or fresh lemon juice (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a pot with the milk. Stir in salt, if using. Heat over medium heat until milk registers 185&deg;F (85&deg;C) on an instant-read thermometer. Add vinegar or lemon juice and stir briefly to incorporate. Curds should begin forming almost immediately; stop stirring as soon as they've formed throughout the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Without stirring, continue to hold curdled-milk mixture at 185&deg;F for 20 minutes. It's okay if the temperature fluctuates down to 175&deg;F (79&deg;C) or up to 190&deg;F (88&deg;C), but try to keep it in that zone for the full 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a fine-mesh strainer with paper towels or cheesecloth. Using a slotted spoon, transfer curds to strainer and let stand until excess liquid has drained away. Exactly how long to let it drain depends on whether you want a moister final product or a drier one. Do not try to pour all the milky liquid through the strainer, as this will clog it and prevent the liquid from flowing through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drained ricotta can be refrigerated, covered, for up to 2 days, though it is best when freshly made."}]}