{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/12/20181127-gingerbread-ice-cream-vicky-wasik-21.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["brown sugar", "cookie", "crumb", "custard", "dessert", "gingerbread", "ice cream", "spice", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Gingerbread Ice Cream", "link": "https://www.seriouseats.com/recipes/2018/12/gingerbread-ice-cream-recipe.html", "description": "With a brown sugar base to play up the molasses notes of gingerbread, this ice cream has all the hearty flavor you'd expect of a gingerbread cookie. ", "totalTime": "5 hours", "recipeYield": "Makes 1 heaping quart", "recipeCategory": ["Christmas", "Cookies", "Ice Cream and Frozen Treats", "Stovetop", "Valentine's Day", "Winter"], "recipeIngredient": ["5 1/2 ounces light or dark brown sugar (about 2/3 cup, gently packed; 145g)", "4 ounces egg yolk (about 1/2 cup; 110g), from about 8 large eggs", "3/4 teaspoon (3g) Diamond Crystal kosher salt, plus more as needed; for table salt, use half as much by volume or use the same weight", "1/8 teaspoon baking soda", "6 3/4 ounces gingerbread cookie crumbs (about 1 1/2 cups; 190g), from store-bought or <a href=\"https://www.seriouseats.com/recipes/2018/12/gingerbread-cookies.html\">homemade gingerbread cookies</a>, plus more for mix-ins and garnishing", "9 ounces heavy cream (about 1 cup plus 2 tablespoons; 255g)", "11 ounces whole milk (about 1 1/4 cups plus 2 tablespoons; 310g)", "1/4 ounce orange liqueur, such as Cointreau, or whatever sounds tasty (about 1/2 tablespoon; 7g), optional", "1 teaspoon vanilla extract", "Kosher salt (optional)", "Freshly ground black pepper or other complementary spices (optional)", "Chilled <a href=\"https://www.seriouseats.com/recipes/2016/09/easy-caramel-sauce-recipe.html\">Homemade Caramel Sauce</a>, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine brown sugar, egg yolks, salt, and baking soda in a 3-quart stainless steel saucier, then whisk in cookie crumbs, cream, and milk. Cook over medium-low heat for a few minutes, until warm to the touch. Increase heat to medium, stirring and scraping constantly with a flexible spatula, and cook until steaming-hot, about 8 minutes or to 155&deg;F (68&deg;C). Stir in liqueur and vanilla and season to taste with salt, black pepper, and/or additional spices if desired. Pour through a fine-mesh sieve into a large stainless steel bowl, pressing gently with a flexible spatula to release the liquid trapped in the crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a sink compartment or extra-large bowl with a few inches of ice water and place bowl of custard inside, stirring from time to time, until cool, about 30 minutes. Cover and refrigerate until no warmer than 40&deg;F (4&deg;C), about 4 hours. (The ice cream base can be kept refrigerated for up to 1 week.) Churn in an ice cream machine according to the manufacturer’s directions. Meanwhile, place a 1-quart container and flexible spatula in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ice cream looks thick and light, shut off the machine and scrape ice cream into chilled container, using chilled spatula. If desired, layer ice cream with chilled caramel sauce and an extra handful of crushed gingerbread cookies, in pieces as large or small as you like. Enjoy as soft-serve, or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until hard, about 4 hours. If well protected from freezer burn, the ice cream can be kept in the freezer for more than a month. Serve plain, with gingerbread cookies on the side, or as an à la mode scoop for <a href=\"https://www.seriouseats.com/recipes/2017/11/old-fashioned-gingerbread-cake-recipe.html\">gingerbread cake</a> or cherry pie."}]}