{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/VEGANRICOTTALASAGNA.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["Italian", "italian american", "pasta", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vegan Italian-American Lasagna With \"Ricotta\"", "link": "https://www.seriouseats.com/recipes/2018/03/vegan-italian-american-lasagna-with-ricotta.html", "description": "Classic Italian-American Lasagna with ricotta cheese, mozzarella, and more is a difficult dish to make vegan without those essential dairy ingredients. The secret to this convincing version is to offer up familiar textural and flavor cues so that you're less likely to notice what's not there.", "totalTime": "1 hour 30 minutes", "recipeYield": "Makes about 10 servings", "recipeCategory": ["Baking", "Cauliflower", "Dairy-Free", "Italian", "Lasagna", "Mains", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Vegan \"Ricotta\":</strong>", "1 (14-ounce; 395g) block firm tofu, drained", "1 cup (235ml) unflavored, unsweetend almond milk", "2 teaspoons dried oregano", "2 (2-pound; 900g) heads cauliflower (4 pounds total), stalks discarded and florets cut into 1-inch pieces", "2 tablespoons (30ml) refined neutral coconut oil (see note)", "25 fresh basil leaves from one large bunch, chopped", "3 medium cloves garlic, minced", "Kosher salt and freshly ground black pepper", "<strong>For the Vegan Béchamel:</strong>", "2 cups (475ml) unflavored, unsweetened almond milk", "1 bay leaf", "5 sprigs thyme", "10 whole black peppercorns", "3 medium cloves garlic, crushed", "3 tablespoons (45ml) refined neutral coconut oil (see note)", "3 tablespoons (25g) all-purpose flour", "Generous pinch freshly grated nutmeg", "<strong>For the Lasagna:</strong>", "1 pound (450g) dry lasagna noodles (egg-free), cooked about 2 minutes less than package instructions indicate, then drained and chilled in ice water", "5 cups (1.2L) <a href=\"https://www.seriouseats.com/recipes/2014/09/easy-italian-amercian-red-sauce-recipe.html\">Quick Italian-American Red Sauce</a> (made without the butter) or <a href=\"https://www.seriouseats.com/recipes/2018/03/vegan-bolognese-sauce-with-seitan-and-mushrooms.html\">Vegan Bolognese Sauce</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Vegan \"Ricotta\":</strong> Cut tofu into 1 inch thick slabs. Set tofu on paper towels, lay more paper towels on top and press to extract any excess moisture. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven or large saucepan, combine almond milk and oregano. Add cauliflower, cover, and bring almond milk to a boil over high heat. Continue to cook, covered, until cauliflower is fully tender, about 10 minutes; adjust heat as necessary to maintain boil while preventing scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add coconut oil, basil, and garlic. Using an immersion blender, purée cauliflower until very smooth. Add tofu and purée into cauliflower until well incorporated; the resulting purée should have a slightly grainy, ricotta-like texture thanks to the tofu. Season with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Béchamel:</strong> In a small saucepan, combine almond milk with bay leaf, thyme, peppercorns, and garlic. Bring to a bare simmer, then lower heat to maintain a bare simmer for 20 minutes. Strain almond milk into a heatproof measuring cup and discard aromatics."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, heat coconut oil over medium heat until melted. Add flour and cook, whisking, until raw flour smell is gone, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisking constantly, add infused almond milk in a thin, steady stream, or in increments of a couple of tablespoons at a time, whisking thoroughly and getting into all corners of the pan to maintain a homogeneous texture. Sauce will initially become very thick, then get very thin once all the milk is added."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat, stirring, until sauce comes to a simmer and begins to thicken slightly. Reduce heat to low and cook, stirring, until béchamel sauce is thick enough to coat the back of a wooden spoon, about 3 minutes. Stir in nutmeg and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Lasagna:</strong> Adjust oven rack to center position and preheat oven to 425&deg;F (220&deg;C). Drain pasta well. In a 9- by 13-inch baking dish, lay down a single layer of lasagna sheets to cover the bottom of the dish. Spread an even layer of vegan \"ricotta\" top, then spread a layer of tomato sauce (or vegan ragù, if using) on top of that. Drizzle with some of the béchamel. Repeat in alternating layers of pasta, \"ricotta,\" tomato sauce (or ragù), and béchamel sauce until baking dish is full and/or any of the components is used up. The final layer should be tomato sauce (or ragù) with béchamel drizzled on top. You may have some of the vegan \"ricotta\" left over, which can be reserved for another use (such as spreading on toasts)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set baking dish on a rimmed baking sheet and bake until lasagna is browned on top and bubbling, about 25 minutes. Let lasagna rest 20 minutes before serving. Cut individual portions and serve while still warm."}]}