{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/images/2017/02/20170217-reverse-sear-steak-02.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["beef", "essential", "low carb", "reverse sear", "steak"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Reverse-Seared Steak", "link": "https://www.seriouseats.com/recipes/2018/10/reverse-seared-steak-recipe.html", "description": "The reverse sear is one of the easiest, most consistent, most foolproof, and arguably best methods of cooking a steak. The secret is to start in a low oven until the steak is heated through just enough, then quickly sear it in a hot pan or on the grill for a beautiful crust.", "totalTime": "1 hour, plus optional overnight dry-brining", "recipeYield": "Makes 1 or more steaks", "recipeCategory": ["Dairy-Free", "Father's Day", "Gluten-Free", "Mains", "Mother's Day", "Roasting", "Steak", "Stovetop", "Valentine's Day"], "recipeIngredient": ["Thick-cut beef steak(s), at least 1 1/2 to 2 inches thick, such as ribeye, strip, porterhouse, T-bone, tri-tip, or filet mignon", "Kosher salt and freshly ground black pepper", "Vegetable oil (if finishing on the stovetop)", "1 tablespoon (15g) butter (if finishing on the stovetop)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously season steak(s) all over with salt and pepper. If desired, set steak(s) on a wire rack set in a rimmed baking sheet and refrigerate, uncovered, overnight to dry out the exterior. Otherwise, proceed with the next step."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Cooking in the Oven:</strong> Set steak(s) on a wire rack set in a rimmed baking sheet. Preheat oven to anywhere between 200 and 275°F (93 and 135°C); if your oven goes lower, you can set it to an even lower temperature, though it will take longer to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place steak(s) in the oven and cook until an instant-read thermometer registers 105&deg;F (41&deg;C) for rare, 115&deg;F (46&deg;C) for medium-rare, 125&deg;F (52&deg;C) for medium, or 135&deg;F (57&deg;C) for medium-well. This will take about 20 minutes for rare steak and up to about 40 minutes for medium-well; cooking time can vary dramatically depending on many factors, so check often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before steak(s) come out of the oven, add 1 tablespoon (15ml) oil to a cast iron, carbon steel, or heavy stainless steel skillet and heat over high heat until smoking. Add steak(s) and butter to skillet and cook until each side is well browned, about 45 seconds per side. Using tongs, hold steak(s) sideways to sear edges. Serve right away; there's no need to let reverse-seared steaks rest. (Alternatively, to finish on the grill, remove steak from the oven and tent with foil while you build the biggest fire you can in a charcoal grill, or turn all the burners on a gas grill to their highest heat and preheat grill with the lid closed. Transfer steak to the hottest part of the grill and cook, turning frequently, until crisp and charred all over, about 1 1/2 minutes total, then serve right away.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Cooking on the Grill:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set steak(s) on cooler side of grill and let cook uncovered, turning occasionally, until an instant-read thermometer registers 105&deg;F (41&deg;C) for rare, 115&deg;F (46&deg;C) for medium-rare, 125&deg;F (52&deg;C) for medium, or 135&deg;F (57&deg;C) for medium-well. Cooking time can vary greatly, so check the steaks often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer steak(s) to a platter and tent with foil. If you are using a charcoal grill and your coals have died down, build up the biggest fire you can. If using a gas grill, make sure all burners are turned to their highest heat and allow the grill to preheat with the lid closed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return steak(s) to the hottest part of the grill and cook, turning frequently, until crisp and charred all over, about 1 1/2 minutes total. Serve right away."}]}