{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/20180501-snap-pea-radicchio-salad-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["dill", "garlic", "olive", "olive oil", "radicchio", "salad", "snap pea", "spring", "yogurt"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Snap Pea and Radicchio Salad With Garlic Yogurt Dressing", "link": "https://www.seriouseats.com/recipes/2018/05/snap-pea-and-radicchio-salad-with-garlic-yogurt-dressing.html", "description": "This bright salad coats chilled, crisp sugar snap peas in a tangy yogurt dressing to contrast warm, charred radicchio.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Christmas", "Easter", "Garlic", "Gluten-Free", "Legumes", "Olives", "Quick and Easy", "Salads", "Spring", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["1 small head radicchio (about 12.5 ounces; 350g)", "1 tablespoon olive oil (.5 ounce; 14g)", "kosher salt and freshly ground pepper to taste", "1 quart sugar snap peas (about 1 pound; 450g)", "5 cloves garlic, thinly sliced on a <dorado id=\"oxo-good-grips-hand-held-mandoline-slicer\" class=\"text\">mandoline</dorado> (about 1 ounce; 30g)", "1/3 cup olive oil (2 ounces; 60g)", "1/2 cup Greek yogurt, any percentage will do (4.2 ounces; 120g)", "2 tablespoons chopped fresh dill (10g), plus more for garnish", "1/3 cup chopped black olive (2.8 ounces; 80g)", "1 tablespoon olive brine (.5 ounce; 14g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Started:</strong> Set a stockpot of water (about 4 quarts) on the stove and allow it to come to a boil. Prepare an ice bath in a large mixing bowl with a colander set into it. Preheat the oven's broiler and line a rimmed baking sheet with foil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the water comes to a boil and the broiler preheats, prep the vegetables: Remove any wilted outer leaves on the radicchio and cut in into 8 wedges, leaving the core intact. Toss with the olive oil, salt, and pepper and line up the wedges on the baking sheet. Using a paring knife or tourné knife, remove the ends of the sugar snap peas, pulling away the tough string that runs along the pods. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Cook the Vegetables:</strong> Broil the radicchio until the cut edges of the leaves are lightly charred and the core is tender, about 10 minutes. Meanwhile, heavily salt the boiling water and blanch the snap peas one handful at a time until bright green but still snappy, about 2 minutes. Using a spider, remove each batch of snap peas to shock in the ice bath until fully cooled. Remove from ice bath and dry in a salad spinner or kitchen towel. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Dressing:</strong> Over medium heat in a small saucepan, combine the sliced garlic and olive oil. Cook, stirring constantly, until just beginning to turn light golden brown. Immediately strain the oil over a bowl large enough to toss the snap peas, reserving the garlic chips for garnish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the yogurt, dill, olive, and olive brine to the garlic oil. Season with kosher salt and freshly ground black pepper. Toss the blanched snap peas with the yogurt dressing. Serve right away alongside wedges of the warm radicchio. Garnish with the reserved garlic chips and more fresh dill."}]}