{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/01/20171128-roasted-winter-strawberry-fruit-vicky-wasik-11-1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["fruit", "roast", "strawberry", "vanilla", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "3"}, "name": "Roasted Strawberries", "link": "https://www.seriouseats.com/recipes/2018/01/roasted-strawberry-recipe.html", "description": "Whether you're dealing with bland winter fruit or summer strawberries plucked too soon, roasting will cover a multitude of culinary sins and stain even the palest berries a ruby red. The subtle use of aromatic ingredients like lemon, vanilla, and rose water will breathe new life into bland berries, transporting you to a summer's day. Serve warm over ice cream, or chill to make a jammy topping for pancakes and French toast.", "totalTime": "45 minutes", "recipeYield": "Makes about 3 cups", "recipeCategory": ["Breakfast and Brunch", "Condiments and Sauces", "Fruit Desserts", "Mother's Day", "Quick and Easy", "Roasting", "Strawberry", "Valentine's Day", "Winter"], "recipeIngredient": ["32 ounces whole strawberries, washed and drained (about 7 cups; 910g)", "3 1/2 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">lightly toasted</a> sugar (about 1/2 cup; 100g)", "1/8 teaspoon Diamond Crystal kosher salt; for table salt, use about half as much by volume", "1/2 ounce freshly squeezed lemon juice (about 1 tablespoon; 15g)", "1 empty vanilla pod, reserved from another project (see note), or 1 drop vanilla extract", "1/4 teaspoon rose flower water (about 1ml)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to the middle position and preheat to 375&deg;F (190&deg;C). Slice off the strawberries’ leafy caps, removing as little fruit as possible. Leave small and medium berries whole, but cut the largest ones in half. Toss with sugar, salt, and lemon juice in a 2-quart glass or ceramic baking dish. Add the empty vanilla pod, if using. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast, stirring once or twice along the way, until the berries are fork tender and swimming in bright red juice, about 30 minutes. If you didn't use a spent vanilla pod, stir in one drop of vanilla extract along with the rose water, taking care not to crush the tender berries. Serve warm, or refrigerate to use as a jammy syrup. In an airtight container, the roasted fruit and syrup can be refrigerated up to 2 weeks.\t"}]}