{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/01/20171128-sweet-potato-biscuits-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "biscuit", "breakfast", "cast iron"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "The Best Sweet Potato Biscuits", "link": "https://www.seriouseats.com/recipes/2018/03/sweet-potato-biscuit-recipe.html", "description": "Mellow sweet potato purée makes these colorful biscuits tender, moist, and light&mdash;perfect to serve alongside hearty soups and stews, or with a simple spoonful of blueberry jam. ", "totalTime": "45 minutes", "recipeYield": "Makes about 14 two-inch biscuits", "recipeCategory": ["Baking", "Biscuit", "Breakfast and Brunch", "Christmas", "Fall", "Mother's Day", "Pastry", "Thanksgiving", "Valentine's Day", "Winter"], "recipeIngredient": ["9 ounces all-purpose flour, such as Gold Medal (about 2 cups, spooned; 255g)", "1 tablespoon baking powder", "2 teaspoons (8g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight Diamond Crystal kosher salt", "1/2 teaspoon baking soda", "4 ounces cold, unsalted butter, cut into 1/2\" cubes (about 8 tablespoons; 110g)", "9 ounces sweet potato purée, from one large sweet potato, see note (about 1 heaping cup; 255g)", "3 ounces milk, any percentage will do (about 1/3 cup plus 1 tablespoon; 85g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position and preheat to 400&deg;F. Should your kitchen be warmer than 75&deg;F, please see our <a href=\"https://www.seriouseats.com/2016/09/how-to-avoid-soft-and-sticky-dough-butter-temperature.html\">guide to baking in a hot kitchen</a> before getting started; the specifics are focused on pie dough, but the overall principles are true of biscuits as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour, baking powder, baking soda, and salt into a medium bowl, then whisk until well combined (this may take up to 1 minute). Add the butter, toss to break up the pieces, and smash each cube flat. Continue smashing and rubbing until the butter has mostly disappeared into a floury mix, although a few larger, Cheerio-sized pieces may remain. This can also be done with 4 or 5 pulses in a food processor, just take care not to overdo it. The prepared mix can be refrigerated up to 3 weeks in an airtight container, then used as directed below."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash the sweet potato purée and milk together with a fork, or combine with an immersion blender until perfectly smooth. Add to the dry mix in a large bowl, and fold with a flexible spatula until fully absorbed. The dough will seem rather crumbly and dry at first, but keep mixing until it finally comes together. Once the dough forms a rough ball, turn out onto a lightly floured surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With your bare hands, gently pat the dough into a squarish shape about 1/2-inch thick, then fold in half; repeat twice more for a total of 3 folds, using only enough flour to keep your hands from sticking. Finish by patting the dough to a thickness of 3/4 inch. If needed, dust away any excess flour, then cut into 1 3/4-inch rounds and arrange in a 10-inch cast iron skillet. Gather scraps into a ball, pat and fold a single time, then cut as many more biscuits as you can. The final round of scraps can be gathered and shaped into a single biscuit by hand. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the biscuits are well-risen and golden brown, about 25 minutes (or longer if cut thicker than 3/4-inch). Let the biscuits cool about 5 minutes to help set their crumb, then serve as desired, whether alongside soups and stews or split for shortcake or breakfast sandwiches. Leftovers can be stored up to a week in an airtight container; to serve, split the stale biscuits in half, brush with melted butter, arrange on a baking sheet, and broil until golden brown, then serve with jam."}]}