{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/02/devilsfood.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "baking", "brown sugar", "buttercream", "cake", "chocolate", "chocolate cake", "cocoa", "devil's food", "dutch cocoa", "essential", "layer cake", "swiss meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "21"}, "name": "BraveTart's Devil's Food Cake", "link": "https://www.seriouseats.com/recipes/2018/02/bravetarts-devils-food-cake.html", "description": "As the name suggests, this devilish cake is as black as sin, loaded with coffee, chocolate, cocoa, and butterscotch-y brown sugar. The acidity of these deliciously dark ingredients provokes an intensely fizzy reaction from the baking soda, for a cake that bakes up fluffy and light, with no whipping or creaming of the batter&mdash;just stir everything together, and you’re done!", "totalTime": "3 hours", "recipeYield": "Makes 1 (8-inch) cake, serving 16", "recipeCategory": ["Baking", "Cakes", "Chocolate", "Easter", "Father's Day", "Mother's Day", "Valentine's Day"], "recipeIngredient": ["<strong>For the Cake:</strong>", "12 ounces unsalted butter (about 3 sticks; 340g)", "12 ounces brewed black coffee, or black tea such as Assam (about 1 1/2 cups; 340g)", "3 ounces Dutch-process cocoa powder, such as <a href=\"https://www.amazon.com/Cacao-Barry-Cocoa-Powder-Extra/dp/B00BLTNL4Q/?tag=serieats-20\">Cacao Barry Extra Brute</a> (about 1 cup, spooned; 85g)", "6 ounces finely chopped dark chocolate, roughly 72% (about 1 1/4 cups; 170g)", "16 ounces light brown sugar (about 2 cups, packed; 455g)", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "1 teaspoon (4g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "6 large eggs, straight from the fridge (about 10 1/2 ounces; 295g)", "3 large egg yolks, straight from the fridge (about 1 1/2 ounces; 45g)", "9 ounces all-purpose flour, such as Gold Medal (about 2 cups, spooned; 255g)", "1 tablespoon (about 13g) baking soda ", "<strong>To Finish:</strong>", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2018/02/chocolate-swiss-buttercream.html\">Chocolate Swiss Buttercream</a> or other frosting", "5 ounces finely ground Oreo wafer crumbs (about 1 cup; 140g), store-bought or <a href=\"http://www.seriouseats.com/recipes/2017/08/bravetart-homemade-oreo-style-cookies-recipe.html\">homemade</a> (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> Adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). Line three 8- by 3-inch anodized aluminum pans with parchment and grease with pan spray. (The cakes can be baked in 2-inch-deep pans, but they will dome more and rise less.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Cake:</strong> Combine butter and coffee or tea in a 5-quart stainless steel pot or saucier over low heat. Once melted, remove from heat, then mix in cocoa and chocolate, followed by brown sugar, vanilla, and salt. Mix in eggs and yolks, then sift in flour and baking soda. Whisk thoroughly to combine. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter between prepared cake pans, about 23 ounces each. (If you don't have three pans, the remaining batter can be held at room temperature up to 90 minutes, though the rise will not be quite as high.) Bake until cakes are firm but your finger can still leave an impression in the puffy crust, about 30 minutes (a toothpick inserted into the center should come away with a few crumbs still attached)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool cakes directly in their pans for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off parchment, and return cakes right side up. Meanwhile, prepare the buttercream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Crumb Coat:</strong> Level cakes with a serrated knife (full directions <a href=\"http://www.seriouseats.com/2017/05/how-to-level-a-cake.html\">here</a>) and set scraps aside for snacking. Place 1 layer on a heavy cast iron turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with exactly 1 cup buttercream, using an offset spatula to spread it evenly from edge to edge. Repeat with second and third layers, then cover sides of cake with another cup of buttercream, spreading it as smoothly as you can (tutorial <a href=\"http://www.seriouseats.com/2017/05/how-to-crumb-coat-cake.html\">here</a>). If you like, a second layer can be applied for a thicker coat of frosting. Refrigerate cake until buttercream hardens, about 30 minutes. Coat exterior of chilled cake in a layer of chocolate cookie crumbs, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cake return to cool room temperature before serving. Under a cake dome or an inverted pot, the frosted cake will keep 24 hours at cool room temperature. After cutting, wrap leftover slices individually and store at cool room temperature up to 3 days more."}]}