{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180413-brownie-mix-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "brownie", "chocolate", "cocoa", "coconut oil", "dark chocolate", "dessert", "dutch cocoa", "food processor", "malted milk powder", "powdered sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade Brownie Mix", "link": "https://www.seriouseats.com/recipes/2018/05/homemade-brownie-mix.html", "description": "With refined coconut oil for richness and stability, plus the toasty, nutty flavor of malted milk powder, these easy brownies combine the convenience of a boxed mix with the satisfaction of a totally homemade dessert. A blend of dark chocolate and Dutch cocoa delivers a deep, complex flavor, while a tiny pinch of espresso powder adds a hint of bitterness to keep the sweetness of these chocolate brownies in check.", "totalTime": "30 minutes", "recipeYield": "makes 16 (2-inch) brownies", "recipeCategory": ["Baking", "Brownies and Bars", "Chocolate", "Pastry", "Quick and Easy"], "recipeIngredient": ["<strong>For the Mix</strong>", "10 ounces powdered sugar (about 2 1/2 cups, spooned; 285g)", "3 ounces finely chopped dark chocolate, roughly 72%; more information <a href=\"https://www.seriouseats.com/2018/04/6-supermarket-chocolate-bars-for-better-baking.html\">here</a> (about 1/2 cup, finely chopped; 85g)", "2 1/4 ounces all-purpose flour (about 1/2 cup, spooned; 63g), such as Gold Medal", "2 1/4 ounces Dutch process cocoa powder (about 3/4 cup, spooned; 63g), such as <a href=\"https://www.amazon.com/Cacao-Barry-Cocoa-Powder-Extra/dp/B00BLTNL4Q/?tag=serieats-20\">Cocoa Barry Extra Brute</a>", "1 ounce malted milk powder, such as Carnation or <a href=\"https://www.amazon.com/Old-fashioned-Malted-Hoosier-Hill-Farm/dp/B00BW0FRWI/?tag=serieats-20\">Hoosier Hill Farms</a> (about 1/4 cup; 30g)", "1 1/4 teaspoons (5g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "3/4 teaspoon instant espresso powder, such as Medaglia d’Oro, optional", "1 3/4 ounces refined coconut oil, solid but creamy, about 70°F/21°C (about 1/4 cup; 50g)", "<strong>For the Brownies</strong>", "2 ounces water (about 1/4 cup; 55g)", "2 large eggs, straight from the fridge (about 3 1/2 ounces; 100g)", "1/4 ounce vanilla extract (about 1 1/2 teaspoons; 7g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Mix:</strong> Combine powdered sugar, dark chocolate, all-purpose flour, Dutch cocoa, malted milk powder, salt, and espresso powder (if using) in the bowl of a food processor. Grind until the chocolate disappears into a fine, powdery mix, and you can no longer hear any chunks bouncing around the bowl, about 2 minutes (the timing can vary significantly depending on the size and power of the food processor)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the solid coconut oil and pulse only until well combined, about 30 seconds. For immediate use, proceed directly to Step 3. Otherwise, transfer the mix to an airtight container and store at cool room temperature up to one year, or until the date stamped on the package of coconut oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position, preheat to 350°F (180°C), and line an 8-inch-square, anodized aluminum brownie pan with a long strip of parchment or foil to cover the bottom and two of the sides. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oven has come to temperature, prepare the batter in the bowl of a food processor or in a large mixing bowl with a flexible spatula. Either way, add water, eggs, and vanilla extract, then pulse or stir until well combined. The batter will be smooth and thin when made in a food processor, but lumpy and thick when mixed by hand. These textural differences with not affect the batter's behavior."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Bake:</strong> Scrape the batter into the prepared pan, spread into an even layer, and bake until the brownies are glossy, puffed, and firm but a little squishy, about 35 minutes. The timing is based on the volume and conductivity of an 8-inch anodized aluminum pan; be aware the time needed will vary significantly with glass, ceramic, or non-stick pans. Allow the brownies to cool at least 15 minutes before slicing. To serve, gently tug on the foil or parchment, and lift to remove the brownies from the pan. Cut into 16 two-inch squares. Store leftovers in an airtight container with a sheet of wax paper between each layer, about 1 week at room temperature."}]}