{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/shrimpetouffee.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "American", "keywords": ["cajun", "creole", "louisiana", "New Orleans", "seafood", "shellfish", "shrimp", "Southern"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Shrimp Étouffée", "link": "https://www.seriouseats.com/recipes/2018/05/shrimp-etouffee.html", "description": "This recipe gives you the tools to make shrimp étouffée, the classic Cajun and Creole dish of shrimp smothered in a roux-based sauce, the way you want it: lighter, with a clean seafood flavor, or deep, dark, and complex. Either way, the key is to make sure the sauce is deeply flavorful before the shrimp ever enter the pot.", "totalTime": "About 3 hours", "recipeYield": "Serves 6 to 8", "recipeCategory": ["American", "Father's Day", "Mains", "Mother's Day", "Shrimp", "Stovetop"], "recipeIngredient": ["<strong>For the Shrimp Stock (see note):</strong>", "2 pounds (900g) shell-on shrimp, or 3 pounds (1.4kg) head-on shrimp (small or large shrimp will work in this recipe; size doesn't matter)", "2 teaspoons (8g) Diamond Crystal kosher salt; for table salt, use about half as much by volume ", "1/2 teaspoon baking soda", "3 tablespoons (45ml) vegetable or canola oil", "1 medium yellow onion, diced", "2 large ribs celery, diced", "4 medium cloves garlic, smashed", "2 tablespoons (30ml) tomato paste", "1/2 cup (120ml) dry sherry or brandy (optional)", "1 bay leaf", "A few sprigs flat-leaf parsley", "4 sprigs thyme", "<strong>For the Étouffée:</strong>", "1/2 cup (4 ounces; 115g) unsalted butter", "1/2 cup (2 1/4 ounces; 65g) all-purpose flour", "1 (8-ounce; 225g) medium yellow onion, diced", "2 large ribs celery (6 ounces; 170g), diced", "1 (8-ounce; 225g) large green bell pepper, stemmed, seeded, and diced (or, if you want a sweeter flavor, half of a large green bell pepper and half of a large red bell pepper)", "4 medium cloves garlic, coarsely chopped", "3 scallions, white and light-green parts only, thinly sliced, plus more for garnish", "1/2 teaspoon dried oregano", "1/2 teaspoon dried thyme", "1/4 teaspoon garlic powder", "1/4 teaspoon onion powder", "1/4 teaspoon cayenne pepper", "1/8 teaspoon hot paprika (optional)", "3 cups (700ml) shrimp stock, plus more as needed", "2 bay leaves", "Kosher salt and freshly ground black pepper", "Warm long-grain rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Shrimp Stock (see note):</strong> Peel and devein shrimp, reserving the shrimp shells; if using head-on shrimp, twist off the heads and reserve with the shells. In a medium bowl, combine peeled shrimp with the 2 teaspoons salt and 1/2 teaspoon baking soda and stir well. Refrigerate shrimp until it's time to add them to the étouffée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy-bottomed <a href=\"https://www.seriouseats.com/2018/04/the-best-stockpots.html\">stockpot</a> or <a href=\"https://www.seriouseats.com/2017/11/best-cast-iron-dutch-ovens-equipment-review.html\">Dutch oven</a>, heat oil over high heat until shimmering. Add shrimp shells and heads (if using) and cook, stirring constantly and scraping up any browned bits as they form on the bottom of the pot, until it becomes difficult to remove the browned bits and it seems they could start to burn, about 4 minutes; lower heat at any point if necessary to avoid burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion, celery, and garlic and continue to cook, stirring and scraping, until softened. Add tomato paste and stir well until incorporated. If using sherry or brandy, add it to the pot and bring to a boil, scraping up any browned bits, then add 2 quarts (1.9L) water. (If not using sherry or brandy, just add the water right away.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bay leaf, parsley, and thyme and bring to a gentle simmer, then cook for 45 minutes. Strain stock; do not skim the oil from the surface of the stock, as the oil contains a lot of the shrimp flavor and won't be a problem for the étouffée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Étouffée:</strong> In a Dutch oven, melt butter over medium-high heat until foaming. Add flour and stir to form a smooth paste. Cook, stirring and scraping the bottom very frequently, until roux turns the color of your choice: light tan, peanut butter&ndash;colored, or chocolaty brown. The color of the roux will change the flavor of the étouffée, from mild and light with a sweet shrimp flavor for a blond roux, to dark, slightly bitter, and complex for a darker brown one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion, celery, and bell pepper, then lower heat to medium and cook, stirring, until vegetables are coated in the floury paste and have softened slightly, about 4 minutes. Stir in garlic and scallion and cook for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in dried oregano, dried thyme, garlic powder, onion powder, cayenne, and hot paprika, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shrimp stock in ladlefuls, stirring well to incorporate between additions. At first the stock will form a thick, gluey paste with the flour, but it will eventually thicken into a thick sauce. Bring to a simmer, then lower heat to maintain a bare simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bay leaves, season with salt and pepper, then cover and simmer, occasionally stirring and scraping the bottom to prevent scorching, until vegetables are very soft, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in shrimp and cook until they have just turned pink and are cooked through; the amount of time this takes will depend on the size of the shrimp. At this point, if the étouffée is too thick for your taste, add more stock as needed to thin it to your desired consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season étouffée with salt and pepper. Spoon into bowls or onto plates with warm rice. Garnish with thinly sliced scallions and serve."}]}