{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/instantpotcornrisotto.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Italian", "keywords": ["corn", "no stir", "pecorino", "risotto", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Pressure Cooker Corn Risotto", "link": "https://www.seriouseats.com/recipes/2018/08/pressure-cooker-corn-risotto.html", "description": "Make the most of sweet summer corn with this four-minute creamy pressure cooker risotto.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Cheese", "Corn", "Father's Day", "Gluten-Free", "Italian", "Mains", "Mother's Day", "Pressure Cooker", "Quick and Easy", "Quick Dinners", "Rice", "Summer", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["2 cups (14 ounces; 400g) short-grain rice such as arborio, bomba, or carnaroli", "3 1/2 cups (28 ounces; 820g) <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> or store-bought low-sodium chicken or <a href=\"https://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable stock</a>", "6 ears of corn, shucked", "6 tablespoons (3 ounces; 45g) unsalted butter, divided", "2 small shallots, minced (about 2 ounces; 60g)", "2 cloves garlic, minced (about 10g)", "3/4 cup (6 ounces; 170g) dry white wine", "1 bay leaf", "3-4 sprigs of thyme", "Kosher salt and freshly ground black pepper", "1/4 cup (2 ounces; 60g) heavy cream", "1 teaspoon ground turmeric (optional)", "1/2 cup (2 ounces; 60g) grated pecorino cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, rinse the rice with the chicken stock, gently stirring with a spoon or rubber spatula. Drain the rice through a fine mesh sieve, reserving the stock and the rice. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Invert a small metal bowl and place inside a larger metal bowl to create an elevated surface to cut the corn. Using a small paring knife, trim the corn from the cobs. After removing the kernels, using the back of the knife, scrape any remaining starchy liquid from the cobs. Set aside and reserve three of the stripped cobs. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the pressure cooker to sauté or place over medium-high heat and preheat. Add 2 tablespoons of butter and melt until foamy, about 1 minute. Add the corn and sauté until tender and sweet, about 2 minutes. Remove the corn from the heat, return it to the bowl, and set it aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pressure cooker, melt the remaining 4 tablespoons of butter until foamy, about 1 minute. Add the minced shallots and garlic, cooking until tender, about 2 minutes. Add the rinsed rice and gently toast in the butter, about 2 minutes. Pour in the wine and cook until reduced and no raw alcohol taste remains, about 2 minutes. Add the chicken stock, bay leaf, thyme to the pot and season with kosher salt and freshly ground pepper. Add the three reserved cobs to the liquid and close the pressure cooker. Bring to low pressure and cook for 4 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the risotto cooks, transfer half the sautéed corn to a blender canister along with the heavy cream and turmeric (if using). Blend until smooth and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the risotto has cooked, quickly depressurize the cooker by either submerging it under running cold water if it is not electric, or using the steam release valve if it is electric."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the pressure cooker and remove and dispose of the bay leaf and thyme sprigs. Remove the cobs, scraping the liquid from the cobs back into the risotto. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the corn purée, sautéed corn, and pecorino to the risotto and stir vigorously to develop a thick and creamy texture. Add more kosher salt and freshly ground black pepper to taste. Serve immediately, with more cheese if desired. "}]}