{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180327-dry-harissa-vicky-wasik14.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["condiment", "dried chili", "harissa"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Dried Chili Harissa", "link": "https://www.seriouseats.com/recipes/2018/04/dried-chili-harissa.html", "description": "Harissa is a versatile condiment that can be used to add a punch of spice to anything. This version is made with dried chilies and can be used as a spice rub or hydrated with water for a paste that's ready to stir into dressings, sauces, and more. This is a stripped-down, entry-level harissa, that can be jazzed up with other spices or aromatics such as garlic, citrus zest, or even saffron.", "totalTime": "20 minutes", "recipeYield": "Makes 1 cup", "recipeCategory": ["Condiments and Sauces", "Gluten-Free"], "recipeIngredient": ["1 ancho chili (20g) (see note)", "4 guajillo chilies (30g) ", "5 dried Kashmiri red chilies (12g) ", "4 arbol chilies (3g) ", "2 1/2 teaspoons (10g) ground coriander", "1 teaspoon (4g) ground caraway", "1/4 cup (45g) extra-virgin olive oil", "2 tablespoons (30g) distilled white vinegar", "3/4 teaspoon (3g) Diamond crystal kosher salt; for table salt, use about half as much by volume or the same by weight"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a rimmed baking sheet with a wire rack. Put on disposable latex gloves before handling the dried chilies. Using kitchen shears and, working over the wire rack, cut off the stems from the chilies and cut them into strips. Shake the sheet tray to separate the seeds from the chilies and discard. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a spice grinder working in batches, blend the dried chilies to a fine powder. In a dry sauté pan, toast the chili powder, coriander, and caraway over medium heat until fragrant. You can stop here and use the harissa in this dry form as a seasoning blend. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the harissa paste, add 1 cup (240ml) water to the sauté pan and simmer until the paste is thick, about 10 minutes. Remove from heat. Finish the harissa paste by mixing in the olive oil, vinegar, and salt. The harissa is best the next day and keeps in the refrigerator for a month."}]}