{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/12/20181127-biscotti-vicky-wasik-32.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "Italian", "keywords": ["almond", "anise", "baking", "biscotti", "cookie", "dessert", "holiday", "Italian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1666666666667", "ratingCount": "6"}, "name": "Almond Biscotti With Anise", "link": "https://www.seriouseats.com/recipes/2018/12/almond-anise-biscotti-cookies.html", "description": "Scented with almond and anise, these crunchy homemade biscotti (twice-baked Italian cookies) are as classic as they are simple to make.", "totalTime": "About 2 1/2 hours", "recipeYield": "Makes about 25 pieces ", "recipeCategory": ["Baking", "Christmas", "Cookies", "Fall", "Italian", "Nuts", "Winter"], "recipeIngredient": ["10 ounces all-purpose flour (about 2 1/4 cups, spooned; 285g), plus more for dusting", "8 3/4 ounces sugar (about 1 1/4 cups; 245g)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1 1/4 teaspoons baking powder", "5 1/4 ounces whole almonds, toasted and roughly chopped (about 1 heaping cup; 150g)", "2 1/4 teaspoons whole anise seed, roughly chopped", "3 large eggs, straight from the fridge (about 5 1/4 ounces; 150g)", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position and preheat oven to 350°F (180°C). In the bowl of a stand mixer fitted with a paddle attachment, combine flour, sugar, salt, baking powder, chopped toasted almonds, and chopped anise seed. Mix on low until homogeneous, then add eggs and vanilla; continue to mix just long enough to form a soft dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a lightly floured surface. Knead lightly to bring dough together into a ball, then shape into a roughly 8-inch log. Transfer dough log to a parchment-lined half-sheet pan and continue rolling the log by hand until it is approximately 16 inches long. Gently flatten dough by hand until log is about 4 inches wide and just over 1/2 inch thick (see note)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake dough until puffed and firm to the touch and just beginning to brown around the very edges (though still pale overall), about 25 minutes. Cool directly on baking sheet for about 5 minutes, then transfer to a cutting board and let cool 5 minutes more. While dough is still warm, use a long, thin, and very sharp serrated knife to cut log at a slight angle into about 25 pieces, each just over 1/2 inch wide (see note)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange biscotti, cut sides up, on a parchment-lined baking sheet and continue baking until dry to the touch and lightly browned, about 12 minutes. Flip biscotti over and continue baking for another 12 minutes. It's normal for the timing to vary according to the biscotti's size and thickness, as well as differences in oven temperature and airflow, so keep a close eye on them and adjust the bake time as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool biscotti to room temperature before serving. If desired, dip in <a href=\"https://www.seriouseats.com/2014/12/the-food-lab-best-way-to-temper-chocolate.html\">tempered chocolate</a>. With or without chocolate, the biscotti will keep for about 3 months in an airtight container at cool room temperature. "}]}