{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/04/cheesecake.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Biscoff", "cheesecake", "cracker", "freeze dried", "graham", "no bake", "pie", "strawberry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "No-Bake Cheesecake With Freeze-Dried Fruit", "link": "https://www.seriouseats.com/recipes/2018/04/no-bake-cheesecake-with-freeze-dried-fruit.html", "description": "Freeze-dried fruit gives this simple riff on <a href=\"https://www.seriouseats.com/2017/07/how-to-make-a-no-bake-cheesecake.html\">no-bake cheesecake</a> an all-natural burst of color and flavor. It's creamy, tart, and light&mdash;a rich but refreshing dessert for spring or summer. The basic recipe calls for freeze-dried strawberries, but feel free to use an equal weight of whatever type of freeze-dried fruit you can find&mdash;check out the note below for tips on how to intensify the flavor of other fruits. ", "totalTime": "7 hours", "recipeYield": "Serves 8 to 12", "recipeCategory": ["Baking", "Desserts", "Easter", "Father's Day", "Fruit Desserts", "Mother's Day", "No-Cook", "Pies, Tarts, and Crumbles", "Strawberry", "Valentine's Day"], "recipeIngredient": ["<strong>For the Crust:</strong>", "8 3/4 ounces graham cracker or Biscoff crumbs, store bought or <a href=\"http://www.seriouseats.com/2017/06/how-to-make-speculoos-cookies.html\">homemade</a> (about 2 cups; 250g)", "2 1/2 ounces unsalted butter, melted but cool (about 5 tablespoons; 70g)", "Kosher salt, to taste", "<strong>For the Filling:</strong>", "5 1/4 ounces sugar (about 3/4 cup; 150g)", "2 1/2 ounces freeze-dried strawberries, such as <a href=\"https://www.amazon.com/Mother-Earth-Products-Freeze-Strawberries/dp/B00VWEYQU8/?tag=serieats-20\">Mother Earth</a> or <a href=\"https://www.amazon.com/Karens-Naturals-Strawberries-Freeze-Dried-Preservatives/dp/B006M14P6G/?tag=serieats-20\">Karen’s Naturals</a>; for other fruits, see note (about 3 cups; 70g)", "16 ounces plain, full-fat cream cheese, such as Philadelphia (two 8-ounce packages; 455g)", "1 1/2 ounces fresh juice from 1 lemon (3 tablespoons; 45g)", "1/4 teaspoon Chinese five-spice powder; for spicing other fruits, see note", "1/8 teaspoon Diamond Crystal kosher salt; for table salt, use about half as much by volume", "14 ounces heavy cream (about 1 3/4 cups; 395g)", "<strong>To Serve:</strong>", "12 ounces fresh fruit (about 2 cups; 340g), washed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crust:</strong> Combine cookie crumbs and melted butter in a small bowl, then stir in a pinch of salt to taste. Sprinkle into a 9-inch tart pan or pie plate, spread into an even layer, then compress firmly with a flat-bottomed drinking glass or measuring cup; this will naturally push the crumbs up the sides of the pan. Keep pressing until the crumbs are in a compact, even layer across the bottom and sides of the pan. Refrigerate until needed (wrapped in plastic, this can be done a day or two in advance).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Filling:</strong> In the bowl of a food processor, grind sugar and freeze-dried fruit until powdery and fine, about 1 minute.  Combine the cream cheese, strawberry-sugar, lemon juice, five-spice powder, and salt in the bowl of a stand mixer fitted with a paddle attachment. Mix at low speed to form a thick paste, then increase to medium speed and beat until soft and smooth. Scrape the bowl and beater with a flexible spatula, then switch to the whisk attachment. Add the cream, mix on low speed to combine, then increase to high and whip until the mixture can hold stiff peaks, 3 to 5 minutes depending on the horsepower of the mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape into the prepared crust and spread into an even layer, using the back of a spoon to sculpt the filling into swoops and swirls. Cover with plastic and refrigerate until the filling is firm and cold, about 6 hours, or to an internal temperature of 40&deg;F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve:</strong> Top with fresh fruit and cut into wedges with a hot chef’s knife (rinse it under hot running water between each slice). Carefully slide a pie server under the crust, making sure it reaches all the way to the tip of the wedge (the first slice will the most difficult and messy to remove). Wrapped in plastic, leftovers can be refrigerated keep up to one week.</p>"}]}