{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/09/RADISHKIMCHI.jpg", "author": {"@type": "Person", "name": "Seoyoung Jung"}, "recipeCuisine": "Korean", "keywords": ["banchan", "fermentation", "gluten free", "kimchi", "Korean", "radish", "side", "yeolmu kimchi", "young radish kimchi"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "<em>Yeolmu</em> Kimchi (Quick-Fermented Young Radish Greens)", "link": "https://www.seriouseats.com/recipes/2018/09/young-radish-greens-yeolmu-kimchi-recipe.html", "description": "This quick radish kimchi is crunchy and cooling, perfect for complementing a bowl of barley bibimbap or noodles. It can be eaten fresh, as soon as a day after it's made, though the flavors fully develop after about a week.", "totalTime": "At least 1 day or up to 10 days", "recipeYield": "Makes about 3 quarts", "recipeCategory": ["Gluten-Free", "Korean", "Sides", "Summer", "Vegetables"], "recipeIngredient": ["<strong>For the Porridge (<em>Pul</em>, 풀):</strong>", "2 medium russet potatoes (about 1 pound; 450g), peeled and cut into large pieces (avoid waxy, high-moisture potatoes)", "<strong>For the Greens:</strong>", "4 bunches <em>yeolmu</em> (열무; Korean young radish greens, with small roots attached), about 2.5 pounds or 1.1kg", "1 bunch <em>eolgari baechu</em> (얼갈이 배추; young, green winter cabbage), about 2.5 pounds or 1.1kg (see note)", "Coarse sea salt", "<strong>For the Seasoning Paste:</strong>", "15 to 20 medium spicy fresh red chilies (about 10 ounces; 280g)", "2 Korean <em>cheongyang</em> chilies (or jalapeños)", "1 large white onion (about 1 pound; 450g), roughly chopped", "8 medium cloves garlic (about 2 3/4 ounces; 80g)", "One 1 1/2–inch piece ginger, peeled and sliced", "1/4 cup <em>saewoojeot</em> (salted shrimp), optional (see note)", "1/4 cup <em>gochugaru</em> (Korean chili flakes), optional (see note)", "1 to 2 tablespoons <em>myeolchi aekjeot</em> (Korean anchovy sauce), optional (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Porridge:</strong> Add peeled potatoes to a saucepan and cover with enough water to submerge. Bring to a simmer and cook until soft enough to pierce with a fork, about 20 minutes. While potatoes are hot, break up with a fork. Using an immersion blender or countertop blender, purée potatoes with the cooking water until smooth. Set aside to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Prep the Greens:</strong> Using a <a href=\"https://www.seriouseats.com/2016/10/the-best-paring-knives.html\">paring</a> or <a href=\"https://www.seriouseats.com/2018/01/the-tourne-knife-a-paring-knife-that-turns-heads-and-why-you-need-it.html\">tourné knife</a>, clean the yeolmu by trimming any fibrous stems and damaged leaves and scraping the radish roots clean while keeping them attached to the leaves. Pay extra attention to the top part of the roots, where a lot of soil tends to hide. Wash radish greens well of any dirt or sand; allow to drain, but do not spin dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thoroughly clean and trim any roots, woody bits, or damaged leaves from the cabbage. Wash cabbage well of any sand and dirt; allow to drain, but do not spin dry. Using a <a href=\"https://www.seriouseats.com/2018/06/the-best-chefs-knives.html\">chef's knife</a>, cut the cleaned radish greens and cabbage into 2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a very large bowl, lay down one layer of greens, then sprinkle a handful of salt on top. Repeat until all your greens have been layered with salt. (If you want to weigh the salt, you should use about 15% of the weight of the greens, though the amount of salt doesn’t need to be perfect, as it will be rinsed away soon. The more salt you use, the faster the greens will wilt, and vice versa.) Toss the leaves gently a couple of times; be careful not to bruise the leaves while tossing. Let stand at room temperature until wilted, 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse a piece of cabbage or kimchi and taste it. If you taste a little saltiness, it’s ready. The radish stems should also bend gently when you hold them upright, while still maintaining some crunch. Rinse the wilted greens gently in cold water and drain again.\r\n\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Meanwhile, Make the Seasoning Paste:</strong> Roughly chop the red and green chilies into 1/8-inch pieces. In a blender, purée chilies with onion, garlic, ginger, saewoojeot (if using), gochugaru (if using), and myeolchi aekjeot (if using) until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the room-temperature porridge into the chili-onion paste. If saewoojeot and myeolchi aekjeot have been omitted, season to taste with salt. Taste the paste; it should be about as salty as a well-seasoned soup, and no more so. Season with additional salt only if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make the Kimchi:</strong> Add the well-drained greens to a large fermentation crock or nonreactive container and pour the chili mixture over the top.\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 2 quarts (1.9L) water with enough salt to make a mild brine. If your chili paste was too salty, you should make a brine that tastes about as salty as tears (about 2% salt by weight); if your chili paste wasn’t salty enough, make your brine as salty as the ocean (about 3% salt by weight). Pour brine over greens and paste, then press greens down. There should be enough brine to cover all the greens; if not, make more brine and add it until there's enough to cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press greens down to fully submerge them, then seal with an airtight lid. You can use a plate, a fermentation weight, or plastic wrap to keep the greens submerged. What's important is that the greens are not exposed to the air."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the mixture to stand at room temperature until you begin to see signs of fermentation (a slightly funky smell and little bubbles of gas on top of the kimchi), about 1 day. Transfer to the refrigerator. You can start eating the kimchi right away, but it tastes best after about 7 to 10 days."}]}