{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20181102-Hobak-beombeok-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Seoyoung Jung"}, "recipeCuisine": "Korean", "keywords": ["Asian", "bean", "fall", "Korean", "squash", "sweet potato", "vegetarian", "winter", "winter squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "<i>Hobak Beombeok</i> (Korean Squash, Sweet Potato, and Bean Porridge)", "link": "https://www.seriouseats.com/recipes/2018/12/hobak-beombeok-korean-squash-sweet-potato-and-bean-porridge.html", "description": "This warming Korean porridge is a celebration of fall produce, and is loaded with winter squash, chestnuts, sweet potatoes, jujubes, and beans. The squash traditionally used is a large, old one called <em>neulgeun hobak</em> in Korean, but it can be difficult to find; butternut squash works well as a substitute. The porridge is delicious served hot on a winter day, but it can also be eaten at room temperature, and is equally flexible in terms of when it's eaten: it makes a great breakfast, lunch, dinner, or snack. Plus, it just happens to be vegan.", "totalTime": "2 hours 30 minutes plus overnight soaking", "recipeYield": "Makes 6 to 8 servings", "recipeCategory": ["Breakfast and Brunch", "Dairy-Free", "Fall", "Korean", "Mains", "Potato", "Pumpkin", "Snacks", "Squash", "Stovetop", "Sweet Potatoes and Yams", "Vegan", "Vegetarian", "Winter"], "recipeIngredient": ["1/3 cup (7 ounces; 200g) dried Korean <em>gangnang</em> beans or red kidney beans", "Kosher salt", "1/3 cup (7 ounces; 200g) dried red adzuki beans", "2 1/4 pounds (1kg) butternut squash or <em>neulgeun hobak</em> (Korean pumpkin), peeled, seeded, and cut into large chunks", "2 small (7 ounces; 200g) Korean white-fleshed sweet potatoes, cut into 1-inch chunks", "5 fresh chestnuts (4 1/2 ounces; 125g), peeled of shell and skin (you can also use pre-peeled chestnuts) and broken into small chunks", "5 dried jujubes (2 1/4 ounces; 65g), pit removed and flesh sliced lengthwise into thin strips (see note)", "1 cup (4 1/2 ounces; 130g) all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, cover gangnang (red kidney) beans with at least 2 inches lukewarm water. Stir in about 1 tablespoon salt per quart of water and let soak at least 8 hours at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain gangnang beans and add to a medium saucepan. Cover with at least 2 inches of fresh water, season with about 1 tablespoon salt per quart of water, and bring to a simmer. Cook until beans are just shy of being fully tender, about 30 minutes (cooking times for beans can vary widely, so check often). Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a second medium saucepan, cover adzuki beans with at least 2 inches of water. Bring to a boil, then cook for 2 minutes. Drain. Return adzuki beans to the saucepan, cover with at least 2 inches of fresh water, and season with about 1 tablespoon salt per quart of water. Bring to a boil, reduce heat to a gentle simmer, and cook until adzuki beans are just shy of being fully tender, about 30 minutes (again, bean cooking times can vary widely, so begin checking early, and continue to check often until the beans are almost fully cooked)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven or saucepan, combine squash with about 2 cups water. Bring to a simmer, cover, and cook until squash can be easily pierced by a fork with no resistance, about 25 minutes. Using a potato masher, whisk, or wooden spoon, mash squash to a chunky paste. If the squash is very dry, add more water 1/2 cup at a time to keep it slightly wet, like a loose porridge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain gangnang and adzuki beans and add to squash with sweet potatoes and chestnuts. Cover and cook at a gentle simmer, stirring occasionally and adding water when needed to maintain a moist cooking environment, until beans and potatoes are tender, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flour to a medium bowl. Slowly drizzle in 1 cup (235ml) water while mixing with your free hand. Dry and shaggy dough bits will form, with some dry flour remaining. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans and sweet potato are tender, adjust the porridge consistency once again by adding water, if necessary, to make it slightly wetter than a thick porridge consistency. Add as much of the shaggy dough bits and dry flour as desired to both thicken the porridge and create little balls of dough, simmering long enough to cook them through (you may not need to use all the flour mixture you've created). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If at this point you decide the porridge is too thin, simply cook it longer (or add more flour) to thicken it; if it is too thick, add more water a little at a time to thin it. Stir in jujubes, season with salt, and serve hot or at room temperature."}]}