{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20181115-how-to-serve-oysters-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "French", "keywords": ["black pepper", "champagne", "classic", "entertaining", "holiday entertaining", "oyster", "party", "pepper", "seafood", "shellfish", "vinegar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Mignonette", "link": "https://www.seriouseats.com/recipes/2018/12/classic-mignonette.html", "description": "Most recipes for classic mignonette don't give its the respect and attention they deserve. With a sharp knife, and a little attention to detail, you can raise the bar on this raw bar staple.", "totalTime": "45 minutes", "recipeYield": "Makes 1/2 cup", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Clams, Mussels, and Oysters", "Condiments and Sauces", "French", "New Year", "Onion", "Quick and Easy", "Recipes", "Vegetarian"], "recipeIngredient": ["2 large shallots", "1/2 cup (120ml) white wine vinegar (see note)", "4 teaspoons (12g) whole black peppercorns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small, sharp knife, trim shallot ends, leaving root end attached. Cut shallots in half, peel and discard skins. Using your hands, remove the core from each shallot half, leaving layered petals of shallot. Set cores aside for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut shallot petals into pieces that can lie flat on the cutting board, and position them vertically on the board, with root ends farthest from you. Starting with the tip of your knife just below the root end, slice shallot petals into thin strips from pole to pole, leaving them barely attached at root end."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rotate shallot petals 90 degrees and cut across the thin strips to make very finely diced pieces. Using bench scraper, transfer minced shallots to small bowl; discard root end scraps. Pour vinegar over shallots, and set bowl aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet over medium heat, toast peppercorns until fragrant and warm to the touch, shaking skillet occasionally to ensure that they toast evenly and don't burn, 1 to 2 minutes. Transfer peppercorns to small bowl and let them cool for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack peppercorns into rough halves and quarters. You can use a mortar and pestle; or a large mallet, meat pounder, or the bottom of a skillet or saucepan to crush them (doing this in a rimmed baking sheet, or wrapping the peppercorns in a clean kitchen towel, will help contain them)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cracked peppercorns to bowl with shallots and vinegar, and stir to combine. Cover bowl with plastic wrap, and let sit at room temperature for at least 30 minutes and up to 1 hour to allow flavors to marry. If you are not planning to serve immediately, transfer mignonette to the refrigerator, where it will keep for up to 3 days. Serve with oysters on the half-shell."}]}