{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180813-blueberry-swirl-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["dessert", "fruit", "gelato", "ice cream", "ribbon", "sauce", "syrup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fruit Syrup for Swirled Ice Cream", "link": "https://www.seriouseats.com/recipes/2018/08/fruit-syrup-for-swirled-ice-cream.html", "description": "With this technique, any high moisture fruit can be made into a thick and gooey syrup to ripple through your favorite ice cream. From a <a href=\"https://www.seriouseats.com/2018/06/toasted-oats-n-spice-make-oatmeal-cookie-ice-cream-so-nice.html\">toasted oat ice cream</a> swirled with cherries, to <a href=\"https://www.seriouseats.com/2018/07/move-over-dole-whip-theres-a-new-pineapple-ice-cream-in-town.html\">pineapple ice cream</a> with a blackberry ripple, the only limit is your imagination.", "totalTime": "45 minutes", "recipeYield": "Makes about 1/2 cup, enough to swirl with 1 quart ice cream", "recipeCategory": ["Fruit Desserts", "Gluten-Free", "Ice Cream and Frozen Treats", "Spring", "Stovetop", "Summer"], "recipeIngredient": ["8 ounces prepared fresh fruit, such as pitted cherries, peeled and cored pineapple, trimmed strawberries, or other berries; see note (volume will vary; about 225g)", "1 ounce lemon juice, or other acid, see note (about 2 tablespoons; 30g)", "6 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">lightly toasted</a> sugar, or semi-refined sugar (about 3/4 cup plus 2 tablespoons; 170g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/2 teaspoon orange blossom water, or other aromatics; see note"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine prepared fruit, lemon juice, sugar, and salt in a 2-quart stainless steel saucier. Make note of the filled saucier's weight at this stage so the reduction can be tracked on the scale; otherwise a digital thermometer will be required. Purée thick skinned or fibrous fruit with an immersion blender, or mash tender fruit with a fork or metal spatula until swimming in juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place over medium heat and bring to a boil, continuously stirring and scraping along the bottom and sides of the saucier with a flexible, heat-resistant spatula. This should take no longer than 5 minutes; if it seems to be moving too slowly, simply increase the heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the mixture begins to boil, continue cooking until reduced by 4 ounces (mixture should be 220&degF) for a thin, saucy ribbon or 5 ounces (224&deg;F) for a thick, gooey ribbon. This phase should take about 6 minutes; while it's natural for the timing to vary from one stovetop to the next, a significant delay may indicate the heat is too low, or that there's a problem with the thermometer (such as shallow or unsteady placement of the probe; also very common if tilting the pot to get a reading). When in doubt, weight measurements will provide a more reliable indication of the reduction's progress."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the syrup into a heat-safe container and stir in the orange blossom water (or other aromatics; see note). If desired, season with an additional pinch of salt, bearing in mind the syrup will seem less sweet when frozen. Cover and refrigerate until no warmer than 40°F (4°C). Meanwhile, take note that most ice creams will benefit from an extra pinch of salt in the base to account for the added sweetness of a fruit swirl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the syrup until viscous, then transfer to a disposable piping bag or use a spoon to drizzle. Layer the thick syrup into a chilled container with freshly churned ice cream, using as much or as little as you like. Freeze the ice cream according to the recipe directions. Any remaining syrup can be used as a sauce, or combined with club soda for a fizzy drink."}]}