{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/10/20181002-stuffed-pumpkins-vicky-wasik-41.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "French", "keywords": ["bread", "cheese", "Christmas", "fall", "holiday", "kale", "mushroom", "squash", "thanksgiving", "winter squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Thanksgiving Stuffed Roast Pumpkins", "link": "https://www.seriouseats.com/recipes/2018/10/stuffed-pumpkin-vegetarian-thanksgiving-main-recipe.html", "description": "Move over, tofurkey: These stuffed roast pumpkins give vegetarians a main course worthy of a place at the Thanksgiving table.", "totalTime": "2 hours", "recipeYield": "Makes 4 stuffed pumpkins, serving 8", "recipeCategory": ["American", "Baking", "Cheese", "Christmas", "Fall", "French", "Kale", "Mains", "Mushrooms", "Other Vegetables", "Pumpkin", "Roasting", "Squash", "Stovetop", "Thanksgiving", "Vegetarian", "Winter"], "recipeIngredient": ["<strong>For the Roasted Pumpkins and Squash:</strong>", "4 small sugar pumpkins (1 1/2 to 2 pounds each; 675 to 900g)", "1 large skin-on kabocha squash (about 2 pounds; 900g), halved and seeded", "Extra-virgin olive oil, for drizzling", "Kosher salt and freshly ground black pepper", "<strong>For the Mushroom and Kale Filling:</strong>", "2 tablespoons (30ml) extra-virgin olive oil", "1 pound (450g) shiitake mushrooms (or a mix of mushrooms, such as oyster, chanterelles, and beech), stemmed, cleaned, and thinly sliced (see note)", "Kosher salt and freshly ground black pepper", "8 ounces (225g) <em>lacinato</em> kale (a.k.a. dinosaur, Tuscan, or black kale), tough stems removed, leaves cut into 1-inch pieces", "4 tablespoons (60g) unsalted butter, cut into 4 pieces", "2 medium shallots, finely minced (about 1/2 cup; 80g)", "1 medium clove garlic, minced", "2 tablespoons chopped fresh thyme leaves", "1/4 cup (60ml) sherry", "1 tablespoon (15ml) sherry vinegar", "<strong>For the Spiced Cream:</strong>", "2 cups (475ml) heavy cream", "1 cup (240ml) whole milk", "1/2 teaspoon ground cinnamon", "1/2 teaspoon paprika", "1/4 teaspoon ground nutmeg", "1/4 teaspoon ground ginger", "Pinch ground cloves", "Kosher salt and freshly ground black pepper", "<strong>For the Glaze (optional):</strong>", "2 tablespoons (40g) red miso paste", "2 tablespoons (30ml) honey", "1 tablespoon (15ml) water", "<strong>To Finish:</strong>", "10 ounces (285g) high-quality rustic bread, cut into 3/4-inch dice and toasted until dry", "3/4 cup (120g) pepitas (shelled pumpkin seeds), toasted", "3/4 cup (90g) pecans, toasted and roughly chopped", "8 ounces (225g) shredded Gruyère cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Roast the Pumpkins and Squash:</strong> Adjust oven rack to center position and preheat to 350&deg;F (180&deg;C). Line a rimmed baking sheet with parchment paper. Working with one pumpkin at a time, use a sharp <a href=\"https://www.seriouseats.com/2016/10/the-best-paring-knives.html\">paring knife</a> to cut the top of the pumpkin off in one piece (as when making a jack-o'-lantern). Carefully run knife along the cavity of the pumpkin to loosen seeds and stringy pulp, then use a spoon to scoop them out and scrape the cavity clean. Using the paring knife, scrape seeds and pulp from the tops as well. Discard seeds and pulp or reserve for another use (try <a href=\"https://www.seriouseats.com/roundups/9-recipes-to-spice-up-your-roasted-pumpkin-seeds\">roasting the seeds with one of our seasoning combinations</a> for a snack). Repeat with remaining pumpkins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place kabocha squash halves cut side up on a work surface along with pumpkins. Lightly drizzle the cut and inner surfaces of kabocha squash, pumpkins, and pumpkin tops with olive oil, rubbing them with your hands to evenly coat. Season heavily with salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pumpkin tops on pumpkins, then set pumpkins on prepared baking sheet. Set kabocha squash, cut side down, on the same baking sheet. Roast until kabocha squash is tender and can easily be pierced with a paring knife, and sugar pumpkins have slightly softened, 45 minutes to 1 hour. Lift pumpkin tops from pumpkins to allow steam to escape and set all roasted squash aside to cool on baking sheet. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the kabocha squash is cool enough to handle, use a large spoon to scoop the flesh into a medium bowl and roughly mash with the back of the spoon. Discard squash skin. Season mashed squash with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Meanwhile, Make the Mushroom Filling:</strong> In a large 12-inch stainless steel or cast iron skillet, heat oil over medium-high heat until shimmering. Add mushrooms, season with salt and pepper, and cook, stirring frequently with a wooden spoon, until moisture has evaporated and mushrooms are well browned, about 10 minutes. Push mushrooms to outer edge of skillet, add kale to now-empty center of skillet, and cook, stirring frequently, until kale is slightly wilted and softened and has mixed with mushrooms, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push mushrooms and kale to outer edge of skillet and add butter to center of skillet. Once butter has melted and begun foaming, add shallots, garlic, and thyme to center of skillet and cook, stirring constantly, until fragrant, about 30 seconds. Add sherry and sherry vinegar and stir to combine. Season with salt and pepper and transfer mixture to a heatproof medium bowl to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Make the Spiced Cream:</strong> After squashes have cooled and kabocha is mashed, whisk together cream, milk, cinnamon, paprika, nutmeg, ginger, and cloves in a large <a href=\"https://www.seriouseats.com/2017/10/best-liquid-measuring-cups-equipment-review.html\">liquid measuring cup</a>. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Make the Glaze (Optional):</strong> Whisk ingredients together in a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Stuff and Finish Pumpkins:</strong> Stuff pumpkins by evenly dividing and layering half the ingredients in the following order: mashed kabocha squash, bread, mushroom-kale mixture, pepitas, pecans, Gruyère, and spiced cream. Gently press mixture down with your hands, then repeat layering process with remaining half of stuffing ingredients. If glazing the pumpkins, use a pastry brush to paint glaze onto pumpkins and pumpkin tops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast pumpkins on baking sheet, without tops, until top layer of cheese is melted and lightly browned, and pumpkins are tender and easily pierced by a paring knife, 30 to 45 minutes. Set tops on pumpkins and continue roasting for 10 minutes longer. Remove pumpkins from oven and cool on baking sheet for 5 minutes. Using a large spatula, carefully transfer pumpkins to a serving platter. Serve immediately."}]}