{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/recipes/images/2017/12/20171127-japanese-curry-vicky-wasik-17.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "chicken", "curry", "Japanese", "low carb", "rice", "spice", "stew", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Homemade Japanese Curry Rice (Kare Raisu)", "link": "https://www.seriouseats.com/recipes/2018/01/japanese-curry-kare.html", "description": "This recipe captures a classic Japanese curry, complete with juicy pieces of chicken, tender nubbins of carrot, sweet peas, and silky chunks of potato, but it's seasoned with a homemade spice blend that's way better than what comes out of a tin.", "totalTime": "2 hours", "recipeYield": "Serves 6", "recipeCategory": ["Chicken", "Fall", "Japanese", "Mains", "Rice", "Soups and Stews", "Stovetop", "Winter"], "recipeIngredient": ["<strong>For the Curry Spice Blend:</strong>", "2 tablespoons (7g) whole coriander seed, toasted in a dry skillet until fragrant", "1 tablespoon (6g) whole cumin seed, toasted in a dry skillet until fragrant", "1 tablespoon (6g) whole fenugreek seed, toasted in a dry skillet until fragrant", "2 1/2 teaspoons (6g) cardamom seeds, toasted in a dry skillet until fragrant (see note)", "2 teaspoons (5g) whole black peppercorns, toasted in a dry skillet until fragrant", "1/2 teaspoon (2g) fennel seed, toasted in a dry skillet until fragrant", "1 (2-inch) piece cinnamon (3g)", "3 cloves", "1/2 of a star anise pod", "1 or 2 strips (1g) dehydrated orange peel (optional; see note)", "2 tablespoons (16g) ground turmeric", "1/4 to 1/2 teaspoon (1 to 2g) chili powder, depending on the intensity of your chili powder and how spicy you want the curry", "Pinch grated fresh nutmeg", "<strong>For the Stew:</strong>", "1 pound (450g) boneless, skinless chicken thighs", "Kosher salt and freshly ground black pepper", "2 tablespoons (30ml) vegetable oil, plus more as needed", "1 large yellow onion (1 pound; 450g), diced", "8 ounces carrots (225g; about 3 medium), peeled and cut into 1/2-inch pieces", "1 quart (950ml) <a href=\"http://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade</a> chicken stock or store-bought low-sodium broth", "1 quart (950ml) <a href=\"http://www.seriouseats.com/recipes/2016/07/basic-japanese-dashi-recipe.html\">homemade</a> or <a href=\"https://www.amazon.com/Ajinomoto-Dashi-Soup-Stock-4-23/dp/B0002YB40O/?tag=serieats-20\">instant</a> dashi (see note)", "1 pound (450g) Yukon Gold potatoes, peeled and cut into 1-inch chunks", "Half of 1 (6-ounce) apple, peeled, cored, and finely grated, minced, or puréed", "1/2 cup unsalted butter (4 ounces; 110g)", "1/2 cup all-purpose flour (2 ounces; 55g)", "1 (2-inch) piece peeled fresh ginger, finely grated", "3 tablespoons (25g) Curry Spice Blend", "1 cup frozen peas (5.5 ounces; 160g), if desired", "Warm short-grain rice, for serving", "Pickled ginger and/or <em>rakkyo</em> (pickled Japanese scallion), for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Curry Spice Blend:</strong> In a spice grinder, combine coriander, cumin, fenugreek, cardamom, black peppercorns, fennel, cinnamon, cloves, star anise, and orange peel (if using) and grind to a fine powder. Empty into a small bowl and combine with turmeric, chili powder, and nutmeg, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Stew:</strong> Season chicken all over with salt and pepper. In a large Dutch oven, heat oil over medium-high heat until shimmering. Add chicken and cook, turning, until browned on both sides, about 6 minutes. Transfer chicken to a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion to Dutch oven, lower heat to medium-low, and cook, stirring, until golden, about 10 minutes. Add carrots and cook for 4 minutes. Add chicken stock and dashi and bring to a simmer over high heat; reduce heat to maintain a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut up chicken into bite-size pieces and add back to pot, along with any accumulated juices. Add potatoes and apple and cook at a gentle simmer until potatoes are tender and carrots can easily be pierced with a fork, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium saucepan, melt butter over medium heat until foaming. Stir in flour and cook, stirring, until roux is a deep caramel brown, about 20 minutes. Stir in ginger and 3 tablespoons (25g) Curry Spice Blend and cook for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape roux into stew pot, stir well, and simmer until broth has thickened. Season with salt and pepper. Stir in peas, if using, and cook until heated through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve curry with cooked rice and pickled ginger and/or rakkyo."}]}