{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/07/spanakopita.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["arugula", "dill", "feta", "greek", "greens", "olive oil", "parsley", "phyllo", "savory pie", "scallion", "spanakopita", "spinach", "spinach pie", "swiss chard", "vegetarian", "watercress"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "8"}, "name": "Spanakopita (Greek Savory Greens Pie)", "link": "https://www.seriouseats.com/recipes/2018/07/spanakopita-greek-savory-greens-pie.html", "description": "Spanakopita is a traditional Greek savory pie wrapped in flaky layers of crisp phyllo and filled with spinach and salty feta. For a twist on the classic, this version uses an assortment of greens and tender herbs in addition to spinach.", "totalTime": "1 hour 30 minutes", "recipeYield": "Make one (9-inch) pie", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Baking", "Cheese", "Christmas", "Eggs", "Leafy Greens", "Mains", "Spinach", "Vegetables", "Vegetarian"], "recipeIngredient": ["8 cups chopped mixed greens and tender stems, gently packed (about 12 1/2 ounces; 350g), such as spinach, watercress, arugula, and Swiss chard", "1 cup chopped mixed tender herbs and tender stems (about 2 ounces; 60g), such as dill, parsley, chervil, and chives", "1/4 cup extra-virgin olive oil (2 ounces; 50g), plus more", "1 1/2 teaspoons (6g) kosher salt", "1/2 teaspoon freshly ground black pepper", "3 sliced scallions, both white and green parts (about 2 ounces; 60g)", "2 cloves (10g) garlic, sliced ", "2/3 cup <em><a href=\"https://www.amazon.com/dp/B005PQMUUC/?tag=serieats-20\">trahanas</a></em> (3 ounces; 90g); rice, barley, or couscous can substitute (see note)", "1 large egg", "1/2 pound (226g) Greek feta, crumbled", "6 sheets phyllo dough, thawed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Started:</strong> Adjust oven rack to lower-middle position. Preheat oven to 400&deg;F (200&deg;C). Brush a 9-inch glass pie plate (either deep-dish or standard size will work with this recipe) generously with olive oil and set on a parchment-lined rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Filling:</strong> In a large bowl, combine chopped greens, chopped herbs, 1/4 cup olive oil, salt, and black pepper. Massage together to gently wilt the greens, then set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small sauté pan over medium heat, add 1 tablespoon olive oil, scallions, and garlic and cook until wilted, about 5 minutes. Add the hot mixture to the greens and combine to further wilt the vegetables. Add the trahanas (or your substitute of choice) and egg and thoroughly combine. Once everything is well mixed, fold in the crumbled feta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Assemble the Pie:</strong> Unroll thawed phyllo and keep it covered with a moist kitchen towel while working. Working with 1 sheet at a time, lay phyllo so that it is centered in the pie pan with the excess draping over the rim and brush generously with about 1 tablespoon olive oil. Repeat with 3 more sheets of phyllo, each sheet placed perpendicular to the previous one, brushing with olive oil before adding the next. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add greens mixture to phyllo-lined pie. Fold excess phyllo over greens and drape remaining 2 sheets of phyllo over the top. Drizzle with more olive oil. Slice into portions using a serrated knife. Bake in preheated oven until golden brown, about 45 minutes. Allow to cool at least 15 minutes before serving. "}]}