{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/01/instantpotcream.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["cream", "dairy", "toasted cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Toasted Cream", "link": "https://www.seriouseats.com/recipes/2018/01/toasted-cream.html", "description": "Just like browning butter, browning cream, whether you're using a sous vide circulator or a pressure cooker, transforms the dairy's fresh, grassy flavors into nutty butterscotch and toffee.", "totalTime": "24 hours plus chilling time for sous vide; 2 hours 10 minutes plus chilling time for pressure cooker", "recipeYield": "Makes 1 pint (16 fluid ounces) browned cream", "recipeCategory": ["Condiments and Sauces", "Gluten-Free", "Pressure Cooker", "Sous Vide"], "recipeIngredient": ["1 pint heavy cream (16 fluid ounces; 473ml)", "1/4 teaspoon baking soda (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Cooking Sous Vide:</strong> Preheat a sous vide circulator to 180&deg;F (82&deg;C). In a medium bowl, whisk together cream and baking soda (if using). Place zipper-lock bags or vacuum bags in a tall pitcher or jar to stand them upright, then pour cream into bags. Remove air from zipper-lock bags using the <a href=\"http://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">water displacement method</a>, or use a vacuum sealer to seal vacuum bags. Cook for 24 hours. Remove bags of cream and chill in the refrigerator before using. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Cooking in a Pressure Cooker:</strong> In a medium bowl, whisk together cream and baking soda (if using). Divide cream between two 12-ounce Mason jars and screw on tops until just finger-tight. (If the tops are screwed on too tightly, they may break during cooking.) Insert steamer rack into pressure cooker and add 1 inch water. Place jars in pressure cooker, close, and bring to full pressure. Cook at full pressure for 2 hours. Remove cooker from heat and allow to depressurize naturally. Cool cream before using. "}]}