{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/04/20180411-chiffon-cake-vicky-wasik-25b.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "cake", "chantilly", "Chiffon", "dessert", "sponge", "vanilla", "whipped cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8", "ratingCount": "5"}, "name": "Classic Chiffon Cake With Vanilla Chantilly", "link": "https://www.seriouseats.com/recipes/2018/04/classic-chiffon-cake-with-vanilla-chantilly.html", "description": "Few cakes are as light as chiffon, a sponge cake as billowy and soft as its name suggests. It's similar to <a href=\"https://www.seriouseats.com/2016/05/how-to-make-easy-angel-food-cake.html\">angel food</a>, but with the added richness of yolk and a splash of oil. This recipe strays from the norm with club soda as the liquid component, infusing the batter with plenty of fizz, for a cake that bakes up extra fluffy and tender. Whether baked in layers or a traditional tube pan, chiffon is best served fresh, with plenty of berries and cream.", "totalTime": "3 hours", "recipeYield": "Makes one 10-inch tube cake, or two 8-inch layers", "recipeCategory": ["Baking", "Cakes", "Christmas", "Desserts", "Easter", "Father's Day", "Mother's Day", "Valentine's Day"], "recipeIngredient": ["<strong>For the Cake:</strong>", "About 8 ounces (225g) egg white, plus or minus 1/2 ounce (15g), from 6 to 8 large eggs", "10 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted</a> sugar (about 1 1/3 cups plus 1 tablespoon; 285g)", "3/4 ounce vanilla extract (about 4 1/2 teaspoons; 20g) ", "3/4 ounce fresh lemon juice (about 4 1/2 teaspoons; 20g) ", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "2 teaspoons baking powder", "About 4 ounces (115g) egg yolk, plus or minus 1/2 ounce (15g) from 6 to 8 large eggs", "4 ounces neutral oil, such as safflower (shy 1/2 cup; 115g)", "6 ounces cold seltzer or club soda, not tonic water (about 3/4 cup; 170g)", "9 ounces all-purpose flour, such as Gold Medal (about 2 cups, spooned; 255g)", "<strong>To Serve:</strong>", "5 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted </a> sugar (shy 3/4 cup; 140g)", "Heaping 1/8 teaspoon (0.6 g) Diamond Crystal kosher salt, or more to taste; for table salt, use about half as much by volume or the same weight", "16 ounces heavy cream (about 2 cups; 450g)", "2 1/2 teaspoons (12ml) vanilla extract", "Fresh fruit, sprinkles, <a href=\"https://www.amazon.com/India-Tree-Candied-Violet-Petals/dp/B0006GSXS4/?tag=serieats-20\">crystallized violets</a>, or other garnishes, as desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Cake:</strong> Adjust oven rack to lower-middle position and preheat to 350&deg;F. Combine egg whites, sugar, and vanilla extract in the bowl of a stand mixer fitted with the whisk attachment. Mix on low speed to loosen, about 1 minute, then increase speed to medium-low (4 on a KitchenAid) and whip 3 minutes; the whites will be dense and dark."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer still running, add lemon juice and salt. Immediately increase to medium (6 on a KitchenAid) and whip 3 minutes longer; the meringue will be thin but foamy. Add the baking powder and increase to medium-high (8 on a KitchenAid) and continue whipping until the meringue is glossy white and thick enough that you can see the pattern left by the wire whisk, but rather runny overall. This can take between 1 and 3 minutes, depending on the freshness of the whites and the horsepower of your mixer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk egg yolks, oil, club soda, and all-purpose flour together until smooth. Pour a third of the meringue into the yolk mixture, and gently whisk until homogenous and smooth. Pour in the remaining meringue, and fold with a flexible spatula until well combined, with a uniform color. Do not continue mixing any more than strictly necessary. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the soft batter into a 10-inch aluminum tube pan (do not butter or grease it in any way; do not use a nonstick pan), or two 8- by 3-inch anodized aluminum cake pans (do not line with parchment or use shallow pans). Bake until the cake is puffed, golden blonde, and firm to the touch, about 55 minutes for a 10-inch tube or 40 minutes for two 8-inch layers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the hot pan(s) upside down and cool until absolutely no trace of warmth remains, at least 2 hours. Slide an offset spatula around the sides of cake(s) to loosen. For a tube pan, remove the insert and then slide the spatula under the bottom as well. For the 8-inch cakes, stand the cake pan on its side, and slide an offset spatula between the cake and the side of the pan, and gently pull to loosen the cake from the bottom; rotate the pan and continue all the way around the edges. Proceed immediately to the next step, as the cakes will dry with exposure to air."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Serve: </strong> Combine sugar, salt, cream, and vanilla in the bowl of a stand mixer fitted with a whip attachment. Mix on low for a minute to help dissolve the sugar, then whip on medium-high until the cream can hold stiff peaks; about 4 minutes. Use as a frosting for the chiffon, or to serve in dollops alongside each slice, along with fresh fruit, sprinkles, candied flowers, or whatever toppings you prefer. Wrapped tightly in plastic, the frosted chiffon can be refrigerated up to 24 hours; return to room temperature before serving."}]}