{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/20180529-vegan-chocolate-chip-cookies-vicky-wasik-24.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "BraveTart", "chocolate", "coconut oil", "cookie", "dessert", "easy", "oat", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "5"}, "name": "Vegan Chocolate Chip Cookies", "link": "https://www.seriouseats.com/recipes/2018/06/vegan-chocolate-chip-cookies.html", "description": "These cookies are crisp around the edges and chewy in the middle, with a brown butter-like aroma thanks to some culinary slight of hand&mdash;the subtle use of <a href=\"https://www.amazon.com/Briess-Malt-Extract-Traditional-Dark/dp/B0038O5N66/?tag=serieats-20\">dry malt extract</a> and nutmeg to create some of the toasty, nutty flavors that traditional butter cookies develop as they brown. The result is a cookie that needs no disclaimer&mdash;it's not good for a vegan recipe, it's just plain good.", "totalTime": "1 hour", "recipeYield": "Makes 32 (3-inch) cookies", "recipeCategory": ["Baking", "Chocolate", "Cookies", "Dairy-Free", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Oat Slurry</strong>:", "1 1/2 ounces old fashioned rolled oats, not quick-cooking or instant (about 1/2 cup minus 2 1/2 teaspoons; 42g)", "3 ounces water (about 1/3 cup plus 1 tablespoon; 85g)", "<strong>For the Dough</strong>:", "8 ounces refined coconut oil, solid but creamy, about 70°F/21°C (1 rounded cup; 225g)", "12 ounces light brown sugar, see note (about 1 1/2 cups, gently packed; 340g)", "3 1/2 ounces white sugar, see note (about 1/2 cup; 100g)", "1/2 ounce vanilla extract (1 tablespoon; 15g)", "2 1/4 teaspoons (9g) Diamond Crystal kosher salt, plus more for sprinkling; for table salt, use about half as much by volume or the same weight", "1 1/2 teaspoons baking soda", "1/2 teaspoon baking powder", "1/8 teaspoon grated nutmeg", "2 ounces prepared oat slurry (about 1/4 cup; 55g)", "12 1/2 ounces all-purpose flour (about 2 3/4 cups, spooned; 355g), such as Gold Medal ", "1 1/4 ounces dry malt extract, such as <a href=\"https://www.amazon.com/gp/product/B0038O8LY2/?tag=serieats-20\">Briess sparkling amber</a> (about 1/4 cup; 35g)", "10 ounces dark chocolate, about 72% cocoa solids, see note (not commercial chips), roughly chopped (1 2/3 cups; 285g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Oat Slurry</strong>: In tall, narrow container just wide enough to accommodate the head of an immersion blender, combine rolled oats and water. Purée with an immersion blender until thick and smooth, then strain through a fine mesh strainer, pressing on the solids with a flexible spatula until they give up all their liquid. Discard the fibrous oat solids, and reserve 2 ounces of the thick and gooey purée to use as directed below. This should not be done in advance, as the oat slurry will continue to thicken and become unusable over time. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> Adjust oven rack to middle position and preheat to 350&deg;F (180&deg;C). Combine refined coconut oil, brown sugar, white sugar, vanilla, salt, baking soda, baking powder, and nutmeg in the bowl of a stand mixer fitted with a paddle attachment. Mix on low to moisten, then increase to medium and beat until light and fluffy, about 5 minutes, pausing to scrape the bowl and beater as needed along the way.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer still running, dribble in the prepared oat slurry and continue beating until smooth. Shut off the mixer, and scrape the bowl and beater. Meanwhile, sift the flour into a medium bowl, then add the dry malt extract and whisk to combine, about 1 minute (if this mixture is not homogenous, the cookies will have an irregular flavor and consistency, so take your time). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Resume mixing the slurry on low speed, then add the malt-flour all at once, followed by the chopped chocolate. Continue mixing only until well combined. Because coconut oil is solid below 76&deg;F, the dough will seem crumbly and dry; in a hot kitchen, the dough may seem wet or oily, instead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Portion the Dough:</strong> With a 2-tablespoon cookie scoop, divide the dough into about 32 pieces, firmly compressing each portion into the scoop with the palm of your hand or the edge of the bowl. Arrange on a parchment-lined aluminum baking sheet, leaving 2 inches between each. With the palm of your hand, gently press each portion to minimize its dome. This step is not meant to smash or flatten the cookie dough, but to create a slightly level surface. Sprinkle each with chopped chocolate and a pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Bake:</strong> Bake until the cookies are puffed and golden, but still quite steamy and soft in the middle, about 12 minutes. Due to the unique melting point of coconut oil, the cookies will seem doughy and raw in the middle, but they will become increasingly thick and firm as they cool. Cool directly on the baking sheet until the crumb is set, about 5 minutes. These cookies are best served fresh, or within 12 hours of baking, but leftovers can be kept in an airtight container at room temperature for up to 2 days."}]}