{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/07/20180611-crab-boil-vicky-wasik-10.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "American", "keywords": ["american", "boil", "crab", "Maryland", "seafood", "shellfish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Maryland Crab Feast", "link": "https://www.seriouseats.com/recipes/2018/07/maryland-crab-boil.html", "description": "Maryland blue crabs are easy to cook, and easy to eat (once you learn how). These basic instructions will help you get your crabs on the table. Just make sure to start with live blue crabs, still frisky enough to try to bite you&mdash;anything less vigorous should be avoided.", "totalTime": "About 30 minutes per batch", "recipeYield": "Depends on the number of crabs", "recipeCategory": ["American", "Gluten-Free", "Lobster and Crab", "Quick and Easy", "Stovetop"], "recipeIngredient": ["One or two (12-ounce) cans beer, such as a light American lager", "Distilled white or cider vinegar, as needed, plus more for serving", "Live Maryland blue crabs, as many as you want", "Old Bay or other similar seasoning mixture, as needed", "Drawn or melted butter, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough beer to the largest pot you own to reach a depth of roughly 1 inch. Pour in a generous splash of vinegar. The exact quantity isn't important; just give it a good little glug. (Note: You can also just use water to steam the crabs, if you want. The flavor difference will be subtle.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a steaming rack tall enough to stand higher than the liquid level in the pot. If you don't have one, try wadding aluminum foil into ropes to make a makeshift rack that will hold the crabs aloft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the crabs, a few at a time, generously sprinkling Old Bay all over them as you go. Add Old Bay to taste (the more you use, the spicier the crabs will be). If you can't fit all your crabs in the pot and/or can't fit a cover on the pot, you will have to steam them in batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set over high heat and bring to a boil. Cover pot and cook for 15 minutes. Check the crabs: They should be bright red and piping-hot when done. If they're not, cook for an additional 5 to 15 minutes, until crabs are bright red and no traces of blue remain. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove crabs and repeat with any remaining crabs. Serve with distilled vinegar and drawn butter on newspaper-covered tables. Sides like <a href=\"https://www.seriouseats.com/2013/07/the-food-lab-three-ways-to-grill-corn.html\">corn on the cob</a>, <a href=\"https://www.seriouseats.com/recipes/topics/meal/breads/quick-bread/cornbread\">cornbread</a>, and <a href=\"https://www.seriouseats.com/recipes/2013/07/creamy-cole-slaw.html\">coleslaw</a> are commonly served alongside."}]}