{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/07/20180620-japanese-breakfast-vicky-wasik-22.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": ["broil", "easy", "eggplant", "Japanese", "quick", "side"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Japanese-Style Broiled Eggplant With Bonito, Scallions, and Ginger", "link": "https://www.seriouseats.com/recipes/2018/07/japanese-style-broiled-eggplant-with-bonito-scallions-and-ginger.html", "description": "Sometimes seen as an in-season special at yakitori places, this eggplant dish is almost as good when made using the broiler as it is hot off a grill, since the charred skin will impart a little smokiness even if you aren't using charcoal. That quality in the eggplant is accentuated by the slightly smoky <em>katsuobushi</em>, or flakes of cured, smoked, and dried bonito, and offset by the sliced scallions and spicy grated ginger.", "totalTime": "15 minutes", "recipeYield": "Serves 2 as a side dish", "recipeCategory": ["Eggplant", "Japanese", "Quick and Easy", "Sides"], "recipeIngredient": ["2 whole Japanese eggplants or other slender eggplants (about 10 ounces total); see note", "2 scallions, white and light-green parts only, thinly sliced", "Small handful (about 5g) katsuobushi (Japanese dried-bonito flakes), preferably the larger, feathery flakes called <em>hanakatsuobushi</em>; see note", "One 1/2-inch knob ginger, peeled and grated", "Soy sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Prepare the Eggplant:</strong> Place oven rack in top position and preheat broiler. With the tip of a sharp knife, score the eggplants around their circumference at both the stem end and the globe end. Score the eggplants along their length 3 times. If you're using an eggplant that is slightly thicker than an inch (see note), score it 4 times along its length."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place eggplants on a wire rack set in a sheet pan. Broil until eggplant skin darkens and begins to char a bit, about 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rotate eggplants and cook the other side until skin has darkened and charred a bit all around and the flesh is giving but not mushy when you push on it with your finger, about 3 to 4 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove eggplants from oven and set aside until still warm but cool enough to handle (see note)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel eggplants, leaving stems attached, and cut each crosswise into 1/2-inch sections. Arrange on serving plates in a way that preserves the eggplants' natural shape, with the stem end at one end of the plate. Top with thinly sliced scallions and katsuobushi and place a small mound of grated ginger alongside. Serve with soy sauce on the side for each diner to pour over the eggplant, to taste."}]}