{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/07/20180706-succotash-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "American", "keywords": ["american", "bean", "corn", "native american", "squash", "stew", "summer", "summer squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Succotash (Corn, Bean, and Vegetable Stew)", "link": "https://www.seriouseats.com/recipes/2018/07/succotash-corn-bean-and-vegetable-stew.html", "description": "Succotash, a dish of corn cooked with beans, has deep Native American roots. Today the dish can contain any combination of vegetables, as long as the corn and beans remain prominent. The key is to get the best ingredients you can, and handle them correctly.", "totalTime": "1 hour", "recipeYield": "Serves 6 to 8", "recipeCategory": ["American", "Bacon", "Corn", "Fall", "Gluten-Free", "Onion", "Other Vegetables", "Sides", "Soups and Stews", "Squash", "Stovetop", "Summer", "Thanksgiving", "Zucchini"], "recipeIngredient": ["6 ounces (170g) Poblano peppers (about 3 small or 2 medium)", "1 ounce (30g) thinly sliced bacon", "6 tablespoons (90g) unsalted butter", "1 medium onion (about 6 ounces; 170g), finely diced", "2 medium cloves garlic, minced", "5 pounds fresh corn in the husk (about 6 to 7 ears), shucked, <a href=\"https://www.seriouseats.com/2017/08/how-to-buy-prep-cut-fresh-corn.html\">kernels cut and cobs scraped of any corn milk</a>", "One 6-ounce (170g) medium red (or orange or yellow) bell pepper, stemmed, seeded, and finely diced", "12 ounces (340g) summer squash (about 4 small yellow squash and/or zucchini), finely diced", "2 cups frozen and/or cooked fresh or dried beans (about 12 ounces; 340g), such as red kidney, cranberry, or lima (see note)", "1/2 cup (120ml) reserved bean-cooking water (if using canned beans, substitute plain water)", "Kosher salt and freshly ground black pepper", "Small handful fresh basil leaves, torn"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a broiler with the rack set in the highest position, or working directly over a gas flame, char Poblano peppers, rotating them frequently, until skin is blistered and black all over. Transfer to a heatproof bowl, cover with plastic, and let stand for 5 minutes. Using paper towels, rub charred skin off peppers. Stem and seed peppers, finely dice the flesh, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven, heat bacon over medium heat, stirring, until fat has rendered and bacon is beginning to brown, about 5 minutes. Add butter and stir until melted. Add onion and garlic and cook, stirring, until starting to soften, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add corn kernels and any corn milk you were able to express, along with bell pepper and summer squash. Cook, stirring, until vegetables have become tender, about 10 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in beans and reserved bean liquid (or water), as well as the reserved Poblano pepper. Season with salt and pepper. Continue cooking, stirring, until succotash is heated through and a buttery glaze coats the vegetables, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add basil leaves, remove from heat, and serve. Succotash can be refrigerated for up to 5 days. When ready to serve, you can rewarm it if desired, or serve it at room temperature."}]}