{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/06/20180626-semifreddo-vicky-wasik-12.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["dessert", "egg", "frozen", "honey", "no-churn", "semifreddo"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Honey Semifreddo (Frozen Italian Dessert)", "link": "https://www.seriouseats.com/recipes/2018/08/honey-semifreddo-frozen-italian-dessert.html", "description": "This six-ingredient semifreddo harnesses the power of a stand mixer to whip whole eggs, streamlining the process found in traditional recipes that whip the yolks and whites individually. It's a no-fuss approach to semifreddo, summer's best make-ahead dessert. Sweetened with honey alone, it has fresh and aromatic flavor that pairs beautifully with whatever seasonal fruits you have on hand.", "totalTime": "8 to 12 hours", "recipeYield": "Makes one 9-inch loaf (about 8 servings)", "recipeCategory": ["Easter", "Father's Day", "Fruit Desserts", "Gluten-Free", "Ice Cream and Frozen Treats", "Mother's Day", "Puddings and Custards", "Quick and Easy", "Valentine's Day"], "recipeIngredient": ["<Strong>For the Semifreddo: </strong>", "8 ounces heavy cream (about 1 cup; 225g)", "1 teaspoon vanilla extract", "1/4 teaspoon rose water", "4 large eggs (about 7 ounces; 200g)", "4 1/2 ounces honey (about 1/3 cup; 125g)", "1/4 teaspoon plus 1/8 teaspoon (1.5g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "<Strong>To Serve: </strong>", "Toppings such as sliced fruit, toasted nuts, cocoa nibs, or shaved chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<Strong>Getting Ready: </strong> Line an approximately 9- by 5-inch loaf pan with plastic wrap or parchment, so that the bottom and sides have been covered completely (plastic is the easier liner, but will give the semifreddo a wrinkled appearance; parchment takes a little more effort, but keeps the semifreddo smooth)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Next, prepare a hot water bath in a wide pot or large Dutch oven, with a thick ring of crumpled tinfoil set inside (the foil should be high enough to reach above the water level, so that it will later prevent the stand mixer bowl from touching the hot water and the bottom of the pot). If the stand mixer bowl has a metal foot, use a glass or ceramic bowl instead, in which case the foil ring is not needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<Strong>For the Semifreddo: </strong> Combine the cream, vanilla, and rose water in the bowl of a stand mixer fitted with a whisk attachment, and whip until stiff. The time will vary depending on the power of a given mixer, so keep a close eye on the process. Transfer to separate bowl or plate, then cover and refrigerate until needed. Rinse the stand mixer bowl and whisk, then wipe dry before re-using in step 5."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine eggs, honey, and salt in the bowl of a stand mixer (or in a glass or ceramic bowl, if the stand mixer bowl has a foot). Stir with a flexible spatula to combine. Place over the prepared water bath, so that the bowl does not touch the water, and adjust heat to maintain a gentle simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, stirring and scraping constantly with a flexible spatula, until warmed to 165°F, about 10 minutes in a stainless steel bowl, or about 15 if using glass or ceramic. If the process seems to be taking much longer, simply increase the heat; top the hot water bath up with more hot water if needed at any point. Once the mixture reaches 165°F, transfer to a stand mixer fitted with a whisk attachment. Whip on high speed until eggs are foamy, more than quadrupled in size, and thick enough to briefly mound up like soft-serve ice cream when dropped from the whisk, between 5 to 8 minutes, depending on the mixer's power. The bowl itself should also feel cool to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working by hand, gently whisk in half of the prepared whipped cream. Once smooth, add the remainder, whisk briefly, then fold with a flexible spatula until well combined. Scrape into the prepared loaf pan, cover tightly, and freeze until firm enough to slice, about 8 hours or to an internal temperature of 0°F."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<Strong>To Serve:</strong> Place a platter large enough to accommodate the loaf in the freezer until cold. Invert the semifreddo onto the chilled platter, using the plastic or parchment paper to pull it free. Leave the semifreddo covered, and return to the freezer until time for dessert. Then, tug loose the plastic or parchment, and top as desired with macerated fruit, toasted nuts, sauces, or whatever you prefer. Let the semifreddo stand a minute or two at room temperature, then slice with a chef's knife dipped or rinsed in hot water between each slice. Serve immediately."}]}