{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180808-strawberry-shortcake-ice-cream-bar-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["cereal", "coconut oil", "dessert", "freeze dried fruit", "frozen treat", "good humor", "ice cream", "ice cream bar", "meringue", "no-churn", "strawberry", "strawberry shortcake", "swiss meringue", "white chocolate"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade Strawberry Shortcake Ice Cream Bars", "link": "https://www.seriouseats.com/recipes/2018/09/homemade-strawberry-shortcake-ice-cream-bar-recipe.html", "description": "With swirls of fluffy no-churn ice cream in strawberry and vanilla, these creamy/crunchy ice cream bars are strawberry shortcake in frozen form.", "totalTime": "15 hours", "recipeYield": "Makes eight 1/2-cup bars or twelve 1/3-cup bars", "recipeCategory": ["Chocolate", "Easter", "Fruit Desserts", "Ice Cream and Frozen Treats", "Strawberry", "Summer"], "recipeIngredient": ["<strong>For the Fillings:</strong>", "3 ounces (85g) egg white, from about 3 large eggs", "3 3/4 ounces sugar (about 1/2 cup; 105g)", "1/8 teaspoon (0.5g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 ounce fresh lemon juice (about 1 1/2 teaspoons; 7g)", "8 ounces heavy cream (about 1 cup; 225g)", "3 ounces milk, any percentage will do (about 1/3 cup plus 1 tablespoon; 85g)", "1 1/2 ounces <a href=\"https://www.amazon.com/Mother-Earth-Products-Freeze-Strawberries/dp/B008479AT8/?tag=serieats-20\">freeze-dried strawberries</a>, ground to a fine powder in a <a href=\"https://www.seriouseats.com/2017/10/best-food-processor-equipment-review.html\">food processor</a> (volume will vary by brand; 42g)", "1/2 teaspoon rose water, such as Cortas or <a href=\"https://www.amazon.com/gp/product/B0792KXQ92/?tag=serieats-20\">Ziyad</a>", "1/4 teaspoon vanilla extract", "<strong>For the Shortcake Coating:</strong>", "8 ounces 30% white chocolate, such as <a href=\"https://www.amazon.com/Green-Blacks-Organic-Chocolate-Vanilla/dp/B01ARIXPRE/?tag=serieats-20\">Green & Black's</a> (about 1 1/3 cups; about 225g), finely chopped", "3 ounces refined coconut oil, such as <a href=\"https://www.amazon.com/gp/product/B00U1RKGOW/?tag=serieats-20\">BetterBody Foods</a> (shy 1/2 cup; about 85g)", "1/2 ounce <a href=\"https://www.amazon.com/Mother-Earth-Products-Freeze-Strawberries/dp/B008479AT8/?tag=serieats-20\">freeze-dried strawberries</a> (volume will vary by brand; 15g)", "2 ounces puffed-rice cereal, such as Rice Krispies (about 2 cups; about 55g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> Prepare a water bath in a wide pot, with a thick ring of crumpled tinfoil set inside to later prevent the bowl from touching the bottom of the pot or the water itself. Place over high heat until bubbling-hot, then adjust to maintain a gentle simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Fillings:</strong> Combine egg whites, sugar, salt, and lemon juice in the bowl of a stand mixer. Place over the water bath (the bowl should not touch the water). Cook, stirring and scraping continuously with a flexible spatula, until egg whites reach 165&deg;F (74&deg;C). This should take about 6 minutes in a metal bowl; if it takes substantially longer, it simply means the heat is too low. If the meringue cooks too fast or scrambles despite constant stirring, this will indicate the water has come to a boil, or that the water is able to touch the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mixture reaches 165&deg;F (74&deg;C), transfer to a stand mixer fitted with a whisk attachment and whip at high speed until the meringue is glossy, stiff, and thick, 3 to 5 minutes. (The timing will vary depending on the power of a given stand mixer.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once meringue is thick and stiff, whip cream to stiff peaks as well. This can be done in a separate bowl by hand or with a hand mixer, or in the original stand mixer bowl if the meringue is transferred to a second bowl (no need to wash the whisk attachment). Add milk to meringue and whisk to combine. Add whipped cream and continue whisking until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer 7 ounces (198g) of the mixture to a second bowl. (If you're measuring by volume, this will be slightly less than half of the mixture; trying to use cup measures for precision will only deflate the meringue.) To this second bowl, add the freeze-dried-strawberry powder and rose water and whisk until homogeneous and thick before transferring to a disposable pastry bag. Add vanilla to the unflavored mixture, whisk to combine, and transfer to another disposable pastry bag."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Forming the Ice Cream Bars:</strong> Place the popsicle molds on a scale. For large (1/2-cup) bars, fill each mold with about 1 ounce (28g) vanilla cream. For medium (1/3-cup) bars, fill each with about 3/4 ounce (21g). In the end, there will be a little vanilla cream left over, but don't use it up or snack on it, as it will be important later on. Use a butter knife or an extra popsicle stick to gently stir each half-filled pop to eliminate air pockets and ensure the cream makes full contact with the mold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For large (1/2-cup) bars, pipe about 1 ounce (28g) strawberry cream into the center of each vanilla cream&ndash;filled mold. For medium (1/3-cup) bars, pipe about 3/4 ounce (21g) strawberry cream into the center of each mold. Piping in the strawberry cream will cause the vanilla cream to rise up around it, filling the mold. Divide remaining strawberry and vanilla creams between the molds to ensure each one is completely full. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Level molds with an offset spatula so that the filling is flush with the top edge of the molds. Cover tightly with foil, then poke a popsicle stick into the center of each mold, pushing it deeply into the mold and leaving just a half inch or so free for the handle. Freeze the bars until rock-solid, about 12 hours. At the same time, freeze 2 parchment-lined plates or <dorado id=\"rimmed-quarter-sheet-tray\" class=\"text\">quarter-sheet pans</dorado> to hold the dipped bars later on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Unmold the Ice Cream Bars:</strong> Unmold the ice cream bars by rinsing or standing the molds in hot tap water for a few seconds. Remove foil and slide a small offset spatula between the ice cream and the mold to help; if the spatula won't slide in, rinse or stand the molds in hot water a few seconds longer. Gently wiggle the sticks until the popsicles slide free, then transfer to the chilled parchment-lined baking sheets or plates. Cover with plastic wrap and return ice cream bars to freezer until needed. (If this will be longer than 1 hour, be sure the bars are wrapped tightly to prevent odor absorption.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Shortcake Coating:</strong> If working with 1/3-cup molds, or an 8-inch-square pan of ice cream cut into bars (see note), the amount of topping will need to be doubled. Melt white chocolate over a water bath or in a microwave-safe bowl, using two or three 15-second bursts on normal power and stirring well between rounds. Add coconut oil and stir until fully melted and smooth; if any lumps refuse to melt, rewarm briefly and stir until they do. Pour white chocolate mixture into a jar or drinking glass that's just slightly wider and taller than the popsicle molds, stopping about 1 inch from the rim to prevent overflow. Cool to about 80&deg;F (27&deg;C). The time needed for cooling will vary with the starting temperature of the coconut oil and melted white chocolate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, grind freeze-dried strawberries into a fine powder. (If you like, <a href=\"https://www.seriouseats.com/2017/02/food-processor-cleaning-genius-tip.html\">cover the bowl with a sheet of plastic or parchment paper</a> before closing the lid to contain the fine dust.) Once strawberries are finely ground, add rice cereal to the bowl and pulse until roughly chopped and well coated in powdered strawberries, but not fully pulverized. When you're ready to proceed, transfer the mixture to an <dorado id=\"eighth-sheet-pan\" class=\"text\">eighth-sheet pan</dorado> or pie plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Finish the Bars: </strong> Set up a dipping station with the tray of ice cream bars on the left, the jar of white chocolate coating and tray of crumbs in the center, and the second chilled baking sheet or plate on the right. Working with one bar at a time, dip each bar into the white chocolate until fully or mostly coated. Allow excess to drip off, then immediately transfer to the tray of strawberry/cereal crumbs. Press bar firmly into crumbs, then flip and press to coat the other side. If needed, use a spoon to pack crumbs onto any uncoated areas. Transfer bar to chilled tray and repeat with remaining bars."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze bars until white chocolate has hardened, then transfer to an airtight container (such as a gallon-sized zip-top bag) and freeze up to 1 month."}]}