{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180410-chocolate-skillet-cake-vicky-wasik-27.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "cake", "cast iron", "chocolate", "dessert", "dutch cocoa", "easy", "ganache"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8421052631579", "ratingCount": "19"}, "name": "Chocolate Skillet Cake With Milk Chocolate Frosting", "link": "https://www.seriouseats.com/recipes/2018/05/chocolate-skillet-cake-with-milk-chocolate-ganache-frosting.html", "description": "This quick and easy chocolate cake is the ultimate weeknight dessert&mdash;the batter is made <em>and baked</em> right in a cast iron skillet, no whipping, creaming, or beating involved.", "totalTime": "3 hours", "recipeYield": "Makes one 10-inch cake, or 12 two-inch wedges", "recipeCategory": ["Baking", "Cakes", "Chocolate", "Father's Day", "Frosting", "Quick and Easy", "Stovetop", "Valentine's Day"], "recipeIngredient": ["<strong>For the Frosting:</strong>", "6 ounces finely chopped milk chocolate, between 25 and 48% cacao (about 1 cup, heaping; 170g); see our list of <a href=\"https://www.seriouseats.com/2018/05/the-best-milk-chocolate-for-baking-that-wont-break-the-bank.html\">recommended milk chocolates here</a> ", "8 ounces heavy cream (about 1 cup; 225g)", "Salt, to taste", "<strong>For the Cake:</strong>", "6 ounces unsalted butter (about 12 tablespoons; 170g)", "6 ounces black coffee, or hot tea such as Assam (about 3/4 cup; 170g)", "1 1/2 ounces Dutch cocoa, such as <dorado id=\"cacao-barry-cocoa-powder-100-cocoa-extra-brute-22-lb\" class=\"text\">Cacao Barry Extra Brute</dorado> (about 1/2 cup, spooned; 45g); see note", "3 ounces finely chopped dark chocolate, roughly 72% (about 1/2 cup, heaping; 85g); see our list of <a href=\"https://www.seriouseats.com/2018/04/6-supermarket-chocolate-bars-for-better-baking.html\">recommended dark chocolates here</a> ", "8 ounces light brown sugar (about 1 cup, packed; 225g)", "1/4 ounce vanilla extract (about 1 1/2 teaspoons; 7g)", "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "4 large eggs (about 7 ounces; 200g), straight from the fridge ", "4 1/2 ounces all-purpose flour, such as Gold Medal (about 1 cup, spooned; 125g)", "1 1/2 teaspoons baking soda"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Frosting:</strong> Add milk chocolate to a mixing bowl. In a 10-inch cast iron skillet, bring cream to a simmer over medium heat. When bubbling hard around the edges, pour over milk chocolate in bowl. Whisk by hand until smooth, stir in salt to taste, and set aside until no longer steaming, about 15 minutes, then cover and refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Cake:</strong> Adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). Combine butter and coffee or tea in the same 10-inch cast iron skillet as before (no need to wash or rinse). Warm over low heat until butter has melted, then remove from heat. Mix in cocoa and dark chocolate, followed by brown sugar, vanilla, and salt. Working gently to avoid splashes, whisk in eggs, followed by flour and baking soda. Continue whisking until smooth and well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place skillet in oven and bake until cake is firm, though your finger will still leave an impression in the puffy crust, about 30 minutes. The timing will vary depending on the skillet's gauge, but a toothpick inserted into the center should come away with a few crumbs still attached. Cool cake in skillet until no trace of warmth remains, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Finish:</strong> Vigorously stir milk chocolate ganache with a flexible spatula until it begins to thicken to a yogurt-like consistency that's a little looser than a buttercream. Scrape over the cooled cake and sculpt into swoops and swirls, using a small spoon or offset spatula. Enjoy immediately or leave at room temperature until ready to serve, up to 24 hours at cool room temperature. After cutting, wrap leftover slices individually and store at cool room temperature up to 2 days more."}]}