{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/01/TOUM.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Middle Eastern", "keywords": ["condiment", "dip", "garlic", "gluten free", "Lebanese", "low carb", "middle eastern", "sauce", "toum", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8", "ratingCount": "5"}, "name": "Traditional <em>Toum</em> (Lebanese Garlic Sauce)", "link": "https://www.seriouseats.com/recipes/2018/01/toum.html", "description": "<em>Toum</em> is both a sauce, a condiment, and a dip, loaded with pungent raw garlic, which gives it both its kick and the necessary emulsifiers to keep it stable. It's perfect for grilled meat and kebabs or as a bold (and egg-free) alternative to mayonnaise.", "totalTime": "20 minutes", "recipeYield": "Makes 1 quart", "recipeCategory": ["Condiments and Sauces", "Dairy-Free", "Garlic", "Gluten-Free", "Middle Eastern", "No-Cook", "Vegan", "Vegetarian"], "recipeIngredient": ["1 cup cloves garlic (4 1/2 ounces; 130g) ", "2 teaspoons Diamond Crystal kosher salt (for table salt, use 1 teaspoon)", "1/4 cup (60g) fresh juice from about 2 lemons, divided", "1/4 cup (60g) ice water, divided", "3 cups (600g) neutral oil, such as grapeseed or canola, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a paring knife, split each garlic clove in half lengthwise. With the tip of the knife, <a href=\"https://www.seriouseats.com/2018/08/what-is-a-garlic-germ-and-should-you-remove-it.html\">remove the germ from each garlic clove half</a>. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Food Processor Method:</strong> Place the de-germed garlic and kosher salt in the bowl of a food processor. Pulse garlic in short bursts, occasionally removing the lid to scrape down the sides of the bowl with a flexible rubber spatula, until finely minced. Add 1 tablespoon lemon juice and continue processing until a paste begins to form. Add another tablespoon lemon juice and process until completely smooth and slightly fluffy. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the food processor running, slowly drizzle in 1/2 cup oil in a very thin stream, followed by 1 tablespoon lemon juice. Repeat with another 1/2 cup oil and remaining 1 tablespoon lemon juice. Continue the process, alternating 1/2 cup oil and 1 tablespoon water, until all the oil and water have been incorporated. Transfer toum to a container and store in the fridge for up to 1 month. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Mortar and Pestle Method:</strong> Depending on the size of your mortar, you may need to make the recipe in smaller batches, halving or quartering the ingredient amounts. In the mortar, combine garlic and salt and grind until it becomes a smooth paste. Work oil into paste 1 teaspoon at a time. After adding 1 tablespoon oil, work in a few drops of lemon juice. Repeat until all the oil, lemon juice, and water have been incorporated."}]}