{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180323-tishpishti-2-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Cathy Barrow"}, "recipeCuisine": "Middle Eastern", "keywords": ["almond", "apple", "Bake", "baking", "cake", "dessert", "gluten free", "Jewish", "Sephardic", "walnut"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Apple-Ginger <em>Tishpishti</em> (Gluten-Free Almond and Walnut Cake)", "link": "https://www.seriouseats.com/recipes/2018/03/apple-ginger-tishpishti-gluten-free-almond-and-walnut-cake.html", "description": "This sweet, nutty gluten-free cake is inspired by a syrupy Sephardic sweet called <em>tishpishti</em>. Our version features almond flour and crushed walnuts, along with grated apple for extra tenderness. It gets moisture and additional sweetness from a brandy- and ginger-infused syrup.", "totalTime": "3 hours", "recipeYield": "Serves 12", "recipeCategory": ["Apple", "Baking", "Cakes", "Christmas", "Gluten-Free", "Kosher", "Middle Eastern", "Nuts", "Passover", "Thanksgiving"], "recipeIngredient": ["<strong>For the Syrup:</strong>", "1 cup sugar (7 ounces; 200g)", "1 1/2 cups unsweetened apple juice (12 ounces; 340g)", "2-inch piece ginger (2 ounces; 60g), unpeeled, cut in half lengthwise and smashed", "Zest from 1 medium lemon", "1 tablespoon fresh lemon juice (1/2 ounce; 14g), from about 1 lemon", "4 tablespoons Applejack brandy (2 ounces; 60g)", "<strong>For the Cake:</strong>", "4 large eggs (6.8 ounces; 190g)", "3/4 cup sugar (5 3/4 ounces; 160g)", "1 teaspoon (4g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same by weight", "1 cup vegetable oil (8 ounces; 220g), or any other neutral oil", "2 tablespoons freshly grated ginger (1 ounce; 30g)", "2 1/2 cups almond flour (8 ounces; 230g)", "1 1/2 cups finely chopped walnuts (6.2 ounces; 175g)", "2 teaspoons (6g) ground cinnamon", "1/4 teaspoon freshly grated nutmeg", "2 cups grated unpeeled Fuji apple (12 ounces; 340g), from about 2 medium apples"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> Adjust rack to lower-middle position and preheat oven to 350&deg;F (180&deg;C). Line a 9- by 13-inch anodized aluminum baking pan with parchment paper, covering bottom and long sides of pan. (It's all right to leave the short sides exposed.) Lightly grease pan with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Syrup:</strong> In a 2-quart nonreactive saucepan over medium-high heat, simmer together sugar, apple juice, ginger, and lemon peel until syrup reaches 234&deg;F (112&deg;C) on an instant-read thermometer. Remove syrup from heat and add lemon juice and Applejack. Set aside and allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Cake:</strong> In the bowl of a stand mixer, combine eggs, sugar, and salt. Using a whisk attachment, whip on high until eggs become thick, pale, and ribbon-y, about 10 minutes. With mixer running on medium, slowly drizzle in oil in a thin stream until fully incorporated and thick. Whisk in grated ginger, about 10 seconds, then shut off mixer and remove bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a flexible rubber spatula, fold in almond flour, walnuts, cinnamon, and nutmeg until combined. Fold in grated apple. Pour batter into prepared pan and gently tap on the counter to evenly distribute. Bake until golden brown and top of cake bounces back to the touch, about 50 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While cake is still warm, loosen exposed short sides of cake from pan using an offset spatula or butter knife. Using parchment paper as a handle, lift cake out of pan and onto a cutting board. Cut cake into diamond shapes by making a series of diagonal slices in one direction across the cake, then making another series of diagonal slices in the opposite direction. Lift sliced cake, again using parchment, and return to pan. Strain syrup over warm cake using a fine-mesh strainer, then let sit at least 1 hour to allow cake to fully absorb syrup. Serve."}]}