{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/images/20100712-sushi-maki-10.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Japanese", "keywords": ["Makizushi", "sushi"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Makizushi (Sushi Rolls) Recipe", "link": "https://www.seriouseats.com/recipes/2018/02/makizushi-sushi-rolls-recipe.html", "description": "", "totalTime": "30 minutes", "recipeYield": "8 hosomaki rolls or 4 futomaki rolls", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Fish", "Japanese", "Mains", "Other Seafood"], "recipeIngredient": ["4 nori sheets (0.4 ounce;11g)", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2010/07/sumeshi-vinegared-sushi-rice.html\">sumeshi</a> (vinegared sushi rice)", "10 ounces (280g) assorted fillings cut into long strips no more than 1/2 inch wide (raw salmon or tuna, cucumber, avocado, pickles, etc)", "wasabi, soy, and pickled ginger for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Over a gas flame or in a 400&deg;F (205&deg;C) oven, toast the nori sheets until pliable, about 5 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For Hosomaki Rolls</strong> (Thin rolls with 1 ingredient): Using kitchen shears or with a sharp knife on a cutting board, split the nori sheets evenly in half, cutting across the vertical lines that run along it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay 1 nori sheet on a bamboo mat lined up 1 inch away from the edge closest to you. Keep the shiny side of the nori facing down and the indentations running vertically. (For easier clean-up, cover the mat in plastic wrap.) Moisten your hands with water and gently spread about 1 cup (5.5 ounces;150g) of sumeshi evenly along the nori sheet, taking care not to compact the rice, and leaving a 1/2 inch boarder along the top and bottom of the nori sheet. Place your chosen filling along the lower third of the nori. Do not overstuff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For Futomaki Rolls</strong> (Larger rolls with 2 or more ingredients): Lay 1 full nori sheet on a bamboo mat lined up 1 inch away from the edge closest to you. Keep the shiny side of the nori facing down and the indentations running vertically. (For easier clean-up, cover the mat in plastic wrap.) Moisten your hands with water and gently spread about 2 cups (11 ounces;300g) of sumeshi evenly along the nori sheet, taking care not to compact the rice, and leaving a 2 inch boarder along the top edge. Place your chosen filings along the lower third of the nori. Do not overstuff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Roll Up the Makizushi:</strong> Slip your thumbs underneath the edge of the bamboo matt that's closest to you. Use your thumbs to lift the mat and flip the edge of the nori and rice over the filling, using your remaining fingers to press the filling toward you. Pull the mat foward, rolling the nori and rice around the filling. Dip a finger in water and run along the top exposed edge of the nori. Continue rolling to seal. Pull the matt over the roll and press gently to compress the roll. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a sharp knife, cut the roll in half crosswise, lay the two halfs next to each other and slice into six even pieces. Allow the roll to rest about 2 minutes before serving with soy, wasabi, and ginger, if desired."}]}