{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/20180425-artichoke-barigoule-vicky-wasik-19.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["artichoke", "braise", "French", "spring", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Classic Artichokes <em>à la Barigoule</em> (French Braised Artichokes With White Wine)", "link": "https://www.seriouseats.com/recipes/2018/05/classic-artichokes-a-la-barigoule-french-braised-artichokes-with-white-wine.html", "description": "Artichokes <em>à la barigoule</em> is one of the most famous springtime vegetable dishes from Provence, France. It's light and bright, with a clean yet comforting flavor, the result of braising artichokes and other vegetables in white wine with olive oil until soft and tender. While the dish is named for a variety of mushrooms, this particular recipe contains none&mdash;that's how it tends to be made today, and also likely how it was originally made (there was a period of time in between when the mushrooms were added to the dish).", "totalTime": "1 hour 20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Braising and Stewing", "French", "Other Vegetables", "Sides", "Spring", "Stovetop", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["4 large or 12 small artichokes (2 pounds; 1kg)", "3 tablespoons (45ml) extra-virgin olive oil", "1 medium (6-ounce; 170g) yellow onion, thinly sliced", "1 large (5-ounce; 140g) carrot, peeled and cut crosswise into thin rounds", "3 medium cloves garlic", "Kosher salt", "1 cup (235ml) dry white wine", "3/4 cup (175ml) <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium broth (or <a href=\"https://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable stock</a>, if desired)", "3 sprigs flat-leaf parsley, 2 sprigs thyme, 1 bay leaf, tied together into a bundle with kitchen twine", "1 tablespoon (15g) unsalted butter", "Freshly ground black pepper", "Large pinch minced flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with water; halve and squeeze 2 lemons into it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If using large artichokes:</strong> Clean them down to the hearts, following the <a href=\"http://www.seriouseats.com/2015/03/how-to-prepare-cut-trim-clean-artichokes-hearts.html\">guidelines shown here</a>. <strong>If using small artichokes:</strong> Trim artichokes following <a href=\"http://www.seriouseats.com/2015/03/how-to-prepare-cut-trim-clean-artichokes-hearts.html\">Roman-Jewish artichoke guidelines shown here</a>. Transfer cleaned artichokes to bowl of lemon water as you work, covering them with a clean kitchen towel to keep them completely submerged."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart sauté pan or saucier, heat olive oil over medium heat until shimmering. Add onion, carrot, and garlic, and cook, stirring frequently, until just starting to soften, about 4 minutes. Nestle cleaned artichokes and their stems on top, then add white wine and bring to a simmer; lower heat to maintain a gentle simmer and cook for 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock, season lightly with salt, and return to a simmer. Add herbs. Cover and cook at a gentle simmer until artichokes and other vegetables are tender enough to easily slide a fork through them, about 25 minutes (cooking time will vary depending on the age and size of artichokes; if liquid level ever gets too low, add a little more water)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard herb bundle. Using a slotted spoon, transfer artichokes, onions, carrots, and garlic, to a serving plate and keep warm. Return cooking liquid to the heat and simmer until slightly syrupy and reduced to about 3/4 cup (175ml)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in butter and minced parsley, season with salt and pepper, then pour sauce over warmed platter of vegetables. Serve warm or at room temperature."}]}