{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/01/20180117-pasta-con-sarde-sardines-vicky-wasik-32.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["anchovy", "fennel", "fish", "Italian", "pasta", "sardine", "sicilian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Pasta <em>Con le Sarde</em> (Sicilian Pasta With Sardines)", "link": "https://www.seriouseats.com/recipes/2018/04/pasta-pasta-con-le-sarde-sicilian-pasta-with-sardines.html", "description": "A classic pasta from Palermo in Siciliy, pasta <em>con le sard</em>e (pasta with sardines) is unlike just about any other Italian pasta dish. Heavily influenced by the cooking of Arabs that ruled Sicily more than a thousand years ago, it features long bucatini or spaghetti in a slick, luscious, and fragrant sauce made from onions, fennel, raisins, pine nuts, anchovies, sardines, and saffron. Instead of cheese, toasted and seasoned bread crumbs grace the plate.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Fish", "Italian", "Mains", "Other Vegetables", "Pasta", "Quick Dinners", "Stovetop"], "recipeIngredient": ["1/2 cup (120ml) dry white wine", "1 1/2 ounces (45g) golden raisins (about 1/4 cup)", "Pinch saffron, optional", "4 1/2 tablespoons (67ml) extra-virgin olive oil, divided, plus more as needed", "1/2 teaspoon ground fennel seed", "1 1/4 ounces (35g) panko bread crumbs (about 1/2 cup)", "Kosher salt and freshly ground black pepper", "1 cup minced peeled and cored fennel bulb (about half of one large 1 1/2-pound fennel bulb with fronds), fronds reserved", "1 cup minced yellow onion (about half of one large 1-pound onion)", "4 oil-packed anchovy fillets", "1 1/4 ounces (35g) pine nuts (about 1/4 cup), toasted", "5 whole sardines (about 3/4 pound/340g total), <a href=\"https://www.seriouseats.com/2018/04/how-to-clean-and-fillet-fresh-sardines.html\">filleted</a> and cut into 1-inch pieces", "1 pound (450g) bucatini or spaghetti"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a microwave-safe heatproof bowl, heat wine until steaming (alternatively, heat wine on the stovetop in a small saucepan). Add raisins and saffron, if using. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, heat 1 1/2 tablespoons (22ml) olive oil over medium-high heat until shimmering. Add ground fennel and cook until fragrant, about 20 seconds. Add bread crumbs and cook, tossing, until lightly toasted. Transfer breadcrumbs to a bowl and season well with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Mince half the fennel fronds and reserve the other half whole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet or sauté pan, heat remaining 3 tablespoons (45ml) olive oil over medium heat until shimmering. Add diced onion and diced fennel bulb and cook, stirring, until onion and fennel are soft and tender, about 8 minutes. Add anchovy fillets and cook, stirring, until dissolved in the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine, raisins, and saffron, and cook, scraping up any browned bits from bottom of pan, until wine is almost entirely evaporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pine nuts and sardines and cook, stirring, until sardines are just barely cooked through, about 2 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the pasta until al dente, then drain, reserving at least 1 cup pasta cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pasta to skillet along with 1/4 cup pasta cooking water. Return skillet to medium-high heat and cook, stirring and tossing, until pasta is well coated in sauce and any excess liquid has cooked off. Drizzle on some fresh olive oil (don't be shy) along with the minced fennel fronds, and toss well. Season with salt. Add a very small handful of bread crumbs and toss once more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If at any point the pasta becomes too dry, add additional pasta cooking water in 1/4-cup increments, and toss to loosen and moisten (you can also drizzle on more olive oil as desired). The noodles should be slick and glossy with a sheen of sauce, but not sitting in a watery puddle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta into serving bowls, making sure to distribute sardines, pine nuts, and raisins evenly. Top with a more generous handful of breadcrumbs. Garnish with whole fennel fronds and serve right away."}]}