{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/ChickenUnderBrick.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["chicken", "Italian", "roast", "roast chicken", "spatchcock"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Italian Roast Chicken Under a Brick (<em>Pollo al Mattone</em>)", "link": "https://www.seriouseats.com/recipes/2018/05/italian-roast-chicken-under-a-brick-pollo-al-mattone.html", "description": "Chicken under a brick (<em>pollo al mattone</em>) is a roast or grilled chicken method that delivers some of the crispiest skin ever, with an even shorter cooking time than a more traditional roast bird. This recipe works no matter what equipment you have at home.", "totalTime": "55 minutes, plus at least 30 minutes marinating time", "recipeYield": "Serves 4", "recipeCategory": ["Chicken", "Father's Day", "Gluten-Free", "Italian", "Mains", "Mother's Day", "Roasting", "Valentine's Day"], "recipeIngredient": ["1/2 cup (120ml) extra-virgin olive oil, plus more for drizzling", "Juice and zest of 1 lemon (about 2 tablespoons; 30ml juice), zest finely minced, plus lemon wedges for serving", "1 teaspoon red pepper flakes", "Needles from one 8-inch rosemary sprig, finely minced", "Leaves from 1 large sage sprig (about 8 leaves), finely minced", "4 medium cloves garlic, finely minced", "One 4- to 5-pound (1.8 to 2.3kg) chicken", "Kosher salt and freshly ground black pepper", "Cooking spray, such as Pam, or other neutral oil, for greasing the equipment"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, mix together olive oil, lemon juice and zest, red pepper flakes, rosemary, sage, and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using sharp <a href=\"https://www.seriouseats.com/2018/05/the-best-kitchen-shears.html\">kitchen shears</a> or <a href=\"https://www.seriouseats.com/2017/09/the-best-poultry-shears-kitchen-equipment-review.html\">poultry shears</a>, remove spine from chicken (reserve spine for <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">stock</a> or another use). Flatten chicken by placing it skin side up on a cutting board and applying firm pressure to the breastbone. Transfer to a baking dish, season all over with salt and pepper, add marinade, and rub all over chicken. Cover dish with plastic. Marinate, refrigerated, at least 30 minutes and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven, along with all cooking equipment for whichever setup you're using, including skillets, foil-wrapped bricks, chicken press, barbell weight, et cetera (see the \"Special Equipment\" section below for more info), to 475&deg;F (245&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape marinade and minced aromatics off chicken as best you can. Using cooking spray or oil, grease the interior of the bottom skillet/roasting vessel. Lay chicken down in skillet, skin side up, arranging it so that it lies flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using cooking spray or oil, grease the bottom of the top weight. (Depending on your setup, this could be one side of the foil-wrapped bricks, or the bottom of the second skillet or chicken-press weight.) Press the top weight down on the chicken, making sure it evenly covers it and is in contact with both the breast and the legs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to oven and cook until thickest part of breast, close to bone, registers 150&deg;F (66&deg;C) on an instant-read thermometer, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from oven, remove top weight, and let rest 5 to 10 minutes. Carve and serve with lemon wedges, drizzling fresh olive oil over chicken at the table."}]}