{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180216-bagna-cauda-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["anchovy", "crudite", "dip", "fish", "garlic", "hors d'oeuvre", "Italian", "Piedmont"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "<em>Bagna Càuda</em> (Northern Italian Anchovy-Garlic Dip)", "link": "https://www.seriouseats.com/recipes/2018/03/bagna-cauda-northern-italian-anchovy-garlic-dip.html", "description": "<em>Bagna càuda</em>, one of the classic dishes of the Piedmont region in northwestern Italy, is a potent dip made from warm olive oil loaded with tons of garlic and anchovies, all cooked together until melted down. Paired with a beautiful vegetable platter, it's the ultimate dip.", "totalTime": "1 hour", "recipeYield": "Makes about 1 cup", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "Condiments and Sauces", "Fall", "Fish", "Garlic", "Gluten-Free", "Italian", "Other Vegetables", "Snacks", "Stovetop", "Winter"], "recipeIngredient": ["1 head garlic, peeled (about 14 medium cloves; 60g once peeled)", "1 cup (235ml) milk or water (see note)", "1/2 cup (120ml) extra-virgin olive oil", "100g <a href=\"https://www.seriouseats.com/2015/09/how-to-buy-and-prepare-anchovies.html\">high-quality oil-packed anchovy fillets</a> (about 30 fillets)", "Assorted raw vegetables, such as radishes, cauliflower florets, cardoon stalks (trimmed of long fibers), bell peppers, endive leaves, and more, cut for dipping", "1 whole, skin-on yellow onion, roasted in a 400°F (200°C) oven until tender throughout, then peeled and cut for dipping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim garlic cloves; if desired, halve lengthwise and remove germ from center. (Very developed green germs can add a subtle bitterness to the sauce, though our tests with younger garlic showed no noticeable difference between batches made with and without a more beige germ.) Slice garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine garlic and milk or water, bring to a gentle simmer, and cook until garlic is soft, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain garlic well. Wipe out saucepan, then return garlic to saucepan and cover with olive oil. Cook over very low heat until garlic is very soft and can easily be smashed with a wooden spoon, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add anchovies and cook, stirring and smashing, until they have fully dissolved into the sauce. Continue smashing the garlic and anchovies until a thick purée forms. (If desired, you can very quickly purée the bagna càuda with an immersion blender to make an even smoother sauce.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot with raw vegetables and slices of roasted onion (if using)."}]}