{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/12/20181126-gingerbread-cookies-vicky-wasik-39.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "brown sugar", "cinnamon", "cookie", "eggless", "gingerbread", "molasses", "spice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "Gingerbread Cookies", "link": "https://www.seriouseats.com/recipes/2018/12/gingerbread-cookies.html", "description": "With bold spices and a delicate snap, these gingerbread cookies are the perfect holiday bite whether served plain and simple or with a thin layer of <a href=\"https://www.seriouseats.com/2016/12/decorating-cookies-with-royal-icing-tutorial.html\">royal icing</a> to garnish. A pinch of orange zest in the dough helps elevate the aroma of spices, adding to their complexity of flavor. For building a gingerbread house, it's best to start with a sturdier <a href=\"https://www.seriouseats.com/recipes/2016/10/construction-gingerbread-recipe.html\">construction-style recipe</a> that can offer more structural integrity. ", "totalTime": "About 2 hours", "recipeYield": "Makes about 5 dozen 2 1/2-inch rounds (yield will vary by cutter size and shape)", "recipeCategory": ["Baking", "Christmas", "Cookies", "Ginger", "Quick and Easy", "Winter"], "recipeIngredient": ["4 ounces unsalted butter, creamy and soft, about 68°F (about 8 tablespoons; 115g)", "4 ounces light brown sugar (about 1/2 cup, gently packed; 115g)", "4 ounces plain, unsulfured baking molasses, such as <a href=\"https://www.amazon.com/Golden-Barrel-Unsulphured-Barbados-molasses/dp/B0018G9QQO/?tag=serieats-20\">Golden Barrel</a> or <a href=\"https://www.amazon.com/Grandmas-Original-Molasses-12-Pack/dp/B07H9KXP9L/?tag=serieats-20\">Grandma's</a>, <a href=\"https://www.seriouseats.com/2017/02/what-is-blackstrap-molasses.html\">not blackstrap</a> (about 1/3 cup; 115g)", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "1/2 teaspoon orange zest", "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight salt", "1/2 teaspoon baking soda", "1 1/2 teaspoon ground ginger", "1 1/4 teaspoon ground cinnamon", "1/8 teaspoon ground cloves", "1/8 teaspoon ground coriander", "1/8 teaspoon freshly grated nutmeg", "A few cracks of medium-grind black pepper", "9 1/2 ounces low-protein all-purpose flour, such as Gold Medal, plus more for dusting (about 2 cups plus two tablespoons; 270g)", "<a href=\"https://www.seriouseats.com/2016/12/decorating-cookies-with-royal-icing-tutorial.html\">Royal Icing</a> to decorate, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine butter, brown sugar, molasses, vanilla extract, orange zest, ginger, cinnamon, salt, baking soda, cloves, coriander, nutmeg, and black pepper in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed to moisten, then increase to medium and beat until fluffy, soft, and light, about 5 minutes, pausing to scrape the bowl and beater about halfway through. In chilly winter months, this process may take longer (see our <a href=\"https://www.seriouseats.com/2018/01/how-to-troubleshoot-winter-baking-projects.html\">guide to winter baking</a> for more info)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce mixing speed to low and add the flour all at once; continue mixing until well combined. Scrape the bowl and beater well with a flexible spatula, then knead against the sides of the bowl to form a smooth ball. Divide in half and flatten into discs. If comfortable working with a soft dough, use immediately; if not, wrap in plastic and refrigerate until cool and firm (timing will vary depending on personal preference). If refrigerated for longer than a few hours, let the dough stand at room temperature until softened to about 70&deg;F before use, then knead on a bare, unfloured surface until pliable and smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to middle position and preheat oven to 350&deg;F. On a flour-dusted surface, roll a portion of dough into a 7-inch square. Sprinkle with flour, flip to sprinkle the other side, and continue roll until 1/8 inch thick, repositioning as needed to ensure the dough does not stick. After rolling, brush away the excess flour and slide an offset spatula under the dough to loosen before stamping into shapes with assorted cutters. Arrange cut-outs on a parchment-lined half-sheet pan, leaving at least 1/4 inch between each. Gather scraps, knead, re-roll, and cut as before (any scraps leftover from this second stage can be baked off to grind as cookie crumbs). Repeat with the remaining portion of dough. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the gingerbread until firm and dry to the touch, about 12 minutes, and cool to room temperature directly on the baking sheet. If you like, decorate as desired with royal icing, and dry completely before storage (this can take 12-24 hours depending on thickness of design, ambient humidity, and air flow). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With or without frosting, the gingerbread cookies will last up to 3 weeks at cool room temperature in an airtight container.\r\n"}]}