{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/20180411-oatmeal-ice-cream-vicky-wasik-1-2.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["brown sugar", "cinnamon stick", "cookie", "granola", "ice cream", "oat", "oat milk", "oatmeal", "oatmeal cookie", "rolled oat", "vanilla bean"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "Oatmeal Cookie Ice Cream", "link": "https://www.seriouseats.com/recipes/2018/06/oatmeal-cookie-ice-cream.html", "description": "This brown sugar ice cream is infused with a cinnamon stick, toasted oats, and a vanilla bean, then studded with crispy oat clusters, crunchy pecans, and chewy dried fruit. Tart cherries work especially well, but dried fruits such as cranberries and black mission figs work well too, so feel free to use whatever you like best. It's everything you love about oatmeal cookies in a scoop of homemade ice cream.", "totalTime": "18 hours", "recipeYield": "Makes about 1 quart", "recipeCategory": ["Cookies", "Father's Day", "Granola", "Ice Cream and Frozen Treats", "Puddings and Custards", "Valentine's Day"], "recipeIngredient": ["<Strong>For the Ice Cream:</strong>", "2 ounces old-fashioned rolled oats (about 1/2 cup; 55g), not quick-cooking or thick-cut", "12 ounces whole milk (about 1 1/2 cups; 340g)", "10 ounces heavy cream (about 1 1/4 cups; 285g)", "1 vanilla bean, split lengthwise (optional)", "1 cinnamon stick (optional)", "6 ounces light brown sugar (about 3/4 cup; 170g)", "4 ounces egg yolk (shy 1/2 cup; 115g), from about 7 large eggs", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon ground cinnamon", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "<Strong>For the Mix-Ins:</strong>", "1 ounce toasted pecan pieces (shy 1/4 cup; 30g), plus more for sprinkling", "1 1/2 ounces dried tart cherries (about 1/4 cup; 40g), plus more for sprinkling (see note if using other fruits)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart stainless steel saucier, toast rolled oats over medium-low heat until the grains are fragrant and lightly browned, about 8 minutes, shaking and swirling the pan continuously to prevent scorching. Off heat, add milk and cream, along with vanilla bean and cinnamon stick (if using). Cover and steep up to 4 hours at room temperature, then set aside vanilla bean and cinnamon stick to reserve for step 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine brown sugar, egg yolks, salt, and ground cinnamon in a medium bowl, then whisk in the oat-infused milk and return to the saucier. Cook over medium-low heat until warm to the touch, then increase heat to medium, stirring and scraping constantly with a flexible spatula, and cook until steaming-hot, about 8 minutes or to 155°F (68°C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour through a fine-mesh sieve into a large stainless steel bowl, pressing gently with a flexible spatula to release the liquid trapped in the oats. Add reserved vanilla bean and cinnamon stick (if using) to ice cream base, along with vanilla extract, then cover and refrigerate to continue infusing overnight, or until no warmer than 40°F (4°C). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat oven to 300&deg;F (150&deg;C). Transfer strained oats to a parchment-lined half-sheet pan. Bake, stirring frequently to promote even browning, until oats are dry to the touch and beginning to crisp but not yet hard or crunchy. Once cool, transfer to an airtight container and freeze until needed. At the same time, freeze a 1-quart container, such as a large yogurt tub or nonreactive loaf pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove vanilla bean and cinnamon stick (if using) from custard base, then churn in an ice cream machine according to manufacturer’s directions until custard looks fluffy and thick. Add toasted pecans and dried fruit, along with all but a handful of the prepared oat clusters, and churn only until well combined. With a flexible spatula, transfer ice cream to chilled container and sprinkle with reserved oat clusters, as well as additional toasted pecans and dried fruit to taste. Cover with plastic pressed directly against surface of ice cream, then seal with a lid or sheet of foil. Freeze until hard, then serve as desired."}]}