{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/07/20180702-peruvian-causa-vicky-wasik-22.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Latin American", "keywords": ["casserole", "chicken", "Latin American", "mashed potato", "Peruvian", "potato", "tuna"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "<em>Causa</em> (Peruvian Cold Mashed Potato Casserole With Tuna or Chicken)", "link": "https://www.seriouseats.com/recipes/2018/07/causa-peruvian-cold-mashed-potato-casserole-with-tuna-or-chicken.html", "description": "Causa is one of Peru's most popular dishes, a cold casserole that's part mashed potatoes, part potato salad, and part mayonnaise-y salad with a meat like tuna or chicken. It'd be the perfect American potluck dish, if Americans knew what it was.", "totalTime": "1 hour", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Fish", "Latin American", "Mashed Potatoes", "Potato", "Quick Dinners", "Sides", "Stovetop"], "recipeIngredient": ["4 1/4 pounds (2kg) Russet or Yukon Gold potatoes (about 6 Russets or 8 Yukon Golds)", "Frozen aji amarillo peppers or a jar of aji amarillo paste (see note)", "2/3 cup (160ml) vegetable or corn oil", "4 to 5 tablespoons (60 to 75ml) fresh lime juice from 2 limes", "Kosher salt", "Two 5-ounce (140g) cans tuna in olive oil, drained (or 10 ounces/280g shredded roast chicken meat)", "One-quarter of a 12-ounce white onion, finely minced (about 1/3 cup minced)", "1/2 cup <a href=\"https://www.seriouseats.com/recipes/2011/10/two-minute-mayonnaise.html\">homemade</a> or store-bought mayonnaise (4 ounces/110g), plus more if desired", "Diced poached shrimp, sliced avocado, pitted black olives, minced fresh herbs (such as chives), diced or thinly sliced seeded tomatoes, or other ingredients to garnish your causa"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, microwave, or boil the potatoes until you can slide a fork easily through them. Let cool just slightly, then scoop out the flesh and, using a ricer or food mill, mash the potatoes into a large heatproof mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, if using frozen aji amarillo peppers, in a medium saucepan, bring water to a boil. Add frozen peppers, remove from heat, and let steep 5 minutes. Stem and seed peppers (wear gloves if possible, as peppers are spicy), then blend the flesh without any additional liquid until a smooth and even paste forms. (Extra aji amarillo paste can be stored in the refrigerator with a layer of oil poured on top for up to 2 weeks)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3 tablespoons (45ml) homemade or store-bought aji amarillo paste to potatoes, along with the oil, and 4 tablespoons (60ml) lime juice. Season with salt. Fold together until evenly incorporated, then taste. Add the remaining 1 tablespoon (15ml) lime juice, if desired. Press plastic directly against the surface of the mashed potatoes and refrigerate until chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium mixing bowl, stir together tuna (or chicken), onion, and mayonnaise until evenly mixed. Season with salt. Keep chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to assemble, lay down an even roughly 1-inch layer of mashed potatoes in the bottom of a 2-quart casserole dish; alternatively, you can build the causa on individual serving plates using a ring mold to help form it into a neat cylinder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Next add a roughly 1-inch thick layer of the tuna or chicken salad. If adding other ingredients like diced, poached shrimp or diced avocado, layer them in either above or below the tuna or chicken salad."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with a final layer of the mashed potatoes. You can garnish the top of your causa with whatever you want, including pieces of black olive, sliced or diced tomato, fresh minced herbs, sliced or diced avocado, pieces of shrimp, et cetera."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep chilled until ready to serve. The causa in the casserole can be refrigerated overnight."}]}