{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/06/20180622-knafeh-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Middle Eastern", "keywords": ["cheese", "cheese pie", "dessert", "kadaifi", "kanafah", "kanafeh", "knafeh", "kunafa", "middle eastern desserts", "phyllo", "pistachio", "shredded phyllo", "syrup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Kanafeh (Middle Eastern Cheese and Phyllo Dessert)", "link": "https://www.seriouseats.com/recipes/2018/07/kanafeh-middle-eastern-cheese-and-phyllo-dessert.html", "description": "Crunchy shredded phyllo encases stretchy, gooey cheese in this traditional Middle Eastern dessert that's all about contrast. After baking up golden and crisp, the pastry is drenched in a floral rose and orange blossom syrup, which plays off the salty cheese and nutty pistachios, so it never gets too cloying. Don't worry if you can't find the traditional nabulsi or akkawi cheeses; stretchy mozzarella or cheese curds are a great substitute.", "totalTime": "1 hour", "recipeYield": "Makes one 10-inch pastry", "recipeCategory": ["Baking", "Cheese", "Middle Eastern", "Nuts", "Pastry", "Pies, Tarts, and Crumbles"], "recipeIngredient": ["8 ounces (225g) nabulsi, akkawi, or mozzarella cheese, roughly chopped or shredded", "2/3 cup (5 ounces; 140g) clotted cream, crème fraîche, or cream cheese", "1 pound (454g) shredded phyllo, thawed", "1 1/2 cups (12 ounces; 340g) ghee, melted", "1 1/2 cups (11.5 ounces; 320g) sugar", "2 tablespoons (1 ounce; 30g) lemon juice, from about 1 lemon", "1 teaspoon rose water", "1/2 teaspoon orange blossom water", "3/4 cup (3 ounces; 84g) chopped, toasted pistachios"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Started:</strong> Set the oven rack to the lower-middle position and preheat to 400&deg;F (204&deg;C). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make The Kanafeh:</strong> In a medium bowl, combine the cheese and clotted cream and set aside. With a serrated knife, slice the shredded phyllo crosswise into 1/4- to 1/2-inch lengths and transfer to a large bowl. Pour the melted ghee over the phyllo and, using your hands, toss and mix the phyllo with the ghee in a gentle rubbing motion to ensure that all the phyllo shreds are evenly coated, about 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer half the coated phyllo to a 10-inch cast iron skillet, evenly distributing it along the bottom of the pan. Use the bottom of a glass or measuring cup to firmly pack the phyllo, creating an even crust. Top this with the cheese mixture, spreading it evenly over the first phyllo layer and leaving a 1/2-inch border along the rim. Spread the remaining phyllo over the cheese and once again firmly pack it down. Bake in the preheated oven until deeply golden brown, about 40 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For The Syrup:</strong> Prepare the syrup while the kanafeh bakes. In a medium sauce pot, add the sugar, lemon juice, and 1 cup of water. Simmer until the syrup reaches 234&deg;F (112&deg;C), or when a small amount dropped into ice water forms a soft ball. Remove from heat and set aside to cool slightly. When the kanafeh is ready, finish the syrup by adding the rose and orange blossom waters. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Serve:</strong> After removing the kanafeh from the oven, immediately drizzle on about 1/3 of the syrup. Invert the pie onto a serving platter and drizzle with the remaining syrup. Sprinkle with chopped nuts and serve right away. "}]}