{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20181112-glazed-hasselback-butternut-squash-with-parmesan-breadcrumbs-overhead-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "", "keywords": ["butternut squash", "fall", "hassleback", "roasting", "side", "squash", "vegetarian", "winter", "winter squash"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3", "ratingCount": "1"}, "name": "Honey-Glazed Hasselback Butternut Squash With Parmesan Breadcrumbs", "link": "https://www.seriouseats.com/recipes/2018/11/honey-glazed-hasselback-butternut-squash-with-parmesan-breadcrumbs.html", "description": "Butternut squash is thinly sliced crosswise <em>a la</em> Swedish-style Hasselback potatoes, then roasted with a sweet and garlicky glaze and crunchy breadcrumb topping. It's a perfect fall and winter side dish.", "totalTime": "2 hours", "recipeYield": "Serves 8 as a side dish", "recipeCategory": ["Christmas", "Recipes", "Roasting", "Sides", "Squash", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["1 medium head garlic", "2 tablespoons (30ml) extra-virgin olive oil, divided", "2 medium butternut squash (about 2 1/2–pounds; 1kg each)", "Kosher salt and freshly ground black pepper", "1/4 cup (2 ounces; 55g) unsalted butter", "1 cup (12 ounces; 340g) honey", "1/4 cup (60ml) apple cider vinegar", "1 cup (1 3/4 ounces; 50g) panko breadcrumbs", "1/2 cup (1 3/4 ounces; 50g) freshly grated Parmigiano-Reggiano cheese", "1/4 cup (1 ounce; 30g) dried cranberries, chopped, plus more for garnish", "1/4 cup (1 ounce, 30 grams) chopped shelled pistachios, plus more for garnish", "1 large bunch sage (about 30 leaves)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425&deg;F (220&deg;C). Slice off the top 1/4 inch of the head of garlic, exposing the tops of the cloves. Peel off any excess papery skin but leave the head intact. Drizzle the top of the exposed garlic with 1 tablespoon (15ml) olive oil and wrap in foil. Place on a large rimmed baking sheet and roast until softened, about 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel the squash and cut in half lengthwise. Using a large spoon or ice cream scoop, scoop out the seeds and discard. Rub the squash all over with the remaining 1 tablespoon (15ml) oil and season generously with salt and pepper. Add the squash, cut side down, to the same rimmed baking sheet as the garlic and roast until beginning to soften, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the squash roasts, prepare the glaze. In a small saucepan, combine butter, honey, and cider vinegar. Bring to a simmer over medium heat, then reduce heat to low. When the garlic has finished roasting, squeeze the roasted cloves out of their skins into the glaze. Gently mash the garlic into the glaze with a wooden spoon. Continue to cook until the glaze is thick enough to lightly coat the back of a spoon, about 5 more longer. Keep the glaze warm over very low heat until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working one at a time, transfer a roasted squash half to a cutting board and place a wooden spoon on each side to act as stopping points for the knife. Carefully cut thin, vertical crosswise slits in the squash, each about 1/8 inch apart; none of the cuts should go fully through the squash. Carefully transfer the sliced squash half back to the baking sheet, scored side up, and repeat with the remaining butternut squash halves. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tuck the sage leaves in between some of the slits in the squash, using about 6 leaves per squash half. In a small bowl, combine the bread crumbs, Parmesan cheese, dried cranberries, and chopped pistachios. Brush the squash halves generously with all of the honey glaze, allowing some to drip down between the slits, and then top with the breadcrumb mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until squash if soft enough to pierce with a fork and beginning to crisp on top, about 30 minutes. Garnish with additional cranberries, pistachios, and sage leaves, then serve."}]}