{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180807-buttermilk-ice-cream-blueberry-swirl-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["buttermilk", "cornstarch", "custard", "frozen dessert", "ice cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Buttermilk Ice Cream", "link": "https://www.seriouseats.com/recipes/2018/08/buttermilk-ice-cream.html", "description": "This recipe channels the light and tangy flavor of buttermilk into a silky smooth ice cream that's tart and refreshing enough enjoy all on its own, and the perfect counterpoint to the best seasonal fruit. It's particularly nice when paired with <a href=\"https://www.seriouseats.com/2018/08/how-to-make-a-fresh-fruit-swirl-for-ice-cream.html\">a fresh fruit swirl</a>, or a slice of warm cornbread for a sweet and savory dessert.", "totalTime": "5 hours", "recipeYield": "Makes about six 1/2-cup servings", "recipeCategory": ["Fruit Desserts", "Ice Cream and Frozen Treats", "Puddings and Custards", "Spring", "Valentine's Day", "Winter"], "recipeIngredient": ["7 ounces plain or <a href=\"https://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">lightly toasted</a> sugar (about 1 cup; 200g)", "3/4 ounce cornstarch (about 3 tablespoons; 20g)", "1/8 teaspoon (0.5g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "2 large eggs (about 3 1/2 ounces; 100g)", "10 ounces cultured, lowfat buttermilk (about 1 1/4 cups; 285g)", "8 ounces heavy cream, straight from the fridge (about 1 cup; 225g)", "1/2 ounce apple brandy, or other fruity spirits (about 1 tablespoon; 15g), optional", "1/4 teaspoon orange blossom water, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart stainless steel saucier, whisk together sugar, cornstarch, salt, and eggs, followed by the buttermilk. Cook over medium-low heat, whisking constantly but gently, until warm, about 3 minutes. Increase heat to medium and continue whisking until thick and steaming hot, about 3 minutes longer. When the custard begins to bubble, set a timer and continue whisking for exactly 1 minute to neutralize a starch-dissolving enzyme found in egg yolks. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain into a non-reactive container, then whisk in cream, brandy, and orange blossom water, if using. Season to taste with additional salt, if needed. Cover and refrigerate until no warmer than 40&deg;F (4&deg;C), or cool to the same temperature in an ice bath. Meanwhile, place a 1-quart container and flexible spatula in the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Churn the chilled base in an ice cream maker according to the manufacturer’s directions, until fluffy and thick enough to gather in the dasher (about 30 minutes, but the timing will vary depending on the type of machine). When the ice cream is ready, shut off the machine and, using the chilled spatula, scrape into the chilled container. Enjoy as soft-serve, or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until firm enough to scoop, about 4 hours."}]}