{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20181025-roast-beef-vicky-wasik-41.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "British", "keywords": ["beef", "beef stock", "holiday", "jus", "reverse sear", "roast beef", "shallot", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Tri-Tip Beef Roast With Shallot <em>Jus</em>", "link": "https://www.seriouseats.com/recipes/2018/11/tri-tip-roast-beef-recipe.html", "description": "Using the reverse-sear method, you can turn the underappreciated tri-tip into a special-occasion beef roast, without breaking the bank.", "totalTime": "2 hours, plus up to 32 hours resting time (see note)", "recipeYield": "Serves 4 to 6", "recipeCategory": ["American", "Beef", "British", "Christmas", "Fall", "Father's Day", "Mains", "Other Vegetables", "Recipes", "Roasting", "Stovetop", "Winter"], "recipeIngredient": ["1 whole tri-tip roast, about 2 1/2 pounds (1.1kg)", "Kosher salt and freshly ground black pepper", "1 quart (950ml) <a href=\"https://www.seriouseats.com/recipes/2018/11/pressure-cooker-beef-stock.html\">beef stock</a> or <a href=\"https://www.seriouseats.com/recipes/2018/11/pressure-cooker-beef-stock-2.html\">brown chicken stock</a> (see note)", "1 1/4 cups (300ml) red wine, divided", "2 tablespoons (30ml) vegetable oil", "1 pound (450g) shallots, thinly sliced", "1 tablespoon (15ml) soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>The Day Before Roasting:</strong> Using butcher's twine, tie tri-tip at 1-inch intervals using <a href=\"https://www.seriouseats.com/2014/12/how-to-tie-a-butchers-knot.html\">butcher's knots</a>. Season generously with salt and pepper. Transfer to a wire rack set in a foil-lined rimmed baking sheet and refrigerate, uncovered, at least overnight and up to 2 nights."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>When Ready to Cook:</strong> Adjust oven rack to center position and preheat oven to 225&deg;F (105&deg;C). Place baking sheet with rack and tri-tip in oven and roast until internal temperature registers 115&deg;F (46&deg;C) on an <dorado id=\"thermoworks-thermapen\" class=\"text\">instant-read thermometer</dorado> at the tri-tip's thickest point, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a 3-quart stainless steel saucier, combine stock and 1 cup (240ml) red wine over medium-high heat. Bring to a boil over medium-high heat, then reduce to a simmer. Simmer, occasionally scraping down sides of saucier with a rubber spatula, until mixture thickens slightly and is reduced to 2 cups (475ml), 15 to 20 minutes. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before tri-tip comes out of the oven, add oil to a 12-inch cast iron, carbon steel, or heavy stainless steel skillet and heat over high heat until smoking. Add tri-tip to skillet and cook, using a small cast iron skillet or weight to press down on tri-tip for even browning. If the beef begins to char or the skillet begins smoking aggressively, reduce heat to medium-high. Cook until tri-tip is evenly browned on all sides and internal temperature registers 130&deg;F (54&deg;C), about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer tri-tip to a cutting board and allow to rest for 5 to 10 minutes. Meanwhile, add shallots to now-empty skillet, season lightly with salt and pepper, and cook, stirring frequently, until shallots are softened and lightly browned, about 6 minutes. Add remaining 1/4 cup (60ml) red wine to skillet and use a wooden spoon or rubber spatula to scrape up any browned bits from the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer shallot mixture to saucier with reduced stock and red wine mixture and stir to combine. Bring jus to a simmer over high heat and stir in soy sauce. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut and remove twine from tri-tip, then cut into 1/4- to 1/2-inch-thick slices if you are serving the beef as a main course. Slice into thin, 2-inch-wide pieces if you plan to serve the beef in sandwiches. Serve right away, passing shallot jus at the table."}]}