{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/20180425-artichoke-barigoule-vicky-wasik-18.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["artichoke", "braise", "French", "mushroom", "spring"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Old-Fashioned Artichokes <em>à la Barigoule</em> With Mushrooms", "link": "https://www.seriouseats.com/recipes/2018/05/old-fashioned-artichokes-a-la-barigoule-with-mushrooms.html", "description": "Artichokes <em>à la barigoule</em> is one of the most famous springtime vegetable dishes from Provence, France. It's most commonly made by braising artichokes in white wine and olive oil without the mushrooms and pork used in this version, but about a century ago, this richer, deeper approach was more common. Both versions of the recipe are delicious, it just depends which one you're in the mood for.", "totalTime": "2 hours", "recipeYield": "Serves 4", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Braising and Stewing", "French", "Mushrooms", "Other Vegetables", "Sides", "Spring", "Stovetop", "Valentine's Day"], "recipeIngredient": ["<strong>For the Mushroom Duxelles Filling:</strong>", "4 tablespoons (60g) unsalted butter", "1 small yellow onion or 2 medium shallots (about 4 ounces; 115g), minced", "1 1/4 pounds (565g) cremini mushrooms, stemmed and finely minced (or processed in a food processor)", "2 tablespoons minced flat-leaf parsley", "Pinch freshly grated nutmeg", "Kosher salt and freshly ground black pepper", "<strong>For the Artichokes:</strong>", "2 lemons, halved", "4 large or 12 small artichokes (2 pounds; 1kg)", "6 paper-thin slices pancetta plus 2 ounces diced pancetta (55g)", "1 tablespoon (15ml) extra-virgin olive oil", "1 medium (6-ounce; 170g) yellow onion,  thinly sliced", "1 large (5-ounce; 140g) carrot, peeled and cut crosswise into thin rounds", "3 medium cloves garlic", "1 cup (235ml) dry white wine", "3/4 cup (175ml) <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or low-sodium broth (or <a href=\"https://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable stock</a>, if desired)", "3 sprigs flat-leaf parsley, 2 sprigs thyme, 1 bay leaf, tied together into a bundle with kitchen twine", "1 tablespoon (15g) unsalted butter", "Freshly ground black pepper", "Large pinch minced flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Mushroom Duxelles Filling:</strong> Heat butter in a medium saucepan over medium-high heat until foaming. Add onion (or shallots) and cook, stirring, until tender, about 3 minutes. Add mushrooms and cook, stirring, until water has released and evaporated, about 3 minutes. Continue to cook mushrooms, scraping up browned bits from bottom frequently, until darkened and fragrant, about 8 minutes. Stir in parsley and nutmeg, season with salt and pepper, and cook mushroom duxelles for 1 minute longer. Set aside, pressing plastic wrap against the surface to keep it from drying out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Artichokes:</strong> Fill a large bowl with water; halve and squeeze 2 lemons into it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If using large artichokes:</strong> Clean them down to the hearts, following the <a href=\"http://www.seriouseats.com/2015/03/how-to-prepare-cut-trim-clean-artichokes-hearts.html\">guidelines shown here</a>. <strong>If using small artichokes:</strong> Trim artichokes following <a href=\"http://www.seriouseats.com/2015/03/how-to-prepare-cut-trim-clean-artichokes-hearts.html\">Roman-Jewish artichoke guidelines shown here</a>. Transfer cleaned artichokes to bowl of lemon water as you work, covering them with a clean kitchen towel to keep them completely submerged."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain artichokes. Using a spoon, stuff each artichoke with as much mushroom filling as will fit. Cut pancetta into strips just large enough to cover the top (mushroom-stuffed) side of each artichoke and lay them on top so that the mushroom filling is well covered; you may have some pancetta unused. Tie with kitchen twine to secure the pancetta. (Reserve any unused mushrooms duxelles for another use, such as a layer on a sandwich.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart sauté pan or saucier, combine diced pancetta and olive oil and heat over medium heat. Cook, stirring, until pancetta has rendered some of its fat and is beginning to brown lightly, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion, carrot, and garlic, and cook, stirring frequently, until just starting to soften, about 4 minutes. Nestle stuffed artichokes and their stems on top, then add white wine and bring to a simmer; lower heat to maintain a gentle simmer and cook for 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock, season lightly with salt, and return to a simmer. Add herbs. Cover and cook at a gentle simmer until artichokes and other vegetables are tender enough to easily slide a fork through them, about 25 minutes (cooking time will vary depending on the age and size of artichokes; if liquid level ever gets too low, add a little more water)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard herb bundle. Using a slotted spoon, transfer artichokes, onions, carrots, and garlic, to a serving plate and keep warm. Return cooking liquid to the heat and simmer until slightly syrupy and reduced to about 3/4 cup (175ml). Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove twine from artichokes, being careful to leave pancetta and mushroom stuffing in place. In a 10-inch nonstick skillet, sear artichokes over medium-high heat, pancetta side down, until pancetta is browned and crispy. Return to serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk butter and minced parsley into reduced cooking liquid, season with salt and pepper, then pour sauce over warmed platter of vegetables. Serve warm or at room temperature."}]}