{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/09/20180827-curried-eggplant-MHT-12.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Indian", "keywords": ["easy", "eggplant", "Indian", "side", "spice", "vegetarian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "6"}, "name": "Spiced Eggplant With Tomato and Mustard Seeds", "link": "https://www.seriouseats.com/recipes/2018/09/spiced-eggplant-tomato-mustard-seed-side-dish-recipe.html", "description": "Spices, tomato, and mustard give this easy vegetarian eggplant dish heat and zing.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 as a side", "recipeCategory": ["Baking", "Eggplant", "Gluten-Free", "Indian", "Sides", "Summer", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["2 pounds (about 900g) baby eggplant or Japanese eggplant", "2 tablespoons plus 1 teaspoon (30g) kosher salt, divided ", "1/4 cup ghee, butter, or coconut oil; either refined or virgin coconut oil is fine (2 ounces; 55g)", "1 teaspoon black mustard seeds", "1 teaspoon cumin seeds", "1/2 teaspoon turmeric", "2 teaspoons <a href=\"https://www.amazon.com/dp/B00MYRUYAI/?tag=serieats-20\">Kashmiri red chili powder</a> (or 1 teaspoon cayenne)", "3 tablespoons tomato paste (1 1/2 ounces; 45g)", "1 tablespoon light brown sugar", "1 tablespoon distilled white vinegar", "2 teaspoons mustard oil (see note)", "2-inch chive sections, picked cilantro leaves, or thinly sliced scallions, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using baby eggplants, cut each eggplant in half lengthwise. If using Japanese eggplants, slice crosswise at a sharp angle into 1-inch-thick pieces. Score the cut sides of the eggplant in a crosshatch pattern using the tip of a sharp chef's knife or paring knife. Toss eggplant with 2 tablespoons kosher salt and set aside to drain in a colander set over the sink or a large bowl for 1 hour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse excess salt off eggplant and gently pat dry with a clean kitchen towel or paper towels. Adjust an oven rack to the center position and preheat oven to 500&deg;F (260&deg;C). Line a rimmed baking sheet with parchment or foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet over medium heat, melt ghee, butter, or coconut oil until liquefied. Add mustard seeds, cumin seeds, turmeric, and Kashmiri red chili powder. Fry spices, stirring frequently, until mustard seeds pop, about 2 minutes. Add tomato paste, brown sugar, vinegar, remaining 1 teaspoon kosher salt, and 1/4 cup water. Cook until the mixture turns brick-red, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the eggplant and spice mixture together until evenly coated. Spread eggplant evenly across the rimmed baking sheet, dolloping on any spice mixture left behind in the bowl. Cover baking sheet with a sheet of foil or with a second inverted rimmed baking sheet. Place in oven and bake until eggplant is tender, about 15 minutes. Uncover and bake until charred and blackened in some spots, 5 to 10 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle with mustard oil and garnish with chives, cilantro, or scallions, if desired. Serve right away."}]}