{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/10/20180913-wild-rice-side-dish-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "American", "keywords": ["apple", "cranberry", "rice", "salad", "side", "thanksgiving", "vegetarian", "wild rice"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Wild Rice Salad With Dried Cranberries, Pickled Apples, and Pecans", "link": "https://www.seriouseats.com/recipes/2018/10/wild-rice-salad-with-dried-cranberries-pickled-apples-and-pecans.html", "description": "Whether you call it a salad, a dressing, or a stuffing, this wild rice side dish studded with plump cranberries and tart pickled apples is a perfect addition to the Thanksgiving table.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 6 to 10 as a side", "recipeCategory": ["American", "Apple", "Christmas", "Cranberry", "Rice", "Salads", "Sides", "Stovetop", "Thanksgiving", "Vegetarian"], "recipeIngredient": ["14 ounces wild rice (about 2 1/3 cups; 396g)", "Chicken stock, vegetable stock, or water, for cooking the rice (see note)", "Kosher salt and freshly ground black pepper", "6 ounces (350g) crisp apple (about 1 medium), cored and diced", "1 cup white wine vinegar (8 ounces; 235ml)", "1/4 cup (50g) sugar, divided", "4 ounces (115g) dried unsweetened cranberries", "4 tablespoons (60g) unsalted butter", "One 8-ounce (225g) red onion, cut into 1/4-inch dice", "Three 2-ounce (55g) stalks celery, cut into 1/4-inch dice", "4 sprigs thyme", "2 tablespoons minced flat-leaf parsley leaves and tender stems", "1 tablespoon minced fresh tarragon leaves", "1 tablespoon minced chives", "8 ounces (225g) pecans, toasted then roughly crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, combine wild rice with enough stock and/or water to cover by at least 2 inches. Season lightly with salt. Bring to a simmer, then continue to cook at a simmer until rice grows tender and many of the grains have ruptured, about 50 minutes; add more water at any point as needed to keep the rice covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium saucepan, combine white wine vinegar with 1 cup (235ml) water, 2 tablespoons (25g) sugar, and 1 teaspoon (4g) kosher salt. Bring to a simmer over medium-high heat, stirring to dissolve sugar and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place apples in a stainless steel mixing bowl nested in a larger mixing bowl full of ice water. Pour hot vinegar brine over apples, stirring to chill rapidly. Once cool, press a clean paper towel against the surface to fully submerge apples. Set aside or refrigerate for up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate heat-resistant bowl, pour about 1 cup boiling water over cranberries. Stir in remaining 2 tablespoons (25g) sugar until dissolved. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet, heat butter over medium-high heat until foaming. Add onion, celery, and thyme sprigs, and cook, stirring, until tender but not browned, about 4 minutes. Discard thyme and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fine-mesh strainer, drain wild rice well; let cool to near room temperature. Transfer to a large bowl and mix with sautéed vegetables. Drain cranberries and add to rice. Using a slotted spoon, transfer pickled apples to wild rice, reserving the pickling brine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add parsley, tarragon, chives, and pecans to rice. Stir to combine. Season with salt and pepper. Mix in 1 tablespoon reserved pickling brine at a time until salad tastes bright and flavorful. Serve."}]}