{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/01/20171219-bollito-misto-vicky-wasik-12.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": ["beef", "Italian", "meat", "stew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Bollito Misto (Italian Feast of Mixed Boiled Meats)", "link": "https://www.seriouseats.com/recipes/2018/01/bollito-misto-italian-feast-of-mixed-boiled-meats.html", "description": "The ultimate meat-lover's feast, Northern Italy's bollito misto is not an affair to be taken lightly; it will take some effort to procure all the meat and requires quite the appetite on the part of the diners. With long, slow cooking, the result is delicately and beautifully poached meats that are tender and silky, plus a flavorful broth that can be enjoyed as part of the meal, or at another time. Two bright, fresh, and very different sauces make the perfect condiments for the meats.", "totalTime": "2 days", "recipeYield": "Makes enough for 10 to 15 people", "recipeCategory": ["Beef", "Chicken", "Fall", "Italian", "Mains", "Poaching", "Stovetop", "Winter"], "recipeIngredient": ["1 pound (450g) beef oxtail", "1 whole beef tongue  (2 pounds; 1kg)", "1 3/4 pounds (795g) bone-in beef short ribs", "2 1/2 pounds (1.1kg) bone-in, cross-cut beef shanks", "2 3/4 pounds (1.25kg) boneless beef chuck roast", "1 large yellow onion, halved", "4 cloves", "1 teaspoon whole coriander seed (optional)", "1 teaspoon whole black peppercorns", "1 bay leaf", "2 rosemary sprigs", "1 celery rib", "1 whole head garlic, cut in half crosswise with skin", "Kosher salt", "1 chicken (3 1/2-pound; 1.6kg), divided into the bone-in breast, legs, and back", "Flaky salt or coarse sea salt, for serving", "<a href=\"http://www.seriouseats.com/recipes/2018/01/italian-salsa-verde-with-parsley-and-capers.html\">Salsa Verde</a> and <a href=\"http://www.seriouseats.com/recipes/2018/01/italian-salsa-rossa-tomato-and-bell-pepper-sauce-for-boiled-meats.html\">Salsa Rossa</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "One day before serving, in a large stockpot or Dutch oven, combine oxtail, beef tongue, short ribs, beef shanks, and chuck roast. Stick the cloves into the onion halves and add to pot along with coriander seed, peppercorns, bay leaf, rosemary, celery, and halved garlic head. Add 1 1/2 tablespoons kosher salt and enough water to cover all ingredients (about 5 quarts;  4.75L)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a simmer and cook until meats are beginning to become tender, 1 to 2 hours. Add chicken legs and back and continue cooking until all cuts are tender enough to be easily pierced by a fork. Top up with water if needed at any point, to keep the meats submerged. (The exact time it takes for all the cuts to become tender will depend heavily on the beef you have. They may not all cook at the same rate; if any become tender well before the others, transfer the finished piece to a pot or heatproof bowl with enough broth to keep it moistened, and set aside. Return to the pot with the broth when all the other cuts are tender.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, remove solidified rendered fat from surface of broth and return pot to the heat. Add bone-in, skin-on chicken breast and bring broth to 150&deg;F (65&deg;C); adjust heat to maintain a temperature around 150 to 160&deg;F (71&deg;C), until thickest part of chicken registers 150&deg;F on an instant-read thermometer, about 1 hour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer all the meats to a work surface. Remove and discard bones from short ribs and carve into slices. Remove and reserve bones from beef shanks and carve shank meat. Peel outer layer of skin off tongue and discard, then trim any gristle and slice. Discard the chicken back and all the herbs, spices, and aromatic vegetables. Carve the chuck roast and chicken breast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange all the carved meats on a large platter, along with the oxtails, chicken legs, and reserved shank bones (this is the <em>osso buco</em>, and it has delicious marrow in it)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Moisten the meats with some of the warm broth (the rest of the broth can be seasoned with salt and served in soup bowls as part of the meal, or reserved to be enjoyed as broth at another time). Serve the bollito misto right away, sprinkling flaky or coarse sea salt on top and the <a href=\"http://www.seriouseats.com/recipes/2018/01/italian-salsa-verde-with-parsley-and-capers.html\">salsa verde</a> and <a href=\"http://www.seriouseats.com/recipes/2018/01/italian-salsa-rossa-tomato-and-bell-pepper-sauce-for-boiled-meats.html\">salsa rossa</a> alongside."}]}