{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/03/20180318-vegan-cheesesteak-vicky-wasik-19.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "", "keywords": ["beancurd", "cashew", "tofu skin", "Yuba"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Vegan Cheesesteak With <i>Yuba</i> (Tofu Skin) and Mushrooms", "link": "https://www.seriouseats.com/recipes/2018/03/vegan-cheesesteak.html", "description": "If it makes you uneasy, feel free to call it a yuba sandwich. Thick sheets of yuba are sliced and smothered in an umami-packed mushroom broth before tossing with caramelized onions and roasted trumpet mushrooms. Everything gets packed into a crusty roll smeared with vegan \"cheese.\" Even if it's not exactly a cheesesteak, there's no denying that it's darn delicious.", "totalTime": "2 1/2 hours", "recipeYield": "6 sandwiches", "recipeCategory": ["Dairy-Free", "Nuts", "Sandwiches", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the mushroom stock:</strong>", "7 cups (20 ounces; 560g) button mushrooms, washed and quartered", "1 medium (10 ounces; 280g) onion, quartered", "8 cloves (2 ounces; 60g) garlic, roughly smashed", "4 small (9.5 ounces; 270g) carrots, cut into large chunks", "4 ribs (12 ounces; 340g) celery, cut into large chunks", "5 tablespoons (2.5 ounces; 70g) vegetable oil, divided", "1 teaspoon kosher salt", "1 tablespoon (.5 ounce; 15g) tomato paste", "3 tablespoons (1.5 ounces; 45g) vegetable base, such as <a href=\"https://www.amazon.com/dp/B01LAX8JGC/?tag=serieats-20\">Better Than Bouillon</a>", "<strong>For the cheesesteak filling:</strong>", "1.5 packages (15 ounces; 420g) beancurd sheets (yuba)", "6 tablespoons (1.5 ounces; 45g) vegetable oil, divided", "2 medium (20 ounces; 560g) onion, thinly sliced", "3 cups (8 ounces; 220g) royal trumpet mushroom, shredded lengthwise", "kosher salt and black pepper to taste", "1/4 cup (1.75 ounces; 50g) sugar", "1 teaspoon smoked paprika", "1/2 teaspoon garlic powder", "2 tablespoons (1 ounce; 30g) spicy brown mustard", "<a href=\"https://www.seriouseats.com/recipes/2014/02/gooey-vegan-nacho-cheese-sauce-recipe-food-lab.html\">Vegan Nacho Cheese Sauce</a> (see note)", "6 hoagie buns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the mushroom stock:</strong> Preheat your oven to 450&deg;F (232&deg;C). In a large bowl, toss together the mushroom, onion, garlic, carrot, celery, 4 tablespoons of vegetable oil and kosher salt. Spread onto two foil-lined sheet trays. Roast until deeply browned, about 45 minutes, tossing vegetables every 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 4-quart sauce pot over medium heat, add remaining 1 tablespoon of oil and tomato paste. Cook tomato paste until caramelized and deep mahogany, about 5 minutes. Add 6 cups (48 ounces; 1.3L) water, roasted vegetables, and vegetable base. Simmer for 45 minutes. Using a fine-mesh sieve, strain mushroom stock, pressing firmly on solids. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the cheesesteak filling:</strong> Remove yuba from package and cut into 1-inch strips. (Optional: Place cut yuba in a large bowl and cover tightly with plastic wrap. Place the nozzle of a smoking gun under the plastic wrap. Light smoking gun until the bowl fills with smoke. Let the yuba sit in the smoke for 30 minutes, adding more smoke as needed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While stock is simmering, over medium-low heat in a medium saucepan, heat 3 tablespoons of oil and add onions. Cook gently until caramelized, scraping up any brown bits from the bottom of the pan with a splash of water as needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the shredded trumpet mushroom with the remaining 3 tablespoons of oil and season with salt and pepper. Spread onto a foil-lined sheet tray and roast at 450&deg;F (232&deg;C) until golden brown and crisp, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saute pan over high heat, add the sugar and caramelize until deep golden brown. Add the yuba strips, stirring to distribute caramel. Add the paprika, garlic powder, mushroom stock, and black pepper. Simmer until most of the liquid has reduced and the yuba is glazed. Remove from heat and stir in the mustard, caramelized onions, and roasted trumpet mushrooms. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To assemble the sandwiches:</strong> If desired, warm or toast the hoagie buns. Split open the buns and spread with 1/4 cup of Vegan Nacho Cheese Sauce. Divide the yuba filling among the six buns and top with extra cheese. Serve immediately. "}]}