{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/07/20180620-japanese-breakfast-vicky-wasik-19.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": ["breakfast", "broil", "fish", "Japanese", "salmon", "seafood"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Japanese-Style Salted Salmon (<em>Shiozake</em>)", "link": "https://www.seriouseats.com/recipes/2018/07/japanese-style-salted-salmon-shiozake.html", "description": "Salted salmon, or <em>shiozake</em> (often shortened to <em>shake</em>), is a staple of the Japanese breakfast table and has been since time immemorial. While salted salmon is readily available for purchase in Japanese supermarkets, it can be difficult to find in the United States. This recipe approximates the flavor and texture of Japanese salted salmon by curing the salmon and letting it rest in the refrigerator on paper towels overnight.", "totalTime": "12 to 36 hours", "recipeYield": "Serves 2 as part of a Japanese breakfast", "recipeCategory": ["Breakfast and Brunch", "Gluten-Free", "Japanese", "Mother's Day", "Salmon"], "recipeIngredient": ["1 tablespoon (15ml) sake, optional; see note", "Two 4-ounce skin-on fillets of salmon, preferably cut from the belly", "2 teaspoons Diamond Crystal kosher salt (about 1/4 ounce; 7g); see note"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle sake, if using, all over salmon fillets. Pat dry with paper towels. Sprinkle salt evenly all over both fillets. Press salt into the flesh and skin to ensure it adheres well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place salted salmon fillets in a glass container, such as a small glass baking dish, lined with paper towels. Cover container and refrigerate overnight, or up to 36 hours. Every 12 hours, replace paper towels and flip fillets over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, place oven rack in top position and preheat broiler. Place salmon fillets on a foil-lined rimmed baking sheet. Broil salmon until it has exuded some fat and started to brown, about 3 minutes. (The timing will vary depending on broiler strength and distance from the broiler element.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn salmon fillets over and cook until salmon is nicely colored and fat is spitting, about 3 minutes longer (see note). Serve immediately."}]}