{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/instantpotbrownchickenstock.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["chicken", "essential", "stock"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Pressure Cooker Brown Chicken Stock", "link": "https://www.seriouseats.com/recipes/2018/11/pressure-cooker-beef-stock-2.html", "description": "Using a pressure cooker like the Instant Pot, you can make deeply rich and flavorful chicken stock in a fraction of the traditional cooking time. ", "totalTime": "3 hours", "recipeYield": "Makes about 2 quarts", "recipeCategory": ["Chicken", "Pressure Cooker"], "recipeIngredient": ["5 pounds (2.25kg) chicken bones (see note)", "Vegetable oil, for drizzling", "1 (8-ounce; 225g) yellow onion, roughly diced", "1 medium (4-ounce; 115g) carrot, roughly diced", "1 large (3-ounce; 85g) celery rib, roughly diced", "Boiling water, for deglazing", "2 medium cloves garlic", "2 sprigs thyme", "1 sprig flat-leaf parsley", "2 tablespoons tomato paste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400&deg;F with rack set in middle position. Lightly coat all the chicken parts with oil and arrange in an even layer on a rimmed baking sheet or in a roasting pan. Roast, turning bones once or twice, until beginning to turn golden brown, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, lightly toss onion, carrot, and celery in oil. When step 1 is complete, scatter all over and around bones and continue roasting until bones and vegetables are nicely browned, about 30 minutes longer. Be careful not to let anything scorch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken parts and roasted vegetables to a pressure cooker. Pour off and discard (or save) any accumulated fat from the roasting pan. Pour a thin layer of boiling water into roasting pan and scrape up any browned bits. Pour pan juices into pressure cooker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, thyme, parsley, and tomato paste to pressure cooker. Add enough cold water to bring level to the cooker's max-fill line; do not let water exceed the max-fill line, even if some solids are not submerged."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Close pressure cooker, bring to high pressure, and cook for 1 hour and 30 minutes. Allow cooker to depressurize naturally. Open cooker and strain stock through a fine-mesh strainer; discard solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim the stock by either carefully ladling off the top layer of fat while stock is still hot, or, for greater ease, refrigerate stock until well chilled, then remove the solid cap of fat that lies on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion stock into storage containers or <a href=\"https://www.seriouseats.com/2016/09/the-best-fastest-way-to-freeze-defrost-food.html\">zipper-lock bags</a> (if it's been chilled, reheat it to a liquid state first), then freeze or refrigerate until ready to use."}]}