{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20181113-homemade-ramen-dark-broth-miso-tori-paitan-vicky-wasik-24.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "broth", "chicken", "chicken soup", "fall", "Japanese", "ramen", "soup", "winter"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "6"}, "name": "Chicken <em>Paitan</em> Broth (<em>Tori Paitan</em> Dashi)", "link": "https://www.seriouseats.com/recipes/2018/12/chicken-paitan-broth.html", "description": "A cousin to the ubiquitous creamy and rich <em>tonkotsu</em> ramen broth, <em>tori paitan</em> broth is made from chicken instead of pork, and it's just as tasty. It's also relatively easy to make when you use your pressure cooker.", "totalTime": "3 hours 30 minutes", "recipeYield": "Makes a little over 1 quart (950ml) broth, enough for 3 bowls of ramen", "recipeCategory": ["Chicken", "Japanese", "Pressure Cooker", "Ramen", "Soups and Stews", "Stovetop"], "recipeIngredient": ["Leftover strained chicken carcass and vegetables from <a href=\"https://www.seriouseats.com/recipes/2018/12/chintan-shoyu-ramen-recipe.html\"><em>chintan shoyu</em> ramen broth</a> (see note)", "<strong><em>or</em></strong>", "One 4-pound (1.8kg) chicken, <a href=\"https://www.seriouseats.com/2010/05/knife-skills-how-to-break-down-a-chicken.html\">cut into parts</a>", "1 leek (about 10 ounces; 300g), including dark-green parts, <a href=\"https://www.seriouseats.com/2011/01/knife-skills-how-to-prepare-leeks.html\">sliced crosswise very thinly</a> and washed well of sand", "1 onion (about 11 ounces; 310g), peeled and <a href=\"https://www.seriouseats.com/2016/11/knife-skills-how-to-slice-and-dice-an-onion.html\">diced</a>", "1 medium carrot (about 6 ounces; 170g), peeled and diced", "6 medium cloves garlic, minced", "One 1-inch piece ginger, peeled and thinly sliced", "1/4 ounce kombu (7g; about one 7- by 2-inch piece)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Using Spent Chicken Carcass and Vegetables From <em>Chintan</em> Ramen Broth Recipe:</strong> Place spent chicken carcass in a pressure cooker and cover with 6 1/4 cups (1.5L) water. (No matter what, be sure not to exceed the max-fill line of your cooker.) Bring to high pressure and cook for 1 hour and 20 minutes. Allow pressure to release naturally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, blend contents of pressure cooker into a porridge-like slurry (see note). Alternatively, transfer contents of pressure cooker in batches to a high-quality countertop blender and blend. You can also use a wooden spoon or potato masher to break up and crush the chicken parts in the pot into small bits; however, you will then need to boil the mixture over high heat, stirring periodically, for 30 minutes in order to emulsify the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, pour mixture through a fine-mesh strainer directly into mixing bowl filled with spent vegetables and kombu from chintan broth. Press firmly on solids to extract as much liquid as possible. Discard strained chicken solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let broth steep for 30 minutes. Strain broth through a fine-mesh strainer into a clean mixing bowl, pressing firmly on vegetables to extract as much broth as possible. Discard vegetables. Transfer broth to airtight containers and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Using Fresh Chicken and Fresh Vegetables:</strong> Place chicken in a pressure cooker and cover with 6 1/4 cups (1.5L) water. (No matter what, be sure not to exceed the max-fill line of your cooker.) Bring to high pressure and cook for 2 hours. Allow pressure to release naturally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, blend contents of pressure cooker into a porridge-like slurry (see note). Alternatively, transfer contents of pressure cooker in batches to a high-quality countertop blender and blend very briefly, just to break up larger bones. You can also use a wooden spoon or potato masher to break up and crush the chicken parts in the pot into small bits; however, you will then need to boil the mixture over high heat, stirring periodically, for 30 minutes in order to emulsify the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, strain chicken mixture through a fine-mesh strainer directly into a large heatproof mixing bowl, pressing firmly on the mixture to ensure that all the liquid has been extracted. Discard chicken solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add broth to a pot and bring mixture to a boil over high heat. Turn off heat and add leek, onion, carrot, garlic, and ginger.  Stir mixture once and add kombu. Let steep for 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour broth through a fine-mesh strainer into a clean, large heatproof mixing bowl, pressing on solids to extract as much liquid as possible. Discard vegetables. Transfer broth to airtight containers and refrigerate."}]}