{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/09/20180927-brown-butter-shortbread-cookies-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "French", "keywords": ["brown butter", "cookie", "eggless", "make ahead", "malted milk powder", "sable", "shortbread", "toasted sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "6"}, "name": "Brown Butter Shortbread Cookies", "link": "https://www.seriouseats.com/recipes/2018/11/brown-butter-shortbread-cookie-recipe.html", "description": "Classic vanilla shortbread get an upgrade with brown butter, toasted sugar, and malted milk powder, ingredients that layer in all kinds of warm and nutty flavors. The result is a deceptively simple cookie that's rich and buttery, with hints of caramel and butterscotch. Thanks to their low moisture content, these sandy shortbread cookies will keep for weeks in an airtight container, so load up the cookie jar now!", "totalTime": "About 6 hours", "recipeYield": "Makes about twenty-four 1 1/2–inch cookies", "recipeCategory": ["Baking", "Christmas", "Cookies", "Easter", "Father's Day", "French", "Mother's Day", "Winter"], "recipeIngredient": ["5 ounces refined white sugar (shy 3/4 cup; 140g)", "\u20285 ounces unsalted butter (about 10 tablespoons; 140g)", "1/2 ounce malted milk powder, such as Carnation or <a href=\"https://www.amazon.com/Old-fashioned-Malted-Hoosier-Hill-Farm/dp/B00BW0FRWI/?tag=serieats-20\">Hoosier Hill Farm</a> (about 1 tablespoon; 15g)", "1/4 ounce vanilla extract (about 1 1/2 teaspoons; 7g)", "1 teaspoon (4g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight\u2028", "1/4 teaspoon baking soda", "1/4 teaspoon baking powder", "5 ounces all-purpose flour, such as Gold Medal (about 1 cup plus 1 tablespoon, spooned; 140g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Toast the Sugar:</strong> Place sugar in a 10-inch stainless steel skillet, then transfer to a cold oven and set oven to 350°F (180°C). Meanwhile, brown butter according to the step below; by the time it is finished, the sugar should be lightly toasted and beginning to smell of caramel. Pour warm sugar into a 2-quart glass baking dish (or similar dish) to speed cooling and let it cool to approximately 75°F (24°C). The prepared sugar can be used as soon as the brown butter has fully cooled, or it can be stored in an airtight container indefinitely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Brown the Butter:</strong> In a 2-quart stainless steel saucier, melt butter over medium-low heat. Increase heat to medium and simmer, stirring with a heat-resistant spatula while butter hisses and pops. Adjust heat as needed so that the dairy solids will not scorch before all the water can boil away. Continue cooking and stirring, scraping up any brown bits that form along the way, until the butter is golden yellow and perfectly silent (an indication that the water has completely boiled away). Pour into the bowl of a stand mixer, along with all the toasty brown bits, and cool until creamy, opaque, and no warmer than 75°F (24°C). Alternatively, the brown butter can be refrigerated up to 3 weeks, then softened to the same temperature before use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Make the Dough:</strong> When the brown butter is creamy and thick, add the cooled toasted sugar, malted milk powder, vanilla extract, salt, baking soda, and baking powder. In a stand mixer fitted with a paddle attachment, mix on low until combined, then increase speed to medium and beat until fluffy and light. Reduce speed to low, then add flour and continue mixing only until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape bowl and beater with a flexible spatula to make sure there are no streaks of unmixed dough, then knead lightly against sides of bowl. Transfer to a sheet of parchment paper and shape into a rough log about 12 inches in length."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold parchment over dough, then use a bench scraper to tuck parchment under dough; gently pull on top sheet of parchment to tighten the log. Move the bench scraper down a few inches and repeat, until the log is smooth and tight all around. Roll dough so it wraps up in the parchment, cut away the excess, and secure with a piece of tape. Tie off the ends with pieces of twine. Refrigerate until dough is chilled to about 40&deg;F (4&deg;C), about 4 hours; dough can also be held in the refrigerator for up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Bake:</strong> Adjust oven rack to lower-middle position, preheat to 350&deg;F (180&deg;C), and set chilled dough out at room temperature for about 10 minutes to soften. Using a sharp chef's knife, cut dough log into rounds just shy of 1/2 inch. Arrange on a parchment-lined half-sheet pan and bake until golden brown, about 15 minutes. Cool completely before serving. Stored in an airtight container, the shortbread cookies will keep for several weeks at cool room temperature. "}]}