{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/10/20181023-chopped-liver-vicky-wasik-23.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Kosher", "keywords": ["appetizer", "chicken", "chicken liver", "chopped liver", "gluten free", "hanukkah", "Jewish", "liver"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Classic Jewish Chopped Chicken Liver", "link": "https://www.seriouseats.com/recipes/2018/11/chopped-liver.html", "description": "With just chicken liver, hard-boiled eggs, onion, and fat, a world-class spread can be yours. This chopped liver recipe helps you get the result you want, whether it's more savory or more sweet.", "totalTime": "1 hour", "recipeYield": "Makes about 1 quart", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Chicken", "Gluten-Free", "Hanukkah", "Kosher", "Offal", "Other Meats", "Passover", "Sides", "Snacks"], "recipeIngredient": ["1 pound (454g) chicken livers", "Kosher salt", "1/4 cup (60ml) <a href=\"https://www.seriouseats.com/recipes/2015/04/schmaltz-rendered-chicken-fat-recipe.html\">schmaltz</a>, plus more as needed (see note)", "1 large (8-ounce; 225g) yellow onion, finely minced", "3 large <a href=\"https://www.seriouseats.com/recipes/2009/10/perfect-boiled-eggs-recipe.html\">hard-boiled eggs</a>, peeled", "1/4 cup <em>gribenes</em> (browned, crispy bits of fat and onion left over from making schmaltz), finely minced (optional)", "Freshly ground black pepper", "Additional minced gribenes and hard-boiled egg, for garnish (optional)", "Matzo or other crackers, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Using a Grill for the Livers:</strong> <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set all the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"http://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> the grilling grate. Proceed to step 3."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Using a Broiler for the Livers:</strong> Preheat broiler and move oven rack to highest position. Oil a slotted broiler pan, or a wire rack set in a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a <a href=\"https://www.seriouseats.com/2016/10/the-best-paring-knives.html\">paring knife</a>, clean livers well of any fat, green spots, or large veins. Season all over with kosher salt. If using a grill, grill livers over high heat, turning frequently, until they are very lightly charred in spots and only the last traces of pink remain in their centers. If using the broiler, arrange livers on the prepared broiler pan or wire rack and broil, turning frequently, until exteriors are well browned and only the last traces of pink remain in the centers. (If you are unsure about whether the livers are done, cut them open to check.) Remove from oven or grill and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium stainless steel or cast iron skillet, heat schmaltz or other fat over medium heat until shimmering. Add onion and cook, stirring frequently, until desired doneness is reached. For less sweet onions, with some texture remaining, cook until softened but not browned, about 3 minutes; for sweeter onions that are very soft, cook until golden brown, about 8 minutes. (Lower the heat at any point to prevent burning.) If you wish, you can remove half the onion when it is softened, then continue cooking the other half until browned, for the best of both worlds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a <a href=\"https://www.seriouseats.com/2017/10/best-food-processor-equipment-review.html\">food processor</a>, combine cooked livers with eggs and pulse, scraping down the sides if needed, until a rough, crumbly paste forms; try not to over-process into a smooth paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape minced liver and egg mixture into a mixing bowl. Scrape in cooked onion, along with all of the cooking fat. Add minced gribenes, if using. Stir until thoroughly combined, seasoning with salt and pepper as you go."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add as much extra schmaltz as needed, 1 tablespoon at a time, to reach desired consistency. Exactly how much this is will depend on several variables, including your personal preference, though we recommend that chopped liver be spreadable and moist, not dry and crumbly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate chopped liver in an airtight container, with plastic pressed directly against its surface to prevent it from discoloring, for up to 5 days. Allow to come to room temperature before serving. Garnish, if desired, with additional minced hard-boiled egg and gribenes, along with matzo or crackers on the side. We find that chopped liver tastes better after an overnight rest."}]}