{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/08/20180726-MHT-broiling-mint-msmen-vicky-wasik-1-2.jpg", "author": {"@type": "Person", "name": "Michael Harlan Turkell"}, "recipeCuisine": "Moroccan/North African", "keywords": ["broil", "broiler", "flatbread", "Moroccan", "north african"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "2.5", "ratingCount": "2"}, "name": "Broiled Mint <em>Msemen</em> With Honey", "link": "https://www.seriouseats.com/recipes/2018/09/broiled-mint-msemen-with-honey.html", "description": "Moroccan msemen (or m'smen) flatbreads, a popular breakfast and snack item, are made by pressing the dough very thin, then folding it over to create a package of flaky layers. It's an easy and fun hands-on baking project.", "totalTime": "2 hours", "recipeYield": "Makes 8 flatbreads", "recipeCategory": ["Bread", "Breakfast and Brunch", "Moroccan/North African", "Snacks", "Valentine's Day", "Vegetarian"], "recipeIngredient": ["<strong>For the Msemen:</strong>", "1 pound 6 1/2 ounces all-purpose flour (640g; 5 cups)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "1 teaspoon (4g) granulated sugar", "1/4 (1g) teaspoon <a href=\"https://www.seriouseats.com/2018/03/all-about-dry-yeast-instant-active-dry-fast-acting-and-more.html\">instant yeast</a>", "1 1/2 cups (355g) warm water", "1 large egg", "1/4 cup (60g) vegetable oil", "1/4 cup (60g) unsalted butter", "1 cup packed fresh mint leaves", "1/4 cup (45g) fine semolina", "Flaky salt, such as Maldon, for sprinkling", "<strong>For the Honey-Butter:</strong>", "1/2 cup (120g) honey", "1/2 cup (120g) unsalted butter", "1 teaspoon (5g) water", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Msemen:</strong> In the bowl of a stand mixer fitted with the dough hook, combine flour, salt, sugar, and yeast. With the mixer running at low speed, slowly drizzle in the water. Add the egg and mix until thoroughly combined. Increase speed to medium and continue to knead the dough until a very slightly sticky and tender dough forms, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a greased mixing bowl. Lightly rub the dough all over with oil. Cover with plastic and let rest in a warm place until the dough increases in size by about 50 percent, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small saucepan, combine butter and oil and heat over medium heat until butter is melted. Set aside to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a lightly oiled work surface. Punch down the dough. Coat your hands with the butter/oil mixture. Divide the dough into eight equal portions and coat lightly with the butter/oil mixture. Arrange dough balls on a rimmed baking sheet, cover with plastic and let rest until dough balls have increased in size by about 50 percent, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working one at a time on a lightly oiled work surface, and using greased hands, flatten each dough ball, pushing outwards from the center to make an 8- by 8-inch square; the dough square should have a roughly even thickness throughout. Generously brush the surface of dough with the butter/oil mixture, dust all over with a large pinch of semolina, and sprinkle mint leaves on top of the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the dough in thirds, like a letter. Brush the top with more butter/oil, dust with more semolina, and season with a pinch of flaky salt. Fold into thirds once more to make a square packet. Return the dough packets to the baking sheet, cover loosely with plastic and let rest at least 15 minutes and up to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Meanwhile, Make the Honey-Butter:</strong> In a small saucepan, combine honey, butter, and water and cook over medium heat until butter is melted and the sauce is smooth, stirring to combine. Season with salt and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Finish:</strong> Preheat broiler and set oven rack to 6 inches from broiler element. Working one dough packet at a time, set a dough packet on a second rimmed baking sheet. Coat hands once more in butter/oil mixture, and, using your fingers, press and stretch the dough packet out to a roughly 6- by 6-inch square."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil the dough packet until browned in spots, turning once halfway through, about 1 minute per side. Transfer to a platter and cover with a kitchen towel to keep warm. Repeat with remaining dough packets (be sure to let baking sheet cool to a safe level between uses). Serve with honey butter."}]}