{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/20180422-chicken-meatballs-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Sohla El-Waylly"}, "recipeCuisine": "Thai", "keywords": ["chicken", "chicken meatball", "crispy shallot", "ground chicken", "lettuce wrap", "meatball", "pickles", "quick and easy", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Vietnamese-Style Chicken Meatballs With Ginger and Mint", "link": "https://www.seriouseats.com/recipes/2018/05/vietnamese-style-chicken-meatballs-with-ginger-and-mint.html", "description": "These quick and easy chicken meatballs are loaded with flavor for a fast meal that's still impressive. Fish sauce adds umami and funk, while Thai green chilies, scallions, and fresh ginger offer different levels of heat, and a sprinkle of crunchy turbinado sugar balances it all out. Serve these meatballs up as lettuce wraps with a pantry raid of whatever pickles you have on hand to make it a fresh and light meal perfect for any warm summer night. ", "totalTime": "30 minutes", "recipeYield": "Serves 2 to 4", "recipeCategory": ["Chicken", "Father's Day", "Ginger", "Gluten-Free", "Mains", "Quick and Easy", "Quick Dinners", "Stovetop", "Thai", "Valentine's Day"], "recipeIngredient": ["2 tablespoons coconut oil (30g)", "3 Thai green chilies (or more or less depending on heat preference), stemmed and finely minced (about 30g)", "2 scallions, white and light green parts only, finely minced (about 30g)", "One 2-inch piece of ginger, peeled and minced (about 40g)", "2 medium cloves garlic, finely minced (about 10g)", "1 stalk lemongrass, tender white part only, finely minced (see note)", "1 pound (454g) ground chicken ", "1 1/2 tablespoons (20g) fish sauce, such as <dorado id=\"red-boat-fish-sauce\" class=\"text\">Red Boat</dorado>", "1 1/2 teaspoons (8g) Diamond Crystal kosher salt", "1/2 bunch mint, leaves finely chopped (about 30g)", "Neutral oil or refined coconut oil, for cooking", "1/4 cup (60g) turbinado sugar ", "<strong>To Serve:</strong>", "1 head bibb lettuce, leaves separated", "<a href=\"https://www.seriouseats.com/2017/05/12-quick-pickle-recipes.html\">Assorted pickles</a>", "<a href=\"https://www.seriouseats.com/recipes/2013/02/thai-style-fried-shallots.html\">Crispy shallots</a>", "Hot sauce, hoisin, or <a href=\"https://www.seriouseats.com/recipes/2018/04/homemade-spicy-chili-crisp.html\">chili crisp</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small sauté pan or skillet, heat the coconut oil over medium-low heat until shimmering. Add the chilies, scallions, ginger, garlic, and lemongrass, cooking until they soften and become aromatic, about 5 minutes; don't allow them to brown. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium mixing bowl, add the ground chicken, fish sauce, salt, mint, and cooked aromatics along with the cooking oil. Mix with your hands until thoroughly combined and the mixture feels sticky and cohesive. In a small sauté pan with oil over medium heat, cook a teaspoon of the chicken mixture to taste and adjust the seasoning if needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium straight-sided sauté pan, add 1/2 inch of oil and heat over medium heat until shimmering. Dip two large spoons in the hot oil, then scoop up a portion of the chicken mixture, using the two spoons to form it into a rough football shape; carefully drop the meatball into the oil. Repeat with all the chicken, dipping the spoons in oil as needed to prevent sticking. Cook the chicken meatballs, turning occasionally, until browned and cooked through, about 8 minutes. Remove to a bowl or large plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once all the chicken meatballs are cooked, sprinkle the sugar over them, tossing gently to coat. In the same sauté pan with the residual cooking oil, increase the heat to high and add the chicken meatballs. Cook on each side until the sugar caramelizes, about 1 minute. Remove to a serving platter. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve right away with bibb lettuce, assorted pickles, crispy shallots, and any other condiments you desire. "}]}