{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/12/20181204-blini-vicky-wasik-61.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": ["blini", "buckwheat", "buckwheat pancake", "caviar", "new years", "New Years Eve", "pancake", "russian"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Buckwheat Blini", "link": "https://www.seriouseats.com/recipes/2018/12/buckwheat-blini.html", "description": "Buckwheat blini recipes often call for yeast and long rising times, and take hours to make. Our batter delivers great buckwheat flavor and comes together in a snap.", "totalTime": "30 minutes", "recipeYield": "Makes about 50 small blini", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Christmas", "New Year", "Pancake", "Recipes", "Stovetop", "Winter"], "recipeIngredient": ["1 cup buckwheat flour (5 ounces; 140g)", "1/2 cup all-purpose flour (2 1/2 ounces; 70g)", "2 teaspoons (8g) sugar", "1/2 teaspoon (2g) kosher salt", "1/2 teaspoon (2g) baking powder", "1/4 teaspoon (1g) baking soda", "2 cups (475ml) buttermilk", "2 tablespoons (28g) unsalted butter, melted", "2 large eggs (110g), separated", "1 tablespoon (15ml) vegetable oil, plus more for cooking", "Sour cream or crème fraîche, for serving", "Chilled caviar or smoked salmon, for serving", "Finely minced shallots, sliced chives, and/or chopped hard-boiled eggs, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to middle position and preheat oven to 150&deg;F (65&deg;C) or its lowest possible setting. In a medium bowl, whisk together buckwheat flour, all-purpose flour, sugar, kosher salt, baking powder, and baking soda. In a separate medium bowl, whisk together buttermilk, melted butter, egg yolks, and vegetable oil. Add buttermilk mixture to bowl with dry ingredients and use a rubber spatula to stir until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl using a whisk, or using an electric mixer, whisk egg whites until they hold stiff peaks. Using a rubber spatula, carefully fold egg whites into batter until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large nonstick skillet over medium heat for 5 minutes (or use an electric griddle set to 350&deg;F/177&deg;C). Add a small amount of vegetable oil to the skillet and spread with a paper towel until no visible oil remains. Using a spoon, place silver dollar pancake&ndash;sized circles of batter (about 2 1/2 inches in diameter) in the skillet. Cook until bubbles appear on the surface of the blini and bottom sides of blini are light golden brown, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully flip blini and cook on second side until light golden brown and completely set, about 2 minutes longer. Wrap finished blini in a clean kitchen towel, place towel on a wire rack set in a rimmed baking sheet, and transfer to oven to keep warm. Repeat blini-cooking process until all of the batter is used up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve blini with sour cream or crème fraîche, chilled caviar or smoked salmon, and traditional accompaniments, such as finely minced shallots, sliced chives, and chopped hard-boiled eggs."}]}