{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/05/20180525-spanish-potato-salad-vicky-wasik-12.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["arugula", "chorizo", "potato", "potato salad", "salad", "sausage", "side"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Fingerling Potato Salad With Chorizo, Onion, and Arugula", "link": "https://www.seriouseats.com/recipes/2018/06/fingerling-potato-salad-with-chorizo-onion-and-arugula.html", "description": "Tender and creamy fingerling potatoes, smoky Spanish chorizo, onion both pickled and sautéed, and peppery arugula all come together in this easy and hearty potato salad. It's perfect as a side for summer cookouts or as the main event for a simple one-bowl dinner.", "totalTime": "2 hours", "recipeYield": "Serves 4 to 6 as a side", "recipeCategory": ["Christmas", "Gluten-Free", "July 4th", "Labor Day", "Leafy Greens", "Memorial Day", "Pork", "Potato Salad", "Salads", "Sides", "Stovetop", "Summer", "Thanksgiving"], "recipeIngredient": ["1 3/4 pounds (800g) fingerling potatoes", "Kosher salt", "4 sprigs fresh oregano or thyme", "3 bay leaves", "1 medium (6-ounce; 170g) yellow onion, diced, divided", "Sherry vinegar, as needed", "2 tablespoons (30ml) extra-virgin olive oil, plus more as needed", "4 ounces (115g) Spanish dry-cured chorizo, preferably younger and more tender, diced", "2 ounces (55g) arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan or saucier, cover potatoes with cold water. Add enough salt to make the water unpleasantly salty (don't worry, the potatoes won't end up too salty). Add oregano or thyme and bay leaves. Bring to a boil, then lower heat to a bare simmer and cook until you can easily slide a fork through the potatoes, about 25 minutes. (This is a very rough estimate; actual cooking time will vary with the size of the potatoes, so check them often.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove potatoes from heat and let them cool in their cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place half the diced onion in a medium nonreactive bowl. Add just enough sherry vinegar to cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet, warm olive oil over medium heat. Add chorizo and cook, stirring occasionally, until lightly browned, about 6 minutes. Using a slotted spoon, transfer chorizo to a plate. Add remaining onion to skillet, increase heat to high, and cook, stirring frequently, until starting to brown, about 3 minutes; lower heat if onions threaten to burn at any point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain potatoes and discard herbs. If potatoes are very small, you can leave them whole; otherwise, cut into halves or quarters. Transfer potatoes to a large bowl. Add chorizo and sautéed onion along with the cooking oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer quick-pickled onions to bowl with potatoes; reserve vinegar. Toss to combine. Dress with more olive oil as desired, then add reserved vinegar, 1 tablespoon (15ml) at a time, tossing between additions, until desired flavor is reached. Season with salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, add arugula and toss well. Serve."}]}