{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/12/instantpotshoyuramen.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": ["Asian", "Japanese", "ramen", "ramen broth", "shoyu", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Pressure Cooker <em>Chintan Shoyu</em> Ramen", "link": "https://www.seriouseats.com/recipes/2018/12/chintan-shoyu-ramen-recipe.html", "description": "A relatively simple and straightforward method for producing all the components of a classic clear <em>shoyu</em> ramen.", "totalTime": "36 hours", "recipeYield": "Makes 4 bowls of ramen", "recipeCategory": ["Chicken", "Japanese", "Pork", "Pressure Cooker", "Ramen", "Soups and Stews"], "recipeIngredient": ["<strong>For the Cured Pork Belly:</strong>", "1/2 cup (96g) Diamond Crystal kosher salt; for table salt, use half as much by volume or the same weight", "1/2 cup (95g) granulated sugar", "1 1/2 pounds (700g) skinless pork belly (see note)", "<strong>For the <em>Tare</em>:</strong>", "1/4 ounce kombu (7g; about one 7- by 2-inch piece)", "2 cups plus 1 ounce (500ml) water", "1 ounce (30g) shaved <em>katsuobushi</em> flakes", "1 1/2 cups (350ml) dry sake ", "1 1/2 cups (350ml) dark Japanese soy sauce (<em>koikuchi</em>)", "<strong>For the Broth:</strong>", "1 whole chicken (about 4 pounds; 1.8kg), <a href=\"https://www.seriouseats.com/2010/05/knife-skills-how-to-break-down-a-chicken.html\">cut up into 14 parts</a> (see note)", "1 leek (about 10 ounces; 300g), including dark-green parts, <a href=\"https://www.seriouseats.com/2011/01/knife-skills-how-to-prepare-leeks.html\">sliced crosswise very thinly</a> and washed well of sand", "1 onion (about 11 ounces; 310g), peeled and <a href=\"https://www.seriouseats.com/2016/11/knife-skills-how-to-slice-and-dice-an-onion.html\">diced</a>", "1 medium carrot (about 6 ounces; 170g), peeled and diced", "6 medium cloves garlic, minced", "One 1-inch piece ginger, peeled and thinly sliced", "1/4 ounce kombu (7g; about one 7- by 2-inch piece)", "<strong>For the Aroma Oil:</strong>", "1/2 cup (120ml) reserved rendered fat from the broth", "6 medium cloves garlic, sliced", "One 1-inch piece ginger, peeled and minced", "Zest from 1 lemon ", "<strong>For Serving (see note):</strong>", "4 servings of ramen noodles, either <a href=\"https://www.seriouseats.com/recipes/2018/11/homemade-ramen-noodles.html\">homemade</a> or store-bought (see note)", "1/2 teaspoon freshly ground white pepper, for serving", "4 scallions, sliced as thinly as possible", "Reserved pork belly from broth, sliced, then torched or broiled until charred in spots (optional)", "<em><a href=\"https://www.seriouseats.com/recipes/2012/03/ajitsuke-tamago-japanese-marinated-soft-boiled-egg-recipe.html\">Ajitsuke tamago</a></em> (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Cured Pork Belly, at Least 8 and up to 24 Hours Before Cooking:</strong> Combine salt and sugar in a bowl and stir to mix thoroughly. Sprinkle pork belly all over with sugar-and-salt mixture, then shake off any excess. Place in a zip-top bag and store in the refrigerator at least 8 and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the <em>Tare</em>, at Least 8 and up to 24 Hours Before Cooking:</strong> Combine kombu and water for the tare in a covered container and store in the refrigerator at least 8 and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Broth</strong>: Place chicken in a pressure cooker and cover with 6 1/4 cups (1.5L) water. (No matter what, be sure not to exceed the max-fill line of your cooker.) Rinse cured pork belly of salt and sugar, then add to pot, nestling it on top (the pork belly does not have to be submerged). Cover pressure cooker, bring to low pressure, and cook for 40 minutes. Allow pressure cooker to depressurize naturally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heatproof bowl, combine leek, onion, carrot, garlic, and ginger. Using tongs and a spatula, carefully transfer pork belly to a plate or rimmed baking sheet. Carefully pour broth through a fine-mesh strainer into the bowl of chopped vegetables. (Reserve all chicken bones and meat for a second broth, if desired; see note.) Stir broth once, then add the kombu for the broth and stir again. Let broth steep for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain broth into a large, clean mixing bowl, then decant into pint or other storage containers. (Reserve chopped vegetables and kombu for a second broth, if desired; see note.) Cover containers and place in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Tare:</strong> Transfer kombu and its soaking water to a medium saucepan and bring to a bare simmer over medium-high heat. Remove from heat and add <em>katsuobushi</em> flakes. Let dashi steep 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain dashi into a small mixing bowl through a cheesecloth- or coffee filter&ndash;lined fine-mesh strainer, pressing on the solids to extract as much liquid as possible. You should have about 1 1/2 cups (350ml) of dashi. If you have less than that, top up with water to make 1 1/2 cups (350ml)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, combine dashi with sake and soy sauce and bring to a boil over high heat. Reduce heat to maintain a steady simmer and cook until reduced by half, or until you have about 2 1/4 cups (525ml) of liquid. Transfer to a heatproof container and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Aroma Oil:</strong> Scoop off the top layer of congealed fat from the broth and place it in a saucepan over medium-low heat. (Don't worry if some broth gets in there, too.) You should have about 1/2 cup (120ml) rendered fat; if you do not, either add a handful of small pieces of solid fat trimmed from the cooked pork belly and cook it in the rendered fat until it renders enough additional fat to make 1/2 cup (120ml), or supplement with a neutral oil like vegetable oil. (If you add extra fat from the belly, there's no need to remove it until you strain in the next step.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the fat is hot, add sliced garlic and minced ginger. Sauté until fragrant, but not brown. Place lemon zest in the bottom of a fine-mesh strainer set over a heatproof bowl. Pour the hot aroma oil through the strainer, pressing on the solids to extract as much fat as possible; discard solids. Set aroma oil aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Assemble the Ramen Bowls:</strong> Bring a large pot of unsalted water to boil over high heat. Place broth in a separate pot and bring to a simmer over high heat; try not to let the broth boil, as boiling will make it more opaque. Set out containers of tare, aroma oil, and freshly ground white pepper, along with appropriate measuring spoons and serving bowls, and make sure all garnishes and toppings are close at hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle 5 ounces (150ml) boiling water into each serving bowl to warm it. After 30 seconds, place noodles in the pot of boiling water and stir vigorously with chopsticks or tongs to prevent sticking. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard water in serving bowls. Place 2 tablespoons (30ml) tare, 2 teaspoons (10ml) aroma oil, 1/8 teaspoon white pepper, and a pinch of sliced scallions in the bottom of each serving bowl. Add about 1 1/2 cups (350ml) hot broth to each bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When noodles are cooked, drain them thoroughly using a fine-mesh strainer or noodle basket, shaking off as much excess water as possible, then place a serving of noodles in each bowl of hot broth. Stir noodles with chopsticks or tongs, then lift and fold noodles over. Garnish with sliced pork belly, more scallions, <em>ajitsuke tamago</em> (if using), and whatever other toppings you have at hand. Serve immediately."}]}