{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/02/20190220-duck-breast-beer-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Michael Harlan Turkell"}, "recipeCuisine": "", "keywords": ["duck", "duck breast", "prosciutto", "sage"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seared Duck Breast With Prosciutto, Sage, and Peaches", "link": "https://www.seriouseats.com/recipes/2019/03/seared-duck-breasts-with-prosciutto-sage-and-peaches.html", "description": "The ease of this recipe lies in the fact that it all takes place in the same pan, and uses the duck fat that's rendered from the breasts to crisp the frizzle the prosciutto and sage.", "totalTime": "35 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Duck", "Father's Day", "Mains", "Meats and Poultry", "Mother's Day", "Pork", "Stovetop"], "recipeIngredient": ["4 duck breasts, 4 to 5 ounces (112 to 140g) each", "Kosher salt", "8 large, thin slices prosciutto (about 1/4 pound; 115g), divided", "1/2 pound (225g) frozen peach slices, defrosted", "1 bunch fresh sage (about 1/4 ounce; 7g), leaves picked"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With a sharp knife, gently score duck skin in a tight crosshatch pattern, keeping the scores 1/8 inch apart. If you prefer a little fat left on the breasts after cooking, just barely score the skin; to render more fat, score more deeply, taking care not to expose the flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season duck breasts with salt, heavily on the skin side and lightly on the flesh side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place duck breasts, skin side down, in a large, cold sauté pan. Place pan over low to medium-low heat. To keep the edges from curling up, press duck breasts down with the help of a smaller sauté pan or weight. After about 5 minutes, the fat should begin to gently bubble. If the fat is either silent or spitting, adjust heat accordingly. Maintain the gentle bubble of fat, pouring out excess rendered fat into a heatproof bowl throughout the cooking process, until much of the fat has rendered, skin is golden brown, and duck's internal temperature is 125&deg;F (52&deg;C), about 15 minutes; reserve rendered fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium to further brown skin if needed, about 1 minute. Flip breasts flesh side down. For medium-rare meat, cook until breast registers 130&deg;F (54&deg;C) on an instant-read thermometer, about 1 to 2 minutes. Continue cooking until duck registers 140&deg;F (60&deg;C) for medium or 155&deg;F (68&deg;F) for well-done. Remove duck from pan and set aside to rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off (or add reserved fat) such that you have about 2 tablespoons in the pan. Return pan to medium-high heat. Working in batches if necessary, cook half the prosciutto, turning, until crispy, about 2 minutes (the prosciutto may not fully crisp in the pan, but it will as it cools). Transfer to paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season peach slices lightly with salt. Add peach slices to the skillet and cook, turning once, until browned on both sides, about 4 minutes. Using a thin metal spatula, transfer peaches to a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all of the reserved duck fat to the skillet and heat over medium high heat until shimmering. Add sage leaves and cook, gently swirling, until bubbling slows down and leaves are frizzled. Using a slotted spoon, transfer sage leaves to paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, slice duck breasts crosswise. Arrange on plates, alternating the duck slices with pieces of the reserved uncooked prosciutto (tear or cut the prosciutto so that each piece is about the same size as the duck breast slice). Pile some of the seared peaches on each plate. Crumble the crispy prosciutto and frizzled sage all over and serve."}]}