{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/10/20191009-diwali-treats-vicky-wasik-44-Shakarpara.jpg", "author": {"@type": "Person", "name": "Chetna Makan"}, "recipeCuisine": "Indian", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "<i>Shankarpali</i> (<i>Shakarpara</i>)", "link": "https://www.seriouseats.com/recipes/2019/10/shankarpali-shakarpara-recipe.html", "description": "<i>Shankarpali</i>, also called <i>shakarpara</i>, are small deep-fried pastries spiced with cardamom&mdash;best enjoyed by the fistful during Diwali.", "totalTime": "1 1/2 hours", "recipeYield": "Makes about 120 shankarpali", "recipeCategory": ["Deep Frying", "Diwali", "Indian", "Snacks"], "recipeIngredient": ["2 1/4 cups (340g) all-purpose flour", "3/4 cup (100g) powdered sugar", "1 teaspoon cardamom powder", "1/4 teaspoon Diamond Crystal kosher salt; if using table salt, use half as much by volume", "1/4 cup plus 4 teaspoons (60g) <a href=\"https://www.seriouseats.com/recipes/2015/08/clarified-butter-recipe.html\">ghee</a>", "1/2 cup (120ml) whole milk", "Sunflower oil or other neutral oil, such as canola or peanut, for deep-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium mixing bowl, thoroughly whisk together flour, sugar, cardamom, and salt. Add ghee and, using your hands, rub it into the dry ingredients until the mixture resembles bread crumbs. Slowly add milk in small increments, using your hands to mix it in until a firm yet supple dough forms (you may not need the entire 1/2 cup milk). Cover bowl with plastic wrap and let the dough rest for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dough on a work surface and divide into 4 portions. Working with one portion at a time, and keeping the rest covered with plastic to prevent drying, use a rolling pin to roll out each portion into a sheet a little less than 1/8 inch thick (about 2 to 3mm). Using a knife, cut a crosshatch pattern across each sheet of dough to create small diamond shapes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy-bottomed pot, heat 2 inches oil to 365&deg;F (185&deg;C); when oil is hot enough, a test piece of dough should sizzle and float to the surface immediately upon being placed in the pot. Place several pieces of dough in the oil at a time and fry, flipping the pieces midway through, until both sides are a deep golden brown, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spider, slotted spoon, or strainer, transfer fried dough pieces to paper towels to drain. Repeat with remaining dough pieces. Serve warm or at room temperature."}]}