{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/07/20190709-pistachio-frangipane-cherry-tart-vicky-wasik-22.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["frangipane", "pistachio", "tart"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Cherry and Pistachio Frangipane Tart", "link": "https://www.seriouseats.com/recipes/2019/08/cherry-frangipane-tart-recipe.html", "description": "Frangipane, a fragrant batter of ground almonds, sugar, butter, and eggs, takes on a more refined character when made from a smooth and creamy homemade pistachio paste. Combining it with an all-butter crust and sweet cherries produces a tart that's buttery, crisp, and nutty, with bursts of jammy fruit offset by the richness of the custard-like frangipane.", "totalTime": "About 3 hours", "recipeYield": "Makes one 10-inch tart (about 12 generous slices)", "recipeCategory": ["Baking", "Breakfast and Brunch", "Breakfast Sweets", "Cherry", "Fruit Desserts", "Gluten-Free", "Pastry", "Summer"], "recipeIngredient": ["About 22 ounces whole sweet cherries (about 60 cherries; 625g)", "<strong>For the Tart Shell:</strong>", "1/2 batch <a href=\"https://www.seriouseats.com/recipes/2016/06/old-fashioned-flaky-pie-dough-recipe.html\">Old-Fashioned Flaky Pie Dough</a> or <a href=\"https://www.seriouseats.com/recipes/2016/07/best-gluten-free-pie-crust-recipe.html\">Flaky and Crisp Gluten-Free Pie Crust</a>", "<strong>For the Frangipane:</strong>", "1 1/2 ounces unsalted butter (about 3 tablespoons; 45g), brought to about 70°F (21°C)", "3 1/2 ounces <a href=\"https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-paste.html\">Homemade Pistachio Paste</a> (about 1/3 cup plus 1 tablespoon; 100g)", "1/8 teaspoon (0.5g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1 large egg (1 3/4 ounces; 50g), brought to roughly 70°F (21°C)", "1 ounce heavy cream (about 2 tablespoons; 30g), brought to roughly 70°F (21°C)", "<strong>For the Egg Wash (optional):</strong>", "1 large egg (1 3/4 ounces; 50g)", "1 large yolk (about 1/2 ounce; 15g)", "1/2 ounce heavy cream (1 tablespoon; 15g)", "1/8 teaspoon (0.5g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight", "<strong>To Serve:</strong>", "<a href=\"https://www.seriouseats.com/recipes/2016/06/cherry-pit-whipped-cream-recipe.html\">Cherry Pit Whipped Cream</a> or <a href=\"https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-cream.html\">pistachio whipped cream</a> (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> Pit cherries and slice each in half. The prepared fruit (you should have approximately 10 ounces or 285g) can be refrigerated in an airtight container for up to 24 hours (see note). If desired, reserve pits to make <a href=\"https://www.seriouseats.com/recipes/2016/06/cherry-pit-whipped-cream-recipe.html\">Cherry Pit Whipped Cream</a>; the cream and cherry pits will need to infuse at least 4 hours prior to whipping, a final step that can be accomplished while the baked tart is cooling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Tart Shell:</strong> Prepare the pie dough as directed in the recipe. After dividing dough in half (or after the final fold, if making a half batch), roll dough into a 12-inch round. Trim away ragged edges with a knife, then transfer to a 9- or 10-inch stainless steel tart ring or tart pan placed on a half-sheet pan (see note). Nestle dough into the bottom edge of the pan, making sure it's also flush with the sides. Fold outer edge of dough toward bottom edge of pan to make a double-thick wall around the sides, pressing and molding with your fingertips to seal the dough together. After shaping, cover dough loosely in plastic and refrigerate at least 2 hours and up to 24 hours. When you are ready to proceed with assembling and baking the tart, adjust oven rack to lower-middle position and preheat to 400&deg;F (200&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Frangipane:</strong> In the bowl of a stand mixer fitted with a paddle attachment, combine butter, pistachio paste, and salt. Beat on medium speed, scraping bowl and beater as needed, until mixture is creamy, soft, and pale, about 5 minutes. With mixer still running, add egg and continue beating until smooth, then drizzle in cream and continue beating until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Egg Wash (optional):</strong> In a small bowl, combine egg, egg yolk, cream, and salt, beating well with a fork until quite homogeneous and smooth. Using a pastry brush, brush mixture around the outer edge of the tart dough. In an airtight container, this egg wash can be held for up to 1 week in the fridge for use in other pastry projects."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Assemble:</strong> Scrape pistachio frangipane into prepared tart shell using a flexible spatula and smooth into an even layer. Immediately arrange cherry halves on top, fitting the pieces as close together as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake tart until fragrant, well puffed, and lightly browned on top but still slightly soft and spongy to the touch, about 30 minutes. Loosen the crust from the outer ring with a butter knife and remove the ring while tart is still warm. Let tart cool about 15 minutes, then transfer to a cutting board using an offset spatula. If the tart will not be served warm, transfer to a wire rack instead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut with a sharp chef's knife; if desired, top each slice with a dollop of cherry pit whipped cream or pistachio whipped cream. This tart is also excellent with ice cream of any sort. Leftovers can be kept for about 2 days at cool room temperature, if wrapped in foil or stored in an airtight container. If desired, reheat leftovers for a few minutes in a 350&deg;F (180&deg;C) oven before serving."}]}