{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/08/20190708-7-minute-frosting-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "cake", "egg white", "frosting", "icing", "meringue", "swiss", "toasted sugar", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Old-Fashioned 7-Minute Frosting", "link": "https://www.seriouseats.com/recipes/2019/09/old-fashioned-7-minute-frosting.html", "description": "The popularity of this quick and easy frosting dates back to the early 20th century, but its name has always been a figure of speech rather than an exact figure. That said, it shouldn't take much longer than seven minutes to cook on the stove, so don't be afraid to adjust the heat as needed to keep things moving along. Use this frosting to keep desserts light after a heavy meal, or as a counterpoint to especially rich cakes like <a href=\"https://www.seriouseats.com/2017/06/how-to-make-a-coconut-cake.html\">coconut</a> or <a href=\"https://www.seriouseats.com/2018/02/devils-food-cake-one-bowl-no-mixer-diabolically-easy.html\">devil's food</a>.", "totalTime": "20 minutes", "recipeYield": "Makes about 5 cups", "recipeCategory": ["Cakes", "Desserts", "Eggs", "Gluten-Free", "Pastry", "Quick and Easy", "Stovetop"], "recipeIngredient": ["6 ounces egg whites (2/3 cup; 170g), from 5 to 6 large eggs", "12 1/4 ounces plain or <a href=\"https://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted sugar</a> (about 1 3/4 cups; 340g) (see note)", "3/4 teaspoon (3g) Diamond Crystal kosher salt, or more to taste; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon cream of tartar", "1 teaspoon (5ml) vanilla extract, or more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For a Stand Mixer With a Bowl-Lift Design:</strong> Tear off a long strip of foil and crumple it into a thick ring. Place it in the bottom of a 3-quart saucier, or similarly large, wide pot, and fill with roughly 1 1/2 inches water. Place over high heat until bubbling-hot, then adjust the temperature to maintain a gentle simmer.</p>\r\n<p>In a stainless steel stand mixer bowl, combine egg whites, toasted sugar, salt, and cream of tartar. Set over the steaming water so that the bowl is resting on the foil ring and touching neither the water nor the pot itself. Cook, stirring and scraping constantly with a flexible spatula, until egg whites register 175°F (79°C) on a digital thermometer; this should take no longer than 10 to 12 minutes. Transfer bowl to a stand mixer fitted with a whisk attachment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For a Stand Mixer With a Tilt-Head Design:</strong> Fill a large pot with a few inches of water. Place over high heat until bubbling-hot. In a large glass or ceramic bowl, combine egg whites, toasted sugar, salt, and cream of tartar. Set bowl over the steaming water, then cook, stirring and scraping constantly with a flexible spatula, until egg whites register 175°F (79°C) on a digital thermometer; this should take no longer than 12 minutes. Scrape mixture into the stand mixer bowl and fit stand mixer with a whisk attachment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vanilla extract, and whip the meringue on high speed until glossy, stiff, and cool to the touch. Along the way, pause mixing to taste the meringue, adjusting the salt and vanilla as needed; if using an extract of another flavor, fold it in with a flexible spatula at the very end, as the oil content of flavors like citrus, almond, or mint may otherwise deflate the meringue. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use immediately as a frosting for cake, and serve as soon as possible; at cool room temperature, the frosting will hold for about 24 hours, as the cake will slowly absorb the meringue over time. If desired, after frosting a cake, the exterior layer of meringue can be toasted like a marshmallow using a culinary blowtorch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Troubleshooting:</strong> While the approximate cooking times for the water bath are estimations at best, and will naturally vary from kitchen to kitchen, substantially missing the mark indicates heats that are vastly too high or low. When the meringue cooks much too fast, it is prone to scrambling, regardless of how thoroughly the bowl is scraped, resulting in a lumpy texture and eggy flavor. When the meringue is cooked too slowly, excess evaporation will dry the meringue, making it grainy and dense. In either event, adjusting the heat as needed will resolve the issue.</p>"}]}