{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/09/20190717-sea-urchin-pasta-uni-16.jpg", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "recipeCuisine": "", "keywords": ["sea urchin", "uni"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Creamy Sea Urchin (<i>Uni</i>) Pasta", "link": "https://www.seriouseats.com/recipes/2019/09/sea-urchin-uni-pasta-recipe.html", "description": "Fresh sea urchin, Mexican <i>crema</i>, and Calabrian chili join forces to make a quick and creamy pasta that's rich enough for a special occasion. ", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Dairy", "Fall", "Mains", "Other Seafood", "Pasta", "Quick and Easy", "Spring", "Stovetop"], "recipeIngredient": ["4 to 6 ounces fresh sea urchin (<i>uni</i>); see note", "1/3 cup (80g) Mexican-style <i>crema</i>, or crème fraîche", "10 ounces (300g) dried long pasta, such as spaghetti or <i>bucatini</i>", "Kosher salt", "1 tablespoon (15ml) extra-virgin olive oil, plus more for drizzling", "2 cloves garlic, finely minced", "1 small shallot, finely minced", "1 teaspoon (5ml) Calabrian hot chili spread (see note)", "1/2 cup (125ml) dry sake or dry white wine, such as Pinot Grigio", "Freshly ground black pepper", "Small handful finely minced fresh chives, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 4 tongues of sea urchin to use as garnish. Combine remaining sea urchin and crema using a blender, immersion blender, food processor, or mini chopper. Blend until completely smooth. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pasta in a 12-inch skillet or a saucepan and cover with water. Season with salt. Set over high heat and bring to a boil, stirring occasionally. Cook until pasta is just shy of al dente and retains a small chalky core."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat olive oil in a large skillet over medium heat until shimmering. Add garlic and shallot and cook, stirring constantly, until softened but not browned (lower heat if the aromatics threaten to brown), about 2 minutes. Add Calabrian chili spread and stir until homogeneous. Add sake or wine and cook until liquid is reduced down to less than 2 tablespoons, about 1 minute. Remove pan from heat and set aside until pasta is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pasta is cooked, use tongs to transfer the noodles directly from the boiling water to the pan with the garlic/oil mixture. Scrape uni purée into pan and add a few ounces of starchy pasta-cooking water. Set pan over high heat and cook, stirring and swirling constantly, until the sauce comes together and develops a creamy consistency and the pasta is fully cooked, about 1 minute. Add more pasta water as necessary to thin the sauce if it over-thickens. Season to taste with salt and black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta between warmed serving bowls, drizzle each portion with more extra-virgin olive oil, garnish each with a whole sea urchin tongue, sprinkle with minced chives, and serve."}]}