{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190226-freeze-dried-fruit-buttercream-strawberry-vicky-wasik-10.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "butter", "buttercream", "egg white", "freeze dried fruit", "frosting", "fruit", "icing", "meringue", "swiss", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Strawberry Frosting (Swiss Buttercream)", "link": "https://www.seriouseats.com/recipes/2019/03/strawberry-frosting-recipe.html", "description": "This light and silky buttercream is none too sweet and beautifully stable at room temperature. The finished product can be customized with a splash of extract, a drizzle of melted chocolate, concentrated fruit purées, or just about whatever you crave.", "totalTime": "40 minutes", "recipeYield": "Makes about 6 heaping cups", "recipeCategory": ["Cakes", "Desserts", "Eggs", "Gluten-Free", "Pastry", "Stovetop", "Strawberry"], "recipeIngredient": ["6 ounces egg whites (2/3 cup; 170g), from 5 to 6 large eggs", "11 ounces sugar (about 1 2/3 cups; 310g) (see note)", "3/4 teaspoon (3g) Diamond Crystal kosher salt; use half as much if iodized", "1/4 teaspoon cream of tartar", "20 ounces unsalted butter (5 sticks; 565g), softened to about 65°F (18°C)", "1 teaspoon (5ml) <a href=\"https://www.seriouseats.com/2017/12/how-to-choose-the-best-vanilla-extract.html\">vanilla extract</a>", "1 teaspoon <dorado id=\"rose-water-and-orange-blossom-water-combo-pack\" class=\"text\">rose water</dorado> (optional) ", "1/8 teaspoon Chinese five-spice powder", "Up to 2 1/2 ounces freeze-dried strawberries (volume will vary; 70g)", "Up to 1 ounce elderflower liqueur, or other flavorful liquids (about 2 tablespoons; 30g), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a wide pot with at least 1 1/2 inches of water, with a thick ring of crumpled tinfoil placed on the bottom to act as a \"booster seat\" that will prevent the bowl from touching the bottom of the pot. Place over high heat until steaming-hot and adjust temperature to maintain a gentle simmer. Combine egg whites, sugar, salt, and cream of tartar in the bowl of a stand mixer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set over steaming water, stirring and scraping constantly with a flexible spatula, until egg whites hold steady at 185&deg;F (85&deg;C). This should take only 10 to 12 minutes, so if mixture seems to be moving slowly, simply turn up the heat. Once ready, transfer to a stand mixer fitted with a whisk attachment and whip at high speed about 10 minutes, until meringue is glossy, stiff, and cool to the touch, around 90&deg;F (32&deg;C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With mixer still running, add butter, 1 or 2 tablespoons at a time. Initially, the volume of the meringue may decrease; it may even seem soupy along the way, but as the cool butter is added, the mixture will begin to thicken and cool. In the end, buttercream should be thick, creamy, and soft, but not runny, around 72&deg;F (22&deg;C). Mix in vanilla extract, rose water (if using), and five-spice powder on low speed until well-combined. Re-whip a few seconds more; if problems arise, consult the troubleshooting guide below. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Troubleshooting:</strong> If warmer than 74&deg;F (23&deg;C), the buttercream will be soft and loose; pop it in the fridge for 15 minutes and re-whip to help it thicken and cool. If colder than 68&deg;F (20&deg;C), the buttercream will be firm and dense, making it difficult to spread over cakes and slow to melt on the tongue, creating a greasy mouthfeel; to warm, briefly set over a pan of steaming water, just until you see the edges melting slightly. Re-whip to help it soften and warm. Full troubleshooting guide and video <a href=\"http://www.seriouseats.com/2017/05/how-to-fix-a-broken-swiss-meringue-buttercream.html\">here</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the buttercream's texture has been properly adjusted, grind the freeze-dried strawberries in a food processor until powdery and fine, with no visible chunks of fruit. Add this powder to the frosting, and re-whip until well-combined; reduce speed to low and drizzle in the liqueur or other liquids. Scrape the bowl and whisk attachment and whip 1 minute more, to ensure no unmixed trace of strawberry powder remains. Use immediately or transfer to an airtight container and refrigerate until needed, up to 1 week. The flavor will intensify slightly over the course of 24 hours. Thaw chilled buttercream to about 72&deg;F (22&deg;C) and re-whip before use. This recipe works well with any cake, especially a <a href=\"https://www.seriouseats.com/2017/08/how-to-make-a-natural-strawberry-cake.html\">strawberry layer cake</a>. "}]}