{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190225-neopolitan-cake-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "American", "keywords": ["buttercream", "eggless", "flour", "frosting", "icing", "milk"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.8571428571429", "ratingCount": "7"}, "name": "Flour Frosting (a.k.a. Ermine Frosting)", "link": "https://www.seriouseats.com/recipes/2019/05/flour-frosting-recipe.html", "description": "This beautiful vanilla frosting has a whipped cream&ndash;like flavor and texture that pairs just as well with devil's food as it does with strawberry cake.", "totalTime": "About 1 1/2 hours", "recipeYield": "Makes about 2 heaping cups (14 ounces)", "recipeCategory": ["American", "Dairy", "Frosting", "Stovetop"], "recipeIngredient": ["1 ounce all-purpose flour (about 3 tablespoons plus 2 teaspoons; 28g)", "6 ounces milk, <a href=\"https://www.seriouseats.com/2017/01/is-it-okay-to-bake-with-skim-milk.html\">any percentage will do</a> (about 3/4 cup; 170g)", "3 1/4 ounces (96g) plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted</a> sugar (see note)", "Heaping 1/4 teaspoon (1.5g) Diamond Crystal kosher salt, plus more to taste; for table salt, use about half as much by volume or the same weight", "6 ounces (160g) unsalted butter, softened to about 65°F (18°C)", "1/4 ounce vanilla extract (1 1/2 teaspoons; 7g), plus more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 10-inch skillet or 3-quart saucier, whisk together flour and milk. Place over medium heat, whisking constantly, and cook until thick and pudding-like, about 2 minutes. Off heat, add sugar and salt. Whisk until sugar has dissolved and the \"pudding\" is homogeneous but thin. Scrape mixture into a wide, shallow dish, such as a pie plate, and cool to approximately 70&deg;F (21&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place butter in the bowl of a stand mixer fitted with a paddle attachment. Mix on low until the butter looks smooth, then increase speed to medium and beat until soft and light, about 5 minutes. Begin adding the cooled pudding, a few tablespoons at a time. Once it's fully incorporated, pause to scrape bowl and beater with a flexible spatula, then resume beating until perfectly smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Switch to the whisk attachment and add vanilla. Whip on low to combine, then increase speed to medium-high and continue whipping until silky-smooth and soft, with a light, melt-in-your-mouth consistency, about 3 minutes more, or to a working temperature of approximately 75&deg;F (24&deg;C). Season to taste with additional salt and/or vanilla as needed. Use immediately, or consult the troubleshooting guide below to address any textural inconsistencies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Troubleshooting:</strong> If the frosting feels dense, stiff, greasy, or curdled, it is likely too cold; to warm, briefly set over a pan of steaming water, just until you see the edges melting slightly, then re-whip. If the frosting feels soft and loose, it is likely too warm. Pop it in the fridge for 15 minutes to cool, then re-whip."}]}