{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/01/20190113-cheesesteak-nachos-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "American", "keywords": ["cheesesteak", "entertaining", "game day", "mashup", "nacho", "party"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cheesesteak Nachos", "link": "https://www.seriouseats.com/recipes/2019/01/cheesesteak-nachos.html", "description": "Philly cheesesteaks served as the inspiration for this twist on a platter of nachos, with thinly sliced steak, melted provolone, homemade cheese sauce, and hot peppers standing in for the classic condiments and toppings.", "totalTime": "1 hour", "recipeYield": "Serves 6 to 8 as a snack", "recipeCategory": ["American", "Appetizers and Hors d'Oeuvres", "Beef", "Cheese", "Game Day", "Recipes", "Snacks"], "recipeIngredient": ["Canola or vegetable oil, for frying", "8 flour tortillas, cut into eighths (see note)", "1 large white onion (about 10 ounces; 285g), thinly sliced", "Kosher salt and freshly ground black pepper", "2 pounds (900g) boneless ribeye or sirloin steak, frozen for 2-3 hours", "8 slices provolone cheese", "8 ounces (225g) shredded cheddar cheese (about 2 cups)", "1 tablespoon cornstarch", "1 can (12 ounces; 355 ml) evaporated milk", "2 teaspoons (10ml) distilled white vinegar", "1/2 teaspoon  (3ml) Worcestershire sauce", "Sliced hot deli-style cherry peppers, for garnish", "Thinly sliced green onion, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with paper towels and set a wire rack on top. Fill a large, deep <dorado id=\"12-inch-cast-iron-skillet\" class=\"text\">cast iron skillet</dorado> with 1/2 inch oil. Heat over medium-high to 350&deg;F (177&deg;C). Working in batches, add tortilla wedges and fry, flipping halfway through, until puffed and lightly golden, 1-2 minutes. Transfer chips to prepared baking sheet. Season with salt right away; then transfer to large bowl. Repeat for remaining chips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain off all but 1 tablespoon of oil (extra oil can be strained and saved for later use). Return skillet to medium-high heat and add onion. Season with salt and pepper and cook, stirring occasionally, until tender and lightly golden, about 5 minutes. Transfer onions to another large bowl and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375&deg;F (190&deg;C). Using a sharp knife, slice frozen steak as thinly as possible. Season steak with salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another tablespoon of oil to pan and set over high heat until smoking. Working in batches to prevent crowding, add steak and cook, turning occasionally, until browned all over, about 4 minutes per batch. Remove from heat and toss in bowl with onions. Repeat with remaining steak."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer chips and steak mixture on a 9-by-13-inch rimmed baking sheet or baking dish. Top with provolone cheese. Bake until provolone is fully melted, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in large bowl, toss together cheddar cheese and cornstarch. Heat evaporated milk in medium saucepan over medium heat. Stir in cheddar, a bit at a time, until fully melted and incorporated. Reduce heat to low and stir in vinegar and Worcestershire sauce. Continue to cook, whisking constantly until thickened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour cheese sauce over nachos; top with sliced hot cherry peppers and green onion. Serve warm. "}]}