{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/06/20190605-romesco-sauce-vicky-wasik-24-1.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Spanish", "keywords": ["condiment", "nut", "pepper", "romesco", "sauce", "spanish", "tomato"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "<i>Romesco</i> Sauce", "link": "https://www.seriouseats.com/recipes/2019/06/romesco-sauce-recipe.html", "description": "This nutty and fruity Spanish sauce is best when you make it your own. You can serve your <em>romesco</em> sauce a million different ways: with roasted meats or grilled fish, with cooked or raw vegetables, on sandwiches, in soups, you name it.", "totalTime": "2 hours", "recipeYield": "Makes about 2 cups", "recipeCategory": ["Condiments and Sauces", "Dairy-Free", "Nuts", "Spanish", "Spring", "Summer", "Tomato", "Vegan", "Vegetarian"], "recipeIngredient": ["2 or 3 tomatoes (5 1/5 ounces or 150g each), cored (see note)", "1 medium head garlic, unpeeled, split in half", "1 ounce (30g) <a href=\"https://www.tienda.com/products/noras-dried-peppers-la-dalia-sp-41.html?aid=495\">dried <i>ñora</i> peppers</a> (about 4) or ancho chili peppers (about 3); see note", "1 slice toasted or stale bread (1 1/2 ounces; 40g), any thick and heavy crusts removed, bread broken into small pieces", "1 tablespoon (15ml) red wine or sherry vinegar, plus more if desired", "1/2 cup skinned and toasted almonds and/or hazelnuts (2 3/4 ounces; 80g); see note", "2 tablespoons (30ml) extra-virgin olive oil, plus more if desired", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350&deg;F (180&deg;C). Line a rimmed baking sheet with aluminum foil and place tomatoes and half of the garlic head on it. Roast in the oven until tomatoes are wrinkled and lightly charred in spots and garlic is soft, about 1 hour. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place dried peppers in a medium heatproof bowl and cover with boiling water. Place a weight or wet paper towel on top to help submerge the peppers. Let stand until peppers are fully softened, 30 minutes to 1 hour. If the peppers are very stubborn (as thick-skinned ñoras can be), you may need to tear a small hole in them to let water penetrate inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain peppers and discard stems and seeds. Using a <a href=\"https://www.seriouseats.com/2016/10/the-best-paring-knives.html\">paring knife</a>, carefully scrape the flesh from the skins. Discard skins. Peel skins from tomatoes and roasted garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make the Sauce Using a Mortar and Pestle:</strong> Add 3 cloves roasted garlic and 1 or 2 cloves skinned raw garlic to the mortar. (Feel free to make this recipe more or less garlicky, according to your own tastes, by adding or subtracting roasted or raw garlic.) Smash garlic to a paste with the pestle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bread and moisten with vinegar. Smash to a paste. Add nuts and smash as finely as you can. The mixture should have the consistency of a rough paste when you're done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Smash in the scraped pepper flesh, followed by the skinned roasted tomatoes. Mix in olive oil until thoroughly combined. Season with salt. Add more oil, 1 tablespoon (15ml) at a time, if a thinner, richer sauce is desired. Add more vinegar to taste as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make the Sauce Using a Countertop Blender or Immersion Blender:</strong> Add 3 cloves roasted garlic and 2 cloves skinned raw garlic to the jar of a blender, or blending container if using an immersion blender. (You can use more or less roasted and raw garlic, as desired, according to your own tastes.) Add nuts. Blend until finely processed, scraping down sides as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend in skinned roasted tomatoes and scraped pepper flesh. Add bread, olive oil, and vinegar, and blend until smooth. (How smooth to make it is up to you; some texture is okay.) Season with salt and add more oil and vinegar to taste, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make the Sauce Using a Food Processor:</strong> In the bowl of a food processor, combine 3 cloves roasted garlic and 2 cloves skinned raw garlic (use more or less roasted and raw garlic, as desired, according to your own tastes), along with bread and nuts. Process, scraping down sides as necessary, until finely chopped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add skinned roasted tomatoes and scraped pepper flesh and process until a thick, rough paste forms. Process in olive oil and vinegar, then season with salt. Add more vinegar and olive oil, as desired, to adjust taste and texture."}]}