{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/10/20191009-diwali-treats-vicky-wasik-48-chiroti.jpg", "author": {"@type": "Person", "name": "Chetna Makan"}, "recipeCuisine": "Indian", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Savory <i>Chiroti</i>", "link": "https://www.seriouseats.com/recipes/2019/10/savory-chiroti-recipe.html", "description": "A savory version of <i>chiroti</i>, the traditionally sweet deep-fried snack that's eaten during the Diwali holiday.", "totalTime": "2 1/2 hours", "recipeYield": "Makes 20 to 25 chiroti", "recipeCategory": ["Deep Frying", "Diwali", "Indian", "Snacks"], "recipeIngredient": ["<strong>For the Dough:</strong>", "1 1/4 cups plus 3 1/2 tablespoons (210g) all-purpose flour", "1/2 cup plus 1 tablespoon (100g) fine semolina flour", "1/2 teaspoon Diamond Crystal kosher salt; if using table salt, use half as much by volume or an equivalent weight", "1/2 teaspoon freshly ground black pepper", "2 tablespoons <a href=\"https://www.seriouseats.com/recipes/2015/08/clarified-butter-recipe.html\">ghee</a>", "1/2 cup (120ml) water", "<strong>For the Paste:</strong>", "2 tablespoons ghee, melted", "3 tablespoons (30g) rice flour", "Sunflower oil or other neutral oil, such as canola or peanut, for deep-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Start the Dough:</strong> In a medium mixing bowl, thoroughly whisk together all-purpose flour, semolina flour, salt, and pepper. Add ghee to bowl and, using your hand, rub it into dry ingredients until well incorporated. Slowly drizzle in water, while mixing with your hand, until a firm yet supple dough forms; add the water slowly and make sure to mix it well as you go, as you may need slightly more or less water to reach the desired dough consistency. Cover bowl with plastic wrap and allow dough to rest at room temperature for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Make the Paste:</strong> In a small mixing bowl, stir together liquid ghee and rice flour to form a paste. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Form the Chiroti:</strong> Once dough has rested, divide it into 2 equal portions. Transfer one portion to a work surface and keep the other covered with plastic to prevent drying."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, roll the dough into a uniform log shape, then divide it into 5 equal portions, each weighing about 1.7 ounces (50g)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, form each piece of dough into a ball. Using a rolling pin, and working with one piece at a time, roll each dough portion into a thin circle, flipping and rotating the dough 90 degrees between rolls, until it is about 6 to 7 inches (15 to 18cm) in diameter. Keep the rolled dough portions covered with a kitchen towel to prevent drying."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once all 5 small dough balls have been rolled into thin circles, set one circle on a work surface. Using a pastry brush, brush dough circle all over with the paste. Set another dough circle directly on top of the first one and brush it with the paste. Continue until you have a stack of all 5 dough circles, each brushed with the paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the stack of dough rounds tightly, like a jelly roll. Using a sharp knife, cut the roll into 1/2-inch-thick rounds. Using a rolling pin, roll each of the pieces out into oval whorls about 3 to 4 inches (8 to 10cm) long. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat steps 4 through 7 with the second portion of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Fry the Chiroti:</strong> In a heavy-bottomed pot, heat 2 inches oil to 365&deg;F (185&deg;C) over medium to low heat. Carefully add a few whorls of dough to the oil, making sure not to crowd the pot; each whorl should have enough space to float without overlapping any others. Fry, turning once or twice, until golden and crisp on both sides, about 4 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spider, slotted spoon, or strainer, transfer chiroti to paper towels to drain. Repeat with remaining whorls. Serve hot or at room temperature."}]}