{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/06/20190525-pistachio-buns-vicky-wasik-29.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["instant yeast", "pistachio"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Pistachio Buns", "link": "https://www.seriouseats.com/recipes/2019/08/pistachio-buns.html", "description": "This recipe works particularly well as a two-for-one follow-up to <a href=\"TK\">pistachio ice cream</a>, a recipe that generates exactly enough milk-soaked pistachios for a batch of <a href=\"https://www.seriouseats.com/2019/07/how-to-make-homemade-pistachio-paste.html\">homemade pistachio paste</a>. With that laced into the dough, filling, and frosting, every bite of these breakfast buns will be fragrant, nutty, and (yes) green. ", "totalTime": "10 hours", "recipeYield": "Makes 12 (3 1/2–inch) pistachio buns", "recipeCategory": ["Baking", "Bread", "Breakfast and Brunch", "Breakfast Sweets", "Easter", "Pastry"], "recipeIngredient": ["<strong>For the Filling:</strong>", "7 1/2 ounces <a href=\"https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-paste.html\">homemade pistachio paste</a>, made from toasted pistachios (about 3/4 cup; 210g)", "2 ounces unsalted butter, brought to about 70°F/21°C (about 5 tablespoons; 55g)", "<strong>For the Dough:</strong>", "18 ounces all-purpose flour (about 4 cups, spooned; 510g), plus more for rolling", "2 teaspoons instant yeast, such as SAF (not rapid-rise; see note)", "2 teaspoons (8g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "10 ounces <a href=\"https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-paste.html\">homemade pistachio paste</a> (about 1 cup; 285g), made from toasted pistachios, brought to about 70°F/21°C", "8 ounces plain, unsweetened Greek yogurt (about 1 cup; 225g), any percentage will do, brought to about 70°F/21°C", "4 ounces milk (about 1/2 cup; 115g), any percentage will do, brought to about 70°F/21°C", "2 ounces roasted pistachio oil (about 5 tablespoons; 55g)", "4 ounces <a href=\"https://www.seriouseats.com/2019/06/how-to-blanch-pistachios.html\">blanched, peeled, and lightly toasted pistachios</a> (a shy cup; 115g), or more to taste, optional", "<strong>For the Frosting:</strong>", "6 ounces heavy cream (about 3/4 cup; 170g)", "2 1/2 ounces chilled <a href=\"https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-paste.html\">homemade pistachio paste</a>, made from toasted pistachios (about 1/4 cup; 70g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Filling:</strong> In the bowl of a stand mixer fitted with a paddle attachment, beat the pistachio paste and butter until creamy and smooth. Transfer the pistachio filling to a small zip-top bag or a disposable pastry bag, scraping the bowl as thoroughly as you can with a flexible spatula.  Wipe the bowl with a paper towel, and proceed to the next step (no need to wash)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> In the stand mixer bowl from the last step, whisk the flour, yeast, and salt until thoroughly combined. In a quart-sized liquid measuring cup, combine the pistachio paste, Greek yogurt, milk, and pistachio oil, mixing by hand or with an immersion blender until homogenous and smooth. Add to flour-mixture and stir to form a very dry and shaggy dough. With the hook attachment, knead on low until silky-smooth, elastic, and able to be gently stretched into a thin but rough sheet without tearing, about 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First Rise:</strong> Cover bowl with plastic and set dough to rise until puffy, light, and doubled in bulk, about 2 hours at roughly 70&deg;F (21&deg;C). If the dough feels dense, firm, or overly resilient, rest 30 minutes before testing again. It's normal for the timing of this step to vary, depending on ambient conditions, with doughs moving faster in warmer environments, and slower when things are cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shaping and Second Rise:</strong> Turn dough onto a lightly floured surface, dust with flour, and roll into a 13-inch square. Snip a corner from the bag of pistachio filling, squeeze over the dough, and spread into an even layer with an offset spatula. Sprinkle additional pistachios on top, if using, and roll into a log, ending seam side down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide an 8-inch strand of thread, unflavored dental floss, or butcher's twine under the dough until you reach the middle. Cross the ends over the top and pull tight to divide the log in two. Cut each half into six even portions and arrange in a parchment-lined 9- by 13- by 2-inch aluminum baking pan (or two 8-inch by 3-inch round cake pans). Cover rolls with foil and refrigerate overnight, or up to 48 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Frosting:</strong> Place the pistachio paste and cream into a measuring cup, blending container, or jar just large enough to accommodate the head of an immersion blender. If the container is too large, the cream layer will not be deep enough for proper blending. If the container is too small, the blades will not reach the paste at the bottom of the jar. Alternatively, the ingredients can be placed in the bowl of a food processor. Process until the mixture is creamy and thick, like a frosting; the time can vary substantially depending on the equipment itself, so closely monitor the texture and body of the cream to find the ideal timing for your equipment. Transfer to an airtight container and refrigerate until needed, up to 48 hours. Alternatively, the frosting can be prepared while the pistachio buns are in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Bake and Serve:</strong> Adjust oven rack to middle position and preheat to 350&deg;F (180&deg;C); meanwhile, let pistachio buns stand at room temperature until oven is hot. Bake, covered, until pistachio buns are puffed and firm but pale, about 35 minutes. (If using darker pans, check on the buns even sooner.) Remove the foil and continue baking until lightly browned, about 15 minutes more. Let the buns cool about 15 minutes to help set the crumb, then serve with a generous dollop of frosting over each bun.  Serve immediately, and leave no survivors, the buns do not hold up well with time.</p>"}]}