{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190321-lomo-saltado-vicky-wasik-28.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Latin American", "keywords": ["beef", "beef tenderloin", "Peruvian", "potato", "South American", "steak", "wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "<i>Lomo Saltado</i> (Peruvian Stir-Fried Beef With Onion, Tomatoes, and French Fries)", "link": "https://www.seriouseats.com/recipes/2019/03/lomo-saltado-peruvian-stir-fried-beef-with-onion-tomatoes-and-french-fries.html", "description": "Tender slices of deeply seared beef, blister-y onions, juicy tomatoes, and crispy French-fried potatoes unite in this classic Chinese-Peruvian stir-fry.", "totalTime": "25 minutes", "recipeYield": "Serves 2 as a hefty main course or 4 as a lighter one", "recipeCategory": ["Father's Day", "French Fries", "Latin American", "Mains", "Onion", "Quick Dinners", "Steak", "Stir Frying", "Stovetop", "Tomato"], "recipeIngredient": ["1 pound (450g) beef tenderloin, skirt steak, or other tender and flavorful quick-cooking steak", "1/4 cup (60ml) peanut, canola, or vegetable oil, divided, plus more if needed", "Kosher salt", "1 medium (8-ounce/225g) red onion, cut into 1/2-inch slices", "4 scallions (about 2 ounces/60g total), roots and any wilted parts trimmed, remainder cut into 2-inch lengths", "1 fresh or frozen <em>ají amarillo</em> chili pepper (about 2 ounces/60g), defrosted if frozen, then stemmed, seeded, and sliced lengthwise into matchsticks (see note)", "2 medium plum tomatoes (about 5 1/2 ounces/160g total), cored and cut into 3/4-inch-thick wedges", "2 medium cloves garlic, minced", "1-inch piece peeled fresh ginger (about 1/4 ounce; 7g), minced", "1 tablespoon plus 1 teaspoon (20ml) soy sauce", "1 tablespoon (15ml) apple cider vinegar", "2 teaspoons minced fresh cilantro leaves and tender stems", "Freshly ground black pepper", "<a href=\"https://www.seriouseats.com/recipes/2010/05/perfect-french-fries-recipe.html\">French fries</a>, for serving", "Cooked long-grain rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the beef across the grain into roughly 1/2-inch-thick strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok or large cast iron or stainless steel skillet, heat 2 tablespoons (30ml) oil over high heat until heavily smoking. Meanwhile, season beef all over with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, add just enough beef to the pan to sear it heavily without steaming in its own juices. Spread the beef around so the pieces are evenly spaced apart and allow to cook until very well seared and charred on one side, 30 seconds to 1 minute. Stir and toss beef so that it cooks all over, about 30 seconds longer; if you are working over a gas flame and aren't afraid of some fire, toss the beef near the flame so that the oil briefly combusts in big bursts. (If this makes you nervous, don't allow it to catch fire. Instead, manage the heat to prevent flare-ups.) Using a spatula, transfer beef to a platter to rest. Repeat with remaining beef, always getting the pan smoking-hot before the next batch and adding more oil if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the beef is cooked, return the empty pan to high heat. Add 1 tablespoon (15ml) oil and heat until smoking. Working in batches, add just enough red onion so that it sears and browns rapidly without steaming, about 30 seconds. Toss a few times until the onion is crisp-tender. Using a spatula, transfer onion to a platter. Repeat with remaining onion, always heating the pan until smoking first and adding more oil if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the empty pan to high heat, add 1 tablespoon (15ml) oil, and heat until smoking. Working in batches if necessary, add scallions and cook, without stirring, until seared on bottom side, about 30 seconds. Push scallions to the side and add peppers. Cook until seared, about 30 seconds longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push scallions and peppers to the side and add tomatoes to the pan, allowing them to sear on one side, about 30 seconds. (If your burner isn't very strong, you can remove the scallions and peppers from the pan before adding the tomatoes to guarantee good searing. Otherwise, leave them in.) Try not to let the tomatoes grow too soft and pulpy; it's better that they retain their shape rather than brown to the point of becoming mushy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic and ginger and cook, tossing and stirring constantly, until lightly sautéed and fragrant, about 15 seconds. Add soy sauce and vinegar and toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return beef and all accumulated juices to the pan along with the red onions. (If you've removed the scallions and peppers, add them back now, too.) Add cilantro. Toss over high heat to combine well, seasoning with salt and pepper as you go. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon stir-fry onto plates with a mound of cooked rice and French fries and serve right away."}]}