{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/05/veggalette.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["asparagus", "cheese", "galette", "leek", "mushroom", "pie", "spring", "vegetable"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Asparagus, Mushroom, Leek, and Cheese Galette", "link": "https://www.seriouseats.com/recipes/2019/05/savory-asparagus-mushroom-leek-and-cheese-galette.html", "description": "Easy to throw together, this springtime vegetable tart is loaded with tender fresh green produce and flavorful cheese.", "totalTime": "2 hours", "recipeYield": "Serves 4 to 8", "recipeCategory": ["Asparagus", "Breakfast and Brunch", "Cheese", "Mushrooms", "Spring", "Vegetarian"], "recipeIngredient": ["1/2 batch <a href=\"https://www.seriouseats.com/recipes/2016/06/old-fashioned-flaky-pie-dough-recipe.html\">Old-Fashioned Flaky Pie Dough</a>", "1/4 cup plus 1 tablespoon (75ml) extra-virgin olive oil, divided, plus more for drizzling", "1 pound (450g) mixed mushrooms, such as cremini, stemmed and caps sliced 1/4 inch thick", "Kosher salt", "1 pound (450g) asparagus, woody ends trimmed, stalks cut on the bias 1/4 inch thick, tips reserved", "1 teaspoon minced fresh thyme leaves", "4 tablespoons (60g) unsalted butter ", "1 1/2 pounds leeks, white and light green parts only, halved lengthwise then cut crosswise into 1/4 inch thick half-moons", "2 ounces (55g) grated Fontina cheese", "1 large egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare Old-Fashioned Flaky Pie Dough according to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a 14-inch round. Transfer to a parchment-lined aluminum rimmed baking sheet, cover with plastic, and refrigerate to relax and chill dough, at least 2 hours or up to 24."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan or cast iron skillet, heat 4 tablespoons (60ml) olive oil over medium-high heat until shimmering. Add mushrooms and cook, stirring occasionally, until browned, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in asparagus stalks, thyme, and the remaining 1 tablespoon (15ml) olive oil. Lower heat to medium and cook, tossing and stirring, until asparagus is tender, about 8 minutes. Add 3 tablespoons (45ml) water to skillet, scraping up browned bits from bottom of pan. Season with salt and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large saucepan, melt butter over medium heat until foaming. Add leeks and cook, stirring, until very soft, about 8 minutes. Lower heat if necessary to prevent browning. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the leeks to the asparagus mixture along with the cheese and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position and preheat to 400&deg;F. Spread asparagus-leek mixture on prepared dough round, leaving about a 2-inch border of dough all around. With a sharp knife, cut a series of slits in the border of dough, each running from filling to edge of dough, spacing them about 5 inches apart. Fold each segment of dough over filling, tugging gently so the edge of each segment tightly overlaps the one that came before. Chill galette for 10 minutes in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, drizzle reserved asparagus tips with olive oil, season with salt, and toss to coat lightly and evenly. Arrange asparagus tips on top of exposed filling in center of the galette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush egg over chilled dough in a thin, even layer (including under each flap). This will give the crust a glossy, golden sheen and help bind the pieces together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until galette is golden brown around the edges and bubbling in the center, about 45 minutes longer. Let cool 5 minutes, then slice into wedges and serve warm."}]}