{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/images/2016/05/20160512-octopus-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["octopus"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Perfectly Cooked Boiled Octopus", "link": "https://www.seriouseats.com/recipes/2019/09/perfectly-cooked-boiled-octopus.html", "description": "There's no need to feel anxious about cooking octopus. It's easy, and getting tender results requires nothing more than time. This recipe for boiled octopus on the stovetop is all you need, and from there you can do whatever you want with your perfectly cooked cephalopod.", "totalTime": "1 hour 45 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Other Seafood", "Stovetop"], "recipeIngredient": ["1 (2 1/2-pound; 1kg) whole octopus, rinsed well (including inside head cavity); see note"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a pot large enough to hold the octopus with the octopus and enough cold water to cover. Set over high heat. Bring water to a simmer, then lower heat to maintain simmer. Cook until octopus is tender enough that you can pierce the thick part of a tentacle with a paring knife with little resistance, about 1 hour; keep in mind that this time is a rough estimate, and the octopus may be done sooner or it may take longer, but it will get there."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let octopus cool in the cooking water. Drain, wrap in plastic or store in an airtight container, and refrigerate until chilled. (Chilling helps set the skin so it doesn't fall off later, so it's good to do even if you're planning to serve the octopus warm.) The octopus can be refrigerated for up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, carve the octopus by cutting off the tentacles where they converge on the body. At this convergence point, you will also find the hard beak; remove it. Cut away and discard the octopus's eyes as well. You can eat all that remains of the the tentacles and head pouch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve Cold:</strong> Cut tentacles and head into pieces and add to a seafood salad or ceviche.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Sear:</strong> Heat a tablespoon or two of vegetable oil in a skillet over high heat until shimmering. Add octopus pieces and cook until well browned and crisp, about 3 minutes. Turn and brown on other side, about 3 minutes longer. Season with salt and serve as desired.</p>"}]}