{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/04/20190416-pork-shoulder-vicky-wasik-64.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Thai", "keywords": ["Northern Thai", "Northern Thailand", "sticky rice", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Thai Sticky Rice (<em>Khao Niao</em>)", "link": "https://www.seriouseats.com/recipes/2019/05/thai-sticky-rice-khao-niao.html", "description": "Give glutinous rice the spa treatment&mdash;soak and then steam&mdash;for simple Thai-style sticky rice.", "totalTime": "40 minutes plus at least 2 hours soaking time", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Recipes", "Rice", "Sides", "Stovetop", "Thai"], "recipeIngredient": ["4 cups (28 ounces; 800g) Thai sticky rice (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, cover rice with cool water for at least 4 hours or up to overnight. Alternatively, to speed up the process, use hot water, and soak the rice for at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fine-mesh strainer, drain the rice, discarding the cloudy soaking water. Refill the bowl with cool water so that when the fine-mesh strainer is set inside it, the rice in the strainer is fully submerged under water. Using your hands, stir the rice in the strainer to release starch into the water, making it cloudy. Lift the strainer with the rice out of the bowl, and discard the soaking water. Repeat this process until the water in the bowl is mostly clear, about 3 more times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble a steamer, filling the bottom with 1 to 2 inches of water, and lining the steamer basket with a double-layer of damp cheesecloth that has a 3-inch overhang over the sides of the basket. Transfer rice to cheesecloth-lined steamer basket, and use your hands to pat rice into an even layer. Fold overhanging cheesecloth over the rice to form a parcel, then cover with a lid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water in steamer to a boil over high heat, place steamer basket over it, and lower heat to a steady simmer. Cook for 10 minutes, then remove lid and carefully flip parcel of rice over. Cover again with lid, and continue to cook until rice is tender, but still chewy, about 10 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, and flip bundle over once more so that the folded over parts of cheesecloth are facing you. Transfer rice to a heatproof bowl and cover it with a plate (you can discard the cheesecloth at this point, or if you used a bamboo steamer and wish to use the steamer basket as a serving vessel, keep the rice in its cheesecloth parcel and unwrap it right before serving). Let rice cool slightly for 10 to 15 minutes before serving. Serve immediately."}]}