{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/04/20190416-shio-tade-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": ["condiment", "Japanese", "ramen", "sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "<i>Shio Tare</i> (Salt Seasoning Sauce for Ramen)", "link": "https://www.seriouseats.com/recipes/2019/04/shio-tare-recipe.html", "description": "<i>Shio tare</i> basically translates to \"salt seasoning,\" and this simple solution of lemon, salt, and dried kelp makes an incredibly versatile flavoring agent.", "totalTime": "24 to 48 hours", "recipeYield": "Makes about 1 cup (240ml) shio tare", "recipeCategory": ["Condiments and Sauces", "Dairy-Free", "Gluten-Free", "Japanese", "Lemon", "Ramen", "Stovetop", "Vegan", "Vegetarian"], "recipeIngredient": ["24 ounces (680g) \"used\" lemon rinds, cut into eighths (see note)", "5 ounces (140g) kosher salt (see note)", "1/4 ounce kombu, or dried kelp (7g; about one 7- by 2-inch piece)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each lemon rind into a few chunks and toss with salt in a large glass, ceramic, or stainless steel mixing bowl. Cover tightly with plastic wrap and place in refrigerator for 12 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a cheesecloth-lined or fine-mesh stainless steel strainer set over a nonreactive bowl, strain the liquid that has collected at the bottom of the bowl. Working in batches, transfer rinds to a stainless steel or plastic potato ricer and squeeze to release any extra liquid, allowing it to pass through strainer into bowl. (You can also twist the rinds in a doubled-over sheet of cheesecloth, wrapping the ends of the cheesecloth around a spoon for torque to help express the liquid; see our article on <a href=\"https://www.seriouseats.com/2011/12/how-to-make-latkes-chanukah-hanukkah-recipe-guide.html\">making latkes</a> for photos and a fuller description of the technique.) Discard rinds and any salt left in the strainer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape liquid and any solid salt in bottom of bowl into a small plastic or glass container; there should be about 1/2 cup (120ml) liquid. Submerge kombu in liquid, cover, and place in refrigerator for 12 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove kombu from liquid and place in a small saucepan along with 1/2 cup (120ml) water. Bring to a simmer over medium-high heat; do not allow to come to a boil. Once the mixture comes to a simmer, shut off the heat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When kombu dashi is cool, strain it into salt-lemon solution, stirring to dissolve any solid salt at the bottom of the container; discard kombu. Refrigerate tare for up to 2 months."}]}