{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/11/20191105-jelly-roll-vicky-wasik-19.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["jelly roll"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2", "ratingCount": "5"}, "name": "Old-Fashioned Jelly Roll", "link": "https://www.seriouseats.com/recipes/2019/11/old-fashioned-jelly-roll.html", "description": "Compared to traditional jelly roll recipes, this beautiful roulade relies on a streamlined recipe and technique to keep things simple: no flipping the cake onto a towel or pre-rolling it to cool. Just bake and cool it right in the pan, under a sheet of foil to help keep it pliable and moist. No mess, no fuss, and most importantly: no cracks.", "totalTime": "About 2 1/2 hours", "recipeYield": "Makes one 16-inch roll cake, serving 12 to 16 depending on how it is cut", "recipeCategory": ["Baking", "Cakes", "Christmas", "Cranberry", "Fruit Desserts", "Thanksgiving"], "recipeIngredient": ["<strong>For the Cake:</strong>", "4 large eggs, straight from the fridge (about 7 ounces; 200g)", "7 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted</a> sugar (about 1 cup; 200g)", "3/4 teaspoon baking powder", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon baking soda", "3 ounces pistachio oil, roasted hazelnut oil, or <a href=\"https://www.seriouseats.com/recipes/2015/08/clarified-butter-recipe.html\">melted ghee</a> (shy 1/2 cup; 85g) or melted butter (about 6 tablespoons; 85g)", "1/2 ounce vanilla extract (about 1 tablespoon; 14g)", "4 1/2 ounces all-purpose flour, such as Gold Medal blue label (about 1 cup, spooned; 127g)", "<strong>For the Filling:</strong>", "1/2 recipe (about 2 heaping cups; 21 ounces; 595g) <a href=\"https://www.seriouseats.com/recipes/2017/12/cranberry-trifle.html\">Cranberry Jam</a>, brought to room temperature; volume and weight for alternative will vary substantially", "<strong>For the Frosting (optional):</strong>", "1/2 recipe <a href=\"https://www.seriouseats.com/recipes/2019/10/apple-cinnamon-sugar-recipe.html\">Apple Cinnamon Sugar</a>", "12 ounces heavy cream (about 1 3/4 cup; 340g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> Adjust oven rack to lower-middle position and preheat to 350&deg;F. Line an aluminum half-sheet pan with parchment along the bottom, and grease with pan spray or oil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Cake:</strong> In the bowl of a stand mixer fitted with a whisk attachment, combine the eggs, sugar, baking powder, salt, and baking soda. Mix on medium-low speed until the sugar has dissolved and the mixture is homogenous, smooth, and runny, but with fine bubbles beginning to form throughout, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase speed to medium and whip until the mixture is pale yellow, thick enough to fall from the whisk in ribbons, and filled with fine, foamy bubbles, about 5 minutes. Finally, increase speed to high, and continue whipping until the mixture is quite pale, roughly doubled in volume, and thick enough that the whisk leaves a vortex-like pattern in its wake, about 5 minutes. When allowed to run off the whisk and into the bowl, the mixture should be able to briefly mound up on itself before leveling off. Please bear in mind all times are ballpark figures only, and may vary considerably depending on the power and capacity of a given stand mixer, along with factors such as bowl-to-beater clearance (more on that <a href=\"https://www.seriouseats.com/2018/07/stand-mixer-running-slow-you-may-need-to-adjust-its-bowl-height.html\">here</a>). In all cases, the visual and textural cues should be the primary guideline to determine readiness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the foamed eggs are fluffy and thick, reduce speed to medium-high and add the vanilla and oil or melted butter all at once in a steady stream. Immediately reduce speed to medium-low, and add the sifted flour all at once. When the flour is nearly incorporated, shut off the mixer and remove the whisk attachment. Grasping the attachment by its top, give the batter a few strokes of the whisk by hand to finish incorporating the flour. Fold the batter once or twice from the bottom up with a flexible spatula, then scrape into the prepared pan and spread into an even layer with an offset spatula. Bake until puffed and lightly browned from edge to center, and firm to the touch but still puffy and soft enough to retain a shallow impression when gently poked, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately after removing the cake from the oven, cover the half-sheet pan with two large strips of foil, using a kitchen towel or oven mitt to crimp the foil around the edges of the pan. Allow the cake to cool until approximately 70&deg;F (21&deg;C) (if not allowed to cool sufficiently, it may cause the filling to melt; if cooled too much, it may harden in the cold and thus crack when rolled)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Loosen the edges of the cooled cake from the pan with a butter knife, and give the cranberry jam a good stir before spreading it into an even layer over the cake. Please see the note about using other jams or jellies, as the exact amount (in terms of both weight and volume) will differ substantially depending on the consistency and moisture content. Working along the widest end, lift the edge of the cake by the parchment underneath and gently fold it inward until it turns over itself. Continue rolling, using the parchment to lift and maneuver the cake; it will naturally peel away as you go."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After rolling, transfer the cake to a large platter and serve right away, or cover with plastic until needed. If you like, make a simple frosting by whipping the apple-cinnamon sugar, cream, and salt together until thick and stiff enough to spread; this can be refrigerated in an airtight container and used to cover the cake just before serving. Alternatively, the cake can be finished with a dusting of powdered sugar. Unfrosted, the cake will keep for about 24 hours at room temperature; if frosted with whipped cream, it will need to be covered, refrigerated for up to 24 hours, and then set out to room temperature about an hour before serving."}]}