{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/10/20191021-apple-cider-donuts-sarah-jane-webb-24.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["cider", "refined coconut oil"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "The Best Apple Cider Doughnuts", "link": "https://www.seriouseats.com/recipes/2019/10/the-best-apple-cider-donuts.html", "description": "This gently spiced, yeast raised dough is made with apple cider, an ingredient that plays a bigger role in texture than flavor. Here, the bright apple flavor of the doughnut comes from freeze-dried apples ground into a fine powder for the cinnamon sugar topping. Together, the cider dough and apple sugar come together in a doughnut that's crisp and light, but chewy, with loads of apple in every bite.", "totalTime": "Four hours", "recipeYield": "Makes 12 to 15 3 1/2-inch doughnuts, depending on how the dough is handled", "recipeCategory": ["Apple", "Breakfast Sweets", "Dairy-Free", "Deep Frying", "Doughnuts", "Fall", "Pastry", "Vegan", "Winter"], "recipeIngredient": ["13 1/2 ounces bleached all-purpose flour, such as Gold Medal, plus more for kneading (about 3 cups, spooned; 385g)", "1/2 ounce sugar (about 1 tablespoon; 15g)", "1 1/4 teaspoons (5g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1 1/2 teaspoons (5g) instant dry yeast, such as <dorado id=\"instant-yeast\" class=\"text\">SAF</dorado>; not RapidRise or active dry (more info <a href=\"https://www.seriouseats.com/2018/03/all-about-dry-yeast-instant-active-dry-fast-acting-and-more.html\">here</a>)", "1/4 teaspoon freshly grated nutmeg", "1/4 teaspoon ground cinnamon", "1/4 teaspoon baking soda", "1/8 teaspoon ground cloves", "9 ounces apple cider; do not use a reduction (about 1 cup, plus 2 tablespoons; 255g)", "1/4 ounce rose water (about 1 1/2 teaspoons; 7g) (optional)", "1/8 teaspoon almond extract (optional)", "2 ounces hazelnut oil, or brown butter (just over 1/4 cup; 55g)", "Refined coconut oil, such as <a href=\"https://www.amazon.com/dp/B01766NTU8/?tag=serieats-20\">Nutiva</a>, for frying (see note)", "<strong>For the Topping:</strong>", "1 recipe <a href=\"https://www.seriouseats.com/recipes/2019/10/apple-cinnamon-sugar-recipe.html\">Apple-Cinnamon Sugar</a> (about 1 1/4 cups; 8 ounces; 225g), or cinnamon sugar to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Making the Dough:</strong> Combine flour, sugar, salt, yeast, nutmeg, cinnamon, baking soda, and cloves in the bowl of a food processor, and pulse to combine. With the processor running, add the apple cider, rose water (if using), and almond extract (if using) all at once. Process until the mixture comes together in a soft, sticky, but well-structured dough, about 50 seconds. With the processor still running, add the oil and process only until well-combined, about 10 seconds more. At this stage, the dough may have a rough texture and slightly oily sheen, but this is normal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Proofing the Dough:</strong> Transfer dough to a lightly greased bowl, cover, and proof until the dough is puffy, light to the touch, and roughly doubled in bulk. When pressed gently with a flour dusted finger tip, a shallow impression will form but spring back after a minute. The exact timing will vary depending on the temperature of the ingredients, as well as the proofing environment, but expect about 2 hours when proofing at 70&deg;F (21&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Forming the Doughnuts:</strong> When the dough is puffy and light, transfer to a lightly floured work surface, dust the surface with a touch more flour, and roll to a thickness of 12mm (just shy of 1/2 inch). Take care not to roll the dough too thin at this stage; at 1/4inch or 7mm, the doughnuts will turn out thin and flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust off excess four with a pastry brush, then cut the dough into 3-inch rounds. Cut a 1-inch round from the center of each to form a ring, or form the ring by poking a hole in the center of each round, then gently stretching the dough to form a ring. Place on a lightly greased baking sheet, then knead the scraps together. Let the scrap dough relax a few minutes, then roll, cut, and shape a final few doughnuts. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Second Rise:</strong> Cover the prepared doughnut rings with plastic wrap, and proof until they rise to thickness of 18mm (just over 1/2 inch), with a light but sturdy texture. The timing at this stage will vary depending on environmental conditions, but expect about 1 hour at 70&deg;F (21&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Preparing the Oil:</strong> Fill a 5-quart stainless steel or enameled Dutch oven with enough melted, refined coconut oil to achieve a depth of about 3 inches. Clip on digital thermometer and heat oil to 365&deg;F (185&deg;C) over medium heat. Meanwhile, line a baking sheet with a double layer of paper towels, and have the prepared apple-cinnamon sugar nearby."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Frying the Doughnuts:</strong> When oil reaches 365&deg;F, practice maintaining that temperature for a few minutes before starting. Once you're comfortable with the controls, slip a test doughnut into the hot oil and fry until pale gold, turning frequently with tongs to ensure even color, about 75 seconds per side. When done, transfer the doughnut to the paper towel–lined baking sheet and, when cool enough to handle, break open to see how you like the consistency. If needed, see troubleshooting section below. Adjust temperature as needed, and proceed accordingly with the remaining doughnuts, frying no more than 4 or 5 at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Serve:</strong> Place the prepared apple-cinnamon sugar in a wide dish, such as a pie plate. When each doughnut is cool enough to handle, dip into the sugar, and turn to coat both sides. Transfer to a serving platter, and enjoy immediately. These doughnuts are best when fresh and warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Troubleshooting:</strong> If the raw doughnuts seem heavy and dense, with a tight crumb after frying, the dough is underproofed; allow the doughnuts to rise a while longer, preferably in a slightly warmer environment to speed the process along. If the raw doughnuts feel puffy and almost fragile to the touch, with a greasy, sponge-like crumb after frying, the dough is overproofed. If the finished doughnuts seem greasy and pale, the fry oil is likely too cool. If the finished doughnuts have a heavy crust, but seem dense or raw inside, the fry oil is likely too hot. If the doughnuts seem tough, the gluten in the dough was likely overdeveloped, as a result of all-purpose flour too high in protein, or as a result of overprocessing. "}]}