{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/06/20190605-chilled-carrot-soup-dukkah-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["carrot", "cold soup", "soup", "summer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Chilled Minty Carrot Soup With Dukkah Yogurt", "link": "https://www.seriouseats.com/recipes/2019/06/chilled-minty-carrot-soup-with-dukkah-yogurt.html", "description": "This chilled carrot soup is smooth and creamy, even though it has no dairy in the soup base. Fresh mint adds a bright  herbal note, while a creamy dollop of spiced yogurt finishes it off.", "totalTime": "1 hour, plus chilling time", "recipeYield": "Makes about 2 quarts", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Carrot", "Cold Soup", "Recipes", "Soups and Stews", "Spring", "Stovetop", "Summer", "Vegetarian"], "recipeIngredient": ["4 tablespoons (60ml) extra-virgin olive oil, divided, plus more for drizzling", "1 medium yellow onion (12 ounces; 340g), peeled and thinly sliced", "One medium leek (10 1/2 ounces; 300g), white and light green parts only, washed well of dirt and sand, sliced in half lengthwise, then sliced crosswise into thin half-moons", "2 medium cloves garlic, peeled and smashed under the flat side of a knife", "10 medium carrots (2 pounds; 900g), peeled and sliced into thin rounds", "Kosher salt", "3 sprigs flat-leaf parsley (optional)", "10 fresh mint leaves, plus more as garnish", "1 tablespoon (15ml) white wine vinegar, plus more if desired", "Water or carrot juice, as needed", "1/2 cup Greek yogurt or labneh", "1 tablespoon <a href=\"https://www.seriouseats.com/recipes/2019/06/dukkah.html\">dukkah</a>, plus more for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot or Dutch oven, heat 3 tablespoons (45ml) olive oil over medium heat until shimmering. Add onion, leek, and garlic, and cook, stirring occasionally, until softened but not browned, about 10 minutes. Stir in carrots and season with salt. Add parsley, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough cold water to cover and bring to a simmer. Reduce heat to maintain simmer, and cook until carrots are tender enough that a fork can easily pierce them. Discard parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle liquid and solid ingredients into a blender jar. Remove blender lid plug (this will allow steam pressure to escape), cover blender, and set a folded clean dish towel on top to cover the hole in the blender lid (keep your hand on the towel to keep it in place). Starting at the lowest speed and gradually increasing to the highest, blend the soup until it is completely smooth. If an even smoother texture is desired, pass soup base through a fine-mesh strainer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate soup base until chilled (alternatively, you can use an ice bath to speed up the chilling time). Return soup base to a clean blender jar, add mint leaves and blend until leaves are chopped into tiny flecks. Transfer soup base to a large mixing bowl, and whisk in the remaining 1 tablespoon (15ml) olive oil along with the vinegar. Thin soup base with enough water or, if you have it, chilled fresh carrot juice to desired consistency (you do not want the soup to be a thick purée, but instead a silky, creamy, soup-like one). Season with salt and, if needed, additional vinegar. Return to refrigerator until well chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small mixing bowl, thoroughly mix yogurt with dukkah. Season with salt. Keep cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, check soup for seasoning once more, adjusting salt and vinegar only if desired. Portion into bowls (chilled bowls are even better). Dollop some chilled yogurt mixture into each bowl, then sprinkle some additional dukkah on top. Garnish with mint leaves, drizzle with olive oil, and serve cold."}]}