{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/04/20190321-xo-sauce-vicky-wasik-44.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Chinese", "keywords": ["condiment", "Hong Kong", "low carb", "sauce", "XO sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.4", "ratingCount": "5"}, "name": "XO Sauce", "link": "https://www.seriouseats.com/recipes/2019/04/xo-sauce.html", "description": "XO sauce is a flavor-bomb condiment that you should have at your disposal at all times.", "totalTime": "3 hours", "recipeYield": "Makes 4 cups", "recipeCategory": ["Chinese", "Condiments and Sauces", "Seafood", "Stovetop"], "recipeIngredient": ["5 ounces (140g) dried shrimp", "5 ounces (140g) dried scallops", "10 garlic cloves", "3 large shallots (about 5 ounces; 140g), quartered", "One 3-inch piece (2 ounces; 56g) fresh ginger, peeled and roughly chopped", "2 to 4 fresh Thai red chili peppers, roughly chopped (see note)", "2 cups (475ml) vegetable oil", "3 ounces (85g) Jinhua ham, minced (see note)", "3 to 5 dried Thai chilies, finely ground (1 to 2 teaspoons); optional (see note)", "1/2 cup (120ml) Shaoxing wine (see note)", "1 1/2 cups (355ml) chicken broth", "1/4 cup (60ml) oyster sauce", "2 tablespoons (30ml) soy sauce", "2 tablespoons (24g) brown sugar", "2 pieces whole star anise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place shrimp and scallops in separate medium microwave-safe bowls and cover with at least 2 inches of boiling water. Set aside to soak for a minimum of 1 hour or up to 2 hours. (Alternatively, you can soak the shrimp and scallops in cold water overnight in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain shrimp completely. Drain scallops, leaving 2 tablespoons (30ml) soaking water along with the scallops in the bowl. Cover bowl with a microwave-safe plate and microwave on high heat until scallops are tender and easily break apart when pinched between your fingers, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain scallops of remaining liquid and transfer them to the bowl of a food processor. Pulse scallops 7 times, until just broken into thin strands, then transfer back to their original bowl. Add shrimp to food processor and pulse 10 times, until coarsely chopped. Transfer shrimp back to their original bowl. Finally, combine garlic, shallots, ginger, and Thai chilies in food processor bowl and pulse 12 to 15 times, until finely chopped but not puréed. Set mixture aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven, heat vegetable oil over medium-high heat until shimmering. Add ham and cook, stirring frequently with a heat-resistant spatula or wooden spoon, until ham is crisp, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add scallops to pot and continue to cook, stirring frequently to separate strands, until scallops are lightly golden, 3 to 5 minutes. Add shrimp and continue to cook, stirring frequently, until seafood is a deep golden color, 7 to 10 minutes. The oil in the pot will be very bubbly during this stage, making it difficult to see what is going on in the bottom of the pot, so you will need to occasionally use your spatula or a slotted spoon to pick a spoonful of the mixture up out of the oil to check its color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add vegetable mixture to pot and continue to cook, stirring frequently, until vegetables are golden brown and <i>fond</i> begins to form at the bottom of the pot, 8 to 10 minutes. Add ground dried chilies and cook until aromatic, about 30 seconds. Deglaze with Shaoxing wine, scraping up any brown bits stuck to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in chicken broth, oyster sauce, soy sauce, brown sugar, and star anise and continue to cook at a rapid simmer until mixture is thickened and most of the liquid has been absorbed into the sauce, leaving a thin layer of bubbling oil on the surface of the pot, 12 to 15 minutes. Remove from heat. Once XO sauce has cooled, divide into jars and store in the refrigerator for up to 1 month. Bring to room temperature before using."}]}