{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/08/20190709-olive-oil-cookies-vicky-wasik-24.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["chocolate chip", "chocolate chip cookie", "eggless", "oat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.625", "ratingCount": "8"}, "name": "Olive Oil Chocolate Chip Cookies", "link": "https://www.seriouseats.com/recipes/2019/09/vegan-olive-oil-chocolate-chip-cookie-recipe.html", "description": "These vegan chocolate chip cookies get their color and richness from extra-virgin olive oil, which lends its unique flavor to the dough and underscores the bittersweet earthiness of chocolate chips.", "totalTime": "30 minutes", "recipeYield": "About 18 (3 1/2–inch) cookies", "recipeCategory": ["Baking", "Chocolate", "Cookies", "Dairy-Free", "Quick and Easy", "Vegan"], "recipeIngredient": ["<strong>For the Oat Slurry:</strong>", "1 1/2 ounces old-fashioned rolled oats (about 1/2 cup minus 2 1/2 teaspoons; 42g), not quick-cooking or instant ", "3 ounces water (about 1/3 cup plus 1 tablespoon; 85g)", "<strong>For the Dough:</strong>", "6 ounces light brown sugar (about 3/4 cup, gently packed; 170g)", "3/4 teaspoon baking soda", "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/2 teaspoon baking powder", "1/8 teaspoon ground cinnamon", "4 3/4 ounces extra-virgin olive oil (about 2/3 cup; 135g); see note", "2 ounces prepared oat slurry", "1/4 ounce vanilla extract (about 1 1/2 teaspoons; 7g)", "6 3/4 ounces all-purpose flour (about 1 1/2 cups, spooned; 190g)", "6 ounces assorted chocolate chips or chopped chocolate; see note"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Oat Slurry:</strong> In a tall, narrow container just wide enough to accommodate the head of an immersion blender, combine rolled oats and water. Using an immersion blender, purée until thick and smooth, then strain through a fine-mesh strainer, pressing on the solids with a flexible spatula until they give up all their liquid. Discard the fibrous oat solids and reserve 2 ounces of the thick and gooey purée to use as directed below. This step should not be done in advance, as the oat slurry will continue to thicken over time, eventually becoming unusable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Dough:</strong> Adjust oven rack to middle position and preheat oven to 350&deg;F (180&deg;C). In a large bowl, whisk brown sugar, baking soda, salt, baking powder, and cinnamon until very well combined and free of any major lumps, about 1 minute. Add olive oil, prepared oat slurry, and vanilla extract and whisk until smooth. Add flour and stir, using a flexible spatula, until well absorbed, then add chocolate chips and knead by hand to incorporate. The dough will seem a touch oily and strange; this is normal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Portion the Dough:</strong> Using a 2-tablespoon cookie scoop, divide dough into about 18 pieces, firmly compressing each portion into the scoop using the palm of your hand or the edge of the bowl. (If you like, the portioned dough can be refrigerated in a heavy-duty zipper-lock bag for up to 1 week, or frozen for up to 6 months. Let stand at room temperature until quite soft, about 70°F/21°C, then bake as directed.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Bake:</strong> Arrange portioned dough on a parchment-lined aluminum baking sheet, leaving 2 inches between portions. If you like, garnish with a few extra chocolate chips on each cookie. Bake until cookies are puffed and golden from edge to center and firm around the edges but still quite steamy and soft in the middle, about 15 minutes. Cool directly on baking sheet until the crumb has set. Enjoy warm or at room temperature. Store leftovers in an airtight container up to 3 days at cool room temperature. "}]}