{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/07/frozenveganroundup-1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["dessert", "filbert", "frozen", "hazelnut", "ice cream", "mascarpone"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Hazelnut Mascarpone Ice Cream", "link": "https://www.seriouseats.com/recipes/2019/07/hazelnut-mascarpone-ice-cream.html", "description": "This creamy, nutty ice cream has a plain and simple appearance that belies the complexity of its flavor, which comes from an overnight infusion of toasted hazelnuts with milk and cream. The addition of a vanilla bean to the steeping process will add a floral dimension, but it's not essential&mdash;here, hazelnuts are the real star of the show, along with a bit of mascarpone. Its creamy richness and notes of cultured dairy bring lend buttery sweetness to the ice cream, highlighting the inherent notes of hazelnut at the same time.", "totalTime": "between 12 and 38 hours", "recipeYield": "makes about 1 quart", "recipeCategory": ["Dairy", "Ice Cream and Frozen Treats", "Stovetop", "Summer"], "recipeIngredient": ["9 ounce best-quality whole hazelnuts, toasted, skinned, and roughly chopped (shy 2 cups; 355g)", "10 ounces heavy cream (about 1 1/4 cups; 285g)", "8 ounces whole milk (about 1 cup; 225g)", "1 vanilla bean, split and scraped; seeds reserved (optional)", "6 ounces sugar (about 3/4 cup plus 2 Tablespoons; 170g )", "5 ounces egg yolk (shy 2/3 cup; 140g)", "3/4 teaspoon (3g) Diamond Crystal kosher salt, or more to taste; for table salt, use about half as much by volume or the same weight", "8 ounces mascarpone, brought to approxixmately 70°F/21°C (about 1 cup; 225g)", "1/2 ounce vanilla extract; or Frangelico (about 1 tablespoon; 15g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart saucier, combine the roughly chopped hazelnuts with the heavy cream, milk, and the scraped vanilla bean pod (if using). Bring to a simmer over medium heat, stirring from time to time, then cover, and cool to room temperature off heat. Once cool, refrigerate overnight, or up to 36 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chilled hazelnut-milk to a simmer, then strain through a mesh sieve into a large bowl. The hazelnuts can be used as-is to make creamy or crunchy <a href=\"https://www.seriouseats.com/2019/05/how-to-make-nutella-chocolate-hazelnut-spread.html\">Homemade Nutella</a> (see note), but will not be used further in this recipe. \r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the 3-quart saucier cool until safe to touch (no need to wash), then add the sugar, egg yolks, and salt, along with the reserved vanilla seeds (if using), and whisk to combine. When smooth, add the warm hazelnut-milk, followed by the mascarpone, whisking gently to combine.\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook over medium-low heat, stirring and scraping constantly with a flexible, heat resistant spatula until warm to the touch, then increase heat to medium. Continue stirring and scraping until thickened and steaming hot, or around 165&deg;F (74&deg;C) although precision is not required in a recipe like this."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the ice cream base into a non-reactive container, then whisk in vanilla extract or a nutty liqueur. Cover and refrigerate until no warmer than 39&deg;F, (4&deg;C) or cool to the same temperature in an ice bath; the time required will vary considerably depending on the technique, as well as the container style. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, churn the base in an ice cream maker until thick, with a texture like soft-serve. Meanwhile, place a 1-quart container and flexible spatula in the freezer. When ice cream looks thick and light, shut off the machine and, using the chilled spatula, scrape ice cream into the prepared container. Enjoy as soft-serve, or cover with plastic pressed directly against surface of ice cream, then close lid and freeze until firm. In an airtight container, with the surface of the ice cream protected by a sheet of plastic, the ice cream will keep for up to one month in the freezer.\r\n"}]}