{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/10/20191028-crispy-potato-cups-vicky-wasik-22.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["potato skin"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Deep-Fried Potato Skins With Melted Raclette Cheese", "link": "https://www.seriouseats.com/recipes/2019/11/potato-cups-with-melted-raclette-cheese-recipe.html", "description": "Crisply fried potato cups, filled with a pool of molten cheese, are about as close to perfection as a food can get.", "totalTime": "1 hour", "recipeYield": "Makes 10 potato-skin cups", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Deep Frying", "Fall", "New Year", "Potato", "Sides", "Snacks", "Vegetarian", "Winter"], "recipeIngredient": ["5 Yukon Gold potatoes, ideally about 5 or 6 ounces (140 to 170g) each (though larger potatoes will also work)", "Vegetable or canola oil, for greasing the potatoes and deep-frying", "Kosher salt", "8 ounces (225g) raclette cheese, cubed (see note)", "Thinly sliced cornichons, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375°F (190°C). Using a fork or paring knife, puncture potatoes in several spots. Rub each potato with a light coat of oil. Arrange on a rack set on a baking sheet, or directly on an oven rack, and bake until just tender, 30 to 45 minutes. Alternatively, microwave pricked and oiled potatoes until just tender, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let potatoes stand until cool enough to handle, then cut in half across their equators. Using a small spoon, scoop out most of the potato flesh into a medium bowl, leaving a layer of potato flesh roughly 1/8 to 1/4 inch thick still attached to the skin. (It's okay if the layer of potato flesh attached to the skin isn't perfectly even; that unevenness can add some good textural contrast to each cup.) If you want the cups to stand up more easily, slice off the very bottom of each one to create a level base. Set potato cups aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a blender or immersion blender, process scooped potato flesh into a slurry, adding just enough water to form a purée the consistency of applesauce. (You need only enough potato slurry to lightly coat each scooped potato cup, so you may want to purée only a portion of the scooped flesh and reserve the rest for a small batch of <a href=\"https://www.seriouseats.com/recipes/2010/11/ultra-fluffy-mashed-potatoes-recipe.html\">mashed potatoes</a>.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with paper towels. In a 5-quart Dutch oven or large wok, heat 2 1/2 inches oil over high heat until it reaches a temperature of 365°F (185°C). Working in batches, dip each scooped potato cup in the potato slurry to coat it inside and out; allow the excess slurry to drain off, then carefully lower each potato cup into the hot oil. Because the slurry is so wet, the frying will be very vigorous, so be careful not to fry more than a few at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, agitating occasionally with a wire mesh spider, until potatoes just begin to turn lightly golden, about 1 minute. Transfer to paper towel&ndash;lined baking sheet, inverting each one, concave side down, to allow it to fully drain. Repeat dipping and frying with remaining potato cups. Using a fine-mesh strainer, skim out any free-floating fried bits of slurry from the oil and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, return oil in Dutch oven or wok to 365°F (185°C). Fry potato cups in batches a second time, agitating them with wire mesh spider, until deeply golden brown and crispy all over, inside and out, about 3 minutes. Transfer cups to fresh paper towels to drain and season them with salt on all sides, then turn them concave side down to fully drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a rimmed baking sheet with aluminum foil and arrange the potato cups on it, concave side up. (If you didn't trim the bottoms of the cups, you can scrunch up the foil around the base of each cup to help keep them upright.) Fill each cup with as many cheese cubes as it can hold. Return cups to the 375°F (190°C) oven until the cheese is melted, about 5 minutes. Top with sliced cornichons and serve."}]}