{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/10/20191009-diwali-treats-vicky-wasik-12-Kaju-katli-1.jpg", "author": {"@type": "Person", "name": "Chetna Makan"}, "recipeCuisine": "Indian", "keywords": ["cashew"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "<i>Kaju Katli</i>", "link": "https://www.seriouseats.com/recipes/2019/10/kaju-katli-recipe.html", "description": "These nutty Indian treats are made from a cashew-candy dough that's rolled thin, then cut into large diamond shapes.", "totalTime": "1 hour", "recipeYield": "Makes about 30 kaju katli", "recipeCategory": ["Desserts", "Diwali", "Indian", "Nuts", "Stovetop"], "recipeIngredient": ["2 cups (250g) whole raw cashew nuts", "2 tablespoons (15g) whole-milk powder", "1/2 teaspoon cardamom powder", "10 tablespoons plus 1 1/2 teaspoons (125g) granulated sugar", "1/4 cup (60ml) water", "Rounded 1/2 teaspoon <a href=\"https://www.seriouseats.com/recipes/2015/08/clarified-butter-recipe.html\">ghee</a>", "<a href=\"https://www.amazon.com/Edible-Genuine-Silver-Leaf-95mmx95mm/dp/B00CF89970/?tag=serieats-20\">Edible silver leaf</a> or vark, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, grind cashews to a fine powder, taking care not to grind them so thoroughly that the nuts release their oil. Place cashew powder in a medium mixing bowl, then whisk in milk powder and cardamom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 2-quart saucepan, heat sugar and water over medium-high heat until sugar has melted. Continue cooking until the mixture reaches 230&deg;F (110&deg;C) on a probe or candy thermometer, about 4 minutes. Alternatively, you can judge the doneness of the candy syrup by placing a drop of it on your thumb, making sure to let it cool enough first that you don't burn yourself. Allow the drop of syrup to cool to room temperature, then pinch it between your thumb and index finger and pull them apart; the syrup is done when a single strand stretches between your fingers without breaking. (This is called a \"one-string consistency\" in Indian candy-making terminology.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to low and add cashew mixture, stirring continuously with a heat-resistant flexible spatula. The mixture should pull away from the sides of the pan and form a loose ball. Add ghee and mix well for a few seconds, then remove pan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a sheet of parchment paper on a clean work surface and carefully scoop hot cashew dough on top. Set a second piece of parchment paper on top of the cashew dough. Knead the hot cashew dough through the paper for a few seconds to help bring it together. Using a rolling pin, roll cashew dough out into a single even sheet about 1/8 inch (3mm) thick. Remove top layer of parchment. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let dough stand 1 minute. If desired, carefully lay edible silver leaf (silver vark) all over the dough. Then, using a sharp knife, cut dough into diamond-shaped pieces 1 to 1 1/2 inches (2.5 to 4cm) long. Allow to rest at room temperature for 30 minutes before serving."}]}