{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/08/20190809-burst-tomato-xo-pasta-vicky-wasik21-.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": ["cherry tomato", "tomato sauce", "weeknight", "XO sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Pasta With Burst Cherry Tomatoes and XO Sauce", "link": "https://www.seriouseats.com/recipes/2019/09/burst-cherry-tomato-xo-sauce-pasta-recipe.html", "description": "Condiments are the key to packing flavor into your weeknight dinners, fast. This XO sauce&ndash;spiked, 20-minute pasta is proof of that.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Pasta", "Quick and Easy", "Quick Dinners", "Stovetop", "Summer", "Tomato"], "recipeIngredient": ["Kosher salt", "1 pound (450g) short pasta, such as <em>casarecce</em> or <em>gemelli</em>", "1/4 cup (60ml) extra-virgin olive oil", "2 medium shallots (80g), thinly sliced", "4 medium garlic cloves (20g), thinly sliced", "1 1/2 pounds cherry tomatoes (about 2 pints; 675g) ", "1/2 cup (140g) XO sauce, store-bought or <a href=\"https://www.seriouseats.com/recipes/2019/04/xo-sauce.html\">homemade</a>", "Pinch finely ground dried Thai chilies or red pepper flakes (optional; see note)", "1/2 ounce fresh basil leaves (1 loosely packed cup; 15g), roughly chopped", "1/2 ounce fresh mint leaves (1 loosely packed cup; 15g), roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot of salted boiling water, cook pasta until just shy of al dente (about 1 minute less than the package directs). Drain pasta, reserving 1 1/2 cups (360ml) cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large skillet, heat olive oil over medium heat until shimmering. Add shallots, season lightly with salt, and cook, stirring frequently with a wooden spoon, until shallots are softened but not browned, about 5 minutes. Add garlic and continue to cook, stirring frequently, until garlic is softened as well, about 2 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cherry tomatoes, shaking skillet to distribute them in an even layer, and cook, stirring and swirling the pan frequently, until tomatoes begin to burst, about 5 minutes. You can coax the tomatoes into bursting by pressing down on them with a wooden spoon, but leave some tomatoes whole for juicy pops of flavor in the finished dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to cook and stir tomato mixture until it forms a creamy, emulsified sauce, 3 to 5 minutes longer. Add XO sauce and ground dried chilies (if using), stir to combine, and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta and half of the reserved cooking water (3/4 cup; 180ml) to skillet with cherry tomato sauce. Increase heat to high and cook, swirling and tossing skillet constantly, until pasta is al dente and sauce is thickened and coats noodles, about 1 minute. If the sauce over-reduces (it should pool around the edges of the skillet), add more pasta-cooking water in 1/4-cup increments to loosen it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, stir in basil and mint, and season to taste with more salt. Serve immediately."}]}