{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/07/20190710-cherry-pit-syrup-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Cherry Pit Syrup", "link": "https://www.seriouseats.com/recipes/2019/07/cherry-pit-syrup-recipe.html", "description": "Here's an easy, no-fuss method for making the most of your summer cherry haul: After making cherry pie, cherry ice cream, or any other cherry treat, toss all those pits with a bit of sugar to draw out all the flavor in the wisps of fruit that cling to them, producing a vibrant cherry syrup.", "totalTime": "3 hours", "recipeYield": "Makes about 5 ounces (1/2 cup)", "recipeCategory": ["Cherry", "Cocktails", "Dairy-Free", "Fruit Desserts", "Gluten-Free", "No-Cook", "Summer", "Syrup", "Vegan"], "recipeIngredient": ["7 ounces cherry pits (about 1 heaping cup; 200g); see note ", "3 1/2 ounces plain or <a href=\"https://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted sugar</a> (about 1/2 cup; 100g)", "Pinch of salt, to taste", "1 drop rose water, or more to taste (optional)", "1 drop almond extract, or more to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or pint Mason jar, combine cherry pits and sugar (and the husk of a juiced lime, if using; see note). Toss until well combined, then cover tightly and set aside for 3 hours or up to 24 hours. Shake the bowl or jar occasionally to toss the pits around and help the sugar dissolve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When sugar has completely dissolved, strain syrup through a fine-mesh sieve. (The pits will still have enough flavor left to make a batch of <a href=\"https://www.seriouseats.com/recipes/2016/06/cherry-pit-whipped-cream-recipe.html\">Cherry Pit Whipped Cream</a>, if you'd like to arm yourself with the perfect set of toppings for a cherry sundae.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season syrup with a pinch of salt and a drop or two of rose water and/or almond extract to taste. Please use care in adding these potent ingredients; while a very small amount of each can go a long way toward balancing the flavor of the syrup, the effect can be overwhelming if too much is added."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer syrup to an airtight container and refrigerate for up to 1 month. Use as a dessert sauce or as a replacement for simple syrup in drinks."}]}