{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20181115-oysters-rockefeller-oaxaca-style-vicky-wasik-52.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Mexican", "keywords": ["cilantro", "mezcal", "oaxaca", "oyster", "Oysters Rockefeller", "poblano", "rajas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Oysters Oaxacafeller", "link": "https://www.seriouseats.com/recipes/2019/01/oysters-oaxacafeller.html", "description": "Reimagining a New Orleans classic through the flavors of Mexican rajas con crema.", "totalTime": "1 hour", "recipeYield": "Makes 24 oysters", "recipeCategory": ["American", "Appetizers and Hors d'Oeuvres", "Christmas", "Cinco de Mayo", "Clams, Mussels, and Oysters", "Labor Day", "Lime", "Memorial Day", "Mexican", "New Year", "Quick Dinners", "Recipes", "Roasting", "Seafood", "Seasonal and Holiday", "Stovetop"], "recipeIngredient": ["Vegetable cooking spray", "2 medium poblano peppers (6 1/4 ounces; 175g), stemmed, halved lengthwise, and seeded", "4 large scallions (3 1/2 ounces; 100g)", "2 tablespoons (1 ounce; 30g) unsalted butter", "2 large shallots (4 ounces; 115g), thinly sliced", "2 medium garlic cloves, thinly sliced", "Kosher salt", "1/2 cup (4 ounces; 115g) Mexican crema or sour cream or crème fraîche ", "Finely grated zest of 1 lime", "1/8 teaspoon (1/2g) ground coriander seed", "1 tablespoon (15ml) mezcal (optional)", "1/2 bunch (about 1 1/2 cups; 30g) fresh cilantro leaves and tender stems, roughly chopped", "1/2 cup (1 ounce; 30g) panko bread crumbs", "<a href=\"https://www.amazon.com/MORTONS-SALT-ROCK-LB-Pack/dp/B01L0YIWPE/?tag=serieats-20\">Rock (ice cream) salt</a> (see note)", "24 fresh oysters, <a href=\"https://www.seriouseats.com/2018/12/how-to-serve-oysters-on-the-half-shell.html\">scrubbed</a>", "Cayenne pepper", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to 6 inches below broiler element and preheat broiler on high. Line rimmed baking sheet with aluminum foil and spray it lightly with vegetable cooking spray. Lightly coat skins of poblano peppers and scallions with vegetable oil; then place on prepared baking sheet with peppers facing skin-side up. Broil vegetables, checking them frequently, until they are soft and lightly charred, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set scallions aside on cutting board. Pile poblanos in middle of the sheet of aluminum foil; then gather foil around peppers to form a sealed pouch. Let peppers steam in the foil until their skins can be easily peeled away from the flesh. Using a paring knife, peel and discard skins. Cut poblanos and scallions into 1/2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium (3-quart) saucepan, heat butter over medium-low heat until foaming. Add shallots, garlic, and a generous pinch of salt. Cook, stirring occasionally, until softened, 6 to 8 minutes. Add poblanos and scallions, and continue to cook until vegetables have released all of their liquid, and liquid has evaporated, another 3 to 5 minutes. Stir in crema, lime zest, and ground coriander. Continue to cook until mixture is well-combined and slightly thickened, about 1 minute. Off heat, stir in mezcal (if using). Transfer mixture to food processor bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Process vegetables, scraping down sides of food processor bowl as needed, into a coarse paste, about 30 seconds. Add cilantro and process until it is broken down and well-combined with the vegetable paste. Add panko bread crumbs, and pulse until they are fully incorporated. Season with salt, erring on the side of less salt since oysters are briny. Transfer mixture to disposable pastry bag or small mixing bowl, and set aside. If using a mixing bowl, cover with plastic wrap, pressing plastic against surface of the paste to prevent skin from forming and herbs from oxidizing. If not serving immediately, mixture can be stored in refrigerator for up to 1 day; let sit at room temperature to soften before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to 6 inches below broiler element and preheat broiler on high. Line rimmed baking sheet with an even 1/2-inch layer of rock salt. <a href=\"https://www.seriouseats.com/2010/07/knife-skills-how-to-shuck-an-oyster.html\">Shuck oysters</a> and arrange on prepared baking sheet. Pipe or spoon topping over oysters; then use an offset spatula or butter knife to smooth topping and fully cover each oyster."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil oysters, checking frequently, until topping begins to brown, and oysters are warmed through, 4 to 6 minutes. Lightly season oysters with cayenne. Serve immediately, passing lime wedges and plenty of mezcal at the table."}]}