{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/images/2017/07/20170627-blackberry-cake-vicky-wasik-27.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.1578947368421", "ratingCount": "19"}, "name": "Foolproof Blackberry Cake", "link": "https://www.seriouseats.com/recipes/2019/04/foolproof-blackberry-cake.html", "description": "", "totalTime": "About most of your life", "recipeYield": "One 8-inch cake, or enough for eight generous wedges. On a beautiful summer day, if you've skipped lunch to pick blackberries on the rolling hills of a farm in central Kentucky, and served this cake as a late-afternoon snack, it may serve only four average human beings, or one NFL player in the midst of intensive spring training. As the final course of a multi-hour tasting menu, served to socialites wearing fashionable but tightly fitted gowns, this cake may serve as many as 16. ", "recipeCategory": [], "recipeIngredient": ["<strong>For the Cake:</strong>", "7 ounces fresh blackberries, firm and tart (about 1 1/4 cups; 200g); please note, this weight is provided for the purpose of grocery shopping, so that damaged fruit may be discarded, and to account for product loss due to human inefficiency. This recipe was developed with the unique pH and anthocyanin makeup found in blackberries, which are easily found in American grocery stores year-round, and seasonally in regional farmers markets. Alternatives such as blueberries, huckleberries, cloudberries, boysenberries, olallieberries, black raspberries, or beef jerky may not perform as well when used in a 1:1 substitution.", "4 ounces unsalted, American-style butter, not European-style butter, ghee, clarified butter, brown butter, whipped butter, buttery spread, margarine, nondairy baking sticks, or I Can't Believe It's Not Butter (about 8 tablespoons; 110g), softened to about 60°F (16°C), with the word \"about\" functioning to indicate acceptable variations within +/- 3°F. This number is provided to contextualize traditional but otherwise subjective terminology, such as \"cool room temperature,\" in order to avoid problems related to rock-hard butter straight from the refrigerator, or squishy-soft butter allowed to sit indefinitely at room temperature in arid climates. Success is possible with a wide variety of temperature ranges, both here and with other ingredients, but will require bakers to pivot elsewhere accordingly.", "5 1/4 ounces sugar* (about 3/4 cup; 145g); this recipe was tested with refined white sugar, and may not perform as well with alternatives that contain more than trace amounts of minerals or other organic compounds, such as molasses, including but not limited to: raw sugar, sugar in the raw, Turbinado, Demerara, muscovado, palm sugar, and non-sugar sugars, such as date sugar, as well as fructose-rich alternatives, such as honey, or maltose-rich alternatives, like LME, Splenda, Sweet'N Low, stevia, and whatever it is that comes in blue packets, I forget the name.<br><small>* As sugar provides volume and structure during the creaming process, and assists in moisture retention, which affects tenderness, gluten development, and shelf life, any reduction in the quantity listed here will produce nonstandard results.</small> ", "1 1/4 teaspoons baking powder; like, actual double-acting baking powder, not a fake mix of cream of tartar and baking soda, which cannot provide a late-stage release of carbon dioxide as the batter warms above 140°F (60°C). Please note that this recipe was tested with traditional baking powder, and modern aluminum-free formulas may result in discoloration.", "1/4 teaspoon baking soda (that's it; just baking soda—it doesn't matter what brand, it's all NaHCO<sub>3</sub>). In the highly unlikely event that a box of baking soda has expired due to exposure to sustained high heat and humidity over the course of several years, it will be unfit for use, a condition made evident by a change in consistency that will result in baking soda as lumpy and difficult to scoop as a neglected litter box. ", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for other brands, please note that the weight per teaspoon will vary, and may result in a level of salinity noticeably higher or lower than the amount indicated here, and will thus need to be adjusted to taste. The amount of salt listed is a reflection of the author's subjective analysis, and may not be in line with the reader's own desire for balance within the recipe. Always use a jeweler's scale to measure quantities of less than 5g, as large-format scales may not resolve low enough for accurate measurements, or their auto-tare function may reset the scale to zero between tentative additions of a lightweight powder.", "1/8 teaspoon ground cinnamon; please note that American recipes approach Vietnamese cinnamon as a default, as it is the most commonly available cinnamon in US supermarkets, and substituting Ceylon cinnamon will shift the flavor profile of this dish; when Ceylon cinnamon is needed, American recipes will always call for it by name. Please note that all of this information will be reversed when reading Nordic recipes.", "2 ounces egg whites (about 1/4 cup; 55g), brought to about 70°F (21°C); commercially frozen egg whites will work equally well; do not use whole eggs. I swear, if whole eggs performed equally well, I would not complicate this recipe by asking for egg whites instead. Please note the author has not cross-tested this recipe with eggless alternatives such as applesauce, aquafaba, flaxseed, or that weird oat-slurry thing, and while it's certainly possible they may perform well, the author cannot reassure you that these swaps will work well enough to be used with confidence for today's birthday party.", "5 1/2 ounces bleached cake flour (about 1 1/4 cups, spooned; 155g), such as Swans Down, sifted. Please note that this style of flour was not chosen for its aesthetic value; whiteness may be the by-product of chlorination, but it is not the goal. In cake flour, the bleaching process alters the starch and protein of wheat, creating unique behaviors not found in any other flour style. This recipe will not work with unbleached cake flour, unbleached pastry flour, all-purpose flour mixed with cornstarch, or commercial gluten-free flour blends.", "<strong>To Finish:</strong>", "1 batch <a href=\"https://www.youtube.com/watch?v=oHg5SJYRHA0\">Cream Cheese Frosting</a>", "Additional blackberries to garnish, or festive alternatives such as sprinkles (preferably rainbow), toasted pecans (omit if allergic), or a light drizzle of lemon syrup (alternatives such as lime or orange may also be delicious, but I'm not sure; I haven't tasted them specifically on this cake, although in general I do quite like a variety of citrus and fruit combinations)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Prepare:</strong> Wash the berries by gently swishing them around in a bowl of clean water, then transfer to a colander and allow to drip-dry. Blot with a cloth or paper towel to remove excess moisture. Using a blender, food processor, immersion blender, Vitamix, mini chopper, Magic Bullet, mortar and pestle, or Hulk Smash, purée blackberries until completely smooth. If desired, strain the purée through a cheesecloth or nonreactive fine-mesh sieve; please note that if the sieve turns out to be reactive, exposure to such metal may result in dramatic discoloration of the cake. Measure out exactly 6 ounces fresh blackberry purée (about 3/4 cup; 170g) and bring to about 70°F (21°C) before using. This temperature is provided as an approximation to prevent fridge-cold berries from curdling the batter later on, as well as to avoid risks with warm, garden-fresh summer berries elevating the batter temperature in an unexpected way."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position and preheat to 350°F (180°C). Please note, in this or any other recipe, the suggested rack position will influence both bake time and browning. Other rack positions may lead baked goods to cook at a different rate due to an increased proximity to the oven's heating element. In American recipes, oven temperatures are always given for conventional baking, and convection will always be mentioned by name when its use is required or intended by the author. Please note that in this recipe, or any American recipe that does not call for convection, use of forced-fan heating may produce nonstandard results due to airflow drying the crust prematurely, thereby restricting rise. Convection will also increase Maillard browning of the crust, an unwanted development in layer cakes. Convection baking is not recommended, but if it cannot be avoided, reduce baking temperature by 25&deg;F."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease an 8- by 2-inch or 8- by 3-inch anodized aluminum cake pan and line with parchment. Due to the substantial volumetric differences between an 8-inch and a 9-inch cylinder, the quantity of batter produced in this recipe as written will not be sufficient to fill a 9-inch cake pan, leading to a pancake-thin, overly browned cake. For 9-inch pans, please increase the recipe by 150%. Regardless of pan size, it is vital to use nonreactive aluminum pans. Raw or natural aluminum will lead to substantial discoloration of the cake, while dark or nonstick pans will accelerate browning, leading to dryness and discoloration as well. Because the author has not tested this recipe as cupcakes, she cannot provide suggested bake times for use; bake time for cupcakes will depend on the type of metal used in manufacturing the pan (aluminum versus aluminized steel), the color of the metal (reflective or dark), and the size of the individual cavities, which may vary from one manufacturer to the next, as well as the use of cupcake liners. On a personal level, the author feels cupcakes would probably be fine, but you'll have to play it by ear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make the Cake:</strong> In the bowl of a stand mixer fitted with a coated paddle attachment (raw-aluminum attachments may discolor the batter, particularly if the attachment has ever gone through a dishwasher, in which case it may also impart an unwanted flavor), combine butter, sugar, baking powder, baking soda, salt, and cinnamon. Please note, the mixing times and temperatures suggested for this recipe are based on the use of a stand mixer; for hand-mixing, substantially warmer temperatures may be required, and mixing times will vary by as much as 200% or more depending on the horsepower of the machine in question, as well as its beater design and RPMs. Mix on low speed to roughly incorporate, then increase to medium and beat until fluffy and light, about 5 minutes. Be aware that this is not a process that can be judged by time alone. Times are listed only as an approximation, based on the listed ingredients, ingredient temperatures, and equipment, and on an average room temperature of 70&deg;F (21&deg;C). However, the author does not mean to suggest that bakers maintain a 70&deg;F (21&deg;C) environment in the kitchen at all times; only that substantially different ambient conditions will affect the results of this or any other recipe, as batter temperature is largely determined by ingredient temperature, as well as the temperature of the equipment that comes into contact with said ingredients. For example, in a kitchen with sustained temperatures in the mid-80s, the mixing bowl and sugar will both reach a temperature of 80&deg;F (27&deg;C), which is warm enough to initiate melt in butter. Please note that the reverse is just as true, and equally problematic. This is not a special consideration for this recipe, but rather a universal truth for any recipe based on an ingredient that can exhibit a wide variety of textural changes based on the variety of temperatures commonly seen in human habitation."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About halfway through, pause to scrape bowl and beater with a flexible spatula. Without thorough scraping, a layer of dense butter and sugar may adhere to the sides of the bowl, as well as some parts of the paddle; if not dislodged and homogenized into the batter early on, this layer may form a dense streak of batter in the cake, creating pockets of discoloration that may also exhibit unusual textural anomalies, such as density, gumminess, or unsightly, lava-like eruptions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With mixer still running, add egg whites a little at a time, letting each addition fully incorporate before proceeding to the next. If these additions occur too quickly, the batter emulsion may break or curdle, resulting in a dense, low-volume cake. Conversely, if the mixing time is extended substantially beyond what is required to simply homogenize the batter, excess air may be incorporated into the batter, resulting in a cake riddled with tunnels, holes, and large air pockets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce mixer speed to low and sprinkle in about one-third of cake flour, followed by one-third of prepared blackberry purée. Alternating the wet and dry ingredients serves to preserve both the emulsion of the batter and its volume. Should the dry ingredients be added all at once, the amount of mixing required to homogenize the low-moisture batter will be enough to substantially reduce the number of air cells previously worked into the batter. Likewise, should all the liquid ingredients be added at once, the batter's emulsion will break, reducing rise in the finished product. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape bowl and beater with flexible spatula and resume mixing on medium speed for about 3 seconds to ensure everything is well combined. If the batter looks streaky or tie-dyed, gently fold with a flexible spatula until streaks disappear. The batter should look bright purple and register between 65 and 68°F (18 and 20°C) on a digital thermometer. Significant deviation indicates ingredients were too warm or too cold, which can lead to textural problems with the cake. In this case, such problems are faits accomplis, and cannot be avoided by refrigeration of the batter, as the batter temperature is less important than what it represents: namely, that you done screwed up already, and no amount of backpedaling will help you atone for your crimes against this cake. It will remember your careless treatment, and withhold its love from you going forward. Look, the author is sorry, there's really nothing she can do for you now."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the batter into the prepared pan, spread into an even layer, and bake until puffed and firm, about 30 minutes. The timing will always vary, which is why the word \"about\" rather than \"exactly\" has been used here. However, with a cake batter made from ingredients at the above-mentioned temperatures, handled in a manner as directed here, and panned in a round, 8- by 2- or 3-inch anodized aluminum vessel, one can expect the cake to bake for an average duration of 30 minutes. When properly baked, the cake itself will have reached an internal temperature of approximately 200&deg;F (93&deg;C) when checked with a digital thermometer, but the reliability of this testing method depends entirely on placement. Should the probe fall too near the bottom of the pan, it may register a higher temperature, not indicative of the cake as a whole; should the probe fail to plunge to a sufficient depth within the cake, it may register a temperature too low. As the cake itself will have a final depth of no more than 2 inches, the margin of error for probe placement can be high for beginners. Alternatively, one could test for doneness simply by looking at the thermometer probe itself, without consulting the temperature readout. Should wet batter cling to the probe, the cake will require additional baking. Should the probe appear relatively clean, with only a few moist crumbs attached, the cake will be done. Should the probe be extremely dry, the cake will have been over-baked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool the cake directly in its pan for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off parchment liner, and place on a serving plate until cake is fully cool, about 1 hour more. The times provided here are approximate, and the cake may require more or less time to cool depending on ambient conditions in your home. Top the cake with a batch of Cream Cheese Frosting or whatever other topping your heart may desire, along with a handful of fresh blackberries. In this case, other fruits may safely be substituted, including but not limited to sliced bananas, fresh-cut peaches, bunches of red currants, or sliced mango (if allergic to mango, do not use)."}]}