{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190306-mht-fruity-spicy-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Michael Harlan Turkell"}, "recipeCuisine": "", "keywords": ["buttermilk", "sauce", "scallop"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Seared Scallops With Buttermilk Beurre Blanc", "link": "https://www.seriouseats.com/recipes/2019/03/seared-scallops-with-buttermilk-beurre-blanc.html", "description": "Sweet and tender scallops snuggle up with a twist on a classic French <em>beurre blanc</em>, using orange juice and buttermilk in place of the standard white wine and vinegar.", "totalTime": "25 minutes", "recipeYield": "Serves 4 as a starter", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy", "Other Seafood", "Quick and Easy", "Quick Dinners", "Stovetop"], "recipeIngredient": ["1/2 cup (120ml) fresh orange juice from about 1 large orange, fine-strained of pulp, plus finely grated zest for garnish", "1 sprig oregano, plus picked leaves for garnish", "1 stick (8 tablespoons; 115g) butter, cut into 1-tablespoon chunks, divided", "2 tablespoons (30ml) buttermilk", "Kosher salt and freshly ground black pepper", "White wine vinegar, to taste (optional)", "1 pound (455g) dry-packed sea scallops (about 12 large; see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine orange juice with oregano sprig and bring to a simmer over medium heat. Simmer until reduced by half, about 5 minutes. Discard oregano."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working off the heat, whisk in 6 tablespoons of butter, 1 tablespoon at a time, until a smooth and creamy sauce forms. If sauce cools down to the point that the butter will no longer melt into it, return to heat, whisking constantly, to gently rewarm, then continue off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in buttermilk. Season sauce with salt and pepper, and whisk in a splash or two of white wine vinegar, if desired, to balance the sweetness to your liking. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat scallops dry and season all over with salt. In a large stainless steel skillet, melt remaining 2 tablespoons butter over high heat until foaming. Cook scallops on first side until well browned, about 3 minutes; the butter will brown during cooking, but if it starts to blacken, turn down the heat. Using a slotted fish spatula, flip scallops and cook on second side just until warmed through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer scallops, browned side up, to clean paper towels to drain. Very gently rewarm the sauce over a low flame while whisking (the sauce can break and the buttermilk can curdle if it gets too hot)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon warmed sauce onto warm serving plates. Arrange scallops on plates and garnish with oregano leaves and orange zest. Serve right away."}]}