{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/11/20191030-filipino-Sinigang-na-Baboy-pork-vicky-wasik-ingredients.jpg", "author": {"@type": "Person", "name": "Yana Gilbuena"}, "recipeCuisine": "Filipino", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "<i>Sinigang na Baboy</i> (Filipino Pork in Sour Tamarind Soup)", "link": "https://www.seriouseats.com/recipes/2019/12/sinigang-na-baboy-filipino-pork-in-sour-tamarind-soup.html", "description": "This rich and hearty Filipino stew is famous for its assertive sour and savory flavor profile.", "totalTime": "2 hours", "recipeYield": "Makes about 8 servings", "recipeCategory": ["Filipino", "Pork", "Soups and Stews", "Stovetop"], "recipeIngredient": ["1 pound (450g; about 3) plum tomatoes", "2 whole, fresh long green peppers (4 ounces; 115g total)", "1 tablespoon (15ml) canola or other neutral oil", "1 head of garlic (12 about medium cloves), peeled and minced", "1 small (6-ounce; 170g) red onion, finely diced", "1 scallion, white part finely chopped, green part sliced thinly on a bias, divided", "1 1/2 pounds (680g) boneless, skinless pork shoulder, cut into 1-inch pieces", "32 ounces (945ml) <a href=\"https://www.amazon.com/Asian-Kitchen-Natural-Tamarind-Concentrate/dp/B07GM25JYX/?tag=serieats-20\">tamarind concentrate</a> (see note)", "One 1.41-ounce pack <a href=\"https://www.amazon.com/14-packs-Knorr-Tamarind-Soup-Mix/dp/B005QTFLDQ/?tag=serieats-20\">Knorr sinigang tamarind soup mix</a>", "1 small daikon radish (about 1 pound), peeled and cut crosswise into 1/2 inch thick rounds", "1 small taro root (about 6 ounces), peeled and cut crosswise into 1/4 inch thick rounds (see note)", "1/2 pound (225g) fresh okra (optional), caps trimmed, pods cut in half on a bias", "6 ounces (170g) long green beans or string beans, stem ends trimmed and beans cut into 2-inch lengths", "3 tablespoons (45ml) coconut oil", "2 tablespoons garlic powder", "Kosher salt", "1/4 cup (60ml) calamansi juice, or as much as desired (see note)", "1/4 cup (60ml) fish sauce, or as much as desired", "<a href=\"https://www.amazon.com/Maesri-Fried-Garlic-10-5-Ounce/dp/B00L19DTQG/?tag=serieats-20\">Fried garlic</a>, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375&deg;F (190&deg;C). Set whole tomatoes on a foil-lined rimmed baking sheet. Roast until skins split and are browned in spots, about 25 minutes. When cool enough to handle, core and quarter tomatoes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working directly over the flame of a gas burner, or on a rimmed baking sheet under the broiler (as close to the broiler element as possible), roast green peppers, turning often, until the skin of each is blistered and charred over about half its area. Transfer to a work surface, remove and discard stems, then chop flesh, skin, and seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large 7-quart Dutch oven or pot, heat canola oil over medium-high heat until shimmering. Add minced fresh garlic, red onion, chopped scallion whites, chopped peppers, and pork and cook, stirring, until beginning to brown on the bottom, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 quarts (4 liters) water, scraping up browned bits from bottom of pot. Stir in tamarind concentrate and tamarind soup mix. Bring to a boil, then reduce heat and let simmer for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes, daikon, and taro root, then continue to simmer for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, toss okra, if using, and green beans in coconut oil and garlic powder; season with salt. Spread okra and green beans on a rimmed baking sheet and roast until lightly browned, about 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in small additions, add fish sauce and calamansi juice to soup until desired flavor is reached; you want it mouth-puckeringly sour but balanced with a clear (but not unpleasant) saltiness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve soup, dividing ingredients among bowls and topping with the roasted green beans (and okra, if using), thinly sliced scallion greens, and a sprinkling of fried garlic."}]}