{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/10/20191023-chicken-adobo-vicky-wasik-21.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Filipino", "keywords": ["adobo", "low carb", "soy sauce", "vinegar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.75", "ratingCount": "4"}, "name": "Filipino-Style Chicken Adobo", "link": "https://www.seriouseats.com/recipes/2019/11/filipino-style-chicken-adobo-recipe.html", "description": "Chicken adobo is a classic Filipino dish that's as savory as it is bright with acid, and it goes perfectly with a large platter of garlic fried rice.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Braising and Stewing", "Chicken", "Filipino", "Mains", "Quick Dinners", "Stovetop"], "recipeIngredient": ["1 tablespoon (15ml) canola oil or other neutral oil", "4 bone-in, skin-on chicken legs, separated into thighs and drumsticks (about 2 1/2 pounds; 1.15kg)", "Kosher salt", "8 garlic cloves, thinly sliced", "2 whole fresh bay leaves (or 3 whole dried bay leaves)", "1 1/2 teaspoons whole black peppercorns", "1 1/4 cups (300ml) water", "1 cup (240ml) soy sauce", "1 cup (240ml) rice vinegar (see note)", "Steamed white rice or <a href=\"https://www.seriouseats.com/recipes/2019/11/garlic-fried-rice-recipe.html\">garlic fried rice</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy-bottomed pot or Dutch oven, heat oil over medium heat until shimmering. Blot chicken dry with paper towels, then season lightly all over with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches if necessary, add chicken pieces to pot in a single layer, skin side down, making sure not to overcrowd the pot. Cook until well browned, 6 to 7 minutes. Using tongs, flip chicken pieces and cook until lightly brown on the second side, about 3 minutes. Transfer chicken to a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, bay leaves, and peppercorns to now-empty pot and cook, stirring constantly, until mixture is very fragrant and garlic turns a light golden color, about 30 seconds. Add water and stir with a wooden spoon, scraping up any brown bits on the bottom of the pot. Add soy sauce and vinegar, return chicken pieces to pot, increase heat to high, and bring liquid to a boil. Reduce heat to low, cover, and simmer until chicken is cooked through and tender, about 20 minutes, turning the chicken pieces halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Serve</strong>: The chicken is best served after sitting overnight in the refrigerator (see note), but it can also be served immediately, with steamed white rice or (preferably) garlic fried rice. The chicken pieces can also be briefly broiled before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Broil Chicken Adobo:</strong> Adjust oven rack to 6 inches below broiler element and preheat broiler to high. Transfer chicken pieces to a paper towel&ndash;lined rimmed baking sheet and blot surface with more paper towels to remove as much moisture as possible; discard paper towels. Arrange chicken skin side up on the baking sheet and broil until chicken skin is crispy and lightly charred, about 2 minutes (keep an eye on the chicken to ensure it does not burn). Serve immediately with steamed white rice or (preferably) garlic fried rice, passing adobo sauce at the table."}]}