{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/05/cuminlentils.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": ["cumin", "dandelion green", "lentil", "sausage", "skillet supper"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Cumin-Scented Lentils With Sausage and Dandelion Greens", "link": "https://www.seriouseats.com/recipes/2019/05/cumin-scented-lentils-with-sausage-and-dandelion-greens.html", "description": "Bloom your cumin seeds to build deep flavor in record time for this hearty but light dinner of saucy lentils and sausage.", "totalTime": "45 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Gluten-Free", "Mains", "Quick and Easy", "Quick Dinners", "Recipes", "Stovetop"], "recipeIngredient": ["2 tablespoons (30ml) extra-virgin olive oil", "1 pound (450g) fresh sausage links, such as merguez or chorizo", "2 teaspoons (6g) whole cumin seeds", "1 large onion, finely chopped", "Kosher salt", "2 garlic cloves, minced", "1/2 teaspoon red pepper flakes", "1 cup (7 ounces; 200g) French Le Puy Lentils, rinsed and picked over for stones", "1 (28-ounce) can whole peeled tomatoes, crushed by hand", "3 cups (710 ml) <a href=\"https://www.seriouseats.com/recipes/2017/04/pressure-cooker-chicken-stock-recipe.html\">homemade</a> chicken stock or low-sodium, store-bought broth", "1 bunch (about 6 ounces; 170g) dandelion greens, cut into 3-inch pieces", "2 teaspoons (10ml) sherry vinegar", "1/2 cup fresh cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, straight-sided sauté pan or Dutch oven, heat oil over medium heat until shimmering. Add sausages and cook, turning occasionally, until well browned on all sides, about 3 minutes. Transfer sausages to a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cumin seeds to the pan and cook, swirling and stirring constantly until cumin is aromatic and lightly golden, about 30 seconds. Add onion and a generous pinch of salt and cook, stirring frequently, until softened but not brown, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic and red pepper flakes and continue to cook, stirring constantly, until aromatic, about 30 seconds. Stir in lentils, tomatoes, chicken stock, and a healthy pinch of salt. Increase heat to high and bring to a boil. Lower heat to medium-high and simmer lentils, uncovered, stirring occasionally, until lentils are mostly tender and cooking liquid has reduced to a stew-like consistency, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in dandelion greens and cook until lightly wilted, about 1 minute. Return sausages to the skillet, nestling them into the lentils so that they are mostly submerged. Cover the pan, and cook until sausages register an internal temperature of 150&deg;F (65.5&deg;C), 5 to 7 minutes. Remove from heat, stir in sherry vinegar, and season to taste with salt. Portion into individual serving bowls, and sprinkle with cilantro leaves. Serve immediately."}]}