{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/12/20191119-koji-prime-rib-vicky-wasik-59.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": ["koji", "prime rib"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Koji Prime Rib", "link": "https://www.seriouseats.com/recipes/2019/12/koji-prime-rib-recipe.html", "description": "For the ultimate prime rib, slather it with shio koji before cooking for an intensely savory and tender holiday roast.", "totalTime": "5 to 6 hours, plus up to 24 hours resting time", "recipeYield": "Serves 6 to 12, depending on size of roast", "recipeCategory": ["Beef", "Christmas", "Mains", "Recipes", "Roasting", "Thanksgiving", "Winter"], "recipeIngredient": ["1 standing rib roast (prime rib), 7 to 12 pounds (3.2 to 5.4kg; see note)", "1 cup (300g; 240ml) <a href=\"https://www.seriouseats.com/recipes/2019/12/shio-koji-marinade-recipe.html\">shio koji</a> (see note)", "Freshly ground black pepper", "<strong>For Serving:</strong>", "<a href=\"https://www.seriouseats.com/recipes/2019/12/koji-beef-jus-recipe.html\">Koji beef jus (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>The Day Before Roasting, for the Prime Rib:</strong> Using a sharp knife, cut meat away from bone in one piece, cutting as close to the bone as possible, leaving you with a boneless roast and a slab of rib bones; reserve rib bones. Pat roast dry with paper towels; then using your hands, slather shio koji over entire surface of the roast and rib bones. Place roast back on bones, and, using butcher's twine, tie together so that roast looks as it did before meat was removed from the bones. Transfer roast, fat cap side up, to a wire rack set in a foil-lined rimmed baking sheet, then refrigerate, uncovered, at least 12 hours and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>When Ready to Cook:</strong> Adjust oven rack to center position and preheat oven to 225&deg;F (105&deg;C). Using a paper towel, gently wipe away excess bits of shio koji from the fat cap side of the roast. Transfer baking sheet with rack and roast to oven and cook until internal temperature registers 125&deg;F (52&deg;C) on an <dorado id=\"thermoworks-thermapen\" class=\"text\">instant-read thermometer</dorado> at the roast's thickest point for medium-rare or 135&deg;F (57&deg;C) for medium, 4 to 5 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove roast from oven, tent loosely with foil, and let rest at room temperature for at least 30 minutes and up to 1 1/2 hours. Meanwhile, increase oven temperature to 500&deg;F (260&deg;C) or highest possible temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ten minutes before guests are ready to be served, remove foil, place roast back in hot oven, and cook until deeply browned and crisp on the exterior, 6 to 10 minutes. Remove from oven, and transfer roast to a carving board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For Serving:</strong> Cut away twine, and separate roast from ribs. Using a sharp knife, cut between ribs to separate into individual pieces, and then slice roast into 3/4-inch-thick slices. Serve right away, passing coarse sea salt and koji beef jus (if using) at the table."}]}