{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/05/homemadejapchae.jpg", "author": {"@type": "Person", "name": "Seoyoung Jung"}, "recipeCuisine": "Korean", "keywords": ["Asian", "banchan", "Korean", "noodle", "pork", "side"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "<i>Japchae</i> (Korean Glass Noodles With Pork and Vegetables)", "link": "https://www.seriouseats.com/recipes/2019/05/japchae-recipe.html", "description": "Korean <em>japchae</em> is festive, a colorful array of vegetables, egg, meat, and noodles that combine in a joyous celebration. This version is lighter, cleaner, and more refined than the hot and greasy ones many restaurants serve.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves about 8 as a small dish, or 4 as a main course", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Korean", "Mains", "Noodles", "Sides", "Stovetop"], "recipeIngredient": ["<strong>For the Mushrooms and Pork:</strong>", "6 dried wood ear mushrooms (about 5g)", "3 1/2 ounces shiitake mushrooms (100g; about 5 medium shiitakes), stems discarded and caps sliced 1/4 inch thick", "3 1/2 ounces (100g) lean boneless, skinless pork shoulder, cut into 2- by 1/4-inch strips", "2 tablespoons (30ml) <i>yangjo ganjang</i> (Korean wheat-based soy sauce; see note)", "2 medium cloves garlic, minced", "1 tablespoon granulated sugar", "2 teaspoons (10ml) soju", "Generous pinch minced peeled fresh ginger", "Freshly ground black pepper", "1 tablespoon (15ml) vegetable oil", "<strong>For the <i>Jidan</i> (Egg Garnish):</strong>", "2 large eggs", "Vegetable oil, for greasing the pan", "<strong>For the Carrot and Onion:</strong>", "2 teaspoons (10ml) vegetable oil", "1 small (5-ounce; 140g) yellow onion, thinly sliced pole to pole", "1 small (3-ounce; 90g) carrot, <a href=\"https://www.seriouseats.com/2010/05/knife-skills-how-to-cut-carrots.html\">cut into julienne</a>", "Kosher salt", "<strong>For the Spinach:</strong>", "3 ounces curly spinach (90g; about 3 loosely packed cups)", "1 small clove garlic, minced", "1/2 teaspoon toasted sesame oil", "1/2 teaspoon ground roasted sesame seeds", "<strong>For the Noodles:</strong>", "5 1/4 ounces (150g) <i>dangmyeon</i> (Korean sweet potato glass noodles; see note)", "1 tablespoon (15ml) yangjo ganjang (Korean wheat-based soy sauce; see note)", "1 teaspoon brown or granulated sugar", "2 teaspoons ground roasted sesame seeds", "Toasted sesame oil, for drizzling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Mushrooms and Pork:</strong> In a medium bowl, cover wood ear mushrooms generously with cold water and let stand until fully rehydrated and softened, about 1 hour. Drain, then tear wood ear mushrooms into smaller strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine wood ear mushrooms in a small bowl with shiitake mushrooms, pork, soy sauce, garlic, sugar, soju, ginger, and a few grindings of black pepper. Mix thoroughly, then let marinate 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat oil over medium-high heat until shimmering. Add pork and mushrooms and cook, stirring, until pork is cooked through and mushrooms are just starting to lightly brown. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Meanwhile, for the <i>Jidan</i> (Egg Garnish):</strong> Separate egg yolks and whites, passing each component separately through a clean fine-mesh strainer into its own small bowl. (You can use the same strainer for whites and yolks, but wash it between uses.) Very gently mix the contents of each bowl until incorporated, but avoid beating, as you don't want to incorporate air."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm a mint-condition 8-inch nonstick skillet over medium-low heat. Using an oiled paper towel, lightly wipe oil all over the surface of the skillet. Scrape yolk into skillet, spreading it around to form a thin, even round. Gently cook until yolk is mostly set, about 1 minute, making sure to manage the heat so that the yolk cooks without browning on the bottom."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a flexible rubber spatula, gently lift yolk round and slide a chopstick underneath until you can pick the round up. Lay yolk round down on its other side and continue cooking until fully set but not browned, about 30 seconds. Transfer yolk round to a work surface to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out skillet, then repeat procedure with egg whites, lightly oiling the pan first with the towel, then making a round of egg whites, being careful to prevent browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the yolk and egg-white rounds have cooled, carefully slice into thin slivers using a very sharp knife. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Carrot and Onion:</strong> In a large skillet, heat oil over medium heat until shimmering. Add onion and carrot, season with salt, and cook, stirring frequently, until just tender, about 4 minutes. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Spinach:</strong> In a large pot of salted boiling water, cook spinach until tender, about 1 minute. Using a spider or other wire strainer, remove spinach, allowing excess water to drain off, and transfer to a bowl. (Reserve boiling water for noodles.) Squeeze out any excess water from spinach. Toss spinach with minced garlic, sesame oil, and ground sesame seeds, mixing well to evenly coat. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Noodles:</strong> Add noodles to the boiling water and cook until tender but still chewy (roughly 6 minutes, though this will depend on the brand of noodles you buy). Drain into a colander and rinse noodles with cold running water. Allow to drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer noodles to a large serving or mixing bowl. If the noodle strands are very long, snip them a few times, using <a href=\"https://www.seriouseats.com/2018/05/the-best-kitchen-shears.html\">kitchen shears</a>, to shorten them to a more manageable length (but be careful not to make the lengths too short)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together soy sauce and sugar, then add this soy sauce mixture to the noodles, tossing well to coat. Add pork and mushrooms, carrot and onion, and slivered eggs. Add ground sesame seeds. Drizzle with sesame oil, then toss until thoroughly mixed. Taste and adjust seasoning if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add spinach and toss once more to combine. Serve japchae warm or at room temperature."}]}