{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/07/20190618-grilled-paella-vicky-wasik-14.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Spanish", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Grilled Paella Mixta (Mixed Paella With Chicken and Seafood)", "link": "https://www.seriouseats.com/recipes/2019/07/grilled-paella-mixta-mixed-paella-with-chicken-and-seafood.html", "description": "This famed seafood-and-meat paella may not be traditional, but it's a favorite of diners all over the world for good reason. The grill makes it possible to cook a one big enough for a crowd at home.", "totalTime": "2 hours 30 minutes", "recipeYield": "Serves 6 to 8", "recipeCategory": ["Chicken", "Clams, Mussels, and Oysters", "Grilling, Smoking, and Barbecue", "Mains", "Rice", "Seafood", "Shrimp", "Spanish"], "recipeIngredient": ["<strong>For the Sofrito:</strong>", "6 <a href=\"https://www.tienda.com/products/noras-dried-peppers-la-dalia-sp-41.html?aid=495\">dried ñora peppers</a> or 4 ancho chilies (1 1/2 ounces total; 50g), optional; see note", "1/2 cup (120ml) extra-virgin olive oil", "5 medium cloves garlic, minced", "4 medium yellow onions (1.5 pounds/600g), finely diced", "One large (8-ounce/225g) green pepper, <a href=\"https://www.seriouseats.com/2010/09/draft-knife-skills-how-to-cut-a-bell-pepper.html\">stemmed, seeded, and finely diced</a>", "One large (8-ounce/225g) red pepper, <a href=\"https://www.seriouseats.com/2010/09/draft-knife-skills-how-to-cut-a-bell-pepper.html\">stemmed, seeded, and finely diced</a>", "One medium (10-ounce/285g) leek, white and light green parts only, washed well and <a href=\"https://www.seriouseats.com/2011/01/knife-skills-how-to-prepare-leeks.html\">finely diced</a>", "Kosher salt", "<strong>For the Paella:</strong>", "1/4 cup (60ml) extra-virgin olive oil", "Kosher salt", "3 chicken legs (1 3/4 pounds; 800g), thighs and drumsticks split", "6 pork tenderloin medallions (about 1 1/4 pounds/565g total)", "1/4 ounce (7g) Spanish chorizo, cut into large dice (about 1/2 cup)", "One (14.5-ounce;411g) can whole, peeled tomatoes, crushed by hand or blended to a purée", "1 cup (235ml) sofrito", "1 teaspoon sweet smoked Spanish paprika (pimentón dulce)", "Large pinch saffron", "7 cups (1.65L) boiling hot <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">white chicken stock</a> or low-sodium broth, <a href=\"https://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable stock</a>, or water, plus more as needed", "2.5 cups (17 1/2 ounces; 495g) short-grain Spanish rice, such as <a href=\"https://www.tienda.com/products/bomba-paella-rice-peregrino-rc-03.html?aid=495\">Bomba</a> and <a href=\"https://www.tienda.com/products/calasparra-paella-rice-peregrino-rc-12-2.html?aid=495\">Calasparra</a>", "12 littleneck clams, soaked in multiple changes of cold salted water until no sand can be found on the bottom of the bowl", "15 mussels, beards removed", "1/4 pound (115g) large shelled shrimp", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Sofrito:</strong> Place dried peppers (if using) in a medium heatproof bowl and cover with boiling water (if not using, skip to Step 3). Place a weight or wet paper towel on top to help submerge the peppers. Let stand until peppers are fully softened, 30 minutes to 1 hour. If the peppers are very stubborn (as thick-skinned ñoras can be), you may need to tear a small hole in them to let water penetrate inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain peppers and discard stems and seeds. Using a paring knife, carefully scrape the flesh from the skins. Discard skins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart saucepan, heat oil over medium-high heat until shimmering. Add garlic, onion, green pepper, red pepper, leek, and scraped rehydrated chili flesh (if using), season lightly with salt, and cook, stirring, until vegetables have released their liquid and are beginning to brown lightly on the bottom of the pan, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to medium-low and continue cooking, stirring and scraping frequently, until sofrito is sweet to the taste and a deep golden brown color, about 45 minutes longer. You should have about 2 cups. You can refrigerate the sofrito in an airtight container for up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Paella:</strong> Make sure your grill is on a level surface. <a href=\"http://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over the coal grate. Set cooking grate in place and set a 17-inch paella pan on top of that."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add oil to paella pan, pushing it around with a long metal spatula (a stainless-steel wok spatula can work well here) to coat the entire surface, and heat until oil is lightly smoking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken and pork all over with salt, then add to pan and cook, turning, until deeply browned on both sides, about 8 minutes. Transfer pork to a platter and leave chicken in the pan, pushing the chicken pieces to the outer edge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chorizo to the pan and cook, stirring, just until fat starts to render. Add tomato purée, sofrito, paprika, and saffron, and cook, stirring and scraping until tomato sauce is moderately browned, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock (or water) and bring to a rolling boil. Season lightly with salt. Sprinkle in rice all over, making sure all grains are submerged and none are stuck on top of the pieces of chicken. Using your spatula, gently swirl the liquid around to distribute the rice evenly. Return to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle clams and mussels in the liquid and cook, without stirring, for 8 minutes. Add shrimp to the paella pan and return the pork to it as well, nestling the pieces down into the cooking rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point, depending on the heat of your grill, you will likely want to raise the paella higher aloft to increase its distance from the heat source and lessen the chances that it burns below (unless your grill has gotten so tepid that the paella is barely simmering, you'll want to do this). To do it, lift the paella pan carefully off the grill and set either wadded-up aluminum foil or, for an even higher lift, bricks, on the grill grate (it helps to have another person aid you during this step). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the paella pan back on the grill and continue cooking until the rice is just al dente and the liquid has fully been absorbed, about 8 minutes longer; turn the clams, mussels, shrimp, and pork once during this time to heat them through on both sides. If the liquid cooks off and the rice isn't done enough, add more boiling-hot stock or water in small additions until the rice reaches the desired doneness. You can also use a spoon to carefully dig into the paella and check the bottom of the pan to make sure nothing is burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rice is perfectly cooked and the liquid is fully absorbed, remove from heat and let rest 10 minutes before serving with lemon wedges."}]}