{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/04/20190403-black-day-jajangmyeon-joel-russo-1.jpg", "author": {"@type": "Person", "name": "Seoyoung Jung"}, "recipeCuisine": "Korean", "keywords": ["Asian", "black bean sauce", "black day", "jjajangmyeon", "Korean", "noodle", "pork", "shrimp", "squid", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "<i>Jjajangmyeon</i> (Korean Black Bean Noodles)", "link": "https://www.seriouseats.com/recipes/2019/04/jjajangmyeon-black-bean-noodles.html", "description": "Not just for lonely hearts, these black bean noodles laced with pork and seafood are the kind of carb-laden, umami-heavy comfort food you'll crave all year long.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["Korean", "Mains", "Noodles", "Stovetop"], "recipeIngredient": ["1 cup (225ml) vegetable oil (only if you're stir-frying the black bean sauce; see note), plus more for stir-frying the meat and aromatics", "One 8-ounce (225g) jar black bean sauce (see note)", "6 large shell-on shrimp (3 1/2 ounces; 100g)", "6 ounces (170g) boneless, skinless pork belly, cut into 1/4-inch dice", "2 scallions, white and light-green parts only, cut into 1/4-inch dice", "1/2 teaspoon minced peeled fresh ginger (or more, if you want a stronger ginger flavor)", "1 small (6-ounce; 170g) yellow onion, cut into 1/4-inch dice, divided", "1 teaspoon (5ml) Korean soy sauce, plus more to taste", "1 small (5-ounce; 150g) white potato, peeled and cut into 1/4-inch dice", "1 cleaned squid body (about 2 1/2 ounces; 70g), cut into 1/4-inch dice", "1 tablespoon (15ml) oyster sauce, plus more to taste", "1 1/2 teaspoons (8g) sugar", "Freshly ground black pepper", "1 teaspoon potato starch mixed with 2 teaspoons (10ml) water", "Enough <a href=\"https://www.maangchi.com/ingredient/jja-jjang-myun-noodles\">jjajangmyeon noodles</a> for 4 servings", "Julienned cucumber, cooked green peas, or  thinly sliced scallions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Stir-Frying the Black Bean Sauce (see note):</strong> Add oil to a wok and heat over high heat until oil reaches 350&deg;F (180&deg;C) on an instant-read thermometer. Set the wok's spatula in the oil as it heats so that the spatula is heated as well; this will help prevent the black bean sauce from sticking to the spatula when it's added."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add black bean sauce and fry, stirring constantly, until black bean sauce begins to look just slightly curdled. Immediately transfer to a heatproof container, along with all the frying oil. It's better to err on the side of less frying if you're unsure, as over-fried black bean sauce will clump up and be difficult to work with later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Make the Jjajangmyeon:</strong> In a small saucepan of simmering water, poach shrimp until just pink on the outside and still undercooked in the center, about 30 seconds. Drain. Shell shrimp and cut into 1/4-inch dice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean wok, heat about 3 tablespoons (45ml) vegetable oil over high heat until smoking. (You can use some of the vegetable oil from the bean-frying step, if you stir-fried the beans.) Add pork belly and spread in an even layer. Allow to sear for 30 seconds, then begin stirring and tossing constantly until pork is browned all over, about 30 seconds longer. (If you're working over gas, you may get some flare-ups; they'll die down quickly and enhance the flavor of the stir-fry.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add scallion, ginger, and about 3 tablespoons diced onion, then cook, stirring and tossing, until fragrant, about 20 seconds. Add soy sauce, pouring it down the side of the wok to make it sizzle. Cook, stirring, for 10 seconds longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potato and squid and cook, stirring and tossing constantly, until potato is about half cooked, about 3 minutes. Add remaining onion and cook, stirring and tossing, until onion has softened, about 1 minute. Working in 1-tablespoon (15ml) additions, add black bean sauce (without too much of the oil it was fried with), tossing to coat all the ingredients; exactly how much you add will depend on your taste, but your goal is a rich black bean character and very dark brown color throughout. (We ended up adding about 5 heaping tablespoons of the black bean sauce we used.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shrimp and toss to combine. Add oyster sauce and sugar and stir well to incorporate. Season with black pepper. Add water, 1 tablespoon (15ml) at a time, until the mixture has thinned enough to create a thick but flowing sauce. Continue cooking until potato is just cooked through; stir often and lower heat as needed to prevent scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add more water as needed, roughly 1 tablespoon (15ml) at a time, to reach a saucy consistency; if sauce becomes too thin, add 1 teaspoon (5ml) potato-starch slurry and bring to a simmer to help thicken the liquid. Repeat this process, adjusting with small amounts of water and slurry as needed, until the sauce is glossy and thick but slowly pourable. Adjust seasoning with more oyster sauce or soy sauce as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, boil jjajangmyeon noodles following the manufacturer's instructions. Drain and portion into serving bowls. Spoon the jjajangmyeon sauce on top, garnish with cucumbers, peas, or scallions, and serve."}]}