{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/07/thai-skewers-1.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Thai", "keywords": ["skewer"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Thai-Style Grilled Pork Skewers (<em>Moo Ping</em>)", "link": "https://www.seriouseats.com/recipes/2019/07/thai-style-grilled-pork-skewers-moo-ping.html", "description": "Thinly sliced pork shoulder gets marinated, put on a stick, grilled, and brushed with coconut cream. These skewers will have you forget all about sad takeout satay.", "totalTime": "4 hours 30 minutes ", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Grilling, Smoking, and Barbecue", "Pork", "Recipes", "Summer", "Thai"], "recipeIngredient": ["4 medium garlic cloves (20g), minced", "2 tablespoons (15g) minced cilantro stems, plus fresh cilantro leaves for serving", "2 tablespoons (30g) finely chopped <a href=\"https://www.amazon.com/dp/B000PDRANM/?tag=serieats-20\">palm sugar</a> (see note)", "1 tablespoon (15ml) fish sauce", "1 tablespoon (15ml) soy sauce", "1 tablespoon (15ml) oyster sauce", "1 1/2 teaspoons (6g) ground white pepper", "1/2 teaspoon (2g) <a href=\"https://www.amazon.com/Ajinomoto-Monosodium-Glutamate-Umami-Seasoning/dp/B00IH28XDE?tag=serieats-20\">MSG powder</a> (optional)", "2 pounds (900g) <a href=\"https://www.seriouseats.com/2019/07/what-is-pork-shoulder-boston-butt-picnic-shoulder.html\">pork butt</a>, in one piece", "1 (5 1/2-ounce; 160ml) can <a href=\"https://www.amazon.com/Native-Forest-Organic-Premium-Unsweetened/dp/B00AF7XMYY/?tag=serieats-20\">unsweetened coconut cream</a>", "1 recipe <a href=\"https://www.seriouseats.com/recipes/2019/05/thai-dried-chili-vinegar-dipping-sauce.html\">Thai Dried Chili-Vinegar Dipping Sauce</a>, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine garlic, cilantro stems, palm sugar, fish sauce, soy sauce, oyster sauce, white pepper, and MSG (if using), and stir until palm sugar is dissolved. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze pork for 15 minutes and up to 30 minutes (partially freezing the pork makes it easier to slice). Using a sharp chef's knife or slicing knife, slice pork against the grain into 2-inch-long, 1-inch-wide, and 1/8-inch-thick strips. The easiest and most efficient way to do this is to start by portioning the pork butt into 2-inch-wide by 1-inch-thick pieces, and then slicing those pieces crosswise into 1/8-inch-thick strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine pork and marinade in a large bowl, and, using hands, toss until every piece of meat is evenly coated in marinade. Cover tightly with plastic wrap and refrigerate for at least 4 hours, and up to 36 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thread one piece of pork onto a skewer, piercing it through twice to secure it, then bunching meat tightly together like an accordion. Continue threading pork onto skewer, making sure meat is tightly bunched together, leaving no parts of the skewer exposed except for a 2-inch handle at the bottom, and the pointy tip at the top. Repeat skewering process with remaining pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<a href=\"https://www.seriouseats.com/2019/07/how-to-set-up-grill-for-skewers.html\">Set up grill for skewers,</a> making sure to adjust distance between bricks to the length of your skewers. <a href=\"https://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly in the channel between the bricks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place skewers directly over the hot coals, balancing them on top of the bricks, with the handles overhanging the bricks closest to you and the tips balancing on the farther wall of bricks. Using a brush, brush pork with coconut cream. Cook, turning skewers and brushing pork with coconut cream frequently, until meat is lightly charred, and a piece of pork looks cooked through when removed and cut in half, 8 to 10 minutes; if flare-ups occur, move the skewers around as needed to get them away from the flames. Transfer to serving platter and let rest for 1 to 2 minutes. Serve immediately, passing lime wedges, as well as cilantro and dipping sauce (if using), at the table."}]}