{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/01/buldakfirechicken.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Korean", "keywords": ["bar food", "game day", "gochujang", "grill", "korean barbecue", "korean food", "mozzarella", "spicy"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5555555555556", "ratingCount": "9"}, "name": "Korean-Style Fire Chicken (<em>Buldak</em>) With Cheese", "link": "https://www.seriouseats.com/recipes/2019/01/korean-style-fire-chicken-buldak-with-cheese.html", "description": "Fire chicken is the ultimate game-day snack that will make you forget all about Buffalo wings.", "totalTime": "1 1/2 hours", "recipeYield": "Serves 4 ", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Cheese", "Game Day", "Grilled Chicken", "Grilling, Smoking, and Barbecue", "Korean", "Snacks"], "recipeIngredient": ["<strong>For the Sauce:</strong>", "1/2 cup (120ml) <a href=\"https://www.seriouseats.com/recipes/2018/11/pressure-cooker-beef-stock-2.html\">homemade brown chicken stock</a> or store-bought, low-sodium chicken broth", "1/2 cup (120ml) soy sauce", "1/4 cup (60ml) Korean rice syrup (see note)", "1/4 cup (60ml; 60g) gochujang (Korean chili paste)", "1/4 cup (25g) fine ground <em>gochugaru</em> (Korean chili powder)", "2 tablespoons (30ml) toasted sesame oil", "2 tablespoons (30ml) vegetable oil", "8 large garlic cloves, minced", "One (1-inch) piece fresh ginger, peeled and finely grated (about 1 tablespoon; 12g)", "2 fresh red chili peppers, minced (see note)", "1 tablespoon (6g) freshly ground black pepper", "1 cup (240ml) Sprite", "<strong>For the Chicken:</strong>", "4 bone-in, skin-on chicken thighs (about 1 1/2 pounds; 675g)", "<strong>To Finish:</strong>", "6 ounces (170g) low-moisture mozzarella, shredded", "2 scallions, thinly sliced", "1 tablespoon (6g) toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Sauce:</strong> In medium bowl, whisk together chicken stock, soy sauce, rice syrup, gochujang, gochugaru, and sesame oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In medium (3-quart) saucepan, heat vegetable oil over medium-high heat until shimmering. Add garlic and ginger and cook, stirring constantly until vegetables are aromatic, about 1 minute. Add chilies and black pepper and continue to cook, stirring constantly, until aromatic, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in gochujang mixture and Sprite, and bring to a rapid simmer. Simmer sauce, stirring and scraping down sides of saucepan occasionally with a rubber spatula, until reduced by about half and sauce coats the back of a spoon, 6 to 8 minutes. Transfer sauce to heat-proof liquid measuring cup or bowl and set aside to cool (you should have about 1 1/2 cups; 360ml of sauce) to room temperature. Sauce can be refrigerated up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Chicken:</strong> Pat chicken thighs dry with paper towels and place skin-side down on cutting board. Working with one thigh at a time, use a sharp knife to make incisions running along the length of both sides of the bone. Use knife tip to expose bone; then run blade underneath bone to free it from the flesh. Don't worry about scraping meat from bone. Cut bone away from thigh meat, making sure to trim and discard any residual cartilage or bone fragments; reserve bone. Repeat with remaining chicken thighs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In medium bowl or large zipper-lock bag, toss chicken thighs and bones with half the sauce (about 3/4 cup; 180ml), until well-coated. Cover, transfer to refrigerator, and let marinate for at least 45 minutes and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Adjust oven rack to 6 inches below broiler element and preheat broiler on high.</p>\r\n\r\n<p><strong>If grilling:</strong> <a href=\"https://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 1 chimney full of charcoal</a>. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. <a href=\"https://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#cleaningthegrillgrate\">Clean</a> and <a href=\"https://www.seriouseats.com/2010/04/how-to-clean-your-grill-barbecue-oiling-thegrate-charcoal.html#oilingthegrate\">oil</a> grilling grate. Grill chicken thighs and bones directly over high heat, starting thighs skin-side down, turning and shifting to cooler side of grill if there are excessive flare-ups, until skin is well-charred and bones are charred on all sides, 5 to 7 minutes. Using tongs, move bones to cooler side of grill, and flip thighs over and continue to cook until second side is charred and meat is just cooked through, about 5 to 7 minutes. Using poultry shears, cut thighs into 1- to 1 1/2-inch pieces. Continue to cook over direct heat, brushing pieces with remaining sauce, until chicken is fully cooked but still tender, 2 to 3 minutes. Transfer chicken pieces and bones to 10-inch cast iron skillet.</p>\r\n\r\n<p><strong>If broiling:</strong> Set wire rack inside a foil-lined rimmed baking sheet. Arrange chicken thighs and bones on prepared rack, with thighs facing skin-side up. Broil chicken, checking it frequently, until skin is well-charred, about 5 minutes. Using tongs, flip thighs and bones over, and continue to cook until chicken is just cooked through, about 5 minutes. Using poultry shears, cut thighs into 1- to 1 1/2-inch pieces. Transfer chicken pieces and bones to 10-inch cast iron skillet and toss with remaining sauce. Broil until chicken is fully cooked but still tender and sauce is bubbly, 2 to 3 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Finish:</strong> Sprinkle shredded mozzarella evenly over chicken pieces. Broil until cheese is fully melted and bubbly, 1 to 2 minutes. Sprinkle with scallions and sesame seeds; serve right away."}]}