{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/02/20190122-souffle-omelet-vicky-wasik-15.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "French", "keywords": ["egg", "low carb", "souffle"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "4"}, "name": "Soufflé Omelette With Cheese", "link": "https://www.seriouseats.com/recipes/2019/02/omelette-souffle-with-cheese.html", "description": "Much simpler than a classic soufflé, this omelette soufflé is cooked in a skillet on the stovetop, and it requires little more than eggs, cheese, and an extra couple minutes to beat the whites.", "totalTime": "10 minutes", "recipeYield": "Serves 1", "recipeCategory": ["Breakfast and Brunch", "Cheese", "Easter", "Father's Day", "French", "Mains", "Mother's Day", "Omelettes", "Quick and Easy", "Stovetop", "Vegetarian"], "recipeIngredient": ["3 large eggs, separated", "Kosher salt and freshly ground black pepper", "2 ounces (55g) grated Gruyère or cheddar cheese, divided", "Minced fresh chives (optional)", "1 tablespoon (15g) unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In medium bowl, beat egg yolks with a generous pinch of salt and some freshly ground black pepper until well mixed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In separate large mixing bowl, using a whisk, electric hand blender, or stand mixer fitted with whisk attachment, beat egg whites until firm, glossy peaks form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half of the beaten egg whites to yolks and stir well until whites are thoroughly combined and soufflé base has a looser consistency. Mix in half the cheese as well as the chives, if using. Add remaining beaten whites, and, using a silicon spatula, gently fold them into the soufflé base just until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 9- or 10-inch nonstick skillet, melt butter over medium heat, until foaming. Scrape soufflé base into pan. Using spatula, spread soufflé base into even circle and smooth out the surface. Cover and cook until bottom of omelette is browned and top is just barely set (or even a little loose still, if you prefer). Scatter remaining cheese on top; cover once more and cook until cheese starts to melt, about 1 minute longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully slide the omelette out of the pan and onto a warm serving plate, folding it over itself. Serve right away."}]}