{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/07/20190618-grilled-al-pastor-beef-skewers-vicky-wasik-1-2.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Mexican", "keywords": ["al pastor", "charcoal grilling", "grilling", "Mexican", "pork", "skewer", "taco"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Charcoal-Grilled <em>Al Pastor</em> Skewers", "link": "https://www.seriouseats.com/recipes/2019/07/charcoal-grilled-al-pastor-skewers.html", "description": "With a special grill set-up, you can turn out top-notch al pastor in skewer form.", "totalTime": "5 to 36 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Grilling, Smoking, and Barbecue", "Mexican", "Pork", "Recipes"], "recipeIngredient": ["<strong>For the Pork:</strong>", "2 ancho chilies (40g), stemmed and seeded", "2 pasilla or guajillo chilies (15g), stemmed and seeded", "1/2 cup (120ml) <a href=\"https://www.seriouseats.com/recipes/2017/04/pressure-cooker-chicken-stock-recipe.html\">homemade</a> chicken stock or low-sodium store-bought broth", "2 teaspoons (10ml) vegetable oil", "1 teaspoon (2g) dried Mexican oregano", "1 teaspoon (3g) ground cumin", "1 tablespoon (12g) achiote powder or paste", "1 chipotle chili in adobo (15g), plus 2 teaspoons (10ml) adobo sauce", "1/4 cup (60ml) distilled white vinegar", "2 1/2 teaspoons (10g) kosher salt", "2 teaspoons (10g) sugar", "3 medium garlic cloves (15g)", "2 pounds (900g) <a href=\"https://www.seriouseats.com/2019/07/what-is-pork-shoulder-boston-butt-picnic-shoulder.html\">pork butt</a>, in one piece", "<strong>For the Skewers and Serving:</strong>", "1 small pineapple (around 2 pounds; 900g), peeled, cored, and cut into 1- by 1/4-inch pieces", "Lime wedges, for serving", "Finely chopped fresh cilantro leaves and tender stems (optional)", "<a href=\"https://www.seriouseats.com/recipes/2013/02/basic-salsa-verde-mexican-tomatillo-recipe.html\">Salsa verde</a>, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Pork:</strong> In a large, dry saucepan, toast ancho and pasilla chilies over medium-high heat, turning chilies occasionally, until puffed, pliable, lightly browned in spots, and very aromatic, about 5 minutes. Add chicken stock (it should boil immediately), then pour contents of saucepan into a small heatproof bowl. Cover loosely with plastic wrap and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out saucepan, add oil, and return to medium-high heat until oil is shimmering. Add cumin, oregano, and achiote and cook, stirring frequently, until spices are bloomed and aromatic but not browned, about 30 seconds. Stir in chipotle and adobo sauce and cook for 30 seconds longer. Stir in vinegar, salt, and sugar, and remove saucepan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer contents of saucepan to a blender along with garlic and chilies with their steeping liquid. Blend on high speed until completely smooth, scraping down sides of blender jar with a rubber spatula as needed, about 1 minute. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze pork for 15 minutes and up to 30 minutes (partially freezing the pork makes it easier to slice). Using a sharp chef's knife or slicing knife, slice pork against the grain into 2-inch-long, 1-inch-wide, and 1/8-inch-thick strips. The easiest and most efficient way to do this is to start by portioning the pork butt into 2-inch-wide by 1-inch-thick pieces, and then slicing those pieces crosswise into 1/8-inch-thick strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine pork and marinade in a large bowl, and using hands, toss until every piece of meat is evenly coated in marinade. Cover tightly with plastic wrap and refrigerate for at least 4 hours and up to 36 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Skewers and Serving:</strong> Thread one piece of pork onto a skewer, piercing it through twice to secure it, then bunching meat tightly together like an accordion. Then thread one piece of pineapple onto skewer. Continue alternating pieces of pork with pineapple, ending the skewer with a piece of pork. Make sure meat and pineapple are bunched tightly together, leaving no parts of the skewer exposed except for a 2-inch handle at the bottom, and the pointy tip at the top. Repeat skewering process with remaining pork and pineapple."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<a href=\"https://www.seriouseats.com/2019/07/how-to-set-up-grill-for-skewers.html\">Set up grill for skewers,</a> making sure to adjust distance between bricks to the length of your skewers. <a href=\"https://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light one chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly in the channel between the bricks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place skewers directly over the hot coals, balancing them on top of the bricks, with the handles overhanging the bricks closest to you, and the tips balancing on the farther wall of bricks. Cook, turning frequently, until pork and pineapple are lightly charred, and a piece of pork looks cooked through when removed and cut in half, 8 to 10 minutes; if flare-ups occur, move the skewers around as needed to get them away from the flames. Transfer to serving platter and let rest for 1 to 2 minutes. Serve immediately, passing lime wedges, as well as cilantro and salsa (if using), at the table."}]}