{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/06/20190524-pistachio-paste-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["dessert", "nut", "paste", "pistachio", "spread"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Homemade Pistachio Paste", "link": "https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-paste.html", "description": "The mellow sweetness of this thick and flavorful pistachio paste will stand on its own when spread over toast or stuffed between layers of cake, but it can also work to flavor other desserts as well, whether into a <a href=\"https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-cream.html\">pistachio chantilly</a>, twirled up with a yeasty dough for breakfast buns, or used as a stand-in for almond paste (think: pistachio stollen!). In a recipe as simple as this, every ingredient matters&mdash;accept no substitutions! ", "totalTime": "20 minutes", "recipeYield": "About 2 heaping cups", "recipeCategory": ["Dairy-Free", "Desserts", "No-Cook", "Nuts", "Vegan"], "recipeIngredient": ["9 ounces whole, raw pistachios, blanched and peeled; see note (about 2 cups; 255g)", "10 ounces powdered sugar, preferably organic; more information <a href=\"https://www.seriouseats.com/2016/03/organic-powdered-sugar-versus-conventional-baking-cornstarch-tapioca.html\">here</a> (about 2 1/2 cups; 280g)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon <a href=\"https://www.seriouseats.com/2011/02/spice-hunting-orange-blossom-flower-water-middle-eastern.html\">orange flower water</a>, such as Cortas", "2 ounces roasted pistachio oil, such as <a href=\"https://www.amazon.com/Tourangelle-Oil-Rstd-Pistachio-2-Pack/dp/B00J9T48SI/?tag=serieats-20\">La Tourangelle</a> (shy 1/3 cup; 55g)", "2 ounces water, optional (1/4 cup; 55g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, grind the blanched pistachios to form a smooth but slightly oily mass. The timing of this step can vary depending on the type, freshness, and moisture content of the pistachios, along with the size and power of the food processor. Fresher, wetter pistachios may only require 5 minutes of processing, while older, drier, or toasted pistachios may require 10 minutes or more. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once a smooth, oily paste has formed, add the powdered sugar, salt, and orange flower water and continue processing until smooth and thick. With the machine still running, drizzle in the oil and process until silky and pale. At this stage, the pistachio paste can be seasoned with additional salt to taste, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While warm, the pistachio paste will be creamy and soft, but it will thicken into a sliceable, dough-like mass when cooled to room temperature. This is the ideal consistency to use as a stand in for almond paste or marzipan. However,  if a more spreadable consistency is desired, along the lines of peanut butter, continue running the food processor and drizzle in 2 ounces (1/4 cup; 55g) water. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a non-reactive, airtight container, the pistachio paste can be stored at room temperature for a week, or held in the refrigerator for one month. If using as a stand-in for commercial almond paste, bring to room temperature before use. When freshly made, the pistachio paste will have a relatively light green color, but will naturally darken to a deep olive shade over time."}]}