{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/04/20190411-citrus-salad-xo-sauce-vicky-wasik-3.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": ["citrus", "salad", "XO sauce"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Citrus Salad With XO Sauce and Meyer Lemon Dressing", "link": "https://www.seriouseats.com/recipes/2019/04/citrus-salad-with-xo-sauce-recipe.html", "description": "The savory depth of XO sauce plays the perfect foil to sweet and tart citrus in this simple salad.", "totalTime": "10 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Citrus", "No-Cook", "Salads", "Spring"], "recipeIngredient": ["2 pounds (900g) mixed citrus fruit (such as oranges, grapefruit, pomelos, tangelos, clementines, mandarins, and tangerines), peeled and cut into 1/4-inch-thick rounds, juices reserved separately (see note)", "2 scallions (40g), white and green parts divided, white parts minced, green parts thinly sliced on a bias", "12 sprigs (12g) fresh cilantro, leaves and tender stems divided, stems minced", "1 small green or red Thai chili, stemmed and minced (see note)", "1 teaspoon finely grated zest from 1 Meyer lemon (see note), plus 1 tablespoon (15ml) juice", "1 tablespoon (15ml) honey", "3 tablespoons (45ml) extra-virgin olive oil", "1 teaspoon (5ml) toasted sesame oil (optional)", "Kosher salt", "1/4 cup (75g) <a href=\"https://www.seriouseats.com/recipes/2019/04/xo-sauce.html\">XO sauce</a>", "3 tablespoons (45g) roasted peanuts, coarsely chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine reserved citrus juice, white scallion parts, cilantro stems, chili, lemon zest and juice, and honey. Whisking constantly, slowly drizzle in olive oil, followed by sesame oil (if using). Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shingle citrus rounds on a large serving platter, pausing to spoon dressing over each layer of citrus before shingling more on top. Using a spoon, evenly drizzle remaining dressing over the citrus, followed by small spoonfuls of XO sauce, making sure to use some of the aromatic oil from the XO. Season citrus lightly with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with peanuts (if using), followed by green scallion parts and cilantro leaves. Serve immediately."}]}