{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/10/20191007-leftover-turkey-ramen-vicky-wasik-4.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Turkey <em>Chintan</em> Ramen", "link": "https://www.seriouseats.com/recipes/2019/11/turkey-chintan-ramen.html", "description": "Turn your Thanksgiving leftovers into a light, yet satisfying, bowl of turkey ramen.", "totalTime": "2 hours", "recipeYield": "Makes 4 bowls of ramen", "recipeCategory": ["Japanese", "Mains", "Pressure Cooker", "Ramen", "Turkey"], "recipeIngredient": ["<strong>For the Broth:</strong>", "4 lbs (1.8kg) turkey bones, reserved from a roast turkey (see note)", "<strong>For the Tare:</strong>", "1 cup (200ml) soy sauce (see note)", "1/4 cup (60ml) tamari", "1/4 cup (60ml) mirin", "<strong>For the Brussels Sprouts Topping:</strong>", "1 tablespoon (15ml) canola oil, or other neutral oil", "3 medium Brussels sprouts, divided into individual leaves", "Kosher salt", "<strong>For Serving:</strong>", "4 servings ramen noodles, either store-bought or <a href=\"https://www.seriouseats.com/2018/11/the-ultimate-guide-to-making-ramen-noodles-at-home.html\">homemade</a>", "1/2 cup (120ml) rendered turkey fat (see note)", "2 scallions, white and green parts divided and thinly sliced", "Freshly ground black pepper", "Apple cider vinegar, to taste", "4 (1/2-inch-thick) slices roast turkey breast"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Broth:</strong> Place turkey bones in pressure cooker and cover with 6 1/4 cups (1.5L) water. (No matter what, be sure not to exceed the max-fill line of your cooker.) If using stovetop pressure cooker, cover pressure cooker and place over high heat until cooker comes to pressure, then reduce heat to medium low and cook for 1 hour. If using an electric pressure cooker, cover pressure cooker and cook on high pressure for 1 hour. Allow pressure cooker to depressurize naturally. Strain broth through fine-mesh sieve into large mixing bowl. At this point, broth can be transferred to a saucepan to be heated back to boiling and used immediately, or it can be cooled and refrigerated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Tare:</strong> In a small bowl, stir together soy sauce, tamari, and mirin until well-combined. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Brussels Sprouts Topping:</strong> Heat oil in a large skillet over high heat until lightly smoking. Add Brussels sprouts leaves. Season to taste with salt and cook, tossing frequently, until bright green and charred in spots, about 2 minutes. Transfer to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For Serving:</strong> Bring a large pot of water to a boil over high heat, and cook noodles according to packaging or recipe instructions. Spoon 2 tablespoons of tare, 1 tablespoon rendered turkey fat, 1/4 sliced scallions whites, and a grind of black pepper into each warmed serving bowl. Add 1 1/2 cups (360mL) boiling broth to each bowl, along with several drops of vinegar, to taste. Add noodles to bowls, top with sliced turkey breast, seared Brussels sprouts leaves, and sliced scallion greens. Serve immediately."}]}