{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/05/20190429-fruit-oat-bars-vicky-wasik-20.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["bar", "bar cookie", "cookie", "fruit", "Jam", "jelly", "oat", "rolled oat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "12"}, "name": "Jammy Fruit Bars", "link": "https://www.seriouseats.com/recipes/2019/05/jammy-fruit-bars.html", "description": "These fruity, oaty bars are inspired by Icelandic <em>Hjónabandssæla</em> (often translated as \"happy marriage cake\"), but perhaps closer to an American bar cookie in execution. They're hearty and rich, thanks to plenty of rolled oats and butter in the crust and crumb topping, with a flavorful layer of jam or fresh fruit in between. What kind? That's all up to you! ", "totalTime": "About 90 minutes", "recipeYield": "About nine 3-inch squares", "recipeCategory": ["Baking", "Blueberry", "Breakfast Sweets", "Brownies and Bars", "Cakes", "Cherry", "Fruit Desserts", "Pastry", "Peach", "Quick and Easy", "Spring", "Strawberry", "Summer"], "recipeIngredient": ["<Strong>For the Dough:</strong>", "4 1/2 ounces old fashioned rolled oats, not quick cooking, instant, or thick cut (about 1 1/3 cup; 128g)", "4 1/2 ounces all-purpose flour (about 1 cup, spooned; 128g)", "6 ounces light brown sugar (about 3/4 cup, firmly packed; 170g)", "1 teaspoon baking powder", "1 teaspoon (4g) Diamond Crystal kosher salt, plus more for sprinkling; for table salt, use about half as much by volume or the same weight, plus additional salt for sprinkling", "1/4 teaspoon baking soda", "1/4 teaspoon ground cinnamon", "6 ounces cold, unsalted butter, cut into 1/2-inch cubes (about 3/4 cup; 170g)", "1 large egg, straight from the fridge (about 1 3/4 ounces; 50g)", "<Strong>For the Filling:</strong>", "8 ounces jam (volume will vary; 225g) or 12 ounces \"juicy\" fruit, such as whole blueberries or raspberries, pitted cherries, sliced strawberries, or peeled and diced peaches (volume will vary; 340g)", "Lemon juice, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> Adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). Line an 8- by 2-inch square, anodized aluminum pan with two long strips of parchment to cover the bottom and sides, creasing as needed to ensure a secure fit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Make the Dough:</strong> In a large bowl, combine the rolled oats, all-purpose flour, brown sugar, baking powder, salt, baking soda, and cinnamon, then mix until homogenous. If needed, this dry mix can be bagged and stored at cool room temperature up until the date stamped on the carton of oatmeal. Add the butter, toss to break up the pieces, and smash each cube flat. Continue smashing and rubbing until the butter has mostly disappeared into a clumpy, streusel-like mix. This can also be done on low speed in the bowl of a stand mixer fitted with a paddle attachment, but take care not to overdo it. Add the egg and stir with a flexible spatula until well incorporated to form a soft dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Making the Bars:</strong> Scatter 16 ounces (about two-thirds of the mixture; 455g) into the bottom of the prepared cake pan, and gently press into an even layer. The idea is to encourage the pieces into a single sheet, without compressing the dough with excessive force.\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the jam or scatter the fruit into an even layer over the dough. Sprinkle with salt and a squeeze of fresh lemon juice, to bring balance to the fruit or jam. The amount needed will vary for both, depending on the type of fruit and its sweetness/acidity, with sweeter, milder fruits or jams requiring a bit of a heavy hand, and mellow, acidic fruits needing less. That said, virtually all fruits and jams will benefit from at least a small sprinkling of salt and squeeze of lemon, so don't skip this step altogether."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the remaining dough on top of the jam or fruit layer, crumbling it like streusel. Bake until the \"cake\" is puffed, firm, and golden brown, about 45 minutes, although the exact timing will vary depending on the moisture content of the jam or fruit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool directly in the pan until the bars are room temperature, then loosen the two exposed sides from the pan with a dull knife. Gently tug at the parchment to loosen the bars, then transfer to a cutting board, and cut into pieces as desired. Serve with a dollop of whipped cream, or plain as a bar cookie. Wrapped tightly in plastic, the bar cookies will keep three or four days at cool room temperature."}]}