{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190314-tiradito-vicky-wasik-11.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Latin American", "keywords": ["ceviche", "fish", "Japanese", "nikkei", "Peru", "Peruvian", "sashimi", "yellowtail"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Peruvian <em>Tiradito</em> With <em>Aji Amarillo</em> and Lime", "link": "https://www.seriouseats.com/recipes/2019/03/peruvian-tiradito-with-aji-amarillo-and-lime.html", "description": "One of the products of Nikkei cuisine, the cooking that resulted when Japanese immigrants moved to Peru in the nineteenth century, tiradito combines elements of sashimi with ceviche, for absolutely brilliant results.", "totalTime": "30 minutes", "recipeYield": "Serves 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Japanese", "Latin American", "Lime", "Quick and Easy", "Quick Dinners", "Salmon"], "recipeIngredient": ["8 ounces (225g) frozen aji amarillo peppers (about 6 peppers) or 1/2 cup (120ml) aji amarillo paste (see note)", "6 ounces (170g) sashimi-grade fish, such as salmon, yellowtail (hamachi), fluke, or corvina", "3/4 cup (180ml) fresh lime juice from about 10 limes", "2 medium cloves garlic", "One 1-inch knob peeled fresh ginger (about 1/3 ounce; 10g)", "Kosher salt", "1 teaspoon minced fresh cilantro leaves and tender stems", "Choclo and/or cooked and peeled sweet potato rounds, for garnish (optional; see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If using frozen aji amarillo chilies:</strong>  In a medium pot, cover chilies with water (they will float) and bring to a boil. Boil for 10 minutes, stirring pot from time to time to rotate peppers. Remove from heat and drain. Allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, using a sharp slicing knife, slice fish into thin slabs. Arrange slices on plates and transfer to refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, combine lime juice with garlic and ginger and blend on high speed until garlic and ginger are fully processed. Transfer to a medium mixing bowl. Rinse blender jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard seeds and stems from chili peppers. Strip off as much of the chili skin as you can and discard it. Transfer chili flesh to blender jar and blend at high speed, adding only enough water to get things moving, until a smooth purée forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir 1/2 cup (120ml) aji amarillo paste into the lime juice until thoroughly combined. (You can add less or more chili paste to your taste, but keep in mind that in addition to heat and flavor, it also gives the sauce viscosity. If you add too little, the sauce will be very thin.) Season with salt. Reserve remaining aji amarillo paste for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in cilantro. Remove plates from refrigerator and spoon sauce on top of fish, lightly coating it (reserve any remaining sauce for another use). If desired, garnish plates with <em>choclo</em> and/or sweet potato. Serve right away. "}]}