{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190227-vegan-brownies-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["cocoa", "cocoa butter", "dark chocolate", "dessert", "dry malt extract", "dutch cocoa", "eggless", "food processor", "powdered sugar"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "3"}, "name": "Vegan Brownies", "link": "https://www.seriouseats.com/recipes/2019/03/vegan-brownie-mix.html", "description": "With aromatic cocoa butter for richness and flavor, plus a toasty, nutty hint of malt powder to help with browning in a nondairy formula, these chocolate brownies taste as good as they look. Soy milk powder keeps the batter emulsified, so these vegan brownies still bake up with a beautifully glossy top. Even better, the powderized ingredients can be stored on a pantry shelf for months on end, a make-ahead option with all the convenience of a boxed mix.", "totalTime": "30 minutes", "recipeYield": "Makes 16 (2-inch) brownies", "recipeCategory": ["Baking", "Brownies and Bars", "Chocolate", "Dairy-Free", "Pastry", "Quick and Easy", "Vegan", "Vegetarian"], "recipeIngredient": ["<strong>For the Mix</strong>", "9 ounces organic powdered sugar, preferably tapioca-starch based; more information <a href=\"https://www.seriouseats.com/2016/03/organic-powdered-sugar-versus-conventional-baking-cornstarch-tapioca.html\">here</a> (about 2 1/4 cups, spooned; 255g)", "3 ounces finely chopped dark chocolate, roughly 72%; more information <a href=\"https://www.seriouseats.com/2018/04/6-supermarket-chocolate-bars-for-better-baking.html\">here</a> (about 1/2 cup, finely chopped; 85g)", "2 1/4 ounces all-purpose flour, such as Gold Medal Blue Label (about 1/2 cup, spooned; 63g)", "2 1/4 ounces high-fat Dutch process cocoa powder, more information <a href=\"https://www.seriouseats.com/2018/12/best-dutch-cocoas.html\">here</a> (about 3/4 cup, spooned; 63g)", "1 3/4 ounces finely chopped non-deodorized cocoa butter, such as Wild Foods (about 1/4 cup; 50g)", "1 1/8 ounces soy milk powder, such as Now Foods or Druids Grove (about 1/3 cup, plus 1 teaspoon; 32g)", "1/2 ounce dry malt extract, such as Briess Sparkling Amber (about 4 1/4 teaspoons; 14g)", "1 1/2 teaspoons (6g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "3/4 teaspoon instant espresso powder", "3/4 teaspoon baking powder", "<strong>For the Brownies</strong>", "5 ounces boiling water (about 1/2 cup plus 2 tablespoons; 140g)", "1/4 ounce vanilla extract (about 1 1/2 teaspoons; 7g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Mix:</strong> Combine powdered sugar, dark chocolate, all-purpose flour, Dutch cocoa powder, cocoa butter, soy milk powder, dry malt extract, salt, espresso powder, and baking powder in the bowl of a food processor. Grind until the chocolate disappears into a fine, powdery mix, and you can no longer hear any chunks bouncing around the bowl, about 2 minutes. The timing will vary significantly depending on the size, power, and capacity of the food processor. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the bowl of the processor to be sure no chunks of chocolate have lodged under the blade and continue processing until fine. It is important that this mix is as powdery and fine as flour, with absolutely no visible chunks of chocolate or cocoa butter. For immediate use, proceed directly to Step 3. Otherwise, transfer the mix to an airtight container and store at cool room temperature up to one year, or until the date stamped on the package of Dutch cocoa."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position, preheat to 350°F (180°C), and line an 8-inch-square anodized aluminum brownie pan with a long strip of parchment or foil to cover the bottom and two of the sides. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oven has come to temperature, prepare the batter in the bowl of a food processor or in a large mixing bowl with a flexible spatula. Either way, add the boiling water and vanilla extract; pulse or stir until well combined. The batter will be smooth and thin when made in a food processor and somewhat thicker when mixed by hand. These textural differences with not affect the batter's behavior."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Bake:</strong> Scrape the batter into the prepared pan, spread into an even layer, and bake until the brownies are glossy, puffed, and firm but a little squishy, about 35 minutes. The timing is based on the volume and conductivity of an 8-inch anodized aluminum pan; be aware the time needed will vary significantly with glass, ceramic, or nonstick pans. Allow the brownies to cool at least 15 minutes before slicing. To serve, gently tug on the foil or parchment and lift to remove the brownies from the pan. Cut into 16 2-inch squares. Store leftovers in an airtight container with a sheet of wax paper between each layer, about 1 week at room temperature."}]}