{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190307-spanish-migas-vicky-wasik-22.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Spanish", "keywords": ["bell pepper", "fried egg", "kale", "migas", "olive oil", "pimentón", "Spanish chorizo", "stale bread", "tapas"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Spanish-Style <em>Migas</em> With Chorizo, Peppers, and Kale", "link": "https://www.seriouseats.com/recipes/2019/03/spanish-style-migas-with-chorizo-peppers-and-kale.html", "description": "Take a page out of the Spanish shepherding culinary repertoire, and make a meal out of crispy breadcrumbs, chorizo, and hearty vegetable. Then top it off with crispy fried eggs.", "totalTime": "45 minutes", "recipeYield": "Serves 4 as an appetizer or 2 to 3 as a main course", "recipeCategory": ["Bread", "Breakfast and Brunch", "Father's Day", "Fried Eggs", "Garlic", "Kale", "Mains", "Mother's Day", "Pork", "Quick and Easy", "Quick Dinners", "Recipes", "Spanish", "Stovetop"], "recipeIngredient": ["1/4 cup (60ml) extra-virgin olive oil", "4 ounces (115g) pork belly, cut into 1-inch pieces", "Kosher salt", "4 garlic cloves, unpeeled and smashed ", "4 ounces (115g) Spanish dry-cured chorizo, preferably younger and more tender, sliced into rounds", "1 red bell pepper, stemmed, seeded, and cut into 3/4-inch pieces", "1 Anaheim pepper, stemmed, seeded, and cut into 3/4-inch pieces", "4 ounces (115g) lacinato kale (a.k.a. dinosaur, Tuscan, or black kale), tough stems removed, leaves cut into 1-inch pieces", "8 ounces (225g) stale, hearty bread, crusts removed and cut into 3/4-inch pieces (about 6 cups)", "1/4 cup (60ml) water", "1 teaspoon pimentón dulce (sweet smoked Spanish paprika, see note)", "2 tablespoons chopped fresh flat-leaf parsley leaves", "2 to 4 <a href=\"https://www.seriouseats.com/recipes/2016/06/crispy-fried-eggs-recipe.html\">crispy fried eggs</a> (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large cast iron skillet, combine olive oil, lightly salted pork belly, and garlic cloves and cook over medium heat, stirring occasionally, until fat has rendered and pork belly is crisp, about 8 minutes. Add chorizo and continue to cook until it's lightly browned and oil takes on a deep-orange hue, about 3 minutes. Using a slotted spoon, transfer pork belly, chorizo, and garlic to a medium bowl and set aside; discard garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium-high and heat until shimmering. Add bell and Anaheim peppers to skillet, season lightly with salt, and cook, stirring frequently, until pepper skins are lightly blistered and browned, about 3 minutes. Add kale to skillet, reduce heat to medium, and continue to cook, stirring frequently, until kale is slightly wilted and softened, about 3 minutes. Using a slotted spoon, transfer vegetables to bowl with pork belly and chorizo. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bread in an even layer to skillet, drizzle water over top, and cook, stirring frequently with metal spatula to evenly coat with oil mixture. Season with salt to taste, and continue to cook, stirring and breaking up bread into smaller pieces with spatula, while occasionally scraping bottom of the skillet to prevent bread from sticking and scorching. Continue to cook, stirring and scraping frequently, until mixture is broken down into small crumbs, 1- to 2-inch pieces, and bread is light golden brown and crisp but not hard, 15 to 20 minutes. If bread begins to get too dark, reduce heat to medium-low and sprinkle bread with additional water, 1 tablespoon at a time, as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, sprinkle migas with pimentón and stir until bread is evenly coated and mixture is aromatic, about 30 seconds. Add vegetable and chorizo mixture to skillet, stir to combine and season to taste with salt. Remove from heat. If serving with fried eggs, transfer migas to serving bowl and cover loosely with aluminum foil to keep warm. Wipe out skillet and <a href=\"https://www.seriouseats.com/recipes/2016/06/crispy-fried-eggs-recipe.html\">fry eggs</a>. Divide migas into individual bowls, sprinkle with parsley, and top with fried eggs. Serve immediately."}]}