{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190313-shio-ramen-vicky-wasik-33.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": ["chashu", "chashu pork", "Japanese", "meat", "pork", "pork shoulder", "ramen", "reverse sear"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Reverse-Seared Tied Pork Shoulder <i>Chashu</i>", "link": "https://www.seriouseats.com/recipes/2019/04/reverse-seared-pork-shoulder-chashu-recipe.html", "description": "Roasted pork shoulder <em>chashu</em> is a classic topping for ramen, and our tried-and-true reverse-sear method makes it easy to get the final temperature you want.", "totalTime": "52 hours", "recipeYield": "Makes at least 10 generous servings of thinly sliced pork topping for ramen", "recipeCategory": ["Japanese", "Pork", "Roasting"], "recipeIngredient": ["1/2 ounce (14g) kosher salt (see note)", "1/2 ounce (14g) granulated sugar (see note)", "1 pork shoulder roast (about 2 pounds; 900g)", "1 tablespoon (15ml) soy sauce", "1 tablespoon (15ml) mirin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine salt and sugar in a small bowl and mix thoroughly. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pork shoulder roast in a zip-top bag. Pour salt-sugar mixture into bag and massage mixture evenly into meat. Seal bag, trying to avoid leaving much air inside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bag in refrigerator for 24 hours. Roughly every 8 hours, massage bag and flip it over to ensure even distribution of the cure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open bag and add soy sauce and mirin. Seal bag and massage meat again to ensure even distribution of brine and marinade. Place in refrigerator for another 24 hours, massaging bag and flipping it roughly every 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to middle position and preheat oven to 200&deg;F (93&deg;C). Set a wire rack in a rimmed baking sheet large enough to comfortably accommodate the roast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove roast from bag and blot completely dry. Using kitchen twine, tie at 1/2-inch intervals to form a neat cylinder. Place roast on rack set in rimmed baking sheet. If using a probe thermometer, insert in center of roast. Place roast in oven and cook until internal temperature registers 145&deg;F (63&deg;C), or the temperature of your choosing, about 3 to 4 hours. Remove roast from oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Finishing Under the Broiler:</strong> Adjust oven rack so that the roast will be about 1 inch away from the broiler element. Preheat broiler to high. When broiler is hot, place roast, still on its rack in the rimmed baking sheet, under broiler, turning frequently, until exterior is charred, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>If Finishing With a Handheld Torch:</strong> Turn on torch and char exterior of roast on all sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The roast can immediately be sliced very thinly and served on top of ramen. Alternatively, the roast can be chilled before slicing, which facilitates slicing it thinly. To chill, allow roast to cool to room temperature, then wrap tightly in plastic and place in refrigerator for 6 hours or overnight. Or, seal the roast in a vacuum-sealed bag or in a zip-top bag using the <a href=\"https://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">water-displacement method</a>, then place sealed roast in an ice bath to rapidly chill. "}]}