{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/06/20190523-no-churn-blueberry-ice-cream-vicky-wasik-12.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["berry", "blueberry", "dessert", "frozen", "frozen dessert", "ice cream", "meringue", "no-churn", "swiss meringue"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "ratingCount": "2"}, "name": "Fruity No-Churn Ice Cream", "link": "https://www.seriouseats.com/recipes/2019/06/no-churn-fruit-ice-cream-recipe.html", "description": "While it may lack the romance of fresh-from-the-farmers-market produce, freeze-dried fruit is second to none for making a vibrantly colored, ultra-fruity no-churn ice cream.", "totalTime": "8 hours", "recipeYield": "About 1 quart", "recipeCategory": ["Blueberry", "Fruit Desserts", "Gluten-Free", "Ice Cream and Frozen Treats", "Stovetop", "Summer", "Valentine's Day"], "recipeIngredient": ["5 ounces egg white (about 2/3 cup; 140g)", "5 3/4 ounces sugar (about 3/4 cup; 165g)", "Heaping 1/4 teaspoon (1.5g) Diamond Crystal kosher salt, plus more to taste; for table salt, use about half as much by volume or the same weight", "Shy 1/2 teaspoon (2g) cream of tartar, or 3/8 ounce lemon juice (1 shy tablespoon; 11g)", "12 ounces heavy cream (about 1 1/2 cups; 340g)", "Up to 2 1/4 ounces freeze-dried blueberries, ground to a fine powder (60g; volume will vary by brand and type); for other fruits, see note", "1/8 teaspoon coriander, plus more to taste; for pairing suggestions for other fruits, see note ", "1/2 ounce complementary spirit, such as Smith & Cross Jamaica Rum or <i>limoncello</i> (about 1 tablespoon; 15g); for pairing suggestions for other fruits, see note"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with a few inches of water. Bring to a boil, then lower heat to maintain a simmer for a steady supply of steam. Crumple a long strip of foil into a thick ring and place ring into the water; this will act as a \"booster seat\" later in the process to keep the bowl from touching the water or the pot directly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine egg whites, sugar, salt, and cream of tartar or lemon juice in the bowl of a stand mixer. Place stand mixer bowl over the water bath so it sits on the foil ring; the bowl should not touch the water or the bottom or sides of the pot. Cook, stirring and scraping continuously with a flexible spatula, until egg white mixture reaches 165°F (74°C). This should take no more than 5 minutes in a stainless steel stand mixer bowl; if it takes substantially longer, this simply means the heat is too low. If the mixture cooks too fast, or scrambles despite constant stirring, this indicates that the water has come to a boil or that the water or pot is able to touch the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mixture reaches 165°F (74°C), transfer bowl to a stand mixer fitted with a whisk attachment and whip at high speed until meringue is glossy, stiff, and thick, about 5 minutes, although the time this takes will vary depending on the power of a given stand mixer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once meringue is thick and stiff, whip heavy cream, freeze-dried blueberries, coriander, and rum or limoncello (or other fruit/spice/spirit combo) until this mixture is thick and stiff as well. This can be done by hand in a separate bowl, or on a stand mixer in the original stand mixer bowl if the meringue is transferred to another container (no need to wash the bowl or whisk attachment between uses). For the purposes of making ice cream, this step cannot be done in a food processor or blender, which will not provide adequate aeration. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an open <a href=\"https://www.seriouseats.com/2017/07/how-to-know-which-whisk-to-use.html\">balloon whisk</a> or flexible spatula, gently combine whipped cream and meringue, working carefully but thoroughly to ensure the mixture is well combined but not deflated. Taste and season with additional salt and/or spice as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape ice cream into a large nonreactive container, such as a 2-quart baking dish, and cover with a layer of plastic wrap pressed directly against the surface of the ice cream. To protect the ice cream from freezer odors, cover again with a sheet of foil, or a lid if the container has one. Freeze until firm enough to scoop. The freezing time required will vary depending on the size and material of the container, but expect this to take between 6 and 8 hours. Once the ice cream is cold, scoop and serve in chilled dishes."}]}