{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/06/20190524-pistachio-oil-cake-vicky-wasik-4-1.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "chantilly", "dessert", "pistachio", "whipped cream"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Homemade Pistachio Cream", "link": "https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-cream.html", "description": "This smooth, pale green chantilly starts with homemade pistachio paste, whipped with cream. Rather than traditional mixing methods that use a whisk or stand mixer to aerate the cream, this recipe relies on an immersion blender or food processor to limit aeration. This makes for an especially creamy, thick, and stable whipped cream that can be held for up to a week in the fridge. It's the perfect topping for ice cream sundaes, fresh fruit tarts, pancakes, and French toast, or try it dolloped over a slice of <a href=\"https://www.seriouseats.com/recipes/2019/07/pistachio-cake.html\">pistachio cake</a>!", "totalTime": "5 minutes", "recipeYield": "About 2 cups", "recipeCategory": ["Breakfast and Brunch", "Desserts", "Gluten-Free", "No-Cook", "Nuts"], "recipeIngredient": ["4 1/2 ounces <a href=\"https://www.seriouseats.com/recipes/2019/07/homemade-pistachio-paste.html\">Homemade Pistachio Paste</a> (about 1/2 cup; 127g), chilled to about 40°F (4°C)", "12 ounces heavy cream (about 1 1/2 cups; 340g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pistachio paste and cream into a measuring cup, blending container, or jar just large enough to accommodate the head of an immersion blender. If the container is too large, the cream layer will not be deep enough for proper blending. If the container is too small, the blades will not reach the paste at the bottom of the jar. Alternatively, the ingredients can be placed in the bowl of a food processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Process until the mixture is creamy and thick, like a frosting; the time can vary substantially depending on the equipment itself, so closely monitor the texture and body of the cream to find the ideal timing for your equipment. Use immediately, as a topping for cake, ice cream, or fresh fruit tarts, or transfer to an airtight container and refrigerate for up to 1 week."}]}