{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/10/20191003-french-onion-tarte-tatin-vicky-wasik-2-4.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "French", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "5"}, "name": "French Onion Soup Tarte Tatin", "link": "https://www.seriouseats.com/recipes/2019/10/french-onion-soup-tarte-tatin.html", "description": "For a more savory take on tarte Tatin, turn to the hearty classic bistro soup, and caramelize onions instead of apples. ", "totalTime": "2 hours", "recipeYield": "Serves 8 to 10 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Baking", "Christmas", "Fall", "French", "Onion", "Pies, Tarts, and Crumbles", "Recipes", "Thanksgiving", "Winter"], "recipeIngredient": ["1/2 batch <a href=\"https://www.seriouseats.com/recipes/2016/06/old-fashioned-flaky-pie-dough-recipe.html\">Old-Fashioned Flaky Pie Dough</a> or 1 sheet frozen puff pastry, thawed", "3 medium yellow onions (about 1 1/2 pounds; 680g) (see note)", "4 tablespoons (2 ounces; 56g) unsalted butter, softened, divided", "Kosher salt and freshly ground black pepper", "1 tablespoon (15ml) dry sherry (such as Amontillado)", "3/4 cup (180ml) homemade <a href=\"https://www.seriouseats.com/recipes/2018/11/pressure-cooker-beef-stock-2.html\">chicken</a> or <a href=\"https://www.seriouseats.com/recipes/2018/11/pressure-cooker-beef-stock.html\">beef</a> stock, or store-bought, low-sodium chicken stock", "1/4 teaspoon Asian fish sauce (optional)", "1/4 teaspoon cider vinegar", "1/2 teaspoon (2g) chopped fresh thyme leaves", "1 tablespoon (15g) sugar", "2 ounces (56g) Gruyère cheese, grated", "2 tablespoons (30ml) Dijon mustard (optional)", "Freshly sliced chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>If using pie dough:</strong> Prepare Old-Fashioned Flaky Pie Dough according to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a 10-inch round. Transfer to a large, flat plate lined with parchment, or another similar arrangement. Working around circumference, fold 1/2 inch of dough over itself and pinch to create 9-inch round with raised rim. Cut three 2-inch slits in center of dough, and refrigerate for at least 2 hours or up to 24. (If refrigerating overnight, cover dough with plastic.)</p>\r\n<p><strong>If using puff pastry:</strong> Roll puff pastry out so that you are able to cut a 10-inch round (you can use an inverted 10-inch skillet as a guide for cutting the round). Transfer to a large, flat plate lined with parchment, or another similar arrangement. Working around circumference, fold 1/2 inch of dough over itself and pinch to create 9-inch round with raised rim. Poke the pastry all over with a fork, and refrigerate until ready to use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to middle position and preheat to 400&deg;F (204&deg;C). Using a sharp knife, trim stem end of onions and halve onions from root end to stem end; peel and discard skin. For two of the onions, trim away the scraggly end of the root, while keeping the light-colored part intact, then cut each half into 4 wedges through the root end to keep wedges intact (giving you 16 wedges total). Set wedges aside. Thinly slice remaining onion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart saucier or small skillet, melt 1 tablespoon (15g) butter over medium-high heat until foaming. Add sliced onion, season lightly with salt and pepper, and cook, stirring frequently, until softened, about 5 minutes. Continue to cook, stirring frequently and adding 1 to 2 tablespoons of water at a time when onions begin to stick and threaten to scorch, until onions are very sweet and a rich golden-brown color, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sherry, and scrape up any brown bits from the bottom and sides of the saucier. Add stock, bring to a simmer, and cook at a steady simmer until onions are jammy, and liquid has thickened and reduced to just coat the onions, 5 to 7 minutes. Stir in fish sauce (if using), vinegar, and thyme. Remove from heat, and set aside to cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, smear butter over bottom of 10-inch oven-safe skillet, sprinkle sugar in even layer over butter, and season lightly with salt and pepper. Arrange onion wedges in a tight circular pattern around edge of skillet, with root ends pointed inward toward center of skillet, making sure wedges are in even contact with skillet. Tuck remaining onion wedges into center of skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place skillet over high heat, and cook, without stirring, until onions have softened slightly and butter-sugar mixture has turned a dark amber color, 8 to 10 minutes. (Rotate skillet over burner as necessary to encourage even browning.) Reduce heat to medium, spoon caramelized onions into empty spaces between the onion wedges, and continue to cook for 1 minute longer. Turn off heat, and sprinkle Gruyère evenly over onions. Spread mustard evenly over prepared dough or pastry (if using), and carefully place round over onions (mustard-side down), making sure it is centered and not touching the sides of the skillet. Bake until crust is deep golden brown, 30 to 35 minutes. Transfer skillet to wire rack set in rimmed baking sheet and let cool for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large plate over the skillet, carefully invert tart onto plate, then slide tart onto wire rack. Rearrange any onions pieces that may have shifted during unmolding, and let tart cool for 30 minutes. Cut into wedges, sprinkle with chives, and serve. "}]}