{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/02/TATES.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "American", "keywords": ["chocolate chip", "chocolate chip cookies", "dessert", "food processor"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.2222222222222", "ratingCount": "9"}, "name": "Tate's-Style Thin and Crispy Chocolate Chip Cookies", "link": "https://www.seriouseats.com/recipes/2019/02/thin-and-crispy-chocolate-chip-cookies.html", "description": "These thin and crispy chocolate chip cookies have a big, butterscotchy flavor and an earth-shattering crunch. A blend of raw cane sugar and light brown sugar give them a bold flavor and golden brown color, studded through with chocolate morsels. Their slim profile and delicate texture come from using a food processor to combine the dry ingredients with cold butter, for a uniquely textured dough.", "totalTime": "2 hours", "recipeYield": "about 56 3 1/2-inch cookies", "recipeCategory": ["American", "Baking", "Chocolate", "Cookies", "Quick and Easy"], "recipeIngredient": ["8 ounces low protein all-purpose flour, such as Gold Medal blue label or Whole Foods 365 blue label (about 1 3/4 cup, spooned; 225g)", "8 ounces light brown sugar, not dark brown (about 1 cup, firmly packed; 225g)", "3 1/2 ounces raw cane sugar, not white (about 1/2 cup; 100g)", "2 teaspoons (8g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1 1/2 teaspoons (8g) baking soda", "8 ounces cold, unsalted butter, cut into 1-inch chunks (about 16 tablespoons; 225g)", "8 ounces assorted chocolate chips, preferably no darker than 70%, see note (about 1 1/3 cups; 225g)", "1 large egg, straight from the fridge, well beaten (1 3/4 ounces; 50g)", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to middle position and preheat oven to 350°F (180°C). In the bowl of a food processor, combine flour, light brown sugar, raw cane sugar, salt, and baking soda. Process until well-combined; add cold butter and pulse to form a dry and powdery mix; comparable results cannot be produced by hand or with a stand mixer. Add chocolate chips and pulse once or twice to combine. This mixture can be refrigerated up to one week in an airtight container or used immediately in the next step."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cookie \"mix\" to a large bowl; add egg and vanilla, stir well; the mixture will seem alarmingly crumbly and dry at this stage. Once the wet ingredients have been absorbed, knead mixture by hand until it comes together like classic dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide into about 56 portions with a 1-tablespoon scoop. If you like, these can be transferred to a zipper-lock bag and refrigerated for up to 1 week or frozen for up to 3 months; soften to about 68°F (20°C) before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange portions on a parchment-lined half-sheet pan (do not use a silicone mat), leaving about 2 or 3 inches between cookies to account for spread. Bake until thin and golden brown, with an even color from edge to center, about 16 minutes. Cool cookies directly on the baking sheet until room temperature. Transfer to an airtight container and continue cooling an hour more; the cookies will not be fully crisped until then. At cool room temperature, the cookies will keep at least six weeks in an airtight container."}]}