{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/08/20190708-almond-cake-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "birthday", "BraveTart", "cake", "layer cake", "party", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.8333333333333", "ratingCount": "12"}, "name": "Fluffy and Nutty Almond Layer Cake", "link": "https://www.seriouseats.com/recipes/2019/10/fluffy-and-nutty-almond-layer-cake.html", "description": "This recipe uses a blend of almond and all-purpose flour to strike a balance between a fluffy American cake and a hearty European torte, for a dessert that's tender, moist, and light, but also hearty. Reach for the best quality almond extract, made from bitter almond oil, to flavor the cake, and add a splash of rose water to bring out its floral noes. The subtle sweetness and caramel notes of toasted sugar add complexity and enhance the nuttiness of almond, but plain white sugar will work in a pinch. ", "totalTime": "3 hours", "recipeYield": "Makes one 8-inch, three-layer cake", "recipeCategory": ["Baking", "Cakes", "Christmas", "Desserts", "Mother's Day", "Pastry", "Valentine's Day"], "recipeIngredient": ["<strong>For the Cake:</strong>", "11 1/4 ounces all-purpose flour (about 2 1/2 cups, spooned; 320g)", "6 ounces almond flour, see note (about 1 3/4 cup; 170g)", "15 ounces plain or <a href=\"https://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">lightly toasted</a> sugar (about 2 cups plus 1 tablespoon; 425g)", "4 teaspoons baking powder", "2 teaspoons (8g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "8 ounces unsalted butter (16 tablespoons; 225g), soft but cool, about 60°F (16°C)", "3 large eggs, brought to about 65°F (18°C)", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "1/2 ounce pure almond extract (about 1 tablespoon; 15g), more or less to taste", "1/4 ounce rose water, optional (about 1 1/2 teaspoons; 7g)", "15 ounces whole milk (about 2 cups minus 2 tablespoons; 425g), brought to about 65°F (18°C)", "<strong>To Finish:</strong>", "1 recipe <a href=\"https://www.seriouseats.com/recipes/2018/02/chocolate-swiss-buttercream.html\">Chocolate Swiss Buttercream</a> or a double batch of <a href=\"https://www.seriouseats.com/recipes/2019/07/chocolate-american-buttercream-recipe.html\">American-Style Chocolate Buttercream</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). Lightly grease three 8-inch anodized aluminum cake pans and line with parchment (explanation and tutorial <a href=\"http://www.seriouseats.com/2017/06/how-to-cut-a-parchment-round.html\">here</a>). If you don’t have three pans, it’s okay to bake the cakes in stages; the batter will keep at room temperature until needed. Sift the all-purpose flour and almond flour together in a bowl, then whisk thoroughly to combine, at least 1 minute. Under-mixing the flours can produce a cake with a splotchy crust and uneven crumb.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Cake:</strong> In the bowl of a stand mixer fitted with the paddle attachment, combine sugar, baking powder, salt, and butter. Mix on low speed to roughly incorporate, increase speed to medium. Beat until fluffy, pale, and light, about 8 minutes. About halfway through, pause to scrape the bowl and beater with a flexible spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With the mixer still running, add the eggs one at a time, letting each fully incorporate before adding the next, followed by the vanilla extract, almond extract, and rose water (if using). Reduce speed to low and sprinkle in about 1/3 of the prepared almond-flour, then drizzle in 1/3 of the milk. Repeat with remaining flour and milk, working in thirds as before.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape the bowl and beater with a flexible spatula, and resume mixing on medium speed for about 3 seconds to ensure everything is well combined. The batter should look creamy and thick, registering between 65 and 68&deg;F (18 and 20&deg;C) on a digital thermometer. (Significant deviation indicates ingredients were too warm or too cold, which can lead to textural problems with the cake.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold batter once or twice from the bottom up with a flexible spatula, then divide evenly between prepared cake pans (about 20 ounces/565g per pan). Stagger pans together on the oven rack, and bake until puffed, firm, and beginning to brown around the edges, but relatively pale over all, about 35 minutes. If your oven has very uneven heat, pause to rotate the pans after about 20 minutes. Alternatively, bake two layers at once and finish the third when they’re done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool cakes directly in their pans for 1 hour, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off the parchment, and return cakes right-side-up (covered in plastic, the cakes can be left at room temperature for a few hours). Prepare your frosting of choice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Crumb Coat:</strong> Level cakes with a serrated knife (full directions <a href=\"http://www.seriouseats.com/2017/05/how-to-level-a-cake.html\">here</a>) and set the scraps aside for snacking. Place one layer on a heavy cast iron turntable. If you like, a waxed cardboard cake round can first be placed underneath, secured to the turntable with a scrap of damp paper towel. Top with exactly 1 cup buttercream, using an offset spatula to spread it evenly from edge to edge. Repeat with the second and third layers, then cover the sides of the cake with another cup of buttercream, spreading it as smoothly as you can (tutorial <a href=\"http://www.seriouseats.com/2017/05/how-to-crumb-coat-cake.html\">here</a>). Refrigerate cake until the buttercream hardens, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Finish:</strong> Rewhip remaining buttercream to restore its creamy consistency, then use to finish and decorate the chilled cake as desired. If you like, garnish with toasted, sliced or slivered almonds. To serve, bring cake to an internal temperature no cooler than 70&deg;F (21&deg;C) and cut into portions with a chef’s knife, wiping or rinsing the blade clean between each slice. Cover the exposed edges with leftover buttercream to keep the remaining cake moist. Under a cake dome, the cake will keep for 3 days at cool room temperature. </p>"}]}