{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/01/20181220-wheat-bread-loaf-vicky-wasik-step3.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["eggless", "food processor", "instant yeast", "loaf", "whole wheat"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6875", "ratingCount": "16"}, "name": "100% Whole Wheat Sandwich Bread", "link": "https://www.seriouseats.com/recipes/2019/01/100-whole-wheat-sandwich-bread.html", "description": "With a little patience and the help of a food processor, it's possible for 100% whole wheat bread to bake up as fluffy, light, and chewy as a classic white loaf, but with all the nuttiness, flavor, and virtue of whole grains. The key is patience and power, with an autolyse to hydrate the flour before kneading in a food processor. This powerful tool makes short work of the dough, allowing for rapid and intensive gluten development in 75 seconds flat.", "totalTime": "About 8 hours", "recipeYield": "One 8-inch loaf", "recipeCategory": ["Baking", "Breakfast and Brunch", "Dairy-Free", "Sandwiches", "Vegan", "Yeast Bread"], "recipeIngredient": ["15 ounces whole wheat flour, such as <dorado id=\"100-stone-ground-whole-wheat-flour\" class=\"text\">Bob's Red Mill</dorado> (about 3 1/3 cups, spooned; 425g), plus more for dusting", "11 1/4 ounces cool water, about 65°F/18°C  (about 1 1/2 cups minus 4 1/2 teaspoons; 320g)", "1 3/4 ounces dark or light brown sugar (about a shy 1/4 cup; 50g)", "3/8 ounce (2 3/4 teaspoons; 11g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 ounces instant dry yeast, such as <dorado id=\"instant-yeast\" class=\"text\">SAF</dorado> (1 packet or 2 rounded teaspoons;  7g); not RapidRise or active dry (more info <a href=\"https://www.seriouseats.com/2018/03/all-about-dry-yeast-instant-active-dry-fast-acting-and-more.html\">here</a>)", "2 ounces cool water, about 65°F/18°C (about 1/4 cup; 55g)", "1 ounce neutral oil, such as safflower, or a nutty, flavorful oil, such as hazelnut or roasted pumpkin seed (about 2 heaping tablespoons; 28g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Autolyse:</strong> In large bowl, combine whole wheat flour with first addition of water. Stir until water is absorbed; then knead briefly against the sides of the bowl until no floury bits remain. Cover and set aside for 2 hours 30 minutes to hydrate flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Dough:</strong> Transfer hydrated dough to a 14-cup food processor fitted with the regular metal blade (not the dough blade), along with brown sugar, salt, and instant dry yeast. Process until dough is silky smooth, and a small piece can be stretched into a thin sheet without tearing, about 75 seconds. The exact timing will vary with the power and capacity of a given machine. For smaller machines, the reduced capacity and power will necessitate dividing dough in half to process in stages."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once gluten is well developed, drizzle in the remaining water and oil while the processor is running, and continue mixing only until smooth. At this stage, the dough will feel sticky, wet, and elastic.\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>First Rise:</strong> Transfer dough to large, lightly greased bowl (it's fine to reuse bowl from autolyse, no need to wash). Cover and proof until puffy, light, and roughly doubled in bulk, about 2 hours at 70&deg;F (21&deg;C). In a chilly kitchen, the dough will need more time to rise, and in a warmer kitchen, it will move faster."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Shaping the Loaf:</strong> Turn soft dough out onto clean surface lightly dusted with whole wheat flour. Pat dough into 7-inch square, and form into tight log, sealing dough together with heel of your hand. Nestle into lightly greased 1-pound loaf pan, seam side down; cover loosely as before."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Second Rise: </strong>Let dough proof until puffy, light, and risen about 2 1/2 inches above rim of pan at very center. To test dough, poke it gently with a flour-dusted fingertip; when dough is ready, it will retain a shallow impression that springs back after a minute. If dough is firm and springs back right away, continue proofing until dough retains a shallow impression. This will take about 75 minutes at around 70&deg;F (21&deg;C). Again, timing of the process will vary based on environmental conditions. Near the end of this period, adjust oven rack to lower-middle position and preheat oven to 350°F (177°C). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Baking the Loaf:</strong> After the second rise, uncover dough and bake until well risen, golden brown, and hollow sounding when thumped; about 45 minutes, or to an internal temperature of approximately 200°F (93°C). Immediately turn loaf out onto a wire rack, and cool completely before slicing, at least 90 minutes. Slice with a sharp serrated knife. The loaf will keep up to a week at room temperature in a bread box or paper bag."}]}