{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/04/20190416-pork-shoulder-vicky-wasik-68.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Thai", "keywords": ["pork shoulder", "thai"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Thai-Inspired Slow-Roasted Pork Shoulder Feast", "link": "https://www.seriouseats.com/recipes/2019/05/thai-inspired-slow-roasted-pork-shoulder-feast.html", "description": "For a fresh take at your next pig-out, keep the pork prep simple, and elevate your fixings game with traditional Thai ingredients and garnishes.", "totalTime": "9 hours, plus up to 32 hours resting time (see note)", "recipeYield": "Serves 8 to 10", "recipeCategory": ["Father's Day", "Mains", "Pork", "Recipes", "Thai"], "recipeIngredient": ["<strong>For the Pork Shoulder:</strong>", "2 tablespoons (18g) kosher salt", "1 tablespoon (12g) sugar", "2 teaspoons (7g) baking powder", "1 (8- to 10-pound; 3.5 to 4.5 kg) bone-in, skin-on pork shoulder (see note)", "<strong>For Serving:</strong>", "2 heads lettuce, such as red leaf, bibb, or romaine, leaves separated", "Fresh Thai herbs, such as cilantro, Thai basil, mint, and culantro (see note), for garnish", "1 1/2 cups (100g)  <a href=\"https://www.seriouseats.com/recipes/2013/02/thai-style-fried-shallots.html\">Thai-style fried shallots</a>", "1 recipe <a href=\"https://www.seriouseats.com/recipes/2019/05/thai-sticky-rice-khao-niao.html\">Thai sticky rice</a>", "1 recipe <a href=\"https://www.seriouseats.com/recipes/2019/05/thai-dried-chili-vinegar-dipping-sauce.html\">Thai dried chili-vinegar dipping sauce</a>", "Thai toasted-rice powder, <a href=\"https://www.seriouseats.com/recipes/2019/05/toasted-rice-powder-recipe.html\">homemade</a> or store-bought, for garnish", "Fresh Thai chilies, thinly sliced (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>The Day Before Roasting, For the Pork:</strong> In a small bowl, whisk together salt, sugar, and baking powder. Set aside. Using a sharp knife, score pork skin in a crosshatch pattern, with scores spaced 3/4 inch apart. Flip pork shoulder over, skin side down, and repeat crosshatch pattern on flesh side. Pat pork shoulder dry with paper towels, then sprinkle all over with salt mixture. Use your hands to rub salt mixture all over the shoulder. Transfer pork shoulder, skin-side up, to a wire rack set in a foil-lined rimmed baking sheet, then refrigerate, uncovered, at least overnight and up to 2 nights. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>When Ready to Cook:</strong> Adjust oven rack to center position and preheat oven to 250&deg;F (121&deg;C). Place baking sheet with rack and pork shoulder in oven and roast until until pork shows almost no resistance when a metal skewer or knife is inserted into it, about 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pork from oven and tent with foil. Increase oven to 500&deg;F (260&deg;C) and allow to preheat. Let pork rest at room temperature for at least 15 minutes and up to 45 minutes. Return pork to the oven and roast until skin is blistered and puffed, rotating every 5 minutes, about 20 minutes total. Remove from oven and rest, uncovered, for an additional 15 minutes. Transfer to a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For Serving:</strong> Bring the pork shoulder to the table, and use a pair of tongs and a meat fork to break skin into bite-size pieces and pull meat apart. Serve right away with accompanying garnishes."}]}