{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/09/20190718-sous-vide-octopus-liz-clayman-LIZ_4589.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["octopus"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Perfectly Tender Sous Vide Octopus", "link": "https://www.seriouseats.com/recipes/2019/09/perfectly-tender-sous-vide-octopus.html", "description": "Sous vide octopus is easy and yields some of the best results our of all the methods we've tried. This recipe uses our preferred combination of temperature and time.", "totalTime": "6 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Other Seafood", "Sous Vide"], "recipeIngredient": ["1 (2 1/2-pound; 1kg) whole octopus, rinsed well (including inside head cavity); see note"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a sous vide cooker to 175&deg;F (79&deg;C). If you want to guarantee a good shape for the octopus tentacles (this is optional, but visually nice), bring a large pot of water to a boil over high heat. Using tongs, dip the octopus into the water just until the tentacles hold a more rigid and graceful curl, not more than 30 seconds. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If necessary, using a sharp knife or good kitchen shears, divide the octopus into manageable portions that can be bagged more easily (small octopuses can be kept whole). You can choose how to do this: separate the tentacles individually, or keep them in clusters of 2 or 4. If you do decide to break down the octopus, remove the hard beak that sits at the point where the tentacles converge in the body, as well as the small eyes just below the pouch-like head. Make sure to bag and cook the head pouch as well; it's not as delicious as the tentacles, but it's still good."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place octopus pieces in zipper-lock or vacuum bags and seal using the vacuum sealer or the <a href=\"https://www.seriouseats.com/2016/08/how-to-seal-food-airtight-without-vacuum-sealer-water-displacement-method.html\">displacement method</a>."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Submerge in water and cook for 5 hours. Remove bags, chill rapidly in an ice-water bath, then refrigerate until ready to use. (Chilling helps set the skin so it doesn't fall off later, so it's good to do even if you're planning to serve the octopus warm.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Serve Cold:</strong> Cut tentacles and head into pieces and add to a seafood salad or ceviche.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Sear:</strong> Heat a tablespoon or two of vegetable oil in a skillet over high heat until shimmering. Add octopus pieces and cook until well browned and crisp, about 3 minutes. Turn and brown on other side, about 3 minutes longer. Season with salt and serve as desired.</p>"}]}