{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/05/broccoligalette.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "", "keywords": ["broccoli", "cheese", "galette", "pie", "vegetable"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Broccoli and Cheese Galette", "link": "https://www.seriouseats.com/recipes/2019/05/savory-broccoli-and-cheese-galette.html", "description": "Inspired by the childhood classic of broccoli with cheese, this savory free-form pie is loaded with sautéed broccoli and onions tossed in a rich and creamy cheese sauce.", "totalTime": "3 hours", "recipeYield": "Serves 4 to 8", "recipeCategory": ["Breakfast and Brunch", "Broccoli", "Cheese"], "recipeIngredient": ["1/2 batch <a href=\"https://www.seriouseats.com/recipes/2016/06/old-fashioned-flaky-pie-dough-recipe.html\">Old-Fashioned Flaky Pie Dough</a>", "5 tablespoons (75ml) extra-virgin olive oil, divided", "1 pound (450g) broccoli, cut into small florets with stalk slivers attached", "1 medium (8-ounce, 225g) yellow onion, thinly sliced", "Kosher salt", "1 1/2 tablespoons unsalted butter", "1 1/2 tablespoons all-purpose flour", "1 cup (235ml) whole milk", "6 ounces (170g) grated Gruyère cheese, divided", "1 large egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare Old-Fashioned Flaky Pie Dough according to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a 14-inch round. Transfer to a parchment-lined aluminum rimmed baking sheet, cover with plastic, and refrigerate to relax and chill dough, at least 2 hours or up to 24."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan, heat 3 tablespoons (45ml) olive oil over medium-high heat until shimmering. Add broccoli and cook, stirring occasionally, until broccoli is crisp tender and lightly browned in spots, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion along with the remaining 2 tablespoons (30ml) olive oil, season with salt, and cook, stirring, for 1 minute. Lower heat to to medium-low and continue to cook, stirring occasionally, until broccoli and onions are tender, about 8 minutes longer. Add 3 tablespoons (45ml) water to pan and, using a spoon, scrape up any browned bits. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small saucepan, heat butter with flour over medium-high heat, until butter has melted and formed a paste with flour. Continue to cook, stirring, until raw flour scent is gone, about 1 minute. Whisk in milk until smooth and cook, whisking to prevent lumps, until sauce comes to a simmer and begins to thicken slightly. Lower heat to low and cook, stirring, until sauce is thick enough to coat back of a wooden spoon, about 3 minutes. Whisk in 4 ounces (115g) cheese until smooth, moving saucepan on and off heat to keep it hot enough to melt cheese but not so hot that it bubbles rapidly. Season Mornay sauce with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the Mornay sauce into the broccoli and stir to combine. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to lower-middle position and preheat to 400&deg;F. Spread broccoli mixture on prepared dough round, leaving about a 2-inch border of dough all around. With a sharp knife, cut a series of slits in the border of dough, each running from filling to edge of dough, spacing them about 5 inches apart. Fold each segment of dough over filling, tugging gently so the edge of each segment tightly overlaps the one that came before. Chill galette for 10 minutes in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush egg over chilled dough in a thin, even layer (including under each flap). This will give the crust a glossy, golden sheen and help bind the pieces together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake galette for 20 minutes. Sprinkle remaining 2 ounces (55g) cheese all over the pastry, then continue cooking until galette is golden brown around the edges and bubbling in the center, about 20 minutes longer. Let cool 5 minutes, then slice into wedges and serve warm."}]}