{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190226-freeze-dried-fruit-buttercream-banana-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["buttercream", "Italian", "Italian meringue", "maple", "meringue", "syrup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Creamy Banana Frosting (Italian Buttercream)", "link": "https://www.seriouseats.com/recipes/2019/03/creamy-banana-frosting-recipe.html", "description": "Freeze-dried bananas make this creamy frosting light and flavorful, without the dark color or pulpy consistency that can develop with fresh banana puree. Try it with a base of maple or honey to deepen the banana, or keep the flavor neutral with corn syrup instead.", "totalTime": "50 minutes", "recipeYield": "Makes about 4 1/4 cups", "recipeCategory": ["Cakes", "Frosting", "Fruit", "Gluten-Free", "Stovetop"], "recipeIngredient": ["12 ounces golden syrup, honey, or corn syrup (about 1 cup; 340g), or 14 ounces maple syrup (about 1 1/4 cups; 395g) ", "6 ounces egg white (from about 5 large eggs; 170g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "12 ounces unsalted butter (1 1/2 cups; 340g), softened to 65°F (18°C)", "1/4 ounce <a href=\"https://www.seriouseats.com/2017/12/how-to-choose-the-best-vanilla-extract.html\">vanilla extract</a> (about 1 1/2 teaspoons; 7g)", "1/8 teaspoon ground cloves", "Up to 2 1/2 ounces freeze-dried banana slices (volume will vary; 70g)", "Up to 1 ounce rum, or other flavorful liquid (about 2 tablespoons; 30g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart stainless steel saucier, bring the syrup to a boil over high heat. This should take no more than 4 or 5 minutes. If the timing is substantially different, this is simply an indication the heat needs adjustment due to equipment variation or differences in water content among potential syrups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the syrup begins to boil, reduce heat to medium and continue cooking until syrup reaches 230&deg;F (110&deg;C) on a clip-on digital thermometer, about 3 to 4 minutes longer. Meanwhile, add egg whites to the bowl of a stand mixer fitted with a whisk attachment and begin whipping on medium-high speed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue cooking the syrup until it reaches between 240 and 250&deg;F (116 and 121&deg;C), about 2 to 3 minutes longer, adjusting heat as needed and using a heat-resistant spatula to knock back foam. When the syrup comes to temperature, remove from heat and pour into the bowl of egg whites in a steady stream, with the mixer still running. Take care that the syrup drizzles down the side of the bowl, so it does not come in contact with the moving whisk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once all of the syrup has been added, continue whipping the meringue until incredibly thick and glossy and cooled to approximately 85 to 90&deg;F (29 to 32&deg;C), about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt, followed by butter in roughly 2-tablespoon increments, waiting only a few seconds after each one before adding the next. As the butter is added, the meringue will begin to deflate dramatically; this is normal. When all the butter has been added, reduce speed to medium-low and add vanilla and cloves. Then shut off the mixer and scrape the bowl and beater with a flexible spatula. Re-whip a few seconds more; if problems arise, consult the troubleshooting guide below. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Troubleshooting:</strong> The ideal working temperature of Italian buttercream is approximately 70&deg;F (21&deg;C). At this temperature, it should be creamy, smooth, and light and should weigh about 6 ounces (170g) per cup. If too cold, it will be denser, potentially with a greasy, curdled, or wet texture. If too warm, it may be too soft, runny, or soupy for use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If buttercream is a few degrees too warm, it can be refrigerated for 10 minutes or chilled in an ice bath for a few minutes to cool. If buttercream is too cold, it can be placed over a steaming water bath or open flame for a few seconds, just until you see the edges melting slightly; alternatively, remove 1/2 cup buttercream, melt it completely, then add it back."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In either case, after warming or cooling to adjust the temperature, re-whip the buttercream for at least 3 minutes on medium-high speed before reevaluating, as it takes time for the temperature to homogenize from edge to center. The texture and consistency can continue to be adjusted as needed until the buttercream is light, fluffy, and easy to spread, with no hint of soupiness, melt, stiffness, or curdling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the buttercream's texture has been properly adjusted, grind the freeze-dried bananas in a food processor until powdery and fine. Add this powder to the frosting, and re-whip until well combined. Reduce speed to low and drizzle in the rum. Scrape the bowl and whisk attachment; whip a minute more to ensure no unmixed trace of banana powder remains. Use immediately or transfer to an airtight container and refrigerate until needed, up to 1 week. The flavor will intensify slightly over the course of 24 hours. Thaw chilled buttercream to about 70&deg;F (21&deg;C), and re-whip before use."}]}