{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/06/20190521-chocolate-hazelnut-rolls-vicky-wasik-16.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["hazelnut", "instant yeast", "nutella"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6666666666667", "ratingCount": "3"}, "name": "Overnight Chocolate-Hazelnut Breakfast Buns", "link": "https://www.seriouseats.com/recipes/2019/10/homemade-nutella-breakfast-buns-recipe.html", "description": "If you've tried our <a href=\"https://www.seriouseats.com/recipes/2017/12/bravetart-homemade-cinnamon-rolls-recipe.html\">overnight cinnamon rolls</a>, the dough for these breakfast buns will be familiar. But the experience itself will be all new, thanks to a filling of <a href=\"https://www.seriouseats.com/2019/05/how-to-make-nutella-chocolate-hazelnut-spread.html\">homemade Nutella</a>, made from dark chocolate and caramelized hazelnuts, and a whipped-mascarpone frosting. ", "totalTime": "14 hours", "recipeYield": "Makes 12 (3 1/2–inch) buns", "recipeCategory": ["Baking", "Bread", "Breakfast and Brunch", "Breakfast Sweets", "Chocolate", "Pastry"], "recipeIngredient": ["<strong>For the Dough:</strong>", "16 ounces all-purpose flour, such as Gold Medal (about 3 1/2 cups, spooned; 450g), plus more for rolling", "3 1/2 ounces sugar (about 1/2 cup; 100g)", "2 teaspoons instant yeast, such as SAF (not rapid-rise; see note)", "2 teaspoons (8g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon baking soda", "4 ounces unsalted butter (8 tablespoons; 115g)", "4 ounces milk (8 tablespoons; 115g), any percentage will do", "8 ounces plain, unsweetened, strained Greek yogurt (about 1 cup; 225g), such as Fage (see note)", "<strong>For the Filling:</strong>", "12 ounces <a href=\"https://www.seriouseats.com/2019/05/how-to-make-nutella-chocolate-hazelnut-spread.html\">homemade Nutella</a> (about 1 1/3 cups; 340g), <a href=\"https://www.seriouseats.com/recipes/2019/05/homemade-nutella.html\">creamy</a> or <a href=\"https://www.seriouseats.com/recipes/2019/05/crunchy-homemade-nutella.html\">crunchy</a> (see note)", "4 ounces skinned toasted hazelnuts, roughly chopped (a shy cup; 115g), or more to taste", "<strong>For the Frosting:</strong>", "4 ounces mascarpone (about 1/2 cup; 115g)", "4 ounces heavy cream (about 1/2 cup; 115g)", "1 3/4 ounces plain or <a href=\"http://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted</a> sugar (about 1/4 cup; 50g)", "1/8 ounce vanilla extract (about 3/4 teaspoon; 4g), or more to taste", "1/4 teaspoon (1g) Diamond Crystal kosher salt, or more to taste; for table salt, use about half as much by volume or the same weight"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Dough:</strong> In the bowl of a stand mixer, combine flour, sugar, yeast, salt, and baking soda. Melt butter in a 2-quart saucier over low heat, then stir in milk and yogurt, warming to about 80&deg;F (27&deg;C). Add butter/milk/yogurt mixture to flour mixture and stir to form a very dry and shaggy dough. Using the hook attachment, knead dough on low until silky-smooth and elastic, capable of being gently stretched into a thin but rough sheet without tearing, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>First Rise:</strong> Cover bowl with plastic and set dough to rise until puffy, light, and doubled in bulk, about 1 1/2 hours at roughly 70&deg;F (21&deg;C). If dough feels dense, firm, or overly resilient (this is more likely in chilly months), let rest 15 more minutes before testing again.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Shaping:</strong> Turn dough onto a lightly floured surface, dust with flour, and roll into a 13-inch square. Spread homemade Nutella over dough in an even layer, using an offset spatula. Sprinkle hazelnuts on top and roll into a log, ending seam side down.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide an 8-inch strand of thread, unflavored dental floss, or butcher's twine under the dough log until you reach the middle. Cross the ends over the top and pull tight to divide the log in two. Cut each half into 6 one-inch slices and arrange in a parchment-lined 9- by 13- by 2-inch aluminum baking pan (or two 8-inch by 3-inch round cake pans).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Second Rise and Frosting:</strong> Cover rolls with foil and refrigerate overnight, or up to 48 hours. Meanwhile, prepare the frosting by combining mascarpone, cream, sugar, vanilla, and salt in the bowl of a stand mixer fitted with a whisk attachment. Whip on medium speed until sugar is dissolved and frosting is fluffy, thick, and capable of holding medium-soft peaks. If necessary, season with additional salt and/or vanilla to taste. Transfer to a disposable pastry bag or other airtight container and refrigerate until needed, up to 48 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Bake and Serve:</strong> Adjust oven rack to middle position and preheat to 350&deg;F (180&deg;C). Meanwhile, let buns stand at room temperature until oven is hot. When oven is hot, bake, covered, until buns are puffed and firm but pale, about 30 minutes. (If using darker pans, check on the buns a little sooner.) Remove foil and continue baking until buns are lightly browned, about 15 minutes more. Snip a corner from the bag of frosting and squeeze over each bun; alternatively, spoon frosting over the buns. Serve immediately, as the buns do not hold up well over time.</p>"}]}