{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/11/20191104-kanuchi-native-american-pecan-soup-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Jenny Dorsey"}, "recipeCuisine": "American", "keywords": ["fall", "low carb", "soup"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "<em>Kanuchi</em> (Cherokee Pureed Nut Soup)", "link": "https://www.seriouseats.com/recipes/2019/11/kanuchi-cherokee-pureed-nut-soup.html", "description": "A rich and creamy nut soup of Cherokee origin, kanuchi has few ingredients but a world of deep nutty flavor.", "totalTime": "1 hour", "recipeYield": "Serves 4", "recipeCategory": ["American", "Nuts", "Soups and Stews", "Stovetop", "Vegetarian"], "recipeIngredient": ["12 ounces (340g) raw shelled hickory nuts or pecans (see note)", "1 teaspoon kosher salt, plus more as needed", "1 tablespoon maple syrup", "1 cup cooked and drained whole or cracked hominy, or 1 large sweet potato (1 pound 6 ounces; 625g), peeled, cut into 1/2-inch dice, and roasted (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, process nuts, scraping down sides once or twice during processing, until they form a thick paste, about 3 minutes. Scrape nut paste into a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide paste into 3 even portions. You only need one portion to make this recipe; you can save the rest for future batches or use it as a nut butter in other preparations. To save the extra nut paste: If the paste is thick enough to hold its shape, form the remaining portions into balls, wrap tightly in plastic and then aluminum foil, and freeze for up to 3 months; if the paste is too loose to hold its shape, transfer portions to small zipper-lock bags, press out the air, then seal and freeze for up to 3 months."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer remaining portion of nut paste to a 3-quart saucepan and add 1 quart (1 liter) cold water along with the 1 teaspoon kosher salt. Set over high heat and bring to a boil, whisking to incorporate nut paste. Reduce heat to maintain a simmer and cook uncovered, stirring occasionally, until reduced by half, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add maple syrup, then increase heat to high, allowing soup to boil until any separated fats on the surface have emulsified back into the soup. Taste, adding more salt if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, briefly reheat hominy or sweet potato. Ladle hot soup into bowls and garnish with hominy or sweet potato."}]}