{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190225-olive-oil-cake-vicky-wasik-30.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["baking", "buttermilk", "cake", "dessert", "easy", "olive oil", "olive oil cake", "quick"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "8"}, "name": "Olive Oil Cake", "link": "https://www.seriouseats.com/recipes/2019/04/olive-oil-cake-recipe.html", "description": "This tender, fluffy olive oil cake comes together in less than an hour, start to finish, making it an ideal option for a last-minute dessert. It puts the bold flavor and nuanced aroma of olive oil front and center, so choose a brand you really love. Try pairing it with fresh fruits and a scattering of lightly toasted nuts (pistachio or pine nuts work especially well), or a dollop of softly whipped cream.", "totalTime": "About 45 minutes", "recipeYield": "One 8-inch cake, or 8 large wedges", "recipeCategory": ["Baking", "Cakes", "Father's Day", "Mother's Day", "Quick and Easy"], "recipeIngredient": ["5 1/4 ounces white sugar (about 3/4 cup; 150g), plain or <a href=\"https://www.seriouseats.com/2016/05/how-to-make-caramel-without-melting-sugar.html\">lightly toasted</a>", "1/2 teaspoon baking soda", "1/2 teaspoon baking powder", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "2 teaspoons freshly grated lemon zest", "5 1/4 ounces best-quality extra-virgin olive oil (about 3/4 cup; 150g); see our <a href=\"https://www.seriouseats.com/2019/02/what-the-label-wont-tell-you-how-to-buy-a-good-bottle-of-olive-oil.html\">guide to choosing a good olive oil</a> for recommendations", "4 ounces cultured low-fat buttermilk or kefir (about 1/2 cup; 110g); see our <a href=\"https://www.seriouseats.com/2017/04/how-to-substitute-buttermilk.html\">explainer on buttermilk substitutes</a> for more information", "1 large egg (about 1 3/4 ounces; 50g), straight from the fridge ", "1/2 teaspoon orange flower water", "5 3/4 ounces (about 1 1/4 cups, spooned; 165g) cake flour, any style (see note)", "Optional garnishes: powdered sugar, preferably organic (see our <a href=\"https://www.seriouseats.com/2016/03/organic-powdered-sugar-versus-conventional-baking-cornstarch-tapioca.html\">explainer on organic powdered sugar</a> for more information); fresh fruit; or toasted nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> Adjust oven rack to lower-middle position and preheat to 350&deg;F (180&deg;C). Line an 8- by 3-inch anodized aluminum cake pan with parchment (see our explanation and tutorial on <a href=\"http://www.seriouseats.com/2017/06/how-to-cut-a-parchment-round.html\">how to cut a parchment round</a>) and grease lightly with pan spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Cake:</strong> Whisk sugar, baking soda, baking powder, and salt together in a medium bowl for about 1 minute. This dry mixture will look homogeneous well before it truly is, so use patience at this stage, and whisk longer than may seem necessary. Under-mixing at this stage can produce dark spots or an uneven texture in the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add lemon zest, olive oil, buttermilk, egg, and orange flower water and whisk vigorously until batter looks smooth and well emulsified. Sift in cake flour and whisk just until well combined. Scrape into prepared pan. Bake until cake is firm but your finger can still leave an impression in the puffy crust, about 33 minutes. (A toothpick inserted into the center should come away with a few crumbs still attached.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool cake directly in pan about 10 minutes, then run a butter knife around the edges to loosen. Invert onto a wire rack, peel off parchment, and place cake right side up on a serving platter or cake stand. Serve warm or at room temperature, with a sprinkling of powdered sugar or with fresh fruit, nuts, and other accompaniments as desired."}]}