{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/01/20181220-banana-granola-vicky-wasik-29.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["Bake", "chia", "dried", "oat", "pecan", "rolled oat", "wheat germ"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Banana Granola", "link": "https://www.seriouseats.com/recipes/2019/01/banana-granola.html", "description": "This recipe combines everything we love in banana bread&mdash;its mellow flavor, gentle spice, and nutty crunch&mdash;into a tender yet crisp granola that's loaded with dried fruits, whole grains, crunchy seeds, and macadamia nuts. It's perfect over a bowl of yogurt for breakfast, but it's a bang-up topping for ice cream and <a href=\"https://www.seriouseats.com/2019/01/this-banana-pudding-turns-speckled-bananas-into-spectacular-pudding.html\">banana pudding</a> as well.", "totalTime": "About 4 hours", "recipeYield": "Makes about 10 cups", "recipeCategory": ["Baking", "Banana", "Breakfast and Brunch", "Dairy-Free", "Father's Day", "Granola", "Mother's Day", "Nuts", "Other Grains", "Vegan"], "recipeIngredient": ["<strong>For the Granola:</strong>", "14 ounces banana purée, from very black bananas, fresh or frozen (about 1 3/4 cups; 400g)", "1/2 ounce vanilla extract (about 1 tablespoon; 15g)", "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground cloves", "1/4 teaspoon freshly grated nutmeg", "12 ounces old-fashioned rolled oats, not instant, quick, or steel-cut (about 3 1/2 cups; 340g)", "1 1/2 ounces toasted wheat germ, such as <a href=\"https://www.amazon.com/Mothers-Toasted-Wheat-Germ/dp/B000QSG15Y?tag=serieats-20\">Mother's</a> (about 1/3 cup plus 1 tablespoon; 40g)", "1 ounce ground flaxseeds, such as <a href=\"https://www.amazon.com/gp/product/B00DOKFLYI/?tag=serieats-20\">Spectrum</a> (about 3 tablespoons; 30g)", "1/2 ounce chia seeds, such as <a href=\"https://www.amazon.com/gp/product/B00EJXWR6E/?tag=serieats-20\">Nutiva</a> (about 1 heaping tablespoon; 15g)", "7 ounces plain or <a href=\"https://www.seriouseats.com/2016/11/how-to-quickly-toast-sugar.html\">toasted sugar</a> (about 1 cup; 200g)", "3 ounces refined or virgin coconut oil, melted (about 1/3 cup; 85g)", "<strong>For the Mix-Ins:</strong>", "2 ounces raw pumpkin seeds (about 1/3 cup; 60g)", "2 ounces raw walnuts (a shy 1/2 cup; 60g)", "2 1/2 ounces roughly chopped macadamia nuts (about 1/2 cup; 70g)", "2 1/4 ounces pecan pieces (about 1/2 cup; 65g)", "1 teaspoon neutral oil, such as safflower", "1/8 teaspoon Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "4 ounces dried mangos, sliced into bite-size pieces (about 1/2 cup, firmly packed; 115g)", "3 ounces dried tart cherries (about 1/2 cup; 85g)", "2 ounces dried blueberries (about 1/3 cup, firmly packed; 55g)", "Freeze-dried bananas, to taste, from brands, such as <a href=\"https://www.amazon.com/Natierra-Natures-Organic-Freeze-Dried-Bananas/dp/B005M4G2VA/?tag=serieats-20\">Natierra</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Granola: </strong> In medium bowl, combine banana purée, vanilla, salt, cinnamon, cloves, and nutmeg, mashing with fork until very smooth. Alternatively, this can be done in a food processor or with an immersion blender. Add rolled oats, wheat germ, flaxseed, and chia, tossing with a flexible spatula to combine. Cover with plastic and set aside until oats are stiff and dry, about 30 minutes. Stir in sugar; cover and let stand until well dissolved, about 30 minutes more. Finally, stir in melted coconut oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Mix-Ins: </strong> While oats are soaking, adjust oven rack to middle position and preheat to 350&deg;F (177&deg;C). Combine pumpkin seeds, walnuts, macadamia nuts, and pecans on parchment-lined half-sheet pan; toast until fragrant and just beginning to brown, about 10 minutes. Transfer to large bowl, toss with a teaspoon of oil and sprinkle with salt. Stir in dried mangos, dried cherries, and dried blueberries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>To Bake the Granola: </strong> Reduce oven temperature to 300&deg;F (149&deg;C). After stirring in melted coconut oil, scrape granola onto parchment-lined half-sheet pan used for toasting the nuts. Spread mixture into even layer. Bake until uniformly golden brown and dry to the touch, about 110 minutes, pausing every 25 minutes or so to remove mixture from oven to stir well with a pair of forks. Be sure to circulate granola from edges of the pan to center and vice versa, so that it bakes and dries evenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When oats are deep golden brown and dry to the touch, although perhaps a little soft, transfer them to the bowl of fruit and nuts. Toss with flexible spatula until well combined; return to baking sheet and spread in even layer to cool, about 45 minutes. As soon as granola has cooled, add freeze-dried bananas (if using) and transfer to airtight container. The granola will keep up to 6 weeks at cool room temperature.</p>"}]}