{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/04/20190415-sheet-pan-cuban-sandwiches-morgan-eisenberg.jpg", "author": {"@type": "Person", "name": "Morgan Eisenberg"}, "recipeCuisine": "Latin American", "keywords": ["Cuban", "entertaining", "party", "pressed sandwich"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Sheet-Pan Cuban Sandwiches", "link": "https://www.seriouseats.com/recipes/2019/04/sheet-pan-cuban-sandwiches.html", "description": "These sheet-pan Cuban sandwiches feature all of the flavors of the classic sandwich, but in an easy-to-make, party-friendly package.", "totalTime": "2 hours 30 minutes", "recipeYield": "Serves 5 to 10 people as a light meal or party snack", "recipeCategory": ["Caribbean", "Game Day", "Ham", "July 4th", "Labor Day", "Latin American", "Memorial Day", "Pork", "Sandwiches"], "recipeIngredient": ["3 medium cloves garlic", "1 tablespoon (12g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "2 teaspoons ground cumin", "1 teaspoon freshly ground black pepper", "1 teaspoon dried oregano", "1 medium orange, juiced", "2 limes, juiced", "3 tablespoons (45ml) extra-virgin olive oil", "One 1 1/2– to 2-pound (680- to 900g) pork tenderloin", "2 large loaves crusty bread (preferably Cuban loaves, about 16 inches long by 5 inches wide), halved lengthwise", "6 tablespoons (90g) unsalted butter, softened", "1/2 cup (125g) yellow mustard, plus more for serving", "1 pound (450g) thinly sliced ham", "8 ounces (225g) sliced dill pickles", "8 ounces (225g) sliced Swiss cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, combine garlic, salt, cumin, pepper, oregano, orange juice, lime juice, and olive oil and process until garlic is fully minced. Transfer to a large sealable container and add pork tenderloin. Toss to coat, cover, and refrigerate for at least 1 and up to 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After pork has marinated, preheat oven to 450&deg;F (230&deg;C). Line a rimmed baking sheet with a double layer of heavy-duty foil. Top with pork and pour marinade over. Roast until the center of the thickest section of the pork reads 145&deg;F (63&deg;C) on an instant-read thermometer, about 35 minutes. Remove from the oven, transfer to a cutting board, and allow to rest for 10 minutes. Reduce oven temperature to 400&deg;F (200&deg;C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pork rests, pour any excess juices into a small bowl and discard foil. Clean and dry the baking sheet, if necessary. Spread butter all over the exterior of the bread. Set bottom bread halves on baking sheet. Spread mustard thinly on bottom halves, then top with sliced ham."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice pork tenderloin into thin, 1/4-inch-thick slices. Layer pork tenderloin over ham and drizzle with reserved cooking juices. Top with pickles and Swiss cheese, then close sandwiches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a second sheet pan over sandwiches and press down firmly. Place heavy, oven-safe objects, such as cast iron pots or pans, on top of the sheet pan to compress the sandwiches, then carefully transfer to the oven. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until cheese has melted and ingredients have warmed through, about 20 minutes. Cut sandwiches crosswise into individual portions and serve with additional mustard, if desired. "}]}