{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/09/veganlactationcookies.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["macadamia", "malt", "oat", "oatmeal"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Vegan Lactation Cookies", "link": "https://www.seriouseats.com/recipes/2019/09/vegan-lactation-cookie-recipe.html", "description": "Turning our hearty, satisfying lactation cookies vegan is as simple as a couple of swaps.", "totalTime": "45 minutes ", "recipeYield": "About 40 cookies", "recipeCategory": ["Baking", "Chocolate", "Cookies", "Dairy-Free", "Nuts", "Vegan"], "recipeIngredient": ["<strong>For the Dry Mix:</strong>", "7 ounces old-fashioned rolled oats, not instant or thick-cut (about 2 cups; 200g)", "6 ounces dark-chocolate chips (about 1 heaping cup; 170g), preferably a blend of percentages and styles (see our list of <a href=\"https://www.seriouseats.com/2019/04/the-best-supermarket-chocolate-chips.html\">favorite supermarket chocolate chips</a> for recommendations), plus more for garnishing", "5 ounces toasted macadamia nuts (about 1 heaping cup; 140g), roughly chopped", "3 ounces commercial oat flour, such as <a href=\"https://www.amazon.com/Bobs-Red-Mill-Whole-Grain/dp/B0013JOK8K/?tag=serieats-20\">Bob’s Red Mill</a> (about 3/4 cup plus 1 tablespoon; 85g); not homemade (see note)", "3 ounces non-bitter brewer's yeast powder, such as <a href=\"https://www.amazon.com/Bluebonnet-Nutrition-Super-Brewers-Powder/dp/B000POWM52/?tag=serieats-20\">BlueBonnet</a> (about 2/3 cup, spooned; 85g)", "2 1/2 ounces all-purpose flour, such as Gold Medal (about 1/2 cup, spooned; 70g)", "2 ounces flax meal (about 1/2 cup, spooned; 55g)", "<strong>For the Oat Slurry:</strong>", "1 1/2 ounces old-fashioned rolled oats, not quick-cooking or instant (about 1/2 cup minus 2 1/2 teaspoons; 42g)", "3 ounces water (about 1/3 cup plus 1 tablespoon; 85g)", "<strong>For the Cookie Dough:</strong>", "8 ounces refined coconut oil (about 1 1/3 cups; 225g), solid but creamy, about 70°F (21°C)", "7 ounces white cane sugar (about 1 cup; 200g)", "2 ounces barley malt syrup, such as <a href=\"https://www.amazon.com/EDEN-FOODS-Organic-Barley-Syrup/dp/B00NIO5YZ6/?tag=serieats-20\">Eden Foods</a> (about 3 tablespoons; 55g)", "1 ounce vanilla extract (about 2 tablespoons; 30g)", "1 1/4 teaspoons baking soda", "1 1/4  teaspoons ground cinnamon", "1 teaspoon ground ginger", "3/4 teaspoon (3g) Diamond Crystal kosher salt, or more to taste; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon freshly grated nutmeg", "2 ounces prepared oat slurry (about 1/4 cup; 55g)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Dry Mix:</strong> In a large bowl, combine rolled oats, chocolate chips, macadamia nuts, oat flour, brewer's yeast powder, all-purpose flour, and flax meal, tossing with a flexible spatula until mixture is completely homogenized. Proceed immediately to the next step or transfer the dry mix to an airtight container and store at cool room temperature until the date stamped on the package of macadamia nuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Oat Slurry:</strong> In a tall, narrow container just wide enough to accommodate the head of an immersion blender, combine rolled oats and water. Purée with an immersion blender until thick and smooth, then strain through a fine-mesh strainer, pressing on the solids with a flexible spatula until they give up all their liquid. Discard the fibrous oat solids and reserve 2 ounces of the thick and gooey purée to use as directed below. This step should not be done in advance, as the oat slurry will continue to thicken and will become unusable over time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Cookie Dough:</strong> Set oven rack to middle position and preheat to 350&deg;F (180&deg;C). In the bowl of a stand mixer fitted with a paddle attachment, combine coconut oil, sugar, barley malt syrup, vanilla extract, baking soda, cinnamon, ginger, salt, and nutmeg. Mix on low speed to combine, then increase to medium and cream until soft, pale, and light, about 5 minutes. Along the way, pause to scrape the bowl and beater using a flexible spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While mixing on medium speed, add oat slurry and continue beating until smooth and homogeneous, scraping bowl as needed. Reduce speed to low and add dry mix all at once. Continue mixing until thoroughly incorporated, with no visible patches of dry mix. Scrape bowl and beater with flexible spatula, then fold dough a few times by hand to be sure the texture is even."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a 2-tablespoon cookie scoop, divide dough into approximately 40 portions. If you like, top each piece with a few extra chocolate chips for garnish. Arrange up to 12 portions of dough on a parchment-lined half-sheet pan and transfer remaining dough to a heavy-duty zipper-lock bag for cold storage. The dough can be refrigerated for about 2 weeks or frozen for up to 3 months, then thawed to about 70&deg;F (21&deg;C) before being baked as directed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake portioned freshly made or thawed dough on parchment-lined half-sheet pan until puffed and golden brown and firm to the touch around the edges, but a little soft and fragile in the center, about 12 minutes. Enjoy warm, or let cookies cool and transfer to an airtight container, where they can be stored for up to 1 week at room temperature."}]}