{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2018/11/20181127-MHT-beer-pairings-malty-vicky-wasik-1.jpg", "author": {"@type": "Person", "name": "Michael Harlan Turkell"}, "recipeCuisine": "", "keywords": ["almond butter", "baba ganoush", "meatball", "mint", "vanilla"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Smoky Lamb Meatballs With Almond-Butter Baba Ganoush", "link": "https://www.seriouseats.com/recipes/2019/02/smokey-lamb-meatballs-with-almond-butter-baba-ganoush.html", "description": "These brown butter&ndash;enriched lamb meatballs get a burnished crust from a stint in the oven. They’re served over a fire-roasted eggplant baba ganoush, which is scented with a hint of vanilla and emulsified with almond butter in place of tahini. The result is a striking balance of salty and fatty, smoky and nutty, meaty and sweet.", "totalTime": "1 hour", "recipeYield": "Serves 4 as an appetizer", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Eggplant", "Gluten-Free", "Lamb", "Nuts", "Quick Dinners", "Recipes", "Roasting", "Snacks"], "recipeIngredient": ["<strong>For the Baba Ganoush:</strong>", "1 pound large eggplant (450g)", "2 tablespoons salted almond butter (32g)", "2 tablespoons (30ml) fresh lemon juice", "½ teaspoon (2ml) vanilla extract or 1/2 vanilla bean, split lengthwise and scraped", "Kosher salt", "<strong>For the Meatballs:</strong>", "2 tablespoons (28g) unsalted butter", "1 pound (450g) ground lamb", "¼ cup (40g) smoked almonds, chopped", "¼ cup (40g) raisins", "1 cup (20g) mint leaves, chopped, plus more for serving", "2 teaspoons (10ml) vegetable oil", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Baba Ganoush If Using Grill (Recommended) or Gas Burner:</strong> Preheat a gas or charcoal grill, or a gas stovetop burner, to medium heat and place eggplant directly over heat source. Cook, turning occasionally with tongs, until eggplant is completely tender and well-charred on all sides, 20 to 25 minutes. Wrap with foil and let rest 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Baba Ganoush If Using Broiler:</strong> Adjust rack to 6 inches below broiler element and preheat broiler to high. Place eggplant on foil-lined rimmed baking sheet. Broil, turning occasionally, until charred on all sides and completely tender, about 45 minutes. Eggplant should be very, very tender when cooked. Test near the stem and bottom end; if a toothpick or skewer meets any resistance, continue cooking. Remove from oven and gather up foil, crimping it around eggplant to form a sealed package. Let eggplant rest for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open foil package and use a sharp paring knife to slit eggplant open lengthwise. Carefully scoop out soft flesh with large spoon and transfer to medium bowl. Add almond butter, lemon juice, and vanilla to the eggplant and stir vigorously with fork until eggplant breaks down and mixture becomes pale and creamy. Season to taste with salt. Cover and set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Meatballs:</strong> In a small (1-quart) saucepan, melt butter over medium-low heat. When it has completely melted, increase heat to medium and simmer, stirring with a heat-resistant spatula while butter hisses and pops. Continue cooking and stirring, scraping up any brown bits that form inside the pan, until butter is golden yellow and perfectly silent. Set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine ground lamb, smoked almonds, raisins, and mint. Using clean hands, gently mix ingredients together until they are evenly distributed throughout the meatball mixture; avoid mixing any more than is necessary for even distribution. Add cooled brown butter to the meatball mixture and use hands to gently incorporate into meatball mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, heat oil over medium heat until shimmering. Cook a 1-inch tester patty of the meatball mixture to taste and adjust seasoning with kosher salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven rack to 6 inches below broiler element and preheat broiler on high. Line a rimmed baking sheet with aluminum foil. Using clean hands, form meatball mixture into 1 1/2-inch balls (about 1.25 oz; 35g each) and arrange on prepared baking sheet; you should be able to make 16 meatballs. Broil meatballs until they are browned on top and register 145&deg;F (63&deg;C) on an instant-read thermometer, 6 to 9 minutes (cooking times can vary dramatically, depending on oven broiler strength). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For Serving:</strong> Using a spoon, spread baba ganoush in an even layer on a serving platter. Place meatballs on top, and sprinkle with chopped mint leaves; serve right away."}]}