{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/06/cambodianchicken.jpg", "author": {"@type": "Person", "name": "Elazar Sontag"}, "recipeCuisine": "Asian", "keywords": ["Asian", "Cambodian", "chicken", "southeast asian", "stir fry"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "2"}, "name": "Cambodian Lemongrass Chicken Stir-Fry (<i>Cha Kreung Satch Moan</i>)", "link": "https://www.seriouseats.com/recipes/2019/06/cambodian-chicken-stir-fry-recipe.html", "description": "If you're hoping to familiarize yourself with the mouthwateringly delicious foods of Cambodia, look no further than <em>cha kreung satch moan</em>. This chicken stir-fry is salty, sweet, pungent, and slightly spicy, balanced by the herbal, cooling flavor of holy basil. ", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Asian", "Chicken", "Mains", "Stir Frying"], "recipeIngredient": ["<strong>For the Kreung:</strong>", "3 stalks lemongrass, bottom 4 to 5 inches only, outer leaves discarded, sliced into thin rounds (65g once sliced)", "One 3-inch knob galangal, peeled and sliced into thin rounds (35g once sliced)", "Two 4-inch knobs fresh turmeric, peeled and sliced into thin rounds (25g once sliced)", "12 makrut lime leaves, preferably fresh, sliced very thinly crosswise", "1 small shallot, peeled and sliced into thin rounds (25g once sliced)", "5 medium cloves garlic, peeled (25g)", "1/2 cup holy basil leaves, very tightly packed (12g; see note) or Thai basil leaves (25g)", "<strong>For the Stir-Fry:</strong>", "1/2 cup (120ml) vegetable oil, divided", "2 pounds (900g) boneless, skinless chicken breast (about 3 breast halves), cut crosswise into 1/2-inch-thick slices, divided", "One 3-inch piece fermented mudfish (35g), cut in half, divided (optional; see note)", "2 teaspoons (10ml) Asian fish sauce, divided", "1/2 teaspoon granulated sugar, divided", "1/2 cube (6g) chicken bouillon, such as Knorr, crumbled to a powdery consistency, divided", "1 cup holy basil leaves, very tightly packed (40g), divided", "4 jalapeños (150g), stemmed, halved, and seeded, then cut on a bias into 3/4-inch strips, divided", "Kosher salt", "<strong>For Serving:</strong>", "Steamed white rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Kreung:</strong> Using a large <a href=\"https://www.seriouseats.com/2018/08/best-mortars-and-pestles.html\">granite mortar and pestle</a>, combine lemongrass, galangal, turmeric, and makrut lime leaves and grind to a smooth but slightly fibrous paste. These are the toughest, most fibrous ingredients in the paste, so it will take 5 to 10 minutes for the paste to form. Once the paste has formed, add shallot and garlic and pound again to smash them into the paste, another 3 to 5 minutes longer. Add basil to the mortar and pound until it is fully incorporated into the paste. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Stir-Fry:</strong> In a wok, heat 1/4 cup (60ml) vegetable oil over medium-low heat until shimmering. Add roughly half of the kreung to the wok, stirring and scraping constantly with a wooden spatula to prevent the mixture from sticking to the bottom of the pan and burning. At first, the paste will snap and pop as it begins to release moisture. Continue stirring until all visible moisture has cooked off and the paste has thickened and darkened slightly, 1 to 2 minutes.\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to high, then add half of the chicken to the wok, along with 1 piece of mudfish (if using) and cook, stirring, until chicken is coated in the kreung and has turned white on the surface, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in half of fish sauce, sugar, and bouillon and scrape browned bits from the bottom of the wok (some may still adhere). Stir in half the basil. Once basil has wilted, reduce heat to low and add half of jalapeño slices, cooking until warmed through but still crisp. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape contents of wok into a serving bowl and discard fermented fish. Rinse and dry wok, then repeat with remaining oil, kreung, chicken, and other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve stir-fry right away, passing steamed white rice at the table."}]}