{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/11/20191030-filipino-pancit-palabok-vicky-wasik-2.jpg", "author": {"@type": "Person", "name": "Yana Gilbuena"}, "recipeCuisine": "Filipino", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.6666666666667", "ratingCount": "3"}, "name": "<i>Pancit Palabok</i> (Filipino Noodles With Smoky Pork and Seafood Sauce)", "link": "https://www.seriouseats.com/recipes/2019/12/pancit-palabok-filipino-noodles-with-smoky-pork-and-seafood-sauce.html", "description": "This classic Filipino noodle dish is packed with pork, chicken, shrimp, and layer upon layer of seafood flavor.", "totalTime": "3 hours, plus optional overnight marinating", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Filipino", "Mains", "Noodles", "Other Seafood", "Pork", "Shrimp", "Stovetop"], "recipeIngredient": ["<strong>For the Pork Belly:</strong>", "1/4 cup (60ml) plus 2 to 3 tablespoons (30 to 45ml) fish sauce, divided", "2 tablespoons sugar", "1 tablespoon freshly ground black pepper, plus more as needed", "One 13.5-ounce (398ml) can coconut milk", "1/2 cup water (120ml)", "1 pound (450g) skin-on, boneless pork belly", "<strong>For the Stock and Sauce:</strong>", "1 head garlic, peeled and minced, plus 4 medium garlic cloves, crushed, divided", "2 scallions, green tops thinly sliced crosswise for garnish and white parts reserved for stock", "One 1-inch piece peeled fresh ginger, bruised with the spine of a knife", "1 red onion, finely diced, trimmings reserved for stock", "2 (about 12 ounces; 340g) skinless chicken thighs", "1 pound (450g) large shrimp, preferably head-on", "1/4 cup (60ml) plus 1 tablespoon (15ml) canola or other neutral oil, divided", "3 1/2 teaspoons annatto powder", "One 8-ounce bottle <a href=\"https://www.filstop.com/navarros-crab-paste-8oz.html\">Filipino crab paste</a>", "1/2 cup (3 ounces) <i><a href=\"https://www.filstop.com/angelina-dried-salted-butterflycut-round-scad-galunggong-8oz.html\">galunggong</a></i> or <i>tinapa</i> (Filipino smoked fish), flaked and any large bones discarded", "3 tablespoons cornstarch mixed with 3 tablespoons cold water to make a lump-free slurry", "Kosher salt", "<strong>To Serve:</strong>", "One 16-ounce pack (or two 8-ounce packs) <a href=\"https://www.amazon.com/Excellent-Rice-Stick-Special-Bihon/dp/B00CAFTMHA/?tag=serieats-20\">thick rice or cornstarch noodle sticks</a>", "4 <a href=\"https://www.seriouseats.com/recipes/2009/10/perfect-boiled-eggs-recipe.html\">hard-boiled eggs</a>, cut into wedges, for garnish", "4 calamansi or 2 lemons, cut into wedges (see note)", "<a href=\"https://www.amazon.com/Maesri-Fried-Garlic-10-5-Ounce/dp/B00L19DTQG/?tag=serieats-20\">Fried garlic</a>, for garnish", "1 cup crushed <a href=\"https://www.amazon.com/Tito-Choice-Chicharrones-Fried-Attached/dp/B073H7X6V4/?tag=serieats-20\">pork cracklings (chicharron)</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Pork Belly:</strong> In a zipper-lock bag, combine 1/4 cup (60ml) fish sauce, sugar, 1 tablespoon black pepper, and coconut milk; seal bag and shake well to combine. Add pork belly to bag, carefully press out air, then seal and refrigerate overnight. Remove pork belly from bag, pat dry, then allow to air-dry in the refrigerator for at least 1 hour. Alternatively, if you don't have time to marinate the pork overnight, simply brush the belly with fish sauce and season with black pepper, then proceed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325&deg;F (160&deg;C). In an overproof skillet or on a baking sheet lined with foil, roast the pork belly until an instant-read thermometer registers 160&deg;F when inserted into the center, about 45 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 500&deg;F (260&deg;C) and return the pork to the oven until skin is browned and crispy, about 10 minutes. Let cool, then slice pork into 1/2 inch thick slices. Reserve for serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Meanwhile, for the Stock and Sauce:</strong> Fill a Dutch oven or large pot with 4 quarts (4 liters) water. Add the 4 crushed cloves of garlic, ginger, scallion whites, and reserved onion scraps. Bring to a simmer, then add chicken thighs and cook at a gentle simmer for 45 minutes. Remove chicken, let cool, then shred meat and discard bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up an ice water bath in a large bowl. Add shrimp to simmering stock and cook until just cooked through and pink all over, about 2 minutes. Using a slotted spoon, transfer shrimp to ice bath and let cool. Remove from ice bath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shell shrimp and remove heads. Working in a large mortar and pestle, crush shrimp shells and heads until juices are extracted. Strain, reserving shrimp juices. Return shells and heads to the stock and simmer for 5 minutes longer. Keep shrimp chilled until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain stock, discarding solids. Reserve 1 quart (1 liter) stock for the sauce below, and freeze the rest for future use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean Dutch oven, heat 1/4 cup (60ml) oil over medium-high heat until shimmering. Add minced garlic and diced onion and cook, stirring, until beginning to brown, about 5 minutes. Stir in annatto powder, followed by the crab paste, 1 quart (1 liter) reserved stock, and reserved shrimp juices. Bring to a boil, then reduce heat to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the flaked fish, followed by the cornstarch slurry. Return to a simmer, then cook until sauce thickens. Add the remaining fish sauce in 1 tablespoon increments until it tastes well seasoned to you (you may not need all of it). Season with salt and pepper, if desired. Set sauce aside, stir in reserved chicken, then allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot of salted boiling water, add remaining 1 tablespoon (15ml) oil. Add noodles and cook, stirring gently to break them up, until softened and beginning to turn slightly clear, about 3 minutes. Drain in a colander set in a sink, then run cold water all over the noodles to rinse and chill; toss noodles as you rinse them to ensure they're not stuck together. Set aside to drain fully."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pile the noodles on a large serving dish. Spoon sauce all over. Arrange reserved shrimp and pork belly slices on top, and garnish with the hard-boiled eggs and citrus wedges. Sprinkle all over with reserved sliced scallion greens, fried garlic, and crushed pork rinds. Serve. "}]}