{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/11/20191107-greek-yogurt-cheesecake-vicky-wasik-19.jpg", "author": {"@type": "Person", "name": "Stella Parks"}, "recipeCuisine": "", "keywords": ["cheesecake", "greek yogurt", "skyr"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5714285714286", "ratingCount": "7"}, "name": "No-Bake Greek Yogurt Cheesecake", "link": "https://www.seriouseats.com/recipes/2019/11/no-bake-greek-yogurt-cheesecake.html", "description": "If you can make a Swiss meringue, you've got what it takes to whip up this fluffy cheesecake. Its mousse-like nature demands a few bowls to prepare and combine the individual components, but it more than makes up for that inconvenience with its no-bake format, week-long shelf life, and airy texture&mdash;a trio of factors that give it real power as a make-ahead holiday dessert. It's tangy, light, and none too rich, a.k.a. the perfect conclusion to any hearty meal.", "totalTime": "About 7 hours", "recipeYield": "Makes one 8-inch round cheesecake, or about 16 slices", "recipeCategory": ["Cakes", "Gluten-Free", "No-Cook"], "recipeIngredient": ["<strong>Getting Ready:</strong>", "Cooking spray, for greasing the pan", "<strong>For the Crust:</strong>", "8 3/4 ounces chocolate cookie crumbs (about 2 cups; 250g), see note ", "2 ounces unsalted butter (about 4 tablespoons; 55g), melted and very warm", "1/8 teaspoon (0.5g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "<strong>For the Filling:</strong>", "1/2 ounce unflavored gelatin powder (about 4 1/4 teaspoons, though volume may vary by brand; 14g), such as <a href=\"https://www.amazon.com/Now-Foods-Gelatin-Natural-Powder/dp/B000MGR302/?tag=serieats-20\">NOW Foods</a>, see note", "1 ounce water, milk, or cream (about 2 tablespoons; 30g)", "3/4 ounce vanilla extract (about 4 1/2 teaspoons; 22g), or more to taste", "24 ounces strained Greek yogurt (about 3 cups; 680g), such as Fage or Chobani, or skyr such as Siggi's", "12 ounces heavy cream (about 1 1/2 cups; 340g)", "6 ounces egg whites from about 6 large eggs (about 3/4 cup; 170g)", "7 ounces sugar (about 1 cup; 200g)", "1/2 teaspoon (2g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight, or more to taste", "<strong>To Serve:</strong>", "Chocolate shavings, sprinkles, or candies, such as <a href=\"https://www.valrhona-chocolate.com/baking-products/chocolate-pearls.html\">Valrhona Crunchy Pearls</a>, <a href=\"https://www.amazon.com/Callebaut-Crispearls-Salted-Caramel-1-76/dp/B01A81S3HC/?tag=serieats-20\">Callebaut Crispearls</a>, malt balls, etc"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Getting Ready:</strong> This recipe requires an 8- by 4-inch nonreactive aluminum pan, preferably a loose-bottom style like <dorado id=\"cheesecake-pan\" class=\"text\">this custom piece from LloydPans Kitchenware</dorado>. Otherwise, a springform pan of similar dimensions will work, although it will require more care in handling. In either case, wrap the bottom insert in foil before assembly, then tear away the excess, so the pan sits flat. Lightly grease the pan with cooking spray. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Crust:</strong> Add the cookie crumbs, melted butter, and salt to the prepared pan, and stir gently with a fork (or your fingers) until well combined. If needed, season to taste with additional salt. With your fingers, or the bottom of a small glass, compress into an even layer along the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For the Filling:</strong> In a small bowl, whisk the gelatin powder, water, and vanilla together with a fork until well combined. Meanwhile, combine the Greek yogurt and cream in the bowl of a stand mixer fitted with a whisk attachment and whip until thick and able to hold medium-stiff peaks, about 5 minutes, although the timing will vary depending on both the power of the mixer and specific moisture content of the Greek yogurt. After whipping, transfer to a separate container, cover, and refrigerate until needed, up to 1 hour. Before proceeding, make certain the stand mixer bowl and whip are meticulously clean, as trace amounts of fat may inhibit aeration of the meringue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For a Stand Mixer With a Bowl-Lift Design:</strong> Tear off a long strip of foil and crumple it into a thick ring. Place it in the bottom of a 3-quart saucier, or similarly large, wide pot, and fill with roughly 1 1/2 inches water. Place over high heat until bubbling-hot, then adjust the temperature to maintain a gentle simmer. In a stainless steel stand mixer bowl, combine egg whites, sugar, and salt. Set over the steaming water so that the bowl is resting on the foil ring and touching neither the water nor the pot itself. Cook, stirring and scraping constantly with a flexible spatula, until egg whites register 175°F (79°C) on a digital thermometer; this should take no longer than 8 to 10 minutes. Transfer bowl to a stand mixer fitted with a whisk attachment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>For a Stand Mixer With a Tilt-Head Design:</strong> Fill a large pot with a few inches of water. Place over high heat until bubbling-hot. In a large heatproof glass or ceramic bowl, combine egg whites, sugar, and salt. Set bowl over the steaming water, then cook, stirring and scraping constantly with a flexible spatula, until egg whites register 175°F (79°C) on a digital thermometer; this should take no longer than 10 minutes. Scrape mixture into the stand mixer bowl and fit stand mixer with a whisk attachment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the meringue on high speed until glossy, stiff, and thick, but still warm to the touch, about 4 minutes (again, the timing can vary substantially, so use the textural cues as your primary guide). Near the end of that time, melt the prepared gelatin with a few careful 10-second bursts in the microwave or over the water bath. In either case, it's important that the gelatin is liquified and warm, but no hotter than 212&deg;F. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place about 1/3 of the warm meringue in a large bowl, then whisk in the warm gelatin with a balloon whisk, working quickly to be sure the gelatin does not have an opportunity to congeal against the sides of the bow. Whisk in the remaining meringue, followed by the whipped Greek yogurt in two or three additions. Adjust to taste, with additional salt, or extracts of any kind. Immediately scrape into the prepared pan, and smooth into an even layer. Cover with foil and refrigerate until the cheesecake is fully set, with an internal temperature no higher than 40°F (4°C), at least six hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>Unmolding the Cheesecake:</strong> Loosen the sides of the cheesecake from the pan with a thin knife or offset spatula. Place the pan on a large can of tomatoes or a similarly sized object; something tall enough to lift the cheesecake 4 inches from the counter and wide enough to form a stable base. With both hands on the sides of the pan, pull downward to drop the outer ring away from the bottom. Place the cake onto a flat work surface, loosen it from the bottom of the pan with an offset spatula, and transfer to a large, flat serving plate. Wrap thoroughly with plastic and refrigerate until needed, up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Serve:</strong> Top the cheesecake as desired and cut with a large chef's knife dipped in hot water; for clean and tidy portions of cheesecake, pause to clean the blade under hot running water between each slice. Serve chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Troubleshooting:</strong> While the approximate cooking times for the water bath are estimations, and will naturally vary from kitchen to kitchen, substantially missing the mark in terms of timing indicates heat levels that are vastly too high or low. When the meringue cooks much too fast, it is prone to scrambling, regardless of how thoroughly the bowl is scraped, resulting in a lumpy texture and eggy flavor. When the meringue is cooked too slowly, excess evaporation will dry the meringue, making it grainy and dense. In either event, adjusting the heat as needed will resolve the issue.</p>"}]}