{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/07/20190618-grilled-turkish-chicken-wings-vicky-wasik-13.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "Middle Eastern", "keywords": ["charcoal grilling", "chicken", "chicken wings", "game-day-wing", "grill", "grilled chicken", "grilling", "Mediterranean", "skewer", "skewered chicken", "turkish"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Grilled Turkish-Style Chicken Wings", "link": "https://www.seriouseats.com/recipes/2019/07/grilled-turkish-wings-recipe.html", "description": "An improved setup for skewers brings these grilled wings closer to the heat, while a marinade based on Turkish hot pepper paste infuses them with roasted-chili flavor.", "totalTime": "1 hour 30 minutes", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Gluten-Free", "Grilled Chicken", "Grilling, Smoking, and Barbecue", "Middle Eastern", "Snacks", "Summer"], "recipeIngredient": ["1 cup (260g) <a href=\"https://www.amazon.com/Sera-Turkish-Pepper-Paste-25oz/dp/B0075BSBYY/?tag=serieats-20\">Turkish hot pepper paste</a> (see note)", "1/2 cup (120ml) extra-virgin olive oil", "1/2 cup (35g) chopped fresh parsley leaves", "4 medium cloves garlic (20g), minced ", "1 tablespoon (15ml) <a href=\"https://www.amazon.com/CORTAS-Pomegrante-Molasses-10-Ounce/dp/B004A6ET3O/?tag=serieats-20\">pomegranate molasses</a>", "1 tablespoon (12g) kosher salt", "2 teaspoons (4g) <a href=\"https://www.amazon.com/Sahadi-Urfa-Biber-Pepper-ounce/dp/B01C4TRTTY/?tag=serieats-20\"><i>isot</i> pepper</a> (optional; see note)", "1 teaspoon (2g) ground cumin seed", "1 teaspoon (2g) paprika", "3 pounds (1.4kg) chicken wings, cut at joints, wingtips discarded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir together pepper paste, olive oil, parsley, garlic, and pomegranate molasses with a rubber spatula until well combined. Stir in salt, isot pepper (if using), cumin, and paprika. Transfer 1/2 cup (120ml) pepper paste mixture to a small bowl and set aside. (If you're marinating the chicken wings overnight, cover and refrigerate this pepper paste mixture until you're ready to grill the wings.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine chicken wings and remaining pepper paste mixture in a 1-gallon zipper-lock bag. Seal bag, pressing out as much air as possible. Massage bag until wings are evenly coated in marinade. Lay bag flat on a rimmed baking sheet and refrigerate, turning bag occasionally, for at least 1 hour and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, thread chicken wings onto sets of 2 metal skewers, spacing the skewers 1 to 1 1/2 inches apart. Try to keep the chicken wings in a relatively even and flat layer on the skewers. If you're working with both flats and drumettes, thread them on separate sets of skewers. For flats, thread each flat through the gap between the two bones; for drumettes, alternate their end-to-end alignment on the skewers as if they are sleeping head to toe next to each other. Make sure the wings are bunched tightly together, leaving no parts of the skewers exposed except for a 2-inch handle at the bottom of each pair and the pointy tips at the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<a href=\"https://www.seriouseats.com/2019/07/how-to-set-up-grill-for-skewers.html\">Set up grill for skewers,</a> making sure to adjust distance between bricks to match the length of your skewers. <a href=\"https://www.seriouseats.com/2009/04/grilling-lighting-the-fire-without-lighter-fluid.html\">Light 2/3 chimney full of charcoal.</a> When all the charcoal is lit and covered with gray ash, pour out and spread the coals over half the channel between the bricks, creating a modified <a href=\"https://www.seriouseats.com/2012/04/the-serious-eats-guide-to-grilling-2012.html\">two-zone direct fire</a>."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place half the skewers directly over the hot coals and the other half on the cooler side of the grill, balancing the skewers on top of the bricks, with the handles overhanging the bricks closest to you and the tips balancing on the farther wall of bricks. Cook, turning frequently, until wings on the hot side of the grill are lightly charred on both sides, 4 to 6 minutes; if flare-ups occur, move the skewers to cooler side of grill as needed to get them away from the flames. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Switch the sets of skewers so that the ones cooked on the cooler side of the grill are now positioned over the hot coals, moving the charred wings to the cooler side. Cook, continuing to turn the skewers frequently, until all the wings are evenly charred, 4 to 6 minutes longer. Continue cooking, moving skewers around over the coals, until chicken is cooked through, 2 to 4 minutes longer. Transfer skewers to a serving platter and let rest for 3 to 5 minutes before removing skewers. Serve immediately with reserved marinade for dipping."}]}