{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2019/03/20190321-asparagus-miso-bearnaise-vicky-wasik-21.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "French", "keywords": ["bearnaise", "miso", "side dish", "steakhouse"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Charred Asparagus With Miso Béarnaise Sauce", "link": "https://www.seriouseats.com/recipes/2019/03/charred-asparagus-with-miso-bearnaise-sauce.html", "description": "A touch of miso and a screaming-hot cast iron pan spruce up these classic steakhouse accoutrements. ", "totalTime": "40 minutes", "recipeYield": "Serves 4 as a side", "recipeCategory": ["Asparagus", "Easter", "Eggs", "French", "Quick and Easy", "Recipes", "Sides", "Spring", "Stovetop", "Vegetarian"], "recipeIngredient": ["1/2 cup (120ml) dry white wine", "1/4 cup (60ml) white wine vinegar", "1 large shallot (30g), sliced thin", "3 sprigs tarragon, leaves finely minced, stems reserved separately", "1/2 teaspoon (2g) whole black peppercorns", "2 large egg yolks (36g) ", "1 tablespoon (20g) white miso", "12 tablespoons (168g) unsalted butter", "Kosher salt and freshly ground black pepper", "1 pound (450g) asparagus, woody ends trimmed", "1 tablespoon (15ml) vegetable oil, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine wine, vinegar, shallots, tarragon stems, and black peppercorns, and bring to a simmer over medium-high heat. Adjust heat to maintain a gentle simmer and cook until reduced to about 1 1/2 tablespoons of liquid, 10 to 12 minutes. Carefully strain liquid through a fine-mesh strainer into a small bowl, pressing on the solids with the back of a spoon to extract as much liquid as possible. Let mixture cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a tall-sided cup that barely fits the head of an immersion blender, combine egg yolks, miso, and the wine-vinegar reduction. Using an immersion blender. Blend mixture until well-combined, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small saucepan, melt butter over high heat, swirling constantly, until foaming subsides. Transfer butter to a 1-cup liquid measuring cup. Heat a large cast iron skillet over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place head of immersion blender into the bottom of the cup and turn it on. With the blender constantly running, slowly pour hot butter into cup in a thin and steady stream. Continue blending, raising and lowering blender head slightly to fully emulsify butter with the egg yolk mixture. Sauce should be thick and creamy, able to coat a spoon but still flow off of it. If it is too thick, whisk in a small amount of water to thin it out. Stir in minced tarragon and season to taste with salt. Transfer to a small lidded pot and keep in a warm place for up to 1 hour before serving. Béarnaise cannot be cooled and reheated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half of the asparagus to the preheated cast iron skillet and arrange in a single layer. Cook, turning occasionally, until spears are lightly charred all over and just cooked through, 4 to 6 minutes for thin spears, 5 to 8 minutes for thick spears. Carefully add half of the vegetable oil to the skillet, toss to coat asparagus with oil, and season with salt and pepper to taste. Transfer asparagus to a warmed serving plate. Repeat with remaining asparagus and vegetable oil. Serve immediately, passing béarnaise sauce at the table. "}]}