{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/01/20200122-kal-guksu-anchovy-noodle-soup-vicky-wasik-5.jpg", "author": {"@type": "Person", "name": "Seoyoung Jung"}, "recipeCuisine": "Korean", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Korean Anchovy Knife-Cut Noodle Soup (<em>Myeolchi Kal Guksu</em>)", "link": "https://www.seriouseats.com/recipes/2020/01/korean-anchovy-knife-cut-noodle-soup-myeolchi-kal-guksu.html", "description": "Korean knife-cut noodle soup features tender and slippery fresh wheat noodles and a balanced selection of vegetables.", "totalTime": "40 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Korean", "Mains", "Noodles", "Soups and Stews", "Stovetop"], "recipeIngredient": ["15 stock anchovies, heads and entrails removed (see note)", "4 <em>diphori</em> (dried large-eyed herring) or 1 <a href=\"https://www.amazon.com/Dried-Seafood-Anchovy-Dashi-Korea/dp/B06XJZY8GW/?tag=serieats-20\">Korean seafood packet</a> (see note)", "One 1 1/2- by 6-inch piece dried <em>dashima</em> (also sold as <em>kombu</em>, which is the Japanese name)", "2 portions fresh Korean knife-cut fresh noodles (see note)", "8 ounces (225g) zucchini or Korean summer squash (about half of 1 large squash), cut into 1/8 inch thick half-moons", "One 8-ounce (225g) white potato, peeled and sliced into 1/8 inch thick half-moons", "One 8-ounce (225g) yellow onion, sliced 1/2 inch thick", "2 ounces (55g) carrot (about half a small to medium carrot), julienned", "3 medium cloves garlic, minced", "3 tablespoons (45ml) <em>joseon ganjang</em> (Korean soy-only soy sauce, see note)", "Sea salt or kosher salt", "Freshly ground black pepper", "Thinly sliced scallions, for garnish", "Sliced fresh red Korean chilies and roasted and crushed <em>gim</em> (dried laver seaweed, sold as nori in Japanese), for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot or Dutch oven, combine dried anchovies, herring (or seafood packet), and dashima, with 2 quarts plus one cup cold water (2 liters). Bring to a simmer over high heat, then reduce heat to maintain simmer. Cook until most of the flavor has been extracted from the dried anchovies (taste one!), about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain stock and discard solids. Return stock to pot and bring back to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently shake off any loose starch from the noodles. Place them in a sieve and rinse gently under cold running water, without rubbing, until the excess starch is rinsed off and the water runs clear.\r\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the noodles, squash, potato, onion, carrot, and garlic to the stock and simmer until vegetables are just tender and noodles are cooked through, about 7 minutes; using chopsticks, gently tease the noodles apart as they cook to ensure they don't clump. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in soy sauce, then season further with salt to taste. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer noodles to warmed bowls. Top with vegetables, then ladle in broth. Garnish each bowl with freshly ground black pepper, if desired, and scallions. Top with any other desired garnishes, including sliced chilies and/or crushed seaweed. Serve right away."}]}