{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/02/20200224-obe-ata-vicky-wasik-23.jpg", "author": {"@type": "Person", "name": "Jenny Dorsey"}, "recipeCuisine": "African", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "ratingCount": "4"}, "name": "<i>Obe Ata</i> (Nigerian Red Pepper Sauce)", "link": "https://www.seriouseats.com/recipes/2020/03/obe-ata-nigerian-red-pepper-sauce.html", "description": "This master recipe for Nigerian obe ata delivers a rich and flavorful red pepper-and-tomato-based sauce that can be used in stews and braises, or cooked down into a condiment for dipping.", "totalTime": "3 hours", "recipeYield": "Makes about 2 quarts (2 liters)", "recipeCategory": ["African", "Condiments and Sauces", "Other Vegetables", "Recipes", "Soups and Stews", "Tomato"], "recipeIngredient": ["8 red bell peppers (about 4 1/2 pounds; 2kg), stemmed, cored, and cut into roughly 1/2-inch dice", "9 tablespoons (135ml) red palm oil, divided", "Kosher salt", "12 medium cloves garlic (about 1 head), roughly chopped", "6 large plum tomatoes (about 1 3/4 pounds; 800g), cored and quartered", "4 Fresno chili peppers (about 2 ounces; 55g), stemmed, seeded, and cut into roughly 1/2-inch dice (see note)", "4 habanero or Scotch bonnet peppers (about 1 ounce; 30g), stemmed, seeded, and cut into roughly 1/2-inch dice (see note)", "2 large red onions (about 1 3/4 pounds; 800g), peeled and cut into roughly 1/2-inch dice", "One 2-inch segment peeled fresh ginger (about 3/4 ounce; 20g), roughly chopped", "1 quart (1L) <a href=\"https://www.seriouseats.com/recipes/2014/10/best-rich-easy-white-chicken-stock-recipe.html\">homemade chicken stock</a> or store-bought, low-sodium broth, or <a href=\"https://www.seriouseats.com/recipes/2015/11/quick-and-easy-vegetable-stock-recipe.html\">vegetable stock</a>", "9 tablespoons (135ml) canola or other neutral oil", "1/2 teaspoon Nigerian curry powder, such as Lion's Brand, or more to taste (optional, see note)", "Ground Cameroon pepper, to taste (see note)", "4 pounds (1.8kg) cooked bone-in chicken (optional)", "Torn fresh basil leaves, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400&deg;F (200&deg;C) and set oven racks in the top- and bottom-third positions. Line two rimmed baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss red bell pepper with 2 tablespoons (30ml) palm oil. Season with salt. Transfer in an even layer to one of the rimmed baking sheets. In the same large bowl, toss the garlic, tomato, Fresno chili, habanero, onion, and ginger with 4 tablespoons (60ml) palm oil. Season with salt. Transfer in an even layer to the other rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the vegetables, stirring and rotating baking sheets once or twice during cooking, until all are tender, some of their juices have cooked off, and they are charred in spots, about 45 minutes for the red bell peppers and 30 minutes for the tomatoes, chilies, and onions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape all of the roasted vegetables into a blender jar and blend until either a chunky or smooth purée forms (the consistency of your obe ata is up to you; we like a smoother sauce for when it is used for stews and a chunkier one when it is used as a dip or condiment)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer vegetable purée to a Dutch oven. Stir in chicken stock, remaining 3 tablespoons (45ml) palm oil, canola oil, curry powder, and Cameroon pepper. Bring to a simmer. Season lightly with salt, then simmer until sauce is reduced to a good stew-like thickness that can coat pieces of meat well, about 1 hour. If desired, season with additional curry powder and/or Cameroon pepper to meet your desired flavor and spice level."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If serving with chicken, add cooked chicken to the Dutch oven and simmer until chicken is warmed through, about 15 minutes. Serve with warm rice and garnish with torn basil leaves, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Alternatively, you can continue to cook down the sauce until it thickens to a dip-like consistency, about 3 hours; the oils will break from the sauce in this time and fry the vegetable purée, deepening its flavor further."}]}