{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/02/20200128-juk-korean-rice-porridge-vicky-wasik-6.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Korean", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "2"}, "name": "Korean Chicken and Rice Porridge (<em>Dak Juk</em>)", "link": "https://www.seriouseats.com/recipes/2020/03/korean-chicken-and-rice-porridge-dak-juk.html", "description": "Warm, comforting, and deeply satisfying, this Korean rice porridge is loaded with shredded chicken, tender grains of rice, and lots of finely minced vegetables&mdash;perfect for when you're sick, and when you're not.", "totalTime": "2 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Chicken", "Dairy-Free", "Korean", "Rice", "Soups and Stews", "Stovetop"], "recipeIngredient": ["1 cup (7 1/2 ounces; 215g) short-grain rice", "1 small (3-pound; 1.3kg) whole chicken", "8 medium cloves garlic, 6 whole and 2 finely minced, divided", "One 1-inch piece fresh ginger (10g), peeled", "3 scallions, ends trimmed, white and light green parts reserved for broth, green tops sliced thin on a bias, divided ", "1 tablespoon plus 2 teaspoons (25ml) toasted sesame oil", "1 small (4-ounce; 115g) carrot, very finely minced", "1/2 small (6-ounce; 160g) white onion, very finely minced", "1/2 medium (7-ounce; 200g) zucchini or Korean summer squash, very finely minced", "Kosher or sea salt", "Toasted sesame seeds, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, cover rice with at least 2 inches cold water and soak for 1 hour. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large Dutch oven or similarly sized pot, combine chicken, whole garlic cloves, ginger, and scallion whites with 2 quarts (2L) cold water. Bring to a simmer, then cover and cook at a gentle simmer until thickest part of breast close to bone registers 150&deg;F (66&deg;C) on an instant-read thermometer and joint between thighs and body registers at least 175&deg;F (80&deg;C), about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer chicken to work surface and let stand until cool enough to handle. Set a fine-mesh strainer over a medium heatproof bowl and strain broth through it; discard solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart saucier or saucepan, heat sesame oil over medium heat until shimmering. Add drained rice and cook, stirring frequently, until a sticky film develops on bottom of pot, about 3 minutes. Add carrot, onion, and zucchini and cook, stirring frequently, until vegetables have softened slightly and rice grains are slightly translucent around their edges, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 6 cups (1.4L) strained broth and stir to scrape up any starchy coating on bottom of pan. Bring to a rapid simmer, then cook, stirring occasionally to make sure nothing sticks to bottom of pan, until rice grains are plump and tender and liquid is thickened, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, shred chicken meat, discarding skin and bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add two-thirds of both the chicken meat and scallion greens to juk along with remaining 2 cloves minced garlic and simmer until chicken is warmed through; if juk is thicker than you'd like, thin as desired with remaining broth (or reserve extra broth for another use). Season juk with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle juk into individual serving bowls, garnish with remaining shredded chicken and scallion greens, sprinkle with sesame seeds, and serve."}]}