{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/02/20200128-miyeok-guk-korean-seaweed-soup-vicky-wasik-7.jpg", "author": {"@type": "Person", "name": "Seoyoung Jung"}, "recipeCuisine": "Korean", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Korean Seaweed and Brisket Soup (<i>Miyeok-Guk</i>)", "link": "https://www.seriouseats.com/recipes/2020/03/miyeok-guk-korean-seaweed-and-brisket-soup.html", "description": "Tender seaweed and pieces of beef brisket come together in this warming, comforting, and nutritious Korean soup.", "totalTime": "3 hours", "recipeYield": "Serves 4 to 6", "recipeCategory": ["Beef", "Korean", "Soups and Stews", "Stovetop"], "recipeIngredient": ["1 ounce (30g) dried <em>miyeok</em> seaweed (also sold under the Japanese name <em>wakame</em>)", "3 whole medium cloves garlic plus 3 finely minced medium cloves garlic, divided", "One 1-inch piece fresh ginger (about 1/3 ounce; 10g), peeled", "1/2 of a medium white onion (about 3 ounces; 85g for the half onion)", "12 ounces (350g) beef brisket, washed in cold water", "2 tablespoons (30ml) <em>Joseon ganjang</em> (Korean soup soy sauce; see note), divided", "Kosher or sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, cover seaweed with at least 3 inches cold water and let stand at room temperature until fully softened and hydrated, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a Dutch oven or pot, combine whole garlic cloves, ginger, onion, and brisket with 1 1/2 quarts (1 1/2L) cold water and bring to a boil over high heat. Lower heat to maintain a gentle simmer and cook, covered, until brisket is tender and broth is slightly cloudy, about 2 hours. Using a slotted spoon, remove and discard garlic cloves, ginger, and onion from broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer brisket to a work surface and allow to cool slightly, then slice across the grain into bite-size pieces. Transfer brisket to a small bowl and toss well with 1 tablespoon soy sauce and remaining 3 cloves minced garlic. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain seaweed and squeeze well to remove excess water. Transfer to work surface and roughly chop into bite-size pieces. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return broth to a simmer and add seaweed and seasoned brisket. If the proportion of liquid to solids is too low for your taste, you can top up with water and return to a simmer. Add remaining 1 tablespoon soy sauce and simmer until seaweed is tender, about 30 minutes. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle soup into bowls and serve alongside hot rice and any <em>banchan</em> (side dishes) of your choosing."}]}