{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/01/20200107-duck-confit-57-vicky-wasik.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": ["koji"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crispy Koji Duck Confit With Garlicky Duck-Fat Rice and <em>Umeboshi</em>", "link": "https://www.seriouseats.com/recipes/2020/01/crispy-koji-duck-confit-with-garlicky-duck-fat-rice-and-umeboshi.html", "description": "Put your koji duck confit to use for this simple, weeknight rice bowl.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Duck", "Mains", "Quick Dinners", "Recipes", "Rice", "Stovetop"], "recipeIngredient": ["4 legs <a href=\"https://www.seriouseats.com/recipes/2020/01/koji-duck-confit.html\">koji duck confit</a>, brought to room temperature and gently removed from fat", "1/4 cup plus 1 teaspoon (65ml) duck fat from koji duck confit, divided", "4 medium cloves garlic (20g), thinly sliced", "4 cups hot cooked rice, preferably short-grain (see note)", "5 <a href=\"https://www.amazon.com/Clearspring-Organic-Japanese-Umeboshi-Plums/dp/B0013G36V0/?tag=serieats-20\">umeboshi</a> (45g), pitted and finely minced (see note)", "1/4 cup (15g) roughly chopped fresh cilantro leaves and tender stems", "1 tablespoon (6g) toasted white or black sesame seeds, plus more for garnish", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently pat duck skin dry with paper towels. Heat a large nonstick skillet over medium-low heat for 2 minutes. Add 1 teaspoon (5ml) duck fat to skillet, and spread with a paper towel until no visible fat remains. Add duck legs to skillet, skin-side down, and cook, using a weight or small cast iron skillet to press down on the duck legs for even browning and crisping of the skin. Cook, checking and shifting duck legs occasionally to ensure even browning of the skin, until skin is deeply browned and crisp, 8 to 10 minutes. Carefully flip duck legs over, and continue to cook until meat is warmed through, 1 to 2 minutes. Transfer duck legs to a plate or rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat remaining 1/4 cup (60ml) duck fat in a small saucepan or skillet over medium heat until shimmering. Add garlic and cook, stirring constantly, until garlic softens, becomes very aromatic, and turns lightly golden, 30 seconds to 1 minute. Pour contents of saucepan over the cooked rice, and, using a rice paddle or rubber spatula, stir to incorporate garlic and evenly coat rice with duck fat. Add umeboshi, cilantro, and sesame seeds to rice, and stir to combine. Season with salt to taste. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide rice evenly between serving bowls, followed by duck legs. Sprinkle with sesame seeds, and serve."}]}