{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/02/20200117-wok-hei-hack-vicky-wasik-24.jpg", "author": {"@type": "Person", "name": "Tim Chin"}, "recipeCuisine": "Chinese", "keywords": ["wok"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stir-Fried Cucumbers With Trumpet Mushrooms and Torch <em>Hei</em>", "link": "https://www.seriouseats.com/recipes/2020/02/stir-fried-cucumbers-with-trumpet-mushrooms-and-torch-hei.html", "description": "A blowtorch adds smoky <em>wok hei</em> to this vegetarian stir fry of mushrooms, cucumber, and fermented bean curd.", "totalTime": "25 minutes", "recipeYield": "Serves 2 to 3", "recipeCategory": ["Chinese", "Cucumber", "Mushrooms", "Stir Frying", "Stovetop"], "recipeIngredient": ["2 English cucumbers (1 pound; 450g)", "Kosher salt", "2 tablespoons (30ml) vegetable oil", "10 ounces (280g) king trumpet mushrooms, halved lengthwise and cut into 1-1/2 inch pieces", "1 garlic clove (5g), minced", "1 teaspoon (6g) fermented bean curd in sesame oil (see note)", "White pepper", "1 teaspoon (2g) toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, halve cucumbers lengthwise, and scrape out seeds using a spoon; reserve seeds in a small bowl. Halve cucumber pieces lengthwise, and then cut cross-wise into 1 1/2-inch pieces. Transfer cucumbers to a medium bowl with 1 teaspoon (4g) salt, and stir until well coated. Let sit until cucumbers release liquid, about 15 minutes. Drain cucumbers, reserving liquid. Strain accumulated liquid in the small bowl with seeds through a fine-mesh strainer into the bowl with reserved liquid from the cucumbers; discard seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok or large carbon steel skillet, heat 1 tablespoon (15ml) oil over high heat until smoking. Add mushrooms and cook, stirring frequently, until browned on most sides, 1 to 2 minutes. Reduce heat to medium, add reserved cucumber liquid, cover, and cook until mushrooms are tender, about 2 minutes. Uncover, return heat to high, and cook, stirring frequently, until liquid is evaporated, about 1 minute longer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 1 tablespoon (15ml) oil and stir in cucumbers. Cook, stirring frequently, until cucumbers begin to brown, about 1 minute. Using blowtorch, hold flame 2 to 3 inches above skillet while stirring constantly, until oil combusts and imparts smoky aroma, about 30 seconds. Stir in garlic and fermented bean curd and cook until fragrant, about 30 seconds longer. Season with salt and pepper to taste. Transfer stir fry to serving platter and sprinkle with sesame seeds. Serve immediately."}]}