{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/02/20200224-MYEOLCHI-BOKKEUM-Stir-fried-anchovy-banchan-vicky-wasik-8.jpg", "author": {"@type": "Person", "name": "Sunny Lee"}, "recipeCuisine": "Korean", "keywords": ["banchan"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Stir-Fried Anchovy Banchan (<em>Myeolchi Bokkeum</em>)", "link": "https://www.seriouseats.com/recipes/2020/03/stir-fried-anchovy-banchan-myeolchi-bokkeum.html", "description": "A classic banchan that packs a ton of flavor into a plateful of little dried fish.", "totalTime": "10 minutes", "recipeYield": "Makes about 1 cup, enough to serve 2 to 3 as a large side dish, or 4 to 6 as a banchan", "recipeCategory": ["Fish", "Korean", "Sides"], "recipeIngredient": ["1 tablespoon (8g) <em>gochugaru</em> (Korean chili flakes) (see note)", "3 tablespoons (45ml) water", "1 teaspoon (5ml) soy sauce", "1 teaspoon (5ml) fish sauce ", "2 tablespoons (30g) <em>gochujang</em> (Korean chili paste) (see note)", "1 medium garlic clove, finely grated", "2 tablespoons (30ml) vegetable oil", "1 cup (50g) Korean dried baby anchovies (see note)", "2 tablespoons (30g) sugar", "1 teaspoon (5ml) toasted sesame oil", "1 tablespoon (10g) sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together gochugaru, water, soy sauce, and fish sauce. Whisk in gochujang and garlic. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an 8-inch nonstick skillet, heat oil over medium heat until shimmering. Add baby anchovies and, using a flexible spatula, stir to evenly coat in oil. Cook, stirring occasionally, until anchovies absorb oil, dry up and smell aromatic, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle sugar over anchovies and continue to cook, stirring frequently, until sugar melts and evenly coats the fish, about 2 minutes. As the sugar begins to caramelize, take care not to let it burn; if sugar begins to scorch, move the pan off the heat or lower the heat while stirring constantly to control the temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add gochujang mixture to skillet, and stir to evenly coat anchovies; return pan to medium heat if it was taken off to prevent sugar from burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, stirring constantly and scraping up any sticky bits on the bottom of the pan, until dressing reduces slightly and evenly glazes anchovies, about 1 minute. Remove from heat, drizzle with sesame oil and sprinkle with sesame seeds, and stir to combine. Divide anchovies between small individual serving bowls and serve, or transfer to airtight container and refrigerate for up to one week."}]}