{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/01/20200107-duck-confit-46-vicky-wasik.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Crispy Duck Confit With Mixed Bitter Greens Salad", "link": "https://www.seriouseats.com/recipes/2020/01/crispy-duck-confit-with-mixed-bitter-greens-salad.html", "description": "Crisp up homemade duck confit, and serve it with a bright and bitter salad for a simple weeknight meal that oozes Parisian bistro charm.", "totalTime": "20 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Duck", "Recipes", "Salads", "Stovetop"], "recipeIngredient": ["4 legs <a href=\"https://www.seriouseats.com/recipes/2020/01/classic-duck-confit-recipe.html\">traditional</a> or <a href=\"https://www.seriouseats.com/recipes/2017/12/sous-vide-duck-confit-recipe.html\">sous vide</a> duck confit, brought to room temperature and gently removed from fat", "1 teaspoon (5ml) duck fat from duck confit", "1 pound (450g) mixed leafy bitter greens, washed and dried (see note)", "<a href=\"https://www.seriouseats.com/recipes/2014/10/simple-vinaigrette-recipe.html\">Simple vinaigrette</a>, for dressing the salad", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently pat duck skin dry with paper towels. Heat a large nonstick skillet over medium-low heat for 2 minutes. Add duck fat to skillet, and spread with a paper towel until no visible fat remains. Add duck legs to skillet, skin-side down, and cook, using a weight or small cast iron skillet to press down on the duck legs for even browning and crisping of the skin. Cook, checking and shifting duck legs occasionally to ensure even browning of skin, until skin is deeply browned and crisp, 8 to 10 minutes. Carefully flip duck legs over, and continue to cook until meat is warmed through, 1 to 2 minutes. Transfer duck legs to a plate or rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, gently toss greens with 2 to 3 tablespoons (30 to 45ml) of vinaigrette, using your hands to lightly and evenly dress greens, adding more vinaigrette as needed. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide salad evenly between individual plates and top with duck legs. Serve."}]}