{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/01/20200102-duck-vicky-wasik-Jus-1.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": ["stock"], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Brown Duck Stock", "link": "https://www.seriouseats.com/recipes/2020/01/brown-duck-stock-recipe.html", "description": "One of the bonuses of breaking down whole birds like ducks is that you get to transform scraps into delicious, homemade stock.", "totalTime": "4 hours", "recipeYield": "Makes about 2 quarts (2L)", "recipeCategory": ["Duck", "Recipes"], "recipeIngredient": ["Bones from <a href=\"https://www.seriouseats.com/2020/01/how-to-butcher-a-duck.html\">breaking down</a> 2 to 3 ducks (2 to 3 pounds; 900g to 1.4kg), cut into 3- to 4-inch pieces", "Vegetable oil, for coating", "1 large (9-ounce; 255g) yellow onion, cut into 2-inch pieces", "2 carrots (4 ounces; 115g), peeled and cut into 2-inch pieces", "2 celery ribs (4 ounces; 115g), cut into 2-inch pieces", "1 cup (240ml) dry red wine (optional)", "1 tablespoon (15ml) tomato paste", "2 sprigs fresh thyme", "2 sprigs fresh parsley", "2 bay leaves", "1 teaspoon (2g) whole black peppercorns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400&deg;F (200&deg;C) with rack set in middle position. In large bowl, toss duck parts with oil until lightly coated on all sides. Then arrange in even layer on a rimmed baking sheet or in a roasting pan; don't clean out bowl. Roast, turning bones once or twice, until beginning to turn golden brown, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss onion, carrot, and celery with oil in now-empty bowl until lightly coated all over. When step 1 is complete, scatter vegetables over and around bones on baking sheet in as even a layer as possible. Continue to roast until bones and vegetables are well-browned, about 30 minutes longer. Set baking sheet aside on counter to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer bones and vegetables to a stockpot, and pour off any accumulated fat from the baking sheet (fat can be strained and reserved with other <a href=\"https://www.seriouseats.com/2020/01/how-to-render-duck-fat-and-make-cracklings.html\">rendered duck fat</a> if desired). Add wine (if using) and tomato paste to baking sheet, and use a wooden spoon or metal spatula to scrape up any browned bits. If not using wine, deglaze baking sheet with a cup of hot water instead. Pour off contents of baking sheet into the stockpot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add thyme, parsley, bay leaves, and peppercorns to stockpot. At this point, stockpot can be covered and refrigerated until you are ready to make stock (keep in mind that stock will simmer for about 3 hours). When ready to cook, add enough cold water to stock pot to cover bones and vegetables by 3 inches. Bring to a boil over medium-high heat, then reduce to simmer. Simmer, occasionally skimming off foam and fat that rises to surface with ladle, until stock is well-flavored, deep reddish brown, and reduced by about a third, 2 1/2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let stock cool slightly, then strain through fine-mesh strainer set over a large heatproof container; discard solids. Use immediately or cool to room temperature before covering and refrigerating or freezing. (When chilled, fat on the surface of stock will solidify, making it easy to remove with spoon)."}]}