{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/01/20200102-duck-Gribenes-Snack-13.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "2"}, "name": "Crispy Duck Cracklings With Za'atar and Sea Salt", "link": "https://www.seriouseats.com/recipes/2020/01/duck-cracklings-recipe.html", "description": "Rendering duck fat gives you the bonus of a delicious, crispy duck skin snack.", "totalTime": "1 hour", "recipeYield": "Serves 3 to 4 as a snack, and yields about 2 cups rendered duck fat", "recipeCategory": ["Duck", "Recipes", "Snacks"], "recipeIngredient": ["2 pounds (900g) duck skin and fat (from 2 whole ducks), cut into 2-inch pieces", "1/2 cup (120ml) water", "1 tablespoon (8g) store-bought or homemade <a href=\"https://www.seriouseats.com/2010/07/spice-hunting-what-is-zaatar-how-to-use.html\">za'atar spice blend</a> (see note), plus extra as desired", "Coarse sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3-quart saucier or saucepan, combine duck skin and fat with water and set over medium-low heat. Cook, stirring occasionally with rubber spatula to prevent skin from sticking to the bottom of the saucepan, until mixture begins to simmer and bubble rapidly, and liquid is cloudy, 10 to 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to cook, stirring occasionally, until fat is fully rendered and turns golden and clear, and bubbles begin to subside, 25 to 30 minutes. Continue to cook until duck skin pieces are golden brown and crisp on all sides, about 5 minutes. Remove from heat and allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a fine-mesh strainer over a heatproof bowl. You can line the strainer with cheesecloth if you have on hand. Strain contents of saucepan through the prepared strainer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately transfer duck skin to a medium bowl, sprinkle with za'atar and season with sea salt to taste. Toss to evenly coat cracklings with spice mixture, adding more za'atar if desired. Transfer cracklings to a serving bowl, and serve right away. Transfer rendered duck fat to an airtight container and refrigerate for up to 6 months or freeze for up to 1 year."}]}