{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/01/20200106-sheet-pan-skirt-steak-fajitas-vicky-wasik7.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Tex-Mex", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4", "ratingCount": "1"}, "name": "Sheet-Pan Skirt Steak Fajitas", "link": "https://www.seriouseats.com/recipes/2020/01/sheet-pan-skirt-steak-fajitas.html", "description": "Cooking fajitas on a sheet pan in the oven allows for a larger serving size than a skillet would offer, and is easier than firing up a grill&mdash;the secret to success is knowing how to use your broiler and other tricks to maximize browning.", "totalTime": "4 hours", "recipeYield": "Serves 4 to 8", "recipeCategory": ["Game Day", "Mains", "Roasting", "Steak", "Tex-Mex"], "recipeIngredient": ["<strong>For the Steak Fajita Marinade:</strong>", "1/2 cup (120ml) soy sauce", "1/2 cup (120ml) fresh lime juice, from 6 to 8 limes", "1/2 cup (120ml) canola or other neutral oil", "1/4 cup (55g) packed light brown sugar", "2 teaspoons ground cumin seed", "2 teaspoons freshly ground black pepper", "1 tablespoon chili powder (see note)", "3 medium cloves garlic, finely minced (about 1 tablespoon)", "2 pounds (900g) trimmed skirt steak (about 1 whole steak; see note), cut crosswise into 5- to 6-inch pieces (<a href=\"http://www.seriouseats.com/2013/06/knife-skills-how-to-trim-skirt-steak.html\">see our detailed trimming instructions here</a>)", "<strong>For the Fajitas:</strong>", "1 large red bell pepper, stemmed, seeded, and cut into 1/2-inch-wide strips", "1 large yellow bell pepper, stemmed, seeded, and cut into 1/2-inch-wide strips", "1 large green bell pepper, stemmed, seeded, and cut into 1/2-inch-wide strips", "1 white or yellow onion, cut into 1/2-inch slices", "12 to 16 fresh flour or corn tortillas, hot (see note)", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2012/01/the-best-basic-guacamole-recipe.html\">guacamole</a>, for serving, if desired", "1 recipe <a href=\"http://www.seriouseats.com/recipes/2013/06/classic-pico-de-gallo-salsa-fresca-recipe.html\">pico de gallo</a>, for serving, if desired", "Sour cream, shredded cheese, and salsa, for serving, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fajita Marinade:</strong> Combine soy sauce, lime juice, oil, brown sugar, cumin, black pepper, chili powder, and garlic in medium bowl and whisk to combine. Transfer 1/2 cup (120ml) marinade to a separate vessel and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Steak:</strong> Place steaks in a gallon-sized zipper-lock bag and add remaining marinade. Seal bag, squeezing out as much air as possible. Massage bag until meat is fully coated in marinade. Lay flat in refrigerator, turning every couple of hours, for at least 3 and up to 10 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>For the Fajitas:</strong> When ready to cook, preheat broiler and position over rack to highest position. If you have a baking steel or stone, set it \r\non the top rack and allow to preheat. If using a baking steel/stone, set a rimmed baking sheet on it to preheat as well; otherwise leave the baking sheet at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove steaks from marinade and blot dry with paper towels. Arrange steaks in an even layer on rimmed baking sheet. Broil, without flipping, until steaks are well charred on top side, about 4 minutes. Broiler strength and oven designs vary greatly, so cooking times will vary as well; keep a close watch. If your broiler heats unevenly, you may need to move the sheet tray around for more even browning. If not using a baking steel or stone, flip steaks and broil for 30 seconds longer (steaks cooked with the help of a baking steel/stone do not need to be flipped and cooked longer). Remove from oven and transfer steaks to a platter to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Switch oven from broil mode to 450&deg;F (230&deg;C). Add red, yellow, and green bell peppers as well as onions to baking sheet. Pour reserved 1/2 cup of marinade all over and toss until evenly coated; using a wooden spoon, scrape up any browned bits on the baking sheet. Arrange peppers and onion in an even layer that covers the baking sheet from edge to edge, then cook, stirring occasionally, until vegetables are tender and browned in spots, about 25 minutes (if your oven heats from the top, you will want to cook the vegetables on a middle rack to avoid excessive scorching and burning). If you're using a baking steel/stone, you can cook the vegetables on it, but keep a closer eye since they run the risk of scorching on the bottom; if this begins to happen, move the sheet pan to another rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice steak into thin strips across the grain; then add back to sheet pan with any juices. Return to oven to warm through; if steaks need additional cooking, leave them an additional minute or two until they've reached the desired doneness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately with hot tortillas, guacamole, <em>pico de gallo</em>, and other condiments, as desired. "}]}