{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/03/20200224-carretteira-pasta-vicky-wasik-9.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Italian", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "", "ratingCount": ""}, "name": "Sicilian-Style Spaghetti <i>Alla Carrettiera</i> (Fresh Tomato and Garlic Sauce)", "link": "https://www.seriouseats.com/recipes/2020/03/sicilian-style-spaghetti-alla-carrettiera-fresh-tomato-and-garlic-sauce.html", "description": "Fresh tomato, basil, olive oil, garlic, red pepper flakes, and breadcrumbs are all you need to whip up this rapid, wonderfully fresh Sicilian pasta sauce.", "totalTime": "25 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Condiments and Sauces", "Italian", "Mains", "Pasta", "Quick and Easy", "Recipes", "Tomato", "Vegetarian"], "recipeIngredient": ["1 pound (450g) plum tomatoes (about 4 tomatoes)", "1/4 cup (60ml) extra-virgin olive oil, plus more for drizzling if needed", "1/4 cup loosely packed, roughly chopped fresh basil leaves", "3 medium cloves garlic, finely minced", "1 large pinch red pepper flakes", "Kosher salt", "1 pound (450g) dried spaghetti", "1/2 cup (1 1/4 ounces; 35g) lightly toasted panko breadcrumbs, divided", "Grated Sicilian Pecorino or ricotta salata, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a paring knife, score an \"X\" on the top side of each tomato and cut out the stem end. In a pot of boiling water large enough to hold the spaghetti, blanch tomatoes until skins just begin to slip off where you scored them, 30 seconds to 1 minute. Using a slotted spoon, remove tomatoes. (Keep the water hot, you'll need it to cook the pasta.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run tomatoes under cold water, then remove and discard skins and seeds. Grate tomato flesh on largest holes of a box grater into a large heatproof mixing or serving bowl; it's okay if some slightly larger pieces of tomatoes remain. Add olive oil, basil, garlic, and red pepper flakes. Stir well and season with salt to taste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return water to a boil and season with salt. Cook spaghetti, stirring frequently, until al dente. When pasta has almost finished cooking, transfer 1/4 cup (30ml) pasta cooking water to tomato mixture and whisk to form an emulsion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, transfer pasta to tomato mixture along with an additional 1/4 cup (60ml) pasta cooking water. Vigorously toss and stir pasta to emulsify sauce and coat noodles. Add half of the breadcrumbs and toss to combine. The pasta should be well coated with creamy, emulsified sauce. If it seems dry, add extra pasta water and olive oil, 1 tablespoon (15ml) at a time, until it reaches the desired consistency. Taste for seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pasta to warmed plates and sprinkle with remaining breadcrumbs. Top with cheese, if desired. Serve right away."}]}