{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/03/20200227-cup-noodle-fried-rice-vicky-wasik-12.jpg", "author": {"@type": "Person", "name": "Daniel Gritzer"}, "recipeCuisine": "Japanese", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.6", "ratingCount": "20"}, "name": "Instant Ramen Fried Rice", "link": "https://www.seriouseats.com/recipes/2020/03/cup-noodle-fried-rice.html", "description": "Sure, a cup of instant noodles is a quick and easy snack for one person. But if you turn it into almost-as-instant fried rice, you can feed more than one mouth. Plus, it's just stupid delicious.", "totalTime": "10 minutes", "recipeYield": "Serves 2 to 3 (4 if you put an omelette on top)", "recipeCategory": ["Appetizers and Hors d'Oeuvres", "Dairy-Free", "Fried Rice", "Japanese", "Mains", "Ramen", "Sides", "Snacks", "Stir Frying", "Stovetop"], "recipeIngredient": ["One 2.5-ounce (71g) cup instant ramen noodles, such as Cup Noodles, in flavor of your choice", "Boiling water", "3 tablespoons (45ml) canola oil or other neutral oil", "1 large egg, beaten", "1 cup (7 3/4 ounces; 220g) cooked medium- or short-grain rice (see note)", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer contents of instant noodles cup (dried noodles plus all seasonings and mix-ins) to a zipper-lock bag or mixing bowl. Crush noodles well into roughly rice-size pieces, but don't obsess about it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return crushed noodles and seasonings to cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add just enough boiling water to wet contents of cup but no more than that. Cover and let stand while you continue with the recipe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet, wok, cast iron, or carbon steel pan, heat oil over high heat until shimmering. Add egg and cook, stirring, until just scrambled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice and cook, stirring constantly and breaking up any small lumps, until heated through and glazed in the oil, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add soaked ramen along with any liquid and cook, stirring and tossing constantly, until excess moisture has cooked off and rice and noodles are lightly golden and toasted, 3 to 4 minutes. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a serving platter or pack into a heatproof bowl, then invert bowl on a plate to make a compact mound of rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If a heartier meal is desired, you can whip up a 4-egg omelette following the <a href=\"https://www.seriouseats.com/recipes/2016/08/japanese-omelette-chicken-ketchup-fried-rice-omurice-recipe.html\">instructions in our omurice recipe</a> and unfurl it on top of the mound of rice; top with ketchup and anything else you want (nori flakes are shown here) before serving."}]}