{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/01/20200107-duck-confit-44-vicky-wasik.jpg", "author": {"@type": "Person", "name": "Sasha Marx"}, "recipeCuisine": "French", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Traditional Duck Confit", "link": "https://www.seriouseats.com/recipes/2020/01/classic-duck-confit-recipe.html", "description": "For this classic French preparation, duck legs are cured overnight before being submerged in duck fat and gently cooked until silky and tender in a low oven.", "totalTime": "4 hours, plus 24 hours resting time", "recipeYield": "Makes 4 duck legs (serving 4; see note)", "recipeCategory": ["Duck", "French", "Recipes"], "recipeIngredient": ["4 duck legs (about 2 1/4 pounds total; 1kg) (see note)", "1 tablespoon plus 1 teaspoon (16g) Diamond Crystal kosher salt; ; for table salt, use about half as much by volume or the same weight", "6 large shallots (12 ounces; 340g), quartered", "1 small onion (4 ounces; 110g), cut into 2-inch pieces (see note)", "6 medium cloves garlic (30g)", "1/2 bunch (2 ounces; 55g) flat-leaf parsley leaves and tender stems, roughly chopped", "10 sprigs fresh thyme", "2 teaspoons (6g) whole black peppercorns", "2 to 4 cups (475 to 950ml) <a href=\"https://www.seriouseats.com/2020/01/how-to-render-duck-fat-and-make-cracklings.html\">rendered duck fat</a> (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>The Day Before Cooking Confit:</strong> Season duck legs evenly on all sides with salt; set aside. Combine shallots, onion, garlic, and parsley in food processor bowl and pulse until finely chopped but not puréed, about 15 pulses."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer half the vegetable mixture to a nonreactive container that can fit duck legs snugly, such as a baking dish, and spread in an even layer. Scatter half the thyme sprigs and peppercorns over vegetable mixture, then arrange duck legs skin-side up in an even layer on top, pressing them into vegetable mixture. Distribute remaining thyme sprigs and peppercorns over duck legs, followed by the vegetable mixture, spreading it evenly so legs are well-coated. Cover tightly with plastic wrap and refrigerate for at least 24 hours and up to 48 hours.</p>\r\n<p>Alternatively, combine duck legs, vegetable mixture, thyme, and peppercorns in a 1-gallon zipper-lock bag. Seal bag, pressing out as much air as possible. Massage bag until duck legs are evenly coated on all sides. Lay bag flat on rimmed baking sheet and refrigerate for at least 24 hours and up to 48 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>When Ready to Cook:</strong> Adjust oven rack to center position and preheat oven to 225&deg;F (105&deg;C). Melt duck fat, either in 3-quart saucier over low heat or in a microwave-safe bowl in the microwave. Remove duck legs from cure, wiping away as much of the cure mixture as possible before rinsing legs gently under cold water to remove all seasonings; discard cure. Pat duck legs dry with paper towels, then arrange in single layer in saucier with duck fat (if using), making sure they are completely submerged in fat. Alternatively, arrange duck legs snugly in a small baking dish and cover with melted duck fat, making sure legs are fully submerged in fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover saucier or baking dish with lid or aluminum foil, and transfer to oven. Cook until duck is completely tender and meat shows almost no resistance when pierced with a paring knife, and skin has begun to pull away from bottom of the drumstick, 3 1/2 to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and cool duck to room temperature in its cooking vessel, removing lid but keeping it submerged in fat. Once cool, cover container tightly and transfer to refrigerator, where confit can be stored for up to 1 month."}]}