{"@context": "http://schema.org", "@type": "Recipe", "nutrition": {}, "image": "https://www.seriouseats.com/2020/01/20191203-donburi-rice-bowl-vicky-wasik-12.jpg", "author": {"@type": "Person", "name": "Sho Spaeth"}, "recipeCuisine": "Japanese", "keywords": [], "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5", "ratingCount": "1"}, "name": "Beefsteak Donburi (Japanese Rice Bowl) With Spinach", "link": "https://www.seriouseats.com/recipes/2020/01/beefsteak-donburi-japanese-rice-bowl-with-spinach.html", "description": "A well-seasoned rice bowl topped with tender strips of ribeye steak and sautéed spinach, along with shredded nori and fried garlic nubs to provide interesting texture and flavor.", "totalTime": "30 minutes", "recipeYield": "Serves 4", "recipeCategory": ["Beef", "Japanese", "Mains", "Quick and Easy", "Quick Dinners", "Rice", "Stovetop"], "recipeIngredient": ["1 tablespoon (15ml) canola or other neutral cooking oil", "9 medium cloves garlic, 8 halved (larger cloves can be cut into thirds) and 1 minced, divided", "One 10-ounce (280g) bunch spinach, thoroughly washed and spun dry", "Kosher salt", "1/2 teaspoon (2.5ml) toasted sesame oil", "1/2 teaspoon (2.5ml) rice vinegar", "2 ribeye steaks, each about 1/2 inch thick (about 12 ounces; 370g) (see note)", "1/4 teaspoon (1ml) mayonnaise (optional)", "1/4 cup (60ml) sake", "1/4 cup (60ml) dashi, either <a href=\"https://www.seriouseats.com/2018/07/why-you-should-keep-instant-dashi-in-your-pantry.html\">instant</a> or <a href=\"https://www.seriouseats.com/recipes/2016/07/basic-japanese-dashi-recipe.html\">homemade</a> (see note)", "1/4 cup (60ml) soy sauce", "2 tablespoons (30ml) mirin", "1/2 teaspoon cornstarch, dissolved in 1 tablespoon (15ml) water", "1 tablespoon (15g) unsalted butter", "<strong>To Serve</strong>:", "6 cups cooked short-grain Japanese rice (see note)", "<em>Kizami</em> nori (optional; see note)", "2 scallions (1.5 oz; 43g), thinly sliced on a bias", "<em>Kizami beni shoga</em> (pickled ginger strips) (optional; see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 10-inch cast iron skillet, heat oil over medium heat until just starting to shimmer. Add sliced garlic and cook, stirring frequently, until garlic is golden brown all over, about 7 minutes, taking care not to let any garlic pieces burn. Remove garlic and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add spinach to skillet, season with salt, and cook, tossing frequently, until wilted and mostly dry, about 5 minutes. Turn off heat, add remaining minced garlic, and stir until minced garlic becomes fragrant, about 30 seconds. Add sesame oil and vinegar and toss to combine. Transfer spinach to plate and wipe out the skillet with clean kitchen towel (no need to wash)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return skillet to medium-high heat and heat until just starting to smoke. Meanwhile, rub one surface of each steak with the mayonnaise, if using (if not, proceed with recipe). Season steaks with salt, then add to skillet (if rubbed with mayonnaise, put the steaks mayo-side down). Cook, without touching, until well-browned, about 2 minutes. Flip steaks and cook for 1 minute longer. Transfer steaks and let rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add sake to skillet and cook, scraping up any brown bits on the bottom of the skillet, until sake no longer smells of alcohol, about 1 minute. Add dashi, soy sauce, mirin, and reserved sliced garlic. Bring liquid to boil, then reduce heat to medium-low and let simmer until slightly reduced and garlic cloves are fully cooked, about 4 minutes. Add cornstarch slurry in small increments to the skillet, pausing between each addition to let the mixture thicken a bit. When sauce has thickened slightly (you may not need all the slurry), turn off heat and add butter to pan, swirling and stirring until it is fully melted and incorporated into the sauce. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<strong>To Assemble the Bowl:</strong> Place a shy 1 1/2 cups of rice into each serving bowl. Top with kizami nori (if using). Slice steaks into 1/2-inch strips and distribute evenly in each bowl. Spoon sauce over rice and steak. Distribute cooked spinach and garlic cloves evenly in each bowl. Garnish with sliced scallions and pickled ginger (if using). Serve, passing any extra sauce alongside."}]}