{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2006/11/chocolate-chip-sour-cream-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, chocolate, everyday cakes, photo", "name": "Chocolate Chip Sour Cream Coffee Cake", "author": {"@type": "Person", "name": "Source: A family recipe"}, "description": "There’s no coffee in this cake — by “coffee cake,” we mean something you’d serve with afternoon coffee — just lots and lots of sour cream. Yes I’ve made it with plain yogurt instead. I’ve even made it with low-fat yogurt. But mostly I make it as my grandmother and her sisters did, and am glad I did. Every time I make this, I’m convinced there’s too much cinnamon-sugar and chocolate chips on each layer and each time it comes out of the oven and we try it, I am so glad I didn’t touch the amounts. It’s perfect.", "totalTime": "P0DT1H0M0S", "recipeYield": "24", "recipeIngredient": ["1/2 cup unsalted butter (4 ounces or 115 grams) at room temperature", "1 1/2 cups (300 grams) granulated sugar", "3 large eggs, separated", "1 1/2 teaspoons vanilla extract", "2 cups (16 ounces) sour cream", "3 cups (390 grams) all-purpose flour", "1 teaspoon baking powder", "1 1/2 teaspoons baking soda", "3/4 teaspoon fine sea or table salt", "2 cups or 12 ounces semi- or bittersweet chocolate chips", "1/2 cup (100 grams) granulated sugar", "1 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350°F (175°C). Butter a 9-x-13-inch baking pan and line the bottom with parchment paper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, cream butter and 1 1/2 cups granulated sugar. Beat in egg yolks and vanilla. Whisk flour, baking soda, baking powder and salt together into a separate bowl. Alternately mix in sour cream and then dry ingredients into butter mixture until both are used up and the batter is smooth and very thick. In a medium bowl with clean beaters, beat eggs whites until stiff, then fold gently into batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small dish, combine the cinnamon and remaining 1/2 cup granulated sugar for filling and topping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread half the cake batter in the bottom of prepared pan and spread smooth. Sprinkle with half of cinnamon-sugar mixture and 1 cup of chocolate chips. Dollop remaining cake batter over filling in spoonfuls. Use a rubber or offset spatula to gently spread it over the filling and smooth the top. Sprinkle batter with remaining cinnamon-sugar and remaining chocolate chips. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 40 to 50 minutes, rotating halfway through, until a tester inserted into the center of the cake comes out clean. Let cool in pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: I do *not* cover this when storing it (at room temperature because) I don’t want to lose the crackly top."}], "link": "https://smittenkitchen.com/2006/11-chocolate-chip-sour-cream-cake"}