{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/doughy-delights1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, photo", "name": "Fougasse Provençale", "author": {"@type": "Organization", "name": "\nAdapted from Nick Malgieri at The Institute of Culinary Education"}, "description": "<p>Fougasse, or ladder bread, is typical in southern France. Herbes de Provence include marjoram, oregano, thyme, tarragon and savory. It is almost possible to purchase a ready-mixed version containing lavender and fennel, giving the bread an almost perfumed quality.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 envelopes yeast", "1/2 cup warm water at 110°F", "8 ounces bacon", "2 cups water, divided", "1 tablespoon herbes de provence", "4 3/4 – 5 3/4 cups bread flour", "1 cup whole wheat flour", "1 tablespoon salt", "1.\tWhisk yeast into 1/2 cup warm water and set aside.", "2.\tChop bacon and saute until lightly browned. Do not overcook. Remove bacon, place on absorbent paper and blot off grease. Reserve and refrigerate 4 tablespoons of the bacon fat. (Butter can be used as a replacement if your, um, lard quantity comes up short.)", "3.\tBring 1 cup of water to a boil, remove from heat and add herbs. Steep 15 minutes and add 1 cup cold water.", "4.\tCombine flours and rub in solidified bacon fat until completely incorporated.", "5.\tMake a well with the flour and add salt, herb/water mixture and yeast/water mixture. Form a dough and knead smooth.", "6.\tPlace in an oiled bowl, cover and ferment until doubled. Deflate and knead in bacon. Cover dough and let rest 10 minutes.", "7.\tDivide into 3 or 4 pieces. Place the first piece of dough in a lightly floured work surface and gently press and stretch it into a slightly elongated half-oval that measures about 8 inches across at the base. Transfer it to a parchment lined pan. Repeat with the remaining pieces of dough.", "8.\tUse a pizza wheel to cut 2 slashes down the center of the half-oval, and 3 or 4 diagonal slashes on either side of the center slashes.", "9.\tCover the fougasse with a towel a repeat with the remaining dough.", "10.\tLet the fougasses rest for about 10 minutes, and then gently pull in both directions to make the fougasse a couple inches wider and longer, opening up the slashes. Proof 100%.", "11.\tBake at 450°F with steam for 20 to 30 minutes.", "<b>Rustic White Bread</b>", "Adapted from Nick Malgieri at The Institute of Culinary Education"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Rustic White Bread</b><br/>\nAdapted from Nick Malgieri at The Institute of Culinary Education</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>From Nick: This bread reminds me of the rough country bread found throughout France and Italy. I like to shape it into a thick baguette (long loaf) to get the most crust. I also sprinkle the loaves heavily with flour after they are formed – this keeps them from crusting during the rising and also gives the baked loves an appetizing appearance.</i></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups warm tap water, about 110 degrees<br/>\n2 1/2 teaspoons (1 envelope) active dry yeast<br/>\n5 1/4 to 5 1/2 cups unbleached, all-purpose flour<br/>\n4 teaspoons salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/3 cup flour for dusting the loaves<br/>\nCornmeal for the pans<br/>\n2 small cookie sheets or a large (at least 11×17-inch) jelly roll pan</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1.\tTo make the dough, in a 3-quart mixing bowl place water and sprinkle yeast on surface, allowing it to stand for two minutes before whisking. Add the smaller amount of flour and salt stiffing with a rubber spatula until it forms a ball. Knead the dough by hand for 8 to 10 minutes until the dough is smooth, adding more flour if dough is too soft.<br/>\n2.\tTo mix the dough in the food processor, place the smaller amount of flour and salt in work bowl fitted with metal blade, adding water and yeast. Pulse repeatedly until dough forms a ball (if dough will not form a ball, add remaining flour a tablespoon at a time, and pulse until ball forms. Let dough rest 5 minutes, then let machine run continuously for 20 seconds.<br/>\n3.\tTo mix dough in a heavy-duty mixer, place smaller amount of flour and salt in bowl of mixer fitted with a dough hook. Add water and yeast and mix on low speed to form a smooth, elastic and slightly sticky dough, about 5 minutes. Incorporate the remaining flour a tablespoon at time if the dough is too soft.<br/>\n4.\tPlace dough in an oiled bowl (you may need to use a scraper) and turn dough over so top is oiled. Cover bowl with plastic wrap and allow dough to rise at room temperature until doubled. If you wish to interrupt the process, let the dough begin to rise, then punch it down, cover it tightly and refrigerate. When you are ready to proceed, bring back to room temperature until it begins rising again.<br/>\n5.\tTo shape loaves, scrape risen dough onto a lightly floured surface and press it to deflate it. Divide dough in half and shape one piece at a time. Press dough into a square, then roll it up tightly. Rotate cylinder of dough 90 degrees and roll up again from short end. Arrange dough seam side down, cover with plastic or a towel and let it rest of 5 minutes. Repeat with remaining piece of dough.<br/>\n6.\tDust pan with cornmeal. Roll each piece of dough under palms of your hands to elongate it. Work from middle of loaf outward, pointing the ends slightly. Place loaves seam side down on cookie sheets and dust each loaf heavily with flour, using about 1/3 cup in all. Cover with plastic or a towel and allow to rise until doubled.<br/>\n7.\tAbout 30 minutes before you intend to bake the loaves, preheat oven to 500 degrees and set racks at the middle and lowest levels. Set a pan on the lowest rack to absorb some of the excess bottom heat and keep the bottom of the loaves from burning.<br/>\n8.\tHolding a razor blade or the point of a very sharp knife at a 30-degree angle to the top of each loaf, make 3 to 4 diagonal slashes in each loaf. Immediately place loaves in oven and lower temperature 450 degrees.<br/>\n9.\tAfter loaves have baked for 20 minutes and are completely risen, lower temperature to 350 degrees and continue baking about 20 to 30 minutes longer, until bread reaches an internal temperature of about 220 degrees. Remove loaves from oven and cool on a rack.</p>"}], "link": "https://smittenkitchen.com/2006/09-doughy-delights"}