{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2006/11/zucchini-ham-and-ricotta-fritters.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "lunch, pancakes, photo, zucchini", "name": "Zucchini, Ham, and Ricotta Fritters", "author": {"@type": "Person", "name": "Source: Adapted from Donna Hay Magazine, Issue 29"}, "description": "I updated this recipe in 2019 to reflect the changes I’ve made over the years — it’s now a one-bowl recipe, the measurements are more precise, and a few additional swaps are suggested. It originally called for 1 cup of self-rising flour; since it’s rare we use that on SK, the flour, baking powder, and half the salt replace what that 1 cup would contain. What remains is that this is a great formula for a simple dinner pancake, even if you swap in different ingredients with quick cooking times.", "totalTime": "P0DT0H15M0S", "recipeYield": "2 to 4", "recipeIngredient": ["1 1/2 tablespoons (20 grams or 3/4 ounce) unsalted butter", "1/3 cup (2 1/2 fluid ounces) milk, any kind", "1/2 cup ricotta cheese", "2 large eggs", "1 1/2 teaspoons baking powder", "1/2 teaspoon fine sea salt", "Freshly ground black pepper", "1 cup (130 grams) all-purpose flour", "1/4 cup torn basil leaves (I use roughly chopped baby spinach here instead)", "About 3 ounces (85 grams) cured ham, torn or cut into strips", "1/2 a smallish zucchini (about 3 ounces), cut into matchsticks", "Vegetable or olive oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in the bottom of a large bowl in the microwave. Whisk in milk and ricotta until smooth. Whisk in eggs until combined. Add baking powder, salt, and many grinds of black pepper and whisk very well, until thoroughly combined. Switch to spoon and add flour; stir until combined. Stir in basil, ham, and zucchini until evenly distributed in batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a small skillet (I use a 6-inch cast iron here) over medium and add 1 tablespoon of oil. Heat oil and then spoon in one-third to half (depending on the size of your skillet; I use one-third for a 6-inch here) of your batter and spread it in one layer. Reduce heat to medium-low and cook, shimmying pan a little to ensure it’s not sticking, until lightly brown underneath, about 4 to 5 minutes. Flip pancake and cook until golden brown on the second side, another 4 minutes, and slide onto a serving plate. Repeat with additional oil and remaining batter. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Note: These pancakes tend to be a little tricky to cook through, especially when thick. If mine are still loose in the middle once outside is the right color, I’ll finish them in a 350 degree oven for 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut into wedges to serve."}], "link": "https://smittenkitchen.com/2006/11-zucchini-ham-ricotta-fritters"}