{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2006/10/wild-mushroom-and-stilton-galette.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "mushrooms, photo, tart, thanksgiving, vegetarian", "name": "Mushroom and Stilton Galette", "author": {"@type": "Person", "name": "Source: Williams-Sonoma Seasonal Celebration Series, Autumn"}, "description": "2019 updates: I’ve sped up the galette dough process, putting it in line with my other galette recipes. As for the mushrooms, I buy a pound of whatever looks good. Sometimes I’ll use a full pound of brown (cremini) and it works as well.", "totalTime": "1 hour plus rest time", "recipeYield": "6", "recipeIngredient": ["1 1/4 cups all-purpose flour", "1/4 teaspoon salt", "8 tablespoons (1/2 cup, 4 ounces, or 115 grams) unsalted butter, cut into pieces", "1/4 cup sour cream or plain yogurt", "2 teaspoons lemon juice", "1/4 cup ice water", "1/4 ounce dried wild mushrooms, such as chanterelles, porcini or shiitakes", "1 cup boiling water", "2 tablespoons unsalted butter", "3/4 cup sliced green onions", "1 garlic clove, minced", "1/2 teaspoon chopped fresh rosemary", "1/2 teaspoon chopped fresh thyme", "1/2 pound assorted fresh wild mushrooms, such as chanterelles, porcini and shiitakes, brushed clean and large mushrooms thinly sliced", "1/2 pound fresh button mushrooms, brushed clean", "5 ounces Stilton or other good-quality blue cheese", "1 large egg yolk, whisked with 1/2 teaspoon water (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: Whisk together the flour and salt in a large bowl. Sprinkle bits of butter over dough and using a pastry blender, cut it in until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, whisk together the sour cream, lemon juice and water and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large lumps form. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 to 2 hours, until very cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the filling: Place the dried mushrooms in a small bowl and add the boiling water. Let stand for 30 minutes until softened. Drain the mushrooms and mince finely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400°F."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan over medium heat, melt the butter. Add the green onions and sauté, stirring occasionally, until soft, about 5 minutes. Add the garlic, rosemary and thyme and continue to cook, stirring, for 1 minute more. Increase the heat to high, add the fresh and rehydrated mushrooms, and sauté until the mushrooms are tender and the liquid they released has completely evaporated, 8 to 10 minutes. Transfer to a plate and let cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured work surface, roll out the dough into a 12-inch round. Transfer to an ungreased baking sheet. Crumble the blue cheese into a bowl, add the cooled mushrooms and stir well. Spread the mixture over the dough, leaving a 1 1/2-inch border. Fold the border over the mushrooms and cheese, pleating the edge to make it fit. The center will be open."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’d like, brush the outside of the dough with the egg wash for a deeper, shinier color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden brown, 30 to 40 minutes. Remove from the oven, let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Galette keeps well in the fridge for 4 to 5 days."}], "link": "https://smittenkitchen.com/2006/10-wild-mushroom-stilton-galette"}