{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2006/10/easiest-baked-mac-and-cheese.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "pasta, photo", "name": "Easiest Baked Macaroni and Cheese", "author": {"@type": "Person", "name": "Source: Adapted from the New York Times, 1/4/06"}, "description": "Updated in 2019: I’ve made a few changes to this recipe over the years. 1. I don’t use cottage cheese anymore (I don’t care for the slight graininess) but basically anything else — most often sour cream. You could also use ricotta (1:1) or for extra luxury creme fraiche or mascarpone — for these two, I use 1/2 cup plus an additional 1/2 cup of milk as a swap for 1 cup cottage cheese. These smoother types of dairy can be hand-stirred, no blender needed. 2. I’ve found you can get away with 3/4 of the cheese for a little less cheddar intensity, should you wish. Finally, as shown in the updated photos, I love baking this in a quiche pan of mine, but it fits best with 75% of the below recipe (i.e. 3/4 cup sour cream, 1.5 cups milk, 2/3 to 3/4 pound (see previous note) cheddar, and 6 ounces of pasta). The baking time is the same.", "totalTime": "P0DT1H20M0S", "recipeYield": "6 (generous) to 8 (side dish) servings", "recipeIngredient": ["2 tablespoons unsalted butter", "1 cup full-fat cottage cheese, sour cream, or see Note up top for other suggestions", "2 cups low-fat or whole milk", "1 teaspoon dry mustard", "Pinch cayenne", "Pinch freshly grated nutmeg (I skipped this)", "1/2 teaspoon fine sea salt", "1/4 teaspoon freshly ground black pepper", "1 pound sharp or extra-sharp cheddar cheese, grated (I usually use one from Cabot), see Note", "1/2 pound uncooked elbow pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375°F and position an oven rack in upper third of oven. Use one tablespoon butter to grease a 9-inch round or square baking pan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using cottage cheese, in a blender, purée cottage cheese, and add milk slowly, until smooth. Blend in mustard, cayenne, nutmeg and salt and pepper together. Pour into large bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using sour cream or another other cottage cheese swap listed above, you can simply whisk it with the milk, mustard, cayenne, nutmeg, salt, and pepper in a large bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Both methods: Reserve 1/4 cup grated cheese for topping and add the rest, along with the uncooked pasta, to milk mixture, stirring to combine. Pour into prepared pan, cover tightly with foil and bake 30 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover pan, stir gently (I honestly forget this half the time), sprinkle with reserved cheese and dot with remaining tablespoon butter. Bake, uncovered, 30 minutes more, until browned. Let cool at least 15 minutes before serving. "}], "link": "https://smittenkitchen.com/2006/10-easiest-baked-mac-and-cheese"}