{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2006/11/chocolate-stout-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, chocolate, photo", "name": "Chocolate Stout Cake", "author": {"@type": "Organization", "name": "\nAdapted from the Barrington Brewery in Great Barrington, MA via Bon Appetit"}, "description": "<p>This recipe was originally intended to make a layer cake of 3 8-inch rounds. Upon many reviewers’ suggestions, I halved it and it fit perfectly in a bundt pan. The halved amount is below, and the icing replaced with a simple ganache.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 cup (235 ml) stout (such as Guinness)", "1 cup (2 sticks, 8 ounces or 230 grams) unsalted butter", "3/4 cup (65 grams) unsweetened cocoa powder (preferably Dutch-process)", "2 cups (230 grams) all purpose flour", "2 cups (400 grams) granulated sugar", "1 1/2  teaspoons baking soda", "3/4 teaspoon salt", "2 large eggs", "2/3 cup (160 grams) sour cream", "6 ounces (170 grams) good semisweet chocolate chips", "6 tablespoons (90 ml) heavy cream", "3/4 teaspoon instant coffee granules", "RECIPE_SUBHED__1<u>Cake prep:</u>", "Preheat oven to 350°F. Butter or spray a bundt pan well; make sure you get in all of the nooks and crannies. (Some people even go so far as to brush the inside of their bundt pans with melted butter–you cannot be too careful!). Bring 1 cup stout and 1 cup butter to simmer in heavy large saucepan over medium heat. Add cocoa powder and whisk until mixture is smooth. Cool slightly. "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cake prep:</u><br/>\nPreheat oven to 350°F. Butter or spray a bundt pan well; make sure you get in all of the nooks and crannies. (Some people even go so far as to brush the inside of their bundt pans with melted butter–you cannot be too careful!). Bring 1 cup stout and 1 cup butter to simmer in heavy large saucepan over medium heat. Add cocoa powder and whisk until mixture is smooth. Cool slightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour, sugar, baking soda, and 3/4 teaspoon salt in large bowl to blend. Using electric mixer, beat eggs and sour cream in another large bowl to blend. Add stout-chocolate mixture to egg mixture and beat just to combine. Add flour mixture and beat briefly on slow speed. Using rubber spatula, fold batter until completely combined. Pour batter into prepared pan. Bake cake until tester inserted into center comes out clean, about 35 minutes. Transfer cake to rack; cool completely in the pan, then turn cake out onto rack for drizzling ganache.* </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Ganache: </u><br/>\nFor the ganache, melt the chocolate, heavy cream, and coffee in the top of a double boiler over simmering water until smooth and warm, stirring occasionally. Drizzle over the top of cooled cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Update 3/25/08: Previously, the instructions suggested that you cool the cake for only 10 minutes in the pan before flipping it out onto a cooling rack and cooling it the rest of the way. After several conversations with readers/test cooks who found that their cake stuck a little, awesome reader Susan tried to cool the cake completely in the pan before releasing it and nothing stuck. I agree that this might be a better way to go.</p>"}], "link": "https://smittenkitchen.com/2006/11-ganached-guinness-goodness"}