{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gutted-and-glutted1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beef, freezer friendly, french, meat, photo", "name": "Potato Latkes", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Updated to add: Latkes have been updated on this site since this recipe was posted (in the earliest months of the site!). These still work just fine, but this version from 2008 has many more tips and a streamlined recipe. It’s what I use these days. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 large baking potato (1 pound), peeled", "1 small onion (4 ounces), peeled", "1/4 cup all-purpose flour", "1 tablespoon matzo meal", "1 large egg, lightly beaten", "1 1/2 teaspoons salt (update: found later on we preferred only one teaspoon salt)", "1/2 teaspoon freshly ground pepper", "Peanut oil, for frying "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 large baking potato (1 pound), peeled<br/>\n1 small onion (4 ounces), peeled<br/>\n1/4 cup all-purpose flour<br/>\n1 tablespoon matzo meal<br/>\n1 large egg, lightly beaten<br/>\n1 1/2 teaspoons salt (update: found later on we preferred only one teaspoon salt)<br/>\n1/2 teaspoon freshly ground pepper<br/>\nPeanut oil, for frying </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor or on a box grater, coarsely shred the potato and onion. Transfer to a colander and squeeze dry. Let stand for 2 minutes, then squeeze dry again. Transfer the potato mixture to a large bowl. Add the flour, matzo meal, egg, salt and pepper and stir to combine. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium skillet, heat 2 tablespoons of vegetable oil until shimmering. Drop packed teaspoons of the potato mixture into the skillet and flatten them with the back of a spoon. Cook the latkes over moderately high heat until the edges are golden, about 1 1/2 minutes; flip and cook until golden on the bottom, about 1 minute. Drain on paper towels. Repeat with the remaining potato mixture, adding more oil to the skillet as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Short Rib Bourguignon</b><br/>\nBouchée, via <a href=\"http://www.epicurious.com/recipes/recipe_views/views/235923\">Gourmet, October 2006</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This is just like beef bourguignon, except it uses short ribs. Any remaining sauce would be great served over egg noodles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes 4 servings (but we doubled it to serve 7)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For short ribs</u><br/>\n4 (8-oz) pieces bone-in beef short ribs<br/>\n1 tablespoon vegetable oil<br/>\n3/4 teaspoon fine sea salt<br/>\n1/2 teaspoon black pepper<br/>\n4 medium carrots, finely chopped<br/>\n1 medium onion, finely chopped<br/>\n2 garlic cloves, finely chopped<br/>\n1 (14-oz) can whole San Marzano tomatoes in juice, puréed<br/>\nin a blender with juice<br/>\n1 1/2 cups dry red wine<br/>\n4 cups brown veal stock or 1/2 cup Demi-Glace Gold concentrate (concentrate requires a dilution ratio of 1:8; 1/2 cup concentrate to 4 cups water)*<br/>\n2 sprigs fresh thyme<br/>\n1 Turkish or 1/2 California bay leaf<br/>\n1 tablespoon Banyuls vinegar or red-wine vinegar<br/>\n1 tablespoon balsamic vinegar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For vegetables</u><br/>\n20 pearl onions (5 oz)<br/>\n1 1/2 tablespoons unsalted butter<br/>\n1 tablespoon Banyuls vinegar or red-wine vinegar<br/>\n2 cups chicken stock or reduced-sodium chicken broth (16<br/>\nfl oz)<br/>\n4 medium carrots, cut diagonally into 1 1/2-inch pieces<br/>\n3 thick bacon slices (preferably applewood-smoked; 1/4 lb total), cut crosswise into 1/4-inch pieces**<br/>\n8 medium fresh white mushrooms, trimmed and quartered lengthwise </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Braise short ribs: </u><br/>\nPut oven rack in lower third of oven and preheat oven to 250»F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat beef dry. Heat oil in a wide (12 inches in diameter) 3- to 5-quart heavy pot over moderately high heat until hot but not smoking, then brown beef on all sides, turning with tongs, about 8 minutes. Transfer to a plate and sprinkle with 1/4 teaspoon sea salt and 1/4 teaspoon pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add chopped carrots, onion, and garlic to oil in pot and cook over moderate heat, uncovered, stirring occasionally, until softened, about 5 minutes. Stir in 1 cup puréed tomatoes (reserve remainder for another use) and bring to a boil over moderately high heat. Add wine and boil, stirring occasionally, until sauce is thickened, about 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add veal stock, thyme, bay leaf, vinegars, and remaining 1/2 teaspoon sea salt and 1/4 teaspoon pepper to sauce, and bring to a simmer. Skim fat from surface, then add beef along with any juices accumulated on plate and cover pot with a tight-fitting lid. Transfer to oven and braise until beef is very tender, 4 to 5 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cook vegetables while beef braises: </u><br/>\nBlanch pearl onions in a wide 2- to 3-quart heavy saucepan of boiling water 1 minute, then drain in a sieve. When just cool enough to handle, peel onions with a paring knife, trimming root end just enough to leave onions intact.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat butter in dried saucepan over moderate heat until foam subsides, then cook onions, stirring occasionally, until brown spots appear, 3 to 5 minutes. Stir in vinegar, then add chicken stock and carrots and bring to a boil. Reduce heat and simmer, covered, until vegetables are tender, 20 to 25 minutes. Uncover and boil, if necessary, until liquid glazes vegetables.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While vegetables are simmering, cook bacon in a 10-inch heavy skillet over moderate heat, stirring occasionally, until lightly browned, 4 to 6 minutes. Add mushrooms and cook, stirring, until mushrooms are tender and bacon is browned and crisp, about 4 minutes. Transfer with a slotted spoon to vegetables in saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble dish: </u><br/>\nTransfer a short rib to each of 4 soup plates and keep warm in oven. Pour sauce through a medium-mesh sieve into a large bowl, pressing on and then discarding solids, then skim fat from sauce. Boil sauce, if necessary, until thickened and reduced to about 3 cups. Season with salt and pepper. Add about 2 cups sauce to vegetables (reserve remaining sauce for another use), then spoon mixture around short ribs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: Ribs can be braised 1 day ahead and cooled completely in sauce, uncovered, then chilled, covered. Remove solidified fat from dish before reheating. This is actually a great way to get rid of nearly all of the excess fat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I couldn’t find veal stock and found the price of demi-glace concentrate at this quantity leaving me questioning whether it was flecked with gold, so I used canned beef broth instead. I’m not sure what we were missing as I haven’t made it the other way, but I can tell you that we didn’t actually <em>miss </em>a thing.<br/>\n** Skipped the bacon, as we’ve got mostly kosher peeps in the family. </p>"}], "link": "https://smittenkitchen.com/2006/12-gutted-and-glutted"}