{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2007/09/lemon-layer-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, citrus, fruit, lemon, photo", "name": "1-2-3-4 Cake", "author": {"@type": "Organization", "name": "\nAdapted from several sources: this cake is a classic"}, "description": "<p>This cake gets its name from its proportion of ingredients: 1 cup butter and milk, 2 cups sugar, 3 cups of flour and 4 eggs, and from cupcakes to layers cakes, as a basic, white cake, it does not fail. </p>", "totalTime": "", "recipeYield": "3 9-inch layers (for the purpose of this cake) or 24 cupcakes (good to know, eh?)", "recipeIngredient": ["1 cup (2 sticks) butter, at room temperature", "2 cups sugar", "4 eggs", "3 cups sifted self-rising flour*", "1 cup milk", "1 teaspoon pure vanilla extract "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup (2 sticks) butter, at room temperature<br/>\n2 cups sugar<br/>\n4 eggs<br/>\n3 cups sifted self-rising flour*<br/>\n1 cup milk<br/>\n1 teaspoon pure vanilla extract </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Using an electric mixer, cream butter until fluffy. Add sugar and continue to cream well for 6 to 8 minutes. Add eggs 1 at a time, beating well after each addition. Add flour and milk alternately to creamed mixture, beginning and ending with flour. Add vanilla and continue to beat until just mixed. Divide batter equally among prepared pans. Level batter in each pan by holding pan 3 or 4-inches above counter, then dropping flat onto counter. Do this several times to release air bubbles and assure you of a more level cake. Bake for 25 to 30 minutes or until a tester or toothpick inserted into the center comes out clean (start checking at 15 minutes if you are making cupcakes).  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Self-rising flour has both salt and baking powder in it, but you can make your own at home with the following formula: 1 cup self-rising flour = 1 cup all-purpose flour, minus 2 teaspoons + 1 1/2 teaspoons baking powder + 1/2 teaspoon salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Lemon Curd</b><br/>\nAdapted from <a href=\"http://www.amazon.com/gp/product/0684818701?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0684818701\">The Joy of Cooking</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>From the Joy of Cooking: This makes a sensation filling for sponge rolls or an Angel Food Cake. You can also marble it into a cheesecake. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8 egg yolks<br/>\n1 1/2 cups sugar<br/>\n1/4 cup (1/2 stick) butter<br/>\n3 lemons, zest grated and juiced<br/>\nPlace the ingredients in the double boiler over boiling water. Don’t let top pan touch the water. Cook and stir until mixture begins to gel or thicken ever-so-slightly. Remove from heat and allow to cool. Cover and refrigerate it to thicken. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This keeps, refrigerated, for about 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Seven-Minute Frosting</b><br/>\nAdapted from <a href=\"http://www.amazon.com/gp/product/0684818701/ref=smitten-20/102-3034700-4923306\">Joy of Cooking</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5 tablespoons water<br/>\n1/4 teaspoon cream of tartar<br/>\n1 1/3 cups sugar<br/>\n2 large eggs whites at room temperature<br/>\n1 tablespoon light corn syrup<br/>\n1 teaspoon vanilla<br/>\n1/2 to 1 cup chopped nuts or shredded sweetened dried coconut (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk first five ingredients together in a large, stainless-steel bowl. Set the bowl in a wide, deep skillet filled with about 1 inch of simmering water. Make sure the water level is at least as high as the depth of the egg whites in the bowl. Beat the whites on low speed until the mixture reaches 140 degrees F on an instant-read thermometer. Do not stop beating while the bowl is in the skillet, or the egg whites will be overcooked. If you cannot hold the thermometer stem in the egg whites while continuing to beat, remove the bowl from the skillet just to read the thermometer, then return the bowl to the skillet, or yell “[Insert your husband/wife/sig-other’s name here]!! Halp! Can you check the temperature of this for me!!!” It might or might not work. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat on high speed for exactly five minutes. Remove the bowl from the skillet and add vanilla, beating on high speed for two to three more minutes to cool. Stir in coconut or nuts, if you are using them. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use this frosting the day it is made.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Lemon Layer Cake Assembly:</b> Add 1 tablespoon of filling to the cake pedestal. Run hands along the side of the cake to remove excess crumbs. Place the cake layers on the pedestal, spreading filling between the layers and on top. Spread the sides and top of the cake with the remaining filling. Frost top and sides of cake with frosting.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Why my cake might look thinner than yours:</b> Or, d’oh!  From the looks of Paula Deen’s cake, I assumed it would be too tall for my cake carrier, and made the third layer into cupcakes instead that I’d save for another occasion. Turns out, the cakes might have been just fine (or, I took out too much batter), so I split them into halves, creating a thin four-layer cake instead. Nobody noticed!</p>"}], "link": "https://smittenkitchen.com/2007/09-layered-lemon-love"}