{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/gazpacho-and-lentil-chorizo-salads1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, photo, picnics, salad, spanish", "name": "Gazpacho Salad", "author": {"@type": "Organization", "name": "\nAdapted from The New Spanish Table"}, "description": "", "totalTime": "", "recipeYield": "Serves 4", "recipeIngredient": ["2 1/2 cups cubed day-old dense country bread (1-inch cubes)", "2 medium-size garlic cloves, chopped", "1 large pinch of coarse salt (Kosher or sea)", "1 small pinch of cumin seeds", "3 tablespoons sherry vinegar, preferably aged, or best-quality red wine vinegar, or more to taste", "1/3 cup fragrant extra-virgin olive oil", "1 2/3 pounds very ripe but firm tomatoes, cut into 3/4-inch cubes", "2 small Kirby (pickling) cucumbers, cored, seeded and diced", "1/2 cup finely chopped white onion", "1/2 cup seedless green grapes, cut in half", "About 1/2 cup slivered fresh mint or basil (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 1/2 cups cubed day-old dense country bread (1-inch cubes)<br/>\n2 medium-size garlic cloves, chopped<br/>\n1 large pinch of coarse salt (Kosher or sea)<br/>\n1 small pinch of cumin seeds<br/>\n3 tablespoons sherry vinegar, preferably aged, or best-quality red wine vinegar, or more to taste<br/>\n1/3 cup fragrant extra-virgin olive oil<br/>\n1 2/3 pounds very ripe but firm tomatoes, cut into 3/4-inch cubes<br/>\n2 small Kirby (pickling) cucumbers, cored, seeded and diced<br/>\n1/2 cup finely chopped white onion<br/>\n1/2 cup seedless green grapes, cut in half<br/>\nAbout 1/2 cup slivered fresh mint or basil (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1.\tPreheat the oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2.\tArrange the bread cubes in a single layer on a large rimmed baking sheet and bake until they are just beginning to turn golden, 8 to 10 minutes, stirring once. Lead the bread cubes cool.<br/>\n3.\tPlace the garlic, salt, and cumin in a mortar and, using a pestle, mash them into a paste. Add the vinegar and olive oil and whisk to mix. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4.\tPlace the toasted bread and the tomatoes, cucumbers, Italian pepper, onion, grapes, and mint, if using, in a large bowl and toss to mix. Add the dressing to the salad and toss to combine well. Let the salad stand for 5 to 10 minutes before serving to allow the bread to soak up the dressing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Lentil Salad with Chorizo and Jamon Crisps</b><br/>\n<a href=\"http://www.amazon.com/gp/product/0761135553?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0761135553\">The New Spanish Table</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serves 4 to 6</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 small onion<br/>\n3 medium-size garlic cloves, peeled<br/>\n3 fresh flat-leaf parsley sprigs, plus 1/4 cup chopped parsley<br/>\n1 bay leaf<br/>\n1 cup green or brown lentils (see Note)<br/>\nExtra-virgin olive oil<br/>\n1/2 pound sweet Spanish-style chorizo sausage, diced medium-fine<br/>\n2 ounces thinly sliced serrano ham or proscuitto<br/>\n2 tablespoon sherry vinegar, preferably aged (we, of course, used more)<br/>\n1 tablespoon best-quality red wine vinegar<br/>\n1 tablespoon chicken stock or broth, or water<br/>\n1 teaspoon honey<br/>\nCoarse salt (kosher or sea) and freshly ground black pepper<br/>\n3 medium-size firm tomatoes, peeled, seeded and chopped<br/>\n1/4 cup finely slices scallions, both white and green parts</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1.\tPlace the onion, garlic, parsley sprigs, and bay leaf in a double layer of cheesecloth and tie it shut.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2.\tPlace the lentils in a medium-size saucepan and add enough cold water to cover them by 3 inches. Bring to a boil over high heat. Skim the foam off thoroughly, add the cheesecloth bag, and reduce the heat to medium low. Simmer until the lentils are tender, 15 to 18 minutes. Drain the lentils. (If you are making the lentils ahead, toss them with a little olive oil. They will keep for up to 2 days, covered, in the refrigerator. Let them come to room temperature before continuing with the recipe.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3.\tHeat 1 tablespoon olive oil in medium-size skillet over medium-high heat. Add the chorizo and cook, stirring, until nicely browned and beginning to crisp, about 5 minutes. Using a slotted spoon, transfer the chorizo to paper towels to drain and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4.\tPour olive oil to a depth of 1/2 inch in a small skillet and heat over medium heat until almost smoking. Add the ham slices, one at a time, and cook until shriveled and crisp about 30 seconds, transferring the cooked slices to paper towels to drain. (Deb warning: This step made our apartment very smoky. Proceed with caution. If you really want to skip this, you could crisp it in the oven instead, on parchment-lined baking sheets.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5.\tPlace 3 tablespoons olive oil, the sherry vinegar, red wine vinegar, chicken stock, and honey in a small microwave-safe bowl and stir to mix. Microwave on high power for 30 seconds, then season the vinaigrette with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6.\tPlace the drained lentils, chorizo, tomatoes, chopped parsley, scallions and warm vinaigrette in a large bowl and toss to mix. Crumble the crisp ham slices into medium-size pieces, toss some with the salad, scatter rest on top, and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: If you are using Spanish pardinas, they will need to soak overnight before being cooked. Goya brand pardinas do not need to be soaked, despite what it says on the package.</p>"}], "link": "https://smittenkitchen.com/2007/10-gazpacho-and-lentil-chorizo-salads"}