{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2007/12/austrian-raspberry-shortbread.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bars, cookie, photo", "name": "Austrian Raspberry Shortbread", "author": {"@type": "Organization", "name": "\nAdapted from Butter Sugar Flour Eggs via Epicurious, which explains the cookie’s back story"}, "description": "<p>I made several adaptations to the original recipe. The first was that although the shortbread is wonderful plain, it is it, indeed, plain. I think a little lemon zest, a splash of vanilla or even both would work deliciously in the dough, and against the raspberry. The suggested baking time is almost half of what I needed to get them solidified and lightly golden in the oven–mine took an hour, in the end, and I do not suggest you take them out before they truly look done. Finally, I knew immediately that raspberry jam could not be spread over a pile of cookie shards, and plopped it into a piping bag with a big tip instead. A zip-lock bag with a 1/2-inch corner cut off would work as well. If your jam is particularly thick, you might want to heat it briefly to liquefy it slightly, though my seedless variety didn’t require this. Finally, with this especially (but also, all bar cookie and brownies), I find that they’re much easier to make clean cuts in when thoroughly chilled in the fridge. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 pound (4 sticks) unsalted butter, slightly softened", "4 egg yolks", "2 cups granulated sugar", "4 cups all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon salt", "Optional additions: 1 teaspoon vanilla extract or 1 teaspoon lemon zest", "1 cup raspberry jam, at room temperature", "1/4 cup confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound (4 sticks) unsalted butter, slightly softened<br/>\n4 egg yolks<br/>\n2 cups granulated sugar<br/>\n4 cups all-purpose flour<br/>\n2 teaspoons baking powder<br/>\n1/4 teaspoon salt<br/>\nOptional additions: 1 teaspoon vanilla extract or 1 teaspoon lemon zest<br/>\n1 cup raspberry jam, at room temperature<br/>\n1/4 cup confectioners’ sugar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cream the butter in a mixer fitted with a paddle attachment (or using a hand mixer) until soft and fluffy. Add the egg yolks and mix well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the granulated sugar, flour, baking powder, and salt together. Add to the butter and egg yolk mixture and mix just until incorporated and the dough starts to come together. Turn the dough out onto a floured work surface and form into two balls. Wrap each ball in plastic wrap and freeze at least 2 hours or overnight (or as long as a month, if you like).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove one ball of dough from the freezer and coarsely grate it by hand or with the grating disk in a food processor into the bottom of a 9×13-inch baking pan or a <s>10-inch tart pan with a removable bottom</s> (oops, sorry, no). Make sure the surface is covered evenly with shreds of dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a piping bag with a wide tip or a zip-lock bag with the corner cut off, squeeze the jam over the surface as evenly as possible, to within 1/2 inch of the edge all the way around. Remove the remaining dough from the freezer and coarsely grate it over the entire surface.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until lightly golden brown and the center no longer wiggles, 50 to 60 minutes. As soon as the shortbread comes out of the oven, dust with confectioners’ sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool on a wire rack, then cut in the pan with a serrated knife. I find that for this an all bar cookies, chilling the pan in the fridge makes it a lot easier to get clean cuts. </p>"}], "link": "https://smittenkitchen.com/2007/12-austrian-raspberry-shortbread"}