{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/some-sweet-for-your-suffering1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "blueberries, fruit, photo, raspberries, strawberries, summer", "name": "Summer Berry Pudding", "author": {"@type": "Organization", "name": "\nAdapted from Cook’s Illustrated, July 1999"}, "description": "<p>CI’s tips: Stale the bread for this recipe by leaving it out overnight. Otherwise, put the slices on a rack in a single layer into a 200-degree oven for 50 to 60 minutes, turning them once halfway through. If you use challah, the second choice for bread, cut it into 1/2-inch-thick slices. If neither potato bread nor challah is available, use good-quality white sandwich bread with a dense, soft texture. To ensure that this larger pudding unmolds in one piece, use a greased loaf pan lined with plastic wrap. Whipped cream is the perfect accompaniment to summer pudding.</p>", "totalTime": "", "recipeYield": "Serves 6 to 8", "recipeIngredient": ["2 pints fresh strawberries rinsed, hulled, and sliced 1  pint  fresh raspberries", "1/2 pint fresh blueberries", "1/2 pint fresh blackberries", "3/4 cup granulated sugar", "2 tablespoons lemon juice from 1 lemon", "8 slices potato bread (stale), challah, or other good-quality white bread "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 pints fresh strawberries rinsed, hulled, and sliced 1  pint  fresh raspberries<br/>\n1/2 pint fresh blueberries<br/>\n1/2 pint fresh blackberries<br/>\n3/4 cup granulated sugar<br/>\n2 tablespoons lemon juice from 1 lemon<br/>\n8 slices potato bread (stale), challah, or other good-quality white bread </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Heat strawberries, raspberries, blueberries, blackberries, and sugar in large nonreactive saucepan over medium heat, stirring occasionally, until berries begin to release their juice and sugar has dissolved, about 5 minutes. Off heat, stir in lemon juice; let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. While berries are cooling, spray a 9 x 5-inch loaf pan with vegetable cooking spray. Following illustrations below, remove crusts from bread slices and trim them to fit in a single layer in the loaf pan (it will take approximately 2 1/2 slices to form one layer). Line the loaf pan with plastic wrap. Make sure the plastic wrap lies flat against the surface of the loaf pan, leaving no air space.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Place the loaf pan on a rimmed cookie sheet and use a slotted spoon to place about 2 cups of fruit into the bottom. Lightly soak enough bread slices for one layer in juice and place on top of fruit. Repeat with two more layers of fruit and bread. Top with remaining juices, cover loosely with plastic wrap, and weight with a second cookie sheet and several heavy cans. Refrigerate puddings for at least 8 and up to 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Remove weights, cookie sheet, and plastic wrap. To unmold, invert onto serving platter. Lift off loaf pan; remove plastic wrap lining and serve.</p>"}], "link": "https://smittenkitchen.com/2007/08-some-sweet-for-your-suffering"}