{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2007/11/2068969108_44aacd5913_b.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, jewish, photo", "name": "Rugelach Pinwheels", "author": {"@type": "Organization", "name": "\nAdapted from the Sweet On You Bakery via The Martha Stewart Show"}, "description": "<p>Rugelach are easily my favorite cookie, but they’re incredibly pesky to make in their traditional shape, which require that multiple circles of dough have to be rolled, spread with warmed jam then dry ingredients, cut into 8 or 16 tiny wedges, each individually rolled into crescents that are brushed with an egg wash and then, just when you thought you were done, sprinkled with more sugar before baking. A-yee. These rugelach use the same exact dough and ingredients, but save you some time by allowing you to roll it into two large logs which can be sliced and baked as needed. Plus, they’re pretty as hell. In the holiday season, I like to make a few logs and keep them in the freezer until needed. Let them warm up at room temperature for 30 minutes for easiest slicing. </p><p>Although apricot jam, raisins and walnuts are traditional, this doesn’t mean that any other jam, dried fruit or nut couldn’t be used as a replacement. We’ve used dried tart cherries instead of raisins because my husband hates raisins so much that I am certain one kicked him or something in a past life. We’ve also used dried currants, which were so tiny they required no additional chopping, and we’ve also swapped half with mini chocolate chips, to please the chocolate obsessives in the house.</p><p>New notes, added 12/22/14: Additional tips to help with rolling, slicing, cooling and restoring shape after baked, if needed. I found that only half of the final cinnamon-sugar was needed for dipping, and have adjusted below accordingly. </p><p>New note, 12/17: I found many ways to streamline and quicken the process of making rugelach dough. Those tips work here for the dough assembly (namely, no softening needed if you have a food processor). You can then continue with the rolling, filling and slicing instructions below.</p>", "totalTime": "", "recipeYield": "Makes about 50 cookies", "recipeIngredient": ["<em>Dough</em>", "1 package (8 ounces) cream cheese, room temperature", "1 cup (2 sticks) unsalted butter, cut into small pieces, room temperature", "1/4 cup granulated sugar", "2 cups sifted unbleached all-purpose flour", "1/4 teaspoon coarse or kosher salt", "<em>Filling</em>", "1/4 cup plus 2 tablespoons granulated sugar", "1/4 cup packed light-brown sugar", "1/2 teaspoon ground cinnamon", "3/4 cup golden raisins, or another dried fruit of your choice, chopped fine", "1 cup finely chopped walnuts or another nut of your choice, toasted first if you’ve got time", "1/2 cup apricots or raspberry preserves, heated and cooled slightly", "<em>Topping</em>", "1/2 cup granulated sugar", "1 1/2 teaspoons ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Topping</em><br/>\n1/2 cup granulated sugar<br/>\n1 1/2 teaspoons ground cinnamon</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cream cheese and butter in the bowl of a food processor and process until smooth and creamy. Add sugar and continue processing until fully incorporated. Add flour and salt and pulse just until dough comes together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Don’t have a food processor? A stand mixer or electric beaters will work just as well. Beat butter and cream cheese together until light and fluffy. Add sugar, beat until combined. Scrape bowl down very well; I find cream cheese likes to leave hidden deposits at the bottom of the bowl. Add salt and flour and mix until just combined, with no flour visible. Divide dough into 2 equal pieces, wrap with plastic wrap, and refrigerate at least 2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, make filling. In a medium bowl, toss together granulated and brown sugars, cinnamon, raisins, and walnuts; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, roll out 1 piece of dough into a rectangle about 1/8-inch thick, roughly 12 or so inches wide. (I find making it wider makes it harder to manage or store.) Spread a thin layer of preserves evenly over dough; sprinkle with filling mixture. Roll dough into a tight log beginning with one of the long sides; wrap in plastic wrap. Transfer dough log baking sheet. Repeat process with remaining piece of dough. Place dough logs in refrigerator; let chill at least 1 hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350 degrees. Line baking sheets with parchment paper; set aside. Mix together the cinnamon and sugar for the topping; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice chilled dough logs crosswise, about 1/4 inch thick. Toss each cookie in the cinnamon-sugar mixture with a fork to easily shake excess off. On the first batch, place cookies 3 inches apart on prepared baking sheets to gauge how much yours will spread; I usually find that I only need them an inch or so apart for the rest of the trays. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until lightly browned, 15 to 20 minutes. When you remove them from the oven, if any “tails” or layers have sprung loose, you can use your fingers to press the cookie back into a round shape. Let rest on baking sheet for another 2 minutes after that, after which they will set in their re-formed shape, before transferring cookies to a cooling rack which has been lightly coated with a nonstick spray. (It helps keep their warm jammy edges from sticking.) Let cool completely on racks. Repeat with remaining pinwheel dough and cinnamon-sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cool, cookies can be packed away and stored in an airtight container at room temperature for two weeks.</p>"}], "link": "https://smittenkitchen.com/2007/11-rugelach-pinwheels"}