{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/creamy-white-polenta-with-mushrooms1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "mushrooms, photo, thanksgiving", "name": "Creamy White Polenta with Mushrooms and Mascarpone ", "author": {"@type": "Organization", "name": "\nAdapted from Jonathan Waxman, via Gourmet, October 2005"}, "description": "", "totalTime": "", "recipeYield": "Just because I found this a little rich doesn’t mean it won’t work for you, but you might consider tweaking the ratios at bit. This makes a lot of grits to a relatively small amount of mushrooms. You could halve the grits or double the mushrooms, for example, or of course keep it like so if you want it to look more like the picture.", "recipeIngredient": ["RECIPE_SUBHED__1<u>For polenta</u>", "4 1/2 cups water", "1 cup coarse stone-ground white grits (preferably organic)", "1/4 cup heavy cream", "2 tablespoons finely grated Parmigiano-Reggiano", "1 teaspoon salt", "1/4 teaspoon black pepper", "RECIPE_SUBHED__2<u>For mushrooms</u>", "1 pound assorted fresh exotic mushrooms such as porcini, oyster, chanterelle, lobster, and hedgehog", "3 tablespoons extra-virgin olive oil", "1 garlic clove, smashed", "1/2 teaspoon salt", "1/4 teaspoon black pepper", "1/4 cup water", "3 tablespoons cold unsalted butter", "1 1/2 tablespoons fresh lemon juice", "1 tablespoon chopped fresh flat-leaf parsley (we used chives)", "RECIPE_SUBHED__3<u>For serving</u>", "1/2 cup mascarpone (though we used crème fraîche, and just a tad)", "2 tablespoons finely grated Parmigiano-Reggiano "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For serving</u><br/>\n1/2 cup mascarpone (though we used crème fraîche, and just a tad)<br/>\n2 tablespoons finely grated Parmigiano-Reggiano </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make polenta:</u> Bring water to a simmer in a 3- to 4-quart heavy saucepan. Add grits in a slow stream, whisking until incorporated. Simmer, stirring occasionally with a long-handled whisk or wooden spoon, until liquid is absorbed and polenta is thick and soft, about 30 minutes. (Grits will have a loose, risotto-like consistency.) Remove from heat and stir in cream, cheese, salt, and pepper. Keep warm, covered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Saute mushrooms while polenta simmers:</u> If using porcini, halve if large, then slice lengthwise into 1/4-inch thick slices. If using oysters, trim spongy base if necessary and slice caps into 1/2-inch-wide strips. If using chanterelles, leave small mushrooms whole, halve if medium, and quarter if large. If using lobsters, cut into 1/2-inch pieces. If using hedgehogs, trim base of stems and halve caps if large.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking, then saute mushrooms, garlic, salt, and pepper, stirring occasionally, until mushrooms are golden and any liquid they give off is evaporated, 6 to 8 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add water, butter, lemon juice, and parsley and heat, swirling skillet, until butter melts and liquid forms a sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To serve:</u> Top each serving of polenta with mushrooms and mascarpone. Serve immediately (polenta stiffens as it cools), sprinkled with Parmigiano-Reggiano.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Note:</u> Mushroom sauce can be made 1 hour ahead and kept, covered, at room temperature. Reheat before using. </p>"}], "link": "https://smittenkitchen.com/2007/11-creamy-white-polenta-with-mushrooms"}