{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/robert-linxes-chocolate-truffles1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "candy, chocolate, elsewhere, photo", "name": "Robert Linxe’s Chocolate Truffles", "author": {"@type": "Organization", "name": "\nGourmet, February 2001"}, "description": "", "totalTime": "", "recipeYield": "Makes about 20 60 truffles.", "recipeIngredient": ["11 ounces Valrhona chocolate (56% cacao)", "2/3 cup heavy cream", "Valrhona cocoa powder for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>11 ounces Valrhona chocolate (56% cacao)<br/>\n2/3 cup heavy cream<br/>\nValrhona cocoa powder for dusting</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop 8 ounces of the chocolate and put in a bowl. Bring heavy cream to a boil in a small heavy saucepan. Make sure your pan is small, so you’ll lose the least amount of cream to evaporation, and heavy, which will keep the cream from scorching. Linxe boils his cream three times — he believes that makes the ganache last longer. If you do this, compensate for the extra evaporation by starting with a little more cream.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the cream over the chocolate, mashing any big pieces with a wooden spoon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Then stir with a whisk in concentric circles (don’t beat or you’ll incorporate air), starting in the center and working your way to the edge, until the ganache is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let stand at room temperature until thick enough to hold a shape, about 1 hour, then, using a pastry bag with a 3/8-inch opening or tip, pipe into mounds (about 3/4 inch high and 1 inch wide) on parchment-lined baking sheets. When piping, finish off each mound with a flick of the wrist to soften and angle the point tip. Freeze until firm, about 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 3 more ounces of the same Valrhona and smear some on a gloved hand. Gently rub each chilled truffle to coat lightly with chocolate.  (The secret to a delicate coating of chocolate is to roll each truffle in a smear of melted chocolate in your hand. Linxe always uses gloves.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the truffles in unsweetened Valrhona cocoa powder so they look like their namesakes, freshly dug from the earth. A fork is the best tool for tossing truffles in cacao. Shake truffles in a sieve to eliminate excess cacao. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store truffles in the refrigerator. </p>"}], "link": "https://smittenkitchen.com/2007/12-robert-linxes-chocolate-truffles"}