{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/11/cranberry-caramel-and-almond-tart1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cranberries, fall, fruit, photo, tarts pies, thanksgiving", "name": "Cranberry, Caramel and Almond Tart", "author": {"@type": "Organization", "name": "\nAdapted Maury Rubin, City Bakery"}, "description": "", "totalTime": "", "recipeYield": "Yields: 1 9-inch tart or 12 4-inch tartlets", "recipeIngredient": ["13 tablespoons (1 stick plus 5 tablespoons) unsalted butter, cut into 1-inch pieces", "1/3 cup powdered sugar", "1 egg yolk", "1 1/2 cups unbleached flour", "1 tablespoon heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>13 tablespoons (1 stick plus 5 tablespoons) unsalted butter, cut into 1-inch pieces<br/>\n1/3 cup powdered sugar<br/>\n1 egg yolk<br/>\n1 1/2 cups unbleached flour<br/>\n1 tablespoon heavy cream</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Let the butter sit at room temperature for 15 minutes, until malleable.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Place the powdered sugar in the bowl of a standing mixer. Add the pieces of butter and toss to coat. Using a paddle attachment with a standing mixer, combine the sugar and butter at medium speed, until the sugar is no longer visible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Add the egg yolk and combine until no longer visible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Scrape down the butter off the sides of the bowl. Add half of the flour, then begin mixing again until the dough is crumbly. Add the remaining flour and then the cream and mix until the dough forms a sticky mass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Flatten the dough into a thick pancake, wrap it in plastic and refrigerate at least 2 hours before preparing to roll out the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Lightly butter a 9-inch pastry ring (or fluted tart pan) and place it on a baking sheet lined with parchment paper or a nonstick Silpat pad.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>7. Once the dough has thoroughly chilled, cut it in half, then cut each piece in half lengthwise. Rotate the dough 90 degrees and repeat, until you have 16 equal pieces. Work quickly with the dough so that it remains chilled. Sprinkle your work surface with a thin layer of flour. Knead the pieces of dough together until it forms one new mass and shape it into a flattened ball. Flour a rolling pin and sprinkle flour again on the work surface underneath the dough. Roll out the dough into a circle one-eighth-inch thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8. To easily transfer the dough into the ring or tart pan, fold it in half gently, then in quarters. Move the folded dough to the tart ring or pan, with the point of the dough in the center, then unfold it, gently patting the dough into the bottom and up the sides of the ring. Trim the edges so that they are flush with the top of the ring. Dock the dough with a pastry docker or prick the dough all over with a fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>9. Put the baking sheet and pastry ring into the freezer for 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>10. Heat the oven to 350 degrees. Place the baking sheet and ring in the oven and bake 20 to 25 minutes or until the dough is lightly browned. Remove from the oven and let cool to room temperature before filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Filling and assembly</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4 cups heavy cream<br/>\n1/2 cup (1 stick) unsalted butter, cut into eight pieces<br/>\n1 cup granulated sugar<br/>\n1 3/4 cup frozen cranberries<br/>\n2 cups unblanched sliced almonds</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Keep (or preheat) the oven to 350 degrees. Measure the cream and butter into a saucepan and heat it over low heat. When the butter has melted completely, remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. To make the caramel, spread the sugar evenly in a perfectly dry, deep 10-inch skillet and place it over medium-low heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. The sugar should turn straw-colored, then gold and then a nutty-brown caramel after about 10 minutes. If the sugar cooks unevenly, gently tilt or swirl the pan to evenly distribute the sugar. Remove from heat and slowly whisk the cream and butter into the sugar, which can splatter as the cream is added (long sleeves are a good precaution). If the caramel seizes, return it to the heat and continue to stir until it is smooth and creamy. Strain the caramel into a bowl and cool it for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Stir the frozen cranberries and the almonds into the caramel and mix until all the fruit and nuts are coated. Spoon the filling into the partially baked tart dough mounding toward the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Bake for 25 to 30 minutes, until the juices and the caramel are bubbling slowly around the edges. Remove from the oven and let stand for 1 hour, then gently lift the tart ring off the pastry.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Carefully transfer the tart to a serving platter. Serve warm or at room temperature.</p>"}], "link": "https://smittenkitchen.com/2007/10-cranberry-caramel-and-almond-tart"}