{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2007/06/black-bottom-cupcakes.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, chocolate, photo", "name": "Black Bottom Cupcakes", "author": {"@type": "Person", "name": "Source: The Great Book of Chocolate, David Lebovitz"}, "description": "Note: In 2019, this recipe got fresh photos. I also started swirling the tops of the cupcakes, just a little. Plus, I move the brown sugar from being sifted with the dry ingredients (pesky) to being whisked in with the wet ones. Hope it makes things easier.", "totalTime": "P0DT1H0M0S", "recipeYield": "12 to 14 full-size or 30 mini-cupcakes", "recipeIngredient": ["8 ounces cream cheese, regular or reduced fat, at room temperature", "1/3 cup granulated sugar", "1 large egg, at room temperature", "2 ounces bittersweet or semisweet chocolate, coarsely chopped, or 1/2 cup chocolate chips", "1 1/2 cups all-purpose flour", "5 tablespoons natural unsweetened cocoa powder (not Dutch-process)", "1 teaspoon baking soda", "1/4 teaspoon salt", "1 cup firmly packed light brown sugar", "1 cup water", "1/3 cup unflavored vegetable oil", "1 tablespoon white or cider vinegar", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Beat together the cream cheese, granulated sugar, and egg until smooth. Stir in the chopped chocolate pieces. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cupcakes: Adjust the rack to the center of the oven and preheat to 350°F (175°C). Butter a 12-cup muffin tin, or line the tin with paper muffin cups. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl sift together the flour, cocoa powder, baking soda, and salt. In a separate bowl, whisk together the brown sugar, water, oil, vinegar, and vanilla. Make a well in the center of the dry ingredients and stir in the wet ingredients, stirring until just smooth. Stir any longer and you will over mix the batter and end up with less-than-tender cupcakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter among the muffin cups, leaving just a couple spoonfuls behind in the bowl (if you’d like to marble the tops, as shown). Spoon a couple tablespoons of the filling into the center of each cupcake, dividing the filling evenly. Spoon any remaining chocolate batter back over the cream cheese center, if you plan to marble the tops. Use a butter knife inserted only about 1/2-inch into the cupcake to swirl the batters together decoratively. The cupcakes will be almost completely full (90%), which is fine. If you still have batter leftover, make one or two additional cupcakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 minutes, or until the tops are slightly golden brown and the cupcakes feel springy when gently pressed. These moist treats will keep well unrefrigerated for 2 to 3 days if stored in an airtight container."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Two notes:\n* If you choose to go mini for these, keep the filling at a tablespoon or less, lest you run out, as, ahem, someone else may have.\n** Though I’ve only made this recipe one, and therefore don’t think you should take my input as absolute authority, I’ve got to advise against actually letting these guys fill up. Not an issue if you’re going full-size, but if you go mini, aim for 90 percent full."}], "link": "https://smittenkitchen.com/2007/06-black-bottom-cupcakes"}