{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/bean-symphony1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "elsewhere, green beans, photo, salad, summer, vegetarian", "name": "Mixed Bean Salad (with Tomato and Lemon)", "author": {"@type": "Organization", "name": "\nInspired by The Spotted Pig"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 medium tomatoes", "1/2 pound yellow wax beans, ends trimmed and beans halved crosswise", "1/2 pound haricot vert, or slim green beans, ends trimmed and beans halved crosswise", "2 to 3 tablespoons olive oil", "2 cloves garlic, minced", "Pinch of red pepper flakes", "Glug of white wine", "Salt and pepper", "Juice of one lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 medium tomatoes<br/>\n1/2 pound yellow wax beans, ends trimmed and beans halved crosswise<br/>\n1/2 pound haricot vert, or slim green beans, ends trimmed and beans halved crosswise<br/>\n2 to 3 tablespoons olive oil<br/>\n2 cloves garlic, minced<br/>\nPinch of red pepper flakes<br/>\nGlug of white wine<br/>\nSalt and pepper<br/>\nJuice of one lemon</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a medium-large pot of salted water to boil. Carefully lower the two tomatoes in with a slotted spoon and cook for one minute. Leave the water boiling while you drop them into a bath of ice water, peel them and then set them aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, lower the wax beans in the water for 2 to 3 minutes, until lightly cooked but still firm. Remove them from the boiling water with a large slotted spoon or tongs and plunge them in the ice bath to stop cooking them. Drain them in a colander and then spread them out on a kitchen towel to dry. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Repeat this process with the haricot vert, but only cook them for one minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you, like me, are in a tiny kitchen and love nothing more than a one pot dish, dump the water out of the pot, dry it, and heat the olive oil to medium-high. If you love doing dishes, you can complete this step in a large saute pan. Yeah, I thought so. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the oil is heated, add the minced garlic and stir it around with a wooden spoon until lightly cooked but not brown, one minute or so. Add a pinch of red pepper flakes, and then the two peeled tomatoes that you have set aside. Break them up into chunks with your spoon, and simmer this into sauciness for about 5 minutes. Add a glug of white wine, and simmer for one more minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dump the drained and dried beans into the tomato sauce, and mix it around until combined and heated through. Salt and pepper to taste. Put the salad in a serving bowl and squeeze the lemon juice all over it, tossing it lightly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat immediately.</p>"}], "link": "https://smittenkitchen.com/2007/08-bean-symphony"}