{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/quiche-me-deadly1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "leeks, mushrooms, photo, tart, vegetarian", "name": "Pate Brisee", "author": {"@type": "Organization", "name": "\nAdapted from Martha Stewart and Julia Child"}, "description": "", "totalTime": "", "recipeYield": "Makes one tart dough", "recipeIngredient": ["1 1/4 cups all-purpose flour", "1/2 teaspoon salt", "1/4 teaspoon sugar", "1/2 cup (1 stick) unsalted butter, chilled and cut into small pieces", "2 to 3 tablespoons ice water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4 cups all-purpose flour<br/>\n1/2 teaspoon salt<br/>\n1/4 teaspoon sugar<br/>\n1/2 cup (1 stick) unsalted butter, chilled and cut into small pieces<br/>\n2 to 3 tablespoons ice water</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1.   In the bowl of a food processor, combine flour, salt, and sugar. Add butter, and process until the mixture resembles coarse meal, 8 to 10 seconds.     </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2.   With machine running, add ice water in a slow, steady stream through feed tube. Pulse until dough holds together without being wet or sticky; be careful not to process more than 30 seconds. To test, squeeze a small amount together: If it is crumbly, add more ice water, 1 tablespoon at a time.     </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3.   Form dough into a single ball, flatten it into a disk, and wrap in plastic. Transfer to the refrigerator, and chill at least 1 hour. Dough may be stored, frozen, up to 1 month.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. To par-bake the shell: Roll out the chilled dough as quickly as possible on a lightly-floured surface until is about 2 inches large all around than your pie pan. Either reverse the dough onto the rolling pin and unroll it over the mold or fold it into quarters and lay it over the mold, unfolding it. Press the dough lightly into the bottom of the pan, lifting the edges and working it gently down into the mold. Trim off excess dough by rolling the pin over the top of the mold. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. With your thumbs, push the dough 1/8-inch above the edge of the mold, to make an even, rounded rim of dough around the inside circumference of the mold. You can then press a decorative edge around the rim of the pastry with the dull edge of a knife. Prick the bottom of the pastry with a fork at 1/2-inch intervals. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Line the pastry with foil and fill it with pie weights, uncooked rice or beans and bake in a preheated 400 degree oven for 8 to 9 minutes. Remove the foil and bake the shell for 2 to 3 minutes more. Remove it from the oven when the shell is just starting to color and just beginning to shrink from the sides of the mold.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>7. If it seems to you that the sides of the shell are too fragile, or liable to crack or leak with the weight of the pie filling to come, do not unmold until your tart or quiche is filled and fully baked. To unmold it, slip it onto a rack so air will circulate and cool it, preventing it from getting soggy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Leek and Mushroom Quiche [Quiche aux Poireaux et Champignons]</b><br/>\nAdapted from <a href=\"http://www.amazon.com/gp/product/0375413405?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0375413405\">Julia Child, Mastering the Art of French Cooking</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 to 4 leeks, white part only, sliced<br/>\n1/2 cup water<br/>\nSalt<br/>\n3 tablespoons butter<br/>\n5 to 6 large white mushrooms, sliced<br/>\n1 tablespoon port<br/>\n3 eggs<br/>\n1 1/2 cups whipping cream (Deb: I use whole milk)<br/>\nAn 8-inch partially-cooked pastry shell on a baking sheet<br/>\n1/4 cup grated Swiss cheese<br/>\n1 tablespoon butter cut into pea-sized dots</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Preheat oven to 375°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Boil the leeks over moderately high heat in a heavy-bottomed, covered saucepan with 1/2 cup water, two tablespoons butter and a teaspoon of salt until it the liquid has almost evaporated. Lower heat and stew gently for 20 to 30 minutes until leeks are very tender. Put them aside in a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Add a tablespoon of butter to the pan along with the sliced mushrooms, 1/4 teaspoon of salt and port. Cover pan and cook over moderately low heat for 8 minutes. Uncover. Raise heat and boil for several minutes until liquid is completely evaporated and mushrooms are beginning to saute in their butter. Stir cooked mushrooms into leek mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Beat the eggs, cream or milk and seasoning in a large  mixing bowl to blend. Gradually stir in the leek and mushroom mixture. Check seasoning. Pour into pastry shell. Spread on the cheese and distribute to the butter over it (Deb note: I’m not sure if it’s because I accidentally took it out a minute or two early, but I found the butter to leave a slight greasiness on top, getting in the way of a cheesy crust, and might skip it next time). Bake in upper third of pre-heated oven for 25 to 30 minutes until puffed and browned. </p>"}], "link": "https://smittenkitchen.com/2007/01-quiche-me-deadly"}