{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/baklasagne1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "italian, pasta, photo", "name": "Fresh Pasta", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet Magazine"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["3 cups all-purpose flour", "4 large eggs", "1 teaspoon salt", "4 tablespoons water "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 cups all-purpose flour<br/>\n4 large eggs<br/>\n1 teaspoon salt<br/>\n4 tablespoons water </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To make pasta dough in a food processor: </u> Blend flour, eggs, salt, and water in processor until mixture just begins to form a ball, adding more water, drop by drop, if dough is too dry (dough should be firm and not sticky). Process dough for 15 seconds more to knead it. Transfer to a floured surface and let stand, covered with an inverted bowl, 1 hour to let the gluten relax and make rolling easier.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To make dough by hand: </u> Mound flour on a work surface, preferably wooden, and make a well in center. Add eggs, salt, and water to well. With a fork, gently beat eggs and water until combined. Gradually stir in enough flour to form a paste, pulling in flour closest to egg mixture and being careful not to make an opening in outer wall of well. Knead remaining flour into mixture with your hands to form a dough, adding more water, drop by drop, if dough is too dry (dough should be firm and not sticky). Knead dough until smooth and elastic, 8 to 10 minutes. Cover with an inverted bowl and let stand 1 hour (to make rolling easier).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Basic, Awesome Tomato Sauce</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 tablespoon butter<br/>\n2 large shallots, finely chopped<br/>\n1/2 to 1 teaspoon crushed red pepper flakes<br/>\n1 teaspoon salt<br/>\nA couple glugs red wine<br/>\n1 28-ounce can whole tomatoes<br/>\n1 15-ounce can pureed tomatoes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in saucepan over medium-high heat until foam subsides. Add shallots, red pepper flakes and salt, sauteing them together for a few minutes, until the shallots are translucent and beginning to color. Add the red wine, letting it sizzle and cook down slightly, then the whole and pureed tomatoes. Breaking the whole tomatoes up with a wooden spoon, let the sauce simmer for a few minutes. (No need to cook it down very much, as the extra liquid will be helpful to cook the pasta, and it will finish cooking in the oven.) Season to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes approximately 5 cups of sauce</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Other lasagne ingredients:</b> Several cups of baby spinach, sauteed in olive oil with two chopped cloves of garlic, seasoned to taste and cooled slightly, then mixed with 1 to 2 cups ricotta (to taste, I prefer less, the large amount is more traditional) and 1/2 cup grated parmesan, dropped in small dollops around each layer.  A one-pound ball of fresh mozzarella, torn and then scattered about, on top of the spinach mixture. The spinach can, of course, be replaced with any other mix of vegetables. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Baklasagne/Thousand Layer Lasagne</b> pasta-sheeting and dish assembly instructions at <a href=\"http://www.101cookbooks.com/archives/001386.html\">101 Cookbooks</a>. My only adjustments were baking this in a 9 x 13 dish and not pre-boiling the pasta. </p>"}], "link": "https://smittenkitchen.com/2007/01-baklasagne"}