{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/caramel-cake1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, everyday cakes, photo, round up", "name": "Caramel Cake", "author": {"@type": "Organization", "name": "\nGourmet, January 2008"}, "description": "<p>[Updated 6/09]  About that caramel! I realized quite a bit after making this cake that my candy thermometer was not worth the $2.99 I’d spent on it. Who knew?! The temperature reading always ran way cold, so when you make this at home, you’ll find that your caramel is thinner and will sink into the cake more. This is actually correct, or the way caramel cakes traditionally come out. Want yours to come out thick and drape-y the way it is pictured here? Boil it a bit hotter — but be careful. And be warned — despite the fact that draped caramel looks very pretty, the next day it was a bit awkward to bit through a thick, almost fondant-like caramel layer to get to that delicious cake within.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["RECIPE_SUBHED__1<u>For the cake</u>", "2 cups plus 2 tablespoons sifted cake flour (not self-rising; sift before measuring)", "1 teaspoon baking powder", "3/4 teaspoon baking soda", "1/2 teaspoon salt", "1 stick unsalted butter, softened", "1 cup sugar", "1 teaspoon pure vanilla extract", "2 large eggs, at room temperature 30 minutes", "1 cup well-shaken buttermilk", "RECIPE_SUBHED__2<u>For caramel glaze</u>", "1 cup heavy cream", "1/2 cup packed light brown sugar", "1 tablespoon light corn syrup", "1 teaspoon pure vanilla extract", "Equipment: a candy thermometer"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For caramel glaze</u><br/>\n1 cup heavy cream<br/>\n1/2 cup packed light brown sugar<br/>\n1 tablespoon light corn syrup<br/>\n1 teaspoon pure vanilla extract<br/>\nEquipment: a candy thermometer</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the cake: </u> Preheat oven to 350°F with rack in middle. Butter an 8-inch square cake pan and line with a square of parchment paper, then butter parchment. Sift together flour, baking powder, baking soda, and salt. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat butter and sugar in a large bowl with an electric mixer at medium speed until pale and fluffy, then beat in vanilla. Add eggs 1 at a time, beating well after each addition. At low speed, beat in buttermilk until just combined (mixture may look curdled). Add flour mixture in 3 batches, mixing until each addition is just incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread batter evenly in cake pan, then rap pan on counter several times to eliminate air bubbles. Bake until golden and a wooden pick inserted in center of cake comes out clean, 35 to 40 minutes. Cool in pan on a rack 10 minutes, then run a knife around edge of pan. Invert onto rack and discard parchment, then cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the glaze:</u> Bring cream, brown sugar, corn syrup, and a pinch of salt to a boil in a 1 1/2-quart heavy saucepan over medium heat, stirring until sugar has dissolved. Boil until glaze registers 210 to 212°F on thermometer, 12 to 14 minutes, then stir in vanilla.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put rack with cake in a shallow baking pan and pour hot glaze over top of cake, allowing it to run down sides. Cool until glaze is set, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Cake (before glazing) can be made 1 day ahead and kept in an airtight container at room temperature.</p>"}], "link": "https://smittenkitchen.com/2007/12-caramel-cake"}