{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/hibernation-fare1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, meat, pasta, photo, vegetarian, winter", "name": "Deb’s Three-Bean Chili", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 tablespoon vegetable oil", "1 humongous onion, diced", "1 15-ounce can of pinto beans, drained and rinsed", "1 15-ounce can of black beans, drained and rinsed", "1 15-ounce can of kidney beans, drained and rinsed", "1 28-ounce plus one 15-ounce can diced tomatoes", "1 cup water or stock", "2 tablespoons chili powder", "1 1/2 teaspoons cumin", "1 teaspoon ground coriander", "1 tablespoon unsweetened cocoa", "1 minced chipotle in adobo, from a can, or if your store is out, ahem, 1/4 teaspoon cayenne will do (the amount here will add a nice kick so tune it up or down according to your tastes; the type and brand of chili powder you use will also affect the heat)", "Salt and pepper, to taste", "Sliced green onions, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 tablespoon vegetable oil<br/>\n1 humongous onion, diced<br/>\n1 15-ounce can of pinto beans, drained and rinsed<br/>\n1 15-ounce can of black beans, drained and rinsed<br/>\n1 15-ounce can of kidney beans, drained and rinsed<br/>\n1 28-ounce plus one 15-ounce can diced tomatoes<br/>\n1 cup water or stock<br/>\n2 tablespoons chili powder<br/>\n1 1/2 teaspoons cumin<br/>\n1 teaspoon ground coriander<br/>\n1 tablespoon unsweetened cocoa<br/>\n1 minced chipotle in adobo, from a can, or if your store is out, ahem, 1/4 teaspoon cayenne will do (the amount here will add a nice kick so tune it up or down according to your tastes; the type and brand of chili powder you use will also affect the heat)<br/>\nSalt and pepper, to taste<br/>\nSliced green onions, for garnish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ingredients you might add, if you are not me: Peppers or ground beef (with the onions), fresh cilantro (stirred in at the very end)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in a large pot, adding diced onion and sauteing until browned. Add beans, tomatoes, water or stock and spices, including cocoa, all at once, letting mixture simmer for about 30 minutes, stirring occasionally. Adjust seasonings to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Corn Bread with Cheddar, Jalapeno and Green Onions</b><br/>\nAdapted from <a href=\"http://www.amazon.com/gp/product/0028610105?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0028610105\">Mark Bittman</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4 cups buttermilk, milk or yogurt (or 1 1/4 cups milk and 1 tablespoon white vinegar — see Step 2 below) plus more as need<br/>\n2 tablespoons butter, olive oil, lard or bacon drippings<br/>\n1 1/2 cups (about 7 ounces) medium-grind cornmeal<br/>\n1/2 cup all-purpose flour<br/>\n1 1/2 teaspoon baking powder<br/>\n1 teaspoon salt<br/>\n1 tablespoon sugar, plus more if you like sweet cornbread<br/>\n1 eggs</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1.\tPreheat the oven to 375 degrees.<br/>\n2.\tIf you are using buttermilk, milk or yogurt, ignore this step. If you want to use soured milk (a good substitute for buttermilk), warm the milk gently — one minute in the microwave is sufficient, just enough to take the chill off — and add the vinegar. Let it rest while you prepare the other ingredients.<br/>\n3.\tPlace the fat in a medium oven-proof skillet or in an 8-inch square baking pan over medium heat (Deb note: would you believe I lack both? I used three of my mini-loaf pans); heat until good and hot, about 2 minutes, then turn off the heat. Meanwhile, combine the dry ingredients in a bowl. Mix the egg into the buttermilk, milk or soured milk. Stir the liquid mixture into the dry ingredients, combining well; if it seems too dry, add another tablespoon or two of milk. Pour the batter into the preheated fat, smooth out the top if necessary, and place in the oven.<br/>\n4.\tBake about 30 minutes, or until the top is lightly brown and the sides have pulled away from the pan; a toothpick inserted into the center will come out clean. Serve hot or warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Optional additions I used</em>: One cup canned creamed corn, one cup grated extra-sharp cheddar, two thinly sliced scallions, and 1 tablespoon chili powder, but only because the store was out of jalapenos. I usually mince one in. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Optional additions I didn’t use:</em> 1 tablespoon cumin (instead of chili powder); 1 cup fresh corn (instead of creamed); molasses or honey, in place of the sugar, about 1/4 cup; minced herbs such as cilantro or fresh parsley, 2 tablespoons; sautéed onions, shallots or leeks, about 1/2 cup.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Pasta with Sausage, Tomatoes and Mushrooms</b><br/>\nAdapted from Eccoqui Restaurant in Bernardsville, NJ <a href=\"http://www.epicurious.com/recipes/recipe_views/views/106961\">via Bon Appetit</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes (at least) 8 servings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 1/2 pounds Italian sweet sausages, casings removed, crumbled (Deb note: we replaced this with some sweet, and some spicy Italian chicken and turkey sausages)<br/>\n3 tablespoons olive oil<br/>\n1 1/2 pounds mushrooms, thickly sliced<br/>\n3 cups chopped onions<br/>\n1 1/2 cups chopped fresh basil<br/>\n1/4 cup chopped fresh oregano<br/>\n6 large garlic cloves, chopped<br/>\n1 cup dry white wine<br/>\n5 cups canned crushed tomatoes with added puree<br/>\n2 cups diced tomatoes (about 4 medium-large tomatoes)<br/>\n2 tablespoons (1/4 stick) butter<br/>\n1 1/4 pounds pappardelle or mafaldine pasta (or any wide, flat noodles)*<br/>\n1 1/2 cups grated pecorino Romano cheese (about 4 1/2 ounces) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Saute sausage in heavy large pot over medium-high heat until brown, about 12 minutes. Using slotted spoon, transfer sausage to large bowl. Add oil to drippings in pot. Add mushrooms and onions; saute until tender and brown, about 15 minutes. Stir in 1 cup chopped basil, oregano, and garlic; saute 1 minute. Add wine; cook until almost absorbed, about 4 minutes. Add sausage and crushed tomatoes; cover and simmer over medium heat until thickened, about 25 minutes. Add diced tomatoes and butter; simmer until tomatoes are soft, stirring frequently, about 15 minutes. Season with salt and pepper. (Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and refrigerate. Bring to simmer before continuing.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain well; return to pot. Pour sauce over pasta; toss to coat. Add 1/2 cup cheese and 1/2 cup basil; toss to combine. Season with salt and pepper. Transfer pasta to serving dish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve, passing remaining cheese separately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I made pappardelle with my <a href=\"https://smittenkitchen.com/2007/01/baklasagne\">now-standard pasta recipe</a>, cranking it out to level 5 thinness, which may have in the end been a little thick, but held up well in the hearty sauce. I cut it by hand into wide, completely uneven strips with a ravioli wheel. It cooked in about 6 minutes.</p>"}], "link": "https://smittenkitchen.com/2007/01-hibernation-fare"}