{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2007/07/double-chocolate-layer-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, chocolate, photo", "name": "Double Chocolate Layer Cake", "author": {"@type": "Person", "name": "Source: Gourmet, March 1999"}, "description": "This is a really perfect in every way old-fashioned chocolate cake — it bakes for a longer time at a lower temperature, leading to layers that are almost perfectly flat, not requiring trimming for a neat/even final look. I used decaf coffee when making this for kids.", "totalTime": "P0DT2H0M0S", "recipeYield": "12 to 14", "recipeIngredient": ["1 1/2 cups (355 ml) very hot brewed coffee", "3 ounces (85 grams) semi-sweet chocolate, coarsely chopped", "3 cups (600 grams) granulated sugar", "1 1/4 teaspoons fine sea or table salt", "3/4 cup (175 ml) vegetable or another neutral oil", "1 1/2 cups (355 ml) well-shaken buttermilk", "3/4 teaspoon vanilla", "3 large eggs", "2 1/2 cups (315 grams) all-purpose flour", "1 1/2 cups (aprox. 130 grams; weights vary between brands) unsweetened cocoa powder (not Dutch process)", "2 teaspoons (10 grams) baking soda", "3/4 teaspoon (4 grams) baking powder", "1 pound (455 grams) semisweet chocolate", "1 cup (235 ml) heavy cream", "2 tablespoons (25 grams) sugar", "2 tablespoons (40 grams) light corn syrup", "1/2 stick (1/4 cup or 55 grams) unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make cake layers: Preheat oven to 300°F (yes, 300!). and grease two 10×2-inch (but mine is 3 inches deep, and this is fine too; just no less than 2 inches) round cake pans. Line bottoms with rounds of parchment paper and grease paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chopped chocolate in large bowl and pour hot coffee over it. Let sit together for 4 to 5 minutes, then whisk until chocolate is smooth. Whisk in sugar, salt, oil, buttermilk, and vanilla until combined. Whisk in eggs, one at a time. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour, cocoa, baking soda, and baking powder into a second large bowl, or, if you can pull it off, right onto the top of your batter. Whisk until smooth. It always looks like the lumps will remain, but I always find that they smooth out, so don’t fret."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cake layers: Divide batter between two pans. (Batter for one cake layer weights about 1008 grams.) Bake cake layers for  in middle of oven until a toothpick inserted in center comes out clean, 1 hour to 1 hour and 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[Oh wait, you only have one 10-inch cake pan? Of course you do. It’s fine. Just pour half the batter in, bake the cake layer, flip it out onto a cooling rack as soon as you can, wipe out the pan and re-grease it for the second cake layer. I’ve done this every time I make it and the batter has been forgiving of sitting around for 80 minutes.]"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The original instructions for this recipe has you cool layers completely in pans on racks. This is fine if you have two matching pans, but since I don’t, I hurry it along, removing the cakes from the pans after only 5 to 10 minutes cooling. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a thin knife around edges of pans and invert layers onto racks. Carefully remove paper paper and cool layers completely. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make frosting and filling: Finely chop chocolate. In a 1 1/2- to 2-quart saucepan bring cream, sugar, and corn syrup to a boil over moderately low heat, whisking until sugar is dissolved. Remove pan from heat and add chocolate, whisking until chocolate is melted. Cut butter into pieces and add to frosting, whisking until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer frosting to a bowl and cool, stirring occasionally, until spreadable. I found that stirring this over a bowl of ice water did a great job of cooling it off quickly and evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread frosting between cake layers and over top and sides. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Cake layers may be made 1 day ahead and kept, wrapped well in plastic wrap, at room temperature. They can be kept for longer (weeks, even) in the freezer. Frosted cake keeps, covered and chilled, 3 days. Bring cake to room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The Previous Raspberry Filling: I used to make this cake with a raspberry filling but do not anymore. Here’s the recipe, if you’d like to use it instead:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "2 10-ounce bag frozen raspberries, thawed\n1/2 cup sugar\n2 tablespoons cornstarch"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the raspberries in a food processor, blender or immersion blender. Press the puree through a fine-mesh strainer with the back of a spoon, removing the seeds. Heat the puree in a small pot with the sugar and cornstarch until mixture boils, stirring constantly. As it boils, it should quickly thicken. Let it cool complete before spreading it thinly over three layers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the Harry Potter fanatics: "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you want professional instructions on how to put a picture on a cake, run far from here. This is just my hack, and I also used it earlier in the year when a certain 2 year-old required an Elmo + Pals cake. First, chill your cake in the fridge until the top frosting is firm. Second, find a linear, clip-art-like picture of what you want to trace on. Print it to a size you want on your cake. Cut it out. Use a toothpick to gently trace the exterior shape onto the cake. Remove the image and then start cutting it apart as needed along its interior lines, but make sure you can put it back together again. Lay each puzzle piece individually within the outside shape and trace it, too, then get rid of it. Eventually you’ll have a lo-fi sketch of the shapes you want to fill in. Mix some frosting colors to match the colors you need and use a small round tip to begin outlining and filling in the shapes."}], "link": "https://smittenkitchen.com/2007/07-double-chocolate-layer-cake"}