{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/green-dreams1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, photo", "name": "Green Tea Shortbread Sandwiches", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>These cookies are crisp and delicate, good with or without filling. The recipe below will make a mildly sweet cookie, but you can increase the sugar by one to two tablespoons, if desired. If you have any fancy butter in the fridge, this is a great time to use it as the flavor will really come through. </p><p>It took some hunting around to find matcha — green tea powder. Several tea shops carried it, but required a quarter-pound purchase. We finally lucked out at Whole Foods, which carries the Rishi brand in small quantities. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 cups flour", "1/2 teaspoon salt", "1/2 cup powdered sugar", "1 1/2 to 3 tablespoons unsweetened green tea powder (matcha) (updated amount: reviews seem to prefer the lower amount)", "2 sticks (1 cup) unsalted butter, softened", "1/2 teaspoon almond extract", "Superfine sugar, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups flour<br/>\n1/2 teaspoon salt<br/>\n1/2 cup powdered sugar<br/>\n1 1/2 to 3 tablespoons unsweetened green tea powder (matcha) (updated amount: reviews seem to prefer the lower amount)<br/>\n2 sticks (1 cup) unsalted butter, softened<br/>\n1/2 teaspoon almond extract<br/>\nSuperfine sugar, for sprinkling (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk dry ingredients in a small bowl. In a larger one, beat the softened butter with an electric mixer until just smooth. Add the almond extract, then all of the dry ingredients. Divide the dough in half and shape into two discs, wrapped in plastic. Chill the discs for an hour or two in the refrigerator, or until completely firm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough to your desired thickness (for the small leaves, I went for about 1/8″) on a floured board. You will probably want to lightly flour the top of the dough, too, before rolling. Cut with cookie cutters into your desired shape (if you are making sandwich cookies, consider a shape that will match when mirrored, something I wasn’t bright enough to see coming), arranging them on parchment paper-lined baking sheets. They barely expand, so there is no need to leave an abundance of space between cookies. Sprinkle a thin coat of superfine sugar over the cookies (optional).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake them in a preheated 325°F oven until lightly golden at the edges. For thin, small cookies this took 15 minutes. The darker the edges, the more intense the flavor and, some say, the longer the cookies will keep. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>White Chocolate Ganache Filling</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The reason why I said white chocolate is an “infernal pain in the ass to work with” is that most white chocolate sold is falsely labeled as such. A couple white “chocolates” to outright avoid: <a href=\"http://www.ghirardelli.com/products/chips_white.aspx\">Ghiradelli White Chips</a> (note the absence of the word chocolate; oddly enough, their <a href=\"http://www.ghirardelli.com/products/bars_white.aspx\">White Chocolate Baking Bar</a>, which I used, is the real deal), and Nestle Premier White Morsels (for the same reason).  While these may be okay for a brownie or chocolate chip cookie, they do not melt smoothly into a ganache or coating. Even the better-quality stuff easily separates from the warmth of your hand in a piping bag (it’s not pretty) so try to work quickly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 ounces white chocolate, chopping into very small pieces<br/>\n3 to 4 tablespoons heavy cream</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the chocolate in the microwave for 30 seconds, stir it completely, then repeat this process, if necessary, in 15-second increments. Don’t let the chocolate burn. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add heavy cream, one tablespoon at a time, stirring until smooth. Cool ganache in the refrigerator, stirring every few minutes, until firm enough to spread or pipe between cookies. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once you have filled and assembled your cookies, I find that shocking them in the freezer for 5 minutes get the chocolate to firm up quickly without sogging the cookie, so they can be stored at room temperature until needed.</p>"}], "link": "https://smittenkitchen.com/2007/02-green-dreams"}