{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-road-to-pickle-proficiency1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "peppers, photo, pickled, summer", "name": "Pickled Garlicky Red Peppers", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 1/2 cups distilled white vinegar", "3 cups water", "2/3 to 3/4 cup sugar", "5 tablespoons kosher salt or 1/4 cup table salt*", "10 bell peppers, all red or a mix of red, orange and yellow (the sweet varieties)", "4 large cloves of garlic, coarsely chopped**"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 1/2 cups distilled white vinegar<br/>\n3 cups water<br/>\n2/3 to 3/4 cup sugar<br/>\n5 tablespoons kosher salt or 1/4 cup table salt*<br/>\n10 bell peppers, all red or a mix of red, orange and yellow (the sweet varieties)<br/>\n4 large cloves of garlic, coarsely chopped**</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Roast the peppers:</em> Preheat the oven to 400 degrees. Line peppers on a large baking sheet and roast them for 45 minutes, turning them once, or until they are soft. Better to extend the cooking time than shorten it, as the skins will only come off easily if they’re fully cooked. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Prepare pickling liquid:</em> Bring vinegar, water, sugar and salt to a boil in a 3-quart nonreactive saucepan over moderate heat, stirring until sugar is dissolved. Cool about 30 minutes. (Want to speed this process up? Leave aside two cups of the water, only boiling one. Once the sugar is dissolved, pour that cold water back in. It should take no time at all for it to finish cooling.)<br/>\n<em><br/>\nOnce peppers are roasted:</em> While they’re hot, throw the peppers in a large bowl and cover it with a lid or plate, trapping the steam inside. In 15 minutes, they should be cooled, and their skins should be easy to remove. If not, give it another 10 or 15 minutes to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once all of the pepper skins are removed, remove the core and seeds, and tear the peppers into strips, tossing them into a large bowl, jar or container. Pour the pickling liquid over the peppers (if you have extra brine, save it for next time) and add the chopped garlic. Chill them, covered with a lid or plastic wrap, for one day. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Pickled vegetables keep, covered and chilled, for 1 week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Technically the conversion for kosher to table salt is 1.5, so a more accurate equivalent would be 3 tablespoons plus 2 teaspoons, if you want to be a fusspot about it.<br/>\n** My in-laws, as well as every other Russian I’ve met, are mad for garlic, thus this amount will imbue the peppers with a serious garlic kick. If you’re nervous about the spiciness, you might want to use less. Personally, though, I wouldn’t dream of it. </p>"}], "link": "https://smittenkitchen.com/2007/05-the-road-to-pickle-proficiency"}