{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2007/05/zucchini-carpaccio-salad.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "budget, gluten free, italian, photo, salad, summer, vegetarian, zucchini", "name": "Zucchini Carpaccio Salad", "author": {"@type": "Person", "name": "Source: Gourmet, July 2006"}, "description": "In this 2018 update, I’ve kept everything in the recipe the same but wanted to mention three things: 1, no need for an adjustable-blade slicer or mandoline here. I use a vegetable peeler these days to make (prettier) ribbons of zucchini instead. This works best with thinner zucchini or summer squash. 2, I use a bit less arugula these days, maybe 3 to 4 ounces, instead. I love arugula, but prefer to let the zucchini star. 3, Finally, but perhaps you already know this: you needn’t follow the measurements, although they work perfectly well, precisely here. Season to taste, oil to taste, lemon to taste, parmesan to taste, and you’ll have something perfectly delicious.", "totalTime": "P0DT0H35M0S", "recipeYield": "4 as a main, 6 as a side", "recipeIngredient": ["1 1/2 pound zucchini (about 3 large) or a mix of thin summer squash", "1 1/4 teaspoons kosher salt", "1/2 pound arugula, stems discarded and leaves cut into 1/2-inch-wide strips (6 cups), or baby arugula", "1 ounce parmesan, coarsely grated (on large holes of a box grater; about 1/2 cup) or shaved with a vegetable peeler", "3 tablespoons olive oil", "Juice of one lemon", "1/4 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "You can either cut zucchini crosswise into paper-thin slices with an adjustable-blade slicer, or use a vegetable peeler (this works best if zucchini are thin, thinner than the length of the peeler blade) to shave the zucchini lenghtwise into long ribbons. Toss zucchini slices or ribbons with 1 teaspoon salt in a large colander set over a bowl and let drain 20 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse zucchini slices well, then drain, pressing gently on slices to extract any excess liquid. Pat zucchini slices dry with a kitchen towel. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[Do ahead: I often prepare these up to this point. Once drained well, they keep in the fridge for a few days in a container so you can use them here or elsewhere.]"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put arugula in a large bowl. Sprinkle with 1/4 cup parmesan and remaining 1/4 teaspoon salt. Drizzle 1 1/2 tablespoons of oil over greens and toss. Arrange zucchini over arugula greens, then drizzle with remaining oil, lemon juice and sprinkle with remaining 1/4 cup parmesan and black pepper."}], "link": "https://smittenkitchen.com/2007/05-zucchini-carpaccio-salad"}