{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2007/01/world-peace-cookies.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, cookie, photo", "name": "World Peace/Korova Cookies", "author": {"@type": "Person", "name": "Source: Paris Sweets, by Dorie Greenspan"}, "description": "Weights finally added in 2018. Sorry for making you guys wait! (I didn’t say “weight.” Where is my reward?)", "totalTime": "2hr 30mins", "recipeYield": "About 36 cookies", "recipeIngredient": ["1 1/4 cups (165 grams) all-purpose flour", "1/3 cup (25 to 27 grams) unsweetened cocoa powder", "1/2 teaspoon baking soda", "11 tablespoons (155 grams or 5.5 ounces) unsalted butter, at room temperature", "2/3 cup (packed) (125 grams) light brown sugar", "1/4 cup (50 grams) granulated sugar", "1/2 teaspoon fleur de sel or 1/4 teaspoon fine sea salt", "1 teaspoon (5 ml) vanilla extract", "5 ounces (140 grams) bittersweet chocolate, chopped into chips, or a generous 3/4 cup store-bought mini chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the flour, cocoa and baking soda together. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a stand mixer, preferably fitted with a paddle attachment, or with a hand mixer in a large bowl, beat the butter on medium speed until soft and creamy. Add both sugars, the salt and vanilla extract and beat for 2 minutes more. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the mixer. Pour in the flour mixture, drape a kitchen towel over the stand mixer to protect yourself and your kitchen from flying flour and pulse the mixer at low speed about 5 times, a second or two each time. Take a peek — if there is still a lot of flour on the surface of the dough, pulse a couple of times more; if not, remove the towel. Continuing at low speed, mix for about 30 seconds more, just until the flour disappears into the dough — for the best texture, work the dough as little as possible once the flour is added, and don’t be concerned if the dough looks a little crumbly. Toss in the chocolate pieces and mix only to incorporate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a work surface, gather it together and divide it in half. Working with one half at a time, shape the dough into logs that are 1 1/2 inches in diameter. Wrap the logs in plastic wrap and refrigerate them for at least 3 hours. (The dough can be refrigerated for up to 3 days or frozen for up to 2 months. If you’ve frozen the dough, you needn’t defrost it before baking — just slice the logs into cookies and bake the cookies 1 minute longer.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Getting ready to bake: Center a rack in the oven and preheat the oven to 325°F (160°C). Line two baking sheets with parchment or silicone mats. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a sharp thin knife, slice the logs into rounds that are 1/2 inch thick. (The rounds are likely to crack as you’re cutting them — don’t be concerned, just squeeze the bits back onto each cookie.) Arrange the rounds on the baking sheets, leaving about one inch between them. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cookies one sheet at a time for 12 minutes — they won’t look done, nor will they be firm, but that’s just the way they should be. Transfer the baking sheet to a cooling rack and let the cookies rest until they are only just warm, at which point you can serve them or let them reach room temperature. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serving: The cookies can be eaten when they are warm or at room temperature — I prefer them at room temperature, when the textural difference between the crumbly cookie and the chocolate bits is greatest — and are best suited to cold milk or hot coffee. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Packed airtight, cookies will keep at room temperature for up to 3 days (Deb note: not a chance); they can be frozen for up to 2 months. They can also be frozen in log form for months, and can be sliced and baked directly from the freezer, adding a coupld minutes to the baking time."}], "link": "https://smittenkitchen.com/2007/01-world-peace-cookies"}