{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/corfu-sils-and-timelines1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apple, cake, everyday cakes, fruit, photo, spanish", "name": "Grandmothers of Sils’ Apple and Yogurt Cake", "author": {"@type": "Organization", "name": "\nAdapted from The New Spanish Table"}, "description": "<p>This is, in my mind, a true coffee cake, not overly sweet and best unadorned. It keeps exceptionally well, and is, if possible, more moist on day three than day one. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["Unsalted butter, for greasing the pan", "2 1/4 cups all-purpose flour, plus more for dusting the pan", "1 1/4 teaspoons baking powder", "4 large eggs", "1 1/4 cups granulated sugar", "1 cup lemon yogurt*", "1/4 cup anise liqueur, such as Sambuca", "1/2 cup plus 2 tablespoons light olive oil", "3 cups finely diced or shredded peeled and cored baking apples, such as Granny Smith or Jonagold, or a combination", "Confectioners’ sugar, for dusting the cake", "Creme fraiche, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unsalted butter, for greasing the pan<br/>\n2 1/4 cups all-purpose flour, plus more for dusting the pan<br/>\n1 1/4 teaspoons baking powder<br/>\n4 large eggs<br/>\n1 1/4 cups granulated sugar<br/>\n1 cup lemon yogurt*<br/>\n1/4 cup anise liqueur, such as Sambuca<br/>\n1/2 cup plus 2 tablespoons light olive oil<br/>\n3 cups finely diced or shredded peeled and cored baking apples, such as Granny Smith or Jonagold, or a combination<br/>\nConfectioners’ sugar, for dusting the cake<br/>\nCreme fraiche, for serving (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Position rack in the center of the oven and preheat the oven to 350°F. Butter and flour and 9-inch springform pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Sift the flour and baking powder together in a bowl. Place the eggs and granulated sugar in a large mixing bowl and, using an electric mixer, beat until fluffy and pale yellow, about 1 minute. Beat in the yogurt and liqueur until completely smooth. Working in batches, beat in the sifted flour, alternating it with the olive oil. Gently but thoroughly fold in the apples.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Scrape the batter into the prepared springform pan, tap it on a counter to level the batter, then smooth the top with an offset spatula. Bake the cake on the center rack until the top is golden, a cake tester or toothpick inserted into the center comes out clean**, and the cake springs back when you touch it, 55 to 65 minutes. Let the cake cool on a rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Run a thin knife around the side of the cake to loosen it. Remove the side and the bottom of the pan, then place the cake on a cake platter. (The cake can be baked up to 3 days ahead.) Wrap it loosely in plastic until ready to use. Serve the cake sprinkled with confectioners’ sugar, accompanied by creme fraiche, if desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* For serious! I can’t tell you how many lemon yogurts I picked up at my totally yuppie gourmet grocery store before finding a single one with real, actual lemon in it and not artificial flavoring. I’m not naming names, but there were brands that I really expected better from. I finally landed on Stoneybrook Farms low-fat with lemon puree on the bottom. Why I went through this trouble when I could have just, uh, squeeze lemon juice into a plain yogurt, I don’t know. But just to warn that if you’re going through the effort of making a cake from scratch, you might want to make sure your lemon yogurt is the real deal. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>** For some reason, this never happened for me. Well beyond the baking time (though my oven runs a little cool) the toothpick was still coming out with some damp crumbs attached while the top was golden and springy, so I took it out. It was cooked just fine in the center, so if this happens to you, don’t worry. </p>"}], "link": "https://smittenkitchen.com/2007/09-corfu-sils-and-timelines"}