{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/apricot-and-walnut-vareniki1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apricots, dumplings, fruit, photo", "name": "Apricot and Walnut Vareniki ", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet Magazine, February 2001"}, "description": "", "totalTime": "", "recipeYield": "Yields about 32 varenikis", "recipeIngredient": ["RECIPE_SUBHED__1<u>Dough</u>", "1 cup all-purpose flour plus additional for kneading and rolling", "3/4 cup cake flour (not self-rising)", "2 large eggs", "3/4 teaspoon salt", "1/4 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Dough</u><br/>\n1 cup all-purpose flour plus additional for kneading and rolling<br/>\n3/4 cup cake flour (not self-rising)<br/>\n2 large eggs<br/>\n3/4 teaspoon salt<br/>\n1/4 cup water</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together flours in a bowl. Make a well in flour and add eggs, salt, and water, then stir together with a fork without touching flour. Continue stirring, gradually incorporating flour into well until a soft dough forms. Transfer dough to a lightly floured work surface and knead, adding only as much additional flour as needed to keep dough from sticking, until smooth and elastic, about 8 minutes. (Dough will be soft.) Cover with plastic wrap and let rest at room temperature at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dough may be made 2 hours ahead, wrapped well in plastic wrap and chilled. Bring to room temperature before using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Filling</u><br/>\n1/4 cup water<br/>\n1/4 cup plus 2 tablespoons sugar<br/>\n2 tablespoons apricot brandy (optional)<br/>\n6 oz dried apricots (1 cup; preferably California)<br/>\n1/2 cup walnuts (2 oz), finely chopped<br/>\nDough (recipe above)<br/>\n1 stick (1/2 cup) unsalted butter<br/>\n1/2 cup fresh bread crumbs<br/>\n1/4 teaspoon cinnamon</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make filling: Bring water and 1/4 cup sugar to a boil, stirring until sugar is dissolved. Remove from heat and stir in brandy. Finely chop apricots in a food processor, then add sugar syrup and pulse until just combined (do not puree). Transfer to a bowl and stir in 1/4 cup walnuts. Cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out dough and fill varenikis: Halve dough and roll out 1 piece on a lightly floured surface into a 15-inch round, keeping remaining dough wrapped. Trim dough to a 13-inch square. Cut lengthwise into 4 strips, then crosswise into fourths to form 16 (3 1/4-inch) squares. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put 1 slightly rounded teaspoon filling in center of each square. Working with 1 square at a time, moisten edges with water and fold in half diagonally to form a triangle, pressing edges firmly together to seal. overlap bottom points of triangle and press to seal (dumpling will look like a pointed hat). Transfer vareniki to a flour-dusted kitchen towel. Repeat with remaining squares, then make more dumplings with remaining dough and filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook varenikis in a large pot of lightly salted boiling water until tender, about 15 minutes. Make topping while varenikis cook:</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons butter in a skillet over moderate heat, then cook bread crumbs and remaining 1/4 cup walnuts, stirring frequently, until golden, 2 to 3 minutes. Remove from heat and season lightly with salt. Stir together cinnamon and remaining 2 tablespoons sugar. Sprinkle 2 teaspoons cinnamon sugar over crumb mixture and toss. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve varenikis: Melt remaining 6 tablespoons butter, then drizzle about 2 tablespoons on a warmed serving platter. Transfer varenikis with a slotted spoon to platter and drizzle with remaining 4 tablespoons butter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve hot, sprinkled with bread-crumb mixture and remaining cinnamon sugar to taste. </p>"}], "link": "https://smittenkitchen.com/2007/11-apricot-and-walnut-vareniki"}