{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/four-breakfasts1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, breakfast, pancakes, photo, salad", "name": "Everyday Pancakes", "author": {"@type": "Organization", "name": "\nAdapted from Mark Bittman, New York Times 12/20/06"}, "description": "", "totalTime": "", "recipeYield": "4 to 6 servings.", "recipeIngredient": ["2 cups all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon salt", "1 tablespoon sugar, optional", "2 eggs", "1 1/2 to 2 cups milk", "2 tablespoons melted and cooled butter (optional), plus unmelted butter for cooking, or use neutral oil."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups all-purpose flour<br/>\n2 teaspoons baking powder<br/>\n1/4 teaspoon salt<br/>\n1 tablespoon sugar, optional<br/>\n2 eggs<br/>\n1 1/2 to 2 cups milk<br/>\n2 tablespoons melted and cooled butter (optional), plus unmelted butter for cooking, or use neutral oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Heat a griddle or large skillet over medium-low heat. In a bowl, mix together dry ingredients. Beat eggs into 1 1/2 cups milk, then stir in 2 tablespoons melted cooled butter, if using it. Gently stir this mixture into dry ingredients, mixing only enough to moisten flour; don’t worry about a few lumps. If batter seems thick, add a little more milk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Place a teaspoon or 2 of butter or oil on griddle or skillet. When butter foam subsides or oil shimmers, ladle batter onto griddle or skillet, making pancakes of any size you like. Adjust heat as necessary; usually, first batch will require higher heat than subsequent batches. Flip pancakes after bubbles rise to surface and bottoms brown, after 2 to 4 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Cook until second side is lightly browned. Serve, or hold on an ovenproof plate in a 200-degree oven for up to 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Blueberry or Banana Pancakes</u>: Use fresh or frozen (not defrosted) blueberries; overripe bananas are great. Just before cooking, stir blueberries into batter. For bananas, slice them and press into surface of cooking pancakes. Cook pancakes a little more slowly than you would other pancakes as they burn more easily. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Whole-Grain Pancakes</u>: Substitute whole wheat flour, cornmeal, rolled oats or a combination for up to 1 cup of flour and proceed with recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>English Muffins</b><br/>\nRecipe from Ruth Reichl, <a href=\"http://www.foodnetwork.com/food/recipes/recipe/0,1977,FOOD_9936_23595,00.html\">cooking technique from Alton Brown</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix 1/3 cup warm water with 1 tablespoon sugar and 1 package active dry yeast in the bowl of a stand mixer. Melt 3 tablespoons butter in 1 2/3 cups milk. When cool, add to yeast mixture along with 1 egg, 1 tablespoon salt, and 1 tablespoon white vinegar. Add 2 1/2 cups flour and mix, at medium speed, 5 minutes. Add 2 1/2 cups more flour and mix well. Cover and let rise 1 hour.*</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a griddle to 300 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place metal rings onto the griddle and coat lightly with vegetable spray. Using #20 ice cream scoop**, place 2 scoops into each ring and cover with a pot lid or cookie sheet and cook for 5 to 6 minutes. Remove the lid and flip rings using tongs. Cover with the lid and cook for another 5 to 6 minutes or until golden brown. Place on a cooling rack, remove rings and cool. Split with fork and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I mixed this by hand, adding all of the flour at once and not for five minutes and had no trouble with the dough.<br/>\n** Unable to figure out what size scoop this was, I can only caution you to not fill the ring more than halfway. It puffs plenty while cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Frisee Salad With Lardons and Poached Eggs (Salad Lyonnaise)</strong><br/>\n<a href=\"http://www.epicurious.com/cooking/menus/cooknow/recipes/100876\">Gourmet, February 1999</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes 4 servings</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 pound frisee (French curly endive)<br/>\n6 ounces slab bacon or thick-cut bacon slices<br/>\n2 tablespoons distilled white vinegar<br/>\n4 large eggs<br/>\n2 tablespoons chopped shallot<br/>\n3 tablespoons red-wine vinegar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tear frisee into bite-size pieces and put in a large bowl. If using slab bacon, cut lengthwise into 1/4-inch-thick slices. Cut bacon slices crosswise into 1/4-inch-thick sticks (lardons).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a heavy skillet cook bacon over moderate heat, stirring occasionally, until golden and remove skillet from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have ready another skillet with 1 inch warm water. Half-fill a 4-quart saucepan with water and stir in white vinegar. Bring liquid to a bare simmer. Break each egg into a teacup. Slide 1 egg into simmering liquid and immediately push white around yolk with a slotted spoon, moving egg gently. (Egg will become oval, with yolk completely covered by white.) Add remaining 3 eggs in same manner. Simmer eggs about 1 1/2 minutes for runny yolks to about 3 minutes for firm yolks. (Serving this salad with runny “not fully cooked” yolks may be of concern if there is a problem with salmonella in your area.) Immediately transfer eggs to skillet of warm water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reheat bacon in its skillet over moderate heat. Add shallot and cook, stirring, 1 minute. Add red-wine vinegar and boil 5 seconds. Immediately pour hot dressing over frisee and toss with salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide salad among 4 plates and top with drained poached eggs. Season eggs with salt and pepper and serve salad immediately.</p>"}], "link": "https://smittenkitchen.com/2007/01-four-breakfasts"}