{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/tiramisu-cake1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, photo", "name": "Tiramisu Cake", "author": {"@type": "Organization", "name": "\nBaking: From My Home to Yours by Dorie Greenspan"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["<em>For the cake layers:</em>", "2 cups (255 grams) cake flour", "2 teaspoons (10 grams) baking powder", "1/8 teaspoon baking soda", "1/4 teaspoon salt", "1 1/4 sticks (10 tablespoons or 140 grams)) unsalted butter, room temperature", "1 cup (200 grams) sugar", "3 large eggs", "1 large egg yolk", "1 1/2 teaspoons (8 ml) pure vanilla extract", "3/4 cup (175 ml) buttermilk", "<em>For the espresso extract:</em>", "2 tablespoons instant espresso powder", "2 tablespoons (30 ml) boiling water", "<em>For the espresso syrup:</em>", "1/2 cup (120 ml) water", "1/3 cup (65 grams) sugar", "1 tablespoon (15 ml) amaretto, Kahlua, or brandy (Deb note: I used brandy)", "<em>For the filling and frosting:</em>", "1 8-ounce (225 grams) container mascarpone", "1/2 cup (60 grams) confectioners’ sugar, sifted", "1 1/2 teaspoons (8 ml) pure vanilla extract", "1 tablespoon (15 ml) amaretto, Kahlua, or brandy (Deb note: I used brandy)", "1 cup (235 ml) cold heavy cream", "2 1/2 ounces (70 grams) bittersweet or semisweet chocolate, finely chopped, or about 1/2 cup store-bought mini chocolate chips", "Chocolate-covered espresso beans, for decoration (optional)", "Cocoa powder, for dusting", "<em>Getting ready:</em>", "Center a rack in the oven and preheat the oven to 350 degrees F. Butter two 9×2 inch round cake pans, dust the insides with flour, tap out the excess, and line the bottoms of the pans with parchment or wax paper. Put the pans on a baking sheet. ", "<em>To make the cake:</em>", "Sift together the cake flour, baking powder, baking soda, and salt."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To make the cake:</em><br/>\nSift together the cake flour, baking powder, baking soda, and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with a stand mixer, preferably fitted with a paddle attachment, or with a hand mixer in a large bowl, beat the butter on medium speed until soft and creamy.  Add the sugar and beat for another 3 minutes. Add the eggs one by one, and then the yolk, beating for 1 minute after each addition. Beat in the vanilla; don’t be concerned if the mixture looks curdled. Reduce the mixer speed to low and add the dry ingredients alternately with the buttermilk, adding the dry ingredients in 3 additions and the milk in 2 (begin and end with the dry ingredients); scrape down the sides of the bowl as needed and mix only until the ingredients disappear into the batter. Divide the batter evenly between the two pans and smooth the tops with a rubber spatula. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 28 to 30 minutes, rotating the pans at the midway point. When fully baked, the cakes will be golden and springy to the touch and a thin knife inserted into the centers will come out clean. Transfer the cakes to a rack and cool for about 5 minutes, then run a knife around the sides of the cakes, unmold them, and peel off the paper liners. Invert and cool to room temperature right-side up. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To make the extract:</em><br/>\nStir the espresso powder and boiling water together in a small cup until blended. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the syrup:<br/>\nStir the water and sugar together in a small saucepan and bring just to a boil. Pour the syrup into a small heatproof bowl and stir in 1 tablespoon of the espresso extract and the liqueur or brandy; set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To make the filling and frosting:</em><br/>\nPut the mascarpone, sugar, vanilla, and liqueur in a large bowl and whisk just until blended and smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with the stand mixer with the whisk attachment or with a hand mixer, whip the heavy cream until it holds firm peaks. Switch to a rubber spatula and stir about one quarter of the whipped cream into the mascarpone. Fold in the rest of the whipped cream with a light touch. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To assemble the cake:</em><br/>\nIf the tops of the cake layers have crowned, use a long serrated knife and a gentle sawing motion to even them. Place one layer right-side up on a cardboard round or a cake plate protected with strips of wax or parchment paper. Using a pastry brush or a small spoon, soak the layer with about one third of the espresso syrup. Smooth some of the mascarpone cream over the layer – user about 1 1/4 cups – and gently press the chopped chocolate into the filling. Put the second cake layer on the counter and soak the top of it with half the remaining espresso syrup, then turn the layer over and position it, soaked side down, over the filling. Soak the top of the cake with the remaining syrup. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For the frosting, whisk 1 to 1 1/2 tablespoons of the remaining espresso extract into the remaining mascarpone filling. Taste the frosting as you go to decide how much extract you want to add. If the frosting looks as if it might be a little too soft to spread over the cake, press a piece of plastic wrap against its surface and refrigerate it for 15 minutes or so. Refrigerate the cake too. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With a long metal icing spatula, smooth the frosting around the sides of the cake and over the top. If you want to decorate the cake with chocolate-covered espresso beans, press them into the filling, making concentric circles of beans or just putting some beans in the center of the cake. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Refrigerate the cake for at least 3 hours (or for up to 1 day) before serving – the elements need time to meld.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, dust the top of the cake with cocoa. I cut a star shape out of waxed paper and placed it lightly over the cake, and shaved a layer of chocolate over it with a microplane, before carefully removing the star to leave a stenciled shape. </p>"}], "link": "https://smittenkitchen.com/2007/11-tiramisu-cake"}