{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/460-words-and-no-mention-of-proust-oh-wait1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, french, photo", "name": "Classic Madeleines [Madeleines Classiques]", "author": {"@type": "Organization", "name": "\nAdapted from Patisserie Lerch, via Paris Sweets"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["3/4 cup (95 grams) all-purpose flour", "1/2 teaspoon double-acting baking powder", "2 large eggs, at room temperature", "1/2 cup (100 grams) sugar", "Grated zest of 1 lemon", "2 teaspoons vanilla extract", "5 tablespoons (2 1/2 ounces; 70 grams) unsalted butter, melted and cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3/4 cup (95 grams) all-purpose flour<br/>\n1/2 teaspoon double-acting baking powder<br/>\n2 large eggs, at room temperature<br/>\n1/2 cup (100 grams) sugar<br/>\nGrated zest of 1 lemon<br/>\n2 teaspoons vanilla extract<br/>\n5 tablespoons (2 1/2 ounces; 70 grams) unsalted butter, melted and cooled</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour and baking powder and keep close at hand. Working in a mixer fit with the whisk attachment, beat the eggs and sugar together on medium-high speed until they thicken and lighten in color, 2 to 4 minutes. Beat in the lemon zest and vanilla. Switch to a large rubber spatula and gently fold in the dry ingredients, followed by the melted butter. Cover the batter with plastic wrap, pressing the wrap against the surface to create an airtight seal, and chill for at least 3 hours, perhaps longer–chilling helps the batter develop its characteristic crown, known as the hump or the bump. (The batter can be kept tightly covered in the refrigerator for up to 2 days.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 400 degrees F (200 degrees C). If your Madeleine pan is <i>not</i> nonstick, generously butter it, dust the insides with flour and tap out the excess. If the pan is nonstick, you still might want to give it an insurance coating of butter and flour. If it is silicone, do nothing. No matter what kind of pan you have, place it on a baking sheet for easy transportability. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter among the molds, filling them almost to the top. Don’t worry about smoothing the batter, it will even out as it bakes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake large madeleines for 11 to 13 minutes, small ones for 8 to 10 minutes, or until the cookies are puffed and golden and spring back when touched. Pull the pan from the oven and remove the cookies by either rapping the pan against the counter (the madeleines should drop out) or gently running a butter knife around the edges of the cookies. Allow the madeleines to cool on a cooling rack. They can be served ever so slightly warm or at room temperature. </p>"}], "link": "https://smittenkitchen.com/2007/07-460-words-and-no-mention-of-proust-oh-wait"}