{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/strawberry-rhubarb-pie1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "fruit, photo, rhubarb, spring, strawberries, tarts pies", "name": "Lattice-Topped Strawberry Rhubarb Pie", "author": {"@type": "Organization", "name": "\nAdapted from Bon Appetit, April 1997"}, "description": "<p>Oddly enough, despite having a quarter-cup of cornstarch in it, my filling was on the wet side. However, when I came home I read all 134 comments about this recipe on Epicurious.com and found not a single mention of wetness, thus I’ve decided that it was just a freak fruit occurrence or bad measuring on my part, and not worth warning you about. Especially because this was gone in about 4.2 minutes, and I didn’t hear anyone complain.</p><p>Update: Because so many readers reported sloshiness — i.e. this pie tends to be too wet — I’ve updated this recipe with an improved version: Strawberry-Rhubarb Pie, Improved. It might be worth checking out before proceeding with this one.</p>", "totalTime": "", "recipeYield": "Serves 8", "recipeIngredient": ["RECIPE_SUBHED__1<u>For crust</u>", "3 cups all purpose flour", "2 1/2 teaspoons sugar", "3/4 teaspoon salt", "2/3 cup chilled solid vegetable shortening, cut into pieces", "1/2 cup plus 2 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into pieces", "10 tablespoons (about) ice water", "RECIPE_SUBHED__2<u>For filling</u>", "3 1/2 cups 1/2-inch-thick slices trimmed rhubarb (1 1/2 pounds untrimmed)", "1 16-ounce container strawberries, hulled, halved (about 3 1/2 cups)", "1/2 cup (packed) golden brown sugar", "1/2 cup sugar", "1/4 cup cornstarch", "1 teaspoon ground cinnamon", "1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For filling</u><br/>\n3 1/2 cups 1/2-inch-thick slices trimmed rhubarb (1 1/2 pounds untrimmed)<br/>\n1 16-ounce container strawberries, hulled, halved (about 3 1/2 cups)<br/>\n1/2 cup (packed) golden brown sugar<br/>\n1/2 cup sugar<br/>\n1/4 cup cornstarch<br/>\n1 teaspoon ground cinnamon<br/>\n1/4 teaspoon salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 large egg yolk beaten to blend with 1 teaspoon water (for glaze)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make crust:</u> Combine flour, sugar and salt in processor. [Alternately, you can use a pastry cutter to make your dough, as I did.] Using on/off turns, cut in shortening and butter until coarse meal forms. Blend in enough ice water 2 tablespoons at a time to form moist clumps. Gather dough into ball; cut in half. Flatten each half into disk. Wrap separately in plastic; refrigerate until firm, about 1 hour. (Can be made 1 day ahead. Keep chilled. Let dough soften slightly at room temperature before rolling.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Still worried about your pie dough? Check out my <a href=\"https://smittenkitchen.com/2007/11/pie-crust-101/\">Pie Dough 101</a>. I used this dough recipe this time, however, and found it just wonderful. It closely follows <a href=\"https://smittenkitchen.com/2006/11/cinnamon-sigh/\">one I posted a while back</a>.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make filling:</u> Preheat oven to 400°F. Combine first 7 ingredients in large bowl. Toss gently to blend.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble Pie:</u> Roll out 1 dough disk on floured work surface to 13-inch round. Transfer to 9-inch-diameter glass pie dish [er, I used a metal one and it was just fine]. Trim excess dough, leaving 3/4-inch overhang.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out second dough disk on lightly floured surface to 13-inch round. Cut into fourteen 1/2-inch-wide strips. Spoon filling into crust. Arrange 7 dough strips atop filling, spacing evenly. Form lattice by placing remaining dough strips in opposite direction atop filling. Trim ends of dough strips even with overhang of bottom crust. Fold strip ends and overhang under, pressing to seal. Crimp edges decoratively.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush glaze over crust. transfer pie to baking sheet. Bake 20 minutes. Reduce oven temperature to 350Â°F. Bake pie until golden and filling thickens, about another 25 minutes. [The original recipe suggested a total baking time of 1 hour and 55 minutes. No joke. Mine was done in just shy of an hour.] Transfer pie to rack and cool completely.</p>"}], "link": "https://smittenkitchen.com/2008/05-strawberry-rhubarb-pie"}