{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/09/black-and-white-cookies.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, cookie, photo", "name": "Black and White Cookies", "author": {"@type": "Organization", "name": "\nAdapted from a bunch of places, but mostly Zabar’s"}, "description": "<p>Traditional black and white cookies are BIG and LOUD, not unlike the New Yorkers that made them famous. Preferring everything on the daintier side, I’ve made them very small before, but this time went for a nice medium size.</p>", "totalTime": "", "recipeYield": "About 2 dozen very large cookies, 60 medium (I used a scoop 1 3/4 inches in diameter that yielded 3-inch cookies) or so many cookies that you might lose your mind frosting them if you go tinier. I’m just saying.", "recipeIngredient": ["1 3/4 cups granulated sugar", "1 cup unsalted butter (2 sticks), at room temperature", "4 large eggs, at room temperature", "1 1/2 cups milk", "1/2 teaspoon vanilla extract", "1/4 teaspoon lemon extract", "2 1/2 cups cake flour", "2 1/2 cups all-purpose flour", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "4 cups confectioners’ sugar", "1/3 to 1/2 cup water", "3 ounces very bitter or unsweetened chocolate", "1 teaspoon light corn syrup", "1 to 2 tablespoons unsweetened cocoa (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 3/4 cups granulated sugar<br/>\n1 cup unsalted butter (2 sticks), at room temperature<br/>\n4 large eggs, at room temperature<br/>\n1 1/2 cups milk<br/>\n1/2 teaspoon vanilla extract<br/>\n1/4 teaspoon lemon extract<br/>\n2 1/2 cups cake flour<br/>\n2 1/2 cups all-purpose flour<br/>\n1/2 teaspoon baking powder<br/>\n1/2 teaspoon salt<br/>\n4 cups confectioners’ sugar<br/>\n1/3 to 1/2 cup water<br/>\n3 ounces very bitter or unsweetened chocolate<br/>\n1 teaspoon light corn syrup<br/>\n1 to 2 tablespoons unsweetened cocoa (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Preheat oven to 375 degrees. Spray 2 baking sheets with nonstick spray, or line with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. In large mixing bowl, combine sugar and butter. Mix by machine or hand until fluffy. Add eggs, one at a time, then milk and vanilla and lemon extracts, and mix until smooth. Scrape down bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. In medium bowl, combine cake flour, all-purpose flour, baking powder and salt. Stir until mixed. Add dry mixture to the wet in batches, stirring well after each addition. Using a soup spoon, place heaping spoonfuls of the dough 2 inches apart on the baking sheets. Bake until edges begin to brown, 18 to 20 minutes. Cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Boil a cup or so of water in a small pot. Place confectioners’ sugar in large, heat-safe mixing bowl. Gradually stir in enough boiling water to the sugar to make a thick, spreadable mixture. Err on the side of caution because a too-thin frosting is hard to undo. Leave remaining boiling water on the stove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Spread frosting on half of the flat side of each cookie. Once all cookie halves have been frosted, place the bowl of the remaining frosting over the hot water and bring it back to a simmer (creating a double-boiler). Stir in the bitter or unsweetened chocolate until melted, as well as the light corn syrup. At this point, depending on the chocolate you used and your preferences, you might find the chocolate color to be a little lighter than the “black” of a black-and-white cookie. If so, I find that a tablespoon or so of cocoa mixed in darkens the color nicely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Ice the remaining half of the cookies with the chocolate frosting. I find that the chocolate–especially with cocoa in it–is especially prone to getting too dry, so don’t worry about whisking in an extra teaspoon of that hot water from time to smooth it back into a shiny frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>7. Let the frosting set. Store in an airtight container. These cookies keep for a few days, but I think they’re best on the first or second. Because of the cake nature of the bases, they can get stale quickly. However, this is really a non-issue as I have yet to make a batch that didn’t get polished off in no time.</p>"}], "link": "https://smittenkitchen.com/2008/09-black-and-white-cookies"}