{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/balsamic-glazed-sweet-and-sour-cippoline1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "onion, photo, side dish, summer, vegetarian", "name": "Balsamic Glazed Sweet and Sour Cipolinni", "author": {"@type": "Organization", "name": "\nAdapted from Mario Batali"}, "description": "<p>This recipe differs from the caramelized shallots in several ways: It is entirely cooked on the stove, it uses some tomato sauce to thicken up the sauce, balsamic replaces red wine vinegar, rosemary replaces parsley and cipollini with shallots. But the effect–which is Heaven On a Plate and also The Best Side Dish, Ever–is the same.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 pounds cipollini or small (1 1/2-inch) onions", "4 tablespoons virgin olive oil", "3 tablespoons sweet butter", "2 tablespoons sugar", "1 cup balsamic vinegar", "1/2 cup tomato sauce of your choice (I cheated and used canned. Don’t tell!)", "1 cup water", "1 teaspoon chopped fresh rosemary leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 pounds cipollini or small (1 1/2-inch) onions<br/>\n4 tablespoons virgin olive oil<br/>\n3 tablespoons sweet butter<br/>\n2 tablespoons sugar<br/>\n1 cup balsamic vinegar<br/>\n1/2 cup tomato sauce of your choice (I cheated and used canned. Don’t tell!)<br/>\n1 cup water<br/>\n1 teaspoon chopped fresh rosemary leaves</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blanche the onions in boiling water for one minute and let them cool so that they can easily be peeled. Peel the onions, leaving and washing any root strand you may find.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 12 to14-inch saute pan over a medium high flame, heat virgin olive oil until just smoking. Add butter and cook until foam subsides. Add onions and saute until light golden brown on all sides, about 8 to 10 minutes. [Batali doesn’t mention this but listen to me and my messily-splattered walls, floor, ceiling and arms that still hurt at the thought of it: this will splatter a lot. You either want to use a splatter screen, should you be savvy enough to have one, or a lid. Consider yourself warned.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add sugar, vinegar, tomato sauce and water and bring to a boil. Cook onions <s>uncovered</s> covered (again, the splatter effect is such that a lid is worth using) until just al dente, about 10 minutes. If liquid dissipates too quickly, add more water, a 1/4 cup at a time, realizing that it is essential not to overcook the onions. The sauce should just adhere to the onions. Remove from saute pan to an earthenware dish and hold in a warm place, or allow to cool if you are serving them later or as an antipasto. Sprinkle with rosemary as a garnish.</p>"}], "link": "https://smittenkitchen.com/2008/09-balsamic-glazed-sweet-and-sour-cippoline"}