{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pepita-brittle1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "candy, photo", "name": "Pepita Brittle", "author": {"@type": "Organization", "name": "\nAdapted liberally from Karen Demasco of Craft and Craftbar via NYMag.com and Wednesday Chef"}, "description": "<p>You can make this brittle with anything: peanuts, cashews or another nut, sesame instead of pumpkin seeds or perhaps even your leftover pumpkin seeds from your jack-o-lantern (not that I’ve tested that out, so do let us know if it works for you). But I love it with pepitas because they’re light and crisp, and with a tiny air pocket in the middle, they snap, crackle and pop delightfully when they hit the hot syrup.</p><p>The best part of this is that you don’t need to use a candy thermometer, you can simply eyeball it. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["Vegetable-oil spray or 1 teaspoon butter, for lining the tray", "2 cups sugar", "4 ounces (1 stick) salted or unsalted butter", "1/3 cup light corn syrup", "1/2 teaspoon baking soda", "2 teaspoons to 1 1/2 tablespoons coarse or flaky sea salt (use less if you’re using salted butter)", "1 1/2 cups of raw, unroasted pepitas (they toast in the syrup) or 12 ounces (3/4 pound) roasted, salted nuts, not chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Vegetable-oil spray or 1 teaspoon butter, for lining the tray<br/>\n2 cups sugar<br/>\n4 ounces (1 stick) salted or unsalted butter<br/>\n1/3 cup light corn syrup<br/>\n1/2 teaspoon baking soda<br/>\n2 teaspoons to 1 1/2 tablespoons coarse or flaky sea salt (use less if you’re using salted butter)<br/>\n1 1/2 cups of raw, unroasted pepitas (they toast in the syrup) or 12 ounces (3/4 pound) roasted, salted nuts, not chopped</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a 12x16x1/2-inch sheet baking pan with parchment paper and lightly coat it with vegetable spray or butter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the sugar, butter, corn syrup, and 1/2 cup plus 2 tablespoons water to a large saucepan, and stir together until all the sugar is wet. Cook over high medium-high, but watch it carefully as it <a href=\"http://www.flickr.com/photos/smitten/2990448718/in/photostream\">will foam up quite a bit</a> and you might need to dial back the heat to medium until it begins to thicken.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once the mixture turns a medium golden (takes at least 10 minutes) immediately remove from the heat, and carefully whisk in the baking soda followed by the salt (taking care, as the caramel will rise in the pan and bubble some more). Switch to a wooden or metal spoon, and fold in the pepitas or nuts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Quickly pour the mixture onto the sheet pan, and spread it out over the pan using the back of the spoon before it starts to harden. Alternately, you can slide the parchment paper out of the baking pan and onto a counter, cover it with another sheet, and use a rolling pin, pressing down hard, to roll it out as flat and thin as you would like.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>At this point you can either let it cool completely (pulling off the top sheet of parchment, if you use the rolling pin technique) and break it into bite-size pieces with the back of a knife or other blunt object <i>or</i>, while it is still fairly hot and pliable, cut it into a shape of your choice (I went for long, thinnish strips) and let the pieces cool, separated on parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The brittle can be stored at room temperature, in an airtight container, for up to two weeks. I like to separate the pieces between layers of parchment or waxed paper, as a little humidity can cause them to stick together.</p>"}], "link": "https://smittenkitchen.com/2008/11-pepita-brittle"}