{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/homemade-devil-dog-ding-dong-or-hostess-cake1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, chocolate, photo", "name": "Chocolate Cake Layers", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["3 ounces fine-quality semisweet chocolate such as Callebaut", "1 1/2 cups hot brewed coffee", "3 cups sugar", "2 1/2 cups all-purpose flour", "1 1/2 cups unsweetened cocoa powder (not Dutch process)", "2 teaspoons baking soda", "3/4 teaspoon baking powder", "1 1/4 teaspoons salt", "3 large eggs", "3/4 cup vegetable oil", "1 1/2 cups well-shaken buttermilk", "3/4 teaspoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 ounces fine-quality semisweet chocolate such as Callebaut<br/>\n1 1/2 cups hot brewed coffee<br/>\n3 cups sugar<br/>\n2 1/2 cups all-purpose flour<br/>\n1 1/2 cups unsweetened cocoa powder (not Dutch process)<br/>\n2 teaspoons baking soda<br/>\n3/4 teaspoon baking powder<br/>\n1 1/4 teaspoons salt<br/>\n3 large eggs<br/>\n3/4 cup vegetable oil<br/>\n1 1/2 cups well-shaken buttermilk<br/>\n3/4 teaspoon vanilla</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300°F. and grease pans. Line bottoms of 2 10-inch* round cake pans with wax paper and grease paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop chocolate and in a bowl combine with hot coffee. Let mixture stand, stirring occasionally, until chocolate is melted and mixture is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Into a large bowl sift together sugar, flour, cocoa powder, baking soda, baking powder, and salt. In another large bowl with an electric mixer beat eggs until thickened slightly and lemon colored (about 3 minutes with a standing mixer or 5 minutes with a hand-held mixer). Slowly add oil, buttermilk, vanilla, and melted chocolate mixture to eggs, beating until combined well. Add sugar mixture and beat on medium speed until just combined well. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter between pans and bake in middle of oven until a tester inserted in center comes out clean, 1 hour to 1 hour and 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool layers completely in pans on racks. Run a thin knife around edges of pans and invert layers onto racks. Carefully remove wax paper and cool layers completely. Cake layers may be made 1 day ahead and kept, wrapped well in plastic wrap, at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* <b>Note</b>: This cake will overflow if baked in 9-inch cake pans. If you only have 9-inch pans, you might want to 2/3 the cake recipe instead, as following: 2 ounces chocolate, 1 cup coffee, 2 cups sugar, 1 2/3 cup flour, 1 cup cocoa, 1 1/3 teaspoons baking soda, 1/2 tsp. baking powder, 2 eggs, 1/2 cup oil, 1 cup buttermilk, 1/2 teaspoon vanilla, etc. and reduce the baking time by at least ten minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Marshmallow, or Seven Minute Frosting</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 large egg whites<br/>\n1/2 cup sugar<br/>\n1/4 cup light corn syrup<br/>\n2 tablespoons water<br/>\n1 1/2 teaspoons pure vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine frosting ingredients with a pinch of salt in a metal bowl set over a saucepan of simmering water and beat with a handheld electric mixer at high speed until frosting is thick and fluffy, 6 to 7 minutes. Remove bowl from heat and continue to beat until slightly cooled. Use frosting the day it is made. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Ganache Frosting</b><br/>\n(Used in the first and second options below)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 pound fine-quality semisweet chocolate such as Callebaut<br/>\n1/2 cup heavy cream<br/>\n1 tablespoon sugar<br/>\n1 tablespoons light corn syrup<br/>\n1/4 stick (2 tablespoons) unsalted butter</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finely chop chocolate. In a 1 1/2- to 2-quart saucepan bring cream, sugar, and corn syrup to a boil over moderately low heat, whisking until sugar is dissolved. Remove pan from heat and add chocolate, whisking until chocolate is melted. Cut butter into pieces and add to frosting, whisking until smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer frosting to a bowl and cool, stirring occasionally, until spreadable (depending on chocolate used, it may be necessary to chill frosting to spreadable consistency). I found that stirring this over a bowl of ice water did a great job of cooling it off quickly and evenly. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread frosting over top and sides of cake. Chilling the cake will harden the chocolate coating. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Make Your Own Hostess Cupcake, Ding Dong, Ring Ding, King Don Cake:</b> Bake two cake layers as directed. Halve one layer horizontally into two thin layers. Place the first one on a cake plate. Take the second cake and cut a large hole out of the center, about 6-inches across — you won’t be using this. As carefully as possible, place this on top of the halved cake layer on the stand. Fill the entire cut-out area with frosting, leaving a half cup aside if you wish to pipe the signature loops or a message across the top. Lay the second halved layer on top of this, sealing the filling in. Spread the ganache coating over top and sides of cake. Once ganache is firm and chilled (the fridge does a great job of this, quickly), you can decorate it with a piping bag or a makeshift one, a sandwich bag with the corner snipped off. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Make Your Own Little Debbie Devil Square Cake:</b> Proceed as above, but bake the two layers in square cake pans. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Make Your Own Devil Dog Cake:</b> Bake two cake layers, in an oblong or long rectangular pan (you can round the edges after you bake it) if you have. Use the frosting only between the cake layers.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Make Your Own Chocolate Layer Cake with Marshmallow Frosting and Filling</b>, as you’ve seen in these pictures: Double the frosting recipe and use it as filling and coating on a two-layer round chocolate cake. Set about one cup aside if you wish to tint it and pipe decorations on the cake, either it with a piping bag or a makeshift one, a sandwich bag with the corner snipped off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>And while we’re at it, because it is in a similar vein–<b>Make Your Own Devils Food White Out Cake</b> in the style of the stunning one on the cover of Dorie Greenspan’s <a href=\"http://www.amazon.com/gp/product/0618443363?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0618443363\">Baking, From My Home to Yours</a>: Halve each cake layer horizontally, creating four thin layers. Break one into small crumbs; set crumbs aside. Using a double recipe of the marshmallow frosting, spread some between each cake layer, stacking as you go, and then cover the exterior in the remainder. Press the crumbled cake crumbs into the sides of the iced cake, and just over the top of the cake in a one-inch ring. </p>"}], "link": "https://smittenkitchen.com/2008/02-homemade-devil-dog-ding-dong-or-hostess-cake"}