{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/04/chocolate-walnut-cookies.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, passover, photo, round up", "name": "Chocolate-Walnut Cookies (Flourless)", "author": {"@type": "Person", "name": "Source:  Franӏois Payard's Chcolate Epihany "}, "description": "These cookies are crispy at the edges, chewy at the center and will filled your apartment with the most intense chocolate aroma. The first time I made these cookies (in 2008), mine flattened out a lot; it was not a good look, while for others, these were the puffed, crackly things you see in the current pictures (updated March 2018). In hindsight, I think I used too few walnuts, or got a little yolk mixed up in my egg whites. I’ve also found one more trick for extra height: if you scoop your cookies out on your tray and wait 30 minutes (up to an hour, if you have it, but 30 is fine) to bake them, they dome better. This is a technique used when making macarons, and I was delighted to find it works well here too. If you bake them right away, this too is fine, they just come out a little more flat (see here).", "totalTime": "2hr 30mins", "recipeYield": "20 to 24", "recipeIngredient": ["2 3/4 cups (285 grams or 10 ounces) walnut halves", "3 cups (360 grams) confectioners’ sugar", "1/2 cup plus 3 tablespoons (55 grams) unsweetened Dutch-process cocoa powder", "1/2 teaspoon kosher salt", "4 large egg whites, at room temperature", "1 tablespoon (15 ml) pure vanilla extract", "A few sea salt flakes to finish (if you wish)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees F. Spread the walnut halves on a large rimmed baking sheet and toast in the oven for about 9 minutes, until they are golden and fragrant. Let cool slightly, then transfer the walnut halves to a work surface and coarsely chop them. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position two racks in the upper and lower thirds of the oven and lower temperature to 325 degrees F. Line two large baking sheets with parchment paper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk (or combine in an electric mixer on low speed) the confectioner’ sugar with the cocoa powder and salt followed by the chopped walnuts. While whisking (or once you change the speed to medium), add the egg whites and vanilla extract and beat just until the batter is moistened (do not overbeat or it will stiffen; we’re not trying to whip these egg whites as we would for a meringue). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the batter onto the baking sheets in evenly spaced mounds — I use a just-over-1-tablespoon, or #40 scoop. If you can spare the time, letting them rest at room temperature on their trays for 30 minutes (and up to 60), I find they get a taller dome in the oven, but it’s also fine to bake them right away. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 14 to 16 minutes, until the tops are glossy and lightly cracked; shift the pans from front to back and top to bottom halfway through to ensure even baking. Slide the parchment paper (with the cookies) onto 2 wire racks. Let cookies cool completely, and store in an airtight container for up to 3 days."}], "link": "https://smittenkitchen.com/2008/04-chocolate-walnut-cookies-more-flourless-desserts"}