{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/03/whole-wheat-penne-with-cauliflower-and-walnuts1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cauliflower, pasta, photo, quick, vegetarian, weeknight favorite", "name": "Whole Wheat Pasta with Cauliflower, Walnuts and Ricotta Salata", "author": {"@type": "Organization", "name": "\nChez Panisse Vegetables"}, "description": "<p>One of the loveliest things about this recipe–and there are many, in my mind–is the way the recipe is laid out. It is as if Alice Waters in the kitchen with you, telling you that you can just chop all that while the water boils and really explaining the central tenet of this recipe: cauliflower that is cooked to a crunch, not steamed and for heaven’s sake, not boiled. She also thinks you should have this with a crisp white wine–for real!</p>", "totalTime": "", "recipeYield": "Serves 6", "recipeIngredient": ["2 heads cauliflower", "1 medium onion", "4 cloves garlic", "1 pound whole-wheat pasta", "Extra-virgin olive oil", "Salt and pepper", "1 pinch red pepper flakes", "White wine vinegar", "1/2 lemon", "1/2 cup toasted walnuts", "4 ounces ricotta salata or feta cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 heads cauliflower<br/>\n1 medium onion<br/>\n4 cloves garlic<br/>\n1 pound whole-wheat pasta<br/>\nExtra-virgin olive oil<br/>\nSalt and pepper<br/>\n1 pinch red pepper flakes<br/>\nWhite wine vinegar<br/>\n1/2 lemon<br/>\n1/2 cup toasted walnuts<br/>\n4 ounces ricotta salata or feta cheese</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a large pot of water on to boil. Cut the cauliflower into small flowerets. Peel the onion and slice it very thin. Peel and finely chop the garlic. Put the pasta on to cook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Saute the cauliflower in olive oil in a large saute pan. When the cauliflower begins to soften, season with salt and pepper and add the sliced onion and red pepper flakes. Saute over medium to high heat until the vegetables are brown and tender. The cauliflower should still be slightly crunchy and should not taste steamed. Add the garlic and remove from the heat, tossing and stirring so the garlic doesn’t burn; if it starts to brown, add a splash of water. Add a few drops each of vinegar and lemon juice and the toasted walnuts. Taste and correct the seasoning. When the pasta is done, drain and add to the cauliflower, adding enough extra-virgin olive oil to coat the pasta thoroughly, toss together and serve, with the cheese crumbled over the dish.</p>"}], "link": "https://smittenkitchen.com/2008/03-pasta-with-cauliflower-walnuts-and-feta"}