{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/05/cherry-cornmeal-upside-down-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, cherries, everyday cakes, fruit, photo, summer", "name": "Cherry Cornmeal Upside-Down Cake", "author": {"@type": "Person", "name": "Source: Bon Appetit, June 2008"}, "description": "This recipe got a light tune-up in 2019: simplified directions that will require fewer bowls (hooray) and added weights. This means we can make it more often.", "totalTime": "2hr 30mins", "recipeYield": "8", "recipeIngredient": ["12 tablespoons (3/4 cup or 170 grams) unsalted butter at room temperature, divided", "1/4 cup (50 grams), packed dark brown sugar", "2 teaspoons (10 ml) balsamic vinegar", "3 cups pitted fresh Bing or another dark sweet cherry (about 21 ounces or 595 grams unpitted)", "1 1/4 cups (165 grams) all purpose flour", "1/4 cup (35 grams) yellow cornmeal (ideally stone-ground medium grind)", "2 teaspoons baking powder", "1/4 teaspoon fine sea or table salt", "2 large eggs, separated", "1/4 teaspoon cream of tartar", "1 cup (200 grams) granulated sugar", "3/4 teaspoon vanilla extract", "1/2 cup (120 ml) whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat to 350°F. Combine 1/4 cup (55 grams) of the butter with brown sugar and vinegar in 10- to 11-inch ovenproof skillet with 2-inch-high sides. Stir over medium heat until butter melts and sugar dissolves, about 2 minutes. Increase heat to high; add cherries and bring to simmer. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk flour, cornmeal, baking powder, and salt in medium bowl to blend. Using electric mixer, beat egg whites in another medium bowl until foamy. Add cream of tartar and beat until whites are stiff but not dry. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg yolks, 1/2 cup (115 grams) of remaining butter, sugar, and vanilla in a large bowl and beat (with same beaters used for egg whites, no need to clean) until pale and fluffy, about 3 minutes Add flour mixture alternately with milk in 2 additions each, beating just until blended and occasionally scraping down sides of bowl. Using clean dry beaters, Using rubber spatula, fold 1/4 of whites into batter to lighten slightly. Fold in remaining whites in 3 additions (batter will be thick). Spoon batter in dollops over cherries in skillet, then spread evenly with offset spatula to cover cherries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cake until top is golden brown and tester inserted into center comes out clean, about 45 minutes. Cool in skillet on rack 5 minutes. Run spatula around edges of cake to loosen. Place large serving platter upside down atop skillet. Using pot holders or oven mitts, firmly hold platter and skillet together and invert. Leave skillet atop cake 5 minutes. Remove skillet. If necessary, rearrange any cherries that may have become dislodged. Let cake cool at least 45 minutes. Cut cake into wedges and serve slightly warm or at room temperature."}], "link": "https://smittenkitchen.com/2008/05-cherry-cornmeal-upside-down-cake"}