{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/10/twice-baked-shortbread.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, photo", "name": "Twice-Baked Shortbread", "author": {"@type": "Person", "name": "Source: Alice Medrich's Pure Dessert"}, "description": "Medrich says that the secrets to tender, buttery, crunchy shortbread are letting the dough rest in the pan for at least two hours, or overnight, before baking and adding a second baking, to toast the cookies ever-so-slightly for extra flavor and crunch. Shortbread can keep for weeks in a sealed container, but I’ve never had any last that long.", "totalTime": "3 1/2 hours, mostly resting time", "recipeYield": "12 to 24 cookies, depending on how you cut them", "recipeIngredient": ["12 tablespoons (6 ounces or 170 grams) unsalted butter, melted and still warm", "5 tablespoons (60 grams) granulated sugar", "1 teaspoon vanilla extract or the seeds from half a vanilla bean", "1/4 teaspoon salt or a two solid pinches of flaky sea salt (such as Maldon)", "1 1/2 cups (190 grams or 6.75 ounces) all-purpose flour", "Turbinado, Demerara or another coarse sugar for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Equipment: A baking pan with a removable bottom, such as a 9 1/2-inch round or a 4 by 14-inch rectangular fluted tart pan (I am using this one), or a one-piece 8-inch square pan"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a pan with a removable bottom, grease the pan; if using the one-piece 8-inch pan, line it with aluminum foil, leaving an overhang on two opposite sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the melted butter with the sugar, vanilla of your choice, and salt. Add the flour and mix just until incorporated. Pat and spread the dough evenly in the pan. Let rest for at least 2 hours, or overnight (no need to refrigerate)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the lower third of the oven and preheat the oven to 300 degrees F."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the shortbread for 40 to 45 minutes, until barely golden at the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven, leaving the oven on. Lightly sprinkle the surface of the shortbread with sugar. Let the shortbread cool for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the shortbread from the pan, being careful to avoid breaking it. Use a thin sharp knife, or a sharp serrated knife, to cut it into oblong “fingers”, wedges, or squares. [I cut mine into 14 fairly large shortbread fingers, shown here, but might halve them next time for sharing.] Place the pieces slightly apart on a parchment-lined baking sheet and bake in the oven for another 15 minutes. Cool on a rack."}], "link": "https://smittenkitchen.com/2008/10-twice-baked-shortbread-other-lost-recipes"}