{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/12/braised-beef-short-ribs.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beef, freezer friendly, meat, photo, savory projects, winter", "name": "Braised Short Ribs with Potato Purée, Swiss Chard and Horseradish Cream", "author": {"@type": "Organization", "name": "\nAdapted from Sunday Suppers at Lucques"}, "description": "<p>I have adapted this recipe in just a couple ways, because honestly, it’s perfect, but being not in a restaurant kitchen with dish washing help I have tried to reduce the number of pots it requires and swap the potato puree (which, if you can even get your head around this, has twice the amount of cream and butter than my recipe below and then is passed through a fine-mesh tamis twice, when I draw the line at once…) with Cook’s Illustrated’s classic mashed potatoes, which never do me wrong and have never been the cause for any complaint. </p><p>Finally, we doubled the recipe so of course your portions will look a tad tinier.</p>", "totalTime": "", "recipeYield": "Serves 4 (generously) to 6", "recipeIngredient": ["6 large beef short ribs, about 14 to 16 ounces each (if ribs are tinier, buy by weight, not number)", "1 tablespoon plus 1 teaspoon thyme leaves, and 4 whole sprigs thyme", "1 tablespoon freshly cracked black pepper", "3 dozen small pearl onions", "1/2 cup extra-virgin olive oil", "1 cup diced onion", "1/3 cup diced carrot", "1/3 cup diced celery", "2 bay leaves", "2 tablespoons balsamic vinegar", "1 1/2 cups port", "2 1/2 cups hearty red wine", "6 cups beef or veal stock", "4 sprigs flat-leaf parsley", "2 bunches Swiss chard, cleaned, center ribs removed", "Kosher salt and freshly ground black pepper", "Horseradish Cream (recipe follows)", "Potato Purée/Mashed Potatoes (recipe follows)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Horseradish Cream (recipe follows)<br/>\nPotato Purée/Mashed Potatoes (recipe follows)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Season the short ribs with 1 tablespoon thyme and the cracked black pepper. use your hands to coat the meat well. Cover, and refrigerate overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Take the short ribs out of the refrigerator an hour before cooking, to come to room temperature. After 30 minutes, season them generously on all sides with salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When you take the ribs out of the refrigerator, preheat the oven to 425 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss the pearl onions with 2 tablespoons olive oil, 1 teaspoon thyme, 3/4 teaspoons salt, and a pinch of pepper. Spread them on a baking sheet and roast them about 15 minutes, until tender. When they have cooled, slip off the skins with your fingers and set aside. Turn the oven down to 325 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When it’s time to cook the short ribs, heat a large Dutch oven [or a large saute pan, if you would like to use a separate braising dish; I aimed to use fewer dishes]  over high heat for 3 minutes. Pour in 3 tablespoons olive oil, and wait a minute or two, until the pan is very hot and almost smoking. Place the short ribs in the pan, and sear until they are nicely browned on all three meaty sides. Depending on the size of your pan, you might have to sear the meat in batches. Do not crowd the meat or get lazy or rushed at this step; it will take at least 15 minutes. [I find this takes closer to 45 minutes if you’re really thorough. Be thorough!] When the ribs are nicely browned, transfer them to a plate to rest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the heat down to medium, and add the onion, carrot, celery, thyme springs, and bay leaves. Stir with a wooden spoon, scraping up all the crusty bits in the pan. Cook 6 to 8 minutes, until the vegetables just begin to caramelize. Add the balsamic vinegar, port, and red wine. Turn the heat up to high, and reduce the liquid by half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the stock and bring to a boil. Arrange ribs in the pot, lieing flat, bones standing up, in one layer. [If you used a saute pan for previous steps, transfer the ribs to a braising pan at this point.] Scrape any vegetables that have fallen on the ribs back into the liquid. The stock mixture should almost cover the ribs. Tuck the parsley sprigs in and around the meat. Cover tightly with aluminum foil and a tight-fitting lid if you have one. Braise in the oven for about 3 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To check the meat for doneness, remove the lid and foil, being careful of the escaping steam, and piece a short rib with a paring knife. When the meat is done, it will yield easily to a knife. Taste a piece if you are not sure. [If you would like to cook these a day ahead, this is where you can pause. The next day, you can remove the fat easily from the pot — it will have solidified at the top — bring these back to a simmer on the stove or in an oven, and continue.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let the ribs rest 10 minutes in their juices, and then transfer them to a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the oven up to 400 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the short ribs in the oven for 10 to 15 minutes to brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Strain the broth into a saucepan, pressing down on the vegetables with a ladle to extract all the juices. Skim the fat from the sauce (if you made these the day before, you will have already skimmed them) and, if the broth seems thin, reduce it over medium-high heat to thicken slightly. Taste for seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large saute pan over high heat for 2 minutes. Tear the Swiss chard into large pieces. Add 3 tablespoons olive oil to the pan, and stir in the cooked pearl onions. Add half the Swiss chard, and cook a minute or two, stirring the greens in the oil to help them wilt. Add a splash of water and the second half of the greens. Season with a heaping 1/4 teaspoon salt and a pinch of ground black pepper. Cook for a few more minutes, stirring frequently, until the greens are tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the swiss chard on a large warm platter, and arrange the short ribs on top. Spoon lots of braising juices over the ribs. Serve the potato puree and horseradish cream (recipes below) on the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Horseradish Cream</strong></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3/4 cup créme fraîche<br/>\n1 tablespoon prepared horseradish<br/>\nKosher salt and freshly ground black pepper</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the créme fraîche and horseradish in a small bowl. Season with 1/4 teaspoon salt and pepper. Taste for balance and seasoning.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Mashed Potatoes</strong><br/>\nCook’s Illustrated’s Master Recipe</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 pounds potatoes, scrubbed (I used Yukon Golds)<br/>\n8 tablespoons unsalted butter (1 stick, 4 ounces), melted<br/>\n1 cup half-and-half , warmed<br/>\n1 1/2 teaspoons table salt<br/>\nGround black pepper<br/>\nChives for garnish (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Place potatoes in large saucepan and cover with 1 inch water. Bring to boil over high heat; reduce heat to medium-low and simmer until potatoes are tender (a paring knife can be slipped into and out of center of potatoes with very little resistance), 20 to 30 minutes. Drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Set food mill or ricer over now empty but still warm saucepan. Spear potato with dinner fork, then peel back skin with paring knife. Repeat with remaining potatoes. Working in batches, cut peeled potatoes into rough chunks and drop into hopper of food mill or ricer. Process or rice potatoes into saucepan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Stir in butter with wooden spoon until incorporated; gently whisk in half-and-half, salt, and pepper to taste. Serve immediately.</p>"}], "link": "https://smittenkitchen.com/2008/12-braised-beef-short-ribs"}