{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/08/2804182114_6d9ebd8506_b.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bourbon, fruit, peach, photo, picnics, summer, tarts pies", "name": "Peach Hand Pies", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>There’s a bit of fussing with this recipe–chill, then cut, then chill, then roll, then chill, then fill, then chill again–but trust me when I say it is worth it. There’s a reason this is one of my favorite pastry doughs, because it never fails. Sure, you might be able to skip a chill or two, but the dough will be more difficult to work with and is less likely to keep its lovely shape while baked.</p><p>The dough is adapted from my favorite galette dough in the entire world. The bourbon peach was purely inspired, if I do say so myself.</p>", "totalTime": "", "recipeYield": "Makes 14 to 24 (depending on cutter size)", "recipeIngredient": ["For the pastry:", "2 1/2 cups all-purpose flour", "1/2 tsp. salt", "16 tablespoons (2 sticks, 8 ounces) unsalted butter, cut into", "pieces", "1/2 cup sour cream", "4 teaspoons fresh lemon juice", "1/2 cup ice water", "For the filling:", "2 pounds of peaches", "1/4 cup flour", "1/4 cup sugar", "Pinch of salt", "1 teaspoon bourbon", "1/2 teaspoon vanilla extract", "One egg yolk beaten with 2 tablespoons water (for egg wash)", "Coarse sanding sugar, for decoration"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One egg yolk beaten with 2 tablespoons water (for egg wash)<br/>\nCoarse sanding sugar, for decoration</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. To make the pastry, in a bowl, combine the flour and salt. Place the butter in another bowl. Place both bowls in the freezer for 1 hour. Remove the bowls from the freezer and make a well in the center of the flour. Add the butter to the well and, using a pastry blender, cut it in until the mixture resembles coarse meal. Make another well in the center. In a small bowl, whisk together the sour cream, lemon juice and water and add half of this mixture to the well. With your fingertips, mix in the liquid until large lumps form. Remove the large lumps and repeat with the remaining liquid and flour-butter mixture. Pat the lumps into a ball; do not overwork the dough. Cover with plastic wrap and refrigerate for 1 hour. If preparing ahead of time, the dough can be stored at this point for up to one month in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Divide the refrigerated dough in half. On a lightly floured work surface, roll out one half of the dough to 1/8-inch thickness. Using a 4 1/2-inch-round biscuit cutter, cut seven circles out of the rolled dough. Transfer the circles to a parchment-lined baking sheet, and place in the refrigerator to chill for about 30 minutes. Repeat the rolling, cutting, and chilling process with the remaining half of dough. (I used a 4-inch cutter–if you can call a “cutter” the tin edge of the container that holds my smaller round cutters–and managed to get 12 from each dough half, after rerolling the scraps.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Make the filling: Peel and chop the peaches into small bits (approx. 1/2-inch dice), much smaller than you’d use for a regular-sized pie. Mix them with the flour, sugar and pinch of salt, and add the bourbon and vanilla, if you wish.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Remove the chilled dough from the refrigerator, and let stand at room temperature until just pliable, 2 to 3 minutes. Spoon about 1 to 2 tablespoons filling (use the smaller amount for a 4-inch circle) onto one half of each circle of dough. Quickly brush a little cold water around the circumference of the dough, and fold it in half so the other side comes down over the filling, creating a semicircle. Seal the hand pie, and make a decorative edge by pressing the edges of the dough together with the back of a fork. Repeat process with remaining dough. Place the hand pies back on the parchment-lined baking sheet, and return to the refrigerator to chill for another 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Heat oven to 375 degrees. Remove the chilled hand pies from the refrigerator, cut a small slit in each and lightly brush with the egg yolk wash. Sprinkle sanding sugar generously over the pies, and place pies in the oven to bake. Bake until the hand pies are golden brown and just slightly cracked, about 20 minutes. Remove the pies from the oven, and let stand to cool slightly before serving.</p>"}], "link": "https://smittenkitchen.com/2008/08-bourbon-peach-hand-pies"}