{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-baked-brownie-spiced-up1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brownies blondies, chocolate, photo", "name": "The Baked Brownie, Spiced Up", "author": {"@type": "Organization", "name": "\nAdapted from Baked: New Frontiers in Baking and the Baked Bakery in Red Hook, Brooklyn"}, "description": "<p>So, of course the story is even more complicated than this. You see, my friend jotted down the recipe they were using back in the day for the chipotle brownie, so I could try it at home. But I lost it. For three years. And only found it recently, coicidentally, just a couple weeks before someone gave me a copy of the Baked cookbook. Which turned out to have their brownie recipe, improved over the years with more chocolate and more butter (thankyouverymuch) but no chipotle version. And I really had liked that chipotle version.</p><p>Below, I have cobbled together the spices from the older recipe with the current one so you can attempt an unofficial version of their very subtly spicy brownies. Not interested in spices? Just skip the chipotle, cardamom and cinnamon. Either way, welcome to your new brownie nirvana.</p>", "totalTime": "", "recipeYield": "24 brownies", "recipeIngredient": ["1 1/4 cups (155 grams) all-purpose flour", "1 teaspoon (5 grams) table salt", "2 tablespoons (10 grams) dark unsweetened cocoa powder", "1 to 1 1/2 teaspoons chipotle powder (I didn’t have this and used smoky spicy paprika, with a very similiar flavor profile, instead) (for the spicy version)", "3/4 teaspoon cinnamon (for the spicy version)", "1/4 teaspoon cardamom (for the spicy version)", "11 ounces (310 grams) dark chocolate (60 to 72% cacao), coarsely chopped", "1 cup (2 sticks, 8 ounces or 225 grams) unsalted butter, cut into 1-inch pieces", "1 teaspoon instant espresso powder", "1 1/2 cups (300 grams) granulated sugar", "1/2 cup (105 grams) firmly packed light brown sugar", "5 large eggs, at room temperature", "2 teaspoons (10 ml) pure vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4 cups (155 grams) all-purpose flour<br/>\n1 teaspoon (5 grams) table salt<br/>\n2 tablespoons (10 grams) dark unsweetened cocoa powder<br/>\n1 to 1 1/2 teaspoons chipotle powder (I didn’t have this and used smoky spicy paprika, with a very similiar flavor profile, instead) (for the spicy version)<br/>\n3/4 teaspoon cinnamon (for the spicy version)<br/>\n1/4 teaspoon cardamom (for the spicy version)<br/>\n11 ounces (310 grams) dark chocolate (60 to 72% cacao), coarsely chopped<br/>\n1 cup (2 sticks, 8 ounces or 225 grams) unsalted butter, cut into 1-inch pieces<br/>\n1 teaspoon instant espresso powder<br/>\n1 1/2 cups (300 grams) granulated sugar<br/>\n1/2 cup (105 grams) firmly packed light brown sugar<br/>\n5 large eggs, at room temperature<br/>\n2 teaspoons (10 ml) pure vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees F. Butter the sides and bottom of a 9 x 13 glass or light-colored metal baking pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk the flour, salt, cocoa powder and spices (chipotle, cinnamon and cardamom), if you’re using them,  together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the chocolate, butter, and instant espresso powder in a large bowl and set it over a saucepan of simmering water, stirring occasionally, until the chocolate and butter are completely melted and smooth.  Turn off the heat, but keep the bowl over the water and add the sugars. Whisk until completely combined, then remove the bowl from the pan. The mixture should be room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 3 eggs to the chocolate mixture and whisk until combined. Add the remaining eggs and whisk until combined. Add the vanilla and stir until combined. Do not overbeat the batter at this stage or your brownies will be cakey.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle the flour mixture over the chocolate mixture. Using a spatula (not a whisk), fold the flour mixture into the chocolate until just a bit of the flour mixture is visible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan and smooth the top. Bake in the center of the oven for 30 minutes, rotating the pan halfway through the baking time, until a toothpick inserted into the center of the brownies comes out with a few moist crumbs sticking to it. Let the brownies cool completely, then cut them int osquares and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tightly covered with plastic wrap, the brownies keep at room temperature for up to 3 days.</p>"}], "link": "https://smittenkitchen.com/2008/09-the-baked-brownie-spiced-up"}