{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/the-great-unshrinkable-sweet-tart-shell1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, tarts pies", "name": "The Great Unshrinkable Sweet Tart Shell", "author": {"@type": "Organization", "name": "\nAdapted from Dorie Greenspan"}, "description": "<p>My favorite part about this shell recipe and technique is that it doesn’t require pie weights. How cool is that?!</p>", "totalTime": "", "recipeYield": "Makes enough for one 9-inch tart crust", "recipeIngredient": ["1 1/2 cups (195 grams) all-purpose flour", "1/2 cup (60 grams) confectioner’s sugar", "1/4 teaspoon salt", "9 tablespoons (4 1/2 ounces or 130 grams) very cold (or frozen) unsalted butter, cut into small pieces", "1 large egg*"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 cups (195 grams) all-purpose flour<br/>\n1/2 cup (60 grams) confectioner’s sugar<br/>\n1/4 teaspoon salt<br/>\n9 tablespoons (4 1/2 ounces or 130 grams) very cold (or frozen) unsalted butter, cut into small pieces<br/>\n1 large egg*</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Pulse the flour, sugar and salt together in the bowl of a food processor. Scatter the pieces of butter over the dry ingredients and pulse until the butter is coarsely cut in. (You’re looking for some pieces the size of oatmeal flakes and some the size of peas.) Stir the yolk, just to break it up, and add it a little at a time, pulsing after each addition. When the egg is in, process in long pulses–about 10 seconds each–until the dough, which will look granular soon after the egg is added, forms clumps and curds. Just before you reach this stage, the sound of the machine working the dough will change–heads up. Turn the dough out onto a work surface and, very lightly and sparingly, knead the dough just to incorporate any dry ingredients that might have escaped mixing. Chill the dough, wrapped in plastic, for about 2 hours before rolling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. To roll the dough: Butter a 9-inch fluted tart pan with a removable bottom. Roll out chilled dough on floured sheet of parchment paper to 12-inch round, lifting and turning dough occasionally to free from paper. (Alternately, you can roll this out between two pieces of plastic, though flour the dough a bit anyway.) Using paper as aid, turn dough into 9-inch-diameter tart pan with removable bottom; peel off paper. Seal any cracks in dough. Trim overhang to 1/2 inch. Fold overhang in, making double-thick sides. Pierce crust all over with fork.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Alternately, you can press the dough in as soon as it is processed: Press it evenly across the bottom and up the sides of the tart shell. You want to press hard enough that the pieces cling to one another, but not so hard that it loses its crumbly texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Freeze the crust for at least 30 minutes, preferably longer, before baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. To fully or partially bake the crust: Center a rack in the oven and preheat the oven to 375 degrees F. Butter the shiny side of a piece of aluminum foil (or use nonstick foil) and fit the foil, buttered side down, tightly against the crust. And here is the very best part: Since you froze the crust, you can bake it without weights. Put the tart pan on a baking sheet and bake the crust for 20 to 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Carefully remove the foil. If the crust has puffed, press it down gently with the back of a spoon. Bake the crust about 10 minutes longer to fully bake it, or until it is firm and golden brown, brown being the important word: a pale crust doesn’t have a lot of flavor. (To partially bake it, only an additional 5 minutes is needed.) Transfer the pan to a rack and cool the crust to room temperature, and proceed with the rest of your recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> The dough can be wrapped and kept in the refrigerator for up to 5 days or frozen for up to 2 months. While the fully baked crust can be packed airtight and frozen for up to 2 months, the flavor will be fresher bake it directly from the freezer, already rolled out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>* Updated 2/4/09:</strong> In response to concerns (including mine!) about this crust crumbling easily when rolled out, I found that using the whole egg instead of just the egg yolk holds it together better, making it easy to roll out in one piece.</p>"}], "link": "https://smittenkitchen.com/2008/11-the-great-unshrinkable-sweet-tart-shell"}