{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/haricot-vert-with-shallots1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "green beans, photo, summer, vegetarian", "name": "Haricot Vert with Shallots", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>While I’m owning up to things here–you know, like ordering salads from diners that I could walk to sooner than the food would arrive–I need to tell you something else: I think these taste even better when you eat them with your fingers. Sure, looping the beans through the shallot rings is a bit of a challenge, but you’ll be rewarded with buttery, lemony fingers and really, and who wouldn’t be up for a challenge like that?</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1/2 pound of haricot vert, trimmed and tailed", "2 teaspoon butter", "1 small shallot, sliced", "Salt and pepper to taste", "2 tablespoons diced tomato", "Wedge of lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 pound of haricot vert, trimmed and tailed<br/>\n2 teaspoon butter<br/>\n1 small shallot, sliced<br/>\nSalt and pepper to taste<br/>\n2 tablespoons diced tomato<br/>\nWedge of lemon</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a pot of well-salted water to boil. Boil haricot vert for 3.5 minutes (yes, I honestly believe that this level of timed precision will be rewarded). Plunge them into an ice bath and drain the beans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In your empty pot (because we’re always looking to save dish-washing time in the smitten kitchen) melt two teaspoons of butter over medium heat. Add the shallot and saute them until they’re just translucent, not browned–about one to two minutes. Add the drained and cooled haricot vert back into the pot and reheat them in the butter and shallots. Season with salt and pepper. Spread haricot vert and shallot onto a plate, throw the diced tomato over them and squeeze a few drops of lemon juice* over the dish. Serve immediately. Eat with your fingers, if your name is Deb.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* <a href=\"http://davidlebovitz.com\">David</a> notes that lemon juice <a href=\"http://www.flickr.com/photos/smitten/2532311935/#comment72157605316576688\">discolors green beans</a> and he’s correct. But only if you don’t eat them quickly, which in our case was a non-issue. </p>"}], "link": "https://smittenkitchen.com/2008/05-haricot-vert-with-shallots"}