{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/09/raspberry-breakfast-bars.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bars, breakfast, elsewhere, fruit, photo, raspberries, travel", "name": "Raspberry Crumb Breakfast Bars", "author": {"@type": "Person", "name": "Source: Baked: New Frontiers in Baking"}, "description": "These aren’t, as the recipe notes warn, actually “crumb” bars, with the streuselly topping you might see on crumbles or coffee cakes. Instead, they’re more like a raspberry sandwich cookie, yet less sweet than a typical dessert, and more earnest somehow. I think you could easily swap the raspberries with blackberries.", "totalTime": "P0DT1H0M0S", "recipeYield": "12 to 24, depending on how you cut them", "recipeIngredient": ["1 1/2 cups (190 grams) all-purpose flour", "1 cup (190 grams) firmly packed dark brown sugar", "1 1/4 (120 grams) cups rolled oats", "3/4 teaspoon salt", "3/4 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon ground cinnamon", "3/4 cup (1 1/2 sticks, 170 grams) unsalted butter, cut into 1-inch pieces", "1/4 cup (50 grams) firmly packed dark brown sugar", "1 tablespoon grated lemon zest", "1/2 teaspoon ground cinnamon", "2 tablespoons (15 grams) all-purpose flour", "1 pound (455 grams) raspberries, fresh or frozen", "1/4 cup (60 ml) fresh lemon juice", "2 tablespoons (30 grams) unsalted butter, melted and cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust and crumb: Preheat the oven to 350°F. Butter the bottom and sides of a 9-by-13-inch glass or light-colored metal baking pan. Put a long piece of parchment paper in the bottom of the pan, letting the parchment extend up the two short sides of the pan and overhang slightly on both ends. (This will make it easy to remove the bars from the pan after they have baked.) Butter the parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour, brown sugar, oats, salt, baking powder, baking soda, and cinnamon in a food processor. Pulse in short bursts until combined. Add the butter and pulse until loose crumbs form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 1 1/2 cup of the mixture and set aside. (Note: The book suggests you reserve one cup only. My gut told me that was too little, and I upped it. I wanted to make sure the top of the raspberries were mostly covered, at least for packing purposes, and was glad I had changed it.) Pour the rest of the mixture into the prepared pan and use your hans or the back of a large wooden spoon to push the crust into an even layer at the bottom of the pan. The crust should touch the sides of the pan. Bake until golden brown, 12 to 15 minutes. Transfer to a wire rack and let the crust cool. Keep the oven on while you make the raspberry filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the raspberry filling: In a medium bowl, whisk the sugar, lemon zest, cinnamon and flour together. Add the raspberries, lemon juice and butter and use your hands to toss gently until the raspberries are evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble and bake the bars: Spread the raspberry filling evenly on top of the cooled crust. Sprinkle the reserved crust mixture evenly on top of the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 35 to 45 minutes, rotating the pan every 15 minutes, until the top is golden brown and the filling starts to bubble around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a wire rack to cool completely, then cut into squares and serve. The bars can be stored in the refrigerator in an airtight container for up to two days."}], "link": "https://smittenkitchen.com/2008/09-raspberry-breakfast-bars"}