{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/08/crisp-rosemary-flatbread.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, bread, party snacks, photo", "name": "Crisp Rosemary Flatbread", "author": {"@type": "Person", "name": "Source: Adapted from Gourmet, July 2008"}, "description": "New 2019 notes: Over the years, I’ve dropped a few things that are part of the original recipe: I prefer the flatbreads smaller (it’s a little easier to control their crisp and color), I don’t roll it on parchment (I find it more annoying than facilitating, and the parchment often burned), and I skip the branches of rosemary on top. I find the minced rosemary inside the cracker is sufficient to perfume the cracker without overwhelming it. Should you miss the original recipe, Epicurious has it. As I did in 2008, I do think this cracker could be good with other herbs, especially thyme, and/or a freshly ground black pepper.", "totalTime": "P0DT0H20M0S", "recipeYield": "3 large or 6 medium flatbreads", "recipeIngredient": ["1 3/4 cups (230 grams) unbleached all-purpose flour", "1 tablespoon chopped rosemary plus 2 (6-inch) sprigs (optional)", "1 teaspoon baking powder", "3/4 teaspoon kosher salt", "1/2 cup (120 ml) water", "1/3 cup (80 ml) olive oil plus more for brushing", "Flaky sea salt such as Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450°F with a heavy baking sheet on rack in middle. Lightly coat a large baking sheet with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together flour, chopped rosemary, baking powder, and salt in a large, wide bowl. Make a well in center, then add water and oil and gradually stir into flour with a wooden spoon until a dough forms. Use your hands to gently knead dough inside the bowl 4 or 5 times, until it comes together in a semi-smooth ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 3 large or 6 smaller pieces and roll out one piece at a time on an unfloured counter, to about 10-inch (for larger pieces of dough) or 7-inch rounds (smaller pieces) — shape can be rustic; dough should be thin. Lift flatbread onto prepared baking sheet. Repeat with remaining pieces of dough. I can sometimes squeeze 6 small flatbreads on a half-sheet pan; sometimes I need to bake 1 to 2 in a second batch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly brush tops with additional oil and scatter small clusters of rosemary leaves on top (if using), pressing in slightly. Sprinkle with sea salt. Bake until pale golden and browned in spots, 8 to 10 minutes, rotating flatbreads if needed on the pan for even color. Let cool then break into pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Flatbread can be made up to 4 days ahead and cooled completely, then kept in an airtight container at room temperature."}], "link": "https://smittenkitchen.com/2008/08-crisp-rosemary-flatbread"}