{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/seven-layer-rainbow-cookies1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, photo", "name": "Seven-Layer Cookies", "author": {"@type": "Organization", "name": "\nAlmost perfect as printed in Gourmet, December 2005, but with many added notes at the end"}, "description": "<p>I have so many extra hints/notes on these, I’ve moved them to the bottom. Read on!</p><p>Time: These take at least 11 hours from beginning to end, most of it inactive, but make sure you have a good 2 to 3 hour window </p>", "totalTime": "", "recipeYield": "Makes about 5 dozen cookies (or more, if you cut them as small as I did)", "recipeIngredient": ["4 large eggs, separated", "1 cup sugar", "1 (8-oz) can almond paste", "2 1/2 sticks (1 1/4 cups) unsalted butter, softened", "1 teaspoon almond extract", "2 cups all-purpose flour", "1/2 teaspoon salt", "25 drops red food coloring", "25 drops green food coloring", "1 (12-oz) jar apricot preserves, heated and strained", "7 oz fine-quality bittersweet chocolate (not unsweetened), chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 large eggs, separated<br/>\n1 cup sugar<br/>\n1 (8-oz) can almond paste<br/>\n2 1/2 sticks (1 1/4 cups) unsalted butter, softened<br/>\n1 teaspoon almond extract<br/>\n2 cups all-purpose flour<br/>\n1/2 teaspoon salt<br/>\n25 drops red food coloring<br/>\n25 drops green food coloring<br/>\n1 (12-oz) jar apricot preserves, heated and strained<br/>\n7 oz fine-quality bittersweet chocolate (not unsweetened), chopped</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Special equipment: a small offset spatula, a heavy-duty stand mixer if you have one; a hand-mixer should work as well</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put oven rack in middle position and preheat oven to 350°F. Butter a 13- by 9-inch baking pan and line bottom with wax paper, leaving a 2-inch overhang on 2 ends, then butter paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat whites in mixer fitted with whisk attachment at medium-high speed until they just hold stiff peaks. Add 1/4 cup sugar a little at a time, beating at high speed until whites hold stiff, slightly glossy peaks. Transfer to another bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Switch to paddle attachment, then beat together almond paste and remaining 3/4 cup sugar until well blended, about 3 minutes. Add butter and beat until pale and fluffy, about 3 minutes. Add yolks and almond extract and beat until combined well, about 2 minutes. Reduce speed to low, then add flour and salt and mix until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold half of egg white mixture into almond mixture to lighten, then fold in remaining whites gently but thoroughly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter among 3 bowls. Stir red food coloring into one and green food coloring into another, leaving the third batch plain. Set white batter aside. Chill green batter, covered. Pour red batter into prepared pan and spread evenly with offset spatula (layer will be about 1/4 inch thick).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake red layer 8 to 10 minutes, until just set. (It is important to undercook. They’ll look like they’re not done, but a tester does come out clean.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using paper overhang, transfer layer to a rack to cool, about 15 minutes. Clean pan, then line with parchment or wax paper and butter paper in same manner as above. Bake white layer in prepared pan until just set. As white layer bakes, bring green batter to room temperature. Transfer white layer to a rack. Prepare pan as above, then bake green layer in same manner as before. Transfer to a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When all layers are cool, invert green onto a parchment or wax-paper-lined large baking sheet. Discard paper from layer and spread with half of preserves. Invert white on top of green layer, discarding paper. Spread with remaining preserves. Invert red layer on top of white layer and discard wax or parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover with plastic wrap and weight with a large baking pan. Chill at least 8 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove weight and plastic wrap. Bring layers to room temperature. Melt chocolate in a double boiler or a metal bowl set over a saucepan of barely simmering water, stirring until smooth. Remove from heat. Keep chocolate over water. (Alternately, you can do what I did: melt the chocolate 3.5 ounces at a time just to make sure it doesn’t seize up between steps, though that shouldn’t be a problem if you only let it set for 15.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim edges of assembled layers with a long serrated knife. Quickly spread half of chocolate in a thin layer on top of cake. Chill, uncovered, until chocolate is firm, about 15 minutes. Cover with another sheet of wax paper and place another baking sheet on top, then invert cake onto sheet and remove paper. Quickly spread with remaining chocolate. Chill until firm, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut lengthwise into 4 strips (I cut them into more, because I wanted them 1 to 1 1/2 inches wide, as I remember them). Cut strips crosswise into 3/4-inch-wide cookies.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Cookies keep, layered between sheets of wax paper or parchment, in an airtight container at room temperature 2 weeks. They’ll keep even longer in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Three important notes:</u></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I struggled with three things in this recipe (the first two were mistakes, and both came back to bite me in the tuchus) so you won’t have to:</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. <i>Don’t stack cooled cakes:</i> Once my first two cake layers were cool (and still on their parchment liners) and I needed to make room on the cooling rack for the third one, I went ahead and stacked them, their liners between them. DON’T DO THIS. Not because they crush each other (they won’t) or because they’ll stick (they don’t) but because that paper liner is greased on both sides from baking and the chocolate shell never quite stuck right to the pink cake because of the grease accidentally left on it. I can’t tell you how many cookies were rejected because their chocolate fell off. It is too sad to discuss.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. <i>Be careful dividing your jam:</i> I mindlessly divided the jam wrong/unevenly and ended up with too much between one layer and too little between another. Too little was no biggie, but where there was too much it oozed out and was particularly difficult to keep stacked when sawing through with a serrated knife. So, if you’re using a scale to make two six-ounce divisions of jam, remember that you’ve probably strained out a good ounce or so of jam solids, or in other words DUH. Your divided amounts will be less than six ounces each.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. <i>They’re easier to cut when frozen:</i> Nevertheless, they tasted amazingly and I was all ready to do a victory lap around my wee kitchen counter, however, when I got to cutting them up and then it all went south. People, these were <i>trying</i> to cut. The problem lies within the differing textures of the layers — the top hard chocolate shell more benefits from a sharp serrated knife (a regular, even very sharp knife will crack the edges when you press down on it), the same serrated knife that gets gummed with jam and tries to pull the soft cake layers in between apart. It was exasperating. It didn’t go well. I packed up some for a party and stuffed the rest in the freezer, only to discover the next day that these cut <i>fantastically</i> when frozen. Seriously. Trust me. I have the gummy floor and gray hairs to prove it.</p>"}], "link": "https://smittenkitchen.com/2008/12-seven-layer-cookies"}