{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mollys-apple-tarte-tatin1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apple, fall, french, fruit, guest post, photo, tarts pies", "name": "Molly’s Apple Tarte Tatin", "author": {"@type": "Organization", "name": "\nAdapted from The Joy of Cooking"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crust</u>", "1 stick plus two tablespoons cold salted butter (5 ounces), ", "<a href=\"http://www.flickr.com/photos/smitten/2917330854/\">cut into cubes</a>", " and chilled in freezer", "1 tablespoon sugar (optional)", "1 1/2 cup flour", "3 to 6 tablespoons ice water", "RECIPE_SUBHED__2<u>Filling</u>", "7 medium apples (I’ve had good results with Granny Smith, Gala, McIntosh…use your favorite, but make sure they are very firm, fresh and flavorful.)", "1 stick (4 ounces) salted butter", "1 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Filling</u><br/>\n7 medium apples (I’ve had good results with Granny Smith, Gala, McIntosh…use your favorite, but make sure they are very firm, fresh and flavorful.)<br/>\n1 stick (4 ounces) salted butter<br/>\n1 cup sugar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Prepare Crust:</u> I always use the food processor for this. Pre-mix the flour and sugar in the food processor container, and cube the butter on a plate. Then put the dry ingredients and the butter in the freezer for a while. This will get everything, including the blade and container, nice and chilled. The colder everything is, the flakier and more tender your crust will be. Prepare about 1/3 cup ice water and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After you’ve chilled everything for at least 20 minutes, add the cubes of butter to dry ingredients and pulse until the largest pieces of butter are no bigger than tiny peas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the ice water a little at a time, processing just until the dough starts to come together into a mass. (it won’t quite be a “ball,” and it won‘t look smooth–you don’t want to overprocess it!) Turn out onto well-floured surface and pat together into a ball. Don’t handle the dough too much, or the warmth of your hands will start to melt the butter. Flour the top of the dough and use rolling pin to quickly press and roll the dough out into a <a href=\"http://www.flickr.com/photos/smitten/2916498977/\">10 to 11-inch circle</a>. Keep turning the dough as you do this to make sure it doesn’t stick to the rolling surface. Throw more flour underneath the dough if necessary. Check the crust to make sure it’s just big enough to <a href=\"http://www.flickr.com/photos/smitten/2916501587/in/photostream/\">cover the top of your tarte tatin pan</a>. Move the crust onto a piece of parchment paper or onto a floured rimless baking sheet, cover with plastic wrap and refrigerate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Prepare filling:</u> Preheat oven to 375° F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.flickr.com/photos/smitten/2917333406/\">Peel</a>, <a href=\"http://www.flickr.com/photos/smitten/2916493377/in/photostream/\">core</a> and quarter the apples. Don’t cut them into smaller pieces than quarters–the quarters shrink considerably during cooking. You can squeeze a bit of lemon on them, but it’s not necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over low heat in a heavy, ovenproof skillet measuring 7 to 8 inches across the bottom and 10 to 11 inches across the top, melt the stick of butter. Remove from heat, add the sugar and <a href=\"http://www.flickr.com/photos/smitten/2917350618/in/photostream/\">stir until blended</a>.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shake/tap the pan so the butter-sugar mixture distributes evenly across the bottom. <a href=\"http://www.flickr.com/photos/smitten/2917354892/in/photostream/\">Arrange apple quarters in pan</a>, first making a circle inside the edge of the pan. Place them on their sides and overlap them so you can fit as many as possible. Then fill the center of the pan; you may have some apple left over. Keep at least one extra apple quarter on hand–when you turn the apples over, they may have shrunk to the extent that you’ll need to cheat and fill in the space with an extra piece. This one piece won’t get quite as caramelized as the other pieces, but don’t worry–it will still cook through and no one will notice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return your pan to the stovetop on high heat. Let boil for 10 to 12 minutes or until the juices in the pan <a href=\"http://www.flickr.com/photos/smitten/2916614293/\">turn from golden in color to dark amber</a>. Remove from heat. With the tip of a sharp knife, <a href=\"http://www.flickr.com/photos/smitten/2916616573/in/photostream/\">turn apple slices over</a>, keeping them in their original places. If necessary, add an extra slice of apple to keep your arrangement intact. Return to the stovetop on high heat once more. <a href=\"http://www.flickr.com/photos/smitten/2916619005/in/photostream/\">Let cook another 5 minutes</a> and then remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"http://www.flickr.com/photos/smitten/2916620983/in/photostream/\">Place the crust on top of the apples</a> and brush off excess flour. Tuck edges under slightly, along the inside of the pan, being careful not to burn fingers. You can use your knife.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in oven until the top of the crust is golden-brown in color, about 25-35 minutes. Remove from oven and allow to cool on a rack about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a sharp knife along the inside edge of the pan. Place a plate or other serving dish on top of the pan and quickly flip over the whole shebang so the Tarte Tatin drops <a href=\"http://www.flickr.com/photos/smitten/2917467442/in/photostream/\">down onto the plate</a>. The pan will still be hot, so use potholders and be careful! Don’t burn yourself or drop stuff! If you are feeble and clumsy, get someone stronger and more coordinated than you to do this. Peek under the edge of the pan to see if the Tarte came out. You may need to bop the bottom of the pan with your potholder-encased fist for this to happen. If there are any pieces of apple left behind in the pan or otherwise out of place, carefully put them back where they are supposed to be. Voila! <a href=\"http://www.flickr.com/photos/smitten/2916626149/in/photostream/\">A beautiful TREAT!</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This keeps well for about a day at room temperature; if you have to refrigerate it, warm it up slightly before serving for optimum enjoyment.</p>"}], "link": "https://smittenkitchen.com/2008/10-mollys-apple-tarte-tatin"}