{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/07/herbed-summer-squash-and-potato-torte.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, potatoes, summer, summer squash, vegetarian, weeknight favorite", "name": "Herbed Summer Squash and Potato Torte", "author": {"@type": "Organization", "name": "\nAdapted from Bon Appetit, June 2001"}, "description": "<p>This torte can easily be made ahead and reheated as you need it for guests. In fact, it’s even better reheated because there is something about potatoes that have been cooked twice–they getting browner at the edges and more tender inside, creating an excellent contrast.</p><p>New note, 5/31/12: Just wanted to let you know that I made this the other night with the season’s first summer squash as a single torte in a 10-inch cast iron skillet. I created 4 layers of potatoes and 3 of the squash and it was a bit tall going into the oven, almost overflowing, but it absolutely bakes down into a lovely height. I recommend lightly buttering or oiling your foil if you use this method, so that it doesn’t stick to the top layer of potatoes before they shrink down. It needed about 10 minutes more baking time to get tender. Just like the original, we liked it even more reheated on day two (and three). But I think I will make it this way for now on because it felt simpler and heartier. It’s been a side dish for us for three nights.</p>", "totalTime": "", "recipeYield": "Makes 8 servings", "recipeIngredient": ["1 bunch green onions, thinly sliced", "1 cup grated Parmesan cheese", "2 tablespoons all-purpose flour", "1 tablespoon chopped fresh thyme leaves", "1 1/2 teaspoons salt", "3/4 teaspoon ground black pepper", "2 pounds Yukon Gold potatoes, peeled, cut into 1/8-inch-thick rounds", "12 ounces yellow crookneck squash or regular yellow or green summer squash, cut into 1/8-inch-thick rounds", "6 teaspoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 bunch green onions, thinly sliced<br/>\n1 cup grated Parmesan cheese<br/>\n2 tablespoons all-purpose flour<br/>\n1 tablespoon chopped fresh thyme leaves<br/>\n1 1/2 teaspoons salt<br/>\n3/4 teaspoon ground black pepper<br/>\n2 pounds Yukon Gold potatoes, peeled, cut into 1/8-inch-thick rounds<br/>\n12 ounces yellow crookneck squash or regular yellow or green summer squash, cut into 1/8-inch-thick rounds<br/>\n6 teaspoons olive oil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Butter two 8-inch-diameter cake pans. (Deb note: I had only a 9-inch pan around, so what you see in my pictures is slightly thinner.) Set aside 1/4 cup sliced green onions. Toss remaining green onions, cheese, flour, thyme, salt and pepper in medium bowl to blend.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Layer 1/6 of potatoes in concentric circles in bottom of 1 prepared pan, overlapping slightly. Layer 1/4 of squash in concentric circles atop potatoes. Drizzle with 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture. Repeat with 1/6 of potatoes, then 1/4 of squash and 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture. Top with 1/6 of potatoes. Drizzle with 1 teaspoon oil. Sprinkle with 1/6 of cheese mixture and press gently to flatten. Repeat procedure with second cake pan and remaining potatoes, squash, oil, and cheese mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover pans with foil. Bake until potatoes are almost tender, about 40 minutes. Remove foil; bake uncovered until tortes begin to brown and potatoes are tender, about 25 minutes longer. (Can be made 6 hours ahead. Cool. Cover with foil and chill. Rewarm, covered with foil, in 350°F oven until heated through, about 30 minutes.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut each torte into wedges. Sprinkle wedges with 1/4 cup green onions; serve.</p>"}], "link": "https://smittenkitchen.com/2008/07-herbed-summer-squash-and-potato-torte"}