{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pear-and-almond-tart1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "fall, french, fruit, pear, photo, tarts pies, thanksgiving", "name": "Best Sweet Tart Crust", "author": {"@type": "Organization", "name": "\nAdapted from a few Dorie Greenspan recipes"}, "description": "", "totalTime": "", "recipeYield": "Makes enough for one 9-inch tart crust", "recipeIngredient": ["1 1/2 cups (190 grams) all-purpose flour", "1/2 cup (60 grams) confectioner’s sugar", "1/4 teaspoon (1 to 2 grams) table salt", "1 stick plus 1 tablespoon (9 tablespoons, 4 1/2 ounces or 130 grams) very cold (or frozen) unsalted butter, cut into small pieces", "1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 cups (190 grams) all-purpose flour<br/>\n1/2 cup (60 grams) confectioner’s sugar<br/>\n1/4 teaspoon (1 to 2 grams) table salt<br/>\n1 stick plus 1 tablespoon (9 tablespoons, 4 1/2 ounces or 130 grams) very cold (or frozen) unsalted butter, cut into small pieces<br/>\n1 large egg yolk</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Put the flour, sugar and salt in the bowl of a food processor and pulse a few times to combine. Scatter the pieces of butter over the dry ingredients and pulse until the butter is coarsely cut in — you should have pieces the size of oatmeal flakes and some the size of peas. Stir the yolk, just to break it up, and add it a little at a time, pulsing after each addition. When the egg is in, process in long pulse about 10 seconds each until the dough, which will look granular soon after the egg is added, forms clumps and curds. Just before you reach this stage, the sound of the machine working the dough will change; heads up. Turn the dough out onto a work surface and, very lightly and sparingly, knead the dough just to incorporate any dry ingredients that might have escaped mixing. Chill the dough, wrapped in plastic wrap, for about 2 hours before rolling.*</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. To roll the dough: Butter a 9-inch fluted tart pan with a removable bottom. Roll out chilled dough on floured sheet of parchment paper to 12-inch round, lifting and turning dough occasionally to free from paper. Using paper as aid, turn dough into 9-inch-diameter tart pan with removable bottom; peel off paper. Seal any cracks in dough. Trim overhang to 1/2 inch. Fold overhang in, making double-thick sides. Pierce crust all over with fork. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Freeze the crust for at least 30 minutes, preferably longer, before baking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. To fully bake the crust: Center a rack in the oven and preheat the oven to 375°F. Butter the shiny side of a piece of aluminum foil (or use nonstick foil) and fit the foil, buttered side down, tightly against the crust. (Since you froze the crust, you can bake it without weights.) Put the tart pan on a baking sheet and bake the crust for 25 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Carefully remove the foil. If the crust has puffed, press it down gently with the back of a spoon (or prick it with the tip of a small knife). Bake the crust about 10 minutes longer, or until it is firm and golden brown, brown being the important word: a pale crust doesn’t have a lot of flavor. Transfer the pan to a rack and cool the crust to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Storing:</u> The dough can be wrapped and kept in the refrigerator for up to 5 days or frozen for up to 2 months. While the fully baked crust can be packed airtight and frozen for up to 2 months, the flavor will be fresher bake it directly from the freezer, already rolled out–just add about 5 minutes to the baking time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* <u>Alternate press-in technique:</u> If you want to use the press-in method, you can work with the dough as soon as it’s processed. Just press the dough evenly over the bottom and up the sides of the pan. Don’t be too heavy-handed; press the crust in so that the edges of the pieces cling to one another, but don’t press so hard that the crust loses its crumbly texture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Pear and Almond Tart</b><br/>\nAdapted from <a href=\"http://www.epicurious.com/recipes/food/views/231612\">Bon Appetit, February 2005</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’d like to use canned pears halves for this–it is trés French, you see–just drain the canned pears, dry them very well, and carry on.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Pears</u><br/>\n4 cups (950 ml) water<br/>\n1 1/4 cups (225 grams) sugar<br/>\n1 1/2 tablespoons (20 ml) fresh lemon juice<br/>\n3 medium-size firm but ripe Bosc pears, peeled (each about 7 ounces or 200 grams)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Almond Filling</u><br/>\n2/3 cup (75 grams) blanched slivered almonds<br/>\n1 tablespoon (10 grams) all purpose flour<br/>\n7 tablespoons (90 grams) sugar<br/>\n6 tablespoons (3 ounces or 85 grams) unsalted butter, room temperature<br/>\n1 large egg<br/>\n1/2 teaspoon almond extract or 2 teaspoons (10 ml) brandy (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 sweet tart shell, baked (recipe above) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Powdered sugar (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For pears: Bring 4 cups water, sugar, and lemon juice to boil in large saucepan over medium-high heat, stirring until sugar dissolves. Add pears. Reduce heat to medium and simmer until pears are very tender, turning occasionally, about 20 minutes. Cool pears in syrup. (Can be made 2 days ahead. Cover and refrigerate.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For almond filling: Finely grind almonds and flour in processor. Mix in 7 tablespoons sugar, then butter and flavorings (if using). Blend until smooth. Mix in egg. Transfer filling to medium bowl. Cover and chill at least 3 hours. (Can be made 2 days ahead. Keep chilled.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position rack in center of oven and preheat to 350°F. Spread almond filling evenly in baked tart crust. Stem pears and cut each in half lengthwise; scoop out cores. Cut each half crosswise into thin slices. Gently press each pear half to fan slices but keep slices tightly overlapped. Slide spatula under pears and arrange atop filling like spokes of wheel with narrow ends in center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake tart until golden and tester inserted into center of filling comes out clean, about 55 minutes. Cool tart in pan on rack. Push pan bottom up, releasing tart from pan. (Can be made 8 hours ahead. Let stand at room temperature.) Cut tart into wedges; sprinkle with powdered sugar, if desired, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>See also:</strong> A summer version — <a href=\"https://smittenkitchen.com/2007/08/tartlets-not-innocent/\">Plum-Almond Tart</a></p>"}], "link": "https://smittenkitchen.com/2008/02-pear-and-almond-tart"}