{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chocolate-hazelnut-biscotti1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, italian, photo", "name": "Chocolate Hazelnut Biscotti", "author": {"@type": "Organization", "name": "\nAdapted from The New York Times, 12/12/93"}, "description": "<p>This New York Times recipe is as old as time. I wish I could tell you how many recipes for biscotti I dug through before finding a couple that didn’t have butter in them, but I’m not sure I can even count that high. Suffice it to say, it took me to an article from 1993, a year that biscotti were all the rage but probably not for me as I was in … high school. (Sob.)</p><p>They are mildly sweet and chocolaty–they’re the exact opposite of a molten chocolate cake on the indulgent chocolate obsession sliding scale. They’re also quite easy to put together if you promise to watch out for one thing: this is the stickiest dough I have ever worked with and you cannot have too much flour down on your surface.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["Total time: 1 hour", "Makes about 60 biscotti ", "1 cup whole hazelnuts, preferably blanched", "2 1/2 cups flour, plus flour for work surface", "1/2 cup Dutch-style cocoa powder", "1 tablespoon espresso powder", "Pinch of salt", "1/2 teaspoon baking soda", "3/4 teaspoon baking powder", "4 large eggs", "1 1/3 cups sugar."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup whole hazelnuts, preferably blanched<br/>\n2 1/2 cups flour, plus flour for work surface<br/>\n1/2 cup Dutch-style cocoa powder<br/>\n1 tablespoon espresso powder<br/>\nPinch of salt<br/>\n1/2 teaspoon baking soda<br/>\n3/4 teaspoon baking powder<br/>\n4 large eggs<br/>\n1 1/3 cups sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Preheat oven to 350 degrees. Spread hazelnuts on baking sheet and toast about 10 minutes, until lightly browned. If hazelnuts are not blanched, toast them until the skins begin to crack, then remove them from oven and wrap them in clean linen or cotton towel (not terrycloth). Rub hot nuts to remove most of the skin. Set toasted nuts aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Sift the flour, cocoa, espresso powder, salt, baking soda and baking powder together and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Beat eggs lightly, just until blended, in mixing bowl with whisk or in electric mixer. Remove two tablespoons of egg mixture to small dish and set aside. Beat sugar into remaining eggs until blended. Stir in flour mixture to form soft dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Divide the dough in half and place one portion on a well-floured work surface. (She is not kidding about this.) With floured hands, pat it into a six-inch square. Scatter half the hazelnuts on the dough and press them into the surface. Roll the dough into a cylinder about 2 inches in diameter and 12 to 15 inches long. Line the baking sheet with parchment paper and place the roll of dough on the baking sheet. Repeat with the remaining dough. Brush the tops of both rolls with the reserved egg.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Place in the oven and bake about 15 minutes, until firm to the touch. (This took me until 20 to 25 minutes.) Transfer to a cutting board and cut on an angle into slices one-half-inch thick. (I found that letting them cool for five minutes made this easier, as well as a sharp knife with a tight serrate.) Return the slices to the baking sheet, laying them on their cut sides, and return them to the oven. Bake another 20 minutes, until they are crisp and dry. Allow to cool completely before storing or serving.</p>"}], "link": "https://smittenkitchen.com/2008/07-chocolate-hazelnut-biscotti"}