{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/spelt-everything-crackers1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, party snacks, photo", "name": "Spelt Everything Crackers", "author": {"@type": "Organization", "name": "\nAdapted from the New York Times Magazine, 11/28/08 who adapted it from the Hungry Ghost in Northampton, Mass."}, "description": "<p>If you check out this video from a kitchen even smaller than mine, you can see one of their recipe testers making these at home. It’s seriously that easy.</p>", "totalTime": "", "recipeYield": "Makes 1 large cracker sheet", "recipeIngredient": ["1/4 teaspoon salt", "1 1/2 cups white spelt flour, plus more for flouring surface", "Coarse sea salt, dried onion bits, poppy seeds and sesame seeds (for the everything bagel effect) or a seed combination of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/4 teaspoon salt<br/>\n1 1/2 cups white spelt flour, plus more for flouring surface<br/>\nCoarse sea salt, dried onion bits, poppy seeds and sesame seeds (for the everything bagel effect) or a seed combination of your choice</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Preheat the oven to 350 degrees. Dissolve the salt in 1/2 cup of cold water. Stir in the spelt flour until combined. Knead the dough a few turns until a ball forms.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Flour an overturned 12-by-17-inch cookie sheet and roll out the dough on top of it, using as much flour as needed to prevent sticking, until the dough covers the sheet from edge to edge. Do your best to get them as thin as possible, because the thicker parts become quite hard when baked. Using a spray bottle filled with water, spray the dough to give it a glossy finish. Prick the dough all over with a fork. If you choose, sprinkle with sea salt or seeds. For neat crackers, score the dough into grids.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Bake until the dough is crisp and golden and snaps apart, 15 to 25 minutes. (Check after 10 minutes to make sure it does not overcook.) Break into pieces and serve. </p>"}], "link": "https://smittenkitchen.com/2008/12-spelt-everything-crackers"}