{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/07/2691000910_676f814784_o.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "fruit, nectarine, photo, summer, tarts pies", "name": "Nectarine and Mascarpone Tart in a Gingernsap Crust", "author": {"@type": "Organization", "name": "\nAdapted from Bon Appetit, July 2002"}, "description": "<p>I made one blaring change to this recipe; I left out the candied ginger because for lack of a more eloquent way to put it, I just can’t stand the stuff. But that doesn’t mean that you can’t add it, if it’s your thing, or that the tart lacks if you skip it. I also increased the amount of crust by a bit–the original amount spread so thinly over my tart pan, it made me sad.</p><p>I’m also already envisioning alternative versions of this with chocolate wafer cookie crusts and strawberries or even graham crackers and mixed berries, or whatever you have on hand. I don’t think you could make this taste anything less than abundantly delicious.</p>", "totalTime": "", "recipeYield": "You’ll want to make this a few hours before you want to serve it, or the night before.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crust</u>", "37 gingersnap cookies, coarsely broken (about 9 ounces; about 3 1/4 cups plus 2 tablespoons of pieces)", "6 tablespoons unsalted butter, melted", "RECIPE_SUBHED__2<u>Filling</u>", "1 8-ounce container mascarpone cheese", "6 ounces cream cheese, room temperature", "1/4 cup sour cream", "1/4 cup sugar", "1 teaspoon grated lemon peel", "1/4 teaspoon vanilla extract", "1 tablespoon finely chopped crystallized ginger (optional)", "RECIPE_SUBHED__3<u>Topping</u>", "4 to 5 small nectarines, halved, pitted, cut into thin slices", "1/4 cup peach jam, warmed", "2 tablespoons finely chopped crystallized ginger (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Topping</u><br/>\n4 to 5 small nectarines, halved, pitted, cut into thin slices<br/>\n1/4 cup peach jam, warmed<br/>\n2 tablespoons finely chopped crystallized ginger (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For crust:</u> Preheat oven to 350°F. Finely grind gingersnaps in processor. Add butter and blend until crumbs are evenly moistened. Press mixture over bottom and up sides of 9-inch-diameter tart pan with removable bottom. (I like to use a cold metal measuring cup to get a nice, clear demarcation between the base and sides.) Bake crust until color darkens, pressing sides with back of spoon if beginning to slide, about 8 minutes. Cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For filling:</u> Beat first 6 ingredients in medium bowl until smooth. Beat in crystallized ginger if you’re using it. Spread filling in prepared crust. Cover loosely and refrigerate at least 2 hours and up to 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For topping:</u> Overlap nectarine slices atop filling in concentric circles. Brush with jam. Sprinkle with chopped crystallized ginger if you’re using it. (Mint makes an excellent garnish, if you’re skipping the ginger.) Serve, or refrigerate up to 6 hours.</p>"}], "link": "https://smittenkitchen.com/2008/07-nectarine-mascarpone-and-gingersnap-tart"}