{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/08/kefta-and-zucchini-kebabs.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "grilling, meat, photo, zucchini", "name": "Kefta and Zucchini Kebabs", "author": {"@type": "Organization", "name": "\nAdapted from a Gourmet in 1980 (which according to my recent statistics, is a year only about three-quarters of you remember)"}, "description": "<p>I suspect if you’re thinking this through, you’re imagining that it would be difficult bordering on impossible to threat raw meatballs on skewers and then somehow move them to a grill without them falling off–I know I was. Nevertheless, as tricky as that part is, and you should do so with the greatest of care and minimal movements (i.e., where it lands on the grill, let it stay), within two minutes the meatballs will be nicely firmed up and you’ll have no trouble rotating them.</p><p>I can’t wait to make this again the next time we have the chance to grill outside, but in the meanwhile, my new grill pan came through once again.</p>", "totalTime": "", "recipeYield": "Makes 6 servings.", "recipeIngredient": ["RECIPE_SUBHED__1<u>For sauce</u>", "1 cup plain yogurt (preferably whole-milk)", "2 tablespoons chopped fresh mint", "1 teaspoon minced garlic", "1/8 teaspoon salt", "RECIPE_SUBHED__2<u>For zucchini</u>", "3 tablespoons fresh lemon juice", "1 teaspoon sugar", "1/4 teaspoon salt", "1/4 teaspoon black pepper", "1/3 cup olive oil (we used about half of this)", "2 medium zucchini (1 1/4 lb total), cut crosswise into 1/2-inch-thick slices (don’t skim on their thickness, or you will have difficulty threading them, as we did)", "RECIPE_SUBHED__3<u>For kefta (meatballs)</u>", "2 slices firm white sandwich bread, torn into small pieces", "1 small onion, finely chopped (about 1 cup)", "1/4 cup loosely packed fresh parsley leaves", "1/4 cup loosely packed fresh cilantro leaves", "1 lb ground lamb (from shoulder) (or if, like Deb, you do not like lamb, dark turkey meat is an excellent substitution)", "1 teaspoon salt", "1/2 teaspoon ground allspice", "1/2 teaspoon cayenne", "1/4 teaspoon cinnamon", "1/4 teaspoon black pepper", "1/3 cup pine nuts, toasted and finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For kefta (meatballs)</u><br/>\n2 slices firm white sandwich bread, torn into small pieces<br/>\n1 small onion, finely chopped (about 1 cup)<br/>\n1/4 cup loosely packed fresh parsley leaves<br/>\n1/4 cup loosely packed fresh cilantro leaves<br/>\n1 lb ground lamb (from shoulder) (or if, like Deb, you do not like lamb, dark turkey meat is an excellent substitution)<br/>\n1 teaspoon salt<br/>\n1/2 teaspoon ground allspice<br/>\n1/2 teaspoon cayenne<br/>\n1/4 teaspoon cinnamon<br/>\n1/4 teaspoon black pepper<br/>\n1/3 cup pine nuts, toasted and finely chopped</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Special equipment: 12 (10-inch) wooden skewers, soaked in cold water for 30 minutes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make sauce:</u> Stir together yogurt, mint, garlic, and salt in a small bowl and chill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Prepare zucchini:</u> Whisk together lemon juice, sugar, salt, pepper, and oil in a large bowl and stir in zucchini slices. Marinate at room temperature while making meatballs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make meatballs:</u> Cover bread with water in a bowl and soak 10 minutes. Squeeze handfuls of bread to remove as much excess water as possible, then transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse onion and herbs in a food processor until finely chopped, then add to bread along with lamb, salt, spices, and pine nuts. Mix with your hands until well blended. Form lamb mixture into 36 balls (1 scant tablespoon each).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble and grill kebabs:</u> Prepare grill for cooking over medium-hot charcoal (moderate heat for gas; see cooks’ note below). Thread 6 meatballs 1/4 inch apart onto each of 6 skewers. Thread zucchini lengthwise onto remaining 6 skewers (5 slices per skewer), so cut sides are on the grill, leaving 1/4 inch between slices. Grill zucchini and lamb on oiled grill rack, turning over once, until golden and just cooked through, 4 to 6 minutes. Serve warm, with yogurt sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Grilling procedure:</u> On a charcoal grill: Open vents on bottom of grill, then light charcoal. When charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine heat for charcoal as follows. Hot: when you can hold your hand there for 1 to 2 seconds; medium-hot: 3 to 4 seconds; low: 5 to 6 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a gas grill: preheat burners on high, covered, 10 minutes, then, if necessary, reduce to heat specified in recipe.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>If you don’t have a grill:</u> Kebabs can be broiled on 2 large shallow baking pans 5 inches from heat, turning over once, until golden and just cooked through, 4 to 6 minutes.</p>"}], "link": "https://smittenkitchen.com/2008/08-kefta-and-zucchini-kebabs"}