{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/dimply-plum-cake1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, everyday cakes, fruit, photo, plum, summer", "name": "Dimply Plum Cake", "author": {"@type": "Organization", "name": "\nAdapted, barely, from Baking: From My Home to Yours"}, "description": "<p>This is a wonderful coffee cake–sturdy, comes together quickly, and absolutely perfect for this time of year. It would also work with several other kinds of fruit, including apricots, peaches, nectarines or even cherries. You can swap the orange zest for lemon, lime or even grapefruit and the spice too. (Dorie suggests apricots with orange and a bit of star anise, cherries with mint, peaches with lemon and some fresh basil, and so on, so have fun with it!)</p><p>Although I have seen this recipe on so many other blogs before, I realize that the version in my book is slightly different. Nevertheless, I still made a change, using cinnamon instead of the same amount of cardamom because, ugh, I just do not like cardamom and not even this cake could change my mind.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 1/2 cups all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon salt", "Scant 1/4 teaspoon ground cinnamon", "5 tablespoons unsalted butter, at room temperature", "3/4 cup (packed) light brown sugar", "2 large eggs", "1/3 cup flavorless oil, such as canola or safflower", "Grated zest of 1 orange", "1 1/2 teaspoons pure vanilla extract", "8 purple or red plums (or even Italian prune plums, when they are in season), halved and pitted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 cups all-purpose flour<br/>\n2 teaspoons baking powder<br/>\n1/4 teaspoon salt<br/>\nScant 1/4 teaspoon ground cinnamon<br/>\n5 tablespoons unsalted butter, at room temperature<br/>\n3/4 cup (packed) light brown sugar<br/>\n2 large eggs<br/>\n1/3 cup flavorless oil, such as canola or safflower<br/>\nGrated zest of 1 orange<br/>\n1 1/2 teaspoons pure vanilla extract<br/>\n8 purple or red plums (or even Italian prune plums, when they are in season), halved and pitted</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven to 350°F. Butter an 8-inch square baking pan, dust the inside with flour, tap out the excess and put the pan on a baking sheet. (Alternately, you can use <a href=\"http://www.amazon.com/gp/product/B000WLJJFE?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000WLJJFE\">this spray</a> to butter and flour, which is indeed my greatest baking Joy.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flour, baking powder, salt and cinnamon together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Working with a mixer, beat the butter at medium speed until it’s soft and creamy, about 3 minutes. Add the sugar and beat for another 3 minutes, then add the eggs, one at a time, and beat for a minute after each egg goes in. Still working on medium speed, beat in the oil, zest and vanilla; the batter will look smooth and creamy, almost satiny. Reduce the mixer speed to low and add the dry ingredients, mixing only until they are incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Run a spatula around the bowl and under the batter, just to make sure there are no dry spots, then scrape the batter into the pan and smooth the top. Arrange the plums cut side up in the batter–Dorie says she usually makes four rows of four plum halves each–jiggling the plums a tad just so they settle comfortably into the batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for about 30 to 40 minutes (Dorie says 40, mine was done in 30 so check early and often), or until the top is honey brown and puffed around the plums and a thin knife inserted into the center of the cake comes out clean. Transfer the cake to a rack and cool for 15 minutes during which time the plums juices will seep back into the cake then run a knife around the sides of the pan and unmold the cake. Invert and cool right side up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cool, I dusted mine with powdered sugar. (It soaks into the plums, but keeps the cake a speckly white.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can wrap the cake and keep it at room temperature for up to 2 days, during which time it will get softer and moister.</p>"}], "link": "https://smittenkitchen.com/2008/08-dimply-plum-cake"}