{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/12/grasshopper-brownies.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brownies blondies, chocolate, photo", "name": "Grasshopper Squares", "author": {"@type": "Organization", "name": " [aka Creme de Menthe Brownies]\nAdapted from Gourmet, December 2005"}, "description": "<p>Final note: With white chocolate, the quality is especially important. The original recipe’s comments on Epicurious are filled with complaint from people who used Ghirdelli and other white “chocolates” (filled with artificial ingredients) which split easily once heated and never came back together. This has happened to me before when I used Ghiradelli. Although pricier, both Valrhona and Callebaut make exceptional white chocolates; I used the latter.</p>", "totalTime": "", "recipeYield": "Makes anywhere from 72 normal-sized brownies to 117 one-inch squares (I think the perfect size)", "recipeIngredient": ["RECIPE_SUBHED__1<u>For brownie layer</u>", "1 1/2 sticks (3/4 cup) unsalted butter", "10 1/2 oz fine-quality bittersweet chocolate (not extra-bitter or unsweetened and no more than 60% cacao if marked), finely chopped", "1 1/2 cups packed light brown sugar", "3 large eggs, lightly beaten", "1 1/4 teaspoons vanilla", "3/4 cup all-purpose flour", "1/4 cup plus 2 tablespoons unsweetened Dutch-process cocoa powder", "3/4 teaspoon salt", "RECIPE_SUBHED__2<u>For mint ganache</u>", "1/2 cup heavy cream (see recipe notes)", "10 oz fine-quality white chocolate, chopped (see recipe notes)", "2 tablespoons green crème de menthe (I skipped this and found the mint flavor strong enough; compensated for the tinting with a single drop of green color)", "1 teaspoon peppermint extract", "RECIPE_SUBHED__3<u>For chocolate ganache</u>", "1 cup heavy cream (see recipe notes)", "10 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped", "RECIPE_SUBHED__4<u>Make brownie layer:</u>", "Put oven rack in middle position and preheat oven to 375°F. Lightly butter a 13- by 9-inch baking pan and line with 2 crisscrossed sheets of foil, leaving a 2 inch overhang on all sides. Butter foil."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make brownie layer:</u><br/>\nPut oven rack in middle position and preheat oven to 375°F. Lightly butter a 13- by 9-inch baking pan and line with 2 crisscrossed sheets of foil, leaving a 2 inch overhang on all sides. Butter foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter and chocolate with brown sugar in a 3-quart heavy saucepan over moderate heat, stirring occasionally, until smooth. Remove from heat. Whisk in eggs and vanilla until combined. Whisk in flour, cocoa, and salt until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread batter evenly in baking pan and bake until set and a wooden pick inserted in center comes out with moist crumbs adhering, about 20 minutes. Cool completely in pan on a rack, about 1 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make mint ganache:</u><br/>\nBring cream to a simmer in a 2- to 3-quart saucepan and remove from heat. Pour over white chocolate in a bowl. Let stand 1 minute, then whisk until smooth. Stir in crème de menthe and extract and chill, covered, stirring occasionally, until thick, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make chocolate ganache:</u><br/>\nBring cream to a simmer in a 2- to 3-quart saucepan and remove from heat. Pour over bittersweet chocolate in a bowl. Let stand 1 minute, then whisk until smooth. Chill, covered, stirring occasionally, until thick, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble layers:</u><br/>\nSpread mint ganache over top of cooled brownie in a thin even layer using offset spatula, then chill until firm but still slightly sticky, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread chocolate ganache over mint and chill until firm, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lift dessert out of pan using foil overhang. Run a heavy knife under hot water and wipe dry, then trim edges of dessert (1/4 inch off each side). Cut dessert into squares and peel from foil.</p>"}], "link": "https://smittenkitchen.com/2008/12-grasshopper-brownies"}