{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/shaker-lemon-pie1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "citrus, lemon, photo, tarts pies, winter", "name": "Shaker Lemon Pie", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>There are about as many Shaker Lemon Pie recipes out there as there are people who love it, but I have found them all largely the same–except for this one, which I’ve adapted from Saveur Magazine, which uses the same lemon-to-sugar proportion but adds some butter (always welcome), a little flour and insists that you let it macerate for almost a day. I will add to this that you should slice these as thin as your mandoline or adjustable-blade slicer will let you, and don’t be frightened if the rinds are still a bit bitter–it is all part of the pie’s charm.</p>", "totalTime": "", "recipeYield": "Makes one 9-inch pie", "recipeIngredient": ["2 large lemons, preferably Meyers", "2 cups sugar", "1/4 teaspoon salt", "4 eggs", "4 tablespons butter, melted", "3 tablespoons all-purpose flour", "1 egg white", "Coarse sugar, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 egg white<br/>\nCoarse sugar, for sprinkling</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dough for one double-crust pie [See recipes <a href=\"https://smittenkitchen.com/2007/11/pie-crust-101/\">here</a> and <a href=\"https://smittenkitchen.com/2008/11/pie-crust-102-all-butter-really-flaky-pie-dough/\">here</a>.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Thoroughly wash lemons, then dry with paper towel. Finely grate lemon zest into a bowl. Using a mandoline, slice lemons as paper thin as you can get them; remove and discard seeds. Add slices to zest and toss with sugar and salt. Cover and set aside at room temperature for 24 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F. Roll out half the dough 1/8 inch thick on a lightly floured surface, fit it into a 9-inch (1-quart) pie plate, and trim the edge, leaving a 1/2-inch overhang.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix the macerated lemon-sugar mixture with eggs, melted butter and flour until combined well. Pour in to prepared pie shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the remaining dough into a 12-inch round on a lightly floured surface, drape it over the filling, and trim it, leaving a 1-inch overhang. Fold the overhang under the bottom crust, pressing the edge to seal it, and crimp the edge decoratively. Beat one egg white until frothy and brush over pie crust, then sprinkle with coarse sugar. Cut slits in the crust with a sharp knife, forming steam vents, and bake the pie in the middle of the oven for 25 minutes. Reduce the temperature to 350°F. and bake the pie for 20 to 25 minutes more, or until the crust is golden. Let the pie cool on a rack and serve it warm at room temperature.</p>"}], "link": "https://smittenkitchen.com/2008/04-shaker-lemon-pie"}