{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2008/01/chicken-caesar-salad.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, photo, salad, weeknight favorite", "name": "Chicken Caesar Salad", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "This isn’t the fastest way to make a chicken caesar salad, but I consider it the ultimate: really good croutons, the best way I know how to make chicken for salads that isn’t dry or tough, my favorite hopelessly inaunthentic caesar salad dressing.", "totalTime": "P0DT1H0M0S", "recipeYield": "4 to 6", "recipeIngredient": ["1 pound boneless, skinless chicken breasts", "1 cup water", "1 tablespoon kosher salt, plus more for seasoning", "1/2 teaspoon granulated sugar (optional)", "Freshly ground black pepper", "Olive oil", "A squeeze of lemon juice", "3 tablespoons olive oil", "1 large garlic clove, minced", "A few fine gratings of lemon zest", "Scant 1/2 teaspoon kosher salt", "Freshly ground black pepper", "4 cups fresh or day-old bread, cubed (sourdough, ciabatta, or a white country bread work well here)", "1/4 cup grated parmesan (optional)", "2 tablespoons (25 grams) mayonnaise", "1 small garlic clove, minced", "1 teaspoon worcestershire sauce or 1 to 2 anchovies, minced", "1 teaspoon smooth dijon mustard", "1 to 2 tablespoons (15 to 30 ml) lemon juice", "1/4 cup (60 ml) olive oil", "Salt and freshly ground black pepper", "3 “hearts” or 2 full heads of romaine, chopped to the size you like", "Additional grated parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the chicken: At any point up to 2 days in advance, but even 15 to 20 minutes will have a positive effect, combine the water, salt, and sugar, if using in the bottom of a smallish dish. Nestle in chicken breasts and put mixture in the fridge for as long as you have."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the chicken: When you’re ready to cook the chicken, drain it and pat it dry on paper towels. Rub lightly with olive oil and season generously with salt and pepper. Grill on high heat until cooked through, flipping once. It rarely takes more than 8 to 10 minutes. Set aside to rest for 5 to 10 minutes before slicing thin. Squeeze a little lemon juice over once you do."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the croutons: Heat oven to 400 degrees. Mix the bread cubes with the oil, garlic, zest, salt, and pepper; stir in parmesan, if using (I promise they’re good either way) and spread on a large rimmed baking sheet. Bake, stirring once or twice, until the croutons are crisp and lightly colored on the outside but still soft within, about 10 to 15 minutes. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: Whisk all the ingredients in a small bowl and whisk until smooth. Don’t skimp on the salt and pepper; they’re going to wake the whole thing up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble right before you want to eat it: Toss lettuce, chicken, and croutons with about 2/3 of the dressing (reserve the rest if it needs more), plus parmesan, until everything is evenly coated. Season with more salt and pepper if needed.."}], "link": "https://smittenkitchen.com/2008/01-chicken-caesar-salad"}