{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/10/jalapeno-cheddar-scones.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, cheese, peppers, photo, scones biscuits", "name": "Jalapeño-Cheddar Scones", "author": {"@type": "Organization", "name": "\nAdapted Peter Oleyer at Calexico Carne Asada in Brooklyn, via NYMag"}, "description": "", "totalTime": "", "recipeYield": "It’s worth noting that I had my doubts about this recipe. This world is overflowing with terrible scones and after trying too many bad ones, I came to the conclusion that the only good scones — the only ones you should bother making or eating, ever — are these dreamy cream ones. However, this recipe manages to be different — it contains eggs! — and yet is still delicious but considering the possibility that there are two good scone recipes on earth makes my sleepy head hurt thus I will reconcile this another time. For now, know that these are good, very good.", "recipeIngredient": ["2 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon salt", "8 tablespoons (1 stick or 4 ounces) cold butter, diced", "1/2 cup heavy cream", "3 eggs, divided", "1/4 pound sharp Cheddar cheese, diced", "2 small jalapeños pepper, minced (I wimped out and used only one only to find my scones entirely heat-free)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups all-purpose flour<br/>\n1 tablespoon baking powder<br/>\n1 teaspoon salt<br/>\n8 tablespoons (1 stick or 4 ounces) cold butter, diced<br/>\n1/2 cup heavy cream<br/>\n3 eggs, divided<br/>\n1/4 pound sharp Cheddar cheese, diced<br/>\n2 small jalapeños pepper, minced (I wimped out and used only one only to find my scones entirely heat-free)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F. In a small skillet, melt 1/2 tablespoon of butter and sauté the jalapeños in it until soft, about two minutes. Let them cool, then place them in a small bowl with the cheddar cheese and coat them with one tablespoon of the flour. Combine the remaining flour with the baking powder and salt. Cut in the remaining butter with a pastry blender, fork or two knives, until the butter bits are pea sized.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly whip two of the eggs and cream and add to the flour-butter mixture. Using a wooden spoon, fold mixture until it begins to come together. Add the cheddar-jalapeño mixture to the dough and mix until everything is incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn out the dough onto a well-floured surface and knead gently for less than one minute. Pat dough out to a 3/4- to 1-inch thickness and either cut into 8 triangles or the shape of your choice with a biscuit cutter. Make an egg wash by beating the remaining egg with a teaspoon of water. Brush the scones with egg wash and place on a parchment-lined (or well-oiled) baking sheet. Bake for 25 minutes or until golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scones are always best the first day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Want to flash-freeze yours, as I did?</b> <a href=\"https://smittenkitchen.com/tips/how-to-flash-freeze/\">Brief directions, here.</a></p>"}], "link": "https://smittenkitchen.com/2009/10-jalapeo-cheddar-scones"}