{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/07/lemony-zucchini-goat-cheese-pizza.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "citrus, photo, pizza, summer, zucchini", "name": "Lemony Zucchini Goat Cheese Pizza", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>There is no reason to make this recipe exactly as you see here, I mean, aside from the fact that you have my word that it is completely delicious as is. But why be limited? Use thyme with or instead of your basil, or another herb you like. Add slices of eggplant, tomato or even potato, if that’s what’s coming up fresh in your area. Don’t like goat cheese? Use gruyère or mozzarella. Is that too many options? I don’t wish to flood you, just to let you know that a recipe like this could be a launchpad for whatever you’ve got on hand, or, frankly, need to clean out of your fridge. Have fun with it. That’s the point, after all, isn’t it?</p>", "totalTime": "", "recipeYield": "Makes one small pizza, which with a big green salad, makes an nice summer meal for two", "recipeIngredient": ["1 batch ", "<a href=\"https://smittenkitchen.com/2007/01/pizza-and-the-limits-of-diy/\">Simplest Pizza Dough</a>", " or a store-bought pizza dough that will yield one small (approx. 11 to 12 inches across), thin pizza", "1 lemon", "4 ounces goat cheese, at room temperature", "Few leaves of fresh basil, cut into thin slivers", "1/2 medium yellow zucchini, sliced as thinly as you can pull off with a knife or your mandoline (I went for 1/8-inch thick with mine)", "1/2 medium green zucchini, sliced as the same as above", "Drizzle of olive oil", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 batch <a href=\"https://smittenkitchen.com/2007/01/pizza-and-the-limits-of-diy/\">Simplest Pizza Dough</a> or a store-bought pizza dough that will yield one small (approx. 11 to 12 inches across), thin pizza<br/>\n1 lemon<br/>\n4 ounces goat cheese, at room temperature<br/>\nFew leaves of fresh basil, cut into thin slivers<br/>\n1/2 medium yellow zucchini, sliced as thinly as you can pull off with a knife or your mandoline (I went for 1/8-inch thick with mine)<br/>\n1/2 medium green zucchini, sliced as the same as above<br/>\nDrizzle of olive oil<br/>\nSalt and pepper to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 450 degrees. Roll your pizza dough into a thin 12-inch circle and lay it on a tray or stone that has been dusted lightly with cornmeal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, stir together the goat cheese with the juice of half your lemon. Season it with salt and freshly ground pepper, and spread it over your pizza dough. Scatter fresh basil slivers over the cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange your zucchini coins in concentric circles over the goat cheese spread, overlapping them slightly. You can alternate their colors, if you’re feeling fancy. Squeeze the juice of the second half of your lemon on top of you zucchini, then drizzle with olive oil and finish with more salt and freshly ground black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake in preheated oven for 10 to 15 minutes (your baking time will vary, so please watch carefully), or until the edges of your pizza are golden brown and the zucchini looks roasted and a little curled up at the edges. Serve with a green or even simple tomato salad and please, have a glass of crisp white wine for me.  Okay, <i>two</i>. It has been a while.</p>"}], "link": "https://smittenkitchen.com/2009/07-lemony-zucchini-goat-cheese-pizza"}