{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/11/raisin-studded-apple-bread-pudding.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apple, fall, photo, pudding, thanksgiving", "name": "Raisin-Studded Apple Bread Pudding", "author": {"@type": "Organization", "name": "\nAdapted from Melissa Murphy and David Page via Food & Wine"}, "description": "<p>Ironically, the part of this recipe — after the flavor profile, of course — that I was the most curious and excited about was the one that ended up being a flub. The original recipe called for separating eggs, whipping the whites separately and folding them into the custard batter. Alas, the custard batter was far too wet and thin to do anything but allow chunks of white to float to the top, like foam, leaving a sticky and distinctly not meringue-like layer on top of my pudding. My synopsis? Pass on splitting eggs.</p><p>Finally, as far as bread puddings go, this is not one that is overly eggy or custardy. For some, this is a plus. But if you like your bread puddings truly submerged and then suspended in their custard, rather than just lightly soaked in it, increase the eggs to 4 and the milk to 4 cups. The spices and sugar can remain the same.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 pound bakery white or challah bread, crusts removed, cut into 1-inch cubes", "1 Granny Smith apple, peeled and cut into 1/2-inch pieces", "1 cup (6 ounces) golden raisins, plumped in hot water for 15 minutes", "3 large eggs", "3/4 cup sugar", "1/4 teaspoon cinnamon", "1/8 teaspoon freshly grated nutmeg", "1/8 teaspoon ground ginger", "1/4 teaspoon pure vanilla extract", "1/4 teaspoon salt", "3 cups whole milk", "2 tablespoons unsulfured molasses", "1/4 cup sliced almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound bakery white or challah bread, crusts removed, cut into 1-inch cubes<br/>\n1 Granny Smith apple, peeled and cut into 1/2-inch pieces<br/>\n1 cup (6 ounces) golden raisins, plumped in hot water for 15 minutes<br/>\n3 large eggs<br/>\n3/4 cup sugar<br/>\n1/4 teaspoon cinnamon<br/>\n1/8 teaspoon freshly grated nutmeg<br/>\n1/8 teaspoon ground ginger<br/>\n1/4 teaspoon pure vanilla extract<br/>\n1/4 teaspoon salt<br/>\n3 cups whole milk<br/>\n2 tablespoons unsulfured molasses<br/>\n1/4 cup sliced almonds</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Spread the bread cubes on a baking sheet and toast in the oven for 6 minutes, until crisp. Transfer to a bowl and add the apple and raisins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Generously butter either a 9×13-inch deep baking dish or six 8-ounce ramekins. If using ramekins, set them on the baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, using a handheld electric mixer or whisk, beat the eggs with the sugar. Beat in the ground spices, vanilla and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium saucepan, heat the milk with the molasses until just warm to the touch. Gradually beat the warm milk into the egg mixture, scraping the bottom and side of the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread bread mixture out in your large baking dish, or distribute it among ramekins. Pour the custard over the bread mixture, nudging the bread around a bit to make sure it soaks all of the pieces. Let stand for 5 minutes. Sprinkle the almonds on top. Bake in the center of the oven for about 40 minutes, until puffed and set, with the tops lightly browned. Let the bread pudding(s) rest for at least 15 minutes before serving.</p>"}], "link": "https://smittenkitchen.com/2009/11-raisin-studded-apple-bread-pudding"}