{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/02/whole-lemon-tart.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "citrus, fruit, lemon, photo, tarts pies, winter", "name": "Whole Lemon Tart", "author": {"@type": "Organization", "name": "\nLoosely inspired by a version from the Paris pastry shop, Rollet-Pradier"}, "description": "<p>[Updates, 1/26/11] More eggs were added, which help the tart set and not bubble over, as some (yikes, sorry) experienced with the first version. I’ve also drastically streamlined the directions — the whole tart is now made in the food processor, as I always have at home. The butter doesn’t need to be softened or melted. You’ll have the filling made and the tart out of the oven in 45 minutes. This is the perfect dessert to bring to a dinner party. [One final tip, 8/21/14] When I used a riff on this filling for the Whole Lemon Bars in my cookbook, I found over dozens of obsessive retests that the only times that the filling came out too bitter was when the white part of the lemons I’d bought were especially thick. I’ve adjusted the directions below to have you take a look at your peel thickness when you cut it, and to use less skin if it’s especially thick.  </p><p>1 partially baked 9-inch Great Unshrinkable Tart Shell, or your favorite sweet tart shell</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 average-sized lemon (about 4 1/2 ounces; 130 grams), rinsed and dried*", "1 1/2 cups (300 grams) sugar", "1 stick (4 ounces or 115 grams) unsalted butter, cut into chunks", "4 large eggs", "2 tablespoons (14 grams) cornstarch", "1/4 teaspoon table salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 average-sized lemon (about 4 1/2 ounces; 130 grams), rinsed and dried*<br/>\n1 1/2 cups (300 grams) sugar<br/>\n1 stick (4 ounces or 115 grams) unsalted butter, cut into chunks<br/>\n4 large eggs<br/>\n2 tablespoons (14 grams) cornstarch<br/>\n1/4 teaspoon table salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Center a rack in the oven and preheat the oven 350°F (175°C). Place the tart shell on a baking sheet, which you can line with foil or parchment paper to make any spills a breeze to clean up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut the lemon in half and take a look at the thickness of the white ring of the skin. Does it look thick to you, perhaps 1/4-inch thick or larger? If so, go ahead and remove the skin from one half of the lemon before proceeding. If it looks normal or not especially thick, you’ll be just fine. In both cases, slice the lemon halves into thin wheels, remove any seeds, and toss the rounds — lemon flesh <i>and</i> peel — sugar and chunks of butter into the container of a food processor. Process, scraping down the sides of the container as needed, until the lemon is thoroughly pureed. Add the eggs, cornstarch and salt and pulse until the batter is smooth. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into prepared tart shell. It will fill it completely but if due to slight variances in tart pans, egg sizes, lemon sizes or crust thickness, you have too much, do not pour it past the top of of your crust or it will become difficult to unmold later. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 35 to 40 minutes or until the filling is set. You can test this by bumping the pan a little; it should only jiggle slightly. In my oven, I find that the point at which the filling is set is also when it starts to get very light brown on top. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool on rack, unmold tart pan and serve. I actually prefer this tart completely chilled, which makes it a great dessert to make in advance of a dinner or party. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>*  Meyer lemons might seem the obvious choice here, and they will work, but I actually prefer this with the sharp, less floral, intensity of standard grocery store lemons (Eureka variety). </p>"}], "link": "https://smittenkitchen.com/2009/02-whole-lemon-tart"}