{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/migas-with-tomato-chipotle-coulis1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, budget, eggs, photo, tex mex", "name": "Sue Torres’ Migas (Mexican-Style Breakfast)", "author": {"@type": "Organization", "name": "\nAdapted from Sueños Restaurant, NYC"}, "description": "<p>Making your own tortilla chips is not a requirement but the thought of crushing Tostitos into my dinner seemed all wrong. I simply cut up some thick corn tortillas and fried them in a 1/2-inch of bubbling flavorless oil until they were golden on both sides, drained them well and quickly salted them. And then tried not to finish them before dinner.</p><p>Lastly, it’s worth noting that the coulis seems to be a real staple in Torres’ cooking. It’s used in her mussel broth, it’s ladled over entrees or puddled beneath them. If you end up with extra, have fun with it.</p><p>Tomato-Chipotle Coulis</p>", "totalTime": "", "recipeYield": "Serves 4", "recipeIngredient": ["2 large, round tomatoes or best available", "2 garlic cloves, minced", "1/2 white or Spanish onion, minced (Torres says the white onion is more commonly used in Mexico)", "1 chipotle en adobo, from a can (I used half of one and thought it had a plenty-big kick, you can always start with a quarter and add more if desired)", "Kosher or sea salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 large, round tomatoes or best available<br/>\n2 garlic cloves, minced<br/>\n1/2 white or Spanish onion, minced (Torres says the white onion is more commonly used in Mexico)<br/>\n1 chipotle en adobo, from a can (I used half of one and thought it had a plenty-big kick, you can always start with a quarter and add more if desired)<br/>\nKosher or sea salt to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree all of the above in a blender jar. Heat a sauce pan over high heat. Add oil to coat. Once the oil it hot, add the sauce. Cook for 15 minutes or so and season to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Demonstration tip: Torres said that if you ever end up with a sauce too spicy, you can add a splash of cream to cool it off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Migas</u><br/>\n2 links Mexican or Spanish chorizo, removed from casing, diced or coarsely chopped<br/>\n4 tablespoons oil (a mixture of corn and olive oil works best)<br/>\n8 eggs, lightly beaten<br/>\n20 corn tortilla chips, preferably fresh<br/>\nFresh cilantro for garnish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>First, cook the chorizo. Heat a medium-sized stainless steel saucepan over medium-high heat and add two tablespoons of oil. Add the chorizo and cook, stirring frequently, until the chorizo is golden and cooked through, about ten minutes. Add the eggs and after a minute, the chips. Use a wooden spoon to crush the chips as you stir to cook the eggs. Cook for about five minutes (mine took less) or until <i>almost</i> cooked through.Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Deb note: I’m a stickler about not overcooking/drying out scrambled eggs — blech — and always remove them from the heat while they still look a little damp; they continue cooking in their residual heat even once plated.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set up four plates for serving. Ladle some coulis in the bottom of each dish, top with some of the egg mixture and sprinkle with the cilantro. Serve immediately.</p>"}], "link": "https://smittenkitchen.com/2009/03-migas-with-tomato-chipotle-coulis"}