{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/02/old-school-chocolate-mousse1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, french, photo, pudding", "name": "Silky, Decadent Old-School Chocolate Mousse", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet Magazine, October 2009 (sniffle)"}, "description": "<p>Yes, the eggs are raw. And I’ve been doing this long enough that I know someone is soon going to ask me if you can cook the eggs instead of using them raw or use yogurt instead of whipped cream or replace the eggs with flax seeds and water or skip the booze or reduce the butter, and so on, so let me just add this disclaimer: Yes, you may. You may make any changes that you see fit, any adjustments that will make this dish more enjoyable for you. You will, after all, be crafting this for you and not me. And it might be some kind of phenomenal when you’re done, something that exceeds your wildest expectations. But it will not be chocolate mousse.</p><p>This is. And I think it is fantastic.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["8 ounces bittersweet chocolate (no more than 60% cacao), chopped", "3/4 stick (3 ounces) unsalted butter, cut into 6 pieces", "3 large eggs, separated", "1 tablespoon Cognac or other brandy (or swap with a liqueur of your choice)", "1 cup very cold heavy or whipping cream", "1/8 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8 ounces bittersweet chocolate (no more than 60% cacao), chopped<br/>\n3/4 stick (3 ounces) unsalted butter, cut into 6 pieces<br/>\n3 large eggs, separated<br/>\n1 tablespoon Cognac or other brandy (or swap with a liqueur of your choice)<br/>\n1 cup very cold heavy or whipping cream<br/>\n1/8 teaspoon salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Get out one large heatproof, two medium and one small mixing bowl and dust off your electric hand mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the large bowl over a saucepan of barely simmering water and melt the chocolate and butter in it, gently stirring it until smooth. Remove from heat. Alternately, you can melt them in your microwave, stirring thoroughly at 30 seconds and every 15 seconds thereafter until the mixture is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the small bowl, beat yolks with your electric mixer until thick enough to form a ribbon that takes a few seconds to dissolve — this will take about two to four minutes to achieve. Whisk yolks into chocolate mixture along with Cognac, then cool to warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In one of the medium bowls, beat the cream with cleaned beaters until it just holds stiff peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the other medium bowl, beat the egg whites and salt with cleaned beaters until they just hold soft peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fold the whipped cream and beaten whites into the chocolate mixture, gently but thoroughly. Transfer to 8 (4 ounce) ramekins or one large serving bowl, or go restaurant-style, serving it in stemmed glasses with white or dark chocolate shavings on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Mousse can be chilled, its surface covered with parchment paper, up to 2 days, though I’ve never heard of it lasting that long with hungry people named Deb around. Let stand at room temperature at least 30 minutes before serving.</p>"}], "link": "https://smittenkitchen.com/2009/10-silky-decadent-old-school-chocolate-mousse"}