{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroom-marsala-pasta-with-artichokes1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "artichokes, italian, mushrooms, pasta, photo, vegetarian", "name": "Mushroom Marsala Pasta with Artichokes", "author": {"@type": "Organization", "name": "\nAdapted from Giada DeLaurentis"}, "description": "<p>So what’s the story with this? A lifetime ago, I told you about Alex’s Chicken and Mushroom Marsala, which I said, frankly, was all about the mushrooms while the chicken lingered in the background like a b-list celebrity. So when I saw Giada making a pasta dish that forewent the chicken to just hone in on the marsala mushrooms — and even threw in artichokes, my favorite-est vegetable — it was enough to even get this discombobulated cook organized in time for dinner.</p><p>The only note I’d make about the flavor is that, though I enjoyed the subtle meatiness of the dish, I can see why others might want a little acid to brighten it up; if you find this to be the case, I think a tablespoon or so of lemon juice or a splash of balsamic added at the end might do the trick.</p>", "totalTime": "", "recipeYield": "Serves 4 to 6", "recipeIngredient": ["3 tablespoons olive oil", "1 small onion, finely chopped", "1 pound mushrooms, trimmed, cleaned and chopped into small bits (I used creminis)", "1 teaspoon kosher salt, plus 1 tablespoon for pasta water", "1 cup dry Marsala wine", "1 pound pasta, Giada recommends thimble-shaped pasta, ", "<i>ditalini</i>", ", but I think I used snail-shaped or ", "<i>chiocciole</i>", "1/2 pound frozen artichoke hearts, thawed", "3/4 cup grated Parmesan", "1/2 cup cream", "1/2 cup chopped fresh flat-leaf parsley", "1 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 tablespoons olive oil<br/>\n1 small onion, finely chopped<br/>\n1 pound mushrooms, trimmed, cleaned and chopped into small bits (I used creminis)<br/>\n1 teaspoon kosher salt, plus 1 tablespoon for pasta water<br/>\n1 cup dry Marsala wine<br/>\n1 pound pasta, Giada recommends thimble-shaped pasta, <i>ditalini</i>, but I think I used snail-shaped or <i>chiocciole</i><br/>\n1/2 pound frozen artichoke hearts, thawed<br/>\n3/4 cup grated Parmesan<br/>\n1/2 cup cream<br/>\n1/2 cup chopped fresh flat-leaf parsley<br/>\n1 teaspoon freshly ground black pepper</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the olive oil in a large, heavy skillet over medium-high heat. Add the onions and cook for one minute. Add the mushrooms and one teaspoon of the salt. Sauté, stirring occasionally, until all the moisture has evaporated and the mushrooms have cooked down, about 10 minutes (though this took me much less time). Add the Marsala and continue cooking until almost all the wine has evaporated, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, bring a large pot of water to a boil over high heat. Stir in remaining salt. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain pasta and add it into the mushrooms, Marsala and onions Add the artichoke hearts, Parmesan and cream and cook until the artichokes are heated through, about 5 minutes. Stir in the parsley and pepper, then adjust seasonings to taste. Transfer to a serving bowl and serve. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Update 12/30/13:</strong> I hadn’t made this and years and dusted it off tonight. Conclusion: I think I’d actually like this better with twice as many mushroom and no artichokes. I mentioned above that I thought it needed some lemon or acidity — actually, artichokes do. Mushrooms and marsala sauce are perfect together, after all. I’d rather save the artichokes for a more lemony pasta sauce.</p>"}], "link": "https://smittenkitchen.com/2009/12-mushroom-marsala-pasta-with-artichokes"}