{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/02/cheesecake-marbled-brownies1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brownies blondies, chocolate, photo", "name": "Cheesecake-Swirled Brownies", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet, June 2007"}, "description": "<p>It’s true, I have made these before. Well, not these, a different recipe and they’re good, great even, but I’ve always wanted to fix it up a little. That brownie recipe is wonderful, but not simplified enough for a two-step process and there was never enough cheesecakiness (oh yes, it is a word) to balance it. Also, my mother has always made hers with chocolate chips swirled into the cream cheese and although I feel that a good brownie should not need extra chocolate in the form of frosting or chips to make it work, it sure cuts fantastically through the cream cheese swirl. Thus, three changes and a new recipe was warranted. Make these instead.</p><p>I added the aforementioned chocolate chips and more unsweetened chocolate to the brownie recipe, as commenters seemed to feel it was not chocolaty enough. I don’t think anyone could make the same argument about these.</p>", "totalTime": "", "recipeYield": "Makes 16 2-inch square, thick brownies", "recipeIngredient": ["RECIPE_SUBHED__1<u>Brownie batter</u>", "1 stick (1/2 cup or 4 ounces) unsalted butter, cut into pieces", "3 ounces unsweetened chocolate, chopped", "1 cup sugar", "2 large eggs", "1/2 teaspoon pure vanilla extract", "2/3 cup all-purpose flour", "RECIPE_SUBHED__2<u>Cheesecake batter </u>", "8 ounces cream cheese, well softened", "1/3 cup sugar", "1 large egg yolk", "1/4 teaspoon pure vanilla extract", "RECIPE_SUBHED__3<u>Plus</u>", "1/2 cup semisweet chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Plus</u><br/>\n1/2 cup semisweet chocolate chips</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make brownie batter:</u> Put oven rack in middle position and preheat oven to 350°F. Butter an 8-inch square baking pan. Heat butter and chocolate in a 3-quart heavy saucepan — though I did mine double-boiler style, placing the mixing bowl I was using over simmering water, thereby creating one less dirty dish and melting the chocolate more gently — over moderately low heat, whisking occasionally, just until melted. Remove from heat and whisk in sugar, eggs, vanilla, and a pinch of salt until well combined. Whisk in flour until just combined and spread in baking pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make cheesecake batter:</u> Whisk together cheesecake batter ingredients in a small bowl until smooth. Dollop over brownie batter, then swirl in with a knife or spatula.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[I actually like using a butter knife because the tip of it is round enough that you can use it to fold bits of the brownie batter <i>over</i> the cheesecake batter for a more visibly marbled effect. Try it!]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle chocolate chips over cheesecake/brownie batter swirl. Although it might be more logical to just mix them into the cheesecake batter (and feel free to do this, it will have no ill-effect) I thought it might interrupt the swirl-ability of it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Bake brownies: </u> Bake until edges are slightly puffed and center is just set, about 35 minutes. Serve warm or at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Slicing tip:</u> I like to chill my brownies until they’re almost frozen before cutting them. It makes it much easier to get a clean slice. I also like to eat my brownies super-cold, but that’s just personal taste.</p>"}], "link": "https://smittenkitchen.com/2009/09-cheesecake-swirled-brownies"}