{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/meatball-sliders1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, meat, photo", "name": "Joey Campanaro’s Meatball Sliders", "author": {"@type": "Organization", "name": "\nAdapted from The Little Owl restaurant, two sources, and a long afternoon cooking"}, "description": "<p>I made a doubled version of this but you should by no means attempt the same unless you have a serious crowd to feed. Although we did our darndest to leave no leftovers.</p><p>Also, worth considering, this is a lovely recipe for meatballs — the Romano really sings in there — but there are a lot of recipes out there, and around here, for great meatballs. If you have a favorite recipe, that would work equally well.</p>", "totalTime": "", "recipeYield": "Makes 6 3-slider appetizer servings", "recipeIngredient": ["1/2 pound ground beef", "1/2 pound ground pork", "1/2 pound ground veal", "1/2 cup panko (Japanese breadcrumbs) or fresh breadcrumbs", "1/2 cup water", "8 tablespoons freshly grated Pecorino Romano cheese, divided", "1 large egg", "1 large egg yolk", "1/4 cup plus 2 tablespoons chopped fresh parsley", "1 teaspoon salt", "1/2 teaspoon ground black pepper", "1/4 cup vegetable oil", "2 tablespoons olive oil", "1 cup chopped onion", "6 garlic cloves, chopped", "1/4 cup (packed) fresh basil leaves", "1 1/2 teaspoons fennel seeds", "1 28-ounce can whole peeled tomatoes", "1 14.5-ounce can whole peeled tomatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/4 cup vegetable oil<br/>\n2 tablespoons olive oil<br/>\n1 cup chopped onion<br/>\n6 garlic cloves, chopped<br/>\n1/4 cup (packed) fresh basil leaves<br/>\n1 1/2 teaspoons fennel seeds<br/>\n1 28-ounce can whole peeled tomatoes<br/>\n1 14.5-ounce can whole peeled tomatoes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arugula leaves (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>18 very small soft rolls, split horizontally, or Roasted Garlic Buns (recipe below)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix all meats, panko, 1/2 cup water, 6 tablespoons cheese, egg, egg yolk, 1/4 cup parsley, 1 teaspoon salt, and 1/2 teaspoon black pepper in large bowl. Form into eighteen 2-inch-meatballs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat vegetable oil in large skillet over medium-high heat. Working in batches, fry meatballs until brown all over. Transfer to plate. Pour off drippings from skillet. Reduce heat to medium. Add olive oil to skillet. Add onion, garlic, basil, and fennel seeds. Sauté until onion begins to brown, about 5 minutes. Add all tomatoes with juices. Bring to boil, scraping up browned bits. Reduce heat to low, cover with lid slightly ajar, and simmer, stirring occasionally, about 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree sauce in processor until almost smooth. Return to same skillet. Add meatballs. Cover with lid slightly ajar and simmer until meatballs are cooked through, stirring occasionally, about 30 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Do ahead: Can be made 1 day ahead. Cover; chill.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place arugula leaves on bottom of each roll, if desired. Top each with 1 meatball. Drizzle meatballs with some of sauce and sprinkle with remaining 2 tablespoons parsley and 2 tablespoons cheese. Cover with tops of rolls.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3/4 cups warm water<br/>\n1 tablespoons molasses<br/>\n1/8 ounce fresh yeast or 1/2 teaspoon instant yeast*<br/>\n1 teaspoon salt<br/>\n1 tablespoon olive oil<br/>\n2 cups all-purpose flour<br/>\n1 whole bulb garlic</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In an electric mixing bowl using the hook attachment, mix the warm water, yeast, olive oil, and molasses. Add the flour and the salt. The dough will become a wet mixture but will remain a little sticky. Remove the dough and place onto a floured clean surface and gently knead into a soft ball. Place the dough in a mixing bowl brushed with olive oil and cover. Store in a warm humid area for 30 minutes or until the dough rises to double its size. (For me, this took over an hour, but our apartment is really cold and I used less yeast.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wrap two bulbs of garlic in aluminum foil and roast in a medium heat oven until very soft, about 45 minutes. Squeeze the whole bulbs of garlic to release the soft interior. Slightly chop the roasted garlic until it resembles a puree. Portion the dough into 1 inch round balls, kneading in the roasted garlic while doing so.** Place the portioned raw dough balls on a sheet pan lined with parchment paper approximately 2 inches apart. Cover with plastic and allow the dough balls to rise again. After 20 minutes, spray the raw dough balls with cold water, sprinkle with a pinch of the freshly grated pecorino, salt and pepper, and bake for 20 minutes in a 400 degree oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I had trouble with the yeast level in my dough. Honestly uninterested in seeking out fresh yeast, I looked up an exchange with it for instant yeast — it was said to be 3:1, and that the equivalent amount of instant yeast would be 1/4 teaspoon. In the end, I felt that this was too little. Everything took forever to rise and even though the rolls were tasty, they had a density I associate with bread that has not risen as much as it should. Thus, I’ve suggested doubling the yeast, an amount that seems more in par with what you’d see in a bread dough based on two cups of flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>** Next time, I will add the roasted chopped garlic into the dough in the mixer, before the first rise. However, I am nervous to tell you to do this without testing it in case it in any way affects the rising. It would certainly have been easier that way — kneading roasted garlic into already risen dough is a messy chore, that overly deflates the rise.</p>"}], "link": "https://smittenkitchen.com/2009/02-meatball-sliders"}