{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/01/smashed-chickpea-salad.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, budget, lunch, pantry, photo, salad, sandwich", "name": "Smashed Chickpea Salad", "author": {"@type": "Person", "name": "Source: Inspired by the one at 'Wichcraft"}, "description": "", "totalTime": "P0DT0H10M0S", "recipeYield": "2 as a salad, 4 as toasts", "recipeIngredient": ["1 15-ounce can chickpeas, drained and rinsed", "2 tablespoons pitted, halved and very thinly sliced black olives", "1 tablespoon finely chopped red onion", "1 tablespoon chopped fresh parsley", "Zest and juice from half a lemon (if you’ve got one of those sad, juiceless lemons, use both sides for juice)", "Couple good pinches of salt", "A few grinds of black pepper, and/or pinches of red pepper flakes", "A few glugs of olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix everything but the olive oil in a small-to-midsize bowl. Very lightly smash the chickpea mixture with the back of a fork or a potato masher. You’re not looking for a hummus-like puree but something closer to a coarse chop with a few smaller bits to hold it together. Taste and adjust seasonings as needed, a glug or two of olive oil, mix it lightly and enjoy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "This is also awesome as a sandwich on toasted bread. Technically, it needs nothing else on it. But, if you want to doll it up, here are some ideas: A slice of roasted red pepper (‘wichcraft’s way), a slice of pickled garlicky red pepper (our way), and a few leaves of sharp greens, such as watercress or arugula. Or, as shown right above this recipe, on an open-faced slice of toast first schmeared with a tahini dressing. Make tahini dressing with a big spoonful of tahini, one minced garlic clove, a squeeze of lemon juice, and thinned with water to a loose but spreadable consistency. Season well with salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Three more delicious ingredients to add, if you have them: Harissa, mixed in, or dolloped on top. A small spoonful of minced, preserved lemon. A larger spoonful or two of olive tapenade, in place of the chopped olives."}], "link": "https://smittenkitchen.com/2009/01-smashed-chickpea-salad"}