{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/espresso-chiffon-cake-with-fudge-frosting1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, chocolate, elsewhere, photo", "name": "Espresso Chiffon Cake ", "author": {"@type": "Organization", "name": "\nAdapted from (what else?) Sky High: Irresistible Triple-Layer Cakes"}, "description": "<p>Despite picking one, I actually have all sorts of biases against chiffon cakes; mostly, that they’re lovely and fluffy but dry, namely because they have just smidgens of oil or butter in them. But this one called to me. I was hoping that the lightness of the chiffon cake layers would allow the strong espresso taste to come through, and that it did, though it didn’t hurt that it was brushed with a 1:1:1 ratio syrup of sugar, rum and straight espresso [or in other words, I think I briefly forgot that I was pregnant or something. Officially the most caffeine and booze I’ve had in 34 weeks and completely worth it.] that made the cake so ridiculously moist, I will never talk smack about chiffon cakes again.</p>", "totalTime": "", "recipeYield": "Makes an 8- or 9-inch triple-layer cake", "recipeIngredient": ["1/4 cup (60 ml) neutral vegetable oil, such as soybean, canola or vegetable blend", "6 eggs, separated", "6 tablespoons (90 ml) freshly brewed espresso, cooled to room temperature (Huntsman recommends freshly-brewed over hydrating espresso powder, which she feels can be too bitter)", "2 teaspoons (10 ml) vanilla extract", "1 1/3 cups (170 grams) cake flour", "1 1/2 cups (300 grams) sugar", "1 teaspoon baking powder", "1/2 teaspoon ground cinnamon", "1/2 teaspoon salt", "1/2 teaspoon cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/4 cup (60 ml) neutral vegetable oil, such as soybean, canola or vegetable blend<br/>\n6 eggs, separated<br/>\n6 tablespoons (90 ml) freshly brewed espresso, cooled to room temperature (Huntsman recommends freshly-brewed over hydrating espresso powder, which she feels can be too bitter)<br/>\n2 teaspoons (10 ml) vanilla extract<br/>\n1 1/3 cups (170 grams) cake flour<br/>\n1 1/2 cups (300 grams) sugar<br/>\n1 teaspoon baking powder<br/>\n1/2 teaspoon ground cinnamon<br/>\n1/2 teaspoon salt<br/>\n1/2 teaspoon cream of tartar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350 degrees. Line the bottoms of three 8- or 9-inch round cake pans with rounds of parchment or waxed paper, but do not grease.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, combine the oil, egg yolks, espresso and vanilla; whisk lightly to blend. In a large mixing bowl, sift together the flour, 1 cup of the sugar, the baking powder, cinnamon, and salt. Set the dry ingredients aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large mixer bowl with an electric mixture, whip the egg whites with the cream of tartar on medium-low speed until frothy. Raising the mixer speed to medium-high and gradually add the remaining half cup of sugar. Continue to beat until soft peaks form; do not whip until stiff or the cake will shirk excessively upon cooling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the espresso-egg yolk mixture to the dry ingredients and fold together just enough to combine. Add one-fourth of the beaten egg whites and fold them in to lighten the batter. Fold in the remainder of the whites just until no streaks remain. Divide the batter among the three prepared pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the cakes for about 18 minutes each, or until a cake tester or wooden toothpick inserted into the center comes out clean. Allow to cool completely in the pans. When cooled, run a blunt knife around the edge of the pans to release the cakes. Invert onto wire racks and remove the paper liners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To assemble the cake, place one layer, flat side up, on a cake stand or serving plate. Soak the cake with 1/3 cup of the Espresso Syrup (below). Spread about 1 1/3 cups of the Instant Fudge Frosting (below) evenly over the top of the layer. Repeat with the next layer, more syrup and more frosting. Finally, top with the third layer. Soak it with the remaining syrup and frost the tops and sides with the remaining frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Espresso Syrup</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes one cup</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/3 cup hot, freshly brewed espresso<br/>\n1/3 cup sugar<br/>\n1/3 cup dark rum, such as Meyer’s</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, stir together the espresso and sugar until the sugar dissolves. Add the rum and let cool to room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Don’t want to use rum? (I know someone will ask.) I’d swap it with water, perhaps flavored with some vanilla extract. Worried about the caffeine? Use decaf espresso.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Instant Fudge Frosting</b><br/>\nAdapted, barely, from a <a href=\"http://www.amazon.com/gp/product/0811854485?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0811854485\">Sky High</a> recipe</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Now, this is, to be honest, a fancy name for a quick buttercream but it’s got two things going for it that are worth mentioning: One, the frosting isn’t flavored with cocoa (too mild) or even good semisweet chocolate, but unsweetened chocolate. Brilliant, I tell you. I find most quick buttercreams way too sweet, and although this one still is quite sugary, the super-bitter chocolate goes a long way to mitigating it. The second thing worth mentioning is this: Did you know you can make quick buttercreams in the food processor? I had <i>no idea</i>, I hadn’t even considered it before. But there I was whirling everything together in ten seconds flat and I will make it no other way from now on.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes about 5 cups</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6 ounces unsweetened chocolate, melted and cooled<br/>\n4 1/2 cups confectioners’ sugar (no need to sift)<br/>\n3 sticks (12 ounces) unsalted butter, at room temperature<br/>\n6 tablespoons half-and-half or whole milk<br/>\n1 tablespoon vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place all of the ingredients in a food processor and pulse to incorporate, then process until the frosting is smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Frosting tip:</u> If your kitchen is as hot and sticky as mine is in the summer, you’ll want to watch a frosting like this carefully to make sure it doesn’t get too melty and soft. If it does, periodically put the bowl of frosting and your partially frosting cake back in the fridge to let it firm up and cool down again, then resume where you left off.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Planning to write on your cake?</u> Whirl all of the frosting ingredients <i>except</i> the melted chocolate in the food processor until smooth. Set aside a half-cup of the white frosting for tinting and writing, then add the chocolate to finish making the frosting.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cappuccino Chiffon Cake, a variation:</u> Now, if you were with me on the espresso cake but lost interest when I got to the fudge frosting, good news! The original cake I recipe I borrowed from was actually a Cappucino Chiffon Cake — filled and frosted with whipped cream (3 cups heavy cream to <s>1 cup</s> <em>1/3 cup</em> sugar and 2 teaspoons vanilla, whipped until stiff peaks form) and dusted with cocoa and/or cinnamon, just like a frothy cappucino. Frankly, it sounds <i>amazing</i> as the light, almost foamy qualities of the chiffon cake would be matched by the almost weightless frosting and I imagine a bite on your fork would be like diving into a <i>cappucino cloud</i> and hey, do you think someone around here misses coffee or something?</p>"}], "link": "https://smittenkitchen.com/2009/08-espresso-chiffon-cake-with-fudge-frosting"}