{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/09/chocolate-pudding-pie.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, photo, pudding, tarts pies", "name": "Chocolate Pudding Pie", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet"}, "description": "<p>One half-recipe of All Butter, Really Flaky Pie Dough, wrapped and chilled for at least 30 minutes</p>", "totalTime": "", "recipeYield": "One of my favorite things about this — besides the whole CHOCOLATE and PUDDING and PIE thing — is the way that despite its all-id, kid-like nature, this pie is surprisingly unsweet and not heavy. There’s barely a half cup of sugar in the whole she-bang and the lack of excessive richness (it’s a milk and cornstarch pudding, not a weighty egg yolk and cream custard) makes for something you can easily crave on a hot summer day, although you’ve already been warned that that craving may strike without warning.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Pudding filling:</u>", "1/4 cup cornstarch", "1/3 cup plus 2 tablespoons sugar, divided", "3 tablespoons unsweetened cocoa powder", "1/4 teaspoon salt", "3 cups whole milk", "4 ounces bittersweet chocolate (not more than 60% cacao), finely chopped", "1 teaspoon pure vanilla extract", "1 cup chilled heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Pudding filling:</u><br/>\n1/4 cup cornstarch<br/>\n1/3 cup plus 2 tablespoons sugar, divided<br/>\n3 tablespoons unsweetened cocoa powder<br/>\n1/4 teaspoon salt<br/>\n3 cups whole milk<br/>\n4 ounces bittersweet chocolate (not more than 60% cacao), finely chopped<br/>\n1 teaspoon pure vanilla extract<br/>\n1 cup chilled heavy cream</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bittersweet chocolate shavings for garnish (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Prepare pie dough:</u> Roll out dough on a lightly floured surface with a lightly floured rolling pin into an 11-inch round, then fit into a 9-inch pie plate. Trim edge, leaving a 1/2-inch overhang, then fold overhang under and crimp edge decoratively. Prick bottom and side of shell all over with a fork, then chill shell 30 minutes. While shell chills, preheat oven to 375°F with a baking sheet on middle rack. Line shell with foil and fill with pie weights*.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake on baking sheet until pastry is set and edge is pale golden, about 25 minutes. Carefully remove weights and foil, then bake shell on baking sheet until pale golden all over, 15 to 20 minutes more. Cool shell.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make pudding filling:</u> Whisk together cornstarch, 1/3 cup sugar, cocoa powder, and salt in a 2-quart heavy saucepan, then gradually <a href=\"https://smittenkitchen.com/tips/a-whisk-for-the-corners/\">whisk</a> [tips alert!] in milk. Bring to a boil over medium heat, whisking constantly, then boil, whisking, two  minutes (mixture will thicken). Remove from heat and whisk in chocolate and vanilla until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour filling into cooled shell and chill, its surface covered with wax paper (if you want to prevent a skin from forming), until cold, at least two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just before serving, beat cream with remaining two tablespoons sugar until it just holds soft peaks. Spoon onto pie and garnish with bittersweet chocolate shavings, if you’re feeling fancy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Pie dough can be made and chilled up to two days. Pie, without whipped cream, can be chilled up to one day before serving. Whipped cream is best added at the last minute, however, I did find that ours held up surprisingly well for a day (so far), if you feel like winging it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Detour! This is where I admit that I for reasons both lengthy and boring, I really loathe working with pie weights and use a different technique to blind bake pie and pastry shells. Instead, I freeze my rolled-out shells for 20 to 30 minutes until solid, press a piece of buttered foil, buttered side down, very tightly against the frozen shell and blind bake it according to regular directions. When it is time to remove the weights, I carefully pull back the foil, and press any part of the crust that has bubbled up gently back with the back of a spoon and continue baking the shell. Try it!</p>"}], "link": "https://smittenkitchen.com/2009/09-chocolate-pudding-pie"}