{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/buttermilk-ice-cream1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "ice creamsorbet, photo", "name": "Buttermilk Ice Cream", "author": {"@type": "Organization", "name": "\nAdapted from Claudia Fleming’s astoundingly awesome The Last Course which is woefully out of print but I have it on good authority that if you call The North Fork Table and Inn (where she now “pastries”), they have a small supply and might even send you a signed copy. The book includes the recipe for her famous mallomars — need I say more?"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 cups heavy cream", "1 1/4 cup sugar", "12 large egg yolks*", "2 cups buttermilk", "2 teaspoons vanilla or half a vanilla bean, scraped and simmered with the cream", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups heavy cream<br/>\n1 1/4 cup sugar<br/>\n12 large egg yolks*<br/>\n2 cups buttermilk<br/>\n2 teaspoons vanilla or half a vanilla bean, scraped and simmered with the cream<br/>\nPinch of salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large, heavy saucepan, combine the heavy cream and one cup of sugar and bring to a simmer over medium heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk egg yolks and remaining 1/4 cup of sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the cream mixture from the heat and drizzle a small amount into the yolks, slowly, and whisking constantly to keep the eggs from curdling. Do this a few more times to warm up the yolks before pouring the yolk mixture back into the cream, whisking constantly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook over low heat until the mixture is thick enough to coat the back of a spoon. Strain the mixture and whisk in the buttermilk, vanilla, and salt. Cool completely and freeze according manufacturer’s directions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I’m going to share with you a little secret: You don’t need to use all of these egg yolks. Oh sure, you can and the results will <i>blow your ice cream-loving mind</i>. However, let’s say you find that you only have six or eight egg yolks on hand, this will also do. The ice cream will be less rich, but still incredibly more rich than anything you can buy at any store.</p>"}], "link": "https://smittenkitchen.com/2009/04-buttermilk-ice-cream"}