{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/12/coffee-toffee.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "candy, chocolate, photo", "name": "Coffee Toffee", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Yes, with the molasses again. After discovering how it brings out all coffee’s awesomeness in baked goods, I had to add it to this one too. Of course, if you don’t trust me that it only adds a subtle bitter tinge or are molasses-averse there are alternatives but we really liked it. And also the espresso — if a piece of candy could ever taste like a cup of coffee, this would be it.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 cup (2 sticks or 8 ounces) butter", "1/2 cup light brown sugar", "1/2 cup white sugar", "1 1/2 teaspoons molasses (can swap corn syrup or honey)", "1/4 teaspoon salt (or a heaping 1/4 teaspoon flaky sea salt)", "1 1/2 teaspoons instant espresso powder", "1 cup semisweet chocolate chips, or 6 ounces semisweet chocolate, chopped", "1/2 cup chopped hazelnuts (toasted, skinned and cooled) or another nut of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup (2 sticks or 8 ounces) butter<br/>\n1/2 cup light brown sugar<br/>\n1/2 cup white sugar<br/>\n1 1/2 teaspoons molasses (can swap corn syrup or honey)<br/>\n1/4 teaspoon salt (or a heaping 1/4 teaspoon flaky sea salt)<br/>\n1 1/2 teaspoons instant espresso powder<br/>\n1 cup semisweet chocolate chips, or 6 ounces semisweet chocolate, chopped<br/>\n1/2 cup chopped hazelnuts (toasted, skinned and cooled) or another nut of your choice</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a small baking sheet (mine are 9×13, to fit in my puny oven) with parchment paper or a silicon mat and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In medium heavy saucepan (I used a 3-quart) with a candy thermometer attached, melt butter, brown sugar, white sugar, molasses, salt and espresso together over together. Cook over medium heat, stirring occasionally with a whisk (one that <a href=\"https://smittenkitchen.com/tips/a-whisk-for-the-corners/\">reaches into the corners</a> is especially helpful here) until the temperature approaches 250¯F, at which point you should stir constantly until it reaches 300¯F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour immediately into the prepared baking sheet — you can spread it more evenly with a offset or silicon spatula but don’t worry if you have neither. Sprinkle the chocolate chips over the toffee and let them sit for a minute until soft, then spread the chocolate evenly over the candy base. Sprinkle the chocolate with chopped hazelnuts and then, if you’re as impatient as we are, you can slide the sheet onto a cooling rack in the freezer until the toffee is set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Break into pieces and store in an airtight container. If you’re kitchen runs warm, you might prefer to keep it in the fridge so the chocolate doesn’t get soft.</p>"}], "link": "https://smittenkitchen.com/2009/12-coffee-toffee"}