{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/03/bialys.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, jewish, photo", "name": "Bialys", "author": {"@type": "Organization", "name": "\nAdapted from The Bread Bible"}, "description": "<p>The dough of bagels and bialys is very similar — both are chewy and intense — but bagels have a crisp outer shell that comes from boiling them before they’re baked, and bialys have a soft, chewy crust. It has a springy soft crumb and a floury crust, and they don’t keep long at all. You should either make them for the day you want them or pop them quickly into the freezer so they taste as fresh as possible when you’re ready for them.</p>", "totalTime": "", "recipeYield": "Six 4 x 1 1/4-inch high bialys or six flat 5 x 1-inch high bialys", "recipeIngredient": ["2 cups (10.5 ounces/300 grams) King Arthur high-gluten bread flour, preferably, or bread flour", "1/2 teaspoon (1.6 grams) instant yeast", "1 teaspoon (6.6 grams) salt (the more authentic bialys I have had use a bit more salt, so feel free to dial it up if you like a saltier roll)", "3/4 cup plus 2 tablespoons (7.25 ounces/206 grams) water, at room temperature", "RECIPE_SUBHED__1<u>Onion-Poppy Seed Filling</u>", "2 1/4 teaspoons vegetable oil", "6 tablespoons (1.5 ounces, 43 grams) onion, chopped", "3/4 teaspoon poppy seeds (I love poppy seeds on a bialy, but this did seem more than I was used to; I might dial it back next time)", "1/4 teaspoon sea salt", "Black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Onion-Poppy Seed Filling</u><br/>\n2 1/4 teaspoons vegetable oil<br/>\n6 tablespoons (1.5 ounces, 43 grams) onion, chopped<br/>\n3/4 teaspoon poppy seeds (I love poppy seeds on a bialy, but this did seem more than I was used to; I might dial it back next time)<br/>\n1/4 teaspoon sea salt<br/>\nBlack pepper to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. <b>Mix the dough.</b> In the bowl, whisk together the flour and the yeast, then whisk in the salt (this keeps the yeast from coming in direct contact with the salt which would kill it). With the dough hook, on low speed (#2 if using a KitchenAid), gradually add the water, mixing for about 1 minute or until the flour mixture is moistened. Raise the speed to medium (#4 KitchenAid) and continue mixing for 7 minutes. The dough should clean the bowl but be soft and elastic. Add a little extra flour or water if necessary. (The dough will weigh about 17.75 ounces/506 grams).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2.<b>Let the dough rise.</b> Place the dough in a 1 1/2-quart or larger dough-rising container or bowl, lightly greased with cooking spray or oil. Press down the dough and lightly spray or oil the top. Cover the container with a lid or plastic wrap. With a piece of tape, mark the side of the container at approimately where double the height of the dough would be. Allow the dough to rise, ideally at 75 to 80°F, for 1 1/2 to 2 hours or until it has doubled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. <b>Shape the dough and let it rise.</b> Deflate the dough by firmly pushing it down, and transfer it to a floured counter. Cut the dough into 6 equal pieces (about 3 ounces, 84 grams each). Work with one piece at a time, keeping the remaining dough covered. Maintaining as much air as possible in the dough, round each piece by pulling the dough together to form a pouch, stretching to make a smooth skin, and pinching it together where the edges meet. Set it on a floured baking sheet or tray, pinched side down. (The rounds will be 2 1/2 inches by 1 1/2 inches high.) Flour the tops and cover with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Allow the bialys to rise for about 2 hours at 75 to 80°F or until almost doubled; when pressed lightly in the center, they should keep the impression. If the dough is underrisen, it will puff up in the center instead of maintaining the characteristic hollow crater. The trick for underrisen dough is to make a small hole in the center before adding the filling. Since the dough bakes so quickly, it’s easy to test bake one to see if the dough is ready. If you want to be on the safe side, make the hole anyway.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. <b>Make the onion-poppy seed filling.</b> In a small saute pan, heat the oil. Add the onion and saute over medium heat, stirring often, for about 5 minutes or until translucent. (I went longer, going for a deeper caramelization but you should cook them to your taste.) Remove from the heat and add the poppy seeds, salt, and pepper to taste. Cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. <b>Preheat the oven.</b> Preheat the oven to 475°F 30 minutes before baking. have an oven shelf at the lowest level and place a baking stone or baking sheet on it, and a sheet pan on the floor of the oven, before preheating.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. <b>Make the craters for the filling.</b> Holding each piece of dough with both hands, with your thumbs in the middle and almost touching, pinch the center of the dough tightly between your thumbs and first two fingers and stretch the dough to 4 1/2 to 5 inches in diameter, forming a crater in the center. (My pinching skills are not up to par and my centers puffed a bit. No biggie, but make sure you get a good firm pinch in there!) Place it on the lined baking sheet and spoon 1 teaspoon of onion-poppy seed filling into the center.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>7. <b>Bake the bialys.</b> Place the baking sheet with the bialys directly on the hot oven stone or hot baking sheet, or, if using parchment, use a peel or a cookie sheet to slide the parchment with the bialys onto the stone or sheet. Toss a handful of ice cubes into the sheet pan on the oven floor (this helps make your oven closer to a professional bread oven; the steam helps form a crust), and immediately shut the door. Bake for 6 to 10 minutes or until pale golden and mottled with brown spots (an instand-read thermometer inserted into the center will read about 211°F.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8. <b>Cool the bialys.</b> Remove the baking sheet or parchment from the oven and, with a pancake turner, transfer the bialys to wire racks to cool until just warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Storage:</b> The bialys keep well for one day at room temperature in a paper bag. For longer storage, wrap each in airtight plastic wrap and place freezer bags in the freezer for up to one month. Thaw, still wrapped, at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Variation:</b> To make crisper flat bialys (a favorite in New York, I did not do this but might next time), brush the tops with a mixture of 1 large egg white beaten with 1/2 teaspoon water and sprinkle with poppy seeds (use 3 times the weight of the egg white in poppy seeds). Cover with plastic wrap and press down on the bialys with a sheet pan or cookie sheet to make 5 1/2- to 6-inch rounds. Remove the plastic wrap and use the wide end of a chopstick to make about 12 holes in each bialy. Bake as above, but add a few minutes to that bialys turn golden brown.</p>"}], "link": "https://smittenkitchen.com/2009/03-bialys"}