{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/10/quiche-lorraine.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "easter, freezer friendly, french, leeks, meat, photo, picnics, tart", "name": "Quiche Lorraine", "author": {"@type": "Organization", "name": "\nAdapted from Le Pain Quotidien"}, "description": "<p>So, curiously enough, one of the few places I could reliably find something I wanted to eat during my 9-plus months of no appetite this year was a chain restaurant (Quelle horreur! Except it is not.), Le Pain Quotidien. I loved their barely sweet granola bars, their hefty miche and countless simple lunches like this. (I believe they had a cookbook at some point, but it is either AWOL or out of print or maybe I’m just making this up?) Nevertheless, I found this recipe online and was chomping at the bit to make it, stat. No seriously, like the minute I got home from the hospital.</p><p>What sets this apart from other versions of this quiche is the piles of caramelized leeks and the richer-than-rich sour and heavy cream custard, two things I implore you not to miss out on. I hadn’t made this tart crust before, but was very impressed by how easy it came together and how crisp it remained as a shell without requiring a par-baking. I will definitely use it again.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 3/4 cups diced leeks, white and light green only (from about 2 large leeks, although I think you can get away with one super-big leek)", "3/4 cup diced onion", "2 1/2 teaspoons olive oil (I needed a tad more)", "1 1/4 cups flour", "1 tablespoon plus 2 teaspoons cornstarch", "Salt", "6 tablespoons butter, diced", "4 eggs, divided", "1/2 cup plus 1 tablespoon heavy cream", "1 cup plus 2 tablespoons sour cream", "Pinch nutmeg", "Pinch pepper", "1 1/2 cups diced ham (1/4 -inch dice; I used about 1/2 pound)", "3/4 cup grated Swiss cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 3/4 cups diced leeks, white and light green only (from about 2 large leeks, although I think you can get away with one super-big leek)<br/>\n3/4 cup diced onion<br/>\n2 1/2 teaspoons olive oil (I needed a tad more)<br/>\n1 1/4 cups flour<br/>\n1 tablespoon plus 2 teaspoons cornstarch<br/>\nSalt<br/>\n6 tablespoons butter, diced<br/>\n4 eggs, divided<br/>\n1/2 cup plus 1 tablespoon heavy cream<br/>\n1 cup plus 2 tablespoons sour cream<br/>\nPinch nutmeg<br/>\nPinch pepper<br/>\n1 1/2 cups diced ham (1/4 -inch dice; I used about 1/2 pound)<br/>\n3/4 cup grated Swiss cheese</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Heat a large sauté pan over low heat. Sauté the leeks and onions in the olive oil 30 to 40 minutes until caramelized, occasionally stirring. Remove from heat and cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Meanwhile, in a large bowl, combine the flour, cornstarch and one-fourth teaspoon salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg (a fork works great for this) and mix it until a dough forms. (Dough can also be made in a food processor, or in theory, and as the original recipe suggests, in a stand mixer.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate (I used an <a href=\"http://www.amazon.com/gp/product/B00004RFPV?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00004RFPV\">8-inch deep tart pan</a>, though ended up with extra filling) and press to remove any air bubbles. Crimp the edges, and refrigerate for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. While the quiche shell chills, mix the heavy cream and sour cream in a medium bowl. Whisk in the remaining three eggs. Add a pinch each nutmeg, salt and pepper and combine to form a batter. Preheat the oven to 350 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Remove the quiche shell from the refrigerator and spread the leek and onion mixture evenly over the base. Sprinkle the ham and then the cheese over the leeks and onions. Pour in the batter and place the quiche in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Bake until puffed and golden, about 25 to 30 minutes (a deeper pan, such as the one I used, will require extra baking time). Remove from the oven and cool slightly on a rack. Serve warm or at room temperature.</p>"}], "link": "https://smittenkitchen.com/2009/10-quiche-lorraine"}