{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/summer-pea-and-roasted-red-pepper-pasta-salad1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "pasta, peas, peppers, photo, picnics, salad", "name": "Summer Pea and Roasted Red Pepper Pasta Salad", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>This salad would also be fantastic finished with some slivered herbs, like basil, bits of soft goat cheese or crumbled feta or grated Parmesan, but really, it doesn’t need any of that to taste great. Promise.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 pound of small pasta (I used shells because I imagined the peas would nest in there and gah, such cuteness)", "1/4 pound snow pea pods, ends trimmed", "1/2 pound fresh summer peas, which yielded about 1 cup once shelled", "3/4 to 1 cup Roasted Red Pepper Vinaigrette (recipe below)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound of small pasta (I used shells because I imagined the peas would nest in there and gah, such cuteness)<br/>\n1/4 pound snow pea pods, ends trimmed<br/>\n1/2 pound fresh summer peas, which yielded about 1 cup once shelled<br/>\n3/4 to 1 cup Roasted Red Pepper Vinaigrette (recipe below)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to a boil and prepare a small ice water bath. Boil the snow pea pods for about two minutes, or until just barely cooked but still crisp. Scoop them out with a large slotted spoon and drop them in the ice water bath. Cook the peas for about 10 minutes (once again, this will be al dente, you can cook them longer if you prefer them softer), scoop them out with a large slotted spoon and plunge them into the ice water bath as well. Drain both peas. Cut the snow peas into thin slivers. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pasta into the boiling water and cook it according to package instructions. Drain and let cool, then toss in a large bowl with peas and Roasted Red Pepper Vinaigrette, seasoning to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Roasted Red Pepper Vinaigrette</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Please don’t limit your use of this to just pasta salad, though, I can say with <i>absolutely no bias</i> that it is awesome in it, but that’s no reason not to toss this with white beans for a quick bean salad or what your choice mix of greens are.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I like to slow-roast bell peppers in the oven at 350 for one hour, giving them a quarter turn with tongs every fifteen minutes so they get evenly blistered — then letting them cool and peeling them. I know it’s faster to blacken them over a gas flame, but the pepper never gets as supple and sweet as I want it to, but hey, that’s just personal preference. You know, in case you wanted to know.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes about one cup of dressing</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 red bell pepper, roasted, skinned and seeded or the equivalent from a jar, drained<br/>\n1/4 cup olive oil<br/>\n2 tablespoons red wine vinegar (and up to 2 tablespoons more if you, like us, like that extra bite in your dressing)<br/>\n1 tablespoon chopped shallot (about 1 small)<br/>\n1/2 teaspoon salt<br/>\nSeveral grinds of black pepper</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Puree the red bell pepper in a food processor or blender as much as possible, then add the remaining ingredients and running the machine until the dressing is silky smooth. Adjust the vinegar level and seasonings to taste.</p>"}], "link": "https://smittenkitchen.com/2009/08-summer-pea-and-roasted-red-pepper-pasta-salad"}