{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/light-wheat-bread1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, photo", "name": "Light Wheat Bread", "author": {"@type": "Organization", "name": "\nThe Bread Baker’s Apprentice"}, "description": "", "totalTime": "", "recipeYield": "Makes one two-pound loaf", "recipeIngredient": ["2 1/2 cups (11.25 oz) unbleached high-gluten or bread flour", "1 1/2 cups (6.75 oz.) whole-wheat flour", "1 1/2 tablespoons (.75 oz.) granulated sugar or honey", "1 1/2 teaspoons (.38 oz.) salt", "3 tablespoons (1 oz.) powdered milk*", "1 1/2 teaspoons (.17 oz.) instant yeast", "2 tablespoons (1 oz.) shortening or unsalted butter, at room temperature", "1 1/4 cups (10 oz.) water, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 1/2 cups (11.25 oz) unbleached high-gluten or bread flour<br/>\n1 1/2 cups (6.75 oz.) whole-wheat flour<br/>\n1 1/2 tablespoons (.75 oz.) granulated sugar or honey<br/>\n1 1/2 teaspoons (.38 oz.) salt<br/>\n3 tablespoons (1 oz.) powdered milk*<br/>\n1 1/2 teaspoons (.17 oz.) instant yeast<br/>\n2 tablespoons (1 oz.) shortening or unsalted butter, at room temperature<br/>\n1 1/4 cups (10 oz.) water, at room temperature</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Stir together the high-gluten flour, whole-wheat flour, sugar (if using), salt, powdered milk, and yeast in a 4-quart mixing bowl (or in the bowl of an electric mixer). Add the shortening, honey (if using), and water. Stir (or mix on low speed with the paddle attachment) until the ingredients form a ball. If there is still flour in the bottom of the bowl, dribble in additional water. The dough should feel soft and supple. It is better for it to be a little too soft that to be too stiff and tough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Sprinkle high-gluten or whole-wheat flour on the counter, and transfer the dough to the counter, and begin kneading (or mix on medium speed with the dough hook). Add more flour if needed to make a firm, supple dough that is slightly tacky but not sticky. Kneading should take about 10 minutes (6 minutes by machine). The dough should pass the <a href=\"http://www.wikihow.com/Determine-if-Bread-Dough-Has-Been-Mixed-Long-Enough\" rel=\"nofollow\">windowpane test</a> and registers 77 to 81 degrees F. Lightly oil a large bowl and transfer the dough to the bowl, rolling it around to coat it with oil. Cover the bowl with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Ferment at room temperature for 1 1/2 to 2 hours, or until the dough doubles in size.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Remove the dough from the bowl and press it by hand into a rectangle about 3/4 inch thick, 6 inches wide, and 8 to 10 inches long. Form it into a loaf by working from the short side of the dough, rolling up the length of the dough one section at a time, pinching the crease with each rotation to strengthen the surface tension. It will spread wider as you roll it. Pinch the final seam closed with the back edge of your hand or with your thumbs. Place the loaf in a lightly oiled 8 1/2 by 4 1/2 inch bread pan; the ends of the loaf should touch the ends of the pan to ensure an even rise. Mist the top with spray oil and loosely cover with plastic wrap.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Proof at room temperature for approximately 60 to 90 minutes (as in, original recipe says 90 minutes, I walked into the kitchen at 60 and said “whoa!” as it had almost risen too much; clearly final rising times vary), or until the dough crests above the lip of the pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Preheat the oven to 350 degrees F with the oven rack on the middle shelf.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>7. Place the bread pan on a sheet pan and bake for 30 minutes. Rotate the pan 180 degrees for even baking and continue baking for 15 to 30 minutes, depending on the oven. The finished loaf should register 190 degrees F in the center, be golden brown on the top and the sides, and sound hollow when thumped on the bottom.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8. When the bread is finished baking, remove it immediately from the loaf pan and cool it on a rack for at least 1 hour, preferably 2 hours (yeah, good luck with that), before slicing or serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>* More uses for that powdered milk you just bought: </b> <a href=\"http://www.101cookbooks.com/archives/000176.html\">101 Cookbook’s Yogurt</a> or <a href=\"http://homesicktexan.blogspot.com/2008/01/uncle-austins-granola.html\">Homesick Texan’s Uncle Austin’s Granola</a>. Even better, eat them together!</p>"}], "link": "https://smittenkitchen.com/2009/01-light-wheat-bread"}