{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/beef-empanadas1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beef, freezer friendly, photo", "name": "Beef Empanadas", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet, September 2007"}, "description": "<p>My only grievance with this recipe the way it was printed is that the flavor was a little flat. I’ve upped the spices but definitely think that there’s nothing wrong that a couple dashes of your favorite hot sauce can’t fix. Or a pinch of cayenne. Or a heavier helping of salt and pepper. I’ll let you get creative.</p>", "totalTime": "", "recipeYield": "Makes a dozen 6-inch empanadas", "recipeIngredient": ["2 hard-boiled large eggs, chopped into bits", "1/2 medium onion, finely chopped", "1 tablespoon olive oil", "1 garlic clove, finely chopped", "1 teaspoon ground cumin", "3/4 teaspoon dried oregano", "3/4 pound ground beef chuck", "2 tablespoons raisins (optional)", "1 1/2 tablespoons chopped pimiento-stuffed olives", "1 (14-ounce) can whole tomatoes in juice, drained, reserving 2 tablespoons juice, and chopped", "1 package frozen empanada pastry disks, thawed (or homemade, recipe follows)", "About 4 cups vegetable oil and a deep-fat thermometer (if deep-frying)", "1 egg beaten with 2 teaspoons water (if baking)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 4 cups vegetable oil and a deep-fat thermometer (if deep-frying)<br/>\n1 egg beaten with 2 teaspoons water (if baking)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook onion in olive oil in a heavy medium skillet over medium heat, stirring frequently, until softened. Add garlic, cumin, and oregano and cook, stirring, 1 minute. Stir in beef and cook, breaking up lumps with a fork, until no longer pink, about 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add raisins, olives, 1/2 teaspoon salt, 1/4 teaspoon pepper, and tomatoes with reserved juice, then cook, stirring occasionally, until liquid is reduced but mixture is still moist, about 5 minutes. Stir in hard boiled egg and spread on a plate to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lay a large sheet of plastic wrap on a dampened work surface (to help keep plastic in place), then roll out an empanada disk on plastic wrap to measure about 6 inches. Place 3 tablespoons meat mixture on disk. Moisten edges of disk with water and fold over to form a semicircle, then crimp with a fork. [You might see some different crimps in my pictures. The fork method really works best.] Make more empanadas in same manner.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If frying: Preheat oven to 200°F with rack in middle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If baking: Put oven racks in upper and lower thirds of oven and preheat oven to 400°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Deep-frying instructions:</u> Heat 3/4 inch vegetable oil in a deep 12-inch skillet over medium heat until it registers 360°F on thermometer. Fry empanadas, 2 or 3 at a time, turning once, until crisp and golden, 4 to 6 minutes per batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a shallow baking pan and keep warm in oven. Return oil to 360°F between batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Baking instructions:</u>  Lightly brush empanadas with some of egg wash and bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden, about 25 minutes. Transfer empanadas to a rack to cool at least 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Empanada Dough</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 1/2 cups unbleached all-purpose flour (I used 1 1/2 cups whole wheat flour + 3 cups all-purpose)<br/>\n3 teaspoons salt<br/>\n2 sticks (1 cup or 8 ounces) cold unsalted butter, cut into 1/2-inch cubes<br/>\n2 large eggs<br/>\n2/3 cup ice water<br/>\n2 tablespoons distilled white vinegar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift flour with salt into a large bowl and blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal with some (roughly pea-size) butter lumps. Beat together egg, water, and vinegar in a small bowl with a fork. Add to flour mixture, stirring with fork until just incorporated. (Mixture will look shaggy.) Turn out mixture onto a lightly floured surface and gather together, then knead gently with heel of your hand once or twice, just enough to bring dough together. Form dough into two flat rectangles and chill them, each wrapped in plastic wrap, at least 1 hour. Dough can be chilled up to 6 hours total.</p>"}], "link": "https://smittenkitchen.com/2009/03-beef-empanadas"}