{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/02/spicy-caramel-popcorn1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "candy, photo", "name": "Spicy Caramel Popcorn", "author": {"@type": "Organization", "name": "\nAdapted from The Craft of Baking"}, "description": "<p>This is a salty, spicy grown-up caramel popcorn — the taste will surprise you if you are expecting traditional caramel popcorn, and may delight you if you were never into the original.</p><p>Want to make a traditional caramel popcorn with no spice or nuts? Just skip the cayenne and peanuts and use only a pinch of salt.</p><p>Note: Your volumes will look different from mine in the pictures because I only made a half-batch. Yes, I regretted it.</p>", "totalTime": "", "recipeYield": "Makes 4 quarts", "recipeIngredient": ["Nonstick cooking spray or vegetable oil", "3 tablespoons vegetable oil", "1/2 cup popcorn kernels", "2 cups salted peanuts (optional)", "1 1/2 teaspoons baking soda", "1/4 to 3/4 teaspoon cayenne pepper (see Note)", "3 cups sugar", "3 tablespoons unsalted butter", "1 to 1 1/2 tablespoons kosher or coarse sea salt (see Note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Nonstick cooking spray or vegetable oil<br/>\n3 tablespoons vegetable oil<br/>\n1/2 cup popcorn kernels<br/>\n2 cups salted peanuts (optional)<br/>\n1 1/2 teaspoons baking soda<br/>\n1/4 to 3/4 teaspoon cayenne pepper (see Note)<br/>\n3 cups sugar<br/>\n3 tablespoons unsalted butter<br/>\n1 to 1 1/2 tablespoons kosher or coarse sea salt (see Note)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly coat two large, heatproof rubber spatulas, a very large mixing bowl and two large baking sheets with nonstick cooking spray or a thin slick of oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large saucepan or pot with a lid, heat the oil over medium-high heat. Add the popcorn kernels, cover and keep the saucepan moving until all of the kernels have popped, about 5 minutes. Transfer to the prepared bowl, removing any unpopped kernels. Toss with salted peanuts, if using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the baking soda and cayenne pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Have the two large baking sheets ready. In a medium saucepan, combine the sugar, butter, salt and 1/2 cup water. Cook over high heat, without stirring, until the mixture becomes a light golden-yellow caramel, 10 to 14 minutes. Remove from the heat and carefully whisk in the baking-soda mixture (the mixture will bubble up).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Immediately pour the caramel mixture over the popcorn and don’t fuss if it doesn’t all come out of the pot — you’ll have plenty. Working quickly and carefully, use the prepared spatulas to toss the caramel and popcorn together, as if you were tossing a salad, until the popcorn is well coated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the popcorn onto the baking sheets and quickly separate them into small pieces while still warm. Cool to room temperature, about 15 minutes. Once cool, store in an airtight container for up to two weeks or two minutes, if you’ve got a family like mine.</p>"}], "link": "https://smittenkitchen.com/2009/12-spicy-caramel-popcorn"}