{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/peach-cupcakes-with-brown-sugar-frosting1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, fruit, peach, photo", "name": "Peach Cupcakes with Brown Sugar Cream Cheese Frosting", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>These cakes are extremely light, airy and moist, nothing like the dense cake recipes more traditionally used as cupcake bases. Personally, I consider this a very good thing. You know what else? Sans frosting, they’d make great breakfast muffins — just dial back one of the sugars by a generous quarter-cup and maybe even swap half of that flour with whole wheat. You could also chop in some pecans, but don’t blame me if nobody in your house wants to share.  </p>", "totalTime": "", "recipeYield": "Makes 24 to 28 cupcakes", "recipeIngredient": ["3 cups cake flour", "1 1/2 teaspoons baking powder", "1 1/2 teaspoons baking soda", "1 teaspoon salt", "Pinch of nutmeg", "3/4 cup (1 1/2 sticks or 6 ounces) unsalted butter, at room temperature", "3/4 cup granulated sugar", "3/4 cup dark or light brown sugar, packed", "2 large eggs, lightly beaten", "1 teaspoon vanilla extract", "1 1/2 cups (12 ounces) buttermilk, sour cream or full-fat yogurt", "3 large peaches, peeled, cored, and chopped smallish (I went for a 1/3-inch dice)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 cups cake flour<br/>\n1 1/2 teaspoons baking powder<br/>\n1 1/2 teaspoons baking soda<br/>\n1 teaspoon salt<br/>\nPinch of nutmeg<br/>\n3/4 cup (1 1/2 sticks or 6 ounces) unsalted butter, at room temperature<br/>\n3/4 cup granulated sugar<br/>\n3/4 cup dark or light brown sugar, packed<br/>\n2 large eggs, lightly beaten<br/>\n1 teaspoon vanilla extract<br/>\n1 1/2 cups (12 ounces) buttermilk, sour cream or full-fat yogurt<br/>\n3 large peaches, peeled, cored, and chopped smallish (I went for a 1/3-inch dice)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F. Line 28 muffin cups with paper liners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, baking powder, baking soda, salt and nutmeg and set aside. Cream the butter and sugars together, beating until fluffy. Add the eggs, one at a time, scraping down the sides and bottom of the bowl between each addition, and then the vanilla. Gently mix in the buttermilk, sour cream or yogurt. Stir in the dry ingredients and fold in the peach chunks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the batter evenly among the prepared cupcake liners. Bake for 18 to 22 minutes, or until a tester inserted into the center of cupcakes comes out clean. Cool the cupcakes for five minutes in the tin, then turn them out onto a wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Brown Sugar Cream Cheese Frosting</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cornstarch? Let me explain: Quick buttercreams and cream cheese frostings are generally made by whipping fatty ingredients (butter, cream cheese, yes please) with powdered sugar. Powdered sugar works in a way that granulated sugar does not because it is mixed with cornstarch, which both keeps the sugar from clumping in its packaging and thickens the frosting. Brown sugar is not only more damp than granulated and powdered sugar, it’s missing that cornstarch thickener, so I added some to help the frosting set up. It’s still a bit thinner than traditional cream cheese frosting but the flavor leaves the stuff you’re used to in the dust. And for me, that’s all that matters.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4 cups light brown sugar<br/>\n1/4 cup cornstarch<br/>\n1/2 cup powdered sugar<br/>\n2 8-ounce packages of cream cheese, at room temperature<br/>\n1/2 cup (4 ounces or 8 tablespoons) unsalted butter, at room temperature<br/>\n1/2 teaspoon vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the brown sugar, cornstarch and powdered sugar. In a large bowl, beat the cream cheese and butter until fluffy. Add the sugar-cornstarch mixture and vanilla, beat until frosting is smooth and light. Chill the bowl in the refrigerator until it thickens back up a bit, about 30 minutes, then spread or dollop on cooled cupcakes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Tip:</b> Did you know you can <a href=\"https://smittenkitchen.com/tips/make-your-own-brown-sugar/\">make your own brown sugar</a>?</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Some notes, or questions I am going to anticipate and try to answer before they are asked:</b> I bought the brown cupcake liners at the <a href=\"http://www.nycake.com/\">New York Cake &amp; Baking Supply</a> on 22nd Street (and wow, do I miss only living a few blocks from there) but they’re also available on <a href=\"http://www.amazon.com/gp/product/B001AQVB10?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B001AQVB10\">Amazon</a> and from many other online baking supply shops. I piped dollops of the frosting with a Wilton #10 round tip. I have a small, inexpensive kit <a href=\"http://www.amazon.com/gp/product/B000LNQ73K?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000LNQ73K\">like this</a> (but a different version) that pretty much works for anything I need to do. It’s a great investment for those of us that just like to dabble in decorating at home.</p>"}], "link": "https://smittenkitchen.com/2009/08-peach-cupcakes-with-brown-sugar-frosting"}