{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/10/baked-chicken-meatballs.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, freezer friendly, photo, weeknight favorite", "name": "Baked Chicken Meatballs", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet"}, "description": "<p>These were unbelievably good, quite possibly my new favorite meatball recipe; they pack a lot of flavor from a few ingredients and can I say this? I hope it sounds as good to you as it does to me: They taste … cheesy. Like you’d snuck a whole lot  of melty goodness in there, even though there is none. In my book, that’s a high compliment.  </p><p>These make for an excellent main course, but I will definitely be making miniature versions of them for a party, hopefully one day soon. </p>", "totalTime": "", "recipeYield": "Serves 4, or more as appetizers or sliders", "recipeIngredient": ["3 slices Italian bread, torn into small bits (1 cup)", "1/3 cup milk", "3 ounces sliced pancetta, finely chopped (you can swap in Canadian Bacon if you can’t find pancetta)", "1 small onion, finely chopped", "1 small garlic clove, minced", "2 tablespoons extra-virgin olive oil, divided", "1 large egg", "1 pound ground chicken", "2 tablespoons tomato paste, divided*", "3 tablespoons finely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 slices Italian bread, torn into small bits (1 cup)<br/>\n1/3 cup milk<br/>\n3 ounces sliced pancetta, finely chopped (you can swap in Canadian Bacon if you can’t find pancetta)<br/>\n1 small onion, finely chopped<br/>\n1 small garlic clove, minced<br/>\n2 tablespoons extra-virgin olive oil, divided<br/>\n1 large egg<br/>\n1 pound ground chicken<br/>\n2 tablespoons tomato paste, divided*<br/>\n3 tablespoons finely chopped flat-leaf parsley</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F with a rack in the upper third of the oven. Soak bread in milk in a small bowl until softened, about four minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook pancetta, onion, and garlic in one tablespoon oil with 1/2 teaspoon each of salt and pepper in a large skillet over medium heat until onion is softened, about 6 minutes. (Alternately, as in “I thought of this after the fact”, I’d bet you could render the pancetta for a couple minutes and cook the onions and garlic in that fat, rather than olive oil.) Cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Squeeze bread to remove excess milk, then discard milk. Lightly beat egg in a large bowl, then combine with chicken, 1 tablespoon tomato paste, pancetta mixture, bread, and parsley. Form 12 meatballs and arrange in another 4-sided sheet pan (I used a 9×13 roasting dish).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together remaining tablespoons of tomato paste and oil and brush over meatballs (the paste/oil does not mix in any cohesive manner, but just smoosh it on and run with it) , then bake in upper third of oven until meatballs are just cooked through, 15 to 20 minutes (though mine took a good 5 minutes longer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I accidentally added a heaping tablespoon of the tomato paste into the meatball mixture the first time I made it, and ended up liking it better than without it. I’d use the tomato paste on top too. It’s good both places.</p>"}], "link": "https://smittenkitchen.com/2009/10-baked-chicken-meatballs"}