{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/rhubarb-cobbler1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "crumbles crisps, fruit, photo, rhubarb", "name": "Rhubarb Cobbler", "author": {"@type": "Organization", "name": "\nAdapted from Claudia Fleming via New York Magazine"}, "description": "<p>As for the dish together, the one note I’d add is that the proportion of biscuit to fruit is actually quite high. Now I know this sounds like a dream come true for a lot of people, but should you like a little more fruit with your cake, simply double the fruit quantity below, or halve the topping.</p>", "totalTime": "", "recipeYield": "The biscuit topping includes the curious ingredient of hard-boiled egg yolks. I’ve been trying for days to find the reason behind it’s inclusion (as I am sure someone will ask) but without my cookbooks still boxed up, my access to technique information is limited. I know that some people grind up a hard boiled yolk in their sables, to make them sandier and would argue that this makes the biscuits a little richer and cakier. Whether that’s the official rationale behind it or not, however, I don’t care — this will be the only biscuit topping I use for now on. It is perfect. I never should have doubted it.", "recipeIngredient": ["RECIPE_SUBHED__1<u>For dough</u>", "1 2/3 cups all-purpose flour", "3 1/2 tablespoons sugar", "1 tablespoon plus 1/2 teaspoon baking powder", "2 hard-boiled egg yolks", "1/8 teaspoon salt", "6 tablespoons cold unsalted butter, cut into 1/2-inch cubes", "2/3 cup plus 1 tablespoon heavy cream", "RECIPE_SUBHED__2<u>For rhubarb</u>", "2 pounds rhubarb, trimmed and cut into 1/2-inch pieces (about 6 cups)", "1/2 cup sugar", "1-inch piece of vanilla bean, split lengthwise, pulp scraped", "2 tablespoons cornstarch", "1 tablespoon turbinado sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For rhubarb</u><br/>\n2 pounds rhubarb, trimmed and cut into 1/2-inch pieces (about 6 cups)<br/>\n1/2 cup sugar<br/>\n1-inch piece of vanilla bean, split lengthwise, pulp scraped<br/>\n2 tablespoons cornstarch<br/>\n1 tablespoon turbinado sugar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of a food processor, combine the flour, sugar, baking powder, egg yolks, and salt. Pulse to combine. Add the butter and pulse until the flour resembles coarse meal. Add 2/3 cup of cream and pulse until the dough comes together. Turn the dough onto a lightly floured surface and gently pat it together, incorporating any stray crumbs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a small ice cream scoop or a large spoon*, form the dough into 2-inch balls, then flatten them slightly into thick rounds. Chill for 20 minutes (and up to 2 hours). Preheat oven to 350 degrees. Put the rhubarb in a shallow 21/2- quart casserole dish and toss with sugar, vanilla, and cornstarch. Allow to macerate 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the biscuit rounds on top, leaving about an inch between them. Brush the biscuits with cream and sprinkle with turbinado sugar. Bake the cobbler until the rhubarb is bubbling and the biscuits are golden brown, about 40 to 45 minutes. Serve with ice cream or crème fraîche.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I haven’t unearthed my scoops yet, but I did find some cookie cutters, so I simply patted my dough out on a floured surface and cut them instead. Besides, who doesn’t like flower-shaped biscuits?</p>"}], "link": "https://smittenkitchen.com/2009/05-rhubarb-cobbler"}