{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/06/lemon-mint-granita.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, citrus, fruit, ice creamsorbet, lemon, photo", "name": "Lemon-Mint Granita", "author": {"@type": "Organization", "name": "\nAdapted pretty liberally from Wolfgang Puck"}, "description": "<p>Granita’s selling points don’t end with being more appealing than ice cream to a certain preggo (though really, what more do you need to know?), more refreshing than an air conditioner on turbo on a sticky summer day, and the best thing since a Snoopy Sno-Cone — they’ve got something going for them that sorbets, sherbets, ice creams and gelatos lack: not just the ability to be made without a machine, but the insistence that it’s the only right way. You won’t get those fleck-y ice bits in a churner, you’ve got to rake them up yourself with a fork. And then try not to eat them all before sharing.</p><p>Oh, and let’s say you’re not baking a baby right now? One word for you: Limoncello. Can you imagine a glug of that over your dish? Oh baby indeed. Just promise to have some for me, too.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["4 lemons", "4 cups water", "Sugar, to taste (we used 3 tablespoons, like a tart lemonade)", "Handful of fresh mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 lemons<br/>\n4 cups water<br/>\nSugar, to taste (we used 3 tablespoons, like a tart lemonade)<br/>\nHandful of fresh mint leaves</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Clean and wash the lemons. Cut off the top quarter of the lemons and slice a thin bevel off the bottom, so they can stand up straight. (You can skip this step if you don’t want to serve them in frozen lemon cups.) Using a grapefruit knife, carefully remove all of the lemon flesh and juice (working over a bowl ensures you won’t lose any), being careful not to cut through the bottom. Stand the lemons on a plate or cookie sheet and freeze until solid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a food processor (a blender will work as well), toss a handful of washed and dried fresh mint leaves into the work bowl. (I used about 25 to 30 leaves from 6 to 9 sprigs.) Add the scooped out lemon flesh and juice, and pulse until mostly pureed. Let mixture stand for 15 minutes, so the mint releases its flavor, then press the mixture through a fine-mesh strainer. You’ll end up with approximately one cup of lemon-mint juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir in the water, then sugar, one tablespoon at a time until the sugar is dissolved and the mixture is to your desire level of sweetness. Pour the mixture into a large roasting pan or baking dish, large enough that the liquid isn’t more than one-inch deep. (Otherwise it takes forever to freeze, trust me. A 9×13-inch pan worked great here.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze for one hour, then remove the mixture and scrape with two forks to break up the ice. (Your freezing time will vary, depending on the temperature and muscle of your freezer.) Return to the freezer and freeze until solid, about 2 to 3 hours, scraping it again with forks every hour or so.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the granita is frozen, rake until glittery. Scoop into frozen lemon shells (or, you know, plain old dishes) and serve before Deb gets to it.</p>"}], "link": "https://smittenkitchen.com/2009/06-lemon-mint-granita"}