{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/cream-biscuits1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, muffin, scones biscuits, side dish", "name": "Cream Biscuits", "author": {"@type": "Organization", "name": "\nAdapted from James Beard’s American Cookery"}, "description": "<p>The original recipe has you brush your baking sheet with melted butter (and increases the amount by two tablespoons) but for whatever reason, the butter not covered by biscuits just got smoky in my oven so I’m voting for you to just line your sheets with parchment. If you find dipping the biscuits in butter difficult (hard to grasp if the dough is soft), just brush them generously instead.</p><p>Made about 10 biscuits, perhaps a dozen if I had been stricter about the height and scrap-usage</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["3 tablespoons (45 grams) melted butter", "2 cups (250 grams) all-purpose flour, plus more for dusting the surface", "1 tablespoon (15 grams) baking powder", "1/2 teaspoon salt", "1 tablespoon (15 grams) sugar (optional)", "1 1/2 cups (355 ml) heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 tablespoons (45 grams) melted butter<br/>\n2 cups (250 grams) all-purpose flour, plus more for dusting the surface<br/>\n1 tablespoon (15 grams) baking powder<br/>\n1/2 teaspoon salt<br/>\n1 tablespoon (15 grams) sugar (optional)<br/>\n1 1/2 cups (355 ml) heavy cream</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 425°F. Line a baking sheet with parchment paper. Melt butter in a small pot or microwave dish, and set aside. Sift two cups flour, the baking powder, salt and (if using) sugar into a large bowl. Fold in 1 1/4 cups cream. If the dough is not soft or easily handled, fold in the remaining 1/4 cup cream, little by little. (I ended up using two additional tablespoons, or half the unused cream.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn dough onto a floured surface, mound it into a ball and, using your hands, press it to a thickness of about 3/4 inch. Cut into rounds, 2 1/2 inches in diameter. Gather dough scraps and continue to make rounds. Dip the top of each round in melted butter and arrange on the baking sheet. Bake until golden, 12 to 15 minutes. Serve immediately, or flash freeze for future use. [Biscuits can be baked straight from the freezer, and additional few minutes baking time will be needed, usually around 3 to 5.]</p>"}], "link": "https://smittenkitchen.com/2009/12-cream-biscuits"}