{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/01/2020-02-04-04.49.14.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "citrus, fruit, orange, photo, tarts pies, winter", "name": "Flaky Blood Orange Tart", "author": {"@type": "Organization", "name": "\nAdapted from Zoe Nathan, via Food and Wine"}, "description": "<p>This basic, rustic crostata approach — thinly sliced fruit, some sugar, some butter and a flaky dough — is something you can use with any fruit, any time you want a quick and pretty dessert. (We’ve used this previously with the Simplest Apple Tart.) But really, it’s the perfect way to use blood oranges; nothing will better show off their pretty hues.</p><p>A new note: The original recipe calls for up to 10 blood oranges, but I’ve never needed more than 8, so I’ve adjusted the recipe below </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 cup all-purpose flour, plus more for dusting", "1/4 cup plus 2 tablespoons granulated sugar", "1/4 teaspoon baking powder", "1/4 teaspoon salt", "1/2 cup plus 1 tablespoon unsalted butter, the 1/2 cup cut into 1/2-inch pieces and chilled", "3 tablespoons ice water", "7 to 8 blood oranges (about 5 ounces each)", "1 large egg yolk mixed with 2 tablespoons of water", "", "<a href=\"https://smittenkitchen.com/2008/10/paris-a-deep-dark-salted-butter-caramel-sauce/\">Deep, Dark Salted Butter Caramel Sauce</a>", ", for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup all-purpose flour, plus more for dusting<br/>\n1/4 cup plus 2 tablespoons granulated sugar<br/>\n1/4 teaspoon baking powder<br/>\n1/4 teaspoon salt<br/>\n1/2 cup plus 1 tablespoon unsalted butter, the 1/2 cup cut into 1/2-inch pieces and chilled<br/>\n3 tablespoons ice water<br/>\n7 to 8 blood oranges (about 5 ounces each)<br/>\n1 large egg yolk mixed with 2 tablespoons of water<br/>\n<a href=\"https://smittenkitchen.com/2008/10/paris-a-deep-dark-salted-butter-caramel-sauce/\">Deep, Dark Salted Butter Caramel Sauce</a>, for serving </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make pastry: In a food processor, pulse the 1 cup of flour with 2 tablespoons of the sugar and the baking powder and salt. Add the stick of cold butter and pulse several times, just until it is the size of peas. Sprinkle the dough with the ice water and pulse just until moistened crumbs form. Turn the crumbs out onto a work surface, knead once or twice and pat the pastry into a disk. Wrap the pastry in plastic and chill for 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a floured work surface, roll out the pastry to an 11-inch round, about 1/4 inch thick. Transfer the pastry to a parchment paper–lined flat cookie sheet and refrigerate for 15 minutes, or until chilled.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare filling: Meanwhile, peel the blood oranges, removing all of the bitter white pith. Thinly slice 2 of the oranges crosswise; remove the pits. Transfer the orange slices to a plate. Working over a sieve set over a bowl, cut in between the membranes of the remaining oranges, releasing the sections into the sieve. Remove the pits and gently shake out as much juice as possible without mashing the sections; you will need 1 cup of sections. Reserve the orange juice for another use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble: Arrange the orange sections on the pastry, leaving a 2-inch border all around. Sprinkle 2 tablespoons of the sugar over the oranges. Using a paring knife, thinly slice the remaining 1 tablespoon of butter over the oranges. Fold up the pastry over the oranges, leaving most of the oranges uncovered. Brush the pastry with the egg wash and sprinkle lightly with 1 tablespoon of the sugar. Arrange the orange slices on top, leaving a 1-inch border of pastry all around. Sprinkle the remaining 1 tablespoon of sugar on top. Freeze the tart until solid, at least 4 hours or preferably overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake: Heat your oven to 375° and position a rack in the center. Place a baking sheet on the rack below to catch any drips. Bake the tart directly from the freezer for 1 hour and 15 minutes, until the fruit is bubbling and the pastry is deeply browned. Transfer the cookie sheet to a rack and let the tart cool for 30 minutes. Carefully slide the parchment paper onto the rack and let the tart cool completely. Serve with the <a href=\"https://smittenkitchen.com/2008/10/paris-a-deep-dark-salted-butter-caramel-sauce/\">Deep Dark Salted Butter Caramel Sauce.</a></p>"}], "link": "https://smittenkitchen.com/2009/01-flaky-blood-orange-tart"}