{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/potato-and-artichoke-tortilla1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "budget, eggs, photo, potatoes, spanish", "name": "Potato Tortilla with Artichokes and Red Peppers", "author": {"@type": "Organization", "name": "\nThe New Spanish Table"}, "description": "<p>It’s been way too long since I made my last tortilla and if you’re looking for the classic version, start there. This version was devised by a friend of the author’s to use up leftover boiled potatoes. Although not traditional — with that long sauté in olive oil and including red peppers and artichokes — it is no less delicious.</p>", "totalTime": "", "recipeYield": "Serves 6 to 8 as a tapa, 2 as a light main dish.", "recipeIngredient": ["About 4 tablespoons olive oil, plus more if needed", "1/2 medium-size onion, quartered and thinly sliced", "1 large boiled Yukon Gold potato, quartered and thinly sliced (a leftover potato works great here)", "3 marinated artichoke hearts (from a can or jar), rinsed, patted dry, and thinly sliced", "1/4 cup sliced piquillo peppers or roasted red bell peppers", "4 large, very fresh eggs, preferably organic", "2 tablespoons chick stock or broth", "Coarse salt (kosher or sea)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>About 4 tablespoons olive oil, plus more if needed<br/>\n1/2 medium-size onion, quartered and thinly sliced<br/>\n1 large boiled Yukon Gold potato, quartered and thinly sliced (a leftover potato works great here)<br/>\n3 marinated artichoke hearts (from a can or jar), rinsed, patted dry, and thinly sliced<br/>\n1/4 cup sliced piquillo peppers or roasted red bell peppers<br/>\n4 large, very fresh eggs, preferably organic<br/>\n2 tablespoons chick stock or broth<br/>\nCoarse salt (kosher or sea)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Heat 2 tablespoons of the olive oil in a medium-sized skillet over medium heat. Add the onion and cook until limp but not brown, 3 to 5 minutes. Add the potato and cook, stirring gently, for 5 minutes. Stir in the artichokes and peppers and cook, stirring, for another 2 to 3 minutes. Using a slotted spoon, transfer the vegetable mixture to a bowl and let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Place the eggs, chicken stock, and a few small pinches of salt in a medium-sized bowl and beat until just scrambled. Add the potato mixture and mix until well combined. Let stand for about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Heat 5 teaspoons of the reserved olive oil in a heavy 8-inch skillet, preferably nonstick, over medium-high heat until it is just beginning to smoke. Pour the egg mixture into the skillet and flatten the potatoes with a spatula until the top is fairly even. Reduce the heat to medium-low. Cook, moving and shaking the skillet, running a thin spatula around the edge and sliding it into the middle so that some of the egg runs under for about one minute, then let it cook undisturbed until the top is a little wet but not liquid, 6 to 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Run the thin spatula under the tortilla to make sure that no part of the bottom is stuck to the skillet. Top the skillet with a rimless plate slightly larger than the skillet and, using oven mitts, quickly invert the tortilla onto the plate. If the skillet looks dry, add a little more olive oil. Carefully slide the tortilla back into the skillet, uncooked side down. Shake the skillet to straighten the tortilla and push the edges in with the spatula. Reduce the heat to very low and cook the tortilla until a toothpick inserted in the center comes out dry, 3 to 4 minutes. Invert the tortilla again, as before, to cook on the first side for another minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Invert the tortilla onto a serving plate and pat the top with a paper towel to get rid of excess oil. Let it cool a little, then cut the tortilla into wedges and serve warm or at room temperature. To serve as a tapa, cut the tortilla into squares and serve with toothpicks.</p>"}], "link": "https://smittenkitchen.com/2009/01-potato-and-artichoke-tortilla"}