{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/chewy-amaretti-cookies1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, gluten free, passover, photo", "name": "Chewy Amaretti Cookies", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet, January 2009"}, "description": "<p>If they look a bit like uber-trendy macarons, it’s is because they have a lot in common with them — they both involve slightly aged egg whites, ground almonds, sugar and not a whole lot else. And yet, they’re a heck of a lot easier to make, not leaving you crossing your fingers that the macaron faeries will grace your batch with the ideal level of humidity and a perfectly formed “foot”. In fact, the only downside of these cookies at all is that like many other macarons, macaroons and meringues, they’re sweet, very sweet. If you try them with less sugar, please let us know how it goes in the comments.</p><p>And yes, this is not the original source of the almond cookie recipe I’ve had for ages, but it looked even easier and who can argue with that?</p>", "totalTime": "", "recipeYield": "About four dozen cookies, or half as much if you sandwich them", "recipeIngredient": ["1 (7-ounce) tube pure almond paste (not marzipan; 3/4 cup)", "1 cup sugar", "Pinch of Kosher salt", "2 large egg whites at room temperature for at least 30 minutes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 (7-ounce) tube pure almond paste (not marzipan; 3/4 cup)<br/>\n1 cup sugar<br/>\nPinch of Kosher salt<br/>\n2 large egg whites at room temperature for at least 30 minutes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 300°F and place racks in the upper and lower thirds of your oven. Line two large sheet pans with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pulse almond paste, sugar and salt in a food processor until broken up, then add egg whites and puree until smooth. Transfer batter to pastry bag fitted with a 3/8-inch tip and pipe 3/4-inch rounds (1/3 inch high) about 1-inch apart in pans. Dip a fingertip in water and gently tamp down any peaks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake, rotating and switching position of pans halfway through, until golden and puffed, 15 to 18 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[When you rotate the pan midway through baking, you’ll wonder why you left so much space between the cookies. Suddenly, at 15 minutes they’ll puff up and you’ll be happy you left that space!]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cookies cool almost completely in their pans. Once cool, they’re much easier to cleanly remove from the parchment. You can make them into sandwich cookies but spreading some jam (I used raspberry) between them or ganache (3 ounces of semi-sweet chips melted with 1 to 2 tablespoons of cream, then left to thicken a bit would be enough to sandwich the whole batch).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cookies can be kept in an airtight container at room temperature for a day or two or frozen up to one month.</p>"}], "link": "https://smittenkitchen.com/2009/04-chewy-amaretti-cookies"}