{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/09/snickerdoodles1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, photo", "name": "Snickerdoodles", "author": {"@type": "Organization", "name": "\nAdapted from Martha Stewart"}, "description": "<p>Although I did not grow up eating these cookies, when I tried one for the first time at the coffee shop I worked at in college (90s Cliché Alert, huh?) I immediately reached for a second one. A good one will be so enveloped in cinnamon-sugar dreaminess that it could convert even the most staunch chocolate chip or oatmeal raisin cookie junkie, and a great one will manage to be both crisp at the edges and soft nearly to the point of cakiness in the middle. If I do say so myself, I believe these are among the greats.</p>", "totalTime": "", "recipeYield": "Makes three dozen 3 to 4-inch cookies. Your mileage will vary by the size scoop you use.", "recipeIngredient": ["2 3/4 cups (360 grams) all-purpose flour", "2 teaspoons cream of tartar", "1 teaspoon baking soda", "1/4 teaspoon salt", "16 tablespoons (8 ounces or 225 grams) unsalted butter, at room temperature", "1 3/4 cups sugar (350 grams), plus more if needed", "2 tablespoons ground cinnamon, plus more if needed", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 3/4 cups (360 grams) all-purpose flour<br/>\n2 teaspoons cream of tartar<br/>\n1 teaspoon baking soda<br/>\n1/4 teaspoon salt<br/>\n16 tablespoons (8 ounces or 225 grams) unsalted butter, at room temperature<br/>\n1 3/4 cups sugar (350 grams), plus more if needed<br/>\n2 tablespoons ground cinnamon, plus more if needed<br/>\n2 large eggs</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°, with one rack in top third and one rack in bottom third of oven. Line baking sheets with silicone baking mats or parchment paper; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together flour, cream of tartar, baking soda, and salt; set aside. In the bowl of an electric mixer fitted with a paddle attachment, combine butter and 1 1/2 cups sugar. Beat on medium speed until light and fluffy, about 2 minutes. Scrape down sides of bowl. Add eggs, and beat to combine. Add dry ingredients, and beat to combine. At this point, I chilled the dough for an hour (or you can overnight) before scooping it, because I otherwise found it too difficult to scoop into balls and roll but the original recipe doesn’t find this step neccessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once dough has chilled, in a small bowl, combine remaining 1/4 cup sugar and the ground cinnamon. Use a small ice-cream scoop* to form balls of the dough, and roll in cinnamon sugar. Place about two inches apart on the prepared baking sheets. Bake until the cookies are set in center and begin to crack (they will not brown), about 10 minutes, rotating the baking sheets after five minutes. Transfer the sheets to a wire rack to cool about five minutes before transferring the cookies to the rack. In theory, they can be stored in an airtight container up to one week, but I say good luck wtih that.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Martha recommends a size 30 (1 1/4 ounce) ice cream scoop but I used a size 40 (3/4 ounce) and they came out 3 to 4 inches across, or plenty huge.</p>"}], "link": "https://smittenkitchen.com/2009/09-snickerdoodles"}