{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/05/asparagus-goat-cheese-and-lemon-pasta.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "asparagus, budget, lemon, pasta, photo, quick, spring", "name": "Asparagus, Goat Cheese and Lemon Pasta", "author": {"@type": "Person", "name": "Source: Adapted from Bon Appetit"}, "description": "As it turns out, goat cheese makes a really great quick, creamy pasta sauce. And whether you blanch your pasta with asparagus or you swap in fava beans or string beans or seriously, you name it. If you’re not into tarragon, this is wonderful with other herbs including mint, chives, basil, parsley, or a mix of the above.", "totalTime": "P0DT0H25M0S", "recipeYield": "6", "recipeIngredient": ["1 pound spiral-shaped pasta", "1 pound slender asparagus spears, trimmed, cut into 1- to 1 1/2-inch pieces", "1/4 cup olive oil", "1 tablespoon finely grated lemon peel", "2 teaspoons chopped fresh tarragon plus more for garnish", "1 5- to 5 1/2-ounce log soft fresh goat cheese (the pre-crumbled stuff will not melt as well)", "Fresh lemon juice to taste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook your pasta in a large pot of well-salted water until it is almost tender, or about three minutes shy of what the package suggests. Add asparagus and cook until firm-tender, another two to three minutes. Drain both pasta and asparagus together, reserving one cup of pasta water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine olive oil, lemon peel, tarragon and cheese in a large bowl, breaking up the goat cheese as you put it in. Add hot pasta and asparagus to bowl, along with a couple slashes of the pasta water. Toss until smoothly combined, adding more pasta water if needed. Season generously with salt and pepper, and lemon juice if you feel it needs a little extra kick. (We did.)"}], "link": "https://smittenkitchen.com/2009/05-asparagus-goat-cheese-and-lemon-pasta"}