{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/parmesan-cream-crackers1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cheese, party snacks, photo", "name": "Parmesan Cream Crackers", "author": {"@type": "Organization", "name": "\nAdapted from Mark Bittman"}, "description": "", "totalTime": "", "recipeYield": "Rolling the dough 1/4-inch thick, I yielded 30 1 1/2-inch square cookies that shrank slightly and puffed to 3/8-inch thick", "recipeIngredient": ["1 cup all-purpose flour, more as needed", "1/2 teaspoon salt", "1/2 cup finely grated fresh Parmesan cheese (alternate: I think Romano could also work well here)", "4 tablespoons unsalted butter", "1/4 cup cream or half-and-half, more as needed", "Coarse salt, pepper, sesame or poppy seeds or whatever you like for sprinkling (optional)."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup all-purpose flour, more as needed<br/>\n1/2 teaspoon salt<br/>\n1/2 cup finely grated fresh Parmesan cheese (alternate: I think Romano could also work well here)<br/>\n4 tablespoons unsalted butter<br/>\n1/4 cup cream or half-and-half, more as needed<br/>\nCoarse salt, pepper, sesame or poppy seeds or whatever you like for sprinkling (optional).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 400°F. Line a baking sheet with parchment paper or lightly dust with flour. Put flour, salt, cheese and butter in bowl of a food processor. Pulse until flour and butter are combined. Add about 1/4 cup cream or half-and-half and let machine run for a bit until a dough forms. If it does not come together, add more liquid a teaspoon at a time, until mixture holds together but is not sticky. (I only needed the ingredient levels as listed to pull the dough together.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out dough on a lightly floured surface until 1/4-inch thick or even thinner, adding flour as needed. From here, you can either form them into individual crackers (I went for 1 1/2-inch squares cut with a fluted pastry wheel) and bake them an inch apart on your baking sheet (the method I used) or transfer the entire rolled-out sheet to your baking sheet (draping it over the rolling pin will make it easier) and score them lightly with a knife, pizza or pastry wheel to break into crackers after they are baked. For either method, dock all over with a fork and sprinkle with salt or any other toppings you are using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until moderately browned, about 12 minutes. Cool on a rack; serve warm or at room temperature or store in a tin for a few days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: Mine were the most crisp <i>before</i> they’d been kept in a container. If you’re baking them less than a day in advance, I think they can be left uncovered to maintain their best texture.</p>"}], "link": "https://smittenkitchen.com/2009/12-parmesan-cream-crackers"}