{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/simple-potato-gratin1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, potatoes, side dish, thanksgiving, vegetarian", "name": "Awesomely Simple Potato Gratin", "author": {"@type": "Organization", "name": "\nAdapted from The Art of Simple Food"}, "description": "<p>As I mentioned above, potato gratins are infinitely adaptable, so have fun with this recipe. We sautéed half a pound of thinly-sliced shiitakes with one small minced shallot until they were softened and spread the mixture between potato layers. And then we fought over the corner pieces, but that part is optional, and maybe even avoidable if your household is full of grownups.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["3 tablespoons butter, cut into pieces, plus an additional pat for buttering gratin dish", "4 large yellow potatoes* (about 1 1/2 pounds), peeled", "Salt and freshly ground black pepper", "1 cup milk, half-and-half or cream (if using something richer than milk, you can skip the butter)", "2 ounces cheese, grated or crumbled (Parmesan or Gruyere are the classics, but that doesn’t mean that goat cheese, blue cheese or any of your favorites won’t work as well) [optional]"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 tablespoons butter, cut into pieces, plus an additional pat for buttering gratin dish<br/>\n4 large yellow potatoes* (about 1 1/2 pounds), peeled<br/>\nSalt and freshly ground black pepper<br/>\n1 cup milk, half-and-half or cream (if using something richer than milk, you can skip the butter)<br/>\n2 ounces cheese, grated or crumbled (Parmesan or Gruyere are the classics, but that doesn’t mean that goat cheese, blue cheese or any of your favorites won’t work as well) [optional]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 350°F and grease a 9- by 12-inch gratin dish with the pat of butter. Slice the potatoes as thinly as you can (a mandoline works great for this) and arrange them in a layer, overlapping the edges slightly like shingles. Sprinkle the potatoes with salt and freshly ground pepper and don’t be stingy — this is where the bulk of your flavor comes from and a third of the cheese before before repeating this process with your remaining potato slices. (If you are using a sauteed vegetable filling, this is where you’d want to add half of it.) Depending on how thinly sliced your potatoes are, you should end up with approximately three layers, with a third of the cheese between each layer. Reserve the last third of your cheese for later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Carefully pour the milk over the potatoes. It should come up to the bottom of the top layer of potatoes; add more if this was not enough. Dot the top of the gratin with the three tablespoons of butter and bake it for about an hour. Halfway through the baking time, take the gratin dish out of the oven and gental press the potatoes flat with a spatula to keep the top moist. Sprinkle the remaining cheese on top of the gratin for the last 15 minutes of baking. The gratin is done when the potatoes are soft and the top is golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>More gratin ideas:</u> Use duck fat instead of butter. Swap celery root, parsnips or turnip slices for half the potatoes. Add chopped herbs such as parsley, thyme, chives or chervil between the layers. Sauté mushrooms, sorrel, spinach or leeks, with or without a finely-chopped shallot, and layer them between the potato slices.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Yukon Golds and other waxy, yellow-fleshed potatoes work best in gratins, keeping their texture without getting floury and falling apart as Russets do.</p>"}], "link": "https://smittenkitchen.com/2009/04-simple-potato-gratin"}