{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-raspberry-layer-cake1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, chocolate, easter, photo", "name": "Almond Rasberry Layer Cake", "author": {"@type": "Organization", "name": "\nAdapted from Sky High. Of course. Always."}, "description": "<p>The almond cake is pretty intensely flavored, and really quite easy to make — a true “white” cake (as in, no egg yolks, just whites) whose advantages are that they’re pretty and light (and quite traditional for wedding cakes) but having the disadvantage of benefiting from a brush with a simple syrup if you won’t be eating it right away. The raspberry jam filling couldn’t be easier, and whether you cover the cake with a whipped bittersweet ganache (as we did), a Swiss buttercream or cream cheese frosting, it’s guaranteed to be the prettiest little thing to cut into.</p><p>Oh, and if you have a friend who loves nothing more than a good seven-layer (rainbow) cookie, don’t resist the temptation to tint the top layer green and the bottom one pink. Gah, can you imagine how adorable it would be?</p><p>The Happy Birthday Mom was piped with a handful of white chocolate chips melted with a teaspoon of cream and tinted with blue food dye before letting it thicken to a piping consistency. It was a little puddly to write with, but still so much tastier than those awful tubed things.</p>", "totalTime": "", "recipeYield": "Makes a 9-inch triple layer cake that serves 16 to 20 people", "recipeIngredient": ["4 1/2 cups cake flour", "4 1/2 teaspoons baking powder", "3/4 teaspoon salt", "2/3 cup prepared almond paste (7 ounces)", "2 2/3 cups sugar", "2 1/2 sticks (10 ounces) unsalted butter, at room temperature", "1 tablespoon almond extract", "10 egg whites", "1 1/2 cups whole milk", "RECIPE_SUBHED__1<u>For assembly:</u>", "1 cup simple syrup (to keep cake moist)(optional)", "1 cup seedless raspberry preserves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For assembly:</u><br/>\n1 cup simple syrup (to keep cake moist)(optional)<br/>\n1 cup seedless raspberry preserves</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Frosting ideas:</u> <a href=\"https://smittenkitchen.com/2008/07/project-wedding-cake-swiss-buttercream/\">Swiss Buttercream</a> (with or without two teaspoons of almond extract for flavoring), <a href=\"https://smittenkitchen.com/2007/09/red-velvet-cake/\">Cream Cheese Frosting</a> or Whipped Bittersweet Frosting (recipe below)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Preheat oven to 350°F. Butter the bottoms and sides of three 8-inch (but 9-inch will work just fine) round cake pans. Line the bottom of each pan with a round of parchment or waxed paper and butter the paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. In a medium bowl, sift together the cake flour, baking powder and salt. Set the dry ingredients aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Place the almond paste and sugar in the bowl of a heavy-duty mixer fitted with the paddle attachment, or in another large bowl if using a handheld mixer. Begin to cream the mixture on low speed to break up the almond paste, then increase the speed to medium for about 2 minutes, or until the paste is broken into fine particles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Add the butter and almond extract and beat it well, then the egg whites, two or three at a time, beating just long enough to incoperate after each addition. Scrape down the sides of the bowl several times to make sure it is evenly mixed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5. Dust about a third of the dry ingredients over the batter and fold in with a large rubber spatula until just combined. Fold in about half the milk. Fold in half the remaining flour mixture, followed by the remaining milk. Finally, fold in the last of the dry ingredients just until no streaks of white remain. Use a light hand and do not overmix. Divide the batter among the three prepared cake pans.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6. Bake for 25 to 30 minutes or until a cake tester or wooden toothpick stuck into the center comes out clean. Let the cakes cool in their pans on wire racks for about 10 minutes. Turn the cakes out on to wire racks, carefully peel off the paper liners and let them cool completely, about one hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>7. Assemble the cake: Place one layer flat side up on a cake stand or serving plate. Slide small strips of waxed paper under the edges to protect the plate from any messiness accumulated while decorating. Brush first layer with simple syrup, if using. Spread 1/2 cup of the raspberry preserves over the cake, leaving a 1/4 inch margin around the edges. Repeat with the second layer, brushing syrup if using and using remaining preserves. Add the third layer and brush with syrup if using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8. Spread a thin layer frosting of your choice over the top and sides of the cake. Let frosting set in the fridge for about 20 to 30 minutes (this is your crumb coat) then spread a thicker, decorative coat over the base coat. If you have any frosting remaining, pipe a decoration of your choice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Whipped Bittersweet Frosting</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes about 3 cups, or enough to coat a three layer 8- or 9-inch cake. You’ll want 1 1/2 this amount if you’re using it for filling as well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>7 ounces bittersweet chocolate<br/>\n1 cup heavy cream<br/>\n1 stick (4 ounces) unsalted butter, at room temperature</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Melt the chocolate with the cream in a double boiler or metal bowl set over a pan of simmering water. Whisk to blend well. Remove from heat and let stand, whisking occasionally, until the chocolate mixture thickens to the consistency of mayonnaise. (No doubt, exactly what you want to think about when making chocolate frosting).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Place the butter in a large mixer bowl and with an electric mixer on medium speed, whip the butter until light and fluffy. Add the chocolate cream and whip until lighter in color and somewhat stiff, about three minutes. Do not whip too long or the frosting may begin to separate.</p>"}], "link": "https://smittenkitchen.com/2009/05-almond-raspberry-layer-cake"}