{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/03/cream-cheese-pound-cake-with-strawberry-coulis.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, everyday cakes, photo, strawberries", "name": "Cream Cheese Pound Cake", "author": {"@type": "Organization", "name": "\nAdapted liberally from Staff Meals from Chanterelle"}, "description": "<p>The cream cheese doesn’t so much change the flavor profile but adds a bit more depth of flavor and an amazing crackly edge.</p>", "totalTime": "", "recipeYield": "Serves (at least) 10", "recipeIngredient": ["1 1/2 cups (12 ounces or 340 grams) unsalted butter, at room temperature", "1 package (8 ounces or 225 grams) Philadelphia brand cream cheese*, at room temperature", "3 cups (595 grams) granulated sugar", "6 large eggs", "1 1/2 teaspoons pure vanilla extract plus 1/2 teaspoon almond extract (original recipe calls for 2 teaspoons vanilla but I liked this mix better)", "3 cups (375 grams) all purpose flour", "1 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 cups (12 ounces or 340 grams) unsalted butter, at room temperature<br/>\n1 package (8 ounces or 225 grams) Philadelphia brand cream cheese*, at room temperature<br/>\n3 cups (595 grams) granulated sugar<br/>\n6 large eggs<br/>\n1 1/2 teaspoons pure vanilla extract plus 1/2 teaspoon almond extract (original recipe calls for 2 teaspoons vanilla but I liked this mix better)<br/>\n3 cups (375 grams) all purpose flour<br/>\n1 teaspoon salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F. Lightly butter a 10-inch tube pan, then line the bottom with parchment paper. Alternately, you can use a 12-cup bundt pan, and simply butter and flour it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the butter and cream cheese in a large bowl and beat with a mixer on medium speed until smooth. Add the sugar, increase the speed to high, and beat until light and airy, at least five minutes. Add the eggs, one at a time, beating after each addition and scraping down the sides of the bowl with a rubber spatula as needed. Add the vanilla, almond, then the flour and salt all at once. Beat just until incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan and shake lightly to even out the top. Bake until the cake is golden brown and a toothpick inserted in the cake comes out clean, 1 1/4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the pan on a cake rack and cool for 20 minutes, then remove the cake from the pan and let it cool completely. Serve at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Philadelphia cream cheese is often recommended for baking for consistency purposes, as in, bakers know this brand works, and because it contains less water than other brands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Variations:</u> I think this cake would be fantastic with a cup of chopped white chocolate stirred into the batter (an idea I got from <a href=\"http://sevenspoons.net/2008/02/spoonful-of-sugar.html\">this lovely lady</a>) and/or some orange zest. Or grapefruit zest. Or whole raspberries, if you can find good ones in season. Or have fun with it. A good pound cake is infinitely adaptable, and I would like to try them all.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Smaller cakes:</u> A bundt-volume cake <i>often</i> can be used to make two 8 1/2-by-4 1/4-by-2 1/2-inch loaf cakes, however (caveat!) I have not tested this recipe in loaf pans. I just wanted to throw that out there for those of you feeling adventurous, or interested in a reduced volume of cake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Strawberry Coulis</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Where has this been my whole life? I have spent — nay <i>wasted</i> — too much time making cooked fruit compotes for dessert when some fruits, like berries, will always taste better raw. I suspect you could swap any berry for the strawberry in this coulis, but you might have to bump up the sugar accordingly. And then share with me.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups quartered hulled strawberries (about 12 ounces or 340 grams)<br/>\n1/4 cup (60 ml) water<br/>\n3 tablespoons (35 grams) sugar<br/>\n1 tablespoon (15 ml) fresh lemon juice</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine strawberries, water, sugar and lemon juice in blender. Purée until very smooth, then press through a fine mesh strainer to remove the seeds. Cover and refrigerate until cold. Coulis can be prepared one day ahead.</p>"}], "link": "https://smittenkitchen.com/2009/03-cream-cheese-pound-cake-strawberry-coulis"}