{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/08/3786776229_18db5a68fe_b.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, everyday cakes, photo", "name": "Lighter, Airy Pound Cake", "author": {"@type": "Organization", "name": "\nAdapted from James Beard’s Beard on Food"}, "description": "<p>The brilliance of this pound cake is all of the things that have been done to make it airier than a standard pound cake: the repeated sifting, the whipped egg whites and a little extra help from baking powder. Oh, and the cognac-lemon combination? Delightful. You’ve got to try it.</p><p>The original recipe is double this size, and can be baked in a buttered and floured tube or bundt pan; it should bake for about an hour. I added the weights of most of the ingredients, something I am trying to remember to do more often.</p>", "totalTime": "", "recipeYield": "Makes one loaf cake", "recipeIngredient": ["1/2 pound (2 sticks or 8 ounces or 226 grams) butter, at room temperature, plus more for greasing the pan", "1 1/2 cups (200 grams) all-purpose flour, plus more for dusting the pan", "1/2 teaspoon (3 grams) baking powder", "Salt", "4 large eggs, separated", "3/4 cup plus 2 tablespoons (186 grams) sugar", "1 tablespoon Cognac [brandy works as well, as does rum, as would one teaspoon of an extract of your choice]", "1 1/2 teaspoons grated lemon zest."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 pound (2 sticks or 8 ounces or 226 grams) butter, at room temperature, plus more for greasing the pan<br/>\n1 1/2 cups (200 grams) all-purpose flour, plus more for dusting the pan<br/>\n1/2 teaspoon (3 grams) baking powder<br/>\nSalt<br/>\n4 large eggs, separated<br/>\n3/4 cup plus 2 tablespoons (186 grams) sugar<br/>\n1 tablespoon Cognac [brandy works as well, as does rum, as would one teaspoon of an extract of your choice]<br/>\n1 1/2 teaspoons grated lemon zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1. Preheat the oven to 350 degrees. Butter and flour a loaf pan. Sift the flour onto waxed paper and then spoon it gently back into the sifter, adding the baking powder and a good pinch of salt. Sift the mixture twice more, each time spooning it lightly into the sifter. [I know what you must be thinking: Beard expect me to sift my dry ingredients three times? But oh, it lends to the most delicate, light crumb and texture. Don’t skimp!]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2. Using an electric mixer, whip the egg whites until they hold soft peaks and then gradually beat in 1/2 cup (100 grams) of the sugar, two tablespoons at a time. Transfer to a bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3. Fit the electric mixer with a paddle attachment and cream the butter until light and fluffy. Beat in the remaining six tablespoons (86 grams) of sugar until fluffy. Beat in the egg yolks until light and lemon-colored and then add the Cognac and zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4. Gradually fold the sifted flour mixture into the butter-egg mixture. Fold in the beaten egg whites just until the batter is smooth. Pour batter into the prepared pan and bake in the oven for 35 to 45 minutes or until a toothpick pierced in the center comes up clean. Cool in pan ten minutes on a rack, then cool the rest of the way out of the pan.</p>"}], "link": "https://smittenkitchen.com/2009/08-lighter-airy-pound-cake"}