{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/07/best-birthday-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, chocolate, photo", "name": "Best Yellow Layer Cake", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Everyone needs a killer yellow cake recipe. This is mine, and dare I say, it should be yours too. It just works. Every time. And if you’ve ever tried a yellow cake mix and wondered why yours didn’t come out that consistently plush (but not freakishly unnatural) at home, dare I say it’s because you hadn’t made this one yet?</p>", "totalTime": "", "recipeYield": "Two 9-inch round, 2-inch tall cake layers, and, in theory, 22 to 24 cupcakes, two 8-inch squares or a 9×13 single-layer cake (I have yet to audition the cupcakes, shame on me)", "recipeIngredient": ["4 cups plus 2 tablespoons (480 to 530 grams due to variance between brands) cake flour (not self-rising)", "2 teaspoons (10 grams) baking powder", "1 1/2 teaspoons baking soda", "1 teaspoon (5 grams) table salt", "2 sticks (1 cup, 1/2 pound or 225 grams) unsalted butter, softened", "2 cups (400 grams) sugar", "2 teaspoons (10 ml) pure vanilla extract", "4 large eggs, at room temperature", "2 cups buttermilk (475 ml), well-shaken"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 cups plus 2 tablespoons (480 to 530 grams due to variance between brands) cake flour (not self-rising)<br/>\n2 teaspoons (10 grams) baking powder<br/>\n1 1/2 teaspoons baking soda<br/>\n1 teaspoon (5 grams) table salt<br/>\n2 sticks (1 cup, 1/2 pound or 225 grams) unsalted butter, softened<br/>\n2 cups (400 grams) sugar<br/>\n2 teaspoons (10 ml) pure vanilla extract<br/>\n4 large eggs, at room temperature<br/>\n2 cups buttermilk (475 ml), well-shaken</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Butter two 9-inch round cake pans and line with circles of parchment paper, then butter parchment. (Alternately, you can use a cooking spray, either with just butter or butter and flour to speed this process up.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together flour, baking powder, baking soda, and salt in a medium bowl. In a large mixing bowl, beat butter and sugar in a large bowl with an electric mixer at medium speed until pale and fluffy, then beat in vanilla. Add eggs 1 at a time, beating well and scraping down the bowl after each addition. At low speed, beat in buttermilk until just combined (mixture will look curdled). Add flour mixture in three batches, mixing until each addition is just Incorporated.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread batter evenly in cake pan, then rap pan on counter several times to eliminate air bubbles. (I like to drop mine a few times from two inches up, making a great big noisy fuss.) Bake until golden and a wooden pick inserted in center of cake comes out clean, 35 to 40 minutes. Cool in pan on a rack 10 minutes, then run a knife around edge of pan. Invert onto rack and discard parchment, then cool completely, about 1 hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Chocolate Sour Cream Frosting</b><br/>\nAdapted from <a href=\"http://www.amazon.com/gp/product/0316496987?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0316496987\">The Dessert Bible</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Yes, it’s true: A chocolate frosting recipe without any butter, whipped eggs and barely a modicum of added sugar. Oh, and you don’t even need an electric mixer to make it. What are you waiting for?</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Only cooking note: Be sure that your sour cream is at room temperature before you make the frosting. I did not (the original recipe does not warn of this) and just as I poured in the melted chocolate, my super buzzed on my apartment door to check on my always-malfunctioning oven and when I’d returned minutes later, the chocolate had seized a little, leaving little bits (like chocolate chips!) throughout my frosting. These could have been strained out but I decided they made the cake more rustic. Nevertheless, room temperature sour cream — a temperature closer to the tepid chocolate — should allow you to avoid this, ringing doorbells or not.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Concerned about the sourness? Perhaps you might enjoy some <a href=\"https://smittenkitchen.com/2009/08/espresso-chiffon-cake-with-fudge-frosting/\">Instant Fudge Frosting</a> instead.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes 5 cups of frosting, or enough to frost and fill a two layer 9-inch cake</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>15 ounces semisweet or bittersweet chocolate, chopped<br/>\n1 1/4 teaspoons instant espresso (optional, but can be used to pick up the flavor of average chocolate)<br/>\n2 1/4 cups sour cream, at room temperature<br/>\n1/4 to 1/2 cup light corn syrup<br/>\n3/4 teaspoon vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the chocolate and espresso powder, if using, in the top of a double-boiler or in a heatproof bowl over simmering water. Stir until the chocolate is melted. (Alternately, you can melt the chocolate in a microwave for 30 seconds, stirring well, and then heating in 15 second increments, stirring between each, until the chocolate is melted.) Remove from heat and let chocolate cool until tepid.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together the sour cream, 1/4 cup of the corn syrup and vanilla extract until combined. Add the tepid chocolate slowly and stir quickly until the mixture is uniform. Taste for sweetness, and if needed, add additional corn syrup in one tablespoon increments until desired level of sweetness is achieved.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool in the refrigerator until the frosting is a spreadable consistency. This should not take more than 30 minutes. Should the frosting become <i>too</i> thick or stiff, just leave it out until it softens again.</p>"}], "link": "https://smittenkitchen.com/2009/07-best-birthday-cake"}