{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/artichokes-braised-in-lemon-and-olive-oil1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "artichokes, citrus, photo, spring, vegan, vegetarian", "name": "Artichokes Braised in Lemon and Olive Oil", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet, November 2008"}, "description": "<p>I have no doubt that this method of cooking artichokes — braising them in a flavorful liquid and then browning them — could be adapted with many different flavorings, so have fun with it and don’t worry about being too literal. I bet a few glugs of white wine, some thyme sprigs, maybe a few of those giant cerignola olives and/or even some favas or white beans could be delicious in here. We ended up chopping ours over pasta with parmesan shavings for dinner, but they were equally delicious the next day with no extras at all.</p>", "totalTime": "", "recipeYield": "Makes 8 first course or side dish servings", "recipeIngredient": ["1 lemon, halved", "8 medium artichokes", "3 small shallots, sliced into thin rings", "1 carrot, finely chopped", "3 garlic cloves, thinly sliced", "1/4 teaspoon fennel seeds", "1/4 teaspoon coriander seeds", "1/2 cup extra-virgin olive oil, divided", "1 1/2 cups water", "3 strips lemon zest", "1/4 cup fresh lemon juice, divided", "2 tablespoons coarsely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 lemon, halved<br/>\n8 medium artichokes<br/>\n3 small shallots, sliced into thin rings<br/>\n1 carrot, finely chopped<br/>\n3 garlic cloves, thinly sliced<br/>\n1/4 teaspoon fennel seeds<br/>\n1/4 teaspoon coriander seeds<br/>\n1/2 cup extra-virgin olive oil, divided<br/>\n1 1/2 cups water<br/>\n3 strips lemon zest<br/>\n1/4 cup fresh lemon juice, divided<br/>\n2 tablespoons coarsely chopped flat-leaf parsley</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Trim artichokes into hearts</u> [See photo collage, above]: Add lemon halves to a large bowl of cold water, squeezing to release juice. Cut off top inch of 1 artichoke <b>[1]</b> and bend back outer leaves until they snap off close to base (keep stem attached). Discard several more layers in same manner until you reach pale yellow leaves.<b>[2]</b> Cut remaining leaves flush with top of artichoke bottom using a sharp knife. <b>[3]</b> Trim dark green fibrous parts from base and sides of artichoke.<b>[4]</b> Peel sides of stem down to pale inner core. <b>[5]</b> Put in lemon water while preparing remaining artichokes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Prepare braise:</u> Cook shallots, carrot, garlic, and seeds in 1/4 cup oil in a 4-to 5-quart heavy pot (pot should be wide enough to hold artichokes in 1 layer with stems pointing upward) over medium heat, stirring occasionally, 3 minutes. Add water, zest, and 3 tablespoons lemon juice and bring to a simmer. Stand artichokes in pot and season with 1 teaspoon salt and 1/4 teaspoon pepper. Cover artichokes with wax paper, then a lid, and simmer over medium-low heat until bases are just tender when pierced with a knife, 20 to 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer artichokes to a dish and reserve cooking liquid. When artichokes are cool enough to handle, halve lengthwise. Scoop out and discard inner choke (fuzzy center and any sharp leaves).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat 2 tablespoons oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then brown cut sides of artichokes in 2 batches, about 2 minutes per batch, transferring to a serving dish. Add reserved cooking liquid to skillet along with remaining tablespoon lemon juice and remaining 2 tablespoons oil. Boil vigorously 3 minutes, then stir in parsley and pour over artichokes. Serve warm or at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Artichokes can be braised 1 day ahead and chilled in cooking liquid. Reheat to warm before proceeding.</p>"}], "link": "https://smittenkitchen.com/2009/03-artichokes-braised-in-lemon-and-olive-oil"}