{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/07/3750059011_2643b0d11d_o.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cherries, fruit, photo, picnics, summer, tarts pies", "name": "Sour Cherry Slab Pie", "author": {"@type": "Organization", "name": "\nAdapted from Martha Stewart"}, "description": "<p>I’ve already sung the praises of the the slab pie (above) but let me also mention this: I’m generally repelled by white sugar glazes on pastries. They seem to add sweetness, but not much else. Yet on this slab pie, with its lightly sweetened, tart cherry filling between two layers of barely-sweetened pie dough, it works so well. It is absolutely meant to be.</p><p>1 1/2 All Butter, Really Flaky Pie Doughs, divided, patted into thick rectangles, wrapped in plastic and chilled for at least an hour in the fridge</p>", "totalTime": "", "recipeYield": "Varies, but I cut mine into 20 2 1/2-inch by 3-inch pieces", "recipeIngredient": ["6 cups sour cherries, pitted (fresh or frozen will work; if frozen, defrost and drain first)", "3/4 to 1 1/4 cups of sugar*", "1/4 cup cornstarch", "Juice of half a lemon", "Pinch or two of salt", "2 tablespoons heavy cream or one egg, beaten with a tablespoon of water", "RECIPE_SUBHED__1<u>Glaze:</u>", "1 cup confectioners’ sugar", "1 to 2 tablespoons milk or water ", "<i>or</i>", " 1 tablespoon water plus 1 tablespoon lemon juice (I did this to make the glaze more interesting)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Glaze:</u><br/>\n1 cup confectioners’ sugar<br/>\n1 to 2 tablespoons milk or water <i>or</i> 1 tablespoon water plus 1 tablespoon lemon juice (I did this to make the glaze more interesting)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°. In a large bowl, combine cherries, sugar, cornstarch, lemon juice, and salt. Stir to combine; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, roll out the larger piece of dough into an 18-by-12-inch rectangle. I won’t lie: this can be kind of a pain because it is so large. Do your best to work quickly, keeping the dough as cold as possible (and tossing it in the freezer for a couple minutes  if it softens too quickly; it <i>is</i> summer afterall) and using enough flour that it doesn’t stick to the counter. [<a href=\"https://smittenkitchen.com/2008/11/pie-crust-103-rolling-and-crimping/\">See more of my pie-rolling tips here</a>.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a 15-by-10-by-1-inch rimmed baking sheet, (pastry will hang over sides of pan). I went ahead and lined mine with parchment, just to ensure I’d be able to easily lift it out. Pour cherry mixture into lined baking sheet; set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, roll out remaining piece of dough into a 16-by-11-inch rectangle. Drape over filling. Bring bottom pastry up and over top pastry. Pinch edges to seal. Using a fork, prick top crust all over. Brush with heavy cream or egg wash.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until crust is golden and filling is bubbling, 40 to 55 minutes. Transfer to a wire rack until just warm to the touch, about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, stir together confectioners’ sugar and milk, water or lemon juice (or combination thereof) until desired glaze consistency is achieved. Use a spoon to drizzle over top. Serve warm or room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Martha had suggested 1 to 1 1/2 cups sugar for 6 cups of sour cherries. I balked, imagining my beautiful Jersey cherries drowning a syrupy death, and used 3/4 cup, which yielded a lightly-sweetened pie with the tartness of the cherries still coming through, just as we like. Please adjust this to your tastes, and according to the tartness of the cherries you brought home.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Some tips for replacing the sour cherries with other fruit:</b> This pie is roughly 100% of a regular pie filling with 150% percent of the crust. Thus, if you’re looking to use something besides sour cherries, you can swap in 6 cups of any other fruit. Adjust the sugar accordingly — you’ll probably want less sugar with peaches or berries than you would with very sour cherries, or the same amount, if you like your pies on the sweeter side. (Remember, I kept this one very lightly sweetened.) Adjust the cornstarch accordingly too — peaches and berries usually let off more liquid than apples, but only slightly more than cherries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One other route you can take is to use the filling part of your favorite pie recipe, as most standard fruit pies contain 6 cups of berries or chopped fruit. This way you’ll already know what spices, if any, you want to add and that the amount of sweetener and/or cornstarch/thickener is already spot-on. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>And do share your tweaks in the comments: I am sure that others would love to benefit from your experimentation!</p>"}], "link": "https://smittenkitchen.com/2009/07-sour-cherry-slab-pie"}