{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2009/01/chicken-milanese-and-a-escarole-salad.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, escarole, greens, italian, photo, pickled, salad, savory projects, weeknight favorite", "name": "Chicken Milanese and Escarole Salad with Pickled Red Onions", "author": {"@type": "Organization", "name": "\nAdapted from Anne Burrell"}, "description": "<p>If you make nothing else, just make the salad. The salad has made me fall head over heels in love with escarole; I am rapidly making up for lost time with it. But really, you should make all of it. This dish is a perfect pairing and every guest cleaned their plate.</p><p>A note on doubling the recipe (as we did): I found I had way more battering station stuff than I needed for a doubled recipe. I know that a certain amount of extra is necessary to be able to generously dip the chicken, but when doubled, I ended up throwing way too much away to be comfortable with. Try 1.5-ing the egg batter, flour and bread crumb mixture instead, and see if it is enough. You can always add more.</p>", "totalTime": "", "recipeYield": "Serves 4", "recipeIngredient": ["RECIPE_SUBHED__1<u>For the Pickled Onions: </u>", "1/2 cup red wine vinegar (I swapped half with white vinegar; I was feeling stingy with my fancy red wine stuff)", "1/2 cup cold water", "", "<s>2</s>", " tablespoons kosher salt (updated: 1 heaped tablespoon is a better amount here)", "1 tablespoon sugar", "2 to 3 really good shots hot sauce", "1 red onion, sliced into very thin rings", "RECIPE_SUBHED__2<u>For the Chicken Milanese: </u>", "1 cup all-purpose flour", "2 eggs, beaten with 1 tablespoon of water", "1 1/2 cups panko bread crumbs", "1/2 cup grated pamesan", "4 small boneless, skinless chicken breasts, butterflied and lightly pounded/flattened (no need to tenderize; a good organic chicken breast will already be tender, says Burrell) to 1/4-inch thick*", "Kosher salt and pepper", "Extra-virgin olive oil, for frying", "RECIPE_SUBHED__3<u>For the Escarole Salad:</u>", "1/2 cup grated pecorino romano", "1/2 cup toasted hazelnuts", "2 tablespoons freshly chopped parsley leaves", "1 head escarole, washed, spun dry, cut into bite size pieces", "High-quality extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For the Escarole Salad:</u><br/>\n1/2 cup grated pecorino romano<br/>\n1/2 cup toasted hazelnuts<br/>\n2 tablespoons freshly chopped parsley leaves<br/>\n1 head escarole, washed, spun dry, cut into bite size pieces<br/>\nHigh-quality extra-virgin olive oil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the pickled red onions:</u> In a small bowl, combine red wine vinegar with 1/2 cup of cold tap water. Stir in salt, the sugar and the hot sauce. Add the sliced onions and let sit for at least one hour. [Do ahead: We made these the night before to save time; they were even better pickled overnight.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the chicken milanese:</u> Set up a standard breading procedure in three wide deep plates. Fill one with flour, one with the beaten eggs, and one with the panko and grated cheese. Season the chicken breasts with salt and pepper. Using one hand for dry things and one hand for wet things, take each piece of chicken through the breading procedure: dredge lightly in the flour, then the egg wash and then through the bread crumbs. Lay the breaded chicken on a sheet tray and refrigerate for at least one hour. [Do ahead: You could even prep these the night before, to save time. Cover them loosely with plastic wrap in the fridge.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour olive oil into a large saute pan until it reaches a thickness of about a half an inch – better a little more rather than a little less. Bring to a medium-high heat. Test the oil by flicking flour or bread crumbs into the oil. If it doesn’t sizzle, <i>wait</i>! When the oil is hot, test it again by dipping the edge of a piece of chicken into the oil, the oil should gently sizzle. Cook the chicken in the oil in batches on both sides until it is a lovely golden brown color and is crispy, about four to five minutes on the first side and three to four minutes on the second. Do not crowd the pan or the chicken will become very greasy and soggy. When the chicken comes out of the oil lay it on paper towels to drain off the excess oil and sprinkle with salt. [Do ahead: You can keep the chicken in a low oven to keep it warm while the rest of the chicken is cooking. I did this to hold it until we were ready to eat.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the escarole salad:</u> Combine the romano, hazelnuts and parsley in the food processor and pulse until they are coarsely chopped. Toss together the escarole, hazelnut mixture and some of the pickled red onions and dress with some of the pickling liquid and olive oil. Season with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chicken on each serving plate and top with the escarole salad.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Tiny kitchen tip! My makeshift setup since I don’t have one of those mallet things was to lay the breasts out on a cutting board, cover them with plastic and thwack away at them with a small, heavy saucepan. It worked great! And I had one less gadget to buy.</p>"}], "link": "https://smittenkitchen.com/2009/01-chicken-milanese-an-escarole-salad"}