{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/07/4845748189_22706f936b_o.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "grilling, meat, photo, pork meat", "name": "Sweet and Smoky Oven Spareribs", "author": {"@type": "Organization", "name": "\nAdapted from Harold McGee, via The New York Times 6/30/10"}, "description": "<p>My only nitpicking about this recipe is that I found them a little sweet for my tastes. Sugar plays an important part in barbecue, in both flavor and caramelization, so I might be hesitant to dial it back by more than 1/4, but I would increase the salt, and possibly double it. Honestly, you can tweak the rub any which way (add cumin, black pepper or red pepper flakes, more paprike, more chile powder), there’s no way these can come out badly. Last thought: If you’ve got an oven thermometer, watch it instead of your temperature dial. I find that oven temperatures seem to be the most off at the lowest settings (my oven’s “200” was pushing past 250 on the thermometer) and while you can cook these ribs at a higher temperature, you certainly wouldn’t want to accidentally for 6 hours.</p>", "totalTime": "", "recipeYield": "5 pounds should serve four people, we halved this and found 2 1/2 pounds to be generous for 2 people and might estimate 1 pound per person next time", "recipeIngredient": ["1 cup brown sugar", "2 tablespoons chili powder (ancho is recommended) or paprika", "2 teaspoons salt (see Note above about increasing it)", "2 teaspoons garlic powder", "1/4 teaspoon ground cloves", "1/2 teaspoon ground cinnamon", "5 pounds spareribs, cut into 4 slabs, rinsed and patted dry", "2 teaspoons mild or hot pimentón (smoked Spanish paprika)", "1 tablespoon cider vinegar or red or white vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup brown sugar<br/>\n2 tablespoons chili powder (ancho is recommended) or paprika<br/>\n2 teaspoons salt (see Note above about increasing it)<br/>\n2 teaspoons garlic powder<br/>\n1/4 teaspoon ground cloves<br/>\n1/2 teaspoon ground cinnamon<br/>\n5 pounds spareribs, cut into 4 slabs, rinsed and patted dry<br/>\n2 teaspoons mild or hot pimentón (smoked Spanish paprika)<br/>\n1 tablespoon cider vinegar or red or white vinegar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 200°F. In a mixing bowl, combine the brown sugar, chili powder or paprika, salt, garlic powder, cloves and cinnamon; you can do this easily with a fork. Place each slab of ribs on a piece of foil large enough to fold into a packet. Sprinkle spice rub over the ribs, patting it in generously on all sides — you’ll be glad you did. Turn the ribs meat side down and tightly fold the foil to make sealed packets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put a rack on a baking sheet (I needed two racks and two sheets; a cookie cooling rack works for this) and place it in the oven. Bake for 4 hours at 200°F, then reduce the temperature to 175°F for another two hours or until a fork easily penetrates the meat. Open each packet carefully and pour the accumulated juices into a saucepan. Boil the juices and reduce them by half, at which point you will have a syrupy sauce that easily coats a spoon. Stir in paprika and vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove the ribs from the foil and either coat them with the sauce or serve the sauce alongside the ribs. (I have friends who consider barbecue sauce on ribs heretic, thus would give them the choice.) For extra caramelization, the ribs can be finished for a few minutes under the broiler, before being coated with sauce.</p>"}], "link": "https://smittenkitchen.com/2010/07-sweet-and-smoky-oven-spareribs"}