{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/poppy-seed-lemon-cake1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, citrus, lemon, photo", "name": "Poppy Seed Lemon Cake", "author": {"@type": "Organization", "name": "\nAdapted, barely, from Kurt Gutenbrunner via Food & Wine"}, "description": "<p>As excited as I was about finally finding this recipe as I set about baking it I was consumed with doubt. “Only two-thirds of a cup of sugar? A half cup of flour to eight yolks and one whole egg? How can this work? This will never work. I shouldn’t make this. I hate throwing nearly a dozen eggs out, and the skins of two gorgeous organic lemons…” Fortunately I eventually shut up and can assure you, this is the cake I’d been looking for all along: a zillion tiny cracking poppy seeds, fragrant with lemon and loud with butter.</p><p>Yes, I reversed the “lemon” and “poppy seed” in the title as I was convinced that the emphasis was on the wrong sylable, as they say.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2/3 cup sugar", "8 large egg yolks", "1 large whole egg", "1 1/2 tablespoons finely grated lemon zest (from 2 lemons)", "1/2 cup all-purpose flour", "1/2 cup cornstarch", "Pinch of salt (edited to add this)", "2 sticks (1/2 pound) unsalted butter, melted and cooled a bit", "1/2 cup poppy seeds (I got this from one 3-ounce spice bottle)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2/3 cup sugar<br/>\n8 large egg yolks<br/>\n1 large whole egg<br/>\n1 1/2 tablespoons finely grated lemon zest (from 2 lemons)<br/>\n1/2 cup all-purpose flour<br/>\n1/2 cup cornstarch<br/>\nPinch of salt (edited to add this)<br/>\n2 sticks (1/2 pound) unsalted butter, melted and cooled a bit<br/>\n1/2 cup poppy seeds (I got this from one 3-ounce spice bottle)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 325°F Butter and flour an 8-inch*  fluted Bundt or tube pan generously. (This cake very much wants to stick. Don’t let it!)  Butter the dull side of a 10-inch piece of foil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I only had a 10-inch and it worked fine; the cake was done about 10 minutes sooner.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the whisk, beat the sugar with the egg yolks and whole egg at medium-high speed until the mixture is pale yellow and very fluffy, about 8 minutes. Beat in the lemon zest. Sift the flour and cornstarch over the egg mixture and fold in along with the pinch of salt with a rubber spatula. At medium speed, beat in the butter, then beat in the poppy seeds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour the batter into the prepared pan and cover tightly with the buttered foil. Bake for 45 minutes, or until the cake pulls away from the side of the pan and a cake tester inserted in the center of the cake comes out clean. Remove the foil and let the cake cool in the pan on a rack for 15 minutes. Invert the cake onto the rack and let cool completely before serving, at least 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> The cake can be wrapped in plastic and foil and left at room temperature for up to 3 days. </p>"}], "link": "https://smittenkitchen.com/2010/01-poppy-seed-lemon-cake"}