{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/11/chocolate-doughnut-holes1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, chocolate, doughnut, photo", "name": "Chocolate Doughnut Holes", "author": {"@type": "Organization", "name": "\nAdapted from Use Real Butter who adapted it from Diana’s Desserts"}, "description": "<p>My changes were to adjust the flour a bit, tweak a couple ingredients, add additional instructions, weights and I used a different glaze.</p>", "totalTime": "", "recipeYield": "4 dozen 1.5-inch holes. I halved the recipe and used a 1.25-inch cutter so I had a little over 2 dozen.", "recipeIngredient": ["2 3/4 cups (12 3/8 ounces or 352 grams) all-purpose flour", "1 cup (3 ounces or 90 grams) unsweetened Dutch-process cocoa", "2 teaspoons (about 3/8 ounce or 10 grams) baking powder", "1/2 teaspoon (about 1/8 ounces or 4 grams) salt", "4 large eggs", "1 1/2 (10 5/8 ounces or 300 grams) cups sugar", "1/3 cup (2 7/8 ounce or 84 grams) sour cream (what I used) or buttermilk or you can ", "<a href=\"https://smittenkitchen.com/tips/make-your-own-buttermilk/\">make your own</a>", "3 tablespoons (1 1/2 ounces or 42 grams) butter, melted and cooled a bit", "Your fat of choice for frying (solid vegetable shortening or canola, peanut or vegetable oil are popular choices)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 3/4 cups (12 3/8 ounces or 352 grams) all-purpose flour<br/>\n1 cup (3 ounces or 90 grams) unsweetened Dutch-process cocoa<br/>\n2 teaspoons (about 3/8 ounce or 10 grams) baking powder<br/>\n1/2 teaspoon (about 1/8 ounces or 4 grams) salt<br/>\n4 large eggs<br/>\n1 1/2 (10 5/8 ounces or 300 grams) cups sugar<br/>\n1/3 cup (2 7/8 ounce or 84 grams) sour cream (what I used) or buttermilk or you can <a href=\"https://smittenkitchen.com/tips/make-your-own-buttermilk/\">make your own</a><br/>\n3 tablespoons (1 1/2 ounces or 42 grams) butter, melted and cooled a bit<br/>\nYour fat of choice for frying (solid vegetable shortening or canola, peanut or vegetable oil are popular choices)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour, cocoa, baking powder and salt together in a large bowl. In a medium one, whisk eggs, sugar, sour cream or buttermilk and butter. Stir wet ingredients into dry until well blended. Chill batter until cold, at least 1 hour and up to 3.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour your counter <i>generously</i> (see Note up top) and scrape dough onto it. Flour dough. Flour your hands. Gently pat dough out until it is 1/2-inch thick. Dip a 1 1/4 to 1 1/2-inch round cutter into a dish of flour and cut rounds from dough. Pat scraps of dough together and cut them again. If your dough or doughnut holes have gotten too soft to easily pick up, put them on a floured or parchment or waxed paper-lined tray and put them in the freezer for a few minutes, until they’re firm enough to gently handle again. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your fryer or fill a 5 to 6-quart with 4 inches of oil. Heat to 375°F (190°C). You can fry 6 to 12 doughnut holes at a time, about one full minute on each side. The trickiest parts will be visualizing when the doughnuts are done — since they’re chocolate, the color change will be subtle; I suggest practicing with scraps of extra dough first — and keeping your oil at an even temperature, if you’re not using a deep-fryer. Make sure you bring the oil back to 375°F after each batch.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drain doughnut holes on a stack of paper towels. Once cool, roll in glaze (below) and let drain and dry on cooling racks. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I understand that these should keep for a day or two. We’ll probably never find out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Full-Sized Chocolate Doughnuts:</b> You can use this same dough to make 3-inch round doughnuts (with a 1-inch hole removed from the center). Because the dough is fragile, I definitely recommend popping the shapes in the freezer to firm up a little before you drop them in the fryer. You will want to fry them for 2 minutes on each side. It should yield about 16 3-inch doughnuts. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Chocolate-Stuffed Doughnut Holes:</b> Why didn’t I think of this before? I bet awesome things would happen if you pressed a tiny piece of chocolate into the center of your unfried doughnut hole. Let us know if you try it in the comments.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Doughnut Glaze</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8 ounces powdered sugar<br/>\n3 tablespoons water, milk or buttermilk (what I used, highly recommended)<br/>\n1/8 teaspoon vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together until smooth. If you need it thinner, add more water, milk or buttermilk, a few drops at a time.</p>"}], "link": "https://smittenkitchen.com/2010/06-chocolate-doughnut-holes"}