{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/02/chocolate-souffle-cupcakes-with-int-cream.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, chocolate, gluten free, passover, photo", "name": "Chocolate Soufflé Cupcakes with White Chocolate Mint Cream", "author": {"@type": "Organization", "name": "\nCupcakes very generously adapted a Bon Appetit recipe; whipped cream brilliance via a Claudia Fleming recipe"}, "description": "<p>Be ye not intimidated by all of the fancy words floating around here: this recipe is approachable stuff: melted chocolate, separated eggs, things folded together and whipped again. Your hand mixer does all of the work. You, however, may have all of the glory when you surprise your lady- or ladfriend with these this weekend.</p><p>[Updated to note: Many people who have made this say they’re getting 12! cupcakes. So you might have more chocolate awesomeness than you’d intended. If you end up with more cupcakes, go ahead and double the whipped cream recipe. To be safe. You will not regret it.]</p>", "totalTime": "", "recipeYield": "Makes 9* cupcakes (see Note above)", "recipeIngredient": ["RECIPE_SUBHED__1<u>Chocolate Soufflé Cupcakes</u>", "6 ounces (170 grams) bittersweet or semisweet chocolate, chopped (I preferred this with bittersweet)", "6 tablespoons (3/4 stick or 85 grams) unsalted butter, cut into pieces", "Heaping 1/4 teaspoon (1 gram) espresso or instant coffee powder", "3 large eggs, separated", "6 tablespoons (75 grams) sugar, divided", "1/4 teaspoon salt", "1 teaspoon vanilla extract", "RECIPE_SUBHED__2<u>White Chocolate Mint Cream</u>", "2 ounces (55 grams) white chocolate, finely chopped", "3 ounces heavy whipping cream", "1/8 teaspoon peppermint extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>White Chocolate Mint Cream</u><br/>\n2 ounces (55 grams) white chocolate, finely chopped<br/>\n3 ounces heavy whipping cream<br/>\n1/8 teaspoon peppermint extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Get the white chocolate mint cream ready for later:</u> Place the white chocolate in a small bowl. Bring the cream to a simmer, pour it over the chocolate and let it sit for a minute to melt the chocolate. Whisk well. Add the peppermint extract and whisk again. Lay a piece of plastic wrap on the surface of the cream. Chill until very cold, about two hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make cupcakes:</u> Preheat oven to 350°F. Line 9 standard-size (3-ounce) muffin cups with paper liners. Stir chocolate, butter and espresso powder together in heavy medium saucepan over low heat mostly melted, then remove from the heat and whisk until it is fully melted and smooth. (I like to put the butter underneath the chocolate in the pan, so that it protects the chocolate from the direct heat.) Cool to lukewarm, stirring occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using electric mixer (a hand mixer, rather than a stand mixer, actually works best here because the volumes are so small) beat egg yolks and 3 tablespoons sugar in medium bowl until mixture is very thick and pale, about 2 minutes. Briefly beat lukewarm chocolate mixture, then vanilla extract, into yolk mixture. Using clean dry beaters, beat egg whites in another medium bowl until soft peaks form. Gradually add remaining 3 tablespoons sugar and all of the salt, beating until medium-firm peaks form. Fold whites into chocolate mixture in 3 additions. Divide batter among prepared cups, filling each three-fourths of the way. (You might find, as I did, that you had enough leftover for a extra half-cake. That’s your “taste tester”. It’s a, uh, very important part of the process.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cakes until tops are puffed and dry to the touch (some may crack, embrace it) and a tester inserted into the centers comes out with some moist crumbs attached, about 15 to 20 minutes. Cool in pan on a cooling rack, where the cupcakes will almost immediately start to fall. It will be all the better to put your mint cream on them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Finish your masterpiece:</u> Beat mint white chocolate cream with electric beaters until soft peaks form. Remove cupcakes from pan, arrange on a platter. Fill each sunken top with a healthy dollop of white chocolate mint cream. Top with shaved dark chocolate, if you’re feeling fancy. I’d say “eat at once” but I suspect that you already have.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Yes, nine. I honestly wanted it to make a neat, normal number like a half dozen so badly that in my first flop, I attempted to shove all the batter into six cups. Don’t do this.<br/>\n** I also tried to make this without the cupcake liners, by just buttering the cupcake molds. Don’t do this either, unless you want you end result to look <a href=\"http://www.flickr.com/photos/smitten/4342046045/\">like this</a>.</p>"}], "link": "https://smittenkitchen.com/2010/02-chocolate-souffle-cupcakes-with-mint-cream"}