{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/04/cabbage-and-lime-salad-with-roasted-peanuts.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cabbage, citrus, photo, picnics, salad, spinach, summer", "name": "Cabbage and Lime Salad with Roasted Peanuts", "author": {"@type": "Organization", "name": "\nAdapted from the Lee Bros. Simple Fresh Southern"}, "description": "", "totalTime": "", "recipeYield": "Right, so, about the slaw: Lime. Peanuts. Red and green cabbage. Slivers of spinach. The lime is awesome, although I really have to advise against the whole lime segments they suggest in the original recipe (which I omit here) as we lovelovelove lime around here and it was still too much lime, by far. Peanuts are wonderful, even better if you can find some of those giant Virginia peanuts I sometimes see at stores (these, sadly, were not). The spinach is definitely a little odd in the slaw department; it is not the most stable lettuce thus not the kind of thing I’d want to eat hours after it had been tossed with dressing but in this, it works. And it makes the salad even prettier, which in my book counts too.", "recipeIngredient": ["1/2 small red cabbage, trimmed, cored, and shredded (about 6 cups)", "1/2 small green cabbage, trimmed, cored, and shredded (about 6 cups)", "1 tablespoon kosher salt, plus more to taste", "1 bunch fresh baby spinach, stemmed and cut into 1/2-inch wide ribbons (about 4 cups loosely packed)", "1/4 cup fresh lime juice (from about 2 small limes)", "1 tablespoon Dijon or other salty prepared mustard", "1/2 teaspoon ground cumin", "1/4 cup peanut oil", "1/2 cup roasted unsalted peanuts, coarsely chopped", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 small red cabbage, trimmed, cored, and shredded (about 6 cups)<br/>\n1/2 small green cabbage, trimmed, cored, and shredded (about 6 cups)<br/>\n1 tablespoon kosher salt, plus more to taste<br/>\n1 bunch fresh baby spinach, stemmed and cut into 1/2-inch wide ribbons (about 4 cups loosely packed)<br/>\n1/4 cup fresh lime juice (from about 2 small limes)<br/>\n1 tablespoon Dijon or other salty prepared mustard<br/>\n1/2 teaspoon ground cumin<br/>\n1/4 cup peanut oil<br/>\n1/2 cup roasted unsalted peanuts, coarsely chopped<br/>\nFreshly ground black pepper</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, toss the shredded red and green cabbage with the salt. Transfer the cabbage to a colander and let it drain for two hours. (I was in a rush and did this in one. It was still nicely wilted, but of course could have been even softer.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’re worried about the cabbage being too salty when you’re done with the salting process, taste a piece of cabbage and if it concerns you, rinse and drain the cabbage well. This is not a suggestion in the original recipe, but something I suspect might bother some people.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the salted, drained cabbage back into your (rinsed and dried) large bowl and add the spinach. In a medium bowl, whisk the lime juice, mustard and cumin together. Add the peanut oil in a thin stream, whisking constantly until the ingredients are thoroughly emulsified. Toss the salad with the dressing and add the roasted peanuts. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This salad is best served immediately, but it does keep surprisingly well in the fridge for a day or two. </p>"}], "link": "https://smittenkitchen.com/2010/04-cabbage-and-lime-salad-with-roasted-peanuts"}