{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-corn-spoonbread.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "corn, gluten free, photo, side dish, thanksgiving", "name": "Sweet Corn Spoonbread", "author": {"@type": "Organization", "name": "\nAdapted, just a little, from Cook’s Country"}, "description": "<p>As originally written, this recipe used a ridiculous amount of dishes and appliances. I run into this a lot in the CI universe; I have great respect for what they do, this attempt at perfect recipes, but they often leave me questioning if it is worth all that. Fortunately, this is. That said, I found a place or two where the recipe could be streamlined, and if you have an immersion blender, this is a great time to use it and save yourself energy. Finally, the recipe suggests you preheat your oven before you begin. For me, this led to an oven running at 400 degrees for an hour — silly. But some ovens take longer than others to preheat; if yours is one of them, turn it on when the recipe suggests. If not, find a time 20 minutes or so before you need to bake it.</p>", "totalTime": "", "recipeYield": "Serves 6, generously", "recipeIngredient": ["1 cup cornmeal", "2 3/4 cups whole milk", "4 tablespoons unsalted butter, plus additional for greasing dish", "2 cups corn kernels (from 3 to 4 ears of corn, or frozen, if defrosted and well drained)", "1 teaspoon sugar", "1 teaspoon salt", "1/8 teaspoon cayenne", "3 large eggs, separated", "1/4 teaspoon cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup cornmeal<br/>\n2 3/4 cups whole milk<br/>\n4 tablespoons unsalted butter, plus additional for greasing dish<br/>\n2 cups corn kernels (from 3 to 4 ears of corn, or frozen, if defrosted and well drained)<br/>\n1 teaspoon sugar<br/>\n1 teaspoon salt<br/>\n1/8 teaspoon cayenne<br/>\n3 large eggs, separated<br/>\n1/4 teaspoon cream of tartar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 400°F (see Note above if this seems too early). <i>Very</i> generously grease a 1 1/2 quart soufflé dish or an 8-inch square baking dish. Whisk cornmeal and 3/4 cup of milk in a small bowl until combined and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt butter in a Dutch oven or large, heavy pot over medium-high heat. Cook corn until beginning to brown, which can take as little as 3 minutes with fresh corn but with defrosted frozen corn, took me closer to 10 minutes. Stir in sugar, salt, cayenne and remaining 2 cups milk and bring to a boil. Remove from heat, cover, and let mixture steep for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’ve got an immersion blender, please use it to save time. Otherwise, transfer mixture to a blender or food processor and puree until smooth. Back in the pot (or still, if it had never left) bring it back to a boil, reduce heat to low and add the cornmeal-milk mixture, whisking constantly until thickened, about 2 to 3 minutes. If you want to do fewer dishes and don’t mind if it takes longer to cool, you can leave it in the pot. Otherwise, transfer to a large bowl and return mixture to room temperature, about 20 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cool, whisk in egg yolks. Beat egg whites and cream of tartar in a medium bowl until stiff peaks form and fold it in to the corn mixture, one-third at a time. Pour batter into prepared baking dish and baked until spoonbread is golden brown and has risen above rim of dish, about 45 minutes. Serve immediately.</p>"}], "link": "https://smittenkitchen.com/2010/11-sweet-corn-spoonbread"}