{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/upside-down-cranberry-cake1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, cranberries, fall, photo, thanksgiving", "name": "Upside-Down Cranberry-Caramel Cake", "author": {"@type": "Organization", "name": "\nAdapted from The Perfect Finish (previously from this book)"}, "description": "<p>If you don’t like molasses, I’d use honey or light corn syrup instead because although just a tablespoon, you can taste it (though we found it delicious against the tart berries). If you’re thinking, as I was, that there was no need for a parchment paper circle in the bottom (and later, top) of the pan, you can probably skip it. The “probably” is there because I didn’t get to retest this without it but see nothing to worry about; if a berry sticks, just scoop it and plop it on top of the cake. The cake itself is a little on the shortcake side — sturdier than your average plush layer cake but still quite moist. Still, if you want a more traditional upside-down cake base, I think this one is phenomenal (you might even swap the pineapple juice for white cranberry) as is this one.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["Unsalted butter or cooking spray for the baking pan", "2/3 cup (5 ounces or 142 grams) packed light brown sugar", "12 tablespoons (1 1/2 sticks, 6 ounces or 171 grams) unsalted butter, melted", "1 tablespoon unsulphured molasses", "2 cups (8 1/2 ounces or 242 grams) all-purpose flour", "1 cup (7 ounces or 198 grams) sugar", "2 teaspoons (9 grams) baking powder", "1 teaspoon salt", "3 large eggs, at room temperature", "1 cup (8 1/2 ounces or 242 grams) sour cream", "2 cups (8 ounces or 230 grams) fresh or frozen cranberries (you could add a half-cup more, if you, too, can never have enough cranberries)", "Optional flavorings: 1/2 teaspoon vanilla extract, 1/4 teaspoon almond extract, 1 tablespoon orange or lemon juice or 1/4 teaspoon zest, 1/4 teaspoon ground cinnamon, few gratings of fresh nutmeg or a combination thereof", "Whipped cream, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Unsalted butter or cooking spray for the baking pan<br/>\n2/3 cup (5 ounces or 142 grams) packed light brown sugar<br/>\n12 tablespoons (1 1/2 sticks, 6 ounces or 171 grams) unsalted butter, melted<br/>\n1 tablespoon unsulphured molasses<br/>\n2 cups (8 1/2 ounces or 242 grams) all-purpose flour<br/>\n1 cup (7 ounces or 198 grams) sugar<br/>\n2 teaspoons (9 grams) baking powder<br/>\n1 teaspoon salt<br/>\n3 large eggs, at room temperature<br/>\n1 cup (8 1/2 ounces or 242 grams) sour cream<br/>\n2 cups (8 ounces or 230 grams) fresh or frozen cranberries (you could add a half-cup more, if you, too, can never have enough cranberries)<br/>\nOptional flavorings: 1/2 teaspoon vanilla extract, 1/4 teaspoon almond extract, 1 tablespoon orange or lemon juice or 1/4 teaspoon zest, 1/4 teaspoon ground cinnamon, few gratings of fresh nutmeg or a combination thereof<br/>\nWhipped cream, optional</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Grease a 9-inch round cake pan with butter and cover the bottom with parchment paper (see Note above). In a medium saucepan over medium heat, combine the brown sugar, 4 tablespoons (1/4 cup) of the melted butter, molasses and 1/4 cup water and bring to a boil. Stir well and pour into prepared cake pan. Set pan aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift the flour, sugar, baking powder and salt together into a bowl or onto a sheet of waxed paper and set aside. In the bowl of an electric mixture fitted with the whisk attachment (eh, I just used a handmixer with standard beaters) beat the eggs and sour cream together at medium speed until well blended. Add optional flavorings of your choice. Scrape down the bowl and add remaining melted butter (1/2 cup) and beat until combined. Add flour mixture and beat until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cranberries to the prepared baking pan and gently press the fruit into an even layer. Dollop the batter on top and use an offset spatula to gently nudge it into place without disturbing the cranberries underneath. Bake on the center rack (with a tray underneath to catch drips… just in case; mine did not overflow but came stressfully close) until golden and a tester inserted into just the cake comes out clean, which took 30 to 35 minutes in my oven but is suggested to take 45. Please, <i>please</i> check yours on the early side. Remove from the oven and let cool in pan for 15 minutes. Run a thin knife around the inside of the pan then insert over a flat platter that is (Learn From My Mistakes Alert!) larger than your cake pan, to catch any puddling or jumping cranberries. Remove the parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm, with freshly whipped cream. However, this cake wasn’t half bad two to three days layer, kept covered at room temperature.</p>"}], "link": "https://smittenkitchen.com/2010/11-upside-down-cranberry-cake"}