{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/new-york-deli-rye-bread1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, photo", "name": "New York Deli Rye Bread", "author": {"@type": "Organization", "name": "\nAdapted from The Bread Bible"}, "description": "<p>I have trimmed Beranbaum’s directions significantly. The thing is, she gives great and extensively detailed directions, but my thing is, I like to pare things down a little bit, especially when it comes to bread. I honestly believe that once you are certain your yeast is working, it’s harder to mess up a loaf of bread than it is to make it delicious. Follow the rising times and size pointers, see that it’s kneaded well and baked at the right temperature and you can have a little bit of New York City in your kitchen without a lot less dingy gray snow and loud sirens.</p><p>Set aside 8 hours for this. Yes, eight. You’ll only need to be hands-on for about 30 minutes of it, and you’re welcome to run errands in the rising intervals, but you need to be able to check in every hour or two. It’s worth it, promise.</p>", "totalTime": "", "recipeYield": "Makes one 1 3/4-pound round loaf", "recipeIngredient": ["RECIPE_SUBHED__1<u>Sponge</u>", "3/4 cup (4 ounces, 117 grams) bread flour", "3/4 cup (3.3 ounces, 95 grams) rye flour", "1/2 teaspoon (1.6 grams) instant yeast", "1 1/2 tablespoons (0.6 ounces, 18.7 grams) sugar", "1/2 tablespoon (4.6 grams) malt powder (or barley malt syrup or honey (10.5 grams), or sugar (6.2 grams))", "1 1/2 cups (12.5 ounces, 354 grams) water, at room temperature", "RECIPE_SUBHED__2<u>Flour Mixture</u>", "2 1/4 cups (12.5 ounces, 351 grams) bread flour", "1/2 plus 1/8 teaspoon (2 grams) instant yeast", "2 tablespoons (0.5 ounces, 14 grams) caraway seeds (you can grind these if you want to avoid the crunch)", "1/2 tablespoon (0.3 ounces, 10.5 grams) coarse salt", "RECIPE_SUBHED__3<u>Dough and Baking</u>", "1/2 tablespoon (0.25 ounces, 6.7 grams) vegetable oil", "about 2 teaspoons (about 0.5 ounces, 16 grams) cornmeal for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Dough and Baking</u><br/>\n1/2 tablespoon (0.25 ounces, 6.7 grams) vegetable oil<br/>\nabout 2 teaspoons (about 0.5 ounces, 16 grams) cornmeal for sprinkling</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Make the sponge:</b> Combine sponge ingredients in a large or mixer bowl and whisk until very smooth, to intentionally incorporate air — this will yield a thick batter. Set it aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Make the flour mixture and cover the sponge:</b> In a separate large bowl, whisk together the flour mixture  and gently scoop it over the sponge to cover it completely. Cover the bowl tightly with plastic wrap and allow it to ferment for 1 to 4 hours at room temperature. (The sponge will bubble through the flour mixture in places.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Mix the dough [Either with a mixer]</b> Add the oil and mix with the dough hook on low speed for about 1 minute, until the flour is moistened enough to form a rough dough. then raise the speed to medium and mix it for 10 minutes. The dough should be very smooth and elastic, and it should jump back when pressed with a fingertip; if it is sticky, turn it out on a counter and knead in a little extra flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>[Or by hand]</b> Add the oil and, with a wooden spoon or your hand, stir until the flour is moistened. Knead the dough in the bowl until it comes together, then scrape it onto a very lightly floured counter. Knead the dough for 5 minutes, after which it might be a little sticky. Cover it with the inverted bowl and allow it to rest for 20 minutes. (Resting the dough makes it less sticky and magically easier to work with. Trust me.) Knead the dough for another 5 to 10 minutes or until it is very smooth and elastic and your upper arms are strapless gown-ready.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Let the dough rise:</b> Place the dough in a large container or bowl, lightly oiled. Oil the top of the dough as well. Allow the dough to rise until doubled, 1 1/2 to 2 hours. Flip the bowl over and let the dough fall out on to a lightly floured counter, press it down gently, fold or form it back into a square-ish ball and allow it to rise a second time, back in the (re-oiled) bowl covered with plastic wrap for about 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Shape it and wait out the final rise: Turn the dough out onto a lightly floured counter and gently press it down again. Round it into a ball and set it on a cornmeal sprinkled baking sheet. Cover it with oiled plastic wrap and let it rise until almost doubled, about 1 hour to 1 hour 15 minutes. [Skim ahead to preheating your oven, which you should do soon.] When it is gently press with a fingertip, the depression will very slowly fill in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Preheat the oven:</b> Preheat the oven to 450°F as early as you can tolerate. (Beranbaum suggests an hour, I do 30 minutes but I know others don’t like to feel like they’re wasting heat. But, you want your oven blazing hot to get the best crust.) On a shelf at the lowest level, place a baking sheet or bread stone. [If you want to get fancy and bread-oven like: Place a cast-iron skillet or sheet pan on the floor of the oven to preheat.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Slash and bake the bread:</b> With a sharp knife or singled-edged razor blade, make 1/4- to 1/2-inch-deep slashes in the top of the dough. Mist the dough with water and quickly but gently set the baking sheet on the hot stone or hot baking sheet. [If you’ve decided to get fancy and bread oven-like: Toss 1/2 cup of ice cubes into the pan beneath and immediately shut the door.] Bake for 15 minutes, lower the temperature to 400°F and continue baking for 30 to 40 minutes or until the bread is golden brown and a skewer inserted into the middle comes out clean (or a thermometer inserted into the center reads 190°F; I prefer this method because you’ve done much too much work to possibly end up with an under- or over-baked loaf of bread).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool the bread on a wire rack.</p>"}], "link": "https://smittenkitchen.com/2010/01-new-york-deli-rye-bread"}