{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/baked-rigatoni-with-tiny-meatballs1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "casserole, freezer friendly, italian, meat, pasta, photo", "name": "Baked Rigatoni with Tiny Meatballs", "author": {"@type": "Organization", "name": "\nAdapted, no doubt blasphemously, from Marcella Hazan"}, "description": "<p>There’s a lot of room for tweaking here: If you’re certain you won’t be happy without a veritable oozing of cheese, you could tear up some fresh mozzarella and toss it in with the dish before you baked it. If you cannot bring yourself to eat this unless it contains one form of vegetable matter, I imagine a bit of cooked spinach, steamed broccoli bits or even eensy cubes of roasted carrot and parsnip would work in here.</p>", "totalTime": "", "recipeYield": "When I first realized that this “baked ziti” lacked a tomato sauce, I had my doubts. But then Alex said “it would be like Italian mac and cheese!” and then, predictably, it had my full attention. Although the original dish didn’t yield anything so sauced and cheesy as the mac-and-cheese we know, I’ve upped the sauce, cheese and seasoning for a baked pasta that is more lush, but surprisingly un-heavy. This is still a subtle baked pasta.", "recipeIngredient": ["RECIPE_SUBHED__1<u>For the meatballs:</u>", "1/4 cup milk", "1 slice good white bread trimmed of its crust", "1 pound ground pork (or beef, or lamb, or a mix of the three)", "1 teaspoon chopped garlic", "2 tablespoons chopped parsley", "1/3 cup freshly grated parmigiano-reggiano (Parmesan)", "1 egg", "Salt", "Black pepper in a grinder", "1 cup flour, spread on a plate", "Vegetable oil for frying", "RECIPE_SUBHED__2<u>For the bèchamel:</u>", "4 1/2 cups milk", "6 tablespoons butter", "5 tablespoons flour", "1/8 teaspoon grated nutmeg", "1/2 teaspoon salt", "1/4 teaspoon ground black pepper", "RECIPE_SUBHED__3<u>To finish:</u>", "1 pound rigatoni", "3/4 cup freshly grated parmigiano-reggiano", "1 tablespoon butter", "1/4 cup milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To finish:</u><br/>\n1 pound rigatoni<br/>\n3/4 cup freshly grated parmigiano-reggiano<br/>\n1 tablespoon butter<br/>\n1/4 cup milk</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the meatballs:</u> Heat the milk, but don’t let it simmer. Tear pieces of the white bread into it and let it soak for 5 minutes, before picking it up with your hand, squeezing it of excess milk and putting it in a large mixing bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the pork, garlic, parsley, grated cheese, egg, salt, and pepper. Combine all the ingredients with a fork until they are evenly mixed (or “amalgamated”, as Hazan so charmingly says).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pinch off a small lump of meat, about the size of a raspberry and roll the lump into a ball in the palm of your hands. (Hazan says if you are good with your hands, you can try making 3 balls at a time. It turns out, I am not.) When all the meatballs have been shaped (a process that took less time than I had expected, just the same), roll them in the flour, 15 to 20 at a time. Place the floured meatballs in a strainer and shake it smartly to dispose of excess flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put enough vegetable oil in a skillet to rise 1/4-inch up the sides of the pan and turn on the heat to medium high. When the oil is hot, put as many meatballs in the skillet as will fit without overcrowding. Brown them until they form a nice crust all around. When one batch is done, transfer it with a slotted spoon to a platter covered with paper towels to drain and do the next batch until all are done.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the bèchamel:</u>  Heat the milk over low heat in a saucepan until it forms a ring of pearly bubbles, but do not let it break into a boil. In a larger saucepan, melt the butter over low heat, add the flour and stirring constantly with a wooden spoon or flat whisk until combined. Add 2 tablespoons of milk at a time to the flour and butter mixture, stirring steadily and thoroughly, then repeat through 8 additions. At this point, you can add the milk in 1/2 cup increments, stirring constantly to keep it smooth. Add the salt, pepper and nutmeg and stir the sauce until it thickens.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble the dish:</u> Cook the rigatoni in a pot of well salted water. Drain when still al dente, and combine immediately in bowl with two-thirds of the bèchamel, half the grated cheese, and all the meatballs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 400°F. Heavily butter a 9×13 baking dish. (Original recipe calls for a 12-inch springform, which I am sure would be lovely but is not the commonest U.S. cake pan.) Spread the rigatoni and meatball mixture in the pan, leveling it off with a spatula. Pour the milk over the dish, the spread the rest of bèchamel on top, and sprinkle with the remaining grated cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place in the uppermost level of the preheated oven. Bake for 15 to 20 minutes until a golden brown crust forms on top.</p>"}], "link": "https://smittenkitchen.com/2010/02-baked-rigatoni-with-tiny-meatballs"}