{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/thai-style-chicken-legs1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, grilling, photo, thai", "name": "Thai-Style Chicken Legs", "author": {"@type": "Organization", "name": "\nBarely tweaked (to add instructions, offer alternative ingredients) from Food & Wine"}, "description": "", "totalTime": "", "recipeYield": "I warn you, if you serve this with mango slaw, a quick addiction may form.", "recipeIngredient": ["5 garlic cloves, coarsely chopped", "1/4 cup chopped cilantro (or flat-leaf parsley if you are cilantro-averse)", "1/4 cup Asian fish sauce*", "1/4 cup vegetable oil", "2 tablespoons hoisin sauce (I accidentally doubled this and can only advise you do the same)", "1 1/2 teaspoons ground coriander", "1 teaspoon kosher salt", "1 teaspoon freshly ground black or white pepper", "8 whole chicken legs, split, or 8 drumsticks and 8 thighs (about 5 pounds total)", "Thai sweet chili sauce, for serving "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>5 garlic cloves, coarsely chopped<br/>\n1/4 cup chopped cilantro (or flat-leaf parsley if you are cilantro-averse)<br/>\n1/4 cup Asian fish sauce*<br/>\n1/4 cup vegetable oil<br/>\n2 tablespoons hoisin sauce (I accidentally doubled this and can only advise you do the same)<br/>\n1 1/2 teaspoons ground coriander<br/>\n1 teaspoon kosher salt<br/>\n1 teaspoon freshly ground black or white pepper<br/>\n8 whole chicken legs, split, or 8 drumsticks and 8 thighs (about 5 pounds total)<br/>\nThai sweet chili sauce, for serving </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the garlic, cilantro, fish sauce, vegetable oil, hoisin sauce, coriander, kosher salt and pepper in a blender until smooth. Arrange the pieces of chicken in a large, shallow glass or ceramic dish. Pour the marinade over the chicken and turn to coat the pieces thoroughly. Cover and refrigerate for several hours, or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To roast the chicken:</u> Preheat oven to 450 degrees. Cover baking dish with a lid or foil and roast chicken for about 25 minutes. If the sauce begins to char, sprinkle a few tablespoons water into the dish. Remove the lid or foil and bake for an additional 5 to 10 minutes, until the skin is crisp and the meat is cooked through.**</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To grill the chicken:</u> [Lacking a grill, I did not test this method but I will be happy to if you invite me over tonight, okay?] Light a grill. If using a gas grill, turn off the center burners; if using a charcoal grill, once the coals are covered with a light ash, push them to opposite sides, forming a well in the middle. Set a disposable drip pan in the center. Cook chicken on the hot grate above, skin side down, with the cover down for about 40 minutes. The skin should be crisp and the meat should be cooked through.**</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Both methods:</u> Once cooked, transfer to plates and serve with Thai chili sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Do ahead:</b> The marinade can be refrigerated overnight. I like it so much, I am tempted to make a larger batch of it to keep in the freezer until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* Don’t like fish sauce? Don’t want to eat it? Neither did I before about five minutes ago. Anyway, I often see low-sodium soy sauce suggested as an alternative but I’m not convinced it’s a fair swap. There’s something more caramelized and fermented in the fish sauce that you’d miss. If you feel like playing around, I might whisk some additional hoisin or even miso into that soy sauce for a more complex flavor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>** To ensure your chicken is “cooked through”: Lacking x-ray vision and decades of chicken-cooking practice, I’m a big fan of using a thermometer to ensure that my meat is properly cooked. A thermometer inserted into the thigh/leg joint should register 180 to 185 degrees if you’re following Proper Chicken Cooking Protocol, or 170 to 175 degrees, if you’re me, and have very specific chicken-cooking preferences despite what food safety experts advise. I like to live on the edge, obviously. Another classic, though less precise way, to see if chicken is cooked through is to pierce it with a knife. If the juices that run out are clear, your chicken should be just right.</p>"}], "link": "https://smittenkitchen.com/2010/07-thai-style-chicken-legs"}