{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/05/rustic-rhubarb-tarts1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "easter, photo, rhubarb, spring, tarts pies", "name": "Rustic Rhubarb Tarts", "author": {"@type": "Organization", "name": "\nAdapted from Good to the Grain"}, "description": "<p>The original recipe included a rhubarb hibiscus compote which I am sure would be wonderful, but I’m not so into the floral thing and quite into the rhubarb-vanilla bean combination, so I changed it. Because I’m the boss in my own kitchen. The original recipe also used 2 pounds of rhubarb. I discovered I’d only brought home 1 1/2 pounds of rhubarb, scaled the recipe down, then found that my tarts did best with less than the recommend amount of compote, 3 tablespoons instead of 4, which meant than I only needed 3/4 of the volume — brilliant! It couldn’t have worked out more perfectly and I am recommending the same below.</p>", "totalTime": "", "recipeYield": "I bet you would also like to know, “Why corn flour?” Well, Kim Boyce says that she loves cornmeal but found that by combining it with corn flour she could get the full flavor and pretty color of cornmeal without the rough bite. It also makes for a wonderfully delicate crust, as it has no gluten in it, but by combining it with regular flour, you can get the structure you need. How about that!", "recipeIngredient": ["1 cup corn flour", "1 cup all-purpose flour", "1/2 cup fine cornmeal", "1/4 cup plus 2 tablespoons sugar", "1 teaspoon Kosher or coarse salt", "1 stick (4 ounces) cold unsalted butter, cut into small pieces", "1/4 cup plus 2 tablespoons heavy cream", "2 egg yolks", "1 batch Rhubarb Vanilla Compote (recipe below)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup corn flour<br/>\n1 cup all-purpose flour<br/>\n1/2 cup fine cornmeal<br/>\n1/4 cup plus 2 tablespoons sugar<br/>\n1 teaspoon Kosher or coarse salt<br/>\n1 stick (4 ounces) cold unsalted butter, cut into small pieces<br/>\n1/4 cup plus 2 tablespoons heavy cream<br/>\n2 egg yolks<br/>\n1 batch Rhubarb Vanilla Compote (recipe below)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>In a food processor:</u> Combine the dry ingredients in the work bowl of your food processor. Add the butter and pulse in short bursts, until the mixture resembles coarse cornmeal. Add heavy cream and egg yolks and pulse until combined; it will look crumbly but it will become one mass when kneaded together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>In a stand mixer:</u> Whisk the dry ingredients in the bowl of a stand mixer. Using the paddle attachment, add the butter and turn the mixture speed to low (you’ll want to lock the top, so the mixture doesn’t fly about) and mix to break up the butter. Increase the speed to medium and mix until the butter is as coarse as cornmeal. Add the heavy cream and egg yolks and mix until combined. The dough will look crumbly but when pinched between your fingers, it will come together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>By hand:</u> The butter can also be blended into the dry ingredients with a pastry blender, or you fingertips. The cream and egg yolks can be mixed into the butter mixture with a wooden spoon. You’ll likely want to turn the dough out onto a counter to gently knead it into one mass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Shape the tarts:</u> Divide the dough into 10 equal pieces. Lightly flour a work surface and using the heel of your hand, flatten the dough into a rough circle. Continue flattening until it is approximately 5 inches in diameter. Try to work quickly, so the dough doesn’t get too warm and soft, making it harder to handle. For more elegant edges, gently flatten the outer edge of the circle with your fingertips, making it thinner than the rest of the dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon 3 tablespoons of the Rhubarb Vanilla Compote into the center of the dough. Fold the edge of the dough toward the compote and up, to create a ruffled edge; continue around the perimeter, letting the ruffles be their bad irregular selves. Slide a bench scraper or spatula under the tart and transfer it to a parchment-lined baking sheet. Continue with the remaining dough. Freeze the tarts on their tray for at least 1 hour or up to 2 weeks, wrapped tightly in plastic.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Bake the tarts:</u> Preheat over to 375°F. Bake tarts, still frozen, for about 35 minutes or until the edges of the tarts are brown and the rhubarb is bubbling and thick. Serve warm or at room temperature. The tarts keep in an airtight container (or not, as I forgot to wrap mine and they were still awesome the next day) for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Rhubarb Vanilla Compote</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 pounds rhubarb stalks<br/>\n1 cup minus 1 tablespoon dark brown sugar (i.e. 15 tablespoons, if you want to drive yourself mad)<br/>\n1/2 vanilla bean, split and seeds scraped</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Rinse the rhubarb stalks and trim the very ends. Cut them in half lengthwise (unless they’re very slim) and then on the diagonal into 3/4-inch chunks. Leaving the last 1 1/2 cups aside, put 3 cups of the rhubarb into a large, heavy-bottomed pot. Add the brown sugar, vanilla bean seeds and pods and turn the heat to medium low. (You want to start at a low temperature to encourage the rhubarb to release its liquid. Unlike most compotes, this one adds no water.) Cook the rhubarb mixture, covered, for about 15 minutes, or until the mixture is saucy. Remove the cover and increase the heat to medium, cooking an additional 15 to 17 minutes, or until the rhubarb is completely broken down and thick enough that a spoon leaves a trail at the bottom of the pan. Discard your vanilla bean pods and add remaining rhubarb chunks to the compote. Pour the compote out onto a large plate to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Do ahead:</b> This keeps for one week in the fridge. It can also be used to fill pies, crisps and cobblers.</p>"}], "link": "https://smittenkitchen.com/2010/05-rustic-rhubarb-tarts"}