{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/09/skirt-steak-salad-with-blue-cheese.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beef, date night, meat, photo, salad, weeknight favorite", "name": "Skirt Steak Salad with Arugula and Blue Cheese", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I attempted an interesting-sounding retro salad dressing from this recipe and found it… inedible. I then made it a second time with no lime juice, a little bit of lime zest, half the balsamic vinegar and half the sugar and we found it… passable. (Well, I found it passable, my husband liked it.) If you’d like to make Catalina-ish dressing, that’s how I’d suggest going about it. However, to my taste, next time I will make this with a sharp mustard vinaigrette with a dash of Worcestershire sauce, a little steakhouse touch I love in salads like this, recipe below.</p>", "totalTime": "", "recipeYield": "Serves 4", "recipeIngredient": ["1 pound skirt steak, trimmed of excess fat if necessary, halved crosswise, at room temperature", "1 to 2 tablespoons olive oil", "1 pint (2 cups) cherry tomatoes, halved", "1/2 cup (about 4 ounces) crumbled blue cheese", "1/2 pound baby arugula", "Vinaigrette (below)", "3 tablespoons minced chives, 2 thinly sliced scallions or 3 tablespoons finely chopped red onion, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound skirt steak, trimmed of excess fat if necessary, halved crosswise, at room temperature<br/>\n1 to 2 tablespoons olive oil<br/>\n1 pint (2 cups) cherry tomatoes, halved<br/>\n1/2 cup (about 4 ounces) crumbled blue cheese<br/>\n1/2 pound baby arugula<br/>\nVinaigrette (below)<br/>\n3 tablespoons minced chives, 2 thinly sliced scallions or 3 tablespoons finely chopped red onion, for garnish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pat steak dry and season on both sides 1/2 teaspoon salt and many grinds of black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>In a cast-iron skillet:</u> Heat skillet on medium-high to high and add olive oil. When oil begins to shimmer, place steak in skillet and do not move it for 5 minutes. Turn it once, and cook for another 3 minutes for medium-rare. You may need to cook your steak halves separately, depending on the size of your pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>On a grill:</u> Prepare grill for direct-heat cooking over hot charcoal or high heat for gas. Oil grill rack, then grill steak, covered only if using a gas grill, turning once, 4 to 6 minutes total for medium-rare.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer steak to a cutting board and let rest, loosely covered with foil, for five minutes. Arrange arugula on a large platter. Thinly slice steak on the diagonal, across the grain. Arrange over arugula, then toss halved cherry tomatoes and blue cheese over platter. Add vinaigrette to taste, then sprinkle with chives, scallions or red onion. Serve with additional vinaigrette on the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Steakhouse Mustard Vinaigrette</b><br/>\n1 tablespoon coarse Dijon mustard<br/>\n2 tablespoons wine vinegar<br/>\n1/4 teaspoon Worcestershire sauce<br/>\n1/2 teaspoon honey<br/>\n1/3 cup olive oil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk ingredients. Season with salt and pepper and adjust ingredients to taste (usually more Dijon and vinegar for me).</p>"}], "link": "https://smittenkitchen.com/2010/09-skirt-steak-salad-with-arugula-and-blue-cheese"}