{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/05/mushroom-crepe-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, eggs, mushrooms, photo", "name": "Mushroom Crêpe Cake", "author": {"@type": "Organization", "name": "\nAdapted a bit generously from Alton Brown"}, "description": "<p>I made a bunch of changes to this recipe — skipping the shiitakes, confident I could make a delicious filling with just plain old brown mushrooms; thinly slicing all of them because I wanted the filling to lay flat; adding some heat guidance on the stove; a little thickener to the sauce, which was much too thin to spread (it mostly stayed in the pan) and a bunch of boring fixes for things I ran into — a lot more than I’d expected to need. I’ve concluded I’m getting too exacting in my advanced age because who complains about an Alton Brown recipe not working?</p>", "totalTime": "", "recipeYield": "Serves 6, or 8 if you’re putting out a spread", "recipeIngredient": ["1 cup yellow onion, diced", "3 tablespoons butter", "1 pound cremini mushrooms, thinly sliced", "1/2 teaspoon kosher salt", "1/4 teaspoon freshly ground pepper", "1 teaspoon flour", "1/2 cup (4 ounces) milk", "1/2 cup mild white cheese, mozzarella or provolone, shredded", "Savory crêpes, recipe follows", "2 tablespoons chives, thinly sliced (I skipped this, didn’t have them on hand)", "1/4 cup Parmesan, shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup yellow onion, diced<br/>\n3 tablespoons butter<br/>\n1 pound cremini mushrooms, thinly sliced<br/>\n1/2 teaspoon kosher salt<br/>\n1/4 teaspoon freshly ground pepper<br/>\n1 teaspoon flour<br/>\n1/2 cup (4 ounces) milk<br/>\n1/2 cup mild white cheese, mozzarella or provolone, shredded<br/>\nSavory crêpes, recipe follows<br/>\n2 tablespoons chives, thinly sliced (I skipped this, didn’t have them on hand)<br/>\n1/4 cup Parmesan, shredded</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large sauté pan over medium-low heat, melt one tablespoon of butter and begin to cook the onion so that it “sweats” but does not gain color. Turn the heat to medium-high, add all of the mushrooms and remaining two tablespoons butter. Season with salt and pepper and sauté until mushrooms are soft. Stir in the flour, then drizzle in the milk while you stir. Reduce the liquid in the pan by half. Add the provolone or mozzarella and let it melt. Immediately take filling off the heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Layer two crêpes on a buttered sheet pan (Brown says that this allows you to still save your cake if the bottom one sticks — smart!). Spread a thin layer of the filling onto the crêpe, then a few chives. Top with another crêpe and spread more filling. Repeat this process until you are out of filling. (You’ll likely run out of filling before crêpes.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Top with a final crêpe and sprinkle on the Parmesan with a caveat: Brown says you can run this under the broiler until the Parmesan is melted and golden brown. I know not all broilers are created equally (and my dinky oven is distinctly less equal than others) but mine just browned at the edges and didn’t melt. I’d either skip this next time or borrow the baby’s brûlée torch and use that instead. If you’re more confident in your broiler’s skills, go for it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Savory Crêpes</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The original recipe suggested one include herbs, spinach or sun-dried tomatoes in the crepe batter. I used herbs and honestly felt it added nothing; I vote for you to skip this. If you want to add those flavors, do it where they will be more effective, in the filling. I was able to eke out 6 crêpes in an 8 1/2-inch skillet. I would have had extras were the first couple not duds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 large eggs<br/>\n3/4 cup milk<br/>\n1/2 cup water<br/>\n1 cup flour<br/>\n3 tablespoons butter, melted<br/>\n1/2 teaspoon salt<br/>\nButter, for coating the pan</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a blender combine all of the ingredients (excepting the butter for coating the pan) and pulse for 10 seconds. (Too lazy to bust out a blender, I mixed the flour and salt and slowly whisked in a mixture of the eggs, milk, water and butter.) Place the crepe batter in the refrigerator for one hour, or up to 48 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a small non-stick pan. Add butter to coat. Pour a couple tablespoons of batter into the center of the pan and swirl to spread evenly. Cook for 30 seconds and flip. Cook for another 10 seconds and throw the crepe in the garbage; seriously, the first one is always cursed. Sometimes the second too. By the time you get to the third one, go ahead and keep what you made, even if it’s not perfect. Lay the crêpe flat on a large cutting board to the cutting board to cool; continue cooking until all of the batter is gone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Crêpe batter can be made up to two days in advance, stored in the fridge. Cooked, cooled and well-wrapped, crêpes can be stored for several days in the fridge or up to two months in the freezer. Frozen crêpes can be thawed on a rack; gently peel them as you need. Filling can be made a day in advance; reheat slowly, over a low flame. I made my crêpes in advance, and the filling in the morning; it doesn’t take much time (and even less if you clean and slice your mushrooms the night before).</p>"}], "link": "https://smittenkitchen.com/2010/05-mushroom-crepe-cake"}