{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/06/blue-cheese-and-red-potato-tart.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, potatoes, tart, vegetarian", "name": "Blue Cheese and Red Potato Tart", "author": {"@type": "Organization", "name": "\nAdapted in a bunch of ways from Gourmet"}, "description": "<p>I changed a slew of things: I opted out of the San Pellegrino and Plugrá, though you don’t need to if you’re feeling fancy. I swapped in my favorite quiche crust these days, which barely shrinks and manages to stay sturdy even without par-baking first. I made one large tart, rather than the 6 tartlets the original recipe called for, added more potatoes to compensate, and swapped tarragon (what I had on hand) for the suggested thyme and rosemary but think any herb you enjoy eating with potatoes and cheese would work.</p><p>One note: This is not a quiche. The filling will remain soft and custard-like after baked, not firm up like most egg fillings. I liked this texture; it was a little different but wanted to give a heads-up that the recipe hasn’t gone wrong if your potatoes can still be nudged a little after baking.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 Savory Tart Shell, below, or recipe of your choice, in a 9-inch tart pan and ready to fill", "1 pound small red potatoes, scrubbed and cut into 1/4-inch slices", "1 cup heavy cream", "1 large egg yolk", "1/4 pound blue cheese, crumbled (about 3/4 cup)", "1 tablespoons finely chopped herb or herbs of your choice, such as a mixture of thyme and rosemary", "Fine sea salt for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 Savory Tart Shell, below, or recipe of your choice, in a 9-inch tart pan and ready to fill<br/>\n1 pound small red potatoes, scrubbed and cut into 1/4-inch slices<br/>\n1 cup heavy cream<br/>\n1 large egg yolk<br/>\n1/4 pound blue cheese, crumbled (about 3/4 cup)<br/>\n1 tablespoons finely chopped herb or herbs of your choice, such as a mixture of thyme and rosemary<br/>\nFine sea salt for sprinkling</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. In a medium saucepan, cover potato slices with water by two inches. Simmer, uncovered, until tender, about 10 minutes. Drain. If the potatoes don’t seem very dry, pat them dry with towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange potato slices, overlapping slightly, in concentric circles around the tart pan. Sprinkle blue cheese over potatoes. Whisk cream and egg yolk together and pour into tart shell, then sprinkle tart with herbs of your choice and salt.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake tart on a baking sheet until bubbling and golden brown, about 45 to 50 minutes. Cool in pan on rack and serve warm or cold. With a big green salad, for balance.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Savory Tart Shell</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4 (5 1/2 ounces) cups flour<br/>\n1 tablespoon plus 2 teaspoons cornstarch<br/>\n1/4 teaspoon salt<br/>\n6 tablespoons (3 ounces) butter, diced<br/>\n1 large egg</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine the flour, cornstarch and salt. Cut the butter in with a pastry blender, fork or two knives until it is in very tiny bits. Add one egg and mix with a fork until a dough forms. If this does not happen easily, toss it out onto a counter and knead it together. This dough is rather tough but with a little elbow grease, it does come together nicely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>This dough can also be made a food processor, or in a stand mixer, though I’ve only tried it in a food processor.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, roll the dough out to a 12-inch circle. Place the dough in a 9-inch pie plate or tart pan and press to remove any air bubbles. Level the edges, and refrigerate for 30 minutes. Proceed with a filling of your choice, no parbaking required.</p>"}], "link": "https://smittenkitchen.com/2010/06-blue-cheese-and-red-potato-tart"}