{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/01/mixed-citrus-salad-with-feta-and-mint.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "fruit, grapefruit, herbs, orange, photo, salad, winter", "name": "Mixed Citrus Salad with Feta, Onion and Mint", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["3 to 4 tablespoons red onion, cut into tiny bits", "4 pieces of citrus, preferably a mix of grapefruits and oranges but use what you can get, and what you like to eat (spoiled by the spread at the store, I used 1 pink grapefruit, 1 cara cara and 1 blood orange, and 1 mineola)", "1 tablespoon red wine vinegar or lemon juice", "1 teaspoon smooth Dijon mustard", "1 tablespoon olive oil", "Salt and freshly ground pepper, to taste", "3 to 4 tablespoons (1.5 ounces) feta cheese, chopped or crumbled", "1 tablespoon fresh mint, chopped or cut into tiny slivers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 to 4 tablespoons red onion, cut into tiny bits<br/>\n4 pieces of citrus, preferably a mix of grapefruits and oranges but use what you can get, and what you like to eat (spoiled by the spread at the store, I used 1 pink grapefruit, 1 cara cara and 1 blood orange, and 1 mineola)<br/>\n1 tablespoon red wine vinegar or lemon juice<br/>\n1 teaspoon smooth Dijon mustard<br/>\n1 tablespoon olive oil<br/>\nSalt and freshly ground pepper, to taste<br/>\n3 to 4 tablespoons (1.5 ounces) feta cheese, chopped or crumbled<br/>\n1 tablespoon fresh mint, chopped or cut into tiny slivers</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place your red onion in the bottom of a medium bowl. Nest a strainer over the bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your citrus fruits by beveling the stem end of one, cutting enough off that you reveal the pith-free flesh of the fruit. Repeat on the other end. Rest your fruit on one of its now-flat surface and begin cutting the peel and pith off in large, vertical pieces. You want the fruit’s exterior to be “white”-free.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn the fruit back on its side and cut it into 1/4-inch thick wheels, removing any seeds and thick white stem as you do. Place the wheels and any collected juices from the cutting board in the strainer over the bowl with onion. Repeat with remaining citrus fruits. (As the extra juices drip over the bowl, it will soften the raw onion bite.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread the fruit slices out on a platter. Scoop out the onion bits (a slotted spoon or fork does the trick) and sprinkle them over, leaving the juice in the bowl. Whisk one tablespoon of juice (this is all I had accumulated) with red wine vinegar or lemon juice, Dijon and olive oil. Season with salt and freshly cracked black pepper. Drizzle the dressing over the citrus, sprinkle with feta and mint, adjust salt and pepper to taste, serve immediately and daydream of warmer places.</p>"}], "link": "https://smittenkitchen.com/2010/01-mixed-citrus-salad-with-feta-and-mint"}