{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/caramel-pudding1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, pudding", "name": "Caramel Pudding", "author": {"@type": "Organization", "name": "\nAdapted heavily from Food & Wine"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["4 cups milk, whole or 2% (no, I haven’t tried skim, if you do, let us know how it goes)", "6 tablespoons cornstarch", "2 teaspoons pure vanilla extract", "1/4 teaspoon salt", "1 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 cups milk, whole or 2% (no, I haven’t tried skim, if you do, let us know how it goes)<br/>\n6 tablespoons cornstarch<br/>\n2 teaspoons pure vanilla extract<br/>\n1/4 teaspoon salt<br/>\n1 cup sugar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk 1/2 cup of the milk with the cornstarch, vanilla and salt until smooth. Set aside. In a large saucepan, combine the sugar with 6 tablespoons of water and bring to a boil. Cook over moderately high heat, undisturbed, until a deep amber caramel forms, about 8 minutes. Be patient but watch the stove like a hawk as caramel changes color quickly, and only burns when you think you are safe leave the room for a second. Remove from the heat. Very gradually whisk in the remaining 3 1/2 cups of milk. (This is another great place for your <a href=\"https://smittenkitchen.com/tips/a-whisk-for-the-corners/\">whisk for the corners</a>.) As you begin whisking it in, <a href=\"http://www.flickr.com/photos/smitten/4246168890/\">the caramel will get very dark</a>, and likely make you nervous that you’ve burnt it. Fear not; that there is your flavor base.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Return the pot to the stove and whisk over moderate heat until the caramel has dissolved again. Once again, watch this closely as the milk will foam up quickly as it comes to a simmer. Simmer over moderately low heat until the mixture thickens slightly and deepens in color, about 10 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gradually whisk the cornstarch mixture into the caramel. Cook again over moderate heat, stirring, until the pudding thickens, about one minute. If you’re not lazy like me, strain the pudding fine strainer set over a large measuring cup; if you are, you can skip this and nothing terrible will happen. Scrape the pudding into eight 1/2-cup ramekins and refrigerate until chilled and set, about 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>To avoid a pudding skin if you, like everyone in the world but me, are pudding skin-averse:</b> Press a piece of plastic wrap onto the surface of each pudding dish as it chills.</p>"}], "link": "https://smittenkitchen.com/2010/01-caramel-pudding"}