{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/02/homemade-pop-tarts1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, photo, tarts pies", "name": "Homemade Pop Tarts", "author": {"@type": "Organization", "name": "\nAdapted from King Arthur Flour"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["RECIPE_SUBHED__1<u>Pastry</u>", "2 cups (8 1/2 ounces) all-purpose flour", "1 tablespoon sugar", "1 teaspoon salt", "1 cup (2 sticks or 8 ounces) unsalted butter, cut into pats", "1 large egg", "2 tablespoons (1 ounce) milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Pastry</u><br/>\n2 cups (8 1/2 ounces) all-purpose flour<br/>\n1 tablespoon sugar<br/>\n1 teaspoon salt<br/>\n1 cup (2 sticks or 8 ounces) unsalted butter, cut into pats<br/>\n1 large egg<br/>\n2 tablespoons (1 ounce) milk</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 additional large egg (to brush on pastry)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cinnamon Filling</u> (enough for 9 tarts)<br/>\n1/2 cup (3 3/4 ounces) brown sugar<br/>\n1 to 1 1/2 teaspoons ground cinnamon, to taste<br/>\n4 teaspoons all-purpose flour<br/>\n1 large egg, to brush on pastry before filling</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Jam Filling</u><br/>\n3/4 cup (8 ounces) jam<br/>\n1 tablespoon cornstarch mixed with 1 tablespoon cold water</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Alternate fillings:</u> 9 tablespoons chocolate chips, 9 tablespoons Nutella or other chocolate-hazelnut paste or 9 tablespoons of a delight of your choice, such as salted caramel or a nut paste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To make cinnamon filling:</u> Whisk together the sugar, cinnamon, and flour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To make jam filling:</u> Mix the jam with the cornstarch/water in a small saucepan. Bring the mixture to a boil, and simmer, stirring, for 2 minutes. Remove from the heat, and set aside to cool. Use to fill the pastry tarts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the dough:</u> Whisk together the flour, sugar, and salt. Work in the butter with your fingers, pastry blender or food processor until pea-sized lumps of butter are still visible, and the mixture holds together when you squeeze it. If you’ve used a food processor, transfer the mixture to a large bowl. Whisk the first egg and milk together and stir them into the dough, mixing just until everything is cohesive, kneading briefly on a well-floured counter if necessary.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide the dough in half (approximately 8 1/4 ounces each), shape each half into a smooth rectangle, about 3×5 inches. You can roll this out immediately (see Warm Kitchen note below) or wrap each half in plastic and refrigerate for up to 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble the tarts:</u> If the dough has been chilled, remove it from the refrigerator and allow it to soften and become workable, about 15 to 30 minutes. Place one piece on a lightly floured work surface, and roll it into a rectangle about 1/8″ thick, large enough that you can trim it to an even 9″ x 12″. [You can use a 9″ x 13″ pan, laid on top, as guidance.] Repeat with the second piece of dough. Set trimmings aside. Cut each piece of dough into thirds – you’ll form nine 3″ x 4″ rectangles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat the additional egg and brush it over the entire surface of the first dough. This will be the “inside” of the tart; the egg is to help glue the lid on. Place a heaping tablespoon of filling into the center of each rectangle, keeping a bare 1/2-inch perimeter around it. Place a second rectangle of dough atop the first, using your fingertips to press firmly around the pocket of filling, sealing the dough well on all sides. Press the tines of a fork all around the edge of the rectangle. Repeat with remaining tarts.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently place the tarts on a lightly greased or parchment-lined baking sheet. Prick the top of each tart multiple times with a fork; you want to make sure steam can escape, or the tarts will become billowy pillows rather than flat toaster pastries. Refrigerate the tarts (they don’t need to be covered) for 30 minutes, while you preheat your oven to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Charming tip from King Arthur:</u> Sprinkle the dough trimmings with cinnamon-sugar; these have nothing to do with your toaster pastries, but it’s a shame to discard them, and they make a wonderful snack. While the tarts are chilling, bake these trimmings for 13 to 15 minutes, till they’re golden brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Bake the tarts:</u> Remove the tarts from the fridge, and bake them for 20 to 25 minutes, until they’re a light golden brown. Cool in pan on rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Whole Wheat Variation:</b> I was itching to swap out 1/2 cup of the flour with whole wheat flour. I am sure it would make it more deliciously breakfast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Pop Tart Minis:</b> The biggest struggle I had with these was the size. I actually like my baked goods on the tiny size, thus I think this could make an adorable batch of 16 2 1/4″ x 3″ rectangles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Savory Pop Tarts:</b> Nix the sugar in the dough and halve the salt. Fill with pesto, cheese, ground nuts or olives, or any combination thereof. Brush the tops with additional egg wash and sprinkle with poppy or sesame seeds. Please invite me over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Do ahead:</b> The sweet versions should keep at room temperature in an airtight container for a week. If you’d like to make them further in advance, I vote for freezing them unbaked between layers of waxed paper, and baking them as you need.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Warm kitchen warning:</b> Guys, I live in an inferno, the kind of steam-heated, 85 degrees inside (68 gorgeous degrees outside) existence many other New Yorkers are familiar with. Between the heat and yesterday’s rainy humidity, me and this dough were struggling. To keep it from being too warm and soft, I was stuffing the trays of dough in the freezer for 10 minute shifts almost every time I worked with them. If you find yourself in an overly warm kitchen working with dough that gets soft too quickly, just keep using your freezer. The 10 minutes here and there that you extend this project will save you many gray hairs as the dough becomes easy to work with again.</p>"}], "link": "https://smittenkitchen.com/2010/04-homemade-pop-tarts"}