{"@context": "http://schema.org", "@type": "Recipe", "image": "", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "baby, first foods, vegetable", "name": "First Carrots", "author": {"@type": "Organization", "name": " "}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 pound bundle of carrots (I found that the slim ones with the greens still attached were the sweetest)", "1 cup water "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound bundle of carrots (I found that the slim ones with the greens still attached were the sweetest)<br/>\n1 cup water </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim and peel carrots, then cut them into 1-inch segments. Put them in a medium saucepan with the water or broth. Bring to boil, reduce to a simmer, cover the pot and cook for 25 minutes (this will take longer if your carrots are thicker). Let cool in cooking liquid. Purée in a food processor, blender or food mill and freeze in small portions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"https://smittenkitchen.com/baby/tools/\">Read more here</a> about the way I approach the processing and storing of homemade baby food.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Ideas for future carrot purées:</b> Swap the water for a sodium-free broth, add a teaspoon or two of minced dill or a pinch of cumin and/or coriander.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Carrot tip:</b> This is probably not revolutionary to anyone else, by any means, but I went most of my life mourning carrots that had become bendy and dry in the fridge, thinking they’d reached the end of their carrot lifespan prematurely. It blew my carrot-loving mind to learn than they could be “refreshed”, their snap and sometimes sweetness restored, by either storing them in cold water in the fridge, or soaking them in cold water for a while before using them, if they’ve been stored dry. I cannot tell you how many bundles of carrots I’ve saved since with this rescue mission.</p>"}], "link": "https://smittenkitchen.com/2010/05-first-carrots"}