{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/10/single-crust-apple-plum-pie.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apple, fall, photo, plum, tarts pies", "name": "Single-Crust Plum and Apple Pie", "author": {"@type": "Organization", "name": "\nAdapted from Nigel Slater"}, "description": "<p>I was at a potluck last weekend where a friend gave me a (jokingly) hard time about the ridiculous number of changes I make to a recipe while still calling it “adapted from”, so this intro is just for her: First, I put all of the measurements in “American”, i.e. cups and spoons so if some of them seem like odd amounts, keep in mind that they were nice round weights to begin with. I made a few adjustments there, too; you can use regular or coarse (turbinado or golden caster sugar, the latter of which I can only say with a terrible faux-British accent) sugar. I added some flaky salt to the crust because it is delightful there, and also a few scrapings of orange zest, because I really like it with plums. I stick the dough in the freezer instead of the fridge because I didn’t want to wait any longer for my pie than I had to.</p><p>The filling calls for either prune plums or greengages (greenish-yellow sweet plums), but I could only find the prune plums but the thought all-prune pie made me nervous about its, you know, intensity. Ahem. So I swapped half the plums with apples but I forgot that apples take much longer to bake than plums and had I cut them smaller, this shouldn’t have been an issue. Or I could have stopped fussing and made an all-plum pie. I added a squeeze of orange juice to the filling, again because I like orange against plums, a little less sugar and I mixed the whole thing in the pie dish, because I am lazy. I bet you can hear my friend rolling her eyes all the way on the other side of the internet, huh?</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["RECIPE_SUBHED__1<u>Lid</u>", "7 tablespoons (100 grams) unsalted butter, at room temperature", "1/2 cup (100 grams) granulated sugar", "1/2 teaspoon finely grated orange zest", "1 large egg, lightly beaten", "1 cup plus 6 1/2 tablespoons (175 grams) all-purpose flour", "1/2 teaspoon baking powder", "1/4 teaspoon coarse or flaky salt (or less of table salt)", "Milk or cream, for brushing crust", "Coarse or fine sugar, for sprinkling crust", "Softly whipped, lightly sweetened cream, for serving", "RECIPE_SUBHED__2<u>Filling</u>", "1 pound ripe prune plums or greengages, halved, pitted, and halved again (i.e. quartered)", "1 pound apples, peeled, cored and cut into smaller chunks (than you see in my photos)", "2 tablespoons sugar", "1/8 teaspoon ground cinnamon", "Squeeze or two of orange or lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Filling</u><br/>\n1 pound ripe prune plums or greengages, halved, pitted, and halved again (i.e. quartered)<br/>\n1 pound apples, peeled, cored and cut into smaller chunks (than you see in my photos)<br/>\n2 tablespoons sugar<br/>\n1/8 teaspoon ground cinnamon<br/>\nSqueeze or two of orange or lemon juice</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the lid:</u> In a stand mixer, cream the butter, sugar and orange zest until light and fluffy. Mix in the lightly beaten egg and scrape down sides. Slowly add the flour, baking powder and salt and beat until combined. Scrape dough into a piece of waxed paper or plastic wrap, and stick in the freezer for 10 to 20 minutes, or until firmed up.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble the pie:</u> Preheat oven to 350°F (180°C or gas mark 4) Butter a pie or baking dish. Add the fruit and spinkle it with the sugar, cinnamon and orange or lemon juice. Gently toss the ingredients together once or twice; don’t worry, they’ll “muddle” well once cooking in the oven.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll out the firmed-up lid dough on a very well floured counter and gently lift it onto the pie and trim the overhang. It will tear. This is fine, and all the better to let juice erupt through. If it flusters you, you can use some of the trimmings to patch it up but still, the pie will bubble through in other places. Brush the crust with milk or cream, sprinkle with sugar and bake for 40 minutes, until lightly golden on top. Scoop onto dishes and serve with whipped cream.</p>"}], "link": "https://smittenkitchen.com/2010/10-single-crust-plum-and-apple-pie"}