{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/09/4950027940_b3512efca3_o.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bars, brown butter, cookie, peach, photo, picnics, summer", "name": "Peach Shortbread", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I browned the butter when I made these bars and for once, I felt I could actually taste it in the final cookie (when so often it gets buried under other ingredients). By that measurement, it is absolutely worth it. Still, you can make it with straight-up non-browned butter if you are pressed for time. Simply cut softened butter into the flour (instead of frozen brown butter) and increase the flour by two tablespoons, bringing it to three full cups of flour.</p><p>Note: Your base will look a hairline thicker than mine because I, uh, lost some crumbs. Onto the floor. I don’t want to talk about it.</p><p>I cut mine into 24 2 x 2 1/2-ish squares. You can halve this and bake it in a 8 x 8 pan instead.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 cup (7 ounces or 200 grams) white sugar", "1 teaspoon (5 grams) baking powder", "2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)", "1/4 teaspoon cinnamon", "1/8 teaspoon freshly grated nutmeg", "1/4 teaspoon (2 grams) salt", "1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter", "1 large egg", "2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup (7 ounces or 200 grams) white sugar<br/>\n1 teaspoon (5 grams) baking powder<br/>\n2 3/4 cups plus 2 tablespoons (12 5/8 ounces or 359 grams) cups all-purpose flour (or you can measure 3 cups and remove 2 tablespoons flour)<br/>\n1/4 teaspoon cinnamon<br/>\n1/8 teaspoon freshly grated nutmeg<br/>\n1/4 teaspoon (2 grams) salt<br/>\n1 cup (2 sticks or 8 ounces or 227 grams) cold unsalted butter<br/>\n1 large egg<br/>\n2 peaches, pitted and thinly sliced (between 1/8 and 1/4-inch thick)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brown your butter: Melt butter in a small/medium saucepan over medium-low heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Keep your eyes on it; it burns very quickly after it browns and the very second that you turn around to do something else. Set it in the freezer until solid (about 30 minutes).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Don’t have time for all this brown butter madness? Check the head notes to use regular softened butter instead.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F (190°C). Butter a 9×13 inch pan, or spray it with a nonstick spray. In a medium bowl, stir together sugar, baking powder, flour, salt and spices with a whisk.  Use a pastry blender, fork or your fingertips, blend the solidified brown butter and egg into the flour mixture. It will be crumbly. Pat 3/4 of the crumbs into the bottom of the prepared pan, pressing firmly. Tile peach slices over crumb base in a single layer. Scatter remaining crumbs evenly over peaches and bake in preheated oven for 30 minutes, until top is slightly brown and you can see a little color around the edges. Cool completely in pan before cutting into squares.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Keeping:</u> I’ve kept mine in the fridge and they’ve held up great there since Monday. I imagine that these would freeze well, between layers of waxed paper, with the container sealed well in plastic wrap.</p>"}], "link": "https://smittenkitchen.com/2010/09-peach-shortbread"}