{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/02/spaghetti-with-cheese-and-black-pepper.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, date night, italian, pasta, photo, quick, weeknight favorite", "name": "Spaghetti with Cheese and Pepper [Spaghetti Cacio e Pepe]", "author": {"@type": "Organization", "name": "\nAdapted very loosely from Mario Batali"}, "description": "<p>As I’ve mentioned, for something with such a simple ingredient list this dish manages to fall all over the map. Some versions use just oil, no butter, some use neither oil of butter; some stud the sauce with large, barely cracked peppercorns and half-melted pebbles of romano; some opt for a smoother cheese, cacio de roma, which I located, auditioned and discovered I liked the saltier and more accessible Pecorino Romano better. There are a lot of ways to approach the dish and people who will find something inauthentic with each of them. I say ignore them all and just enjoy your spaghetti.</p>", "totalTime": "", "recipeYield": "Serves 4 as a main, 8 as a first course", "recipeIngredient": ["1/4 cup olive oil", "1 pound dried spaghetti", "2 tablespoons butter", "4 ounces Pecorino Romano cheese, finely grated", "1 1/2 teaspoon finely ground black pepper", "Salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/4 cup olive oil<br/>\n1 pound dried spaghetti<br/>\n2 tablespoons butter<br/>\n4 ounces Pecorino Romano cheese, finely grated<br/>\n1 1/2 teaspoon finely ground black pepper<br/>\nSalt (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook spaghetti in well-salted water to your <i>al dente</i> tastes in a large, wide-bottomed pot. (You’ll have fewer dishes to wash if you use this pot to assemble the dish as well.) Drain spaghetti, reserving 1 1/2 cups of pasta cooking water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry out your pot, then heat the olive oil over high heat until almost smoking. Add drained spaghetti and 1 cup of reserved pasta water and <i>jump back</i>, this will splatter mightily, also known as “I made this three times, and never once learned my lesson. Do as I say, not as I do.”</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter, 3 ounces cheese and ground pepper and toss together with tongs. Taste, adding more pasta water, cheese, pepper or salt (which should not be neccessary, as Romano is very salty) to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, sprinkling with reserved cheese and an extra grind or two of black pepper.</p>"}], "link": "https://smittenkitchen.com/2010/02-spaghetti-cacio-e-pepe"}