{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/11/apple-latkes.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apple, hanukah, jewish, pancakes, photo", "name": "Apple Latkes", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>In an earlier post about potato latkes, I share a few of my favorite tips. In summary: Keeping them in a warm oven doesn’t only keep them crisp for a long time after baking, but helps even out any uneveness from pan-frying. Well seasoned cast iron skillets make the brownest, crispiest fritters. Cheesecloths are my favorite way to wring moisture out of pancake ingredients. And finally, latkes are totally not just Hanukah food. I’d eat these for breakfast, any slept-in morning of the year, should one of those happen again in my lifetime.</p>", "totalTime": "", "recipeYield": "Makes 12 2 to 3-inch latkes", "recipeIngredient": ["1 pound tart, firm apples such as Granny Smiths (2 large or 3 medium)", "1 tablespoon lemon juice", "6 tablespoons all-purpose flour", "1 tablespoon granulated sugar", "1/4 teaspoon cinnamon", "1 teaspoon baking powder", "2 large eggs", "Butter (I used about 2 tablespoons)", "Rich plain yogurt, sour cream or crème fraîche for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound tart, firm apples such as Granny Smiths (2 large or 3 medium)<br/>\n1 tablespoon lemon juice<br/>\n6 tablespoons all-purpose flour<br/>\n1 tablespoon granulated sugar<br/>\n1/4 teaspoon cinnamon<br/>\n1 teaspoon baking powder<br/>\n2 large eggs<br/>\nButter (I used about 2 tablespoons)<br/>\nRich plain yogurt, sour cream or crème fraîche for serving</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 200 degrees and place a baking sheet inside. Peel and core apples and then grate them, either on the large holes of a box grater or in a food processor, on the shredding blade. (If you use the food processor, lay the apple chunks the long way if you want longer strands.) Transfer to a clean dishtowel or cheesecloth sling and wring out as much juice as you can into a small bowl. Set it aside if you wish to make a dessert sauce with it later.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer grated apple to a medium bowl and toss with lemon juice. In a small dish, whisk flour, sugar, cinnamon and baking powder and toss with the apples, coating them evenly. Whisk eggs in this small dish until lightly beaten and stir into apple-lemon-flour mixture.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast-iron skillet to medium with one tablespoon butter. Once it has coated the pan, drop tablespoons full of apple batter in little piles, gently pressing them a bit flatter with a spatula. Fry until they are nicely brown underneath, about 3 to 5 minutes, then flip and continue to cook until they are browned and crisp. Drain briefly on paper towels and transfer to preheated oven to keep warm. Add a pat of the remaining butter for each new batch in the pan, and repeat with remaining batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can keep apple latkes in the oven for up to an hour while you tend to more important things, like what you can do with that leftover apple juice, if the thought of it going to waste upsets you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Makeshift Apple Caramel Sauce</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Look, this isn’t the most apple-y apple caramel and it’s not the most refined recipe. I just kinda threw these things together, it made a caramel and I had the satisfaction of not having to throw away my freshly-wrung apple juice. Do apple latkes need caramel sauce? Nope, but don’t let that stop you.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Apple juice wrung from shredded apple (above) (I had 1/2 cup)<br/>\n3 tablespoons sugar<br/>\n1 tablespoon butter<br/>\n1/4 cup heavy cream<br/>\nPinch of flaky sea salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, simmer the apple juice until it is reduced by half. Add the sugar and continue to cook it until it becomes a golden brown/amber color. Add the butter and once it melts, the heavy cream and salt. Simmer for one minute and serve, with or without apple latkes.</p>"}], "link": "https://smittenkitchen.com/2010/11-apple-latkes"}