{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/01/tomato-sauce-with-butter-and-onion.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, budget, date night, italian, pantry, pasta, photo, savory sauces condiments, tomatoes, weeknight favorite", "name": "Tomato Sauce with Butter and Onions", "author": {"@type": "Organization", "name": "\nAdapted from Marcela Hazan’s Essentials of Italian Cooking"}, "description": "<p>Another thing that blew my mind about this sauce: I, for one, am a grated parmesan junkie. I not only sprinkle it over my bowl of pasta, I like to have additional nearby, to apply a fresh coat to the layers of pasta that follow. So you can imagine my shock to find that I liked this dish even more without the parmesan. The flavor of the sauce is so delicate, fresh and sweet that it needed nothing at all.</p>", "totalTime": "", "recipeYield": "Serves 4 as a main course; makes enough sauce to lightly coat most of a pound of spaghetti", "recipeIngredient": ["28 ounces (800 grams) whole peeled tomatoes from a can (San Marzano, if you can find them)*", "5 tablespoons (70 grams) unsalted butter", "1 medium-sized yellow onion, peeled and halved", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>28 ounces (800 grams) whole peeled tomatoes from a can (San Marzano, if you can find them)*<br/>\n5 tablespoons (70 grams) unsalted butter<br/>\n1 medium-sized yellow onion, peeled and halved<br/>\nSalt to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put the tomatoes, onion and butter in a heavy saucepan (it fit just right in a 3-quart) over medium heat. Bring the sauce to a simmer then lower the heat to keep the sauce at a slow, steady simmer for about 45 minutes, or until droplets of fat float free of the tomatoes. Stir occasionally, crushing the tomatoes against the side of the pot with a wooden spoon. Remove from heat, discard the onion, add salt to taste (you might find, as I did, that your tomatoes came salted and that you didn’t need to add more) and keep warm while you prepare your pasta.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with spaghetti, with or without grated parmesan cheese to pass.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I liked this enough to make us more the next day, but I only had a can of tomato puree. It also worked well, despite having slightly less texture. You will need a little less simmering time as the tomatoes are already broken down.</p>"}], "link": "https://smittenkitchen.com/2010/01-tomato-sauce-with-butter-and-onions"}