{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/02/cauliflower-and-caramelized-onion-tart.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cauliflower, freezer friendly, onion, photo, tart", "name": "Cauliflower and Caramelized Onion Tart", "author": {"@type": "Organization", "name": "\nAdapted from Bon Appetit, March 2007"}, "description": "<p>This tart is lush, luxe and lovely. Sure, we had it for a Thursday night dinner with the largest and hopefully most artery-clearing pile of salad greens, ever, but something about it seems even better suited for a Ladies Lunch, a brunch or a shower of some sort. I think it’s the truffles. Or the two types of cream. Or the three types of cheese. Or the 30-minute caramelized onions. But should you, would you on a Thursday night while watching 30 Rock and The Office grrWinterOlympics, it is somehow even more welcome, out of place in the best of ways.</p><p>I made a slew of changes, from long notes expounding on my innermost feelings about truffle oil (at the end, in case you were at the edge of your seat) to smaller adjustments (more oil for the roasted cauliflower, so it doesn’t stick, as mine always does with less; less parmesan; a homemade crust if you’re feeling it; and the insistence that black pepper is equally welcome as white in this dish; a couple adjusted cooking times) but found the recipe, at its base, to be a delight.</p>", "totalTime": "", "recipeYield": "Yields 8 servings", "recipeIngredient": ["1 small head of cauliflower (about 1 pound) or 1 pound of a larger head of cauliflower, cut into 1-inch flowerets (Romanesco cauliflower, especially orange or green, would be a pretty substitute)", "3 1/2 tablespoons olive oil", "1 tablespoon truffle oil or a few pinches of truffle salt (optional) (see Notes below)", "1 refrigerated pie crust or a homemade tart shell (recipe below)", "1 large onion, halved lenghtwise and thinly sliced", "1 tablespoon Dijon mustard", "2 large eggs", "1 (7- to 8- ounce) container mascarpone cheese (see Note below for suggested substitutions)", "1/2 cup whipping cream (although any low- or full-fat milk or light cream will work as well)", "1/4 teaspoon ground white or black pepper", "Pinch of ground nutmeg", "1 cup grated Gruyère cheese (Swiss or Comté are great swaps)", "1/3 cup Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 small head of cauliflower (about 1 pound) or 1 pound of a larger head of cauliflower, cut into 1-inch flowerets (Romanesco cauliflower, especially orange or green, would be a pretty substitute)<br/>\n3 1/2 tablespoons olive oil<br/>\n1 tablespoon truffle oil or a few pinches of truffle salt (optional) (see Notes below)<br/>\n1 refrigerated pie crust or a homemade tart shell (recipe below)<br/>\n1 large onion, halved lenghtwise and thinly sliced<br/>\n1 tablespoon Dijon mustard<br/>\n2 large eggs<br/>\n1 (7- to 8- ounce) container mascarpone cheese (see Note below for suggested substitutions)<br/>\n1/2 cup whipping cream (although any low- or full-fat milk or light cream will work as well)<br/>\n1/4 teaspoon ground white or black pepper<br/>\nPinch of ground nutmeg<br/>\n1 cup grated Gruyère cheese (Swiss or Comté are great swaps)<br/>\n1/3 cup Parmesan cheese</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Position rack in center of oven and preheat oven to 425°F. Toss cauliflower with 2 tablespoons olive oil in large bowl. Spread on rimmed baking sheet, sprinkle with salt and pepper and roast 15 minutes before turning florets over and roasting until brown and tender, another 15 minutes in my oven, 25 minutes according to the original recipe. Cool cauliflower then thinly slice (a direction I entirely missed when originally make this; I left my florets in chunks and enjoyed it that way) and drizzle with truffle oil or sprinkle with truffle salt, if using. (See notes below about these ingredients.) Reduce temperature to 350°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using store bought pie crust, press it onto the bottom and up the sides of a 9-inch diameter tart pan with removable bottom. Line crust with foil, fill with pie weights and bake 20 minutes. Remove foil and weights then bake until crust is golden, about 5 additionally minutes. Press crust back with the back of a fork if bubbles form. Cool crust and maintain oven temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[When using the homemade tart crust (recipe below), I do not find that it needs to be par-baked. It is thin and rather dry so it bakes up pretty crisp. Store bought pie doughs are a little bit softer, so the par-baking keeps it from getting soggy.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat remaining 1 1/2 tablespoon olive oil in a heavy large skillet over medium-low heat. Add onion, sprinkle with salt and pepper and cook until onion is a deep golden brown, stirring occasionally. This took me just shy of 30 minutes, though the original recipe suggests 40. Cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a knife or brush to spread the bottom and sides of crust with mustard. Spread onion over crust. Arrange cauliflower over the onion. Set the tart on a rimmed baking sheet (to protect against leaks). Whisk eggs, mascarpone, cream, pepper and nutmeg in a medium bowl. Stir in Gruyère. Pour mixture over filling in tart pan, sprinkle with Parmesan. Bake until tart is golden and center is set, about 40 minutes. Transfer to rack and cool 15 minutes before serving.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Onions can be caramelized, dough can be parbaked (or rolled and pressed into pan, if homemade) and cauliflower can be roasted a day ahead. Store a parbaked crust at room temperature, a rolled-out unbaked crust and cauliflower and onion in the fridge. Cauliflower and onion should be kept in separate containers. Whole tart can be made and baked a day in advance, reheated in a low oven before serving.</p>"}], "link": "https://smittenkitchen.com/2010/02-cauliflower-and-caramelized-onion-tart"}