{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/03/brigadeiros.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brazilian, candy, coconut, photo", "name": "Coconut Milk Fudge [Coconut Brigadeiros]", "author": {"@type": "Organization", "name": "\nAdapted quite a bit from The Brazilian Kitchen, via the New York Times"}, "description": "<p>A.k.a. Coconut Milk Caramels or Coconut Brigadeiros. Nervous about the gooey/sweet factor, I played around a little, using unsweetened coconut milk (the recipe didn’t specify, so I used what I thought would work) and then salted butter (honestly, by accident, but that pinch of salt really helped keep the treat on this side of treacly).</p><p>These candies are infinitely tweakable. Personally, I think they’d be fantastic with a pinch of cinnamon, Mexican or otherwise. My mother wanted to try them with a drop or two of almond extract. I think vanilla could work well in there, too. And you can roll them in the suggested toppings — coconut, pistachios and sprinkles — or use your own. Crushed cookie crumbs, anyone?</p><p>For classic, coconut-free brigadeiros, chocolate and other versions, check out recipe leads here.</p>", "totalTime": "", "recipeYield": "24 to 30 candies", "recipeIngredient": ["1 cup sweetened condensed milk", "1/2 cup unsweetened coconut milk", "2 tablespoons salted or unsalted butter (salted will give the candy more contrast)", "2 teaspoons light corn syrup", "1/3 cup finely shredded unsweetened coconut (I lightly toasted mine, for crunch)", "1/3 cup ground pistachios (see Note below)", "1/3 cup chocolate sprinkles or “vermicelli” (see Note below)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup sweetened condensed milk<br/>\n1/2 cup unsweetened coconut milk<br/>\n2 tablespoons salted or unsalted butter (salted will give the candy more contrast)<br/>\n2 teaspoons light corn syrup<br/>\n1/3 cup finely shredded unsweetened coconut (I lightly toasted mine, for crunch)<br/>\n1/3 cup ground pistachios (see Note below)<br/>\n1/3 cup chocolate sprinkles or “vermicelli” (see Note below)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium-size heavy saucepan, combine condensed milk, coconut milk, butter and corn syrup. Bring to a boil over medium heat. Reduce heat to low and whisk constantly until fudgy. The recipe notes that when mixture is ready, it will pull together into one soft piece, leaving browned residue on bottom of pan and that this should take 8 to 10 minutes. This took me 20 to 25 minutes, and the candy began taking on a beige, caramelized color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide mixture into a bowl. (Don’t scrape the pan; leave any residue behind.) Let cool to room temperature, then refrigerate until very firm, at least 4 hours. Or, you could realize that the nanny has to leave in an hour, chill it for only 30 and discover that nothing bad will happen if you don’t wait the whole cooling time. You’ll have to be more careful if you use “real” i.e. meltable chocolate sprinkles but otherwise it will have no ill-effect to speed the process up.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop out teaspoonfuls of the mixture (I used my one teaspoon measure) and use your hands to roll into balls, about 3/4-inch in diameter. I found having just a drop or two of water in my palms — not wet, just a little moist — helped form them. Set aside on a baking sheet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place toppings in wide bowls and roll brigadeiros through them, covering the surface completely.  Store in an airtight container at room temperature for 2 days, or refrigerate for up to 1 month. Serve at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Chocolate “vermicelli”:</b> I got a little freaked out when I saw the ingredient list on the chocolate sprinkles I had brought home from the store. Look, I don’t need to pretend that chocolate sprinkles are health food, but I like to imagine I’m eating something with at least a minute smidgen of chocolate in it. I ended up spending way too much on a bottle of <a href=\"http://www.flickr.com/photos/smitten/4415902066/\">“chocolate vermicelli”</a> (they look like chocolate sprinkles but are almost 100% pure chocolate, and delightfully, taste that way too) but I’d buy them next time from <a href=\"http://www.amazon.com/gp/product/B000VAPTE6?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000VAPTE6\">Amazon</a> or <a href=\"http://www.kingarthurflour.com/shop/items/guittard-bittersweet-chocolate-sprinkles-6-oz\">King Arthur Flour’s Baker’s Catalog</a> for much less.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Pistachios:</b> Since toasted nuts always, always taste better than raw ones, I toasted and ground a batch to coat the candy only to find <a href=\"http://www.flickr.com/photos/smitten/4415142481/in/photostream/\">the brown/green shade</a>… um, a little unpretty. Looks won out and I used ground raw pistachios in the end. I actually ended up preferring the softness of the coating.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Those tiny cups:</b> I know someone is going to ask me where I bought <a href=\"http://www.flickr.com/photos/smitten/4415148245/\">those colorful little candy cups</a> and I’m sorry, as my answer could not be more inconvenient: Vienna. A grocery store. I’m kind of obsessed with going to grocery stores in foreign countries and always walk out with random stuff like this. Anyway, Amazon sells #4 size cups (1-inch base) in <a href=\"http://www.amazon.com/gp/product/B000PVUY82?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000PVUY82\">brown</a> and <a href=\"http://www.amazon.com/gp/product/B000Z3622M?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000Z3622M\">white</a>; however, mine are actually #3 size (3/4 to 7/8-inch base) which I found online <a href=\"http://www.sugarcraft.com/catalog/candies/candycups.htm#3\">at a smaller store</a>.</p>"}], "link": "https://smittenkitchen.com/2010/03-coconut-milk-fudge"}