{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grape-focaccia-with-rosemary1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, grapes, party snacks, photo, picnics, snack, summer", "name": "Grape Focaccia with Rosemary", "author": {"@type": "Organization", "name": "\nAdapted from Claudia Fleming’s Last Course"}, "description": "<p>To seed your Concord grapes, I recommend re-sharpening your sharpest paring knife, halving them and then using the tip of the knife to excavate the seed or seeds. They make a lovely (albeit teeth- and fingernail-staining) snack while you work, so make sure you buy extra.</p><p>P.S. If you want to buy a copy of this utterly fantastic dessert cookbook, one of my favorites, I recommend calling the North Fork Table & Inn, where Fleming now spends her days and asking if you can buy one from their supply. I bought mine there a couple years ago, and they only charge the cover price, unlike many resellers.</p>", "totalTime": "", "recipeYield": "As I mention above, I tweaked this recipe a lot. I have streamlined several steps, swapped butter with oil (because I’m nuts about the olive oil/sea salt/rosemary combination), used less than she suggested (which, trust me, will not leave this focaccia lacking), swapped powdered milk for a smaller amount of fresh, increased the flour so that the dough is only moderately and not “so sticky that someone who has baked hundreds of breads in her life is going out of her mind” (ahem). What stays, however, is bliss: a gorgeous focaccia that’s begging to served with wine and cheese, preferably on a deck. Do that for me, will ya?", "recipeIngredient": ["3/4 cup (177 ml) warm water  (105° to 110°F)", "2 tablespoons (30 ml) milk, slightly warmed", "1 1/2 teaspoons (6 grams) sugar", "1 1/4 teaspoons (5 grams) active dry yeast", "2 cups (250 grams) all-purpose flour", "1/2 teaspoon (3 grams) salt", "6 tablespoons (90 ml) olive oil", "1 1/2 cups halved Concord, red or black grapes, seeded", "1 teaspoon fresh rosemary needles", "2 tablespoons (8 grams) raw or another coarse sugar", "2 teaspoons coarse sea salt (heads up: some are finding this too salty; if you’re worried, use less)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3/4 cup (177 ml) warm water  (105° to 110°F)<br/>\n2 tablespoons (30 ml) milk, slightly warmed<br/>\n1 1/2 teaspoons (6 grams) sugar<br/>\n1 1/4 teaspoons (5 grams) active dry yeast<br/>\n2 cups (250 grams) all-purpose flour<br/>\n1/2 teaspoon (3 grams) salt<br/>\n6 tablespoons (90 ml) olive oil<br/>\n1 1/2 cups halved Concord, red or black grapes, seeded<br/>\n1 teaspoon fresh rosemary needles<br/>\n2 tablespoons (8 grams) raw or another coarse sugar<br/>\n2 teaspoons coarse sea salt (heads up: some are finding this too salty; if you’re worried, use less)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bowl of an electric mixer fitted with the paddle attachment, stir together the water, milk, sugar, and yeast. Let the mixture sit until foamy, about 10 minutes. Add the flour, salt and 2 tablespoons of the olive oil to the yeast mixture and mix well on low. Attach the dough hook, raise the speed to medium-low and knead the dough for 8 minutes longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[And yes, you can stir this together entirely by hand with a wooden spoon, then smash it around on a floured counter to “knead” it for a bit. It’ll be sticky, but doable, and of course you’ll get to say you made bread “old school” style.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush a large bowl with a generous amount of olive oil. Scrape dough into the bowl and brush the top with additional oil. Cover with plastic wrap and let it rise in a cool place until it doubles in bulk, 1 1/2 to 2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Press the dough down with a floured hand. Turn the dough out onto a floured surface and divide it into two balls. Brush a large baking sheet (or two small ones) with olive oil, place the balls of dough on it and brush the top with more oil. Set it aside for 20 minutes, lightly covered with a kitchen towel. After 20 minutes, dip your fingers in olive oil and press and stretch each ball of dough into a 8 to 9-inch circle-ish shape. It will be dimpled from your fingers. Cover again with the towel and let it rise for another 1 1/4 hours in a cool place.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 450°F. Brush tops of dough with remaining olive oil and top the sprinkle grapes, rosemary, coarse sugar and coarse sea salt evenly over the dough. Bake for 15 minutes, until the crust is golden brown and puffed around edges. Let cool before serving. Serve warm or at room temperature. Try not to eat the whole thing like, uh, <i>some people</i> we might know.</p>"}], "link": "https://smittenkitchen.com/2010/09-grape-focaccia-with-rosemary"}