{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/05/spring-asparagus-pancetta-hash.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, asparagus, breakfast, brunch, eggs, photo, pork meat, potatoes, put an egg on it, spring, weeknight favorite", "name": "Spring Asparagus Pancetta Hash", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I know I say this a lot, but this is indeed a flexible recipe. The core idea is a one-pan hash that is lighter than the expected versions and full of texture; whether you get to this place with yellow potatoes or Russets, slab bacon or pancetta, asparagus or something else that struck your fancy at the market that week doesn’t much matter. You don’t even need to put an egg on it, if you’re more in a broiled salmon or grilled cutlets kind of place tonight. But it’s not half bad just the way it is, and I suspect this is going to become a weekend morning staple. And yes, that’s my husband you hear cheering in the background; he gets that way around cured pork products.</p>", "totalTime": "", "recipeYield": "Makes enough to top with four fried eggs", "recipeIngredient": ["1/4 pound pancetta (a cured pork that is less salty than proscuitto, and not smoked like bacon), cut into 1/4-inch dice", "1 pound Yukon gold potatoes, peeled and cut into a 1/2-inch dice", "1 small yellow onion, chopped small", "1/2 pound asparagus, tough ends trimmed and cut into 1-inch segments", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/4 pound pancetta (a cured pork that is less salty than proscuitto, and not smoked like bacon), cut into 1/4-inch dice<br/>\n1 pound Yukon gold potatoes, peeled and cut into a 1/2-inch dice<br/>\n1 small yellow onion, chopped small<br/>\n1/2 pound asparagus, tough ends trimmed and cut into 1-inch segments<br/>\nSalt and pepper to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serving ideas: Fried eggs, dabs of goat cheese and slivers of green onions</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a 12-inch cast iron frying pan over medium heat. Fry the pancetta, turning it frequently so that it browns and crisps on all sides; this takes about 10 minutes. Remove it with a slotted spoon and drain it on paper towels. Leave the heat on and the renderings in the pan. (With a well-seasoned cast iron, this should be all the fat you need to cook the remainder of the hash. If you’re not using a cast iron, you might need to add a tablespoon or so of oil; if you’ve skipped the pork, you’ll want to start with 2 tablespoons oil.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the potatoes don’t move them for a couple minutes. Use this time to season them well with salt and pepper. Once they’ve gotten a little brown underneath, begin flipping and turning them, then letting them cook again for a few minutes. The idea is not to fight them off the frying pan, once they’ve gotten a little color, it’s easier to flip them and you’ve gotten closer to your goal of getting them evenly browned. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the potatoes are about three-fourths as crisped and brown as you’d like them — this takes about 15 minutes — add the onion. (I add this now, not earlier, because I find it often burns before the potatoes are done.) Cook for an additional 5 minutes. Add the asparagus, cover the pan and cook for 5 to 8 minutes, or until crisply cooked. (Skinny asparagus will take just 5 minutes; thicker asparagus will take longer.) Remove the lid, return the pancetta to the pan for another minute, to reheat. Taste for seasoning and adjust if needed. Serve immediately. </p>"}], "link": "https://smittenkitchen.com/2010/05-spring-asparagus-pancetta-hash"}