{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/06/root-beer-float-cupcakes.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, photo", "name": "Root Beer Float Cupcakes", "author": {"@type": "Organization", "name": "\nCake adapted from Baked: New Frontiers in Baking"}, "description": "<p>A root beer float is a tall glass of root beer with a scoop of vanilla ice cream inside. I tried to turn this into a cupcake a few ways, first with a plain whipped cream frosting (hoping the cream could stand in for ice cream) and then with both whipped cream and a tiny, nested scoop of ice cream. Both are delicious. Neither are particularly portable. The whipped cream is good for two hours at room temperature but the ice cream, only a few minutes. If you’re bringing them somewhere else, I suggest bringing the ice cream and/or whipped cream separately and assembling them on the spot; get others involved, I am sure it could be fun. You could also swap out both toppings for a more traditional, stable frosting such as a Quick Buttercream or a Seven Minute Frosting (my vote, because it tastes like marshmallows). </p><p>I also want to note that while the root beer flavor is present in the cakes, it’s not the loudest root beer flavor (unsurprising as most root beers today are pretty subtle). One way to make it more pronounced, as suggested in Baked, is to swap out half a cup of root beer for root beer schnapps, which looks like it is available from  a few places online. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["RECIPE_SUBHED__1<u>Cupcakes</u>", "2 cups root beer (I used ", "<a href=\"http://www.boylanbottling.com/\">Boylan</a>", " because it was easy to find and made with cane sugar)", "1 cup dark unsweetened cocoa powder", "1/2 cup (1 stick or 4 ounces) unsalted butter, cut into 1-inch pieces", "1 1/4 cups granulated sugar", "1/2 cup firmly packed dark brown sugar", "2 cups all-purpose flour", "1 1/4 teaspoons baking soda", "1 teaspoon salt", "2 large eggs", "RECIPE_SUBHED__2<u>Toppings</u>", "1 1/2 cups heavy or whipping cream", "3 tablespoons powdered sugar", "1/2 teaspoon vanilla extract", "Pint of vanilla ice cream (you’ll have leftover; you’re welcome)", "Maraschino cherries (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Toppings</u><br/>\n1 1/2 cups heavy or whipping cream<br/>\n3 tablespoons powdered sugar<br/>\n1/2 teaspoon vanilla extract<br/>\nPint of vanilla ice cream (you’ll have leftover; you’re welcome)<br/>\nMaraschino cherries (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the root beer cupcakes:</u> Preheat oven to 350°F. Line 22 cupcake cups with paper liners. In a small saucepan, heat the root beer, cocoa powder and butter over medium heat until the butter is melted. Add the sugars and whisk until dissolved. Remove from heat and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk flour, baking soda, and salt together. In a small bowl, whisk the eggs until just beaten then whisk them into the cooled cocoa mixture until combined. Fold the liquid and flour mixtures together in the large bowl. The batter will be slightly lumpy; this is okay. If you overbeat it, it will get tough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill cupcake liners about 2/3 to 3/4 full (a 1/4 cup scoop or measuring cup will filled mine perfectly) and bake cupcakes, rotating trays back to front and top to bottom halfway through, until a tester inserted into the center of each comes out clean, about 17 minutes. Transfer pan to a wire rack to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble cupcakes:</u> Whip heavy or whipping cream with powdered sugar and vanilla until it holds soft peaks. You can do this with an electric mixer, but if you do it by hand, not only will you get a killer arm workout (which you can trade in for a cupcake, very soon), it will be nearly impossible to overbeat the cream. (Which I almost always do with a mixer.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use the tip of a knife to cut a small cone of cake out of the top center of each cupcake; feel free to snack on these, I won’t tell anyone. Using a spoon or a small cookie scoop, nest a scoop of ice cream in each indent. Surround ice cream with dollops of whipped cream. Top with a cherry, if using. To keep cupcakes in a holding pattern while you assemble the remaining ones, you can put them in the freezer, but try to do so for no more than 5 minutes or the whipped cream will harden. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>More excessive detail:</b> The brown paper cupcake liners are from New York Cake and Baking Supply on 22nd Street. They’re also available from many stores online (please <a href=\"http://www.google.com/#hl=en&amp;source=hp&amp;q=brown+paper+cupcake+liners&amp;aq=f&amp;aqi=g1&amp;aql=&amp;oq=&amp;gs_rfai=ClK7ifSoFTLOGI57-zQTCwGEAAACqBAVP0O3nmw&amp;fp=1a3caa30e0a876cf\">do a simple search</a>; I would prefer that the comment section is not filled with links to suppliers). I used a medium round piping tip to make the whipped cream dollops (the size escapes me) but a plastic bag with the corner snipped off will do almost the same job. I used a <a href=\"http://www.amazon.com/gp/product/B00004UE85?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00004UE85\">#70 scoop</a> for the ice cream (about 1 tablespoon) but your 1 tablespoon measuring spoon would do about the same.</p>"}], "link": "https://smittenkitchen.com/2010/06-root-beer-float-cupcakes"}