{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/12/iced-oatmeal-cookies.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, photo", "name": "Iced Oatmeal Cookies", "author": {"@type": "Organization", "name": "\nAdapted from Good to the Grain"}, "description": "<p>Unlike most cookies, where spreading is a cause for concern, here, it is encouraged as it leads to a thinner, lacier cookie. (More or less, you want to do the opposite of everything suggested here.) Because the condition of my baking sheets is reprehensible, I lined mine with parchment paper instead of buttering them, but unfortunately, this impeded the spreading a little. I’m sure you all have unblemished and lovely baking sheets, and therefore are encouraged to butter them, as the recipe suggests.</p><p>Aside from playing around with the flours, my other changes were to streamline the oat measurement to include the oats you can use to make oat flour. I added weights as well, but don’t use them for the alternatively suggested flours, as they may weight more or less.</p>", "totalTime": "", "recipeYield": "30 3-inch cookies (with a 2 tablespoon or #40 scoop), larger if your spread more", "recipeIngredient": ["Butter for baking sheets", "2 1/2 cups + 1 tablespoon (8 1/4 ounces or 231 grams) old fashioned oats", "1/2 cup (2 1/4 ounces or 65 grams) whole wheat flour", "1 cup (4 3/8 ounces or 125 grams) all-purpose flour*", "1 tablespoon plus 1 teaspoons (20 grams) baking powder", "1 teaspoon (5 grams) baking soda", "2 teaspoons kosher salt**", "1 cup (8 3/8 ounces or 238 grams) dark brown sugar", "1/2 cup (3 1/2 ounces or 100 grams) granulated sugar", "1 teaspoon (2 grams) cinnamon", "1 teaspoon (2 grams) freshly grated nutmeg (I used less, because I was nutmeg-wary, but wouldn’t have minded more)", "8 ounces (2 sticks) unsalted butter, melted", "2 large eggs", "RECIPE_SUBHED__1<u>Icing:</u>", "2 1/4 (9 1/2 ounces or 270 grams) cups powdered sugar", "5 to 6 (75 to 90 ml) tablespoons whole milk", "1 tablespoon (6 grams) cinnamon", "1/4 teaspoon kosher salt**"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Icing:</u><br/>\n2 1/4 (9 1/2 ounces or 270 grams) cups powdered sugar<br/>\n5 to 6 (75 to 90 ml) tablespoons whole milk<br/>\n1 tablespoon (6 grams) cinnamon<br/>\n1/4 teaspoon kosher salt**</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F with racks in the upper and lower thirds of the oven. Rub two baking sheets with butter. In a food processor, grind 1/2 cup of oats to a fine powder, then add remaining oats and grind them all together until it resembles coarse meal, with only a few large flakes remaining.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift dry ingredients into a large bowl, pouring back any bits of grains or other ingredients that remain in the sifter. In a small bowl, whisk butter and eggs until combined. Using a spatula, fold the wet ingredients into the dry ingredients.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop balls of dough about 2 to 3 tablespoons in size (I used a #40 cookie scoop, which scooped 2 tablespoon-sized balls) onto cookie sheets about 3 inches apart. Bake for 16 to 20 minutes, rotating the sheets halfway through. When tops are evenly brown, take them out and transfer them to a cooling rack. Repeat with remaining cookie dough. Let cookies cool completely before icing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a bowl, whisk icing ingredients together until smooth. It should have a honey-like consistency.  Drizzle the frosting over the cookies. Let the frosting set for 30 minutes (or more; it took longer at my place but by the next day, was fully firmed up) before eating. The cookies can be stored in an airtight container for up to a week.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* The original recipe replaced this volume with a multigrain flour mix that worked out to 1/2 cup barley flour + 1/4 cup millet flour + 1/4 cup rye flour. If you have any of these flours, swap them in and reduce the volume of all-purpose.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>** Saltiness of kosher salt <a href=\"https://smittenkitchen.com/tips/not-all-salts-are-created-equally/\">varies by brand</a>. I’d recommend 2 teaspoons if you use Diamond kosher salt, and about half as much if you use Morton kosher salt or another brand.</p>"}], "link": "https://smittenkitchen.com/2010/12-iced-oatmeal-cookies"}