{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/easy-jam-tart1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, tarts pies", "name": "Easy Jam Tart", "author": {"@type": "Organization", "name": "\nAdapted from Ready for Dessert"}, "description": "<p>Of course, I couldn’t resist tinkering with the recipe a little. I made the dough in the food processor, because I already had it down and the Kitchen Aid seemed impossibly far away (on top of the fridge). I used the egg white leftover from the crust to make a shiny glaze for the tart. I used less jam than I was supposed to, because I ran out and was too lazy to get more and too apprehensive to mix jams; I liked this lesser amount in the end. Because my tart stuck to the pan just a little, I’m suggesting that you butter your tart mold. Finally, I approached the top crust differently than suggested.  Rather than using thicker “coins” of dough, I cut them super-thin and overlapped them to create a pretty lid. Because pretty counts. I am sure Mr. Lebovitz will approve.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 1/2 cups (210 grams) all-purpose flour", "1/2 cup (70 grams) stone-ground cornmeal or polenta", "2 teaspoons baking powder", "1/2 teaspoon salt", "9 tablespoons (4 1/2 ounces or 130 grams) unsalted butter, at room temperature", "1/2 cup (100 grams) granulated sugar", "1 large egg, whole", "1 large egg, separated", "1/8 teaspoon almond extract", "1 1/3 to 1 3/4 cups (450 grams) jam (see Note above; I used the smaller amount) or marmalade", "2 tablespoons (30 grams) coarse-crystal or granulated sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 cups (210 grams) all-purpose flour<br/>\n1/2 cup (70 grams) stone-ground cornmeal or polenta<br/>\n2 teaspoons baking powder<br/>\n1/2 teaspoon salt<br/>\n9 tablespoons (4 1/2 ounces or 130 grams) unsalted butter, at room temperature<br/>\n1/2 cup (100 grams) granulated sugar<br/>\n1 large egg, whole<br/>\n1 large egg, separated<br/>\n1/8 teaspoon almond extract<br/>\n1 1/3 to 1 3/4 cups (450 grams) jam (see Note above; I used the smaller amount) or marmalade<br/>\n2 tablespoons (30 grams) coarse-crystal or granulated sugar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small bowl, whisk together the flour, cornmeal, baking powder and salt. In a stand mixer with the paddle attachment or in a food processor, mix the butter and 1/2 cup (100 grams) sugar together until smooth. Add the egg, egg yolk (keep the egg white from the second egg on hand for later) and almond extract and beat until combined. Gradually add the flour mixture and mix until the dough just comes together.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer about one-third of the dough to a lightly floured counter and shape it into a log about 2 inches (5 cm) in diameter. Wrap it in plastic wrap and refrigerate it until needed. (As always, I was in a rush and put this in the freezer.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the remaining dough to a buttered 9-inch (23-cm) tart pan with a removable bottom of a 9-inch (23-cm) springform pan. Using your hands, press the dough evenly into the bottom. If using a tart pan, press the dough up the sides to the rim of the pan and set the tart pan on a baking sheet. If using a springform pan, press the dough about 3/4-inch (2-cm) up the sides of the pan. Refrigerate the dough-lined pan until firm, at least one hour. (Again, I used the freezer and it was firm in 30 minutes. I am impatient.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat the oven to 375°F (190°C). Spread the jam or marmalade evenly over the dough in the pan. Cut the chilled dough into very thin discs with a sharp paring knife. Arrange them slightly overlapped in concentric circles over the jam to form a top crust. Whisk the remaining egg white with a teaspoon of water until frothy; brush evenly over the tart lid and then sprinkle with 2 tablespoons (30 grams) coarse sugar. Bake until the top crust is golden brown, about 25 minutes. Let cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> This tart keeps beautifully for up to 3 days if well-wrapped at room temperature. David says that it’s pretty sturdy, so perfect to take along on a picnic.</p>"}], "link": "https://smittenkitchen.com/2010/04-easy-jam-tart"}