{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/11/sweet-potatoes-with-pecans-and-goat-cheese.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, potatoes, salad, side dish, thanksgiving, vegetarian", "name": "Sweet Potatoes with Pecans, Goat Cheese and Celery", "author": {"@type": "Organization", "name": " [a.k.a. Roasted Marshmallow-y Sweet Potatoes with Thanksgiving on Top]"}, "description": "<p>I roast vegetables a little oddly these days. I used to do it the “normal” way, tossing them with oil and then laying them out on a sheet but I always needed more and more oil and the pieces still stuck. Once I started generously oiling the pan, my vegetables started browning really well and didn’t get weighed down — most of the oil stays on the roasting pan.</p><p>Wary of celery? Swap all or half with chopped radishes. Don’t like goat cheese? Try ricotta salata or even blue cheese instead. Firmly believe that everything is improved by bacon? Crumble some in there, or use browned bits of pancetta. Don’t like sweet potatoes? Skip them and added diced leftover turkey to the “salad”, with additional vinaigrette or just mayo.</p>", "totalTime": "", "recipeYield": "Serves 2 1/2", "recipeIngredient": ["1 1/2 pounds sweet potato, scrubbed, unpeeled, in 3/4- to 1-inch coins", "4 tablespoons olive oil, divided", "1/4 cup toasted and cooled pecan halves", "2 tiny or 1 small shallot", "2 stalks celery", "2 tablespoons flat-leaf parsley", "1 tablespoon dried cranberries or cherries (optional)", "2 ounces firmish goat cheese", "Salt and freshly ground black pepper", "2 teaspoons red wine vinegar", "1/2 teaspoon smooth Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 pounds sweet potato, scrubbed, unpeeled, in 3/4- to 1-inch coins<br/>\n4 tablespoons olive oil, divided<br/>\n1/4 cup toasted and cooled pecan halves<br/>\n2 tiny or 1 small shallot<br/>\n2 stalks celery<br/>\n2 tablespoons flat-leaf parsley<br/>\n1 tablespoon dried cranberries or cherries (optional)<br/>\n2 ounces firmish goat cheese<br/>\nSalt and freshly ground black pepper<br/>\n2 teaspoons red wine vinegar<br/>\n1/2 teaspoon smooth Dijon mustard</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450 degrees. Coat a large baking sheet generously with olive oil, about 1 to 2 tablespoons. Lay sweet potatoes in one layer on the oiled sheet. Sprinkle with salt and freshly ground black pepper. Roast, without disturbing, for 15 to 20 minutes. Carefully flip each piece: the undersides should be blistery, dark and a bit puffy and should release from the pan with no effort. If they’re not, let it cook longer. Sprinkle them with additional salt and freshly ground black pepper and return the pan to the oven for another 10 minutes or so, until the undersides match the tops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare your salad. Chop your pecans well, mince your shallot, chop your celery and parsley, mince cranberries if using them. Crumble your goat cheese. If you, like me, got too soft of a goat cheese for mixing, set it aside and sprinkle it on top. If it’s firmer, stir it into the mixture. In a small dish, whisk together 2 tablespoons olive oil, 2 teaspoons red wine vinegar and 1/2 teaspoon dijon. Pour half over salad.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When the sweet potatoes are done, set a couple coins aside just in case the baby isn’t into the toppings. Lay the rest on a serving platter. Scoop a spoonful of the salsa over each round. Pour remaining salad dressing over top, to taste. Eat immediately.</p>"}], "link": "https://smittenkitchen.com/2010/11-sweet-potatoes-with-pecans-and-goat-cheese"}