{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/10/cauliflower-parmesan-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cauliflower, eggs, fall, vegetarian", "name": "One year ago:", "author": {"@type": "Organization", "name": " Apple Cider Doughnuts\nTwo years ago: Molly’s Apple Tarte Tatin and Cranberry Walnut Chicken Salad\nThree years ago: Pumpkin Bread Pudding\nFour years ago: Winter Squash Soup with Gruyere Croutons"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["<b>Cauliflower and Parmesan Cake</b>", "Adapted, only a little, from Yotam Ottolenghi"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Cauliflower and Parmesan Cake</b><br/>\nAdapted, only a little, from Yotam Ottolenghi</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ottolenghi suggests serving this “cake” (think: sturdy baked omelet) as a light dinner with a “makeshift salad of sliced cucumber, dill, mint, a little sugar, cider vinegar and grapeseed oil”. I say make a salad with whatever you’ve got on hand; I was messing around with brussels sprouts and green beans yesterday, so that’s what I made a salad from.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>My main changes were to change the weights in the recipe into “American” with cup measurements where I could. He calls for 100 grams of olive oil, which works out to about half a cup, which seemed like a lot to me. I used a generous quarter-cup in the end. Should you use the whole amount, I am sure your cake will just be that much more moist. I also balked at using nearly half a pound of Parmesan (he calls for 220 grams, which is about 2 1/4 cup grated), and used about a quarter instead (1 heaped cup, grated). I might have enjoyed a stronger Parmesan presence so will be less stingy with the good stuff next time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ottolenghi says serves 4 to 6, I’d say 6 to 8</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 medium cauliflower (1 1/2 pounds, 23 to 24 ounces or 650 to 700grams)<br/>\n1 large red onion, peeled<br/>\n7 1/2 tablespoons (100 grams or 3.5 ounces) olive oil (I used 5 tablespoons, see Note up top)<br/>\n1/2 teaspoon finely chopped rosemary<br/>\n10 medium or 8 large eggs<br/>\nHandful (3/4 ounce or 20 grams) basil, chopped<br/>\nScant 1 1/2 cups (180 grams or 6.3 ounces) all-purpose flour<br/>\n2 1/2 teaspoons baking powder<br/>\n1/2 teaspoon ground turmeric<br/>\n2 cups finely grated parmesan cheese (200 grams or 7 3/4 ounces, see Note up top) or about 1 generous cup of grated Romano cheese<br/>\nSalt and black pepper<br/>\nButter, for greasing pan<br/>\n2 tablespoons black sesame seeds</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F (180°C) degrees. Break cauliflower into medium florets (this will cause less mess than chopping it). Place floret in a pot with a teaspoon of salt, cover them with water and simmer for 15 to 20 minutes, until quite soft. Strain and let drip in the colander for a few minutes so they dry and cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, prepare the batter. Halve your red onion and cut a few thin rings off the end of one side; set them aside. Coarsely chop the remainder of your onion. Heat all of your olive oil in a saucepan (I won’t tell if you use the one where you cooked your cauliflower) and saute the chopped red onion and rosemary together until soft, about 8 minutes. Remove from heat and allow to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk eggs and olive oil and onion mixture together. Stir in basil. Whisk flour, baking powder, turmeric, cheese, 1 1/2 teaspoons salt (use 1 teaspoon if you are nervous about this amount) and many, many grinds of black pepper together in a separate bowl and add to egg mixture, whisking to remove lumps. Stir in cauliflower gently, so most pieces remain intact.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line the bottom of a 9-inch (24cm) round springform pan with parchment paper. Butter the sides generously. Put the sesame seeds in the pan and toss them around so that they stick to the sides. Pour in the cauliflower batter, arrange the reserved onion rings on top and bake cake in the center of the oven for 45 minutes, until golden brown and set.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm or at room temperature. Before you serve the cake, be sure to run a knife around the pan. This was probably the first time in my life I forgot, and several parts of the seed-crusted sides tore off!</p>"}], "link": "https://smittenkitchen.com/2010/10-cauliflower-and-parmesan-cake"}