{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2010/05/4642234776_22d0c3bbb2_o.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brown butter, crumbles crisps, photo, strawberries, tarts pies", "name": "Strawberry Brown Butter Bettys", "author": {"@type": "Organization", "name": "\nAdapted generously from Gourmet"}, "description": "", "totalTime": "", "recipeYield": "Makes 6 muffin-sized desserts", "recipeIngredient": ["3/4 stick salted or unsalted butter", "1 teaspoon granulated sugar", "6 slices white sandwich bread, crusts removed", "1/4 cup packed dark brown sugar**", "1/2 teaspoon lemon zest, finely grated", "1/8 teaspoon salt (omit if using salted butter)", "1/2 cup panko (Japanese bread crumbs, or make your own, below*)", "1 1/2 to 2 cups strawberries, stemmed and sliced (I forgot to jot down the weight, but it was less than a half pound of whole berries)", "Softly whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3/4 stick salted or unsalted butter<br/>\n1 teaspoon granulated sugar<br/>\n6 slices white sandwich bread, crusts removed<br/>\n1/4 cup packed dark brown sugar**<br/>\n1/2 teaspoon lemon zest, finely grated<br/>\n1/8 teaspoon salt (omit if using salted butter)<br/>\n1/2 cup panko (Japanese bread crumbs, or make your own, below*)<br/>\n1 1/2 to 2 cups strawberries, stemmed and sliced (I forgot to jot down the weight, but it was less than a half pound of whole berries)<br/>\nSoftly whipped cream, for serving</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F with rack in middle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small pot, melt butter over medium heat. Once melted, reduce heat to medium-low. The butter will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is less than a minute. Remove from heat.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Lightly butter muffin cups with some of brown butter, then sprinkle with granulated sugar. Roll bread slices with a rolling pin to flatten. Brush both sides with additional brown butter, then gently fit into muffin cups.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together brown sugar, zest, salt and panko, then add strawberries and toss to coat. Stir in remaining brown butter. Heap strawberry mixture into cups, pressing gently.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover pan with foil and bake 15 minutes. Uncover and bake until strawberries are very tender, about 10 minutes more. Let stand 5 minutes before removing from pan. Serve warm or at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>* Make your own panko:</b> Sure, it’s not exactly the same thing but I’m convinced that you can make very panko-like crumbs if you do the following — Preheat oven to 350 degrees. Tear one to two slices of soft, crustless white bread into 1-inch pieces and pulse them in the food processor until coarsely ground. This will make a generous half cup. Transfer crumbs to a rimmed baking sheet and bake until golden brown and dry, about 15 minutes, stirring occasionally. Cool. Use.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>**Sweetness:</b> [Updated 5/28/10] I “tested” this recipe with local, early-season not overly sweet strawberries. However, the ones you have may be sweeter. If you think your strawberries are on the sweeter side, you might want to dial the brown sugar back by one or even two tablespoons (the two tablespoon level, especially, if you like barely-sweet desserts). Hope that helps!</p>"}], "link": "https://smittenkitchen.com/2010/05-strawberry-brown-butter-bettys"}