{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/almond-macaroon-torte-with-chocolate-frosting1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, gluten free, passover, photo, travel", "name": "Almond Macaroon Torte with Chocolate Frosting", "author": {"@type": "Organization", "name": "\nAdapted heavily from Bon Appetit"}, "description": "<p>I’ve made a tremendous amount of changes to this recipe — adjusted cooking times, added weights, added dozens of tips, rewrote just about everything, etc. — and this is a good thing as the one I started with was exasperating. And that’s putting it mildly. But the core of the recipe — what I ended up with after a lot of tweaks and what I believe it is meant to be — is delightful, both an elegant, showy torte and a candy bar that I cannot wait to get a taste of in T-minus 7… 6… 5 hours… Not that I’m tapping my feet or anything.</p><p>Update: We loved it. It was a huge, huge hit, although not precisely Kit-Kat-ish. The layers (as the ingredient list gave away to some commenters) are almost exactly like those trendy macaron, which is to say crisp but soft and slightly chewy. The chocolate remained firm. It was easy to slice cleanly with an unfancy knife and I’ll definitely be making this again.</p>", "totalTime": "", "recipeYield": "Serves 12", "recipeIngredient": ["RECIPE_SUBHED__1<u>Almond macaroons</u>", "Nonstick vegetable oil spray", "2 1/2 cups (10.5 ounces or 300 grams) slivered almonds (or an equivalent weight of blanched, sliced or already ground almonds)", "1 cup (196 grams) plus 3 tablespoons (37 grams) sugar", "2 large pinches kosher salt", "2 teaspoons vanilla extract or 1 vanilla bean, split lengthwise", "6 large egg whites", "RECIPE_SUBHED__2<u>Frosting and assembly</u>", "1/2 cup water", "1/2 cup sugar", "Flavoring of your choice, such as 1/2 teaspoon orange oil or extract, 1/2 teaspoon vanilla, almond or other extract", "20 ounces semi-sweet chocolate (61% or less is recommended, I think it would also be great with 72%, a nice bitter contrast to the sweet macaroons), chopped or chocolate chips", "1 cup sliced almonds, toasted (at 350 degrees for 7 to 9 minutes on a tray, stirring once or twice)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Frosting and assembly</u><br/>\n1/2 cup water<br/>\n1/2 cup sugar<br/>\nFlavoring of your choice, such as 1/2 teaspoon orange oil or extract, 1/2 teaspoon vanilla, almond or other extract<br/>\n20 ounces semi-sweet chocolate (61% or less is recommended, I think it would also be great with 72%, a nice bitter contrast to the sweet macaroons), chopped or chocolate chips<br/>\n1 cup sliced almonds, toasted (at 350 degrees for 7 to 9 minutes on a tray, stirring once or twice)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make macaroons:</u> Position an oven rack in the top and lower third of oven and preheat oven to 325°F. Draw two 12 x 4-inch rectangles, spacing 2 inches apart [see Note below for my tiny kitchen adjustments] on a piece of parchment paper, then two more of the same size on a second sheet. In total, you’ll use 2 sheets of parchment paper and draw 4 rectangles. Turn each sheet of parchment over (so your ink or pencil lines don’t seep into the macaroon) and spray with nonstick spray [but first see Note below about the necessity of this] .</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place almonds, 1 cup sugar and coarse salt in a food processor (you can skip the food processor, however, if you use an equivalent weight of almond meal or ground almonds, just mixing the ingredients in a bowl) with vanilla bean seeds, if using (you’ll add liquid extract in a bit) and blend until finely ground.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using electric mixer, beat egg whites in large, dry bowl with clean beaters (or a whisk attachment) until soft peaks form. Drizzle in vanilla extract (if using), then slowly add remaining 3 tablespoons sugar. Beat until stiff but not dry. Fold nut mixture into egg whites. Spread 1/4 of macaroon batter evenly within each rectangle, filling completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake macaroon layers until golden and almost firm to the touch in the center, reversing sheets halfway through — this took a total of 23 measly minutes in my oven; the original recipe says it can take up to 40. I would check in on yours at 23 minutes and then every 5 minutes thereafter if they’re not done yet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool macaroons on their sheets on a cooling rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make frosting:</u> Simmer 1/2 cup of water and sugar in a medium saucepan until sugar dissolves. Measure 10 tablespoons from this and either discard the rest of save it for another use. Put the 10 tablespoons syrup back in the saucepan and add flavoring of your choice. Bring the syrup back to a boil and add chocolate to the saucepan. Remove from heat and let sit for one minute, then stir the chocolate until smooth. This should yield a medium-thick frosting, good for spreading. If yours is on the thin side, you can let it cool for 5 or 10 minutes until it is a good spreading consistency.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble torte</u> If needed due to spreading, carefully trim your macaroon layers back to their intended rectangular sizes — for me, a sharp knife lightly coated with oil worked best for this.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place one macaroon layer on a long platter. (If you’re a follower of my <a href=\"https://smittenkitchen.com/2009/03/layer-cake-tips-the-biggest-birthday-cake-yet/\">layer cake tips</a>, you’ll already know that slipping little pieces of parchment or waxed paper under the edges will help keep your platter clean; you pull them out when you’re done frosting the torte.) Spread 1/2 cup frosting evenly over. Top with another macaroon layer. Spread 1/2 cup frosting evenly over. Repeat 1 more time then top with last macaroon layer, flat side up (whoops, didn’t do this). Spread remaining frosting over top and sides of torte. Press sliced almonds onto sides of torte.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Can be made one to two days ahead. Cover with foil tent. Store at room temperature.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Tiny kitchen/tiny tray tweak:</b>  If you’re curious as to why mine may look a little smaller or taller than yours, I had to make my rectangles a little smaller — 11 x 3.75-inch — to work within the tiny baking sheets that fit in my tiny oven.  I flipped them over so they didn’t bump into the walls of the tray, but this proved unfortunate when mine spread down the sides! I (of course) don’t recommend the tray flipping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>About that spray oil:</b> As I mentioned in the post above, this step vexes me. I’ve always made macaroons and meringues on sheets of parchment paper that were <i>not</i> sprayed or grease, the nonstick properties of parchment were enough to release the cookies. But this recipe has you use nonstick spray on them, which encourages your neat rectangles of macaroon to slide and spread. This is not ideal. I hope to update this step soon with a note about whether you can get by without the spray oil, using plain parchment. Fortunately, any spreading can be trimmed but more ideal would, of course, be no spreading at all. <i>Update:</i> At least one commenter (thank you Kate!) made these without oiling the parchment, found that the macaroons spread less and had no trouble removing the macaroons from the parchment. </p>"}], "link": "https://smittenkitchen.com/2010/03-almond-macaroon-torte-with-chocolate-frosting"}