{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/12/scallion-meatballs-with-soy-ginger-glaze.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chinese, gluten free, meat, party snacks, photo", "name": "Scallion Meatballs with Soy-Ginger Glaze", "author": {"@type": "Organization", "name": "\nAdapted from Canal House Cooking, vol. 3"}, "description": "<p>I fiddled with the recipe a bit, using less cilantro and ginger than called for and cooking the sauce for much longer than suggested, in hopes to make it a true glaze that would hang onto the sides of a dipped meatball. I almost dialed back the sugar, but once the glaze was all reduced, I ended up liking the sweetness to balance out the salty kickiness of the soy and ginger.</p><p>Note: This recipe is gluten-free if you use a soy sauce that is labeled gluten free. There were many options on the shelf at the store.</p>", "totalTime": "", "recipeYield": "The original recipe suggest 24 but I got 34. This pleased me.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Sauce</u>", "1/2 cup dark brown sugar", "1/2 cup water", "1/2 cup soy sauce, preferably Japanese or reduced sodium", "1/2 cup mirin (sweet rice wine), or 1/2 cup sake with 1/4 cup sugar", "1/4 cup peeled, chopped ginger (I used half and it tasted like plenty to me; adjust to your preference)", "1 teaspoon ground coriander", "4 whole black peppercorns (no, I did not count how many I put in there)", "RECIPE_SUBHED__2<u>Meatballs</u>", "1 pound ground turkey", "4 large or 6 small scallions, finely chopped", "Half bunch cilantro, finely chopped (about 1/2 cup) (the cilantro-averse can use flat-leaf parsley)", "1 large egg", "2 tablespoons sesame oil, toasted if you can find it", "2 tablespoons soy sauce", "Freshly ground black pepper", "Vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Meatballs</u><br/>\n1 pound ground turkey<br/>\n4 large or 6 small scallions, finely chopped<br/>\nHalf bunch cilantro, finely chopped (about 1/2 cup) (the cilantro-averse can use flat-leaf parsley)<br/>\n1 large egg<br/>\n2 tablespoons sesame oil, toasted if you can find it<br/>\n2 tablespoons soy sauce<br/>\nFreshly ground black pepper<br/>\nVegetable oil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make sauce:</u> Bring sugar and water to a boil in a small saucepan over medium-high heat, stirring until sugar melts completely. Reduce heat to a medium-low and add soy sauce, mirin, ginger, coriander and peppercorns. Simmer, stirring occasionally, until reduced by half, about 30 minutes, though this took me a bit longer to reduce it until it was syrupy enough that I thought it would coat, and not just dribble off the meatballs. You can keep it on a back burner, stirring it frequently, while browning the meatballs in the next step. Once it has reduced to your satisfaction, strain through a sieve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make meatballs:</u> Mix turkey, scallions, cilantro, egg, sesame oil, soy sauce and several grindings of black pepper in a bowl. I like mixing meatballs with a fork; it seems to work the ingredients into each other well. Roll tablespoon-sized knobs of the mixture into balls. The mixture is pretty soft; I find it easiest to roll — eh, more like toss the meatballs from palm to palm until they’re round<i>ish</i> — meatballs with damp hands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a skillet over medium-high heat, generously cover bottom of pan with vegetable oil. Working in batches to avoid crowding, place meatballs in pan and cook, turning, until browned all over and cooked inside, about 8 minutes per batch. Arrange on a platter (a heated one will keep them warm longer), spoon a little sauce over each meatball, and serve with toothpicks. Alternatively, you can serve the glaze on the side, to dip the meatballs. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Do ahead:</i> The sauce can be made up to 2 days in advance and refrigerated until needed. If needed, you can rewarm or keep the meatballs warm in a 200-degree oven until ready to serve. I’m storing mine in the fridge overnight and crossing my fingers they’ll taste fresh tomorrow.</p>"}], "link": "https://smittenkitchen.com/2011/12-scallion-meatballs-with-soy-ginger-glaze"}