{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/03/oat-and-maple-syrup-scones.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, photo, scones biscuits", "name": "Maple Syrup and Oat Scones", "author": {"@type": "Organization", "name": "\nAdapted from Breakfast Lunch, Tea: The Many Little Meals of Rose Bakery"}, "description": "<p>These maple syrup scones have oats, whole wheat flour and maple syrup but are just barely sweet yet not at all gritty with healthfulness. I think it’s the substantial amount of butter within. Of interest, most of my favorite scones have heavy cream in them; this one does not but it has nearly the same amount of butterfat due to the higher amount of butter.</p><p>About the weights: In this recipe, they’re provided by the book’s author, not me. They differ from what I’d measure in my own cups and spoons but you can feel safe following them just the same, as they work — I did.</p>", "totalTime": "", "recipeYield": "The book suggests 10 to 12 but I made mine (ruler-measured! yes, I’m ocd!) their suggested size and only got 8.", "recipeIngredient": ["1 3/4 cups (260 grams) all-purpose flour, plus extra for dusting surface", "1/2 cup (80 grams) whole wheat flour", "1/2 cup (35 grams) rolled oats (I used quick-cooking)", "1 very heaped tablespoon baking powder (I only slightly heaped; wish I’d heaped more!)", "1 very heaped tablespoon superfine (caster) or granulated sugar", "1/2 teaspoon table salt", "Scant 3/4 cup (160 grams) unsalted butter, cut into pieces", "1/4 cup maple syrup", "1/4 cup milk or buttermilk", "1 egg, beaten (for glaze)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 3/4 cups (260 grams) all-purpose flour, plus extra for dusting surface<br/>\n1/2 cup (80 grams) whole wheat flour<br/>\n1/2 cup (35 grams) rolled oats (I used quick-cooking)<br/>\n1 very heaped tablespoon baking powder (I only slightly heaped; wish I’d heaped more!)<br/>\n1 very heaped tablespoon superfine (caster) or granulated sugar<br/>\n1/2 teaspoon table salt<br/>\nScant 3/4 cup (160 grams) unsalted butter, cut into pieces<br/>\n1/4 cup maple syrup<br/>\n1/4 cup milk or buttermilk<br/>\n1 egg, beaten (for glaze)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 400°F (200°C). Butter a baking tray, or, if you’re me and your baking sheets are in horrendous condition, line them with un-buttered parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk the flours, oats, baking powder, sugar and salt together in a large bowl. With a pastry blender or your fingertips, work the butter into the dry ingredients until the mixture resembles fine breadcrumbs. In a small dish, combine the milk and syrup, then add these liquid ingredients to the butter-flour mixture. By hand or with a rubber spatula, bring everything together to form a softish dough. If it feels too dry, add a little more milk but not enough that the dough is sticky. “The dough should not be stick at all,” the book admonishes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, pat or roll the dough out until it is 1 1/4 inches (3 cm)  tall. Using a 2-inch (5-cm) cutter, cut the dough into rounds and place them on the prepared tray so that they almost touch. Glaze the tops with beaten egg and bake for 20 to 25 minutes until the scones are lightly golden. The scones will stick together, so pull them gently apart when they’ve cooled a bit — pull-apart scones!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm. Also, you may find them stale the next day but your toddler may not care, so keep them around!</p>"}], "link": "https://smittenkitchen.com/2011/03-oat-and-maple-syrup-scones"}