{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5680064751_3cbfea1bdb_o.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "asparagus, budget, photo, quick, salad, spring", "name": "Ribbony Asparagus Salad with Lemon and Parmesan", "author": {"@type": "Organization", "name": "\nInspired by the Union Square Cafe"}, "description": "<p>This is such a fun way to celebrate the first asparagus of the season you bring home. And yes, I just reread that sentence and am fully aware that the concept of “celebrating asparagus” would have made me roll my eyes a few years ago, like maybe I’d been burning too much patchouli. But when you start trying to eat along with the seasons, you realize how long the winter is on the East Coast and begin to eagerly anticipate the day in spring when the first green things pop from the ground. Round here, that’s asparagus. And when it is as fresh as you can get it now, there’s no reason to cook it, not when you can turn it into a pile of ribbons and twist them around like spaghetti on your fork.</p><p>There are no exact measurements in this recipe. Everything is to taste, so taste as you go along to make sure you’re getting all the Parmesan, nutty, and lemony flavors you want.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1/4 cup pine nuts or sliced almonds, toasted* and cooled", "1 pound asparagus, rinsed", "1 lemon, halved", "Olive oil", "Coarse salt", "Freshly ground black pepper", "1 to 2 ounces Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/4 cup pine nuts or sliced almonds, toasted* and cooled<br/>\n1 pound asparagus, rinsed<br/>\n1 lemon, halved<br/>\nOlive oil<br/>\nCoarse salt<br/>\nFreshly ground black pepper<br/>\n1 to 2 ounces Parmesan cheese</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>No need to snap off the tough ends of your asparagus. Lay a single stalk on its side on a cutting board. Holding onto the tough end, use a vegetable peeler (a Y-shaped peeler is easiest, but I’ve used a standard one successfully) to shave off thin asparagus ribbons from stalk to tip, peeling away from the tough end in your hand. [Updated] Discard the tough ends once you’re done peeling. Gently pile your ribbons on a medium-sized serving platter. Squeeze some lemon juice over the asparagus, drizzle it with a bit of olive oil and sprinkle it with salt and pepper. Toss gently and then use your peeler to shave curls of Parmesan right off the block, over the asparagus. Sprinkle with some toasted nuts. Repeat with remaining asparagus, a third of the remaining bundle at a time. Eat immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I toast mine in a single layer on a baking sheet at 350 for 5 to 10 minutes. It’s really important, especially with pine nuts, that you stay close and toss them frequently because they love to burn, but if you move them around a bit, you can get a wonderful, even coffee coffee color on them and an intensely nutty flavor. It makes even unfancy nuts taste amazing.</p>"}], "link": "https://smittenkitchen.com/2011/05-ribboned-asparagus-salad-with-lemon"}