{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/09/red-wine-chocolate-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, everyday cakes, photo, quick", "name": "Red Wine Chocolate Cake with Whipped Mascarpone", "author": {"@type": "Organization", "name": "\nAdapted loosely from this Everyday Chocolate Cake, and you"}, "description": "<p>This, as far as I’m concerned, is the real red velvet cake — chocolate, naturally reddened and intensely flavored. For reasons I cannot put my finger on, this feels quintessentially September, fudgy rich chocolate, faintly spiced red wine, diminutive in size and so very quick to make. We are completely obsessed with it already.</p>", "totalTime": "", "recipeYield": "Now, the essentials: The wine does not, I repeat, does not, fully bake out. It will taste like there’s wine in there though not in the way that it would leave you tipsy, nevertheless, I will not be using this cake for, say, my toddler’s birthday party, if you get my drift. If you’re familiar with the Everyday Chocolate Cake, you might notice that I’ve changed a bunch of things. It’s flat and round, not a thick loaf. I use only 3/4 of the volume of some ingredients and 2/3 volume of others, you’ll see, the red wine gives it an intensity that’s best served thin — the final cake is only 3/4- to 1-inch tall, and bakes quickly. I add a yolk which just… makes it better and cinnamon, which plays off the red wine and chocolate fantastically, but not so much that it competes with either. Oh, and it’s still a one-bowl cake, and bakes in no time. You know you wanna.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Cake</u>", "6 tablespoons (85 grams) unsalted butter, at room temperature", "3/4 cup (145 grams) firmly packed dark brown sugar", "1/4 cup (50 grams) white granulated sugar", "1 large egg + 1 large egg yolk, at room temperature", "3/4 cup (177 ml) red wine, any kind you like*", "1 teaspoon (5 ml) vanilla extract", "1 cup + 1 tablespoon (133 grams) all-purpose flour", "1/2 cup (41 grams) Dutch cocoa powder", "1/8 teaspoon baking soda", "1/2 teaspoon baking powder", "1/4 teaspoon table salt", "1/4 teaspoon ground cinnamon (this is a great place for that fancy Vietnamese stuff you stashed away)", "RECIPE_SUBHED__2<u>Topping</u>", "1/2 cup mascarpone cheese", "1/2 cup (118 grams) chilled heavy or whipping cream", "2 tablespoons (25 grams) granulated sugar", "1/4 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Topping</u><br/>\n1/2 cup mascarpone cheese<br/>\n1/2 cup (118 grams) chilled heavy or whipping cream<br/>\n2 tablespoons (25 grams) granulated sugar<br/>\n1/4 teaspoon vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the cake:</u> Preheat the oven to 325°F. Line the bottom of a 9-inch round cake pan with parchment, and either butter and lightly flour the parchment and exposed sides of the pan, or spray the interior with a nonstick spray. In a large bowl, on the medium speed of an electric mixer, cream the butter until smooth. Add the sugars and beat until fluffy, about 3 minutes. Add the egg and yolk and beat well, then the red wine and vanilla. Don’t worry if the batter looks a little uneven. Sift the flour, cocoa, baking soda, baking powder, cinnamon and salt together, right over your wet ingredients. Mix until 3/4 combined, then fold the rest together with a rubber spatula. Spread batter in prepared pan. Bake for 25 to 30 minutes, or until a cake tester inserted into the center comes out clean. The top of the cake should be shiny and smooth, like a puddle of chocolate. Cool in pan on a rack for about 10 minutes, then flip out of pan and cool the rest of the way on a cooling rack. This cake keeps well at room temperature or in the fridge. It looks pretty dusted with powdered sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make the topping:</i> Whip mascarpone, cream, sugar and vanilla together until soft peaks form — don’t overwhip. Dollop generously on each slice of cake. It can also be covered and refrigerated for up to 4 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I used Bedell First Crush Red, one of our North Fork favorites.</p>"}], "link": "https://smittenkitchen.com/2011/09-red-wine-chocolate-cake"}