{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/pina-colada-cake1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, coconut, everyday cakes, photo, pineapple", "name": "Piña Colada Cake", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Note: Cream of coconut is different from coconut milk; it is a very sweet, thick white liquid while coconut milk is unsweetened, just water and pressed coconut flesh. I used cream of coconut because it had a stronger coconut flavor. If you can only find coconut milk, however, in one test of the cake (that was delicious but didn’t have the coconut oomph I wanted) I used a cup of it instead, used all of the brown sugar and added 3/4 cup granulated sugar.</p><p>If you cannot get fresh pineapple, grab a small can of pineapple (in 100% pineapple juice, not syrup). The juice in the can can be used for the glaze. You’ll get a sharper flavor, of course, from fresh pineapple.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["RECIPE_SUBHED__1<u>Cake</u>", "2 cups (250 grams or 8 3/4 ounces) all-purpose flour", "1 teaspoon baking powder", "3/4 teaspoon baking soda", "1/2 teaspoon salt", "1 stick (113 grams or 4 ounces) unsalted butter, softened", "1/4 cup light (55 grams or 2 ounces) brown sugar", "1 tablespoon (15 ml) dark rum", "2 large eggs, at room temperature", "1 cup (237 ml) cream of coconut", "1/2 cup (72 grams or 2 1/2 ounces) finely chopped fresh pineapple (or pineapple from a can, strained, juice reserved)", "RECIPE_SUBHED__2<u>To brush over the cake</u>", "1 to 2 tablespoons rum (optional)", "2 tablespoons pineapple juice (optional)", "RECIPE_SUBHED__3<u>Glaze</u>", "1 cup (120 grams or 4 ounces) powdered sugar", "Pinch of table or fine sea salt", "1 1/2 to 3 tablespoons pineapple juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Glaze</u><br/>\n1 cup (120 grams or 4 ounces) powdered sugar<br/>\nPinch of table or fine sea salt<br/>\n1 1/2 to 3 tablespoons pineapple juice</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 tablespoons dark rum for sprinkling over cake (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Butter a 9-inch round cake pan and line the bottom with a circle of parchment paper, then butter parchment. (Alternately, you can use a cooking spray, either with just butter or butter and flour to speed this process up.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together flour, baking powder, baking soda, and salt in a medium bowl. In a large mixing bowl, beat butter and brown sugar with an electric mixer at medium speed until pale and fluffy, then beat eggs, one at a time, and rum. Add cream of coconut and mix; the batter will look curdly and worrisome but will all work out in the end. Add dry ingredients, half at a time, mixing and scraping down bowl between additions. Mix only until flour is just incorporated. Using a rubber spatula, fold in bits of pineapple.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread batter evenly in prepared pan. Bake until golden and a wooden pick inserted in center of cake comes out clean, 35 to 40 minutes. Cool in pan on a rack 10 minutes, then run a knife around edge of pan. Invert onto rack and discard parchment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>For extra flavor, while the cake is still hot you can brush it with rum or pineapple juice.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool cake completely at room temperature, or in the fridge if you are impatient for cake (who isn’t?). Once completely cool, place powdered sugar and salt in a small bowl with 1 1/2 tablespoons pineapple juice and whisk until a thick glaze forms. Thin glaze only as needed, adding additional pineapple juice a teaspoon at a time until glaze is just thick enough to pour. Pour glaze into middle of cake and if it’s too thick to crawl to the edges itself, nudge it with a spatula until the top is covered. Serve immediately or let it set in the fridge for 20 minutes or so.</p>"}], "link": "https://smittenkitchen.com/2011/02-pina-colada-cake"}