{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/tiny-poppy-seed-taschen1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, jewish, photo", "name": "Tiny Poppy Seed 'Taschen", "author": {"@type": "Organization", "name": "\nAdapted, mostly clarified a bit, from “Schmaltz” by Shmil Holland via the NYT 3/15/11"}, "description": "<p>That doesn’t make this an easy dough to mess around with. It will seem impossible that this will work out in the oven but sure enough, 10 minutes later you’ll have the lightest, gently crisp hamanataschen you’ve ever tried in front of you, making all of the dough aggravation worth it. I’ve added notes on the forming of the cookies which will hopefully help.</p><p>I ended up with almost double the poppy seed filling I needed, but I also had to use a lot less than suggested to keep my cookies from being over-stuffed. If you’re not into poppy seed fillings, your favorite jam would work.</p><p>Most confusingly: I just realized that recipe I printed from the NYTimes yesterday is very different from the one on the site today. First, it tells you to grind your poppy seeds but doesn’t say in a spice grinder so I tried and failed to grind mine in the food processor. This is why my seeds are whole. The one on the site doesn’t suggest an extra chilling time once the cookies are formed and brushed with egg wash. I think this was helpful and encourage you to do this, below. The recipe on the site suggests you use 3-inch cookie cutters (a traditional size), the one that I printed says 2 1/2-inch. I listened to neither and used a 2 1/4-inch cutter; I like tiny ‘taschen.</p>", "totalTime": "", "recipeYield": "44-ish from a 2 1/4-inch circle cutter (as I did); the original recipe suggests a yield of 30 with a 3-inch round cookie cutter or a yield of 36 with a 2 1/2-inch cutter", "recipeIngredient": ["RECIPE_SUBHED__1<u>Dough</u>", "Grated zest of 1 lemon", "1 cup powdered sugar", "2 1/4 cups all-purpose flour", "1/4 teaspoon table salt", "2 large egg yolks", "8 ounces (2 sticks) unsalted butter at room temperature, in small pieces", "RECIPE_SUBHED__2<u>Poppy Seed Filling</u>", "1 cup milk", "1/2 cup sugar", "Grated zest of 1/2 orange", "1 cup poppy seeds", "1/3 cup raisins", "Juice of 1/2 lemon", "1/2 tablespoon brandy", "1/2 tablespoon orange liqueur", "1/2 tablespoon butter", "1/2 tablespoon vanilla extract", "RECIPE_SUBHED__3<u>Glaze</u>", "1 large egg, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Glaze</u><br/>\n1 large egg, beaten</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the dough:</u> Place the lemon zest, powdered sugar, flour and salt in the bowl of a food processor and pulse to blend. Add the butter and egg yolks and process until the mixture forms a ball. Scrape onto a sheet of plastic and wrap it tightly. Chill the dough for an hour or overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Prepare the filling:</u> Grind seeds in a coffee grinder. Heat milk, sugar, orange zest, ground poppy seeds and raisins in a small saucepan over medium heat. On a low simmer, cook until the seeds absorb the milk, thickening the mixture, about 15 minutes. Add the lemon juice, brandy, orange liqueur and butter and cook for 2 minutes more. Finally, add the vanilla and stir to combine. Remove from heat to let cool completely. I sped this up in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Form the cookies:</u> Line two baking sheets with parchment paper. Roll out the dough to just under 1/4-inch thickness (1/4 was suggested; I found it a little thick for smaller cookies) and use a cookie cutter or glass to cut 2 1/4-inch circles (see Note up top for other sizes). Put a heaping half-teaspoon of the filling in the center of each and press up the sides to form triangles. If your dough comes out like mine did, this will be kind of annoying as the dough will crack when you want it to bend. Don’t be deterred, just smoosh the sides back on and mold it, if needed, into the proper shape. Arrange on prepared trays (transfer cookies with a spatula, as they are fragile before they are baked) and brush the tops with beaten egg for glaze. Return tray to the fridge for 20 to 30 minutes; chilling them again will help them hold their shape while they are baked. Meanwhile, preheat your oven to 350°F</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Bake:</u> Until cookies are golden, about 10 to 15 minutes. If trays are on different racks, switch them after about 5 minutes. </p>"}], "link": "https://smittenkitchen.com/2011/03-tiny-poppy-seed-taschen"}