{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/blackberry-and-coconut-macaroon-tart1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "blackberries, coconut, passover, photo, tarts pies", "name": "Blackberry and Coconut Macaroon Tart", "author": {"@type": "Organization", "name": "\nAdapted from Super Natural Everyday"}, "description": "<p>My attempt to swap the whole wheat flour with matzo cake meal was only moderately successful, though I’m not sure if it has to do with the baking-unfriendly bread of affliction or the fact that my coconut was “medium” not “fine” as suggested. If you’re trying it with matzo meal, it might be worth it to grind everything together in a food processor and if you need an extra tablespoon of melted butter to pull it together, go for it.</p><p>Some long-winded notes about volumes: The original recipe called for an 8×11-inch tart pan, which I did not have, or the equivalent of in volume. I ended using 2/3 of the crust recipe and 3/4 of the filling (2/3, which would have been correct, seemed like too much of a headache with 4 egg whites) to fill a 13.75×4.25-inch tart pan I have (but never use, because no standard recipes work in it!). Instead of suggesting pan sizes you probably don’t have, I’ve done what I should have from the get-go and scaled the whole recipe to 3/4 of the original volume which should nicely fit in a 9-inch round tart pan (with removable bottom) or an 8-inch square cake pan with the understanding that the first bar will probably not come out cleanly! Unless you have an 8-inch square cake pan with a springform or removable bottom, in which case, I’m jealous of how well supplied your kitchen is!</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crust</u>", "1 cup plus 2 tablespoons white whole wheat flour, spelt flour or matzo cake meal", "1/2 cup plus 1 tablespoon unsweetened finely shredded coconut", "1/2 cup plus 1 tablespoon natural cane sugar (I used a coarse Turbinado because I had it on hand)", "Generous 1/4 teaspoon fine grain sea salt", "6 tablespoons unsalted butter, melted", "RECIPE_SUBHED__2<u>Filling</u>", "1 1/2 cups unsweetened finely shredded coconut", "6 tablespoons natural cane sugar or lightly packed light brown sugar", "3 large egg whites", "6 ounces fresh blackberries, halved (feel free to swap any berry/cherry you can find in season)", "1/4 cup pistachios, crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Filling</u><br/>\n1 1/2 cups unsweetened finely shredded coconut<br/>\n6 tablespoons natural cane sugar or lightly packed light brown sugar<br/>\n3 large egg whites<br/>\n6 ounces fresh blackberries, halved (feel free to swap any berry/cherry you can find in season)<br/>\n1/4 cup pistachios, crushed</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make base:</u> Preheat oven to 350°F with a rack in the middle of the oven. Line the bottom of a 9-inch round tart pan with a removable bottom or an 8-inch square baking pan with parchment. Generously butter parchment and sides of pan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine flour, coconut, sugar and salt in a medium bowl. Stir in melted butter until evenly distributed in dry ingredients. Press mixture firmly in the bottom of the pan to form a solid, flat layer, like a shortbread cookie base. Bake for 15 minutes, or until lightly golden. Remove and set aside to cool for a few minutes while you prepare the filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble tart:</u> Stir together coconut, sugar and egg whites. Evenly distribute blackberries across tart base. Using a small spoon or your fingertip, drop little tufts of macaroon filling around the blackberries, allowing them to stay at least partially uncovered.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 20 to 25 until the peaks of the macaroon filling are bronzed. Let tart cool, then garnish with the crushed pistachios (I pressed mine in just a little bit, so they’d stick better) before slicing into skinny wedges or small squares.</p>"}], "link": "https://smittenkitchen.com/2011/04-blackberry-and-coconut-macaroon-tart"}