{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/chocolate-peanut-spread-peanutella1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, peanut butter, photo", "name": "Chocolate-Peanut Spread [“Peanutella”]", "author": {"@type": "Organization", "name": "\nAdapted from a bunch of sources, but closest to this from the LA Times"}, "description": "<p>To say what is probably obvious, peanut qualities range. Cocoa qualities range. Salt preferences range. Flavor preferences range. This is an easily tweaked recipe. I ended up using a bit more sugar than I’d expected, and more oil (as in, I’d expected not to need as much as usually suggested due to the high fat content in peanuts but still used three tablespoons). I wanted more salt and wished I’d found better peanuts to start with, but you know, a balmy high of 20 degrees this weekend doesn’t exactly motivate one to hunt down the best ingredients. I can assure you that this is no less loved, despite it’s average peanut base, and no more likely to only be eaten in the moderate spoonfuls promised. Oops.</p>", "totalTime": "", "recipeYield": "Probably makes 1 3/4 cups, but it was down to a scant 1 1/2 cups before I bothered to gauge the volume", "recipeIngredient": ["2 cups shelled and skinned raw peanuts", "1/2 cup of your darkest, richest unsweetened cocoa powder", "1 1/4 cups powdered sugar", "1/4 teaspoon salt plus additional to taste (I used an extra 1/8 teaspoon)", "3 tablespoons peanut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups shelled and skinned raw peanuts<br/>\n1/2 cup of your darkest, richest unsweetened cocoa powder<br/>\n1 1/4 cups powdered sugar<br/>\n1/4 teaspoon salt plus additional to taste (I used an extra 1/8 teaspoon)<br/>\n3 tablespoons peanut oil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat the oven to 400 degrees. Spread the peanuts evenly over a cookie sheet and roast until they darken, about 10 minutes, rattling them around a bit halfway through to they toast evenly. (If you, like me, were unable to find raw peanuts, just toast them for a 5 minutes to deepen their flavor.)  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the peanuts to a food processor and grind them for about 5 minutes. First they’ll become a paste and will cause any <a href=\"http://www.flickr.com/photos/smitten/5379160982/in/set-72157622359738301/\">toddler</a> in your midst to have a meltdown from the ruckus. Then they’ll become more of a paste and finally, they’ll liquefy. Scrape down the sides as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the cocoa, sugar, salt and two tablespoons of the oil to the food processor and continue to process until well blended, about 1 minute. Add more salt if needed. Add the last tablespoon of oil if the consistency seems too thick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Store in refrigerator up to a week in a covered container. When it is full chilled, like peanut butter, it will become thick and swipe with a teaspoon will leave a telltale impression. Look, I’m just warning you, okay?</p>"}], "link": "https://smittenkitchen.com/2011/01-chocolate-peanut-spread-peanutella"}