{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/01/baked-potato-soup.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "instant pot, photo, potatoes, soup, winter", "name": "Baked Potato Soup", "author": {"@type": "Person", "name": "Source: Adapted generously from Cook's Illustrated Garlic Potato Soup"}, "description": "I know what you’re thinking: “But where’s the baked potato?” (A few folks have already asked.) The title is a riff on the taste and toppings of baked potatoes. I did, of course, initially consider starting with baked potatoes but rejected this approach because of time constraints (an extra hour for potato-baking, 15 minutes for cooling before you could touch them), textural concerns (I wanted some chunks to remain, and knew that a baked potato dropped in a soup would fall apart) and flavor worries (that a potato cooked outside the broth wouldn’t pick up as much garlicky/leek fragrance). That said, should you want to adhere closer to the baked potato theme, or have leftover baked potatoes that you’d like to use, I’d add them in chunks exactly when you’d add the raw ones, but only cook it for 10 minutes, not 15 to 20, before finishing the soup. ", "totalTime": null, "recipeYield": "6", "recipeIngredient": ["1 head garlic", "3 tablespoons unsalted butter", "2 medium leeks, white and light green parts halved lengthwise, washed, and chopped small", "5 to 6 cups low-sodium chicken or vegetable broth (I used 5 cups; add the extra cup after pureeing if you’d like a thinner soup)", "2 bay leaves", "Table salt", "2 1/2 pounds russet potatoes, peeled and cut into 1/2-inch cubes", "1/3 cup sour cream", "Ground black pepper", "Minced fresh chives or scallions", "Bacon bits", "Sour cream", "Grated cheddar", "A drizzle of melted (or melted and browned) butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the garlic: Rinse the head of garlic to remove any outside grit or dirt. Cut the top third off the head and peel any loose papery skins off the bottom two-thirds. Instead of discarding the top third (CI’s suggestion), pop out a bunch (or all) of the garlic clove tips and mince them. If you’re Deb, breathe a sigh of relief that you have wasted nothing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the stovetop: In a large, heavy pot or Dutch oven, melt the butter over medium heat. Add leeks and cook them until soft (but not brown), about 5 minutes. Add the minced garlic and cook another minute. Add the larger part of the garlic head (whole, not chopped), broth, bay leaves and 3/4 teaspoon salt. Reduce heat and simmer until garlic is very tender when pierced with tip of knife, 30 to 40 minutes. Add potatoes and continue to simmer, partially covered, until potatoes are tender, about 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an InstantPot or electric pressure cooker: Use the sauté function to melt the butte, add the leeks, and then cook them until soft (but not brown), about 5 minutes. Add the minced garlic and cook another minute. Add the larger part of the garlic head (whole, not chopped), broth, bay leaves and 3/4 teaspoon salt. Cancel out the sauté function and select the soup/broth function; cook for 10 minutes at high pressure, then manually release the pressure. Add the potatoes to the pot, select the soup/broth function again, and cook for 5 more minutes at high pressure. Let it release naturally for 15 minutes, then manually release the pressure the rest of the way. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Both methods: Discard bay leaves. Remove garlic heads. Optional: If you’d like an extra garlic boost to the soup, using tongs or paper towels, squeeze garlic head at root end until cloves slip out of their skins. Using a  fork, mash the garlic cloves to smooth paste and add it back to the soup. [I felt our soup was garlicky enough without this. It had a great suggestion of garlic without overpowering the baked potato flavor.]"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: Add sour cream to soup and cook [use the sauté function in an InstantPot/electric pressure cooker) for another 2 to 3 minutes. Adjust seasonings, adding more salt and pepper to taste. Using immersion blender, process soup until chunky-creamy, leaving lots of potato texture intact. (Alternatively, transfer a portion of the potatoes and broth to a food processor or blender and puree until smooth.) Serve with whatever makes you happy on top, or nothing at all."}], "link": "https://smittenkitchen.com/2011/01-baked-potato-soup"}