{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/03/whole-wheat-goldfish-crackers.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cheese, photo, snack", "name": "One year ago:", "author": {"@type": "Organization", "name": " St. Louis Gooey Butter Cake and Warm Mushroom Salad with Hazelnuts\nTwo years ago: Steak Sandwiches and Crispy Chewy Chocolate Chip Cookies\nThree years ago: Big Crumb Coffee Cake and Alex’s Chicken and Mushroom Marsala"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["<b>Whole Wheat Goldfish Crackers</b>", "Adapted in ways they probably hadn’t planned from ", "<a href=\"http://www.amazon.com/gp/product/039305781X?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=039305781X\">The Lee Bros.</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Whole Wheat Goldfish Crackers</b><br/>\nAdapted in ways they probably hadn’t planned from <a href=\"http://www.amazon.com/gp/product/039305781X?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=039305781X\">The Lee Bros.</a></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I swapped most (but not all, because I copped out) of the all-purpose flour in the original recipe for whole wheat flour, suspecting that we wouldn’t miss a thing and indeed, we did not. Should you make these with a full amount whole wheat flour (or any other mix of flours), please let us know how it went in the comments as I’m sure many will be curious.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I’d intended to make the eyes with a wooden skewer but couldn’t find one and used a drill bit instead (hi, honey!). Go ahead and press right through the cracker with the point; the “docking” will keep the cracker from puffing too much. I used the end of a grapefruit knife (the only thing I could think of that ended in a curve) to make the mouth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>I spied onion powder on the ingredient list of the original crackers and included it because onions and cheddar are a fantastic combination. You’ll barely taste it, so if you wish get more of a hint of onion, use 1/4 teaspoon instead.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Finally, the higher amount will give you a familiar level of saltiness, i.e. almost as salty as the original cracker. Understandably, many will probably prefer the smaller amount.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Yield: About 100 1 1/4 inch goldfish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6 ounces (1 1/2 cups coarsely grated) sharp cheddar, orange if you can find one you like<br/>\n4 tablespoons (2 ounces or 57 grams) butter<br/>\n1/2 cup (2 1/2 ounces or 62 grams) whole wheat flour<br/>\n1/4 cup (1 1/8 ounces or 31 grams) all-purpose flour<br/>\n1/8 teaspoon onion powder<br/>\n1/8 to 1/4 teaspoon table salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350°F. Combine all ingredients in a food processor, running the machine until the dough forms a ball, about two minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If the dough feels warm or worrisome-ly soft, wrap it in waxed paper or plastic wrap and chill it in the fridge for 30 to 45 minutes. This also makes it easier to transfer shapes once they are rolled out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a lightly floured surface, using a lightly floured rolling pin, roll the dough out 1/8-inch thick. Form shapes with a cookie cutter, dipping it in flour from time to time to ensure a clean cut. Gently transfer crackers to an ungreased (though mine were parchment-lined, because they are in despicable shape) cookie sheet with a 1/2 inch between them. Bake the crackers on the middle rack for 12 to 15 minutes, or until they are barely browned at the edges. Remove from the oven and set the cookie sheet on a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Tiny Goldfish Cookie Cutter</b>: I bought mine <a href=\"http://www.coppergifts.com/cookie-cutters/pc/Fish-Cookie-Cutter-mini-tiny-p1947.htm\">here</a>. <a href=\"https://amzn.to/2UR17Xl\">Here’s a newer one</a> a reader brought to my attention that I’d definitely buy next time.</p>"}], "link": "https://smittenkitchen.com/2011/03-whole-wheat-goldfish-crackers"}