{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/07/corn-buttermilk-and-chive-popovers.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "corn, muffin, photo, summer", "name": "Corn, Buttermilk and Chive Popovers", "author": {"@type": "Organization", "name": "\nAdapted from The New Basics"}, "description": "<p>I got the idea in my head for buttermilk corn popovers last month and became a little obsessed. I even bought a popover pan in a moment of weakness, but hear me out: you do not need one. I did not need one. You can use a muffin tin. Or ramekins. Trust me, as I will never find a place to put this away which means that it will soon be re-appropriated for paint cups or Cheerio storage and it’s all my fault.</p>", "totalTime": "", "recipeYield": "Makes 6 popovers in a traditional popover pan or in ramekins; will likely make 9 in muffin tins", "recipeIngredient": ["1 cup buttermilk (or ", "<a href=\"https://smittenkitchen.com/tips/make-your-own-buttermilk/\">make your own sour milk</a>", ")", "1/2 cup corn kernels (from most of one cob)", "3 large eggs", "2 tablespoons melted butter, cooled, divided", "1 cup all-purpose flour", "1 tablespoon yellow cornmeal", "1 teaspoon granulated sugar", "1/2 teaspoon table salt", "Freshly ground black pepper", "1 tablespoon snipped fresh chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup buttermilk (or <a href=\"https://smittenkitchen.com/tips/make-your-own-buttermilk/\">make your own sour milk</a>)<br/>\n1/2 cup corn kernels (from most of one cob)<br/>\n3 large eggs<br/>\n2 tablespoons melted butter, cooled, divided<br/>\n1 cup all-purpose flour<br/>\n1 tablespoon yellow cornmeal<br/>\n1 teaspoon granulated sugar<br/>\n1/2 teaspoon table salt<br/>\nFreshly ground black pepper<br/>\n1 tablespoon snipped fresh chives</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place buttermilk and corn in a blender together and blend for just 3 seconds — you’re looking to break up the corn a bit, not puree it. Add the eggs, one tablespoon of the melted butter and blend for one second more. Add the flour, cornmeal, sugar, salt, a few grinds of black pepper (I used four, not that you asked or that I’d expect a normal person to count) and the chives and blend again until barely combined, some lumps are fine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set the batter aside to rest while you preheat your oven to 375 degrees, about 15 minutes. Brush your popover, muffin or ramekin cups with the remaining tablespoon of butter. Fill each cup slightly more than halfway with batter (see top of recipe for cup estimates).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake popovers 30 to 35 minutes (see Note above about baking times in a muffin tin). Try not to open the oven door! Crack it just 1-inch to take a peak if absolutely necessary towards the end. Popovers are done when they’re tall and bronzed. Flip popovers out onto cooling rack and let cool for a few minutes before tearing in. Even then, they will be filled with steam and very hot in the middle — be careful. Eat with a great big summery salad on a deck somewhere, please.</p>"}], "link": "https://smittenkitchen.com/2011/07-corn-buttermilk-and-chive-popovers"}