{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/07/flatbreads-with-honey-thyme-and-sea-salt.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, party snacks, quick, snack", "name": "Crisp Flatbreads with Honey, Thyme and Sea Salt", "author": {"@type": "Organization", "name": "\nFlatbread base adapted from Gourmet; recipe inspired by Salinas"}, "description": "<p>These crackers fit squarely between dinner and dessert. It goes well with a cheese course — oh, wait, you don’t have cheese courses with each meal at your house? Yeah, us neither, sigh — or at a cocktail party or maybe as a little summer afternoon something-something with a glass of wine or even as a dessert for people who do not throw themselves wholly into sweet things. The crackers play off the nutty cheese which plays off the slick of honey and faint crunch of sea salt with bits of thyme throughout and together they are even more than the sum of their parts. And they take no time to make.</p><p>As for the cheese you use, the restaurant uses a Mahon, which I was able to find, but I daresay you could try any other aged nutty cow milk cheese instead, or even a hard salty cheese like Romano or Parmesan instead. Yes, that’s a wide range. Mostly, it’s about a flavor you might enjoy here.</p>", "totalTime": "", "recipeYield": "Makes about 16 flatbreads", "recipeIngredient": ["1 3/4 cups (7 3/4 ounces or 220 grams) all-purpose flour", "1 teaspoon baking powder", "3/4 teaspoon table salt", "1/2 cup (118 ml) water", "1/3 cup (79 ml) olive oil", "2/3 to 3/4 cup (about 3 ounces or 85 grams) grated Mahon cheese (see above for replacements)", "1/3 to 1/2 cup (79 to 118 ml) honey", "1 tablespoon fresh thyme", "Flaky sea salt such as Maldon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 3/4 cups (7 3/4 ounces or 220 grams) all-purpose flour<br/>\n1 teaspoon baking powder<br/>\n3/4 teaspoon table salt<br/>\n1/2 cup (118 ml) water<br/>\n1/3 cup (79 ml) olive oil<br/>\n2/3 to 3/4 cup (about 3 ounces or 85 grams) grated Mahon cheese (see above for replacements)<br/>\n1/3 to 1/2 cup (79 to 118 ml) honey<br/>\n1 tablespoon fresh thyme<br/>\nFlaky sea salt such as Maldon</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450°F with a heavy baking sheet or pizza stone on a middle rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk together flour, baking powder, and salt in a medium bowl. Make a well in center, then add water and oil and gradually stir into flour with a wooden spoon until a dough forms. Knead dough gently on a work surface 4 or 5 times. It will feel quite oily (but just think of how great your hands will look later!). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide dough into 4 pieces and roll out 1 piece at on a sheet of parchment paper into a longish irregular rustic shape; mine were about 12″x6″. The dough should be rolled thin and it be crazy oily and you’ll think I’ve lost my mind suggesting that it will make anything but a mess, but you’ll see in a few minutes how perfectly ungreasy it bakes up, promise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slide rolled out dough and parchment paper together onto the preheated baking sheet or stone, and bake about 5 minutes, until lightly golden. Leaving the oven on, remove tray from oven and quickly sprinkle with 1/4 of grated cheese. Bake an additional 3 to 4 minutes, until browned at edges and in thinner spots. Remove flatbreads from oven a final time, quickly drizzle each with honey (1 used about a tablespoon per flatbread, but the restaurant used more; they were truly flooded with honey and it was delicious), sprinkle with sea salt and garnish with thyme leaves. Cut each cracker width-wise into 4 sections (about 3″x6″ each) with a sharp knife. Repeat with remaining pieces of dough. Serve warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Should you want to prepare these ahead of time for a party, I’d bake them including the cheese about 1 minute less than needed. Shortly before you’re ready to serve them, re-toast them in the oven and then drizzle on the honey/thyme/sea salt. </p>"}], "link": "https://smittenkitchen.com/2011/07-flatbreads-with-honey-thyme-and-sea-salt"}