{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/12/parsnip-latkes-with-horseradish-and-dill.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "hanukah, jewish, pancakes, parsnips, party snacks, photo, potatoes, snack, vegetarian", "name": "Potato-Parsnip Latkes with Horseradish and Dill", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "About 18 2 1/2 to 3-inch latkes", "recipeIngredient": ["RECIPE_SUBHED__1<u>Pancakes</u>", "1/2 pound (about 1 large) Russet potato", "1 tablespoon fresh lemon juice", "1 pound parsnips (about 2 large or 4 medium)", "1/4 cup all-purpose flour", "1 teaspoon baking powder", "2 large eggs, lightly beaten", "2 tablespoons chopped fresh dill", "1 teaspoon table salt", "1/4 teaspoon freshly ground black pepper", "Olive oil (or a mix of olive and vegetable or peanut oil) for frying", "RECIPE_SUBHED__2<u>Sauce</u>", "1 cup sour cream", "1 tablespoon lemon juice", "1/2 teaspoon table salt", "1 tablespoon freshly grated or prepared horseradish", "1 tablespoon chopped dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Sauce</u><br/>\n1 cup sour cream<br/>\n1 tablespoon lemon juice<br/>\n1/2 teaspoon table salt<br/>\n1 tablespoon freshly grated or prepared horseradish<br/>\n1 tablespoon chopped dill</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat: Oven to 250 degrees. Line one large or two smaller baking sheets with foil and leave them in the oven until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare vegetables: Peel vegetables and grate them on the large holes of a box grater or (my preferred method) using the shredding blade of a food processor. If using the food processor, I like to lay the vegetables sideways in the chute, in an attempt to get the longest strands of vegetables. This creates latkes that look like little piles of mops, which is my goal.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer shredded vegetables to a lint-free dishtowel or square of cheesecloth, and wring out as much liquid as possible. Let stand for two minutes, then wring again. Wetness is the enemy of crisp, light latkes, so we want to get rid of as much as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make batter: Transfer wrung-out vegetables to a large bowl. Add lemon juice. In a tiny dish, stir together the flour, baking powder, salt, pepper and any herbs or additional seasonings and toss with vegetables, evenly coating the strands. In the same tiny dish, whisk your egg(s) and then stir this into the vegetable-flour mixture, evenly coating the strands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare pan: Heat a large, heavy skillet, preferably cast iron, over medium heat. Once skillet is hot, add 3 tablespoons oil and heat oil until shimmering. If you’re unsure, you can flick a droplet of water onto the oil; if it hisses and sputters, you’re good to go.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook: Using a fork or your fingertips (letting the eggy batter drain off a little is good), gather spoonful-sized mounds of battered vegetables and drop them onto the heated skillet. When golden underneath, 3 to 4 minutes later, flip pancakes. [If you’re using a gas range, you’ll likely have to rotate your pancakes 180 degrees halfway through the cooking time so that they color evenly underneath.] Cook on the other side until nicely bronzed underneath, another 2 to 3 minutes, and transfer to paper towels briefly to drain pancakes, before transferring them again to tray(s) in warm oven. If latkes cook too quickly or slowly on the stove, adjust the heat accordingly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add more oil if needed (you want to keep the pan at that 3 tablespoon level), being sure it is heated before adding more pancakes to the skillet. Repeat with remaining batter.  I like to keep the latkes in the oven for at least 10 minutes to ensure they’ve cooked through before serving them. This gives you time to…</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make sauce: Mix sauce ingredients in a small dish. Adjust seasonings to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve: Warm with a dollop of the sauce.</p>"}], "link": "https://smittenkitchen.com/2011/12-parsnip-latkes-with-horseradish-and-dill"}