{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/01/chard-and-white-bean-stew.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, budget, freezer friendly, gluten free, pantry, photo, put an egg on it, stew, swiss chard, vegan, vegetarian, winter", "name": "Chard and White Bean Stew", "author": {"@type": "Organization", "name": "\nAdapted a bit generously from Dan Barber"}, "description": "<p>I started with a recipe from Dan Barber for a kale and white bean stew, even though I knew it wasn’t what I wanted. I have yet to get over my dislike of kale, despite a brief period of acceptance when I learned how to make it into chips. I used chard instead, but you could use any green you’ve got, even spinach. (Though if you are unfamiliar with chard but like spinach, trust me, you’ll love chard.) I also only used 2/3 of the greens suggested, because I really want this to be a white bean, not greens, stew. Then, I swapped some of the vegetable broth for pureed tomatoes, because that’s what I think a bean stew needs. I dialed back the broth a bit, because I don’t like soupy stews… Oh, and I added some weights and then (typical!) forgot I was weighing ingredients so only some are listed. Sorry about that.</p><p>Finally, I cooked the wine down more than suggested because I wanted to make sure I wasn’t accidentally going to booze up the kid so that he might accidentally get a good night’s sleep. Because that would be terrible, you know?</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 pound Swiss chard (can also swap kale, spinach or another green), ribs and stems removed and cleaned", "3 tablespoons olive oil", "1 cup (5 1/4 ounces) chopped carrots", "1 cup (5 ounces) chopped celery", "1 cup (4 1/4 ounces) chopped shallots, about 4 medium", "2 garlic cloves, finely chopped", "1 cup dry white wine", "2 15-ounce cans (or about 3 3/4 cups) white beans, drained and rinsed", "2 cups (or more to taste) vegetable broth", "1 cup pureed tomatoes (from a can/carton/your jarred summer supply)", "Salt and freshly ground black pepper", "3 fresh thyme sprigs", "1 bay leaf", "1 tablespoon sherry vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound Swiss chard (can also swap kale, spinach or another green), ribs and stems removed and cleaned<br/>\n3 tablespoons olive oil<br/>\n1 cup (5 1/4 ounces) chopped carrots<br/>\n1 cup (5 ounces) chopped celery<br/>\n1 cup (4 1/4 ounces) chopped shallots, about 4 medium<br/>\n2 garlic cloves, finely chopped<br/>\n1 cup dry white wine<br/>\n2 15-ounce cans (or about 3 3/4 cups) white beans, drained and rinsed<br/>\n2 cups (or more to taste) vegetable broth<br/>\n1 cup pureed tomatoes (from a can/carton/your jarred summer supply)<br/>\nSalt and freshly ground black pepper<br/>\n3 fresh thyme sprigs<br/>\n1 bay leaf<br/>\n1 tablespoon sherry vinegar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toasted bread slices, poached eggs (<a href=\"https://smittenkitchen.com/2008/08/how-to-poach-an-egg-smitten-kitchen-style/\">tutorial</a>), chopped herbs such as tarragon, parsley or chives or grated Parmesan or Romano to serve (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring medium pot of salted water to boil. Cook chard (or any heavier green; no need to precook baby spinach) for one minute, then drain and squeeze out as much extra water as possible. Coarsely chop chard.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out medium pot to dry it, and heat olive oil over medium. Add carrots, celery, shallots and garlic and saute for 15 minutes. Barber warns not to brown them but I didn’t mind a light golden color on them. Add wine (scraping up any bits that have stuck to the pot) and cook it until it reduced by three-fourths. Add beans, broth, tomatoes, a few pinches of salt, freshly ground black pepper, thyme and bay leaf and bring to a boil. Reduce heat to medium-low and simmer for 20 minutes. Add chard and cook for 5 minutes more. Remove thyme and bay leaf. Add more broth if you’d like a thinner stew and adjust salt and pepper to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve as is drizzled with sherry vinegar. Or you can ladle the stew over thick piece of toasted country bread or baguette that has been rubbed lightly with half a clove of garlic, top <i>that</i> with a poached egg and a few drops of sherry vinegar and/or some grated cheese. </p>"}], "link": "https://smittenkitchen.com/2011/01-chard-and-white-bean-stew"}