{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/sally-lunn-bread-honeyed-brown-butter-spread1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, brown butter, photo", "name": "Sally Lunn Bread", "author": {"@type": "Organization", "name": "\nAdapted from Maida Heatter’s Cakes"}, "description": "", "totalTime": "", "recipeYield": "This recipe makes 1 9x5x3-inch loaf of bread. For a more traditional shape, you can double the recipe and bake it in a 9-inch (10 cup) tube pan. My changes to Heatter’s recipe were halve the recipe, further reduce the sugar, halve again the yeast (yes, halve, there was a lot!), swap out some water for additional milk and to streamline the directions to hopefully keep them as simple as possible.", "recipeIngredient": ["2 cups (250 grams or 8 3/4 ounces) all-purpose flour", "2 tablespoons (25 grams or 7/8 ounce) granulated sugar", "1 teaspoon (5 grams) table salt", "1 1/8 teaspoon (1/2 packet or 1/8 ounce) active dry yeast", "3/4 cup (177 ml) milk", "4 tablespoons (57 grams or 2 ounces) unsalted butter, softened", "1 large egg plus 1 large egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups (250 grams or 8 3/4 ounces) all-purpose flour<br/>\n2 tablespoons (25 grams or 7/8 ounce) granulated sugar<br/>\n1 teaspoon (5 grams) table salt<br/>\n1 1/8 teaspoon (1/2 packet or 1/8 ounce) active dry yeast<br/>\n3/4 cup (177 ml) milk<br/>\n4 tablespoons (57 grams or 2 ounces) unsalted butter, softened<br/>\n1 large egg plus 1 large egg yolk</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, mix 3/4 cup flour, sugar, salt and dry yeast by hand or with an electric mixer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a saucepan, heat the milk and butter together until the mixture is warm (105 to 110 degrees); don’t worry if this butter isn’t completely melted. Gradually pour the warm ingredients into the dry mixture and mix with an electric mixer for 2 minutes or stir vigorously by hand with a wooden spoon for 3 minutes. Add the egg, yolk and another 1/2 cup flour and beat again for 2 minutes by machine or 3 by hand. Add the last of the flour and beat or stir until smooth.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape down bowl and cover the top with plastic wrap. Let rise for one hour or until doubled. Meanwhile, butter and flour a 9x5x3-inch loaf pan. Once the dough has doubled, scrape it into the prepared pan. Cover with buttered plastic wrap and let rise for a total of 30 minutes. After 15 minutes, however, remove the plastic and preheat your oven to 375°F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 35 to 40 minutes or until a cake tester inserted into the center comes out clean. Heatter says the bread should make a hollow sound if tapped with your fingertips but I haven’t weathered mine enough yet that I didn’t find it unpleasant.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool in pan for 5 minutes then turn out to a rack to cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Just to note, Heatter suggests that the bread be cooled out of the loaf pan but upside down on the rack, I presume to square off the loaf, so this is an option for more perfectly square bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Salted and Honeyed Brown Butter Spread</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 stick (4 ounces or 113 grams) unsalted butter, divided<br/>\n1 to 2 tablespoons honey (use less for lightly sweet, more for a more traditional honey butter)<br/>\nFew pinches flaky sea salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, melt half your butter over medium heat. Once melted, reduce heat to medium-low. The butter will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir frequently, scraping up any bits from the bottom as you do. Remove from heat and cool to room temperature. While it is cooling, leave the other half of the butter out to soften slightly (semi-firm is fine).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whip softened butter with an electric mixer until fluffy. Slowly drizzle in the room temperature browned butter, honey and salt continue whipping until combined. Chill butter in fridge until a nice spreadable consistency, or until  needed.</p>"}], "link": "https://smittenkitchen.com/2011/03-sally-lunn-bread-honeyed-brown-butter-spread"}