{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/08/sugar-plum-crepes-with-ricotta-and-honey.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "pancakes, photo, plum, summer", "name": "Sugar Plum Crepes with Ricotta and Honey", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>One of the many things I love about crepes is that the batter can be made a day or even two (some say longer) in advance. You can make crepes as needed. But even if you make two dozen crepes (don’t worry, this recipe won’t), they keep surprisingly well. You can stack them while they’re still hot — they don’t stick to each other — and take them out of the fridge the next day and warm them again. Savory or sweet, the filling possibilities are endless but you know, I mostly made these sweet. Not overly so, I hope.</p><p>These crepes would be equally good with any other stone fruit, from white peaches to nectarines to apricots. I sauteed the fruit in butter and honey (because nothing bad can happen there, can it?) but will fully confess that I found it unnecessary. Thinly sliced, insanely ripe stone fruit needs no cooking time, so consider the sauteeing optional, unless you’re making this in the fall with apples or pears. In that case, I’d double the fruit cooking time and possibly even the butter and honey to make a lovely filling. But fall is terribly far off, isn’t it? </p>", "totalTime": "", "recipeYield": "I made 6 8.5-inch crepes but felt they were a little large for the dish I had in mind; I’d make this next time in a smaller skillet (using less batter, of course)", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crepes</u>", "2 tablespoons butter, melted and cooled slightly (I browned this first, which probably won’t surprise you)", "1/2 cup milk (fat level shouldn’t matter, but I use whole)", "2 large eggs", "1/2 cup all-purpose flour", "Two pinches of salt", "Few gratings fresh nutmeg", "2 tablespoons honey", "RECIPE_SUBHED__2<u>Plums</u>", "1 pound sugar or other plums, pitted and cut into quarters if tiny, eighths if larger", "1 tablespoon unsalted butter", "1 tablespoon honey", "Pinch of ground cinnamon", "Juice of half a lemon", "RECIPE_SUBHED__3<u>Assembly</u>", "1 cup ricotta (ever wanted to ", "<a href=\"https://smittenkitchen.com/2011/06/rich-homemade-ricotta/\">make your own</a>", "?)", "3 tablespoons slivered fresh mint leaves", "Toasted and chopped pistachios or almonds", "Additional honey, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assembly</u><br/>\n1 cup ricotta (ever wanted to <a href=\"https://smittenkitchen.com/2011/06/rich-homemade-ricotta/\">make your own</a>?)<br/>\n3 tablespoons slivered fresh mint leaves<br/>\nToasted and chopped pistachios or almonds<br/>\nAdditional honey, if desired</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make crepes: In a blender, combine crepe ingredients. (Alternately, in a bowl with an immersion blender, or whisked vigorously by hand.) Cover with plastic wrap and refrigerate for an hour or up to two days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat a medium skillet or crepe pan over medium-high heat. Once heated, brush pan lightly with melted butter or oil. Pour 1/4 cup batter into skillet, swirling it until it evenly coats the bottom and cook, undisturbed, until the bottom is golden and the top is set, about 2 minutes. Carefully flip and cook on other side for 5 to 10 seconds. Transfer wrapper to paper towel covered plate. Continue with remaining batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare filling: (Optional, see Note up top.) Melt the butter in heavy, large skillet (or, the one you just used for crepes, because I’m on day 9 of a broken dishwasher and will not create additional work for myself) over moderately high heat. Add the plums and cook them for 2 minutes, tossing them about until they’re warmed through. Add the honey and cinnamon and cook them for 1 minute more. Squeeze the juice of half a lemon over them and transfer to a bowl. Cover the bowl with foil if you’re looking to keep them warm for a while.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble: Lay a crepe on a plate. Dollop a couple spoonfuls of ricotta down middle of crepe. Add a spoonful or two of warm plums. Sprinkle with pistachios and mint, if using. Drizzle with extra honey, if desired (it otherwise won’t be very sweet). Fold crepe sides over each other, so that they slightly overlap. Garnish with extra mint. Close your eyes pretend you’re eating them on a boat in the Mediterranean, watching the sun slip behind the sea. Try not to impale your foot with a wooden racecar while you do, as it’s bad for morale.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Do ahead:</b> Fully cooked, crepes can be kept stacked and wrapped in the fridge for two days, if needed. The sauteed fruit can be cooked ahead of time, gently rewarmed when needed.</p>"}], "link": "https://smittenkitchen.com/2011/08-sugar-plum-crepes-with-ricotta-and-honey"}