{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/12/peppermint-hot-fudge-sauce.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "candy, chocolate, ice creamsorbet, photo", "name": "Peppermint Hot Fudge Sauce", "author": {"@type": "Organization", "name": "\nAdapted, just a bit, from Gourmet"}, "description": "<p>Now, not that one needs a reason to embrace hot fudge sauce, I mean, other than it’s Monday and there’s ice cream in the freezer, but one of the things that brought this on was that I found a product called golden syrup on the grocery store shelf when I hadn’t expected to, and this has kicked off a slew of cooking that was usually limited to corn syrup. Golden syrup is a pure cane syrup that can be used instead of corn syrup in most candy and caramel recipes and tastes infinitely better, as it has a slight caramel flavor to it. If you live outside the U.S., especially in the U.K. you’ve probably been using it your whole life but here it’s still a specialty item. I took the fact that Whole Foods on Houston was selling it in two different packages (canned and bottled) as a sign that this is probably slowly changing. (It’s also sold online over here and a bunch of other places Google can point you to, if needed.) If you cannot get golden syrup and don’t wish to use corn syrup, both honey and maple syrup will work as well, but of course impart different flavors.</p><p>Canning: Yes, I know I tempted you with tiny jars of ready-to-gift fudge, and I didn’t mean to be a tease, it’s just that products with dairy in them — and this has a ton — are not safe to can. But I see no reason why you cannot simply leave a note that it should be kept in the fridge and used within a week or two, right?</p>", "totalTime": "", "recipeYield": "Makes about 2 cups", "recipeIngredient": ["2/3 cup heavy or whipping cream", "1/2 cup light corn syrup or golden syrup (see Note above)", "1/3 cup packed dark brown sugar", "1/4 cup unsweetened cocoa powder, ideally Dutch-processed", "Heaping 1/4 teaspoon fine sea salt or level 1/4 teaspoon table salt", "6 ounces bittersweet chocolate, chopped (or, about 1 cup bittersweet chocolate chips), divided", "2 tablespoons unsalted butter", "1/4 teaspoon peppermint extract, or to taste", "Crushed candy canes, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2/3 cup heavy or whipping cream<br/>\n1/2 cup light corn syrup or golden syrup (see Note above)<br/>\n1/3 cup packed dark brown sugar<br/>\n1/4 cup unsweetened cocoa powder, ideally Dutch-processed<br/>\nHeaping 1/4 teaspoon fine sea salt or level 1/4 teaspoon table salt<br/>\n6 ounces bittersweet chocolate, chopped (or, about 1 cup bittersweet chocolate chips), divided<br/>\n2 tablespoons unsalted butter<br/>\n1/4 teaspoon peppermint extract, or to taste<br/>\nCrushed candy canes, for serving (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a 1 1/2 to 2-quart heavy saucepan, bring cream, syrup, sugar, cocoa, salt (if you’d like the salt to remain slightly textured, add it with the butter and extract at the end) and half the chocolate to a boil. Reduce to a low simmer and cook for 5 minutes, stirring occasionally. Remove from heat and stir in remaining chocolate, butter and extract and stir until smooth. Cool the sauce to warm before serving it so that it can thicken up. While very hot, it will only slide off the ice cream and pool in the alleys of the bowl and that would be tragic, right?</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Do ahead: Sauce keeps in fridge for a week (according to Gourmet), though we’ve kept it longer, closer to two weeks, and lived to tell about it. Reheat gently before serving, so that it is still thick but just loose enough to pour.</p>"}], "link": "https://smittenkitchen.com/2011/12-peppermint-hot-fudge-sauce"}