{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2011/05/5719998010_39fe45b180_o-2.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bourbon, citrus, drinks, lemon, photo, summer", "name": "Vermontucky Lemonades", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "Of course, this isn’t the restaurant’s recipe, or their terrible name for it. They humbly call it “The Back Forty”, but from the first night we had it I’ve been calling it the Vemontucky Lemonade in honor of its maple syrup and bourbon and uh, clearly, I think I’m pretty clever. (No need to play along at home). I also have far too much fun creating things from memory than to limit myself to pesky official recipes that I’ve pestered from bartenders. Nevertheless, this is a glass of something dreamy. The bourbon and maple syrup give it a depth of flavor a lot of warm weather drinks lack, and the lemonade makes you wish you were out on a patio somewhere, watching a summer storm roll in. Fortunately, there’s no need to wait for summer to start making a habit of this drink.", "recipeIngredient": ["1 cup freshly squeezed lemon juice (with an efficient squeezer, you should get this plus up to 1/3 cup extra from 2 pounds of 8 lemons)", "2 1/2 cups cold water, plus additional if needed", "1/4 to 1/2 cup maple syrup", "Bourbon", "Lots of ice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup freshly squeezed lemon juice (with an efficient squeezer, you should get this plus up to 1/3 cup extra from 2 pounds of 8 lemons)<br/>\n2 1/2 cups cold water, plus additional if needed<br/>\n1/4 to 1/2 cup maple syrup<br/>\nBourbon<br/>\nLots of ice</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix lemon juice with 2 1/2 cups water and 1/4 cup maple syrup. Taste for sweetness. If you like your lemonade sweeter, add remaining 1/4 cup maple syrup. If you found the sweetness just right, add an additional 1/4 cup cold water instead. Stir to mix. This will yield 1 quart of maple lemonade.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a glass with ice. We have a fiery debate at my house about whether this drink needs 1 or 1 1/2 shots of bourbon; my husband prefers more, but I like this drink a bit weaker. I’ll let you choose. Pour your desired amount of bourbon over the ice, fill the glass the rest of the way with maple lemonade and let the force of summer be with you.</p>"}], "link": "https://smittenkitchen.com/2011/05-vermontucky-lemonade"}