{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/02/double-coconut-muffins.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, coconut, muffin, photo", "name": "Double Coconut Muffins", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Although these are a fine muffin, fragrant with coconut and filled with a dense, moist crumb as written below, the potential for adaptation is almost endless. First, you could make them triple coconut muffins (and dairy free) by using coconut milk instead of yogurt, but I do like the texture that the tangy yogurt imparts and these muffins have no lack of coconut flavor. You could make mango-coconut muffins by adding a cup or so of diced mango chunks to the batter; pina colada muffins would use the same volume of pineapple chunks. You could replace the yogurt with mashed banana or banana puree to make a banana-coconut muffin and if you’re into that whole lime-in-the-coconut thing, you could add a teaspoon of lime zest. Chocolate chips? (1 cup), Macadamia nuts? (1/2 to 3/4 cup, toasted and chopped)… Really, I’m just getting started.</p>", "totalTime": "", "recipeYield": "10 standard muffins, though this seems off to me and I suspect that some of you will tell me you made a dozen (as I’d expected to).", "recipeIngredient": ["1/2 cup (110 grams) virgin coconut oil", "3/4 cup (95 grams) all-purpose flour", "1/2 cup (60 grams) whole wheat flour", "1 1/2 teaspoons baking powder", "1/4 teaspoon table salt", "1 cup (230 grams) full fat Greek-style yogurt, at room temperature is best", "1/3 cup (65 grams) granulated sugar", "1 large egg, at room temperature is best", "1 teaspoon (5 ml) vanilla extract", "3/4 cup (90 grams) sweetened shredded coconut, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 cup (110 grams) virgin coconut oil<br/>\n3/4 cup (95 grams) all-purpose flour<br/>\n1/2 cup (60 grams) whole wheat flour<br/>\n1 1/2 teaspoons baking powder<br/>\n1/4 teaspoon table salt<br/>\n1 cup (230 grams) full fat Greek-style yogurt, at room temperature is best<br/>\n1/3 cup (65 grams) granulated sugar<br/>\n1 large egg, at room temperature is best<br/>\n1 teaspoon (5 ml) vanilla extract<br/>\n3/4 cup (90 grams) sweetened shredded coconut, divided</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 375°F. Either grease 10 muffin cups with butter or coconut oil, or line them with papers. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Oh, you’re out of paper liners too? Cut parchment paper into 5-inch squares and form them into your empty muffin cups, pressing any creases flat. They won’t stay put until you fill them with batter, and you should make sure you push that batter down so it gets into the corners, but otherwise, they should work as well as the real deal.] </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small saucepan, warm your coconut oil <i>just until</i> it melts. It should still be on the cool side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk together your flours, baking powder and salt. Stir 1/2 cup shredded coconut. In a separate bowl, whisk together egg, sugar, coconut oil, yogurt and vanilla. Stir into dry ingredients until just combined. Divide batter among prepared muffin cups then sprinkle the top with remaining 1/4 cup coconut, about 1 to 2 teaspoons on each.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until a tester inserted into the center comes out batter-free, about 20 minutes. Transfer muffins to a rack and let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Usually, muffins are best on day one but I just had one of these on day three and found them almost as moist and tender as day one. Store in an airtight container at room temperature.</p>"}], "link": "https://smittenkitchen.com/2012/02-double-coconut-muffins"}