{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-tomato-and-rice-gratin.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "casserole, freezer friendly, gluten free, grain, photo, side dish, summer, tomatoes, vegetarian, zucchini", "name": "Zucchini Rice Gratin", "author": {"@type": "Organization", "name": "\nAdapted from Gourmet, March 2008"}, "description": "<p>My prior quibbles about this dish were that it always stuck to the pan (I try to alleviate this by having you oil your baking dish), was way too salty (and we are hardly salt-phobes, thus I’ve reduced the total amount from 1 1/2 teaspoons to 3/4 teaspoon; feel free to add more if you find it needs it), and that it used too many dishes. You can reduce your dishload by lining your zucchini baking sheet with aluminum foil (tomatoes are reactive with aluminum so I’d leave their tray bare) and hoping that you’ll consider using one skillet for the rice and onions. Despite the fact that I couldn’t reduce the moderate dishload further, we’ve never once felt that this dish wasn’t worth the extra suds. </p>", "totalTime": "", "recipeYield": "Serves: 4 to 6 as a side", "recipeIngredient": ["1/3 cup uncooked white rice, long-grain is suggested but use whatever you prefer", "5 tablespoons olive oil", "1 1/2 pounds zucchini (about 3 medium), sliced 1/4-inch thick", "1/2 pound plum tomatoes, sliced 1/4-inch thick", "Table salt and freshly ground black pepper", "1 medium onion, halved lengthwise and thinly sliced", "3 garlic cloves, minced", "2 large eggs, lightly beaten", "1 teaspoon chopped fresh thyme leaves", "1/2 cup grated Parmesan, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/3 cup uncooked white rice, long-grain is suggested but use whatever you prefer<br/>\n5 tablespoons olive oil<br/>\n1 1/2 pounds zucchini (about 3 medium), sliced 1/4-inch thick<br/>\n1/2 pound plum tomatoes, sliced 1/4-inch thick<br/>\nTable salt and freshly ground black pepper<br/>\n1 medium onion, halved lengthwise and thinly sliced<br/>\n3 garlic cloves, minced<br/>\n2 large eggs, lightly beaten<br/>\n1 teaspoon chopped fresh thyme leaves<br/>\n1/2 cup grated Parmesan, divided</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 450°F. Cook the rice according to your favorite method. The package directions work in some cases, but check my notes above about adjustments I find I have to make. If you cook the rice in a large, wide-ish covered skillet, it might cook even faster but you’ll have the chance to use it again (and save on dirty dishes) when you need to cook the onions in a bit.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While rice cooks, coat two large (or, if you have the same pitifully small oven as I do, three smaller) baking sheets each with a tablespoon of a of olive oil (a bit less for smaller pans). Spread zucchini and tomato slices on the baking sheets in as close to a single layer as you can. Sprinkle with 1/2 teaspoon salt and a few grinds of black pepper. Roast tomatoes for 10 minutes and zucchini for 20. Flip zucchini halfway through; it’s not worth the messy effort for the tomatoes. Leave oven on.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat large, heavy skillet (such as the one you used to cook your rice) over medium heat. Once hot, add 2 tablespoons olive oil, heat oil, then add onions, garlic and 1/4 teaspoon salt to pan. Cover and reduce heat to low, cooking onion until limp and tender, about 15 to 20 minutes. Stir occasionally.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine onion mixture, rice, eggs, thyme, half of your grated cheese and a half-tablespoon of olive oil in a bowl. Add a good amount of freshly ground black pepper. Use the remaining half-tablespoon of olive oil to coat a shallow 2-quart baking dish. Spread half of rice mixture in bottom of dish. Arrange half of roasted zucchini on top. Spread remaining rice mixture over it and please don’t worry about being neat about this; dinner will be “rustic” tonight! Arrange remaining zucchini on top, then tomato slices. Sprinkle with remaining grated cheese and bake until set and golden brown, about 20 minutes. Each oven varies, but I find mine does the very best browning when the dish is on a rack near the top of the oven.</p>"}], "link": "https://smittenkitchen.com/2012/07-zucchini-tomato-and-rice-gratin"}