{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/07/flag-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "blueberries, cake, photo, raspberries, summer", "name": "Flag Cake", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>If you have access to white raspberries, you can use them for the “white” stripes instead of powdering the raspberries. You could also use them to make “stars” in the blueberry portion. </p><p>If you wash your berries — I tend to just look them over for dirt, and then decide if they need an extra rinse — make sure to get them very dry. You’ll want them to be fully dry on the outside or the powdered sugar won’t stay on top. (That said, even the ones I had that were slightly more damp, still kept their white appearance, even with more pink popping through, so don’t drive yourself bonkers trying to keep berries dry.)</p>", "totalTime": "", "recipeYield": "I like to serve (and carry) this cake in the pan, rustic style, so I let it cool completely in there. If you’d like to unmold it to serve on a different platter, let it cool on the rack for 15 minutes, before flipping it over onto another rack, removing the parchment paper, and flipping it back onto a serving platter. The frosting amount suggested is just for the top of the cake, but it’s a generous layer, so if you’d like to frost the sides, you can use the same amount and it will be thinner all around, or you can increase the frosting volume by half and cover the sides evenly. You may also unmold the cake and still only frost the top, leaving the sides bare.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Cake</u>", "2 sticks (1 cup, 1/2 pound or 225 grams) unsalted butter, softened", "2 cups (400 grams) sugar", "4 large eggs, at room temperature", "2 teaspoons (10 ml) pure vanilla extract", "4 cups (465 grams) cake flour ", "<i>or</i>", " 3 2/3 cups (460 grams) all-purpose flour plus 1/3 cup (45 grams) cornstarch", "2 teaspoons (10 grams) baking powder", "1 teaspoon (5 grams) baking soda", "1 teaspoon (6 grams) table salt", "2 cups buttermilk (475 ml), well-shaken", "RECIPE_SUBHED__2<u>Frosting</u>", "8-ounce (225 gram) block cream cheese, at room temperature", "1/2 cup (1 stick or 1/4 pound) butter, at room temperature", "1 teaspoon (5 ml) vanilla extract", "2 to 3 cups (240 to 360 grams) powdered sugar", "RECIPE_SUBHED__3<u>Decoration</u>", "Powdered sugar", "1 cup blueberries (1/2 pint, about 170 grams), very dry", "3 cups raspberries (1 1/2 pints, about 360 grams), very dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Decoration</u><br/>\nPowdered sugar<br/>\n1 cup blueberries (1/2 pint, about 170 grams), very dry<br/>\n3 cups raspberries (1 1/2 pints, about 360 grams), very dry</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make cake:</u> Preheat oven to 350°F. Butter a 9×13-inch baking pan and line the bottom with a rectangle of parchment paper, then butter parchment. (Or, you can use a nonstick cooking spray instead of butter for speed and ease.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat butter and sugar together in the bottom of a large bowl with an electric mixer until light and fluffy, at least 3 minutes. Add eggs, one at a time, scraping down the bowl between each addition. Add vanilla extract. Place flour, cornstarch (if using), baking powder, baking soda and table salt in a sifter or fine-mesh strainer and shake half of mixture into mixing bowl. (If this makes a huge mess, you can also do so onto a piece of waxed paper and use that to dump it into the mixing bowl.) Mix until just combined. Add buttermilk and stir it in slowly, because it will splash easily. The mixture might look curdled, but it will come together just fine in a moment. Add remaining dry ingredients and mix until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour batter in prepared pan and smooth top. Bake until golden and a wooden pick inserted in center of cake comes out clean, [updated!] <s>30 to 35 minutes</s> my initial notes said 35 minutes baking time, but early testers report it took 45 to 50, which, frankly, sounds a little closer to what I’d expect. Please, check at 35 and if the cake is quite battery still, come back in 10 minutes to check again. Don’t remove the cake until a tester inserted into the center comes out clean. Once it does, transfer the cake to a rack to cool completely. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make frosting</u> Beat cream cheese and butter together until light and very fluffy, scraping down the sides to make sure no pesky cream cheese is left unmixed. Add the vanilla. Add the first cup of powdered sugar, and beat it until combined. Add the second. I prefer my cream cheese frostings less sweet, so I stopped there. Because the frosting is just going to be a layer between the berries and cake, it doesn’t need to be terribly stiff, so you can get away with skipping the additional cup of sugar. However, if yours still seems way too soft to use as frosting or not sweet enough, add the third cup of powdered sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If your cake is very domed on top and you’d rather it be flat, you can level it a bit with a small serrated knife. Spread frosting evenly over top of cake. Or not evenly. Nobody will know, which is another reason why this cake is the greatest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Decorate away</u> Place your powdered sugar in a sifter or fine-mesh strainer. If you’ve got an <a href=\"http://www.amazon.com/gp/product/B001713L84/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B001713L84&amp;linkCode=as2&amp;tag=smitten-20&amp;l=as2&amp;o=1&amp;a=B001713L84\">open tea strainer</a>, this is a great time to use it, although it will only hold a spoonful at a time. The short side of the blue rectangle of an American flag – yes, I <a href=\"http://www.usflag.org/flagspecs.html\">looked this up</a>, and yes, I need a hobby — will fall at roughly half the height of the short side of your cake. The long side will fall at a little more than one-third the width of your cake. You can outline this shape with blueberries. Then, dot a few blueberries inside, spaced apart. Coat the inside berries with a dusting of powdered sugar. Then, fill the rest of the space with uncoated blueberries.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>An American flag has 13 stripes total, beginning and ending with a red stripe. Unless you have really tiny berries, you’re not going to fit all of them and nobody, least of you, should care. Eyeball the width your first row of raspberries will take up, and start your second row after that (approximately 1/2 to 2/3-inch down). Continue this pattern of an empty row followed by a row of raspberries the rest of the way down your cake. Coat these rows with a dusting of powdered sugar. Fill the empty rows with uncoated raspberries. Admire your pretty work. Cover pan with lid or foil and refrigerate until needed for your party/picnic/barbecue. </p>"}], "link": "https://smittenkitchen.com/2012/07-flag-cake"}