{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/01/buttermilk-roast-chicken.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "budget, chicken, gluten free, photo, quick", "name": "One year ago:", "author": {"@type": "Organization", "name": " Chocolate Peanut Spread\nTwo years ago: Tomato Sauce with Onion and Butter and Ricotta Muffins\nThree years ago: Mushroom Bourguignon and Smashed Chickpea Salad\nFour years ago: Crunchy Baked Pork Chops, Pickled Carrot Sticks and Amusingly Enough, Fried Chicken\nFive years ago: Artichoke Ravioli with Tomatoes and Leek and Mushroom Quiche"}, "description": "<p>Buttermilk Roast Chicken</p><p>This recipe was inspired by Nigella Lawson’s version. I fiddled a lot, changing the spices and sweetener, though my biggest changes were to increase the salt, garlic and marinating time. If you wish to use Kosher salt instead of table salt use 2 tablespoons if using Diamond kosher salt and 1 1/4 tablespoons if using Morton kosher.  (Here’s why). I imagine that going forward I’ll be using this technque as a springboard for a lot of different recipes and spice combinations. However, even when using the simplest recipe below, the chicken was unbelievably tender and flavorful.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 cups buttermilk", "5 garlic cloves, peeled and smashed", "1 tablespoon table salt", "1 tablespoon granulated sugar", "1 1/2 teaspoons paprika, plus extra for sprinkling (I used Hungarian, a smoked one would also be delicious)", "Lots of freshly ground black pepper", "2 1/2 to 3 pounds chicken parts (we used all legs)", "Drizzle of olive oil", "Flaked or coarse sea salt, to finish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups buttermilk<br/>\n5 garlic cloves, peeled and smashed<br/>\n1 tablespoon table salt<br/>\n1 tablespoon granulated sugar<br/>\n1 1/2 teaspoons paprika, plus extra for sprinkling (I used Hungarian, a smoked one would also be delicious)<br/>\nLots of freshly ground black pepper<br/>\n2 1/2 to 3 pounds chicken parts (we used all legs)<br/>\nDrizzle of olive oil<br/>\nFlaked or coarse sea salt, to finish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk buttermilk with garlic, table salt, sugar, paprika and lots of freshly ground black pepper in a bowl. Place chicken parts in a gallon-sized freezer bag (or lidded container) and pour buttermilk brine over them, then swish it around so that all parts are covered. Refrigerate for at least 2 but preferably 24 and up to 48 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>When ready to roast, preheat oven to 425 degrees. Line a baking dish with foil (not absolutely necessary, but Nigella suggested it and I never minded having dish that cleaned up easily). Remove chicken from buttermilk brine and arrange in dish. Drizzle lightly with olive oil, then sprinkle with additional paprika and sea salt to taste. Roast for 30 minutes (for legs; approximately 35 to 40 for breasts), until brown and a bit scorched in spots. Serve immediately. We enjoyed it with wild rice and green beans one night; roasted potatoes and, uh, more green beans another. (Yes, I have <a href=\"https://smittenkitchen.com/2011/02/green-bean-salad-with-pickled-red-onions-and-fried-almonds/\">a habit</a>.)</p>"}], "link": "https://smittenkitchen.com/2012/01-buttermilk-roast-chicken"}