{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/03/carrot-cake-pancakes-1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, carrots, pancakes, photo", "name": "Carrot Cake Pancakes", "author": {"@type": "Organization", "name": "\nAdapted, barely, from the Joy the Baker Cookbook"}, "description": "<p>It’s delicious sailing the rest of the way. If you’re of the misconception, as I was, that cream cheese frosting has no place at the breakfast meal, I think this will change your mind: softened cream cheese is beaten with just a fraction of the sugar you’d use in a real frosting, and milk, not cream, is used as a thinning agent. Despite concerted dolloping efforts, we had a bit of extra and should you, as well, I advise you to definitely not try to figure out whether it would taste good on banana bread, or an oatmeal muffin, or a… spoon. Just don’t. It’s a slippery slope.</p><p>The second update is that I start with half the buttermilk these days — 1/2 cup instead of the 1 cup in the original recipe. I find they cook through better. If your pancake batter ends up too stiff for your liking, you can always add a little bit extra before cooking them, as noted.</p>", "totalTime": "", "recipeYield": "About 12 to 16 3- to 4-inch pancakes", "recipeIngredient": ["RECIPE_SUBHED__1<u>Pancakes</u>", "1 cup all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon table salt", "1/2 teaspoon ground cinnamon", "1/2 teaspoon freshly grated nutmeg (I used a smidge less)", "1/8 teaspoon ground ginger", "2 tablespoons chopped walnuts (optional, I skip them)", "2 tablespoons golden raisins (optional, ditto)", "1 large egg", "2 tablespoons packed brown sugar", "1/2 cup buttermilk, plus more if needed (updated, see note)", "1 teaspoon pure vanilla extract", "2 cups finely grated carrots (from about a 3/4 pound bundle whole carrots)", "3 tablespoons butter, for griddle", "RECIPE_SUBHED__2<u>Cream cheese topping</u>", "4 ounces cream cheese, at room temperature", "1/4 cup powdered sugar", "2 to 3 tablespoons milk", "1/2 teaspoon pure vanilla extract", "Dash of ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cream cheese topping</u><br/>\n4 ounces cream cheese, at room temperature<br/>\n1/4 cup powdered sugar<br/>\n2 to 3 tablespoons milk<br/>\n1/2 teaspoon pure vanilla extract<br/>\nDash of ground cinnamon</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a rack in the upper third of your oven and preheat to 200°F. This will keep the pancakes warmed as they’re fried in batches.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the pancakes: In a large bowl, whisk together flour, baking powder, baking soda, salt, cinnamon, nutmeg, ginger and, if using, nuts and raisins. In a small bowl, whisk together the egg, brown sugar, buttermilk and vanilla. Stir in carrots. Stir carrot mixture into dry ingredients, stirring until just incorporated. Let rest for five minutes while you make the cream cheese topping.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make the cream cheese topping: In a small bowl, beat the cream cheese until fluffy and lump-free. Whisk in powdered sugar, two tablespoons milk, vanilla and cinnamon. If you’d like the mixture thinner, add the remaining tablespoon of milk (I did not).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over medium heat, melt 1 tablespoon butter in a cast-iron skillet or griddle pan. Check your batter; if it seems too thick to you (although I like a thicker batter because it spills less in the pan), add a splash or two of extra buttermilk, as needed. Spoon 2 to 3 tablespoons batter into the hot pan per pancake (to me, this seemed like too little but after experimenting with larger pancakes, I advise you to listen to Joy; it’s nice in small puddles), flipping once, until pancakes are golden on both sides, about 2 minutes per side. Transfer finished pancakes to a serving dish or tray in the oven, to keep warm while you repeat the process with the remaining batter, adding more butter as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve warm with cream cheese topping. </p>"}], "link": "https://smittenkitchen.com/2012/03-carrot-cake-pancakes"}