{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/07/zucchini-bread-pancakes.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, pancakes, photo, summer, vegetarian, zucchini", "name": "Zucchini Bread Pancakes", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>The awesomest topping you could make for these pancakes is the lightly sweetened one in the Carrot Cake Pancakes. They’re also good with syrup, maple or golden, or honey. However, I used this muddled thing I do when I feel like I should be putting something healthy on top of my pancakes but really just want maple syrup, which is a mixture of 1 tablespoon maple syrup to 3 tablespoons plain Greek yogurt. Everyone wins, right?</p><p>I keep the sugar level really low in pancakes because we love a sweet topping on ours, and I love the contrast between unsweetened and sweet in any baked good. If you’re someone who doesn’t like maple syrup or anything sticky or sweet on top of your pancakes (gasp!), you might want another spoonful of sugar inside your pancakes. </p>", "totalTime": "", "recipeYield": "Makes 10 to 12 pancakes", "recipeIngredient": ["2 large eggs", "3 tablespoons olive oil", "2 tablespoons light brown, dark brown or granulated sugar", "1/4 cup buttermilk or 2 tablespoons each of milk and plain yogurt, whisked until smooth", "1/2 teaspoon vanilla extract", "2 cups shredded zucchini (from about 9 ounces whole, or 1 1/2 medium zucchini), heaping cups are fine", "1 cup all-purpose flour (half can seamlessly be swapped with a whole wheat flour)", "1/4 teaspoon table salt", "1 teaspoon baking soda", "1 teaspoon ground cinnamon", "1/8 teaspoon ground or freshly grated nutmeg", "Butter or oil, for coating skillet"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 large eggs<br/>\n3 tablespoons olive oil<br/>\n2 tablespoons light brown, dark brown or granulated sugar<br/>\n1/4 cup buttermilk or 2 tablespoons each of milk and plain yogurt, whisked until smooth<br/>\n1/2 teaspoon vanilla extract<br/>\n2 cups shredded zucchini (from about 9 ounces whole, or 1 1/2 medium zucchini), heaping cups are fine<br/>\n1 cup all-purpose flour (half can seamlessly be swapped with a whole wheat flour)<br/>\n1/4 teaspoon table salt<br/>\n1 teaspoon baking soda<br/>\n1 teaspoon ground cinnamon<br/>\n1/8 teaspoon ground or freshly grated nutmeg<br/>\nButter or oil, for coating skillet</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine eggs, olive oil, sugar, buttermilk and vanilla until smooth. Stir in zucchini shreds. In a smaller bowl, whisk together flour, salt, baking soda, cinnamon and nutmeg. Stir dry ingredients into zucchini batter, mixing until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 200°F and place a tray — foil-lined if you’re into doing fewer dishes later — on a middle rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large, heavy skillet (my favorite for pancakes is a cast-iron) over medium heat. Once hot, melt a pat of butter in pan and swirl it around until it sizzles. Scoop scant 1/4-cup dollops of batter (mine were about 3 tablespoons each) in pan so the puddles do not touch. Cook until bubbles appear on the surface, about 2 to 3 minutes. Flip pancakes and cook another minute or two, until golden underneath. Transfer pancakes to prepared pan to keep warm as well as ensure that they’re all cooked through when they’re served. Repeat with remaining batter. Serve warm. Repeat next weekend.</p>"}], "link": "https://smittenkitchen.com/2012/07-zucchini-bread-pancakes"}