{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/03/pasta-with-garlicky-broccoli-rabe1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, broccoli rabe, budget, pasta, photo, quick, vegan, vegetarian, weeknight favorite", "name": "Pasta with Garlicky Broccoli Rabe", "author": {"@type": "Organization", "name": "\nAdapted, just a smidge, from Gourmet, September 2006"}, "description": "<p>The original recipe calls for spaghetti, but I prefer short, chunky pastas that are spear-able by toddler forks. I fell for a “toscani” shape, though it also looks like campanelle, “little bells.” I think it looks like pretty, pretty locks of hair.</p>", "totalTime": "", "recipeYield": "So, unless I think the texture of a salt really makes a difference in a dish, I usually default to table salt in my recipes, because it’s cheap and everyone keeps it around (and, better that someone uses a coarse salt for a table salt volume and undersalts a dish than the other, irreversible, way around). But! Not here. Please don’t use table salt. Most table salt is iodized and that iodine can turn your garlic a weird bright blue/green color. It will still be safe to eat but look… disturbing. Trust me, I learned the hard way.", "recipeIngredient": ["1 pound pasta, whatever shape you like (but chunky ones will match up better with the rabe)", "1 pound broccoli rabe, heavy stems removed, remaining stems and leaves cut into 1- to 2-inch sections (I attempt to match my pasta in length)", "1/2 cup olive oil", "5 garlic cloves, peeled and minced or pressed", "1/2 teaspoon red pepper flakes, or more or less to taste", "About 1 heaping teaspoon Kosher salt (or more to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound pasta, whatever shape you like (but chunky ones will match up better with the rabe)<br/>\n1 pound broccoli rabe, heavy stems removed, remaining stems and leaves cut into 1- to 2-inch sections (I attempt to match my pasta in length)<br/>\n1/2 cup olive oil<br/>\n5 garlic cloves, peeled and minced or pressed<br/>\n1/2 teaspoon red pepper flakes, or more or less to taste<br/>\nAbout 1 heaping teaspoon Kosher salt (or more to taste)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve: Grated Parmesan or Romano cheese (omit, of course, if keeping the dish vegan)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a huge pot of salted water to a boil. Add pasta and five minutes before its cooking time is up, add the broccoli rabe. It will seem like too much for the water, but with a stir or two, the rabe should wilt and cook alongside the pasta. Drain rabe and pasta together and pour into serving bowl. In the same pot or a tiny one, heat the olive oil with the garlic, pepper flakes and Kosher salt over moderate heat, stirring frequently for 3 to 4 minutes, or until the garlic becomes lightly golden. Pour mixture over pasta and toss to evenly coat. Shower with freshly grated cheese and eat at once.</p>"}], "link": "https://smittenkitchen.com/2012/04-pasta-with-garlicky-broccoli-rabe"}