{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/09/homemade-wheat-thins.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, snack", "name": "Homemade Wheat Thin Crackers", "author": {"@type": "Organization", "name": "\nAdapted, just barely, from King Arthur Flour Whole Grain Baking"}, "description": "<p>I recommend traditional whole wheat flour for an accurate color but white whole wheat flour for a more delicate texture. I used the regular stuff. The original recipe called for 1/4 teaspoon vanilla extract to be added along with the water, but I don’t associate the vanilla flavor with wheat thins at all (nor did I spot it on the ingredient list). Nevertheless, feel free to add this and/or any other seasonings that you’d like (onion or garlic powder, thyme or rosemary, black pepper, etc.)</p>", "totalTime": "", "recipeYield": "About 3 dozen. I highly suggest doubling this recipe.", "recipeIngredient": ["1 1/4 cups (155 grams) whole wheat flour", "1 1/2 tablespoons (20 grams) sugar", "1/2 teaspoon (3 grams) table salt, plus additional for topping", "1/4 teaspoon paprika", "4 tablespoons (55 grams) unsalted butter, cold is fine, cut into small bits"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4 cups (155 grams) whole wheat flour<br/>\n1 1/2 tablespoons (20 grams) sugar<br/>\n1/2 teaspoon (3 grams) table salt, plus additional for topping<br/>\n1/4 teaspoon paprika<br/>\n4 tablespoons (55 grams) unsalted butter, cold is fine, cut into small bits</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a food processor: Combine the flour, sugar, salt, paprika and butter in a food processor, pulsing the mixture until the butter is evenly disbursed in the crumbs. Drizzle in 1/4 cup (60 ml) cold water with the machine running; run it until the mixture begins to form a ball.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By hand: Combine the flour, sugar, salt, paprika and butter in a medium bowl. Using a pastry blender or your fingertips, work the butter into the mixture until mixture resembles coarse cornmeal. Add 1/4 cup (60 ml) cold water, stir with spoon until combined. Knead once or twice on counter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your oven to 400 degrees. Either lightly grease baking sheets or line them with parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll your dough out, half at a time, to a large, very, <em>very</em> thin rectangle-ish shape on a well-floured counter. Did I mention you should roll them thin? Thinner than you even think necessary is best. Frequently check to make sure your dough isn’t sticking; if it is, gently scrape a spatula underneath to lift it, then flour the counter again. Using a knife or pastry wheel, cut dough into about 1 1/2-inch squares. Dock crackers all over with a toothpick or pointy end of a thermometer. (Technically speaking, I noted a 9-dot docking pattern, like the 9 sides of a pair of dice, on my store-bought Wheat Thins. I highly recommend you do not drive yourself bonkers trying to emulate this.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer crackers to baking sheets, spacing them only a little as they really don’t spread. Sprinkle with additional table salt if you’d like to approximate the salty exteriors of the store-bought crackers. Bake crackers until crisp and bronzed, about 5 to 7 minutes but please keep a close watch on the first batch as thinner crackers (high-five!) will bake faster and thicker ones will take longer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cool in baking pans on racks. Crackers will keep in an airtight container officially for a week but ours are in fact two weeks old and still perfect. You can also freeze them in an airtight container between sheets of waxed paper for a couple months.</p>"}], "link": "https://smittenkitchen.com/2012/09-homemade-wheat-thins"}