{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/12/fromage-fort.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, french, party snacks, photo, quick, snack", "name": "Fromage Fort", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>As I mention above, there are no rules as to how you put this together. Maybe you want more wine, or less. Maybe you want a heavy hand with salt and pepper, or you want the natural flavors of the cheese to shine through. If you’re using a lot of hard cheeses, a pat or two of butter will help smooth things out. Personally, I go easy on the garlic (one tiny clove) because it really blooms as the cheese sits, and I don’t want it to take over, but maybe you would like that. The only thing I think it important to keep in mind is that even a small amount of blue cheese tends to dominate. I used 25% of the weight in blue, and the result was essentially a blue cheese spread. Fortunately, we love them. But if that’s not your thing, limit it to just a small spoonful or a few crumbles. </p><p>If you’re curious, my formula this time was one part each of blue, brie, goat cheese and gruyere, a handful of chives and a full cup of wine.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 pound mix leftover cheese, harder cheeses grated, softer ones cut into chunks", "A couple pats of butter, if using mostly firm cheese varieties", "1 small clove garlic, minced, or more to taste", "1/2 to 1 cup leftover white wine", "1 to 2 tablespoons finely chopped fresh herbs, such as parsley, thyme, rosemary or chives", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound mix leftover cheese, harder cheeses grated, softer ones cut into chunks<br/>\nA couple pats of butter, if using mostly firm cheese varieties<br/>\n1 small clove garlic, minced, or more to taste<br/>\n1/2 to 1 cup leftover white wine<br/>\n1 to 2 tablespoons finely chopped fresh herbs, such as parsley, thyme, rosemary or chives<br/>\nSalt and freshly ground black pepper to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Blend cheese, butter (if using) and garlic in food processer until combined. Drizzle in wine with the motor running until you get your desired consistency — some like it completely smooth, others prefer chunks. Add herbs, pulsing the machine until just combined. Season to taste with salt and pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fromage fort can be used right away, or kept in the fridge until needed. In the fridge, it will thicken and age a little; the flavors will mingle and deepen.</p>"}], "link": "https://smittenkitchen.com/2012/12-fromage-fort"}