{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/08/leek-chard-and-corn-flatbread.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "corn, leeks, photo, picnics, pizza, summer, swiss chard, vegetarian", "name": "Leek, Corn and Chard Flatbread with Goat Cheese", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Should you have a grill at your disposal, I think this would make an unbelievable grilled flatbread. Here’s how: Prepare your filling and set it aside. Roll or stretch out your doughs. Get your grill going at a high temperature and brush the grates with oil. Throw the first raw dough down right on them. After a few minutes, it will be black and blistered underneath. Flip it off the grill, landing it ungrilled (top) side down on a platter. Spread half the filling over it and slide it back on the grill for 5 to 7 minutes with the top down, until charred slightly at the edges. Repeat with remaining filling and dough. Invite me over.</p><p>Because this tends to irk me in other recipes, it’s only fair that I warn you that the toppings will not glue to the flatbread. To do so would require a lot of melty cheese or wetter ingredients and really, this is delightful with neither. You can pick up squares with your hand (but no handsprings, okay?) or eat them with knife and fork. The flavors taste like they were always meant to be together, and if you’re me, you’ll miss it long after you’ve finished your leftovers.</p><p>About 1 1/2 pounds pizza dough (from two of these, or store-bought)</p>", "totalTime": "", "recipeYield": "Makes 2 large (9x13ish inches) flatbreads", "recipeIngredient": ["1 tablespoon vegetable or olive oil", "1 tablespoon unsalted butter", "3 large leeks (about 1 1/2 pounds)", "1 12-ounce bundle chard or about 6 cups (6 ounces) of leaves, cut into 1/2-inch ribbons", "1/2 teaspoon table salt", "Freshly ground black pepper", "1 cup fresh corn kernels (cut from 1 to 2 medium ears corn)", "Cornmeal, for sprinkling baking surface", "4-ounce goat cheese log, cold"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 tablespoon vegetable or olive oil<br/>\n1 tablespoon unsalted butter<br/>\n3 large leeks (about 1 1/2 pounds)<br/>\n1 12-ounce bundle chard or about 6 cups (6 ounces) of leaves, cut into 1/2-inch ribbons<br/>\n1/2 teaspoon table salt<br/>\nFreshly ground black pepper<br/>\n1 cup fresh corn kernels (cut from 1 to 2 medium ears corn)<br/>\nCornmeal, for sprinkling baking surface<br/>\n4-ounce goat cheese log, cold</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the ends off your leeks and halve them lengthwise. Cut them crosswise into 1/2-inch half-rings. Fill a medium bowl with very cold water and drop in sliced leeks. Swish them around with your fingers, letting any sandy dirt fall to the bottom. Scoop out the leeks and drain them briefly on a towel, but no need to get them fully dry. Do the same with your chard ribbons, but you can leave the leaves on towels until they’re nearly fully dry, while you cook the leeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your oven to 450 degrees. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add the leek slices. Reduce heat to low, cover with a lid and cook leek for 10 to 13  minutes, stirring occasionally. Raise heat back to medium, add the chard ribbons and cook until they wilt, about 4 minutes. Season mixture with salt and freshly ground black pepper, adding more if needed. Finally, add your corn kernels, cooking them with the leeks and chard for just another minute.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle two baking sheets with cornmeal. If you have pesky old baking trays like I do, and your breads really like to stick to them, I find things will release more reliably if you first lightly spray them with an oil before sprinkling on the cornmeal. Roll or stretch half your dough into a rectangular-ish shape (flatbreads are prettiest when they’re irregularly shaped, in my humble opinion) and arrange it on the prepared sheet. Spread half the leek-corn-chard mixture on it. Sprinkle it with half the log of goat cheese, crumbled into small bits. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake flatbread in oven for 10 to 15 minutes, until the edges of the bread begin to brown slightly (they might brown more deeply in a better oven than they did in my lousy one). Repeat with remaining dough, filling and goat cheese. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, slide each flatbread onto a cutting board and cut into 8 rectangles. Serve immediately. </p>"}], "link": "https://smittenkitchen.com/2012/08-leek-chard-and-corn-flatbread"}