{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/10/spaghetti-with-broccoli-cream-pesto.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "broccoli, budget, pasta, photo, vegetarian", "name": "Spaghetti with Broccoli Cream Pesto", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Note: The sauce is gluten-free and could be used with a gluten-free pasta.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1/2 pound broccoli", "1/2 pound dried spaghetti", "1 tablespoon unsalted butter", "1 tablespoon olive oil", "1/2 small onion, finely chopped", "1 clove garlic, minced (or, more to taste)", "1/2 teaspoon table salt", "Freshly ground black pepper or pinches of red pepper flakes", "4 tablespoons heavy cream", "A heap of grated parmesan (about 1/2 cup), to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 pound broccoli<br/>\n1/2 pound dried spaghetti<br/>\n1 tablespoon unsalted butter<br/>\n1 tablespoon olive oil<br/>\n1/2 small onion, finely chopped<br/>\n1 clove garlic, minced (or, more to taste)<br/>\n1/2 teaspoon table salt<br/>\nFreshly ground black pepper or pinches of red pepper flakes<br/>\n4 tablespoons heavy cream<br/>\nA heap of grated parmesan (about 1/2 cup), to serve</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of salted water to boil for your pasta. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove broccoli florets from stems and chop into medium florets. Peel stems with a vegetable peeler (I do this so that they cook quickly, plus, I prefer their taste without the tough stem skin.) and slice them into 1/2-inch segments. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use your pot of future pasta water to steam (by suspending a mesh strainer over your pasta pot and covering it with a lid for 5 to 6 minutes)) or par-boil (for 3 to 5 minutes) your broccoli florets and stems until just tender, then drain if needed and set them aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add pasta to water and cook until al dente, or about one minute less than fully cooked. Before draining pasta, reserve a cup of pasta cooking water and set it aside. Drain pasta. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wipe out pot so that you can use it again. In the bottom of pot, melt butter and olive oil together over medium heat. Add onion and reduce to medium-low, sauteing it until tender, about 7 minutes. Add garlic and cook for another two minutes. Add steamed broccoli, salt and red or black pepper and turn the heat back up to medium-high, cooking it with the onion and garlic for a few additional minutes. Pour cream over mixture and let cook for 30 seconds.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer broccoli mixture and all of its creamy bits at the bottom of the pan to a blender or food processor and blend in short bursts until it’s finely chopped and a little sauce. Don’t worry if it looks dry; that reserved pasta water will give it  the sauciness it needs in a minute. (Theoretically, one could also use an immersion blender here inside their pot to make the broccoli sauce, but it might be a bit messy with all of the chunks and small bits.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add the broccoli sauce back to the pot with the drained spaghetti and a splash or two of the reserved pasta water. Cook over medium-high for 1 to 2 minutes, tossing the mixture so that it evenly coats. Add more pasta water as needed to loosen the sauce. Adjust seasonings to taste, adding more salt or pepper, and scoop into a serving bowl. Shower spaghetti with grated parmesan and dig in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Do ahead:</i> I make a large batch of the sauce and keep it in the fridge for several days, boiling a little pasta each day for lunch when I make it for Jacob. </p>"}], "link": "https://smittenkitchen.com/2012/10-spaghetti-with-broccoli-cream-pesto"}