{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/01/potato-chip-cookies.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, photo", "name": "Potato Chip Cookies", "author": {"@type": "Organization", "name": "\nAdapted from Emeril"}, "description": "<p>Shockingly, we actually felt that these cookies needed more salt; just a smidge. Sounds crazy, right? If you’re using an extra-salty brand of potato chips, you might not find this necessary but I used Cape Cod, which is pretty salty, and felt that the salt in a crushed half cup was insufficient in the cookie batter. </p><p>I’ve included two “finish” options — one is the potato-and-sea-salt flakes you see on my cookies and the other is the chocolate dip I wished I had time for. I was thinking of these as an either/or finish, but I see no reason why both cannot be use. That said, I’m pretty sure the chocolate would steal the show.</p><p>Remaining weights to come! (I left my notes at home and am away this weekend.)</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["RECIPE_SUBHED__1<u>Cookie</u>", "1 cup (2 sticks or 225 grams) unsalted butter, at room temperature", "1 cup (200 grams) granulated sugar, divided", "1 teaspoon pure vanilla extract", "1/4 teaspoon table salt (optional, see note above)", "1/2 cup chopped and toasted pecans", "1/2 cup finely crushed potato chips", "2 cups (250 grams) all-purpose flour", "RECIPE_SUBHED__2<u>Potato chip salt finish (optional)</u>", "1 tablespoon crushed potato chips", "1 1/2 teaspoons flaked sea salt", "RECIPE_SUBHED__3<u>Chocolate dip finish (optional)</u>", "4 ounces (115 grams) semi- or bittersweet chocolate, finely chopped", "1 teaspoon butter, canola oil or vegetable shortening"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Chocolate dip finish (optional)</u><br/>\n4 ounces (115 grams) semi- or bittersweet chocolate, finely chopped<br/>\n1 teaspoon butter, canola oil or vegetable shortening</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat your oven to 350 degrees F. Line two baking sheets with parchment paper and set aside. In a large bowl, cream together the butter with 1/2 cup of the sugar until lightly and fluffy. Mix in the vanilla and table salt, if using, until smooth. Add the pecans, 1/2 cup crushed potato chips and flour together and mix until just combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the remaining 1/2 cup sugar in a small bowl. Scoop a tablespoon-sized mound of dough and form it into a small ball with the palms of your hands. Roll the ball in the remaining sugar until coated. Place on prepared baking sheet and using the bottom of a drinking glass (or, in my case, <a href=\"http://www.amazon.com/gp/product/B0000DZCJ7/ref=as_li_ss_tl?ie=UTF8&amp;tag=smitten-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0000DZCJ7\">a kitchen tool</a> I’m unhealthily obsessed with) to slightly flatten the cookies. Cookies only need to be an inch apart; they only spread a little. Sprinkle with a few flakes of the potato chip salt, if using. Repeat with remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake cookies until lightly golden at the edges, about 15 minutes. Transfer to cool on a wire rack.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If dipping in chocolate, melt chocolate with butter, oil or shortening in a double boiler or in short bursts in the microwave. Stir until smooth. Dip half of each fully cooled cookie in the chocolate, and let dry and harden on a wire rack. </p>"}], "link": "https://smittenkitchen.com/2012/01-potato-chip-cookies"}