{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/03/potato-knish-two-ways.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "jewish, kale, leeks, photo, potatoes, savory projects, vegetarian, winter", "name": "Classic Potato Knish", "author": {"@type": "Organization", "name": "\nDough and technique adapted, just barely, from Joe Pastry"}, "description": "<p>What took so long for me to make these? I was scared, people. The recipes I found online were few and far between and looked… dubious. It was until I met Joe Pastry (and by “met” I mean, became obsessed with his site and I’m sorry, but do you bake? Because if you do, you’d be crazy not to read his entire archives, right this very minute) and gazed at his crystal-clear step-by-step photos that I knew I could not only pull them off at home but that I had to use his recipe. Once again, Joe did not fail. </p><p>This dough is excellent, not only because it produces the soft, flaky dough that are the epitome of the knish experience, but because once it comes together (quickly), it can be used now or later, up to three days later, kept refrigerated. The dough can be used to make the classic Russet-and-caramelized-onions filling here, or the non-traditional Red Potato, Leek and Kale one below. </p><p>Updated 3/17 to increase the amount of water from 1/4 cup to 1/2 cup. Joe’s original recipe calls for 1/2 cup but, strangely, I found I only needed 1/4 cup. Based on responses from commenters, it sounds like most people needed the higher amount.</p>", "totalTime": "", "recipeYield": "6 3-inch hearty knish, though you can make them any size you please (larger for Yonah Schimmel-style, smaller if you, like most people, cannot eat more than half of one)", "recipeIngredient": ["RECIPE_SUBHED__1<u>Dough</u>", "2 1/2 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon table salt", "1 large egg", "1/2 cup vegetable oil (Joe also recommends schmaltz, or rendered chicken fat, if you’ve got some)", "1 teaspoon white vinegar", "1/2 cup water (see Update, above)", "RECIPE_SUBHED__2<u>Filling</u>", "1 1/2 pounds (about 3 medium) russet potatoes, peeled and quartered", "1 small yellow onion, peeled and diced small", "1 tablespoon vegetable or olive oil", "1 tablespoon unsalted butter", "1/2 teaspoon table salt", "Freshly ground black pepper", "RECIPE_SUBHED__3<u>To finish</u>", "1 large egg yolk", "1 teaspoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To finish</u><br/>\n1 large egg yolk<br/>\n1 teaspoon water</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Make dough:</em> Stir together your dry ingredients in the bottom of a medium/large bowl. In a small bowl, whisk together the egg, oil, vinegar and water. Pour it over the dry ingredients and stir them to combine. Once the mixture is a craggy, uneven mass, knead it until smooth, about a minute. Place the dough back in the bowl and cover it with plastic wrap. Set it aside for an hour (or in the fridge, up to 3 days) until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Meanwhile, prepare filling:</em> Put potatoes into a large pot, cover with cold water, and bring to a boil over high heat. Reduce heat to medium and cook until potatoes can be pierced easily with a knife, about 20 minutes. Drain, then transfer to a large bowl to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add onions and reduce to medium-low. Cook, stirring frequently, until deeply caramelized, which will take about 45 minutes. Can you do this in less time? Of course. But the flavor won’t be as intense. Transfer to bowl with potatoes and mash together until almost smooth. (A few lumps make it taste more “traditional,” IMHO.) Stir in salt and many grinds of black pepper and set the filling aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Assemble knish:</em> Line a large baking sheet with parchment paper and preheat your oven to 375 degrees. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If your dough has sweated some beads of oil while it rested, fear not, you can just knead it back into an even mass. Divide the dough in half. On a well-floured surface, roll the first half of the dough into a very thin sheet, roughly in the shape of a 1-foot square, but really, no need to be rigid about it. For moderate size knish (smaller than the traditional “doorstops” but still hefty, about 3 inches across), create a 2-inch thick log from half your potato filling across the bottom of your dough. Roll the filling up in the dough like you were rolling a cigarette (which, of course, we would <i>never</i>), but not too tight. A tiny amount of slack will keep the dough from opening in the oven. Keep rolling until the log has been wrapped twice in dough. Trim any unrolled length and add it to the second half of the dough; it can be used again. Repeat the process with the second half of your dough and second half of filling; you might have a small amount of dough leftover.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim the ends of the dough so that they’re even with the potato filling. Then, make indentations on the log every 3 to 3 1/2 inches (you’ll have about 3, if your log was 1 foot long) and twist the dough at these points, as if you were making sausage links. Snip the dough at each twist, then pinch one of the ends of each segment together to form a sealed knish base.  Use the palm of your hand to flatten the knish a bit into a squat shape and from here, you can take one of two approaches to the top: You can pinch together the tops as you did the bottom to seal them; indenting them with a small dimple will help keep them from opening in the oven. You can gently press the dough over the filling but leave it mostly open, like the knish you would get on Houston Street. Or, you can half-ass it (okay, that’s a third option, and watch your language, Deb), like I did, closing them but not sealing them well because you are indecisive. But why would you want to do a thing like that?</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Bake knish:</em> Arrange knish on prepared baking sheet so that they don’t touch. Whisk egg yolk and water together to form a glaze and brush it over the knish dough. Bake knish for about 45 minutes, rotating your tray if needed for them to bake into an even golden brown color. I have burnt my mouth on every knish I have ever taken a bite of because that potato filling, it packs heat. Don’t do as I always do and let them cool a little bit before digging in. Spicy mustard is a traditional accompaniment, but I like a dollop of sour cream too. I won’t tell if you don’t.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Red Potato Knish with Kale, Leeks and Cream Cheese</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Follow the dough and assembly directions above, but replace the Russet and caramelized onion filling with this one. You might never go back to tradition once you do.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 pounds medium red potato (about 3 to 4), peeled and quartered<br/>\n1 big leek (about 1/2 pound), white and light-green parts only, halved lengthwise, and thinly sliced (you’ll clean the grit out in a moment)<br/>\n1 tablespoon vegetable or olive oil<br/>\n1 tablespoon unsalted butter<br/>\n1 generous cup lacinato kale ribbons (about 3 ounces or 1/4 to 1/3 bundle), tough stems and ribs removed and leaves cut into strips  (you’ll wash it in a moment)<br/>\n1/2 teaspoon table salt<br/>\nFreshly ground black pepper<br/>\n3 ounces cream cheese, at room temperature </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Cook potatoes:</em> Put potatoes into a large pot, cover with cold water, and bring to a boil over high heat. Reduce heat to medium and cook until soft, about 20 to 25 minutes. Drain, then transfer to a large bowl to cool. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Meanwhile, prepare leeks and kale:</em> Fill a medium bowl with very cold water and drop in leek rings. Swish them around with your fingers, letting any sandy dirt fall to the bottom. Scoop out the leeks and drain them briefly on a towel, but no need to get them fully dry. Do the same with the kale, but you can leave the leaves to nearly fully dry, patting them if necessary, on the towels while you cook the leeks.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large, heavy skillet over medium heat. Once hot, add butter and oil and once they’re fully melted and a bit sizzly, add the leek slices. Reduce heat to low, cover with a lid and cook leek for 20 minutes, stirring occasionally. Raise heat back to medium, add the kale ribbons and cook until they wilt, about 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer mixture to bowl with potatoes, add the cream cheese and mash together until combined. Stir in salt and many grinds of black pepper and set filling aside. </p>"}], "link": "https://smittenkitchen.com/2012/03-potato-knish-two-ways"}