{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/12/cashew-butter-balls.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, photo", "name": "Cashew Butter Balls", "author": {"@type": "Organization", "name": "\nInspired by the Tasting Table Test Kitchens"}, "description": "<p>It was one of my favorite food newsletters that put the idea of a cashew spin on one of my favorite cookies into my head last winter, however, in the end, I preferred my go-to formula (with slightly less nuts and slightly more flour) to theirs as mine crumbles less. I also nixed the nutmeg, added some vanilla and replaced the granulated sugar with powdered sugar, but kept the name because I love it too much to part with it. I also give a flaky salt option, because I think a faint crunch of salt contrasts wonderfully with sweet cashews. </p><p>If you’d like to make the recipe as TT suggests, use 1/4 cup more cashews and 1/4 cup less flour and only move them from tray to sugar to cooling rack with the gentleness of feathers. Once they cool, they’ll firm up enough that they’re less fragile, although I still wouldn’t recommend them for shipping. Nope, you’ll have to keep them for yourself.</p>", "totalTime": "", "recipeYield": "Makes about 40 cookies", "recipeIngredient": ["1 cup (145 grams) raw cashews", "2 cups (250 grams) all-purpose flour", "1/4 teaspoon table salt, or a heaped 1/4 teaspoon sea salt flakes", "1 cup (2 sticks or 230 grams) unsalted butter, softened slightly, cut into chunks", "2 cups (240 grams) powdered sugar", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup (145 grams) raw cashews<br/>\n2 cups (250 grams) all-purpose flour<br/>\n1/4 teaspoon table salt, or a heaped 1/4 teaspoon sea salt flakes<br/>\n1 cup (2 sticks or 230 grams) unsalted butter, softened slightly, cut into chunks<br/>\n2 cups (240 grams) powdered sugar<br/>\n1/2 teaspoon vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350°F and toast cashews in a single layer until a shade darker, about 10 to 12 minutes. About halfway through the toasting time, toss the nuts around to redistribute them for even coloring. Let cool completely. You can hasten this along by transferring them to the freezer for a few minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place cooled cashews, flour and salt in the workbowl of a food processor. Clear the kitchen of toddlers and others sensitive to loud noises, then grind the mixture to a fine powder. Pour mixture into a bowl and set aside briefly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add butter and *only* 1/2 cup of the powdered sugar to the empty food processor and run the machine until the mixture is creamy and combined. Add the vanilla and mix. Add the nut-flour mixture and pulse the machine until it is just combined. Scrape the soft cookie dough back into the bowl that held the nut-flour mixture, cover it with plastic wrap, and refrigerate it until firm, about an hour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Do ahead: You can chill it in the fridge for up to 2 days, or in the freezer for longer.] </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your oven back to 300°F. Place remaining 1 1/2 cups powdered sugar in a wide bowl. Using your hands, scoop tablespoon-sized (about 1-inch round) balls of the chilled cookie dough into your palms and quickly roll them into little balls. Place them evenly on a parchment-lined baking sheet an inch apart. Bake 20 to 25 minutes, until they feel dry on the outside, but still quite soft. (Don’t fret!) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool on sheets for a few minutes, then gently roll the hot cookies in the powdered sugar before transferring them to racks to cool completely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cookies keep in an airtight container for at least a week, probably two, though never at my place. They can be frozen for as long as you trust your freezer. They occasionally benefit from a fresh coating of powdered sugar before serving.</p>"}], "link": "https://smittenkitchen.com/2012/12-cashew-butter-balls"}