{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/03/multigrain-apple-crisps.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apple, coconut, crumbles crisps, fruit, photo", "name": "Multigrain Apple Crisps", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>As for the whole wheat flour, you could also use whole wheat pastry flour here or white whole wheat flour (as I did in one of my test rounds). You can also replace half the flour with the same amount of any pet flour you have. Yes, I said “pet” flour — I mean, whatever you’re currently obsessed with. I used 1/4 cup of barley flour in one batch, which is my current pet, as it’s silky and delightful in baked goods. I don’t think rye flour would be half-bad there either. </p><p>It’s not just the flour that you can fiddle with; coconut oil (also good for this toddler-bait) would be delicious in place of the olive oil; you could brown the butter when you melt it for extra flavor. Almonds could be replaced with any nut, etc. Have fun with it. Make it yours. </p>", "totalTime": "", "recipeYield": "Makes 8 small crisps", "recipeIngredient": ["4 large or 5 small-medium apples (about 2 pounds)", "1 tablespoon cornstarch", "3 tablespoons plus 1/4 cup raw or Turbinado (often sold as Sugar in the Raw) sugar", "1/4 cup plus 3/4 cup rolled oats", "1/4 cup sliced or slivered almonds", "1/2 cup whole wheat flour (or a mix; see Note up top)", "1/4 cup light or dark brown sugar", "1/4 teaspoon ground cinnamon", "Two pinches sea salt", "1/2 teaspoon baking powder", "2 tablespoons unsalted butter", "1/4 cup olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 large or 5 small-medium apples (about 2 pounds)<br/>\n1 tablespoon cornstarch<br/>\n3 tablespoons plus 1/4 cup raw or Turbinado (often sold as Sugar in the Raw) sugar<br/>\n1/4 cup plus 3/4 cup rolled oats<br/>\n1/4 cup sliced or slivered almonds<br/>\n1/2 cup whole wheat flour (or a mix; see Note up top)<br/>\n1/4 cup light or dark brown sugar<br/>\n1/4 teaspoon ground cinnamon<br/>\nTwo pinches sea salt<br/>\n1/2 teaspoon baking powder<br/>\n2 tablespoons unsalted butter<br/>\n1/4 cup olive oil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Preheat oven to 350 degrees. Arrange eight 6-ounce ramekins (<a href=\"http://www.crateandbarrel.com/kitchen-and-food/individual-bakeware/stockholm-ramekin/s320676\">these</a> are my favorite) on a baking tray. Peel, halve and core apples, then chop them into a small (about 1/2-inch) dice. The smaller the pieces, the faster the crisps will bake and the less they’ll “deflate” as they cool. Toss apples with 1 tablespoon cornstarch and 3 tablespoons raw sugar until evenly coated, then divide apples between ramekins.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Grind 1/4 cup oats with almonds in a food processor until powdery. (If you have both almond meal and oat flour, you can replace this with 1/4 cup of each.) In a medium bowl, mix oat/almond mixture with remaining rolled oats, wheat flour, remaining 1/4 cup raw sugar, brown sugar, cinnamon, sea salt and baking powder. Melt butter in a small saucepan (or in microwave), then stir in olive oil. Pour mixture over dry ingredients and stir until crumbly. Divide crumbs over each dish of apples, packing them on with your palms if needed to get them all on (don’t worry, the apples will deflate a bit when they bake). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake apple crisps for about 30 to 40 minutes, or until you can see the juices from the apples bubbling around the crumbs. If tops brown too quickly, put a sheet of foil over the whole tray for remaining baking time. Let cool on rack and serve when lukewarm. Store remaining crisps in fridge. They are quite excellent with a dollop of plain yogurt.</p>"}], "link": "https://smittenkitchen.com/2012/03-multigrain-apple-crisps"}