{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/10/pumpkin-cinnamon-rolls.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, fall, photo, pumpkin, thanksgiving", "name": "Pumpkin Cinnamon Rolls", "author": {"@type": "Organization", "name": "\nAdapted from Baked Elements"}, "description": "<p>The result is definitely a sweet bun. If you’re more sugar cautious, you could definitely dial back the dough’s and filling’s sugar by 1/4 cup. Then again, these are pumpkin cinnamon rolls, so maybe a little extra indulgence is in order.</p><p>These are a great thing to make ahead of time. You could assemble them tonight, let them rise in the fridge and finish on the counter in the morning (I instruct when, below) and bake them before you head out for whatever harvest festival/hayride/fall bliss you’ve got lined up this weekend.</p><p>Want to make your own pumpkin puree? Here’s how!</p>", "totalTime": "", "recipeYield": "16 to 18 buns", "recipeIngredient": ["RECIPE_SUBHED__1<u>Dough</u>", "6 tablespoons (85 grams) unsalted butter, to be divided", "1/2 cup (120 ml) whole milk, warmed (but not over 116 degrees)", "2 1/4 teaspoons active dry yeast (from 1 .25-ounce or 7 gram envelope yeast)", "3 1/2 cups (440 grams) all-purpose flour, plus extra for rolling out", "1/4 cup (packed) (50 grams) light or dark brown sugar", "1/4 cup (50 grams) granulated sugar", "1 teaspoon (6 grams) table salt", "1/2 teaspoon ground cinnamon", "1/4 teaspoon freshly grated nutmeg", "1/8 teaspoon ground cardamom (optional)", "1/4 teaspoon ground ginger", "2/3 cups (160 grams) pumpkin puree, canned or ", "<a href=\"https://smittenkitchen.com/tips/2012/10/05/how-to-make-your-own-pumpkin-puree/\">homemade</a>", "1 large egg", "Oil for coating rising bowl", "RECIPE_SUBHED__2<u>Filling</u>", "3/4 cup (packed, 145 grams) light or dark brown sugar", "1/4 cup (50 grams) granulated sugar", "1/8 teaspoon table salt", "2 teaspoons (5 grams) ground cinnamon", "RECIPE_SUBHED__3<u>Glaze</u>", "4 ounces (115 grams) cream cheese, softened", "2 tablespoons (30 ml) milk or buttermilk", "2 cups (240 grams) powdered sugar, sifted", "Few drops vanilla extract (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Glaze</u><br/>\n4 ounces (115 grams) cream cheese, softened<br/>\n2 tablespoons (30 ml) milk or buttermilk<br/>\n2 cups (240 grams) powdered sugar, sifted<br/>\nFew drops vanilla extract (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make your dough:</u> Melt your butter, and hey, if you’re melting it in a little saucepan, you might as well brown it for extra flavor. Once the butter has melted, keep cooking it over medium heat for a few additional minutes. It will become hissy and sizzle a lot, then take on a nutty flavor as golden bits form at the bottom of the pot. Remove from heat and set aside to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine your warmed milk and yeast in a small bowl and set aside. After five to seven minutes, it should be a bit foamy. If it’s not, you might have some bad yeast and should start again with a newer packet.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bottom of the bowl of an electric mixer combine flour, sugars, salt and spices. Add just 1/4 cup (or two-thirds of; leave the rest for assembly) of your melted/browned butter and stir to combine. Add yeast-milk mixture, pumpkin and egg and mix combined. Switch mixer to a dough hook and run it for 5 minutes on low.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape mixture into a large oiled bowl and cover with plastic wrap. Set aside for 1 hour in a draft-free place; it should just about double.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While it is rising, line the bottom of two 9-inch round cake pans (8-inch round should work too, as does an 8-inch square) with parchment paper and butter the sides of the pan and the paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble buns:</u> Scoop dough onto a very well floured surface and flour the top of it well. With a rolling pin, roll the dough to an approximately 16×11-inch rectangle. Brush reserved melted/browned butter over dough. Stir together remaining filling ingredients and sprinkle mixture evenly over dough. Starting on a longer side, roll the dough into a tight spiral. It’s going to make a mess because the dough is crazy soft and some stuff spills off the ends; don’t sweat it. It will all be delicious in the end.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Here’s how to cut cinnamon rolls without squishing their pretty spirals: With a sharp serrated knife, using absolutely no pressure whatsoever (only the weight of the blade should land on the dough) gently saw your log with a back-forth motion into approximately 1-inch sections. When a soft dough like this is rolled, it tends to grow longer, which means that you’ll have the option to either make more buns (say, 18 instead of 16) or just cut them a little larger (in generous inches).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide buns between two prepared pans. You can sprinkle any sugar that fell off onto the counter over them. Cover each pan with plastic wrap and let rise for another 45 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’re doing this ahead of time, you can now put them in the fridge overnight. In the morning, leave them out for an hour to warm up and finish rising.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>15 minutes before you’re ready to bake them, heat the oven to 350°F. Meanwhile, you can make the glaze. Beat your cream cheese until it is light and fluffy. Add powdered sugar and vanilla. Drizzle in milk until you get the consistency you’re looking for, either thick enough to ice or thin enough to drizzle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Finish your buns:</u> Remove the plastic and bake buns for 25 minutes, until puffed and golden and the aroma <s>brings all the boys to your yard</s> is like a snickerdoodle. Transfer pans to wire cooling racks and drizzle/schmear with cream cheese glaze, then have at them.</p>"}], "link": "https://smittenkitchen.com/2012/10-pumpkin-cinnamon-rolls"}