{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2012/05/vidalia-onion-soup-with-wild-rice-and-blue-cheese.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "easter, grain, onion, pantry, photo, soup, spring, vegetarian", "name": "Vidalia Onion Soup with Wild Rice and Blue Cheese", "author": {"@type": "Organization", "name": "\nAdapted, just a little, from Charlie Trotter via The New York Times"}, "description": "<p>* Thankfully, Vidalias don’t require a trip to Georgia to buy (though, were it in my power, I’d be there in a heartbeat) as they’re fairly widely distributed; nevertheless, if you can’t get them at your grocery store (I found them at Whole Foods this time), I find that (Georgia-folk, please cover your ears) Spanish, Texas 1015s, Walla Walla and other sweet varieties of onion are adequate substitutes.</p><p>Due to the mild flavor of this soup, if you’ve got good, homemade stock stashed away, this is a great time to defrost it. </p><p>Trotter calls for an herb bundle in this soup that’s roughly 3/4 cup of your favorite fresh herbs, chopped. (He calls for 3 tablespoons chopped chives, basil, flat-leaf parsley and 4 tablespoons chopped tarragon, though I don’t think you need to be overly rigid in adhering to a formula.) </p>", "totalTime": "", "recipeYield": "Serves 4", "recipeIngredient": ["1/2 cup wild rice, uncooked", "3 tablespoons unsalted butter", "2 1/2 pounds (about 4) Vidalia onions, or other sweet onions, quartered and very thinly sliced", "6 cups chicken or vegetable stock", "Herb bundle (see Note above)", "Salt and pepper", "8 slices baguette", "2 tablespoons extra-virgin olive oil", "4 ounces Maytag or other young, not too sharp, blue cheese, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 cup wild rice, uncooked<br/>\n3 tablespoons unsalted butter<br/>\n2 1/2 pounds (about 4) Vidalia onions, or other sweet onions, quartered and very thinly sliced<br/>\n6 cups chicken or vegetable stock<br/>\nHerb bundle (see Note above)<br/>\nSalt and pepper<br/>\n8 slices baguette<br/>\n2 tablespoons extra-virgin olive oil<br/>\n4 ounces Maytag or other young, not too sharp, blue cheese, at room temperature</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the wild rice in a small saucepan according to package directions. Usually, 2 cups of water is the amount needed for 1/2 cup wild rice. Bring to a boil, reduce heat to a very low simmer and cover the pot. Let it cook, undisturbed, until the rice is tender and the water is absorbed, about 50 to 55 minutes. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt the butter in the bottom of a 4- to 5-quart saucepan or Dutch oven over moderately low heat. Add the onions, toss to coat them in oil and cover the pot. Reduce the heat to real low and let them slowly steep for 15 minutes. They don’t need your attention; you can even check your email, eh, who are we kidding, Facebook.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>After 15 minutes, uncover the pot, raise the heat slightly and season the onions with a bit of salt and pepper. Cook onions, stirring frequently, for another 15 to 25 minutes, until they are tender, limp and sweet. Add the stock and simmer for 20 minutes. Wrap the herbs (see Note up top) in a small piece of cheesecloth and tie with kitchen string. Trotter suggests you drop the bundle into the broth for one minute, then remove it, but after going through such an effort to make one, I decided to leave mine in a little longer; it made me feel better. Adjust seasonings with additional salt and pepper, if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 400 degrees. Brush both sides of the baguette slices with oil. Bake on a baking sheet until light golden brown, 5 to 10 minutes. While the croutons are still warm, spread them with blue cheese.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To serve, divide the rice among four bowls, and ladle broth and onions on top. Float two croutons in the center of each bowl, and sprinkle with more pepper. Eat immediately.</p>"}], "link": "https://smittenkitchen.com/2012/05-vidalia-onion-soup-with-wild-rice"}