{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/09/zucchini-parmesan-crisps.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "party snacks, photo, side dish, snack, summer, summer squash, vegetarian, zucchini", "name": "Zucchini Parmesan Crisps", "author": {"@type": "Organization", "name": "\nAdapted from Ellie Krieger"}, "description": "<p>This doesn’t too closely follow the original recipe because I found I needed thinner chips, more crumbs, more parmesan and sometimes less baking time than recommended. I also found that I could only reliably get “crisp” effect, one that lasted for a while, when I used an egg white instead of an olive oil wash. Please don’t take any of the measurements in this recipe as the law; cooking times and required coating will vary by thickness and baking pan heaviness. You’ll want to keep an eye on them and look for a good golden color before removing from the oven, which will ensure that they get and remain crisp. They’re also best on the first day, so you’re going to have to eat them all. I promise, you won’t mind.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["Olive oil or cooking spray", "2 medium zucchini (about 1 pound total)", "1 to 2 egg whites", "1/2 cup grated parmesan cheese", "1/2 cup plain, dry breadcrumbs, such as panko", "A couple pinches sea salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Olive oil or cooking spray<br/>\n2 medium zucchini (about 1 pound total)<br/>\n1 to 2 egg whites<br/>\n1/2 cup grated parmesan cheese<br/>\n1/2 cup plain, dry breadcrumbs, such as panko<br/>\nA couple pinches sea salt<br/>\nFreshly ground black pepper</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 450 degrees. Coat two baking sheets lightly with cooking spray or thinly with olive oil. Slice zucchini into slightly-less-than 1/4-inch thick rounds; if they feel especially wet, spread them on a towel while you prepare the other ingredients. In a small bowl, lightly beat first egg white with 1 teaspoon water to loosen it. Combine cheese, crumbs, salt and pepper in a separate bowl. Dip each zucchini coin in egg white, letting excess run off before gently dipping them in parmesan mixture. Arrange in single layer on baking sheets. If additional egg white is needed, prepare it the same way, with 1 teaspoon of water. If additional crumb mixture is needed, make a few spoonfuls at a time, matching the volume of crumbs and cheese. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake zucchini rounds until browned and crisp, about 25 to 30 minutes, flipping each over halfway through. Please keep an eye on them; they may need to be moved around on the tray so the ones at the edges don’t bake more quickly than the ones in the center. Take them out only when they’re golden all over and let them cool on the tray on a cooling rack or a plate. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Keep at room temperature until needed. Crisps are best on the first day. </p>"}], "link": "https://smittenkitchen.com/2013/09-zucchini-parmesan-crisps"}