{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/04/spinach-and-smashed-egg-toast.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, eggs, photo, put an egg on it, spinach, vegetarian", "name": "Spinach and Smashed Egg Toast", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I use this spinach method, scaled up, all the time to make a quick, lazy creamed spinach with dinner. (A more classic one is here. An even more gussied one is here.) Creme fraiche could replace the cream (unlike yogurt or sour cream, it doesn’t curdle when heated). </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 large egg", "1 slice of your favorite hearty bread", "2 ounces baby spinach", "1 pat butter", "1 tablespoon minced shallot or white onion", "1 tablespoon heavy cream", "Sea salt and freshly ground black pepper", "1 teaspoon smooth Dijon mustard", "1 tablespoon crumbled cheese, such as goat cheese or feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 large egg<br/>\n1 slice of your favorite hearty bread<br/>\n2 ounces baby spinach<br/>\n1 pat butter<br/>\n1 tablespoon minced shallot or white onion<br/>\n1 tablespoon heavy cream<br/>\nSea salt and freshly ground black pepper<br/>\n1 teaspoon smooth Dijon mustard<br/>\n1 tablespoon crumbled cheese, such as goat cheese or feta</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring small pot of water to boil. Lower egg into it and boil for five (for a runnier egg, as seen in top photo) to six (for a less-runny but still loose egg, as seen in bottom two photos) minutes.* Rinse egg briefly under cool water and set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Wash your spinach but no need to dry it. Put a small puddle of water in the bottom of a skillet and heat it over medium-high. Once the water is simmering, add the spinach and cook it until it is <i>just</i> wilted, and not a moment longer. Transfer it to a colander and press as much of the excess water out with the back of a fork as possible. No need to wring it out here; we’re hoping to those lovely wilted leaves intact. Keep that fork; you’ll use it again in a moment.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put your bread in to toast.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dry your skillet if it is still wet. Heat a pat of butter in it over medium-low heat. Add shallots and cook them for a few minutes, until translucent and a little sweet. Return spinach to skillet and add cream. Simmer them together for one minute, then season with salt and freshly ground black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Put your toast on your plate and spread it thinly with Dijon mustard. Heap the spinach-and-shallot mixture on top, then add the crumbled cheese. Peel your egg; doing so under running water can make this easier. Once peeled, place it on your spinach toast, smash it open with the back of that fork you used a minute ago, and sprinkle it with salt and freshly ground black pepper. Eat immediately.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* When you’re eating a soft-boiled egg right away, six minutes is the way to go. But here, since we boil the egg and then prepare the rest of the toast, it continues to cook and firm up a bit in its shell, so I’ve found that a 5 to 5 1/2 minute egg will give you the equivalent in the end.</p>"}], "link": "https://smittenkitchen.com/2013/04-spinach-and-smashed-egg-toast"}