{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/11/gingerbread-snacking-cake1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "christmas, everyday cakes, photo", "name": "Gingerbread Snacking Cake", "author": {"@type": "Organization", "name": "\nAdapted from Martha Stewart"}, "description": "<p>I suspect it would also make a wonderful layer cake, maybe with eggnog filling and whipped cream for frosting. It can be baked in 1 9×13 pan or 2 9-inch round or 8-inch square pans. I cut it into 32 petite squares.</p>", "totalTime": "", "recipeYield": "This cake may not look like centerpiece material, but it is no less worthy of your full admiration. As written, it makes a maximum intensity (via fresh ginger and a full cup of molasses) gingerbread cake. For a moderate intensity gingerbread cake, skip the fresh ginger (I usually do because I’m a wimp) and swap 1/3 cup of the molasses with honey or golden syrup. If you can’t get molasses, use black treacle syrup.", "recipeIngredient": ["8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, cut into chunks, plus more for pan", "1 cup water", "1 1/2 teaspoons baking soda", "2/3 cup packed dark-brown sugar", "1 cup unsulfured molasses", "1 tablespoon freshly grated ginger (optional)", "2 large eggs, room temperature, lightly beaten", "2 1/2 cups all-purpose flour, plus more for pan", "2 teaspoons ground ginger", "1 1/2 teaspoons ground cinnamon", "1/2 teaspoon ground cloves", "1/2 teaspoon ground or freshly grated nutmeg", "1/2 teaspoon salt", "2 teaspoons baking powder", "Confectioners’ sugar, for dusting finished cake", "Lightly sweetened whipped cream, essential for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, cut into chunks, plus more for pan<br/>\n1 cup water<br/>\n1 1/2 teaspoons baking soda<br/>\n2/3 cup packed dark-brown sugar<br/>\n1 cup unsulfured molasses<br/>\n1 tablespoon freshly grated ginger (optional)<br/>\n2 large eggs, room temperature, lightly beaten<br/>\n2 1/2 cups all-purpose flour, plus more for pan<br/>\n2 teaspoons ground ginger<br/>\n1 1/2 teaspoons ground cinnamon<br/>\n1/2 teaspoon ground cloves<br/>\n1/2 teaspoon ground or freshly grated nutmeg<br/>\n1/2 teaspoon salt<br/>\n2 teaspoons baking powder<br/>\nConfectioners’ sugar, for dusting finished cake<br/>\nLightly sweetened whipped cream, essential for serving</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350 degrees. Line a 9×13-inch baking pan with parchment paper. Butter and flour parchment and sides of cake pan, or spray both with a nonstick baking spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring water to a boil in a medium saucepan (or large one, if you’d like to make the cake entirely in there) and add baking soda — it will foam up! this is fun! Let stand for 5 minutes, then stir in butter until melted. Whisk in dark brown sugar, molasses and fresh ginger, if using. Mixture is usually just lukewarm by now, but if it still feels quite hot to the touch, set it aside to 10 to 15 minutes to cool further before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place flour, ground ginger, cinnamon, cloves, nutmeg, salt and baking powder in a fine-mesh strainer or sifter so that you can sift them over the wet ones in a minute. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer molasses mixture to a large mixing bowl if your saucepan isn’t large enough to make the batter in. Whisk in eggs until just combined. Sift dry ingredients over wet, then stir the wet and dry ingredients together until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour batter into prepared pan; bake for 30 to 35 minutes, until a toothpick inserted into the center of the cake comes out clean. Transfer cake to a wire rack and let cool completely. Once fully cool, cut around cake to make sure no parts are sticking to the side and invert cake out onto a rack, then onto a serving plate. Dust with confectioners’ sugar and cut into squares. Please, promise you’ll serve this with lightly sweetened, softly whipped cream. They’re made for each other.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Do ahead:</u> Whipped cream needs to be stored in the fridge, of course. Cake keeps at room temperature for up to a week in an airtight container. It gets better with age, just like you, babe. </p>"}], "link": "https://smittenkitchen.com/2013/12-gingerbread-snacking-cake"}