{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/10/10129849956_5b4c826237_o.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "broccoli, budget, fall, grain, lunch, photo, potatoes, vegan, vegetarian, weeknight favorite", "name": "Miso Sweet Potato and Broccoli Bowl", "author": {"@type": "Organization", "name": "\nInspired by the version in Goop; dressing from The Smitten Kitchen Cookbook"}, "description": "<p>Goop suggests that you put the vegetables over a couple cups of spinach or other salad greens, but I used grains instead. I used a half-half mixture of Black Japonica and Brown Jasmine rice, which together made the prettiest purple-red mixture. I’m one of those people who bought a rice cooker in the last year and now can talk about nothing else; being able to toss some water and grains in a machine and walk away while they cook themselves, and then keep themselves warm and perfect for an hour (easily) has changed dinnertime for the so-much-better, and you can use it for other grains too (I was going to use some rainbow quinoa in the mix as well, but decided not to overly complicate things.) A certain 4 year-old would like me to add that it plays Twinkle, Twinkle when you hit the start button, so there’s that, too.</p><p>There’s of course no reason to only use these vegetables, or to not swap in others, if you desire. I’d estimate about 1/4 cup dried rice or grains per person; most triple in volume once cooked. I forgot to buy ginger before making the dressing this time and was shocked that we didn’t notice it missing this time, so don’t panic if you’re short an ingredient or two.</p>", "totalTime": "", "recipeYield": "Serves 4", "recipeIngredient": ["RECIPE_SUBHED__1<u>For the bowl</u>", "1 cup dried rice or another cooking grain of your choice", "1 to 2 sweet potatoes (about 1.5 pounds)", "1 large bundle broccoli (about 1 pound)", "1 to 2 tablespoons olive oil", "Coarse or kosher salt", "Freshly ground black pepper", "1 teaspoon white sesame seeds", "1 teaspoon black sesame seeds", "RECIPE_SUBHED__2<u>For the miso-sesame dressing</u>", "1 tablespoon minced fresh ginger", "1 small garlic clove, minced", "2 tablespoons white miso (the mildest kind)", "2 tablespoons tahini (other nut butters can work in a pinch)", "1 tablespoon honey", "1/4 cup rice vinegar", "2 tablespoons toasted sesame oil", "2 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For the miso-sesame dressing</u><br/>\n1 tablespoon minced fresh ginger<br/>\n1 small garlic clove, minced<br/>\n2 tablespoons white miso (the mildest kind)<br/>\n2 tablespoons tahini (other nut butters can work in a pinch)<br/>\n1 tablespoon honey<br/>\n1/4 cup rice vinegar<br/>\n2 tablespoons toasted sesame oil<br/>\n2 tablespoons olive oil</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 400 degrees. Place rice or grain and cooking liquid in a rice cooker or on the stove. Cook according to package directions.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel sweet potatoes and cut into 1-inch cubes. Cut tops off broccoli and separate into bite-sized florets. If your broccoli stems feel especially woody, I like to peel them (with the same vegetable peeler), then cut them into 1/2- to 1-inch segments. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Coat one large or two smaller trays with a thin slick of olive oil. Layer sweet potatoes on tray(s) and sprinkle with salt and pepper. Roast for 20 minutes, until browning underneath. Flip and toss chunks around, then add broccoli to the tray(s), season again with salt and pepper, and roast for another 10 to 20 minutes, until broccoli is lightly charred at edges and sweet potato is fully bronzed and tender. Toss chunks around one more time if it looks like they’re cooking unevenly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a small skillet, toast black and white sesame seeds until fragrant. (You can do this in the oven if using an oven-proof skillet.) Let cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>While vegetables roast, prepare sesame-miso dressing: Combine everything in a blender and run until smooth, scraping down sides once. Taste and adjust ingredients if needed, but try to resist adding more honey if it tastes salty, as that extra pop of saltiness is exactly what I think sweet potato needs.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Assemble bowls: Scoop some rice/grains into each, then pile on the roasted sweet potatoes and broccoli. Coat lightly with sesame-miso dressing and finish with toasted sesame seed duo. Serve with extra dressing on the side.</p>"}], "link": "https://smittenkitchen.com/2013/10-miso-sweet-potato-and-broccoli-bowl"}