{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/10/perfect-uncluttered-chicken-stock1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, instant pot, photo, savory projects, slow cooker, soup", "name": "Perfect, Uncluttered Chicken Stock", "author": {"@type": "Person", "name": "Source: Adapted from Cooks Illustrated"}, "description": "I make this just the way CI told me to, except I use only one (instead of three) garlic cloves. I felt the larger amount made this a garlicky chicken stock, which is not what I was going for. You can add anything you’d like (more vegetables or a bay leaf or peppercorns or anything that makes your soup-loving heart sing) however, I would so love it if you could just once try it like this and hopefully understand this bliss of which I extol. It’s simple and golden and robust and the flavor is outstanding.", "totalTime": "15 minutes active cooking time", "recipeYield": "Makes 3 quarts", "recipeIngredient": ["3 pounds uncooked chicken wings", "3 quarts water", "1 large onion, roughly chopped", "1 garlic clove, smashed", "1 teaspoon table salt, or more to taste*"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a slow cooker: Place all ingredients in a slow-cooker. Cook on low for 8 to 10 hours or high for 4 to 5 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an InstantPot or electric pressure cooker: Place all ingredients in your 8-quart InstantPot or electric pressure cooker. Cook on high pressure for 1 hour. Manual or natural release both work fine; do it faster if you have less time to spare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[Updated to clarify:] This recipe fits in an 8-quart InstantPot or electric pressure cooker, not a 6-quart. Should you only have a 6-quart, simply reduce the recipe by a third (2 pounds wings, 2 quarts water, 1 medium onion, less salt). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Both methods: Pour the stock through a fine-mesh strainer to remove chicken parts, onion and garlic. The stock is now ready to use, or, you might prefer to do as we do, and put it in the fridge to chill until any fat solidifies on the top, making it easier to remove. (Though, there is really very little here, and some might prefer to leave it.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "How to store: If I’m not using it immediately, I let it cool and pour each quart of stock into 1 quart freezer bag or 1 gallon freezer bag and freeze them until needed. The gallon bags will be thinner and therefore defrost more quickly, dipping them in hot water for a bit. They also stack well. Note: Always defrost your bags set in a bowl. You never know if the bag has fallen a sharp corner or anything else has made a small puncture in the bag. It’s heartbreaking to lose any of the stock you worked hard for. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "It can also be frozen in ice cube trays for tiny amounts (great to add flavor to cooked grains or beans) and CI recommends nonstick standard muffin pans for 1/2-cup servings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A lot of Q&A about chicken stock:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "What if you don’t have a slow-cooker? One can spend a horrific amount of time (trust me) trying to figure out what the correct temperature of a slow-cooker is, only to realize that while many hover around 175 degrees F, even more have no temperature control, and simply deliver a constant heat to ingredients eventually bringing them to a very low simmer. There’s no reason to get hung up on this. To make the equivalent stock on your stove, aim for slow and low — a very, very low simmer that you keep going as long as you have patience for, but ideally 4 to 5 hours. You may need to replace some water as it cooks as pots tend to evaporate more water than slow-cookers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "How should I use this? You can use this as stock or broth in any soup. You can use it to cook grains or beans. But most importantly, the flavor is so wonderful that you can have it straight. It particularly excels in broth-y soups, like Chicken Noodle, Matzo Ball and Italian Wedding-style soups, where you directly taste the stock. Here, I show you how I simmered in some vegetables (and later, chicken chunks) to make a chicken noodle soup. Next, I’d love to talk about soup noodles, but at 1,500-plus words here, I think I’ve done run out of space, eh?"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Why chicken wings? In Cook’s Illustrated’s chicken broth tests, they found that both chicken legs along and necks and backs lent a “livery” taste to the broth. In my own experiments, saving the backs of chickens that I take apart in the freezer to later make broth with, I reluctantly agree (i.e. I wish it were some other way). Chicken wings, with their high bone-to-flesh ratio, made most refined and full-flavored broth and it took me a single sip of this stock to be fully converted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do I have to toss the cooked wings when I’m done? Yes and no. I find them overcooked, but not really inedible, so it’s a matter of preference. One thing I love about this recipe is that wings have so little usable flesh, it feels less wasteful than making chicken with larger parts can be (especially because they usually get overcooked and tough, thus, at least I do want to eat them)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "* What’s the difference between stock and broth? In most grocery store aisles, they’re used interchangeably but technically, there are small small differences. Stock is often heavier in bones and things that will add body, as this recipe is, though it doesn’t have to be. However, it is unseasoned, which means to make this a true stock, you would skip the salt. Stock is often used in restaurants to make reductions (it is really the backbone of restaurant cooking), and if you reduce something already salty, obviously, you will have an oversalted mess. So, salt is added when needed for final dishes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Why is my stock so thick? If you’ve never made stock before, it might have been a surprise to find that it became like Jell-o in the fridge over night. This is a good thing; this is excellent! It actually became exactly like Jell-o because stocks cooked for a long time with bones release the natural collagen in them. Stocks that jiggle when cool are the ones with the best and deepest flavors. Once warmed (even a little), it will immediately re-liquefy — do not fret. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "I had expected more flavor. If this stock ended up not having the flavor you were hoping for, there are a couple directions you could go in:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Why did this take you two years to tell us about it, Deb?! I was reluctant at first to share this recipe (despite being unable to stop myself from gushing about it to anyone who asked and a great many people who did not) because it felt excessively lush to me. I mean, three pounds of wings just to throw them away? Given, it’s quite easy to buy wings inexpensively in bulk (sometimes as disturbingly cheap as $1/pound), but if you prefers to buy local/cage-free/etc.-type chicken, it’s not exactly the cheapest way to approach what’s supposed to be the most economical kitchen ingredient, designed to use up scraps. But, when I actually ran the numbers, using wings on the priciest end of the spectrum (here, organic/antibiotic-free $3.99/pound and each pound of parts yields 1 quart of stock) the equivalent stuff from the box (the organic, free-range broth I’d buy is $4.50/quart, boasted such lovely ingredients as “yeast extract” and “chicken flavor), I realized that even if the taste didn’t speak for itself (it will), I’d been wrong about the cost. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When are you going to make a life-changing vegetable broth, for the rest of us? Soon. But it’s far more complicated because I don’t think that there is one magical combination of vegetables that will yield the ideal vegetable stock, it’s more about what flavors you enjoy lingering in the background your soups. Boy, I’m glad we had this talk because the kind of vegetable stock I’d like to make just totally hit me. "}], "link": "https://smittenkitchen.com/2013/11-perfect-uncluttered-chicken-stock"}