{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/10/frico-grilled-cheese.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, quick, sandwich, vegetarian", "name": "Frico Grilled Cheese Sandwich", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>A more tone-aware food writer would ask you to forgive them for the simplicity of this recipe. Grilled cheese? You think we need a recipe for cheese + bread + butter in a frying pan? But I won’t to because making it this way changes everything. You can’t be convinced by the aroma of buttery, toasting, crisping cheese in a hot skillet because you haven’t made it yet, but I think that once you experience it — I mean, take a deep drag off the kitchen air and be so happy that you’re home again — it will be what keeps you from making grilled cheese any other way again.</p><p>I like a hearty country wheat bread here, not too thickly sliced or it’s hard for the cheese inside to melt. You may more or less cheese depending on the size of your bread slices, and your tastes.</p>", "totalTime": "", "recipeYield": "1 sandwich. Scale up to share.", "recipeIngredient": ["2 slices bread of your choice", "2 teaspoons butter, salted or unsalted", "1/2 cup (2 ounces) coarsely grated cheddar "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 slices bread of your choice<br/>\n2 teaspoons butter, salted or unsalted<br/>\n1/2 cup (2 ounces) coarsely grated cheddar </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread butter on one side of each slice of bread, the one that will be on the outside of the sandwich. Scatter all but 2 tablespoons cheese unbuttered side of one slice. Top with second slice, so that the buttered side faces out. Heat skillet over low-to-moderate heat. (I like to use a well-seasoned cast iron frying pan here.) Sprinkle 1 tablespoon cheese roughly in center of skillet. Place sandwich on top. Cook sandwich until golden underneath and cheese browns and crisps, about 2 to 4 minutes. Carefully lift melted (frico-ed) cheese and bread onto spatula, sprinkle remaining spoonful of cheese back in skillet, then flip sandwich over on top of it. Cook on second side until golden and crisp as well, pressing down on it with the spatula to encourage it to all come together. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to a plate, cut in half if desired, and dig in.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Alternate riffs on the classic:</em> Are you a purist or do you like to put other things on your grilled cheese? I’m a sucker for sweet and sour red onions with a baby Swiss or gruyere cheese (this recipe in the book). But when I’m using classic cheddar, I either like a thin slice of tomato inside my sandwich, or sometimes, like the day I made these, the thinnest schmear of smooth Dijon and a dash of onion powder. </p>"}], "link": "https://smittenkitchen.com/2013/10-frico-grilled-cheese-sandwiches"}