{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/05/spring-vegetables-potstickers.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "asparagus, dumplings, peas, photo, spring, vegan, vegetarian", "name": "Spring Vegetable Potstickers", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>This is a flexible recipe, so don’t fret if you don’t have the exact ingredient list. Scallions could be spring onions. Garlic chives could be regular chives, or scallions tops instead. The tofu could be silkier. If you’re not into tofu (like this guy I married, but he will still eat it in this or that), here’s a fun alternative: cellophane noodles. I often see these minced in dumplings and think they’d be tasty here too.</p><p>As for the “spring” part, I used asparagus and favas for my potstickers but you should use a mix of whatever vegetables look awesome right now, be they peas or lima beans or more. You’re looking for 3 to 3 1/4 cups total spring vegetables once they’re chopped. </p><p>I (currently) draw the line at making my own potsticker wrappers, but if you feel so inclined, I see a lot of great looking recipes on the web (this one comes recommended by a commenter, below). When buying wrappers, look for ones intended for dumplings, not wontons, if you can. The latter will be thicker. (I, apparently, bought Korean mandu wrappers, and they worked like a dream.) </p>", "totalTime": "", "recipeYield": "Approximately 50 potstickers", "recipeIngredient": ["RECIPE_SUBHED__1<u>Potstickers</u>", "3 to 3 1/4 cups chopped spring vegetables (such as asparagus, favas, peas, lima beans or more) (I used 2 1/4 cups chopped asparagus from 12 ounces stalks plus 1 cup cooked favas from about 1 pound fresh in their pods)", "1 tablespoon neutral cooking oil, such as safflower, canola or peanut", "3/4 cup thinly sliced scallions (from about 3/4 of a bundle, about 3 ounces)", "1 tablespoon minced ginger", "1 clove garlic, peeled minced (if using garlic chives, omit)", "1 cup (about 6 ounces) firm tofu, chopped small (see Note up top for alternative)", "1/2 cup garlic or regular chives", "1 teaspoon toasted sesame oil", "1/4 teaspoon kosher salt, or more to taste", "RECIPE_SUBHED__2<u>To assemble</u>", "1 tablespoon cornstarch", "1/2 cup water", "50 round dumpling wrappers (most packages contain 50)", "RECIPE_SUBHED__3<u>Scallion dipping sauce</u>", "2 to 3 scallions (or, remainder of bundle used for potstickers), thinly sliced (use some in sauce, some for garnish)", "1/4 cup rice vinegar", "1/4 cup soy sauce", "1 tablespoon regular or spicy toasted sesame oil ", "RECIPE_SUBHED__4<u>To cook</u>", "1 to 2 tablespoons neutral cooking oil", "1/4 to 1/2 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To cook</u><br/>\n1 to 2 tablespoons neutral cooking oil<br/>\n1/4 to 1/2 cup water</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Prepare vegetables:</u> If using asparagus, cut off tough ends and sliced stalks into 1/2-inch segments. If using fava, <a href=\"http://www.flickr.com/photos/smitten/8696628915/in/photostream\">remove them from their pods</a>. <a href=\"http://www.flickr.com/photos/smitten/8696629077/in/photostream\">Boil</a> favas for 3 minutes, then drain, and <a href=\"http://www.flickr.com/photos/smitten/8696629235/in/photostream\">press</a> them out of their opaque skins (if difficult, first make a small slit on one end with a paring knife). To prepare peas, simply remove them from their pods. To prepare lima beans, remove them from their pods and simmer them for about 5 minutes to soften.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make filling:</u> Heat a wok or large saute pan over medium heat. Add a tablespoon of oil and heat, then add scallions, ginger and garlic, if using. Cook for one minute, then add vegetables in the order of the time they need to cook until crisp-tender. Asparagus will need about 4 minutes, peas about 2 to 3, and favas and limas will already be tender, so just a minute to warm them. Add tofu and chives and cook just until chives wilt, about 1 minute more. Season with salt and transfer to a fine-mesh colander, to drain off any excess liquid. Let cool in colander for 15 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If mixture is still on the chunky side, either chop it finely on a cutting board or pulse it a few times in a food processor. You don’t want to puree it; bits of vegetable should still be recognizable, but it will be easier to mound in dumplings if chopped well. Adjust seasonings if needed and mix with sesame oil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble potstickers:</u> Line two baking sheets with parchment paper or very lightly oil them. Mix cornstarch and water in a small bowl; this will act as your “glue.” Most dumpling wrappers come dusted with a little starch, so you’ll be okay if you want to skip the cornstarch, but I always feel safer having a little extra as an insurance plan.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Remove first wrapper from package and put it on a plate; place a damp towel or piece of plastic wrap over the unused ones to keep them from drying out. Brush wrapper with cornstarch-water mixture. Mound 1 to 2 teaspoons filling in the center. Fold the wrapper in half over the filling, sealing the center edge shut. Make a few small pleats down each sides to seal in the rest of the filling, while trying to press out as much air as possible (a process that looks difficult but is so easy, I think you’ll find it intuitive — use the photos in the post as guidance). Rest the dumpling, pleats up, on prepared tray and repeat with remaining wrappers and filling. When you’re all done, look over your potstickers; use the cornstarch mixture and pinching to seal any open sides or loosened pleats.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can now freeze the dumplings on their trays, then transfer them to a freezer bag once they will no longer stick together, or cook them right away.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make dipping sauce:</u> Mix ingredients and adjust levels to taste. For a sweeter sauce, add a 1/2 teaspoon honey or brown sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cook potstickers:</u> Heat a large skillet (I really like to use a nonstick here) over medium-high heat. Once hot, add the oil and heat this too. Once the oil is hot, arrange potstickers in a single layer and cook until browned at the bottom. This will take about 1 minute for fresh ones and up to 5 minutes for frozen ones. Add water; it will hiss and sputter, so move quickly. You’ll want the smaller amount of water for a smaller batch and the larger if you’re cooking more. Put a lid on the pot and cook dumplings for 2 to 3 minutes more (plus an additional minute if your dumplings were frozen to begin with). Remove lid and simmer until any remaining water has cooked off. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer to serving plate; garnish with scallion greens. Serve with dipping sauce.</p>"}], "link": "https://smittenkitchen.com/2013/05-spring-vegetable-potstickers"}