{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/01/intensely-chocolate-sables.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, cookie, photo", "name": "Intensely Chocolate Sables", "author": {"@type": "Organization", "name": "\nInspired by Balthazar, adapted quite a bit from Miette"}, "description": "<p>I prefer these cookies with Dutched cocoa power, which is darker and little nuttier, but if you only have natural cocoa, you can use it, although the cookies will puff just a bit more. [Update 1/29: Based on the comments I’m reading, I’m going to red card the use of natural or non-Dutched cocoa for now as the folks using this kind seem to be the ones having the most trouble with their cookies falling apart. So sorry for the trouble; it just seems most reliable to use this recipe with Dutched cocoa. Also, it is tastier.] Technically speaking, baking soda and Dutched cocoa powder don’t react, but I found that it imparted a slight raised texture and better crumb than skipping it or using baking powder, so I kept it there. Besides changing the type of cocoa powder and decreasing the baking soda, I also adjusted the recipe by adding an egg yolk (so it would come together), giving you the option to grind, instead of grating the chocolate (a step I find pesky because my warm hands make a mess of it) and then, because the Balthazar cookie I fell in love with is so bittersweet, giving you a suggested reduced sugar amount. If you’d like a bittersweet chocolate cookie, use the 1/2 cup amount. If you’d like a sweeter (although hardly overly sweet) chocolate cookie, use 2/3 cup. I always sprinkle these with coarse brown sugar, but I’m sure they could be prettied up with sprinkles or the like as well.</p>", "totalTime": "", "recipeYield": "Makes 40 to 48 2-inch thin cookies, fewer if thicker", "recipeIngredient": ["1 cup (125 grams) all-purpose flour", "1/3 cup (30 grams) Dutched cocoa powder (see Updated Note)", "1/4 teaspoon baking soda", "1/2 cup (1 stick, 4 ounces or 115 grams) unsalted butter, at room temperature", "1/2 to 2/3 cup (100 to 135 grams) granulated sugar (less for a more bittersweet cookie)", "1/4 teaspoon fine sea salt", "1 large egg yolk", "1/2 teaspoon vanilla extract", "3 1/2 ounces (100 grams) semi- or bittersweet chocolate, grated or finely chopped until almost powdery in a food processor", "Coarse sugar (turbinato/sugar in the raw or decorative) for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup (125 grams) all-purpose flour<br/>\n1/3 cup (30 grams) Dutched cocoa powder (see Updated Note)<br/>\n1/4 teaspoon baking soda<br/>\n1/2 cup (1 stick, 4 ounces or 115 grams) unsalted butter, at room temperature<br/>\n1/2 to 2/3 cup (100 to 135 grams) granulated sugar (less for a more bittersweet cookie)<br/>\n1/4 teaspoon fine sea salt<br/>\n1 large egg yolk<br/>\n1/2 teaspoon vanilla extract<br/>\n3 1/2 ounces (100 grams) semi- or bittersweet chocolate, grated or finely chopped until almost powdery in a food processor<br/>\nCoarse sugar (turbinato/sugar in the raw or decorative) for sprinkling</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sift together the flour, cocoa and baking soda together onto a piece of waxed paper or into a bowl and set aside. (I almost always skimp on sifting wherever possible, but my cocoa is always lumpy, so this is unavoidable.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cream butter, sugar and salt together in a large bowl with an electric mixer until light and fluffy. Add egg yolk and vanilla, beating until combined, then scraping down sides. Add dry ingredients and grated chocolate together and mix until just combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape dough onto a piece of plastic wrap, wrap it up and chill it in the fridge until just firm, about 30 to 45 minutes. No need to get it fully hard, or it will be harder to roll out. Dough can be refrigerated until needed, up to a two days, or frozen longer, but let it warm up and soften a bit before rolling it out for decreased frustration.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350 degrees. On a floured surface, roll dough gently — it will still be on the crumbly side, so only attempt to flatten it slightly with each roll — until it is 1/8-inch thick (for thin cookies, what I used), 1/4-inch thick (for thicker ones) or somewhere in-between (I suspect the Balthazar ones are rolled to 3/8-inch). Cut into desired shapes and space them an inch apart on a parchment-lined baking sheet. Sprinkle decoratively with coarse sugar. Bake for 8 to 10 minutes (for thinner cookies) or 10 to 12 minutes (for thicker ones). Leave cookies on baking sheets out of the oven for a couple minutes before gently, carefully transferring them to cooling racks, as they’ll be fragile until they cool.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cookies can be stored in an airtight container for up to two weeks of 4 p.m. rations.</p>"}], "link": "https://smittenkitchen.com/2013/01-intensely-chocolate-sables"}