{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/08/kale-salad-with-pecorino-and-walnuts.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "kale, photo, salad, summer, vegetarian", "name": "Kale Salad with Pecorino and Walnuts", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>We had this with a tortilla de patatas (Spanish potato, egg and olive oil omelet), our first one of the summer, and it was the perfect weeknight dinner. It also reminded me that it was time to update and streamline/simplify my recipe from 2007, which I did. See it here. </p>", "totalTime": "", "recipeYield": "Like I did on a recent ice cream cake, please consider this a tale of two recipes, one that’s bare bones (add the raisins, walnuts and crumbs without the extra prep) and one if you’d like to get a little more depth from each. Both work, but the slightly longer prep (toasting the nuts, the crumbs in olive oil, plumping the raisins, etc.) really makes the salad sing and will not be regretted. You can choose your own adventure, too, doing more for some ingredients and less for others.", "recipeIngredient": ["1/2 cup (105 grams or 3 3/4 ounces) walnut halves or pieces", "1/4 cup (45 grams or 1 1/2 ounces) golden raisins", "1 tablespoon white wine vinegar", "1 tablespoon water", "1/4 cup panko (15 grams or 1/2 ounce) or slightly coarse homemade breadcrumbs (from a thin slice of hearty bread)", "1 tiny clove garlic, minced or pressed", "Coarse or kosher salt", "3 tablespoons olive oil", "1 bunch (about 14 ounces or 400 grams) tuscan kale (also known as black or lacinato kale; this is the thinner, flatter leaf variety), washed and patted dry", "2 ounces (55 grams) pecorino cheese, grated or ground in a food processor, which makes it delightfully rubbly (1/2 cup total)", "Juice of half a lemon", "Freshly ground black pepper or red pepper flakes, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 cup (105 grams or 3 3/4 ounces) walnut halves or pieces<br/>\n1/4 cup (45 grams or 1 1/2 ounces) golden raisins<br/>\n1 tablespoon white wine vinegar<br/>\n1 tablespoon water<br/>\n1/4 cup panko (15 grams or 1/2 ounce) or slightly coarse homemade breadcrumbs (from a thin slice of hearty bread)<br/>\n1 tiny clove garlic, minced or pressed<br/>\nCoarse or kosher salt<br/>\n3 tablespoons olive oil<br/>\n1 bunch (about 14 ounces or 400 grams) tuscan kale (also known as black or lacinato kale; this is the thinner, flatter leaf variety), washed and patted dry<br/>\n2 ounces (55 grams) pecorino cheese, grated or ground in a food processor, which makes it delightfully rubbly (1/2 cup total)<br/>\nJuice of half a lemon<br/>\nFreshly ground black pepper or red pepper flakes, to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare walnuts:</i> Heat oven to 350. Toast walnuts on a baking sheet for 10 minutes, tossing once. Let cool and coarsely chop. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare raisins:</i> In a small saucepan over low heat, simmer white wine vinegar, water and raisins for 5 minutes, until plump and soft. Set aside in liquid. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare crumbs:</i> Toast bread crumbs, garlic and 2 teaspoons of the olive oil in a skillet together with a pinch of salt until golden. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare kale:</i> Trim heavy stems off kale and remove ribs. I always find removing the ribs annoying with a knife, because the leaves want to roll in on the knife and make it hard to get a clean cut. Instead, I’ve taken to tearing the ribs off with my fingers, which is much easier for me. Stack sections of leaves and roll them into a tube, then cut them into very thin ribbons crosswise. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Assemble salad:</i> Put kale in a large bowl. Add pecorino, walnuts and raisins (leaving any leftover vinegar mixture in dish), remaining 2 tablespoons olive oil and lemon juice and toss until all the kale ribbons are coated. Taste and adjust seasonings with salt, pepper and some of the reserved vinegar mixture from the raisins, if needed. Let sit for 10 minutes before serving, if you can, as it helps the ingredients come together. Just before serving, toss with breadcrumbs and, if needed, a final 1 teaspoon drizzle of olive oil. </p>"}], "link": "https://smittenkitchen.com/2013/08-kale-salad-with-pecorino-and-walnuts"}