{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/10/green-bean-casserole-with-crispy-onions1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "fall, green beans, mushrooms, onion, photo, savory projects, side dish, thanksgiving, vegetarian", "name": "Green Bean Casserole with Crispy Onions", "author": {"@type": "Organization", "name": "\nAdapted a little from Alton Brown and a little from trial-and-error"}, "description": "", "totalTime": "", "recipeYield": "Serves 6, or more if you: a) have a lot of sides on the table, which I bet you will, or b) use the higher amount (1.5 pounds) of green beans", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crispy Onions</u>", "2 medium yellow onions, halved and thinly sliced", "1/4 cup all-purpose flour", "2 tablespoons panko or plain breadcrumbs", "1/2 teaspoon table salt", "Freshly ground black pepper", "Canola, safflower, peanut or other high-heat oil, for deep-frying", "RECIPE_SUBHED__2<u>Mushroom Sauce</u>", "3 tablespoons butter", "12 ounces mushrooms, thinly sliced or coarsely chopped", "Few gratings fresh nutmeg (optional)", "Freshly ground black pepper", "3/4 teaspoon table salt", "2 garlic cloves, minced", "3 tablespoons all-purpose flour", "1 1/2 cups vegetable or chicken broth", "1/2 cup heavy cream", "RECIPE_SUBHED__3<u>Assembly</u>", "1 to 1 1/2 pounds green beans, trimmed and halved (see note about volume)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assembly</u><br/>\n1 to 1 1/2 pounds green beans, trimmed and halved (see note about volume)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make the crispy onions:</i> Toss onion with flour, breadcrumbs, salt and pepper. Heat a 1/2-inch or so of oil in a 12-inch cast iron skillet until a drop of water flicked into it will hiss and sputter. Add onions, just a handful at a time in something close to a single layer, and fry until a light golden brown (they’ll get more color in the oven; I overcooked mine a bit, forgetting this). Remove with a spider or large slotted spoon, let oil drip off a little, back into the skillet, then spread onions out on paper towels to drain. Repeat with remaining onions. Set aside until needed; this makes a lot.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 400 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare the beans:</i> Bring a large pot of salted water to boil and boil greens for 5 minutes (for standard green beans) or 2 to 3 minutes (for haricot vert, or skinny ones). Drain beans, then plunge them into ice water to full stop them from cooking. Drain again, and set aside. (If you are adamant about only using one pot, you can boil them in your 12-inch cast iron skillet that you use for the other steps. But a saucepan can be easier.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make the mushroom sauce:</i> Over medium-high heat, melt butter in the bottom of a 12-inch cast iron skillet. Add the mushrooms, salt and pepper and saute them until they start releasing their liquid, anywhere from 3 to 5 minutes, depending on how they were chopped. Add the garlic and saute one minute more. Add the flour and stir it until it fully coats the mushrooms. Add the broth, 1/4 cup at a time, stirring the whole time. Simmer mixture for 1 minute, then add cream and bring back to a simmer, cooking until the sauce thickens a bit, about 5 to 6 minutes, stirring frequently. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Assemble and bake:</i> Add cooked greens beans to sauce and stir until they are coated. Sprinkle crispy onions over the top. Bake for 15 minutes, or until sauce is bubbling and onions are a shade darker. Eat at once.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Do ahead, a few ways:</i> Onions can be made long in advance (up to a day) and keep at room temperature, loosely wrapped (they’d get soggy in an airtight container). Green beans can be cooked and kept in fridge until needed, at least one day. Green beans can also be combined with mushroom sauce and kept refrigerated for up to a day. Add onions and bake shortly before serving. Finally, it’s less ideal, but the entire dish can be cooked, loosely wrapped (so the crispy top doesn’t get soggy) and then rewarmed in a low oven before serving. Just keep an eye on the topping so it doesn’t get too brown while reheating.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>A few notes:</strong> </p>"}], "link": "https://smittenkitchen.com/2013/11-green-bean-casserole-with-crispy-onions"}