{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/10/potato-and-broccolini-frittata1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "broccoli, brunch, eggs, gluten free, lunch, photo, potatoes, vegetarian, weeknight favorite", "name": "Potato and Broccolini Frittata", "author": {"@type": "Organization", "name": "\nAdapted, barely, from Easy Vegetarian One-Pot Meals via Leite’s Culinaria"}, "description": "<p>Even if I know the thinner ones are more traditional, I like a frittata, especially a dinner version, to have a little bulk and this perfectly fit the bill, and leftover slices make a pretty great sandwich filling the next day, something I saw frequently in Rome. The recipe calls for broccolini, a variety of broccoli with thinner, longer stalks and smaller florets that keeps a dark rich green color after it is cooked. (aka Baby Broccoli, Broccolette; read more here.) However, I think any number of green vegetables would work here, either standard broccoli florets or sauteed kale, etc. What I wouldn’t skimp on is the parmesan. I know there’s a lot, in fact, if you must, skip the half the goes inside the frittata, but don’t skip the broiled part. That’s the salty/crunchy/frico finish and Monday night dinners would be so much more dull without it.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["8 to 10 small waxy potatoes (about 1 ounce each), scrubbed and quartered", "1 cup vegetable or another broth; just use salted water if you don’t have it around", "1/4 cup olive oil", "8 ounces (usually 1 bundle) broccolini, trimmed and halved lengthwise or chopped into 1-inch pieces", "1 small red or white onion, thinly sliced", "8 large eggs", "1 cup (about 3 to 3 1/2 ouncesgrated Parmesan cheese", "Salt and freshly ground black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8 to 10 small waxy potatoes (about 1 ounce each), scrubbed and quartered<br/>\n1 cup vegetable or another broth; just use salted water if you don’t have it around<br/>\n1/4 cup olive oil<br/>\n8 ounces (usually 1 bundle) broccolini, trimmed and halved lengthwise or chopped into 1-inch pieces<br/>\n1 small red or white onion, thinly sliced<br/>\n8 large eggs<br/>\n1 cup (about 3 to 3 1/2 ouncesgrated Parmesan cheese<br/>\nSalt and freshly ground black pepper, to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place the potatoes and broth in a large, ovenproof frying pan, ideally one that is 12 inches. Bring to a boil and simmer for 10 minutes, turning the potatoes often, until almost all of the stock has been absorbed and the potatoes are tender. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add olive oil, broccolini and onion to the potatoes in the frying pan and cook over medium heat for 1 minute, turning frequently, just to get everything coated with oil, Then, reduce the heat to medium-low and cover the pan, cooking for 3 to 4 more minutes, or until the broccolini has become mostly tender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your broiler.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Beat eggs with half the parmesan, salt and pepper, and pour it over the vegetables in the frying pan. Cover and cook over medium (or medium-low, if yours seems to be browning too quickly) until the eggs are mostly, set. Sprinkle remaining parmesan over frittata and run the whole pan under the broiler, until the top is bronzed and the eggs are just set throughout, approximately 5 minutes, but this could vary due to how robust your broiler is (mine is terrible; it took longer).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool slightly before slicing into wedges or squares.</p>"}], "link": "https://smittenkitchen.com/2013/10-potato-and-broccolini-frittata"}