{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/rhubarb-cream-cheese-hand-pies1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "photo, picnics, rhubarb, summer, tarts pies", "name": "Rhubarb Cream Cheese Hand Pies", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Hand pies are for crust lovers, as there’s a much higher proportion of them to the relatively small amount of filling than there is in standard round pies. Here, I use my standard All Butter Really Flaky Pie Dough (scaled 150%) but I replaced the water with buttermilk (plus a little extra, as it is thicker than water) for added tenderness, which is helpful when you want to bend and press your dough around a bulging filling. These pies are not terribly sweet; the rhubarb is tart and the crust has barely any filling. For this reason, feel free to really sweep the tops with a sprinkling of coarse sugar for contrast. The cream cheese flavor will not be strong here; there’s not enough of it, but we still enjoyed the contrast it provided. You can skip it, and just use more fruit if it’s not your thing. Feel free to replace the rhubarb with any other fruit that you’ve chopped and cooked down slightly. I take this extra step because runny hand pies are really no fun to hold, which defeats their purpose. Because my pies were on the small side, I had extra rhubarb and cream cheese fillings, but I wanted to give you a little cushion in case yours are able to handle a touch more. Happy picnic-ing!</p><p>* The shapes of these pies were shamelessly inspired by these pretties on Tara O’Brady’s Instagram feed. In the past, I have made hand pies with round cutters, and folded the sides in half over the filling to seal into a half moon. I found that this “ravioli” shape puffed even higher in the oven, and required less rerolling of scraps, and am officially converted. </p>", "totalTime": "", "recipeYield": "24 just about 3-inch square pies", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crust</u>", "3 3/4 cups (470 grams) all-purpose flour", "1/2 teaspoon fresh orange zest (optional)", "1 1/2 (20 grams) tablespoons granulated sugar", "1 1/2 (9 grams) teaspoons table salt", "1 1/2 cups (12 ounces or 340 grams) unsalted butter, very cold and cut into small cubes", "3/4 to 1 cup buttermilk (or, make your own ", "<a href=\"https://smittenkitchen.com/tips/2009/08/20/make-your-own-buttermilk/\">buttermilk substitute</a>", ")", "RECIPE_SUBHED__2<u>Rhubarb Filling</u>", "1 pound (455 grams) rhubarb stalks, trimmed and cut into 1/2-inch segments", "1/3 cup (65 grams) granulated sugar", "RECIPE_SUBHED__3<u>Cream cheese filling</u>", "4 ounces cream cheese, at room temperature (i.e. very soft)", "1/3 cup granulated sugar", "1 teaspoon lemon zest", "2 teaspoons lemon juice", "1 large egg yolk", "RECIPE_SUBHED__4<u>To assemble</u>", "1 large egg", "1 tablespoon water", "Coarse sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To assemble</u><br/>\n1 large egg<br/>\n1 tablespoon water<br/>\nCoarse sugar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make pie dough:</u> Whisk together flour, zest, sugar and salt in the bottom of a large, wide-ish bowl. Using a pastry blender, two forks, or your fingertips, work the butter into the flour until the biggest pieces of butter are the size of tiny peas. (You’ll want to chop your butter into small bits first, unless you’re using a very strong pastry blender in which case you can throw the sticks in whole, as I do.) Gently stir in 3/4 cup buttermilk with a rubber spatula, mixing it until a craggy mass forms. Get your hands in the bowl and knead it just two or three times to form a ball. If it doesn’t come together, add remaining 1/4 cup buttermilk, 1 tablespoon at a time, until it does, then gently knead again. Divide dough in half. Wrap each half in plastic wrap and flatten a bit, like a disc. Chill in fridge for at least an hour or up to two days or slip plastic-wrapped dough into a freezer bag and freeze for up to 1 to 2 months (longer if you trust your freezer more than I do). To defrost, leave in fridge for 1 day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make rhubarb filling:</u> Place rhubarb and sugar in a small-to-medium saucepan with sugar and stir to combine. Cover and cook at medium-low heat for 15 minutes, no need to stir. Increase the heat to medium, remove the lid and cook for another 10 to 15 minutes, until rhubarb is broken down and ideally thick enough that if you run a spoon across the bottom of the pot, you can see a trench quickly form and disappear. (No need to be overly fussy about this level of thickness, as a little wetter won’t harm your pies.) Spread mixture on a large plate in the fridge or freezer to cool quickly, then scrape into a bowl. Keep cold until needed; it will be thicker and easier to “scoop” onto the pie bases.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make cream cheese filling:</u> Whisk cream cheese, sugar, zest, juice and yolk together in a small bowl until smooth. Keep cold until needed as well.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble pies:</u> Heat oven to 400 degrees. Line two to three baking sheets with parchment paper. Beat your remaining egg and 1 tablespoon water and keep aside with a pastry brush. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Flour the heck out of your counter, unwrap the first half of your dough and start rolling your dough by pressing down lightly with the pin and moving it from the center out. You’re not going to get it all flat in one roll or even twenty; be patient and it will crack less. Roll it a few times in one direction, lift it up and rotate it a quarter-turn. Continue to do, roll a couple times, lifting the dough and rotating it until the dough is just shy of 1/8-inch thick. Cut dough into 2 3/4-inch to 3-inch squares. (I had a 2 3/4-inch fluted cutter from <a href=\"http://www.amazon.com/gp/product/B0001V48ME/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0001V48ME&amp;linkCode=as2&amp;tag=smitten-20\">this set</a>. A knife, pizza wheel or even fluted pastry wheel would be sufficient.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Deb’s #1 Most Essnetial Pie Tip: No mushy pie dough! If your dough becomes soft (it’s a hot day or warm kitchen, aka <i>summer</i>) now or at any point in the assembly process, slide the dough squares onto a prepared baking sheet and freeze them for a couple minutes until they’re semi-firm again; it will make assembly less frustrating. Promise.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Brush half the squares very, very lightly with the egg wash; these will be your bases. Cut a small vent in the other half of the squares; these will be your lids. In the center of each egg washed square, put a small dollop (a measured teaspoon) of cream cheese, then rhubarb filling on top. Be ye not tempted to fill them more as they become almost impossible to seal without leakage, and why should your baking sheet get all the good stuff? Top each filled base with a vented square. Press outer edge of top and bottom all around to seal with your fingertips; a fork will work as well. Transfer pie to a baking sheet, spacing 1-inch apart. Brush the tops with egg wash and sprinkle generously with coarse sugar. Repeat with remaining dough, including second half from fridge, and fillings.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 15 to 20 minutes, until puffed and golden, and even more brown at edges. Transfer to cooling racks and cool to room temperature before serving. Okay, well, good luck with that. </p>"}], "link": "https://smittenkitchen.com/2013/06-rhubarb-cream-cheese-hand-pies"}