{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/grilled-bacon-salad-with-arugula-and-balsamic1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "arugula, grilling, meat, salad, summer", "name": "Grilled Bacon Salad with Arugula and Balsamic", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>This salad is ideal with a thicker-cut bacon (but there’s really no need to buy the insanely thick stuff I bought by accident), wild arugula (I find that the leafy bundled stuff has much more flavor and bite than the bagged/boxed stuff) and an aged, dark and almost syrupy balsamic that you save for special occasions. However, the good news is that we’ve made it all ways (I warned you it was addictive) and any old bacon + arugula + balsamic you keep around works too. The real beauty of this, however, is the simplicity of it. I personally loathe making bacon inside because it splatters everywhere and stinks and smokes up my apartment. On a hot grill, it’s done to perfection in just minutes and keeps your kitchen clean. And, if you’re going to a pot-luck with a grill around, there’s nothing easier than bringing a package of bacon, bundle of arugula and bottle of balsamic with you to throw together a salad that may start a summer obsession.</p>", "totalTime": "", "recipeYield": "Servings: 4 (I’d estimate 1 to 2 slices of bacon, and 1 ounce arugula leaves per person, depending on how much other food will be served)", "recipeIngredient": ["4 ounces arugula", "8 ounces of thick-cut bacon", "Handful of grape tomatoes, halved or quartered (optional)", "Small amount of parmesan cheese, shaved with a vegetable peeler (optional)", "Aged balsamic vinegar", "Drizzle of olive oil", "Sea salt", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 ounces arugula<br/>\n8 ounces of thick-cut bacon<br/>\nHandful of grape tomatoes, halved or quartered (optional)<br/>\nSmall amount of parmesan cheese, shaved with a vegetable peeler (optional)<br/>\nAged balsamic vinegar<br/>\nDrizzle of olive oil<br/>\nSea salt<br/>\nFreshly ground black pepper</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arugula is grown in dark, sandy soil and almost always arrives gritty. Don’t skimp on washing it. I like to fill a large bowl or basin with very cold water and drop the arugula into it, pumping it up and down a few times with your hands to allow any dirt and grit to fall to the bottom. Pull it out of the water, being careful not to drag any grit from the bottom of the bowl with it. Spread out on towels to dry it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, get you grill very hot. Lay out all of your bacon slices and grill them* until browned underneath, which will take all of two minutes. Flip them with tongs; another minute should finish them on the second side. Transfer them to a platter. Tear your arugula into bite-sized pieces over it. Scatter with tomatoes and peels of parmesan, if using. Drizzle very thinly with olive oil and sprinkle with a few, spare droplets of balsamic vinegar. Season with salt and black pepper. Serve immediately, just as some of the arugula begins to sigh over the hot bacon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* As I’ve already received a few comments about flare-ups on the grill from bacon grease, I want to add before you start that you should definitely use your judgement here; the recipe is not the law. Ours flared a little, but not so much that it worried me. If it’s flaring too much on a high heat, lower it or move it to a cooler part of the grill. You can also close the lid for a minute, or do fewer strips at a time. You know your grill best. Be safe.</p>"}], "link": "https://smittenkitchen.com/2013/07-grilled-bacon-salad-with-arugula-and-balsamic"}