{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/11/sweet-potato-cake-with-toasted-marshmallow-frosting1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "celebration cakes, everyday cakes, fall, photo, potatoes, thanksgiving", "name": "Sweet Potato Cake with Toasted Marshmallow Frosting", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "Serves 16 in approximately 2-inch squares", "recipeIngredient": ["RECIPE_SUBHED__1<u>Cake</u>", "1 1/2 pounds sweet potatoes (about 2 to 3 medium or 2 large)", "2 cups (250 grams) all-purpose flour", "1 3/4 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon table salt", "1 teaspoon ground cinnamon", "1/4 teaspoon (more to taste) ground ginger", "Two pinches (more to taste) ground cloves", "1/2 cup (1 stick or 115 grams) unsalted butter, at room temperature", "1 cup (190 grams) packed light brown sugar", "1/2 teaspoon vanilla extract", "2 large eggs", "RECIPE_SUBHED__2<u>Frosting</u>", "3 large egg whites", "3/4 cup granulated sugar", "Pinch of salt", "1/4 teaspoon cream of tartar (will help stabilize egg whites, don’t worry if you don’t have it)", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Frosting</u><br/>\n3 large egg whites<br/>\n3/4 cup granulated sugar<br/>\nPinch of salt<br/>\n1/4 teaspoon cream of tartar (will help stabilize egg whites, don’t worry if you don’t have it)<br/>\n1/2 teaspoon vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Roast sweet potatoes:</i> Heat oven to 375 degrees. Prick potatoes all over with a fork. Rest on a baking sheet. Roast for 45 minutes to 1 hour, turning once or twice, until soft. Let cool completely. Can be kept in fridge for up to 3 days, if baked in advance.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make cake:</i> Heat oven to 350 degrees F. Line the bottom of an 8- to 9-inch square pan with parchment paper, then butter the paper and sides of the pan. [If you trust your nonstick pan, you might be able to skip the parchment, but I don’t like to live on the edge when it comes to getting cakes out of a pan.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel cooled sweet potatoes and run flesh through a potato ricer, or mash until very smooth. (Do not blend in a blender or food processor.) Measure 1 1/2 packed cups (about 12 to 13 ounces) from sweet potato mash; you may have a little extra, which you should warm up with a pat of butter and sprinkle of sea salt and not share with anyone.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk flour, baking powder, baking soda, salt and spices together in a medium bowl. In a large bowl, beat butter and brown sugar together with an electric mixer until light and fluffy, about 2 to 3 minutes. Add vanilla and eggs, and beat until just combined. Mix in sweet potato puree, then stir in dry ingredients just until they disappear. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spread batter in prepared pan, and bake cake until a toothpick inserted into the center comes out clean, about 35 to 40 minutes. Let cake rest in pan for 5 minutes on a cooling rack, then invert onto cooling rack, and let cool completely. You can speed this up, as I always do, in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make frosting:</i> Place egg whites, granulated sugar, a pinch of salt and cream of tartar in a heatproof bowl set over a saucepan of gently simmering water. Whisk mixture for 3 minutes, until whites are warmed and sugar granules feels mostly dissolved. Remove bowl from top of saucepan, then, with an electric mixer, beat egg white mixture on high speed until stiff, glossy peaks form, about 4 to 7 minutes longer. Add vanilla and mix until combined.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Frost and decorate:</i> If you’d like to make huge, marshmallow-like dollops, spread a bit of frosting thinly over cooled sweet potato cake. Then, using a very large round piping tip (I have an almost comically large one with a 1/2-inch opening) or the corner snipped off a freezer bag, pipe large dollops of frosting all over thin frosting layer. If you’d like to skip the dollops, you can just spread the frosting, thick and swirly, all over.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Using a kitchen torch, lightly brown the dollops so that they look (and smell!) like toasted marshmallows. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Serve:</i> At room temperature cut into squares. Cake keeps at room temperature for two days; any longer, I like to keep it in the fridge.</p>"}], "link": "https://smittenkitchen.com/2013/11-sweet-potato-cake-with-marshmallow-frosting"}