{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/01/essential-raised-waffles1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, photo, waffles", "name": "Essential Overnight Raised Waffles", "author": {"@type": "Organization", "name": "\nAdapted, only in language, from Marion Cunningham’s Breakfast Book, where it was adapted from an old Fanny Farmer cookbook"}, "description": "<p>I’ve gushed enough about the smell/texture/flavor/ease of this recipe so let me cut right through to the scary part: Cunningham, terrifyingly, instructs us to leave the batter — a batter with milk! and yeast! — out on the counter overnight at room temperature. She gives no schedule for this (what if your kid lets you sleep in?!) and doesn’t even give mention to the whole won’t-the-milk-go-bad? thing. I — no surprise — am a little more panicky about what’s unsaid in recipes. I made it the first time as she instructs. Oh man, it looks FUNKY in the morning, and the smell, well… How could it be right? I made it a second time, letting it overnight in the fridge, as many writers have interpreted since. Here’s what you need to know: both work but the one that fermented at room temperature came in miles ahead in the flavor category. It had an unmistakeable sourdough (yeah, I know, not the word you want to hear about room temperature milk baked goods) vibe. I became instantly obsessed with the flavor. The flavor from the fridge batch was excellent, but no comparison. Proceed as you wish (both methods are tested and work) but do please consider the original room temperature method. It’s just better.</p><p>And if you’re not yet convinced that you need to make these, consider this: They’re patient (you could sleep a little or a lot, the batter will still be ready for you in the morning.) They’re easy, and use ingredients you probably already have around. The batter keeps in the fridge for days, extra waffles can be frozen and reheated in a toaster and just-cooked ones stay warm and crisp in a low oven for as long as it takes for everyone else to straggle in. Oh, and they taste like the greatest thing since gridded breakfast bread.</p>", "totalTime": "", "recipeYield": "Marion Cunningham says 8 waffles, but waffle irons vary widely by volume; I felt it made a whole lot, enough to serve 4 to 6. The photos shown are from a halved batch, which is a much better fit for our family of 2 adults + 1 preschooler.", "recipeIngredient": ["1/2 cup warm water (about 105 to 110 degrees, so not too hot)", "1 packet (1/4 ounce, 7 grams or 2 1/4 teaspoons) active dry yeast", "2 cups milk, warmed (again, not too hot", "1 stick (4 ounces or 115 grams) unsalted butter, melted and cooled until lukewarm", "1 teaspoon table salt", "1 teaspoon granulated sugar", "2 cups (250 grams) all-purpose flour", "2 large eggs", "1/4 teaspoon baking soda", "Oil or melted butter for waffle iron", "Powdered sugar, syrup or berries for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 cup warm water (about 105 to 110 degrees, so not too hot)<br/>\n1 packet (1/4 ounce, 7 grams or 2 1/4 teaspoons) active dry yeast<br/>\n2 cups milk, warmed (again, not too hot<br/>\n1 stick (4 ounces or 115 grams) unsalted butter, melted and cooled until lukewarm<br/>\n1 teaspoon table salt<br/>\n1 teaspoon granulated sugar<br/>\n2 cups (250 grams) all-purpose flour<br/>\n2 large eggs<br/>\n1/4 teaspoon baking soda<br/>\nOil or melted butter for waffle iron<br/>\nPowdered sugar, syrup or berries for serving</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The night before: Pour warm water in the bottom of a large (larger than you think you’ll need, because the batter will rise a lot) bowl. Sprinkle yeast on top and let it dissolve and foam ever-so-slightly for 15 minutes. Stir in milk, butter, salt, sugar and flour — I do a little bit of wet ingredients then a little bit of dry, back and forth, to avoid forming lumps. If lumps form, you can mostly whisk them out. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover bowl with plastic wrap and set out on counter (see Note up top for debate on this) overnight.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>The next morning, whisk in eggs and baking soda until smooth. Heat waffle iron** (a thinner one is better than a Belgian-style one, as these will not rise enough to fill a tall one out) and coat lightly with butter or oil. Ladle in 1/2 to 3/4-cup batter per waffle batch. The batter will be very thin and will spread a lot in the pan, so err on the side of underfilled until you figure out the right amount. Repeat with remaining batter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Waffles can be kept crisp in a warm oven until needed. If you only want to make a few at a time, the batter keeps well in the fridge for several days, says Cunningham.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>** I suspect someone will ask me here about the waffle iron I use. <a href=\"http://www.amazon.com/gp/product/B0006L9V0S/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0006L9V0S&amp;linkCode=as2&amp;tag=smitten-20\">It’s this one</a>. I bought it last year when I was working on a story about breakfast egg sandwiches (which I just realized never ran, hmm) and I wanted to make one with waffles. I honestly do not care for it or any waffle iron I’ve ever owned for one reason, a reason that makes me a little shouty: <i>why don’t waffles irons have removable plates for washing?!</i> I have yet to see one and cleaning them is such an ordeal; this is the only waffle recipe I’ve loved enough that it has felt worth the bother.</p>"}], "link": "https://smittenkitchen.com/2013/05-essential-raised-waffles"}