{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cranberry-orange-breakfast-buns1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, citrus, cranberries, fall, orange, photo, thanksgiving", "name": "Cranberry-Orange Breakfast Buns", "author": {"@type": "Organization", "name": "\nDough adapted (mostly in technique) from Alton Brown"}, "description": "<p>Tart cranberries muddle with just enough brown sugar that they sweeten, but are miles from toothache-level sweetness. Orange zest blooms inside a buttery, tender, rich dough. And there’s just enough orange icing to cap the buns, not drench them in candy. I’d call them grown-up cinnamon buns, but I saw a four year-old inhale one and demand another, and we liked them so much I’m trying to invent excuses to make them again. </p>", "totalTime": "", "recipeYield": "12 buns. This recipe could be halved and baked in a 9-inch round or 8×8-inch baking pan.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Dough:</u>", "4 large egg yolks", "1 large whole egg", "1/4 cup (50 grams) granulated sugar", "6 tablespoons (85 grams) butter, melted, plus additional to grease pan", "3/4 cup (175 ml) buttermilk", "Zest of 1 orange, finely grated (to be used in dough and filling, below)", "3 3/4 cups (470 grams) all-purpose flour, plus more for dusting counter", "1 packet (7 grams or 2 1/4 teaspoons) instant dry yeast", "1 1/4 teaspoons coarse or kosher salt, or more to taste", "1 teaspoon oil for bowl", "RECIPE_SUBHED__2<u>Filling:</u>", "1 1/2 tablespoons (20 grams) butter", "1 cup (190 grams) packed light brown sugar", "1 cup (115 grams) fresh cranberries", "Orange zest leftover from above", "RECIPE_SUBHED__3<u>Icing:</u>", "3 1/2 tablespoons (55 ml) orange juice", "2 cups (240 grams) powdered sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Icing:</u><br/>\n3 1/2 tablespoons (55 ml) orange juice<br/>\n2 cups (240 grams) powdered sugar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make the dough:</i> In the bottom of the bowl of a stand mixer, whisk the yolks, whole egg, sugar, butter, buttermilk and 3/4 of the orange zest together (saving the rest for the filling). Add 2 cups of the flour along with the yeast and salt; stir until evenly moistened. Switch to the dough hook and add the remaining 1 3/4 cups flour and let the dough hook knead the mixture on low speed for 5 to 7 minutes. The dough should be soft and moist, but not overly sticky. Scrape the dough into a large, lightly oiled bowl (I usually scrape my dough briefly onto the counter, oil the mixing bowl, and scrape the dough back into it) and cover it with plastic wrap. Let dough rise at room temperature until doubled, which will take between 2 and 2 1/2 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Don’t have a stand mixer? Stir the mixture together with a wooden spoon, then continue stirring and beating it about in a large bowl for several minutes, until it comes together. Turn the dough out onto a floured counter and knead it for another 5 minutes. It will stick; don’t sweat it. Just scrape everything up and into the oiled bowl when it’s time to let it rise. Try to resist adding extra flour when it sticks; it will only toughen the dough. That would be sad.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare the filling:</i> Melt the butter and set it aside. In a food processor, pulse the whole cranberries until they’re ground to a coarse rubble, but not fully pureed. You’ll need to scrape the machine down once or twice. Set them aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Don’t have a food processor? Just hand chop them very well, as if to coarsely mince them.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Assemble the buns:</i> Butter a 9×13-inch baking dish, a heavier ceramic or glass dish is ideal here. Turn the risen dough out onto a floured work surface and roll it into a rectangle that is 18 inches wide (the side nearest to you) and 12 or so inches long. (It’s okay if it goes longer/thinner.) Brush the dough with the melted butter. Sprinkle it with the brown sugar. Scatter the ground cranberries over it, then the remaining orange zest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roll the dough into a tight, 18-inch long spiral. Using a sharp serrated knife, very, very gently saw the log into 1 1/2-inch sections; you should get 12. Arrange the buns evenly spread out in your baking dish. Cover with plastic wrap and refrigerate overnight, or up to 16 hours.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>The next morning, bake the buns:</i> Take your buns out of the fridge 30 minutes before you’d like to bake them, to allow them to warm up slightly. Heat your oven to 350 degrees F. Bake your buns until they’re puffed and golden (the internal temperature should read 190 degrees F), approximately 30 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer pan to a cooling rack and let cool slightly. Make the icing by whisking the orange juice and powdered sugar together. Spread a little on each bun, or drizzle it over the whole pan. Serve immediately. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Many notes:</strong></p>"}], "link": "https://smittenkitchen.com/2013/11-cranberry-orange-breakfast-buns"}