{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/08/rice-stuffed-tomatoes.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "date night, gluten free, grain, italian, photo, summer, tomatoes, vegan, vegetarian, weeknight favorite", "name": "Rice-Stuffed Tomatoes [Pomodori Ripieni di Riso]", "author": {"@type": "Organization", "name": "\nAdapted from a blend of Rachel Eats, Wednesday Chef, Silver Spoon and trial and error"}, "description": "<p>As I mentioned above, you could deck these out with any number of compatible ingredients — crisped bits of proscuitto, mozzarella or pecorino cheese, olives or artichokes and more! Even I couldn’t resist straying from the pure tomato-rice-and-seasonings course with a clove of garlic and few tablespoons of minced onion, as well as a starchier risotto variety of rice. But I’m telling you, it needs none of these things to be late summer dinner bliss. The rice cooks inside the most clear-noted, pure tomato sauce you’ve ever scooped onto a fork and I want August to always taste like this.  </p>", "totalTime": "", "recipeYield": "Serves 6 as a side and 3 as a main. We had these with sausages, but they’d be equally good with last week’s kale salad and/or some salumi. Or, you can do this, which is the way it is done in Rome: Peel and cube a few Yukon gold potatoes, toss them with olive oil, salt and pepper. Arrange them in the baking dish around the tomatoes and bake them simultaneously. This not only keeps the tomatoes upright, it provides a delicious accompaniment.", "recipeIngredient": ["2 to 3 tablespoons olive oil", "Coarse or Kosher salt", "6 medium-to-large (mine were 3 inches across, averaged 8 1/4 ounces in weight) tomatoes", "Red pepper flakes, to taste", "1/4 medium or 1/2 small onion, finely chopped", "1 garlic clove, minced", "9 tablespoons arborio or another short-grained starchy rice", "Few tablespoons chopped parsley, oregano or slivered basil (or mix thereof)", "Handful breadcrumbs, if using (unless using gluten-free breadcrumbs, this will of course negate the dish’s gluten-free status)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 to 3 tablespoons olive oil<br/>\nCoarse or Kosher salt<br/>\n6 medium-to-large (mine were 3 inches across, averaged 8 1/4 ounces in weight) tomatoes<br/>\nRed pepper flakes, to taste<br/>\n1/4 medium or 1/2 small onion, finely chopped<br/>\n1 garlic clove, minced<br/>\n9 tablespoons arborio or another short-grained starchy rice<br/>\nFew tablespoons chopped parsley, oregano or slivered basil (or mix thereof)<br/>\nHandful breadcrumbs, if using (unless using gluten-free breadcrumbs, this will of course negate the dish’s gluten-free status)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350 degrees. Lightly coat an ovenproof baking dish with olive oil. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare tomatoes: Cut the tops off the tomatoes and scoop out tomato juices, seeds and flesh into a non-reactive (i.e. just about anything but aluminum) bowl. I like to use a grapefruit knife to make the first cuts, then a spoon to remove the rest, but you can use anything you have around, being careful not to pierce the bottom of the tomatoes. Salt the cavities of the tomatoes and turn them upside down on a plate to drain.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare reserve: Run scooped-out tomato flesh and juices through a food mill or pulse in a blender until coarsely pureed. Heat a large skillet over medium heat, then add 2 tablespoons olive oil, heating it too. Once hot, add onion, garlic and red pepper flakes, cooking them together for 2 minutes, or until onion begins to soften. Add rice and cook them together for about 3 minutes, or until rice toasts a little. Add tomato puree and bring to a simmer, then reduce heat to medium-low. Season with 3/4 teaspoon salt, then cover skillet with a lid, and let simmer for 10 to 15 minutes, stirring occasionally, until rice is par-cooked. Adjust seasoning if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[If using the potatoes, as mentioned in the Notes up top, prepare them while the rice simmers.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Reassemble tomatoes: Stir fresh herbs into tomato-rice mixture. Arrange tomatoes right-side-up in baking pan then spoon mixture into tomatoes, filling them just 7/8 of the way to leave room for the rice to finish expanding. Coat with breadcrumbs that you can drizzle lightly with olive oil, if using, or you can replace the tomato lid on each (though, do not spend 10 minutes trying to match them back up, as I did last summer. It’s pointless.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake: Uncovered for 30 minutes, until tomato walls are soft and the rice inside has finished cooking. Serve hot. Repeat again tomorrow.</p>"}], "link": "https://smittenkitchen.com/2013/08-rice-stuffed-tomatoes"}