{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2013/08/9460534513_208e0df831_k.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "citrus, lime, photo, popsicles, strawberries, summer", "name": "Strawberry, Lime and Black Pepper Popsicles", "author": {"@type": "Organization", "name": "\nStrawberry cooking and freezing technique from Paletas, flavors from the Red and Black cocktail at Back Forty"}, "description": "<p>Prior to falling in love with this cocktail, I’d only paired strawberry with lemon, and I was missing out because lime is the perfect contrast to strawberry’s spun sugar/cotton candy/pink frosting earnestness. It’s second only to  the black pepper, which you can add at whatever level you’re comfortable with (1/4 teaspoon was only vaguely noticeable, and did not even go mentioned by the resident spice-sensitive preschooler), needn’t add straightforward spiciness so much as a background pick-me-up. You’ll be amazed by how well strawberries and black pepper go together; they’re totally the yin to each other’s yang, even when you’re not doing The After-Bedtime Dip in white tequila.</p><p>Texture-wise, we love that these popsicles, since they’re made from tender fresh strawberries, don’t get rock hard (the way ones made from juice will) but stay tender and totally nibble-able.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["4 slightly heaped cups (about 20 ounces) fresh, ripe strawberries, hulled and quartered", "2/3 to 3/4 cup granulated sugar (we used the latter but use less if you’re sensitive to sugar)", "1/2 cup water", "Juice of 2 limes", "1/4 to 1/2 teaspoon freshly ground black pepper (use less for a barely detectable bite, more if you’d like it more present)", "Pinch of sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>4 slightly heaped cups (about 20 ounces) fresh, ripe strawberries, hulled and quartered<br/>\n2/3 to 3/4 cup granulated sugar (we used the latter but use less if you’re sensitive to sugar)<br/>\n1/2 cup water<br/>\nJuice of 2 limes<br/>\n1/4 to 1/2 teaspoon freshly ground black pepper (use less for a barely detectable bite, more if you’d like it more present)<br/>\nPinch of sea salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine the strawberries and sugar in a bowl; let them sit for 15 minutes if they’re really fresh, longer if they’re firm or off-season berries. Transfer mixture to a saucepan and add the water. Bring to a boil then reduce to a simmer, and cook for 5 minutes. Let cool to room temperature. You can hasten this along by transferring them back to their macerating bowl and setting <i>that</i> in a bowl of ice water. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Once cooled, transfer to a blender or food processor, add the lime juice, pepper and salt and blend until mostly smooth (I find some leftover bits lovely in here). Divide between popsicle molds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[You’ll have about 3 1/4 cups of the mixture, which divides evenly among 10 1/3-cup molds, with 1/4-inch space on top to make room for expansion in freezing.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Freeze for about 5 hours, or until completely frozen. Dip in lukewarm water for 10 seconds to unmold each popsicle.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>If After-Bedtime Dipping:</i> Put a shot of white tequila in a glass wide enough to dip popsicle. Yes, you can double-dip.</p>"}], "link": "https://smittenkitchen.com/2013/08-strawberry-lime-and-black-pepper-popsicles"}