{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/asparagus-stuffed-eggs1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "asparagus, breakfast, easter, eggs, gluten free, party snacks, photo, spring, vegetarian", "name": "Asparagus-Stuffed Eggs", "author": {"@type": "Organization", "name": "\nAdapted from From Julia Child’s Kitchen (Knopf, 1975)"}, "description": "<p>Feel free to replace the asparagus purée with a purée of another spring vegetable such a artichoke hearts (choke and leaves removed; one should be sufficient), spinach, favas or peas. In each case you’ll want about 2 tablespoons drained purée per 6 whole eggs, and you’ll want to cook the vegetable until tender, blend it and drain the liquid a bit as explained below before mixing it into the mashed egg yolks. Adjust flavorings to the ingredient; artichokes go wonderfully with lemon zest and mayonnaise; peas with cream and mint. </p>", "totalTime": "", "recipeYield": "12 stuffed egg halves", "recipeIngredient": ["6 large eggs", "4 medium asparagus spears", "2 teaspoons very finely minced shallot, scallion or chives, plus a pinch extra for garnish", "3 tablespoons mayonnaise, whipping cream, creme fraiche, sour cream and/or soft butter", "1/2 teaspoon smooth Dijon (optional)", "Few gratings fresh lemon zest (optional)", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>6 large eggs<br/>\n4 medium asparagus spears<br/>\n2 teaspoons very finely minced shallot, scallion or chives, plus a pinch extra for garnish<br/>\n3 tablespoons mayonnaise, whipping cream, creme fraiche, sour cream and/or soft butter<br/>\n1/2 teaspoon smooth Dijon (optional)<br/>\nFew gratings fresh lemon zest (optional)<br/>\nSalt and pepper to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Hard-boil eggs using whichever method you prefer. I cover mine with cold water, bring it to a boil, then set a timer for 9 1/2 minutes. When it rings, drain the eggs, and plunge them in ice water until they’re fully cool. Eggs can be cooked ahead of time and stored in the fridge for up to 4 days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook asparagus spears in salted simmering water until full tender, about 4 to 5 minutes. Drain and plunge in cold water. Drain and again and spread on towels to dry out as much as possible. Cut 1/2-inch off the tips of each spears and cut these tips lengthwise (they’ll be your garnish). Puree remaining asparagus — I found that my food processor didn’t do a great job due to the small volume, but yours might. A food mill with a fine disc works well here. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You’ll want to remove the excess water from your puree; I did so by spreading it for a minute on a few paper towel layers. If you don’t, the filling will be soggy and damp, or in Julia’s words, “a disappointing texture and flavor.” </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Peel your eggs. Dip your knife in water before cutting each in half lengthwise for a cleaner cut. Shave a thin strip off the bottom of each so that it will not rock about in its dish. Remove the yolks and press them through a fine-mesh strainer to sieve them. Add asparagus puree, shallot or chives, mayonnaise or cream, Dijon or lemon zest (if using) and combine mixture until smooth. Season carefully with salt and freshly ground black pepper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can spoon the mixture into each egg half, or use a piping bag with a star tip for a fancier presentation. Decorate each stuffed egg with a reserved asparagus tip (you’ll be a little short of what you need), and the remaining with the extra shallot, scallion or chives. Wrap tray in plastic and keep in fridge until ready to serve. </p>"}], "link": "https://smittenkitchen.com/2014/04-asparagus-stuffed-eggs"}