{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blueberry-crumb-cake1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "blueberries, everyday cakes, photo, picnics, summer", "name": "Blueberry Crumb Cake", "author": {"@type": "Organization", "name": "\nAdapted from Maida Heatter’s Book of Great Desserts"}, "description": "<p>There are several things about this cake that always stand out to me. First, while most cakes of this size use a quarter pound of butter, plus an additional quarter or eighth for the crumb, this uses half and you don’t notice any missing. There’s as much butter in the cake as there is in the streusel, which I see as a sign that Heatter had her priorities straight. Second, every time I make the streusel topping, I find it too buttery and soft; I’m eager to add more flour to make it more crumbly but I recommend resisting because Heatter knows what she’s doing. The streusel will seem moist but when it bakes, it will both become crumb-like and adhere well to the cake, so you lose very little when you flip the cake out of the pan. I should know not to doubt her, anyway.</p>", "totalTime": "", "recipeYield": "Serves 8 in big wedges or 16 in the 2×2-ish-inch grid I cut mine roughly into", "recipeIngredient": ["RECIPE_SUBHED__1<u>Topping:</u>", "5 tablespoons (40 grams) all-purpose flour", "1/2 cup (100 grams) granulated sugar", "1 teaspoon ground cinnamon", "4 tablespoons (1/4 cup, 2 ounces or 55 grams) unsalted butter, cold is fine", "Pinch of salt", "RECIPE_SUBHED__2<u>Cake:</u>", "2 cups minus 1 tablespoon (i.e. 1 3/4 cups + 3 tablespoons or 240 grams) all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon table salt", "4 tablespoons (1/4 cup, 2 ounces or 55 grams) unsalted butter, softened", "3/4 cup (150 grams) granulated sugar", "Zest of 1 lemon", "1 large egg", "1 teaspoon vanilla extract", "1 pint (2 to 2 2/3 cups, 12 to 16 ounces, or 340 to 455 grams; see Note) fresh blueberries, clean and dry", "1/2 cup milk, whole is ideal, any kind should work", "1/2 cup (55 grams) walnuts, chopped medium fine (optional)", "Confectioners’ sugar, for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cake:</u><br/>\n2 cups minus 1 tablespoon (i.e. 1 3/4 cups + 3 tablespoons or 240 grams) all-purpose flour<br/>\n2 teaspoons baking powder<br/>\n1/2 teaspoon table salt<br/>\n4 tablespoons (1/4 cup, 2 ounces or 55 grams) unsalted butter, softened<br/>\n3/4 cup (150 grams) granulated sugar<br/>\nZest of 1 lemon<br/>\n1 large egg<br/>\n1 teaspoon vanilla extract<br/>\n1 pint (2 to 2 2/3 cups, 12 to 16 ounces, or 340 to 455 grams; see Note) fresh blueberries, clean and dry<br/>\n1/2 cup milk, whole is ideal, any kind should work<br/>\n1/2 cup (55 grams) walnuts, chopped medium fine (optional)<br/>\nConfectioners’ sugar, for dusting (optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 375°F. Butter a 9-inch round baking pan (with at least 2″ sides) and dust it lightly with flour; line it with a round of parchment paper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare the topping by mixing the flour, sugar, cinnamon and salt, then cutting the butter in with a pastry blender, fork or your fingertips until the mixture resembles coarse crumbs. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a medium bowl, whisk flour, baking powder, and salt until combined. In a large bowl, beat butter, sugar and zest together until light and fluffy. Add egg and vanilla and beat until combined. Beat in 1/3 of the dry ingredient mixture until just combined, followed by 1/2 the milk; repeat with remaining dry ingredients and milk, finishing with the dry mixture. The batter will be very stiff, but don’t fret. Fold blueberries into cake batter until evenly distributed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop cake batter into prepared pan and smooth so that it is flat. If using walnuts, scatter them on top. Sprinkle with prepared streusel. Bake in heated oven for 40 minutes, or until a toothpick inserted into the middle of the cake comes out batter-free. You can let the cake cool complete in the pan on a rack, or just cool it in the pan for 20 minutes before flipping it out onto a cooling rack, removing the parchment paper lining, and flipping it back onto a plate. Dust with confectioners’ sugar, if using. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Do ahead:</i> Cake keeps covered with plastic or foil at room temperature for three days. If longer, it might be best to keep it in the fridge. It gets more moist each day.</p>"}], "link": "https://smittenkitchen.com/2014/07-blueberry-crumb-cake"}