{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blue-and-red-berry-ricotta-galettes1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "blueberries, cherries, photo, picnics, raspberries, summer, tarts pies", "name": "Blue and Red Berry Ricotta Galette", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I added some ricotta to the dough, which gave a nice subtle flavor, but you could replace that easily with yogurt or sour cream. Leakage is almost inevitable when making galettes but you shouldn’t sweat it because I’m convinced that it’s more distressing for the baker (who knows exactly how much jammy deliciousness has been lost) than anyone eating a wedge (it will taste like nothing is missing at all). Let it gooooo, I say, as all the preschoolers sing.</p><p>Here’s the PDF template I made to help you form a star shape, if desired. As should be abundantly evident, I’m no graphic designer, but it will hopefully give you a start.</p>", "totalTime": "", "recipeYield": "1 7.5 to 8-inch galette, double or triple to make additional flavors", "recipeIngredient": ["RECIPE_SUBHED__1<u>Pastry</u>", "1 1/4 cups (160 grams) all-purpose flour", "1/2 teaspoon table salt", "1 1/2 teaspoons granulated sugar", "Zest of half a lemon", "8 tablespoons (4 ounces or 113 grams) cold unsalted butter, cut into pieces", "1/4 cup ricotta, yogurt or sour cream", "3 to 4 tablespoons cold water", "RECIPE_SUBHED__2<u>Filling</u>", "2 cups berries or chopped fruit (I used raspberries and cherries on the red one, blueberries for on the blue)", "3 to 4 tablespoons granulated sugar (use the lower amount if your fruit is especially sweet)", "2 tablespoons cornstarch", "Juice of half a lemon", "Pinch of salt", "RECIPE_SUBHED__3<u>Glaze</u>", "1 egg yolk beaten with 1 teaspoon water", "1 heaped teaspoon turbinado or coarse sugar for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Glaze</u><br/>\n1 egg yolk beaten with 1 teaspoon water<br/>\n1 heaped teaspoon turbinado or coarse sugar for sprinkling</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make dough:</i> Whisk the flour, salt, sugar and zest together in the bottom of a large bowl. Work the butter into the flour with your fingertips or a pastry blender until mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. Stir ricotta and 3 tablespoons water together in a small dish and pour into butter-flour mixture. Stir together with a flexible spatula as best as you can, then use your hands to knead the mixture into a rough, craggy ball. Wrap in plastic and flatten into a disc. Chill in the fridge for 1 hour or up to 48 hours, or you can quick-firm this in the freezer for 15 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Assemble galette:</i> Heat oven to 400 degrees. On a floured counter, roll the dough out into a large round-ish shape, about 14 to 15 inches across. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[If you’d like to form yours into a star, as shown, use the red dashed outline of <a href=\"https://smittenkitchendotcom.files.wordpress.com/2014/07/star-galette-stencil1.pdf\">this template [PDF]</a>. It will print smaller on an 8.5×11-inch piece of paper than you need, but you can use it as a rough guide to cut as large of a pentagon shape <a href=\"https://www.flickr.com/photos/smitten/14365010669\">as your dough will allow</a>.] </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer round or pentagon-shaped dough to a parchment-lined baking sheet; I like to fold my dough gently, without creasing, in quarters then unfold it onto the baking pan. [If you’re making a star, cut a 1-inch notch in the center of each side, angling it toward the center, as shown in the blue dashed lines of the template.] </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stir together all of the filling ingredients and spread them in the center of the dough, leaving a 2-inch border. If you’re making a round galette, fold the border over the filling, pleating the edge to make it fit. [If you’re making a star shape, fold each of the 5 corners into the center, along the green dotted lines of the template. Pinch the outer corners closed, to seal in the filling and the shape.] </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk egg yolk and water together and brush over exposed crust. Sprinkle with coarse sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Bake galette</i>: For 30 minutes, or golden all over. Remove from the oven and let stand for 5 minutes, then slide the galette onto a serving plate. Cut into wedges and serve hot, warm or at room temperature, preferably with vanilla ice cream. [My favorite vanilla ice cream recipe is used <a href=\"https://smittenkitchen.com/blog/2013/07/hot-fudge-sundae-cake/\">here</a>.]</p>"}], "link": "https://smittenkitchen.com/2014/07-blue-and-red-berry-ricotta-galette"}