{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/01/cheese-blintz.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "jewish, pancakes, photo, russian, vegetarian, winter", "name": "Cheese Blintz", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>This recipe is flexible enough that you can adjust it to your tastes and what you have around while hopefully not being so flexible that you’re unnecessarily worried about which way to get started. (Hint: Just do what sounds best.) If you have a crêpe recipe you like best, go ahead and use it here instead, but if you’re a crêpe newbie, I think you’ll find this one remarkably easy. Use a small skillet if you have one; I think 6 to 7-inch is the ideal crêpe size for blintz, but am limited to 8- to 9-inch crêpe due to the skillets I have. As for fillings, you can use no egg or yolk, or, you can add a yolk or two for richness (great with more dry cheeses) or a whole egg for firmness (great with wetter fillings, like a loose/watery cottage or ricotta cheese). You can add more sugar (up to 1/4 cup) to the filling if you like a sweet blintz; I prefer just a tiny amount, since we always use sweet toppings and I prefer a taste contrast.</p><p>Favorite toppings, from the archives: This Sour Cherry Compote, this Strawberry-Rhubarb Compote, this Strawberry Coulis, this Blackberry Sauce, or, if you, like me, canned a copious amount of strawberry jam that never set last summer, this is the most heavenly place to enlist it.</p>", "totalTime": "", "recipeYield": "Yield (with 8-inch crêpe and 3 tablespoons of filling in each): 12", "recipeIngredient": ["RECIPE_SUBHED__1<u>Wrappers</u>", "4 tablespoons unsalted butter, melted and cooled slightly", "1 cup milk (fat level shouldn’t matter, but I use whole)", "4 large eggs", "1 cup all-purpose flour (I swap 1/3 to 1/2 regularly with whole wheat, and did so here)", "Few pinches of salt", "RECIPE_SUBHED__2<u>Filling</u>", "2 cups farmer’s cheese, quark, a thicker cottage cheese or ricotta", "6 tablespoons sour cream, mascarpone, creme fraiche or softened cream cheese", "2 tablespoons granulated sugar (or more to taste, see Note up top)", "1/4 teaspoon vanilla extract (if desired)", "Few gratings fresh lemon zest (if desired)", "2 large egg yolks or 1 large egg (optional, see Note up top)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Filling</u><br/>\n2 cups farmer’s cheese, quark, a thicker cottage cheese or ricotta<br/>\n6 tablespoons sour cream, mascarpone, creme fraiche or softened cream cheese<br/>\n2 tablespoons granulated sugar (or more to taste, see Note up top)<br/>\n1/4 teaspoon vanilla extract (if desired)<br/>\nFew gratings fresh lemon zest (if desired)<br/>\n2 large egg yolks or 1 large egg (optional, see Note up top)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make wrapper/crêpe batter:</i> Combine wrapper ingredients in a blender, or in a bowl with an immersion blender, or whisk by hand until smooth. Cover with plastic wrap and refrigerate for an hour or up to two days. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Cook wrappers/crêpes:</i> Heat a medium skillet or crêpe pan over medium-high heat. Once heated, brush pan lightly with melted butter or oil. If batter has gotten too thick to pour thinly in the fridge, you can add an additional tablespoon or two of milk or water to thin it. Pour 3 to 4 tablespoons batter into skillet, just enough that it coats the bottom in an even layer when you swirl it around. Let cook, undisturbed, until the crêpe becomes a little golden underneath or at the edges. (We can cook these more pale than dessert crêpe, because we’re going to cook them again before serving.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Here’s my crêpe-flipping technique: I use a <a href=\"http://www.amazon.com/gp/product/B0000VLEU4/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0000VLEU4&amp;linkCode=as2&amp;tag=smitten-20\">small offset spatula</a> (my first kind of favorite spatula) to loosen the edges and get underneath the crêpe enough to lift it. Then, in the lifted space between the crêpe and the skillet, I put a <a href=\"http://www.amazon.com/gp/product/B000GGTYC8/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000GGTYC8&amp;linkCode=as2&amp;tag=smitten-20\">flexible fish spatula</a> (my second favorite kind of spatula) further underneath, remove the “lifting” offset spatula, and then use the bigger one to flip it in one movement. If it lands off-center, just shimmy the skillet until it goes back into place. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook the crêpe on the reverse side for another 20 seconds, then slide onto a plate to cool. Repeat with remaining batter, brushing the skillet with additional oil or butter as needed. You can stack the crêpe on top of each other even when they’re hot; they will not stick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Either use the crêpe right away, or cover the plate with plastic wrap and use them in the next 2 days.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make filling and fill wrappers:</i> Mix all filling ingredients together until smooth. Place 3 tablespoons or so filling across the center of the top wrapper/crêpe in your stack. Fold the bottom part of the wrapper up and over it; fold the sides in over the bottom and filling, then fold the pancake up to form an egg roll-like shape filled pancake.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can use these blintz right away, or refrigerate them for up to 2 days or freeze them between layers of waxed paper for up to 2 months. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Serve the blintz:</i> Heat a pat of butter over medium heat in a skillet. Fry blintz until browned on both sides. Transfer to a place and serve with sour cream or a fruit sauce or jam or your choice.</p>"}], "link": "https://smittenkitchen.com/2014/01-cheese-blintz"}