{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/sticky-sesame-chicken-wings1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, chinese, party snacks, photo, quick, weeknight favorite", "name": "Sticky Sesame Wings", "author": {"@type": "Organization", "name": "\nAdapted, barely, from Gourmet Magazine"}, "description": "<p>You can definitely mess with the proportions here; we’ve also enjoyed it with slightly more hoisin and half the honey. I think a little grated fresh ginger could be good in here, as well as a dash or two of Sriracha. We had this with rice (I’m currently enamored with this and this) and roasted asparagus. If I hadn’t waited until the last minute, I may have made this Mango Slaw with Cashews and Mint or the Sugar Snap Slaw with Sesame-Miso Dressing from TSKC.</p><p>If you can’t find “wingettes” (often sold as “party wings”), use regular chicken wings but cut off tips from chicken wings with kitchen shears or a large heavy knife (you can use them for stock), then halve wings at the joint. </p>", "totalTime": "", "recipeYield": "4 main-course servings", "recipeIngredient": ["3 pounds chicken wingettes or chicken wings (see note up top)", "1 large garlic clove, minced", "1 teaspoon coarse or kosher salt, plus more to taste", "2 tablespoons soy sauce", "2 tablespoons hoisin sauce", "2 tablespoons mild honey (I often halved this)", "1 teaspoon Asian sesame oil", "Pinch of cayenne or dash of Sriracha", "1 1/2 tablespoons sesame seeds, lightly toasted", "1 scallion, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 pounds chicken wingettes or chicken wings (see note up top)<br/>\n1 large garlic clove, minced<br/>\n1 teaspoon coarse or kosher salt, plus more to taste<br/>\n2 tablespoons soy sauce<br/>\n2 tablespoons hoisin sauce<br/>\n2 tablespoons mild honey (I often halved this)<br/>\n1 teaspoon Asian sesame oil<br/>\nPinch of cayenne or dash of Sriracha<br/>\n1 1/2 tablespoons sesame seeds, lightly toasted<br/>\n1 scallion, finely chopped</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 425°F. Line a large shallow baking pan with foil and lightly oil it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><a href=\"https://www.flickr.com/photos/smitten/14404915067/in/photostream\">Stir wings together</a> with garlic, salt, soy, hoisin, honey, sesame oil and cayenne or Sriracha until coated. Spread wings and any sauce that fell to the bottom of the bowl out on the prepared baking pan in one layer. Roast, turning over once, until cooked through, about 35 minutes. Transfer wingettes to a large serving bowl* and toss with sesame seeds and scallion.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* If you end up with a puddle of sauce in the bottom of your baking pan (I did the one time they were more tightly packed in a dish), after removing the wings, you can pour the extra sauce into a saucepan and reduced it until thick, then stir it over the roasted wings before adding the sesame seeds and scallion.</p>"}], "link": "https://smittenkitchen.com/2014/07-sticky-sesame-chicken-wings"}