{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/07/three-ingredient-summertime-salsa.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, party snacks, photo, picnics, quick, summer, tex mex, tomatoes, vegetarian", "name": "Three-Ingredient Summertime Salsa", "author": {"@type": "Organization", "name": "\nFrom Lisa Fain, via Cup of Jo"}, "description": "<p>Salsas made with fresh, instead of canned, tomatoes have a complexity of flavor unmatched by anything in a jar. You can char these under your oven’s broiler or even on a grill. Although this is wonderful with just the three core ingredients, I like to add a halved white onion to the tray for charring, and blend it in, and finish the salsa with lime juice. A spoonful of chipotle from a can (more or less to taste) would also be delicious here, or a handful of fresh cilantro. Don’t forget to season the salsa well. Since jalapeños can range wildly in heat level, I recommend cutting the tiniest bevel off the end of each and trying it to get an idea of how hot that pepper will be. If it’s very strong, you might find you only need one here. Or five, if you’re my husband. </p>", "totalTime": "", "recipeYield": "About 1 1/2 cups salsa", "recipeIngredient": ["1 pound plum or roma tomatoes, stemmed and cut in half", "1 or 2 jalapeños (depending on how hot you want the salsa), stemmed and cut in half", "2 cloves garlic, peeled", "Salt and pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound plum or roma tomatoes, stemmed and cut in half<br/>\n1 or 2 jalapeños (depending on how hot you want the salsa), stemmed and cut in half<br/>\n2 cloves garlic, peeled<br/>\nSalt and pepper, to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn on your broiler and place a rack five inches away from the heating element. Line a skillet or baking sheet with foil and place the tomatoes, jalapeño halves and garlic on the skillet; season with salt. Cook under the broiler for five minutes (this, and all broiling steps, took much longer in my weak oven), or until the jalapeño and garlic have brown spots. Remove the jalapeño and garlic from the skillet and place in a blender.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, return the skillet to the oven and continue to broil the tomatoes for five more minutes, or until they have browned on top. Remove the tomatoes from the oven and add them to the blender, also pouring into the blender any juices that may be in the skillet. Begin to pulse on a low speed until the salsa reaches your desired texture; I usually add about 2 tablespoons water to loosen mine — you may need up to 1/4 cup, or more, for a thinner salsa. Adjust salt and pepper to taste. Eat with everything.</p>"}], "link": "https://smittenkitchen.com/2014/07-three-ingredient-summertime-salsa"}