{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/soft-pretzel-buns-and-knots1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, german, grilling, photo, summer", "name": "Soft Pretzels Hot Dog Buns, Hamburger Buns and Knots", "author": {"@type": "Organization", "name": "\nAdapted from Zingerman’s Bakehouse via the NYTimes"}, "description": "<p>Time: 2 hours (1 1/2 hours rising time)</p>", "totalTime": "", "recipeYield": "14 hot dog buns, 12 hamburger buns, 32 tiny soft pretzel knots, 12 to 16 large soft pretzels knots (12 the size you’d see at a beer hall) or 16 sandwich rolls", "recipeIngredient": ["RECIPE_SUBHED__1<u>For dough</u>", "1 tablespoon barley malt syrup or dark brown sugar", "2 tablespoons lard or softened or melted and cooled unsalted butter", "2 tablespoons instant or rapid-rise yeast", "2 cups lukewarm water", "6 cups (about 30 ounces) all-purpose or bread flour", "1 tablespoon plus 1/2 teaspoon kosher salt ", "RECIPE_SUBHED__2<u>For dipping</u>", " (pick one)", "1/4 cup baking soda (for ", "<em>standard baking soda bath</em>", "), 1 cup baking soda (for ", "<em>concentrated baking soda bath</em>", ") or 1/4 cup food-grade lye (for darkest, most authentic finish and flavor)", "Water", "RECIPE_SUBHED__3<u>To finish</u>", "1 large egg (for baking soda methods only)", "Coarse sea salt or pretzel salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To finish</u><br/>\n1 large egg (for baking soda methods only)<br/>\nCoarse sea salt or pretzel salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make dough:</i> In a mixing bowl (or the bowl of a stand mixer), stir together syrup or sugar, lard or butter, yeast, water and half the flour. Add kosher salt and remaining flour and stir just until mixture comes together in a shaggy mass. Turn out onto counter (or attach dough hook to mixer) and knead for 8 to 10 minutes, until smooth and supple. Cut into desired number of pieces (see Yield above) and let rest 5 minutes before shaping. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To form hamburger buns or sandwich rolls, form each piece into a ball and stretch and tuck the sides under, forming a neat round. To form hot dog buns, form each piece into a 7-inch log. To form pretzel knots, roll each piece into a rope (traditionally, the ends are skinny and the center is fat). Lift the ends, twist them around each other once and bend the twist back, pressing the ends onto the ‘belly’ at about 4 and 8 o’clock. Stretch the “shoulders” of the pretzels out as much as desired. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer formed pretzel buns and knots onto baking sheets lined with parchment paper (for easiest removal), giving each room to grow. Let rest at room temperature for 30 minutes (no need to cover them, but I could not resist lightly covering them with plastic to protect from drafts), then in the fridge for 1 hour or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using <em>concentrated baking soda bath</em>, you’ll want to begin prep now. Heat oven to 250 to 300 degrees F. Spread 1 cup baking soda on a foil-lined baking sheet. Bake baking soda for one hour. You’ll have about 2/3 cup when you’re done; you’ll use it in a minute. Because of its concentration, it’s best to use latex gloves when touching it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 425 degrees F.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Dip your pretzels:</i></p>"}], "link": "https://smittenkitchen.com/2014/05-soft-pretzel-buns-and-knots"}