{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/coconut-tapioca-pudding-with-mango1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "coconut, gluten free, mango, photo, pudding, winter", "name": "Coconut Tapioca Pudding with Mango", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "Makes 6 just shy of 1/2 cup each pudding cups, plus toppings", "recipeIngredient": ["RECIPE_SUBHED__1<u>Pudding</u>", "1/3 cup small pearl tapioca (I used ", "<a href=\"http://www.amazon.com/gp/product/B0019GVYX6/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0019GVYX6&amp;linkCode=as2&amp;tag=smitten-20\">this</a>", ")", "2 1/2 cups coconut milk (light or full-fat; a 13.5-ounce can will contain 1 3/4 cups)", "1 egg yolk", "1/3 cup granulated sugar", "1/4 teaspoon table salt or a heaped 1/4 teaspoon sea salt", "1/2 teaspoon vanilla extract or the seeds from a 1-inch segment of vanilla bean", "RECIPE_SUBHED__2<u>Mango puree</u>", "1 very ripe mango, peeled, pitted and roughly chopped", "2 teaspoons granulated sugar (optional; I used it but would skip it next time)", "A squeeze or two of fresh lime juice", "RECIPE_SUBHED__3<u>Optional garnishes</u>", "Whipped coconut cream", "1/2 cup toasted coconut flakes", "Few gratings of lime zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Optional garnishes</u><br/>\nWhipped coconut cream<br/>\n1/2 cup toasted coconut flakes<br/>\nFew gratings of lime zest</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make pudding:</u> In a medium saucepan, soak tapioca in coconut milk for 30 minutes. Whisk in egg yolk, sugar, salt and vanilla bean seeds, if using (if using extract, you’ll add it in a bit). Place saucepan over medium heat until mixture comes to a simmer, then reduce it to very low heat so it’s barely bubbling, and cook it until it thickens, about 15 minutes, stirring frequently. Remove from heat and add vanilla extract, if using. [Pudding will be the consistency of thick gravy — i.e. worrisomely thin — going into the cups but after chilling in the fridge, it will set.] Pour into pudding cups to chill for several hours or overnight. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make mango puree:</u> Place mango chunks in food processor with sugar (if using) and lime juice and blend until very smooth, scraping down the sides several times, if needed. Refrigerate puree until needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve with mango puree on top, plus whipped coconut cream, toasted coconut flakes or a few gratings of lime zest.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>To make whipped coconut cream:</i> This a bit of advance planning. Place 1 can of full-fat coconut milk in the fridge overnight; in most brands, this will cause the coconut fats and thin milk/watery part to separate. Place a small/medium mixing bowl in the freezer, ideally metal. The next day, turn it upside-down before opening it, so that the thickened coconut fat will be at the bottom. Pour off the thin coconut milk; you should have about 1 cup and this can be used towards the 2 1/2 cups needed for your pudding. About 2/3 cup thickened coconut fat will remain at the bottom of the can; scrape this into your chilled bowl, add about 1 tablespoon granulated sugar (for a light sweetness; use more to taste) and beat it with an electric mixer until thick and whipped cream-like. Dollop it over desserts such as this, though you’ll have more than you need for 6 puddings. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>To toast coconut chips:</i> Heat an oven to 350 degrees F. Spread coconut flakes on a rimmed baking sheet and toast until golden brown and fragrant, about 5 minutes, tossing once if needed to help them brown evenly. Let cool before using.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>How to use a vanilla bean:</i> Cut off desired amount of bean. With a sharp paring knife, split the segment lengthwise. Use the back of the knife to scrape the seeds out of the open pod; they’ll be on both sides and look a bit like sticky tar. Use these in your pudding. Go ahead and throw the pods in, too, for extra flavor, just remember to fish them out before chilling the pudding.</p>"}], "link": "https://smittenkitchen.com/2014/01-coconut-tapioca-pudding-with-mango"}