{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/10/cauliflower-slaw1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cauliflower, fall, lunch, photo, picnics, salad, side dish, thanksgiving, vegan, vegetarian", "name": "Cauliflower Slaw", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Although I love and prefer this salad exactly the way it is, I don’t think it would be bad with substitutions, whether you make them due to personal preferences or just what you have around. Raisins or another dried fruit would probably work for the currants; other briny things like chopped green olives or even cornichon could probably work instead of capers (don’t bother frying them), almonds could be swapped with any nut that you prefer, just toast them well, etc. </p>", "totalTime": "", "recipeYield": "Makes about 3 cups which, for us, is never enough. 3 cups will be 2 large portions or 4 petite ones.", "recipeIngredient": ["1/2 cup thinly sliced almonds", "Juice of half a lemon (about 1 tablespoon), plus more to taste", "1 tablespoon white wine vinegar", "1/4 teaspoon fine sea salt or table salt, then more to taste", "3 tablespoons (30 grams) dried currants", "5 tablespoons olive oil, plus more for frying", "2 tablespoons (about 25 grams) brined or salt-packed capers", "oil for frying", "1 small, compact-looking head of cauliflower (about 1 1/4 pounds)", "Freshly ground black pepper", "3 scallions, thinly sliced (use green and white parts)", "2 tablespoons chopped flat-leaf parsley (optional, mostly for color)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 cup thinly sliced almonds<br/>\nJuice of half a lemon (about 1 tablespoon), plus more to taste<br/>\n1 tablespoon white wine vinegar<br/>\n1/4 teaspoon fine sea salt or table salt, then more to taste<br/>\n3 tablespoons (30 grams) dried currants<br/>\n5 tablespoons olive oil, plus more for frying<br/>\n2 tablespoons (about 25 grams) brined or salt-packed capers<br/>\noil for frying<br/>\n1 small, compact-looking head of cauliflower (about 1 1/4 pounds)<br/>\nFreshly ground black pepper<br/>\n3 scallions, thinly sliced (use green and white parts)<br/>\n2 tablespoons chopped flat-leaf parsley (optional, mostly for color)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350 degrees F. Spread almonds on a tray and toast them until they’re a deep golden color, tossing them once or twice to ensure even cooking. This will take 10 to 14 minutes. Set aside to cool.** </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, place lemon juice, vinegar and 1/4 teaspoon salt in a small bowl. Add currants; set aside and let them soak while you prepare the other ingredients. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using brined capers, drain and spread them on paper towels until most of their moisture has wicked out, about 5 minutes. If using salt-packed capers, soak them in water for 10 minutes to remove the saltiness, then drain, rinse and pat dry on paper towels. Pour a 1/2-inch of olive oil or another oil that you prefer to fry in in a small skillet or saucepan. Heat it over medium-high. When hot enough that a droplet of water added to the oil hisses, carefully add the capers and step back — they’re going to sputter a bit for the first 10 seconds. Once it’s safe to get closer, give them a stir. Depending on how dry they were, it can take 1 to 2 minutes for them to get lightly golden at the edges and then crisp. Remove with a slotted spoon. Drain on paper towels.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Trim cauliflower leaves and cut head into quarters. Using an adjustable-blade slicer (<a href=\"http://www.amazon.com/gp/product/B0000VZ57C/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0000VZ57C&amp;linkCode=as2&amp;tag=smitten-20&amp;linkId=UDYRIMV5M4YUENUB\">this</a> is mine; it takes up very little room) to cut cauliflower, stem and florets, into 1/4-inch slices. Add to a large bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scoop currants from vinegar mixture with a slotted spoon and add to bowl with cauliflower, along with almonds, capers, scallions and parsley. Slowly whisk 5 tablespoons olive oil into remaining vinegar mixture in a thin stream. Add several turns of freshly ground black pepper. Pour over cauliflower and other ingredients and turn gently to coat all pieces. Taste and adjust seasonings, adding more lemon juice, salt or pepper to taste. Dig in!</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>** P.S. I really tried to avoid this pesky oven step by toasting mine in a skillet, the one I’d use to fry the capers in a few minutes. Twice, I failed because the little bits got black and smoky before the larger ones toasted, no matter how much I kept them moving. I’m pretty sure I could do better in the future, but I was running out of almonds. If you trust your pan-toasting skills, feel free to cook the almonds there instead.</p>"}], "link": "https://smittenkitchen.com/2014/09-cauliflower-slaw"}