{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/10/fall-toush-salad-with-delicata-and-brussels1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brussels sprouts, fall, lunch, middle eastern, photo, vegan, vegetarian, winter squash", "name": "Fall-Toush Salad with Delicata Squash and Brussels Sprouts", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Aside from the delicious swirl of lemon, parsley, mint, garlic, scallions against sweet roasted squash and nutty roasted brussels sprouts, one of the key flavors/ingredients in a classic fattoush salad is ground sumac (read more here too), a stunning dark red spice that tastes like paprika has been crossed with citric acid — it’s, in fact, sour and one of my favorite spices. However, because most big grocery stores don’t carry it, it puts me in a position I generally try to avoid, which is sharing a recipe with an obscure ingredient. Here’s the deal, though: If you don’t have it, you’ll be fine without it. Replace it with an equal amount of paprika (not a smoky one) and another squeeze of lemon if you so desire. You probably won’t find anything to be missing because the salad has plenty of flavor without it. If you’d like to seek some out, however, I consider it abundantly worth the $5 investment. You can buy it here, here, here or here (a new-ish spice shop on the Lower East Side), or likely any Middle Eastern market you can get to. I replaced my old dusty bottle yesterday at Kalustyan’s.</p>", "totalTime": "", "recipeYield": "Serves 2 in a meal-sized portion or 4 as an appetizer or side — i.e. it’s not a huge bowl, but it’s hearty", "recipeIngredient": ["RECIPE_SUBHED__1<u>Salad</u>", "3 tablespoons olive oil, possibly plus another spoonful", "1 1/4 pound delicata squash (one medium)", "1/2 pound brussels sprouts", "Salt and freshly ground black pepper or Aleppo pepper flakes to taste", "1 large pita bread", "Kosher salt", "2 scallions, thinly sliced", "About 1 tablespoon mint leaves, finely chopped", "About 1 tablespoon flat-leaf parsley or cilantro leaves, finely chopped", "Additional ground sumac or paprika, to finish", "RECIPE_SUBHED__2<u>Dressing</u>", "2 teaspoons ground sumac or paprika (see Note above)", "2 teaspoons warm water", "1 to 2 tablespoons lemon juice", "1 small garlic clove, minced", "1 teaspoon white wine vinegar", "4 tablespoons olive oil", "Salt and freshly ground black pepper or Aleppo pepper flakes to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Dressing</u><br/>\n2 teaspoons ground sumac or paprika (see Note above)<br/>\n2 teaspoons warm water<br/>\n1 to 2 tablespoons lemon juice<br/>\n1 small garlic clove, minced<br/>\n1 teaspoon white wine vinegar<br/>\n4 tablespoons olive oil<br/>\nSalt and freshly ground black pepper or Aleppo pepper flakes to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare vegetables: </i> Heat oven to 400F.  Coat two baking sheets with a tablespoon or so of olive oil each. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut ends off delicata squash and scrape out seeds with a spoon. [Did you know you can toast these like pumpkin seeds for a crispy garnish? You can!] Slice squash into 1/2-inch rings, then cut each ring into 1 to 2-inch chunks (I cut each ring into 1/6ths). Spread on first baking sheet in one layer; sprinkle with salt and pepper. Roast for 20 to 25 minutes, until bronzed underneath, then flip and roast for another 10 to 13 minutes, until browned at the edges and tender in the center. Set aside to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, trim ends and any discolored leaves from brussels sprouts and halve them lengthwise.   Spread cut-side-down on second baking sheet; sprinkle with salt and pepper. Roast for 15 minutes, then flip sprouts and roast them for another 5 to 10 minutes, until toasty and crisp. Set aside to cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare pita chips: </i> Split pita into two layers and cut or tear into large bite-sized chunks. Toss in a bowl with a little less than 1 remaining tablespoon olive oil and a couple pinches of salt. Spread on a baking sheet (I reused my brussels sheet, because they were done first) and toast in oven with vegetables for 5 to 8 minutes, until golden and crisp.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make dressing: </i> Soak sumac in water for 5 minutes, then whisk in remaining dressing ingredients. Adjust seasonings to taste; you may find you need more lemon juice or vinegar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Assemble salad: </i> In a medium-large bowl, combine warm roasted vegetables and scallions. Toss with 1/2 to 2/3 dressing, or to taste. Stir in chopped herbs, then pita chips; add more dressing and adjust salt and pepper levels if needed. Sprinkle with sumac to finish, and serve.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>To do ahead:</b> I’d keep the roasted vegetables separate from the pita chips so they don’t get soggy. I’d expect the roasted vegetables to hold up pretty well with the dressing (although it’s going to mostly absorb) but if you’re worried, you can keep that separate until serving, too.</p>"}], "link": "https://smittenkitchen.com/2014/10-fall-toush-salad"}