{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/lamb-meatballs-with-feta-and-lemon1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "greek, meat, photo, weeknight favorite", "name": "Lamb Meatballs with Feta, Lemon and Mint", "author": {"@type": "Organization", "name": "\nRiffed a bit from these meatballs"}, "description": "<p>Notes: I made half the meatballs and all of the sauce because I wasn’t really paying attention. (See also: weeknights!) You won’t have such a huge excess of sauce, promise. You can cook the olives right into the sauce, but as I have an olive-averse child, I kept them aside as garnish for grown-ups.</p><p>New note, 5/16/14: In response to several commenters mentioning softness, two things: First, I should have noted from the outset that I adore a tender, soft, moist meatballs, which these were intended to be. However, from what I’m reading, those of you that are browning your meatballs first are finding that they hold up in the sauce (what I usually do), and those that are not are finding that they fall apart a bit. If you’re not going to brown the meatballs first, I’m going to suggest that you instead use only 3 tablespoons water. The recipe is now updated accordingly. I hope that helps going forward and apologize for any trouble this caused.</p>", "totalTime": "", "recipeYield": "About 36 small meatballs (I use a 3T scoop to yield 1.5 to 2-inch meatballs)", "recipeIngredient": ["RECIPE_SUBHED__1<u>Meatballs</u>", "3 to 8 tablespoons water", "2 pounds ground lamb", "1 large egg", "1 1/4 cup (about 70 grams) breadcrumbs, fresh or plain, such as Panko", "1/2 cup (55 grams) crumbled feta cheese", "3/4 teaspoon table salt", "Pinch of red pepper flakes", "2 small garlic cloves, minced", "3 tablespoons chopped parsley", "2 tablespoons (35 grams) tomato paste", "Zest of half a lemon", "2 tablespoons olive oil", "RECIPE_SUBHED__2<u>Sauce</u>", "1 medium onion, finely chopped", "1 garlic clove, minced", "A couple glugs of red wine or white/dry vermouth (optional)", "1 28-ounce (795 grams) can of crushed or pureed tomatoes", "1 teaspoon dried oregano", "Zest of half a lemon", "3/4 to 1 teaspoon table salt", "Pinches of red pepper flakes (to taste)", "1/3 cup (about 45 grams) pitted, chopped kalamata olives", "1 tablespoon thinly sliced mint leaves, plus more for garnish", "2 tablespoons roughly chopped parsley, plus more for garnish", "Juice of one lemon", "1/4 cup (30 grams) crumbled feta, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Sauce</u><br/>\n1 medium onion, finely chopped<br/>\n1 garlic clove, minced<br/>\nA couple glugs of red wine or white/dry vermouth (optional)<br/>\n1 28-ounce (795 grams) can of crushed or pureed tomatoes<br/>\n1 teaspoon dried oregano<br/>\nZest of half a lemon<br/>\n3/4 to 1 teaspoon table salt<br/>\nPinches of red pepper flakes (to taste)<br/>\n1/3 cup (about 45 grams) pitted, chopped kalamata olives<br/>\n1 tablespoon thinly sliced mint leaves, plus more for garnish<br/>\n2 tablespoons roughly chopped parsley, plus more for garnish<br/>\nJuice of one lemon<br/>\n1/4 cup (30 grams) crumbled feta, for garnish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make meatballs:</i> If you plan don’t plan to brown the meatballs, use only 3 tablespoons water. If you do, use all 8 tablespoons (1/2 cup). In a large bowl, combine all meatball ingredients except oil; I like to do this with a fork. Using wet hands, form mixture into small (1 1/2 to 2-inch diameter) meatballs; I have taken to using a large (just shy of 3 tablespoon) cookie scoop for easy sizing. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Brown meatballs:</i> Heat a large skillet over medium heat. Add olive oil and heat it through. Evenly space meatballs in pan and very carefully turn and roll them so that all sides become brown. Don’t worry if they don’t remain perfectly round; mine never do. Don’t worry if some pieces become stuck to the pan; they will deliciously infuse the sauce in a minute. Drain meatballs on a paper towel-lined plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[If you prefer not to fry your meatballs before cooking them in the sauce, you can cook them right in the sauce — it will take about 10 minutes longer.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make sauce and finish cooking meatballs:</i> Pour out all but 1 tablespoon fat from skillet and return to medium heat. Add onion and garlic and cook until they begin to soften, about 5 minutes. Add wine or vermouth and scrape up any bits stuck to the pan. Cook until the liquid almost disappears. Add tomatoes, oregano, lemon zest, salt, pepper flakes, olives (if you’re using them now), mint and parsley. Bring mixture to a simmer and return meatballs to the pan. Cover with a lid and cook at the lowest simmer for 20 to 24 minutes, until meatballs are cooked through. Squeeze lemon juice over meatballs and sauce.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Serve:</i> Sprinkled with additional olives, feta and herbs. We had this with orzo and a <a href=\"https://smittenkitchen.com/blog/2013/05/greek-salad-with-lemon-and-oregano/\">Greek salad</a>. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>In a pressure cooker:</b> I made these on the stove, but as they were riffed from a pressure cooker recipe (from the wonderful Lorna Sass, no less), it would be rude not to add her approach, which is to chop everything more coarsely (the pressure cooking will break down the bigger chunks for you), make the sauce directly in a pressure cooker as described above and drop the meatballs in to cook them without browning them first. Once at high pressure, she recommends cooking them for 5 minutes. <a href=\"http://www.nytimes.com/recipes/1015844/lamb-meatballs-in-greek-inspired-tomato-sauce.html\">More here.</a></p>"}], "link": "https://smittenkitchen.com/2014/04-lamb-meatballs-with-feta-and-lemon"}