{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/03/whole-grain-cinnamon-swirl-bread.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, breakfast, budget, photo", "name": "Whole-Grain Cinnamon Swirl Bread", "author": {"@type": "Organization", "name": "\nBread dough adapted from Peter Reinhart; filling adapted from King Arthur Flour"}, "description": "<p>Note: From the comments over the years, I’ve heard that man people prefer this with 2x the cinnamon-sugar filling for a more classic, luxurious flavor. No need to double the egg, however.</p>", "totalTime": "", "recipeYield": "2 2-pound sandwich bread loaves (in 8.5×4.5-inch or 9×5-inch loaf pans)", "recipeIngredient": ["RECIPE_SUBHED__1<u>Bread</u>", "5 cups (635 grams) white whole-wheat or regular whole-wheat flour", "Approximately 1 1/4 cups (160 grams) mixed whole grains (see suggestions at end)", "2 teaspoons (14 grams) table salt or 1 tablespoon kosher salt", "4 tablespoons (about 50 grams) granulated or brown sugar, or 2 1/2 tablespoons honey or agave nectar", "1 large egg", "1/4 cup (55 grams) vegetable oil or melted butter, cooled to lukewarm", "1 1/4 cups lukewarm water (about 95 degrees; err on cool side if you don’t have a thermometer)", "1 1/4 cups (300 grams) lukewarm milk", "1 1/2 tablespoons (about 13 grams) instant yeast ", "RECIPE_SUBHED__2<u>Filling</u>", "1/2 cup (100 grams) granulated sugar", "1 tablespoon cinnamon", "1/2 cup (85 grams) raisins or currants", "2 teaspoons (5 grams) all-purpose flour", "1 large egg beaten with 1 tablespoon water "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Filling</u><br/>\n1/2 cup (100 grams) granulated sugar<br/>\n1 tablespoon cinnamon<br/>\n1/2 cup (85 grams) raisins or currants<br/>\n2 teaspoons (5 grams) all-purpose flour<br/>\n1 large egg beaten with 1 tablespoon water </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make bread dough:</i> In the bottom of large mixing bowl, combine water, milk and sugar or honey, then whisk in yeast until dissolved. Add egg and oil and whisk until combined. In a separate bowl, whisk together flours, grains and salt, then add this to the yeast-egg mixture. If mixing with a machine, combine with paddle attachment at the lowest speed for 1 minute. If mixing by hand, use a large spoon and stir for 1 minute. The dough will be wet and coarse; do not fret. Let it rest for 5 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using a mixer, switch to the dough hook and mix the dough on medium-low for 2 more minutes. By hand, do the same with your spoon. The dough will seem firm and more smooth, ideally supple and sticky, but if it’s still very wet, add a bit more flour, a spoonful at a time. If it seems excessively stiff, add a little more water, a spoonful at a time. Continue to mix with dough hook or by hand for 4 minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Scrape dough out onto lightly floured counter. Knead a few times, then form the dough into a ball and let it rest, covered by the empty bowl upended over it, for 10 minutes. Repeat this process — kneading a few times, then resting for 10 minutes — two more times. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Proof dough:</i> Transfer dough to lightly oiled bowl with room for dough to at least double. Cover with plastic wrap and let proof at room temperature for 60 to 70 minutes, until doubled in bulk. Dough can also be fermented overnight or up to 4 days in the fridge. If proofing in the fridge, remove the dough before the fridge about 3 hours before you plan to bake it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare filling:</i> Combine the sugar, cinnamon, raisins or currants, and flour in a food processor or blender, processing until the fruit is chopped. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Fill bread and form loaves:</i> Turn out onto a floured counter and divide it into two equal pieces. Roll each into a long, thin rectangle, about 16-x-8 inches. Brush the dough with the beaten egg and water mixture. Sprinkle half the filling evenly over the egg. Beginning with a short edge, roll the dough into a log. Gently press the side seam and ends closed, and place the log in a lightly greased loaf pan. Repeat with remaining dough and filling.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Proof bread again:</i> Cover the pan with lightly greased plastic wrap, and allow the bread to rise for about 1 hour at room temperature, or until it has crowned about about 1-inch over the rim of the pan, about 45 to 60 minutes. About halfway through, heat oven to 350°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Bake bread:</i> For about 40 minutes, rotating the loaf once for even color. When done, it will sound a bit hollow when tapped and the internal temperature will read 190°F. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Notes:</b></p>"}], "link": "https://smittenkitchen.com/2014/03-whole-grain-cinnamon-swirl-bread"}