{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/blue-sky-bran-muffins1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, muffin, photo", "name": "Blue Sky Bran Muffins", "author": {"@type": "Organization", "name": "\nAdapted from Table of Contents, via the Sweetie and the Kitchen blog"}, "description": "<p>It wasn’t easy to find this recipe, but I’m glad I found a blog post that pointed me to this book, because it was definitely one of the better 159 pennies I’ve spent. The book pairs books and literature, inviting bestselling authors to talk about the foods and recipes that inspired passages in their books. Jill Clement suggests the Blue Sky Bakery bran muffin as the ideal companion to her novel, Heroic Measures; in a pivotal scene, she has a character eat a bran muffin because she wants him to be wowed by the earthy flavors.</p><p>And these are not just any bran muffins. They’re hefty and hearty, more whole grain than refined flour, barely sweet and you’ll never get two muffins alike because the great big pocket of fruit in the center is variable; in just one week’s time we had banana-coconut, mango-fresh cranberry, blackberry-apple and blueberry-raspberry. What should you put in yours? Anything that sounds good.</p><p>[Note: The original fruit level, 1 1/2 to 2 cups, was accidentally doubled. Now fixed; sorry for the trouble.]</p>", "totalTime": "", "recipeYield": "12 standard muffins (I halved the bakery’s original yield)", "recipeIngredient": ["1 1/3 cups (315 ml) buttermilk (you can also use sour cream or yogurt thinned with a little milk)", "1 large egg", "1/3 cup (80 ml) oil (such as vegetable, safflower, sunflower or olive oil)", "1/4 cup (50 grams) lightly packed dark brown sugar", "1 teaspoon (5 ml) vanilla extract, a little citrus zest (optional flavorings to add)", "1 1/2 cups (90 grams) wheat bran*", "1 cup (125 grams) all-purpose flour", "1 1/2 teaspoons (8 grams) baking powder (preferably aluminum-free)", "1 1/2 teaspoons (8 grams) baking soda", "1/4 teaspoon table salt", "2 teaspoons (10 grams) granulated sugar, divided", "3/4 to 1 cup chopped mixed fruit (just about anything but citrus or pineapple will work, they say; frozen berries are fine)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/3 cups (315 ml) buttermilk (you can also use sour cream or yogurt thinned with a little milk)<br/>\n1 large egg<br/>\n1/3 cup (80 ml) oil (such as vegetable, safflower, sunflower or olive oil)<br/>\n1/4 cup (50 grams) lightly packed dark brown sugar<br/>\n1 teaspoon (5 ml) vanilla extract, a little citrus zest (optional flavorings to add)<br/>\n1 1/2 cups (90 grams) wheat bran*<br/>\n1 cup (125 grams) all-purpose flour<br/>\n1 1/2 teaspoons (8 grams) baking powder (preferably aluminum-free)<br/>\n1 1/2 teaspoons (8 grams) baking soda<br/>\n1/4 teaspoon table salt<br/>\n2 teaspoons (10 grams) granulated sugar, divided<br/>\n3/4 to 1 cup chopped mixed fruit (just about anything but citrus or pineapple will work, they say; frozen berries are fine)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 425 degrees F and coat a 12-cup muffin tin with nonstick spray.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk buttermilk, egg, oil, brown sugar and any vanilla or citrus zest you’d like to use in a small bowl. Whisk bran, flour, baking powder, baking soda and salt in a large bowl. Stir wet mixture into dry until just combined and still a bit rough. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Spoon two 2 tablespoons of batter into each prepared muffin cup. Add about 2 teaspoons fruit to each (dividing it evenly) and sprinkling the fruit with one of the teaspoons of granulated sugar. Spoon remaining batter (about 1 tablespoon each) over fruit and sprinkle tops of muffins with remaining teaspoon of granulated sugar. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake muffins for a total of 16 to 18 minutes, rotating pan once midway through baking time for even browning, until a toothpick inserted into the center of muffins comes out with just a few crumbs attached. Do not overbake. Let muffins cool in pan on a wire rack for 10 minutes before removing from tin. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Do ahead: Muffins keep for 3 days at room temperature, longer in the freezer.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* I didn’t try it, but I suspect that oats pulsed in a food processor until a cornmeal-like consistency or even that <a href=\"http://www.bobsredmill.com/7-grain-hot-cereal.html?&amp;cat=9\">7-grain cereal mix</a> we used for this <a href=\"https://smittenkitchen.com/blog/2014/03/whole-grain-cinnamon-swirl-bread/\">whole-grain cinnamon swirl bread</a> would work here. Let us know if you audition it. I used Bob’s Red Mill brand wheat bran.</p>"}], "link": "https://smittenkitchen.com/2014/05-blue-sky-bran-muffins"}