{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/10/carrot-cake-with-cider-and-olive-oil1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, carrots, dairy free, everyday cakes, muffin, photo", "name": "Carrot Cake with Cider and Olive Oil", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Updated recipe [10/24/14]: In response to comments that the cake was coming out too wet/not baking through, I’ve made some adjustments. I’ve dropped the apple cider from the original 1 1/4 cups to 1 cup and the carrots (which I believe were the weighty culprit, as I was greedy to stuff this cake with almost an excess of them) from 2 cups to 1 1/2. My most recent loaf baked up wonderfully. I’m so sorry that some of you got off on the wrong foot with this cake. I hope this cures it, and gives this cake a chance to be your favorite again. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 1/3 cups (290 grams) all-purpose flour", "3/4 teaspoon (5 grams) table or fine sea salt", "2 teaspoons (10 grams) baking powder (I prefer aluminum-free)", "1 1/4 teaspoon ground cinnamon", "1/4 teaspoon ground or a bunch of gratings of whole nutmeg", "1/8 teaspoon ground cloves", "1/2 cup (120 ml) olive oil", "3/4 cup (145 grams) dark brown sugar", "2 large eggs", "1 cup cider (235 ml, see buying suggestions below)", "1 teaspoon (5 ml) vanilla extract", "1 1/2 cups packed coarsely grated carrots from about 9 ounces (2 to 2 1/2 meaty/large or 4 to 5 slim; about 255 grams) whole carrots", "Olive oil or nonstick cooking spray for baking pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 1/3 cups (290 grams) all-purpose flour<br/>\n3/4 teaspoon (5 grams) table or fine sea salt<br/>\n2 teaspoons (10 grams) baking powder (I prefer aluminum-free)<br/>\n1 1/4 teaspoon ground cinnamon<br/>\n1/4 teaspoon ground or a bunch of gratings of whole nutmeg<br/>\n1/8 teaspoon ground cloves<br/>\n1/2 cup (120 ml) olive oil<br/>\n3/4 cup (145 grams) dark brown sugar<br/>\n2 large eggs<br/>\n1 cup cider (235 ml, see buying suggestions below)<br/>\n1 teaspoon (5 ml) vanilla extract<br/>\n1 1/2 cups packed coarsely grated carrots from about 9 ounces (2 to 2 1/2 meaty/large or 4 to 5 slim; about 255 grams) whole carrots<br/>\nOlive oil or nonstick cooking spray for baking pan</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350 degrees. Coat a 9×5-inch loaf pan* with olive oil or a nonstick cooking spray. If yours is old and you’re nervous about the cake sticking, it cannot hurt to line yours with a fitted rectangle of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together flour, salt, baking powder, cinnamon, nutmeg and cloves. In a medium bowl, whisk together olive oil, brown sugar, eggs, cider and vanilla. Stir grated carrots into wet ingredients until evenly coated, then stir wet ingredients into dry just until no floury bits remain. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into prepared pan and bake for 60 to 70 minutes, until a skewer inserted into the center comes out batter-free. Let cool in loaf pan for 20 to 30 minutes, then remove from pan and cool the rest of the way on a rack. Loaf should keep at room temperature for a few days, and longer in the fridge. It’s even more moist on the second day.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whatever you do, definitely avoid making a cream cheese frosting-like spread whipped together from 4 ounces of softened cream cheese, 2 tablespoons softened unsalted butter, 1/2 teaspoon vanilla extra and 6 tablespoons powdered sugar, some of which can be replaced with honey or maple syrup but will make for a softer spread. It will unquestionably compromise this cake’s dairy-free status. It might be dangerously good.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Notes:</b> </p>"}], "link": "https://smittenkitchen.com/2014/10-carrot-cake-with-cider-and-olive-oil"}