{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/10/the-crispy-egg1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, budget, eggs, photo, put an egg on it, quick, vegetarian", "name": "The Crispy Egg", "author": {"@type": "Organization", "name": "\nInspired by this video from Frank Prisinzano of Frank, Lil Frankie’s, Supper and Sauce restaurants in NYC"}, "description": "<p>As for skillets, any kind will do. I used both a stainless steel and cast-iron here. The smaller the skillet, the less your egg will move around if it turns out that your stove, like mine, isn’t perfectly level.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 glug olive oil or cooking fat of your choice", "1 egg, any size", "Salt, pepper, herbs, spices or hot sauce, or all of the above"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 glug olive oil or cooking fat of your choice<br/>\n1 egg, any size<br/>\nSalt, pepper, herbs, spices or hot sauce, or all of the above</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Over a high flame, heat a skillet for a full minute. Add a glug of oil and let it heat until it just begins to smoke, another 30 seconds. Add your egg, reduce the heat to medium-high, and step back; it’s going to hiss and sputter and basically be the most wildly dramatic thing to happen at breakfast in a long time. Within a minute, it should get brown at the edges but don’t touch or move it. Let it cook until the white looks fully opaque, another 30 seconds to 1 minute. Remove from the heat. Shimmy a thin metal spatula under the egg, gently loosening any stuck parts. Transfer to whatever you’re serving it on (toast, <a href=\"https://smittenkitchen.com/blog/2014/09/latke-waffles/\">latke waffles</a>, <a href=\"https://smittenkitchen.com/blog/2010/02/ginger-fried-rice/\">fried rice</a>, <a href=\"https://smittenkitchen.com/blog/2008/11/home-fries/\">home fries</a>, a plate), shower it with seasonings, herbs and spices of your choice and waste no time digging in. Repeat as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Great tip from the comments:</i> Many have mentioned that you can spoon some of the oil in the skillet over the cooking egg to help it cook more quickly on top, plus, it makes it even more bubbly. I’d definitely recommend this, especially as an extra layer of security that the white will be fully cooked. [Updated to note that I did this a couple mornings later, and whee! The whites were even more bubbly on top.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Egg white variation:</i> Let’s say you have a human, small or large, in your household that doesn’t like egg yolks. It turns out, crispy egg whites are pretty cool too, cooked with the same method described above. I think I’d especially love one on a sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Crispy sandwich egg:</i> Flip your egg over for an additional 30 seconds or so, until the yolk is almost but not fully set. Be the envy of every other breakfast sandwich.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Multiple crispy eggs:</i> I’ve done up to two at once and it works just fine. You’ll get a higher amount of crispy edge, however, if you fry them one at a time.</p>"}], "link": "https://smittenkitchen.com/2014/10-the-crispy-egg"}