{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/01/warm-lentil-and-potato-salad.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, budget, lunch, photo, potatoes, salad, side dish, vegan, vegetarian", "name": "Warm Lentil and Potato Salad with a Garlicky Mustard Vinaigrette", "author": {"@type": "Organization", "name": "\nAdapted from a few David Tanis recipes"}, "description": "<p>If you can find tiny dark green French lentilles de Puy or Italian lenticcie Castelluccio, you’ll be glad you did; they’re minerally, nutty and not starchy at all — nothing like your average “for your health!” lentil mush soup. I tend to grab two bags or boxes whenever I find them, and keep them in the coolest, darkest place I can find in my steam-heated sauna of an apartment. I’ve also ordered the French lentils online before from here, though I actually brought these inexpensive lentils — and the capers and olive oil, used here — back from Castroni, the greatest food store in Rome, last summer. </p><p>Before you ask, Can you put kale in this too? Of course you can.</p>", "totalTime": "", "recipeYield": "Makes 4 lunch servings, 6 servings as a side dish", "recipeIngredient": ["2 large shallots, 1 halved, 1 finely diced,", "4 sprigs of thyme", "1 small bay leaf", "1 cup dry small green lentils (see Note up top for varieties)", "1 small bay leaf", "Salt and pepper", "1 pound fingerling potatoes", "2 tablespoons red wine vinegar", "1 to 2 garlic cloves, minced or smashed to a paste (I use less)", "1 tablespoon smooth Dijon mustard", "1/4 cup of your favorite olive oil", "2 teaspoons capers, rinsed if salted, drained if brined, and roughly chopped", "2 tablespoons cornichons or other sour gherkins, roughly chopped", "1 to 2 scallions, thinly sliced", "1/2 cup chopped flat leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 large shallots, 1 halved, 1 finely diced,<br/>\n4 sprigs of thyme<br/>\n1 small bay leaf<br/>\n1 cup dry small green lentils (see Note up top for varieties)<br/>\n1 small bay leaf<br/>\nSalt and pepper<br/>\n1 pound fingerling potatoes<br/>\n2 tablespoons red wine vinegar<br/>\n1 to 2 garlic cloves, minced or smashed to a paste (I use less)<br/>\n1 tablespoon smooth Dijon mustard<br/>\n1/4 cup of your favorite olive oil<br/>\n2 teaspoons capers, rinsed if salted, drained if brined, and roughly chopped<br/>\n2 tablespoons cornichons or other sour gherkins, roughly chopped<br/>\n1 to 2 scallions, thinly sliced<br/>\n1/2 cup chopped flat leaf parsley</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Cook lentils:</i> Pick over and rinse lentils. Place them in a small/medium saucepan with the halved shallot, thyme branches, bay leaf, some salt and 4 cups of water. Simmer the lentils over medium heat for 25 to 30 minutes, until firm-tender. Drain (discarding shallot, thyme and bay leaf) and keep warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Meanwhile, cook potatoes:</i> In a separate saucepan, cover potatoes with 1 to 2 inches cold water. Set timer for 15 minutes, then bring potatoes to a simmer. When the timer rings, they should be easily pierced with a toothpick or knife. Drain and keep warm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make the dressing:</i> Place the chopped shallot and red wine vinegar in the bottom of a small bowl and let sit for 5 minutes. Whisk in minced garlic, dijon, a pinch of salt, a few grinds of black pepper and olive oil. Stir in chopped capers, cornichon and scallions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Assemble salad:</i> Slice potatoes into 1/2-inch segments and place in serving bowl. Add lentils, dressing and all but 1 tablespoon parsley and combine. Adjust seasoning with additional salt and pepper if needed. Scatter salad with remaining parsley. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve alone, with a soft-cooked egg on top, or as a side to a larger roast, chop or sausages. Reheat as needed. If you plan to make this at the outset of several meals and would like to eat it warm, I’d keep the dressing separate, warming only the lentils and potatoes and stirring in the cold dressing to taste.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Keeps in fridge for up to 5 days.</p>"}], "link": "https://smittenkitchen.com/2014/01-warm-lentil-and-potato-salad"}