{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/roasted-grape-and-olive-crostini1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "party snacks, photo, vegetarian", "name": "Roasted Grape and Olive Crostini", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I couldn’t resist using a pretty mix of olives and grapes, but, honestly, my favorite combination to use here are purple grapes and kalamata olives, seedless and pitted, respectively are ideal. I make it with fresh rosemary and ricotta, but other herbs and cheese would work here, such as thyme or blue cheese. The only pesky part of this recipe is that I find that the roasting time really varies. What you’re looking for is for the grapes to soften and get leaky — this can take anywhere from 30 to 60 minutes depending on how firm/juicy your grapes are (softer ones take less time). I have also seen many references to grapes roasting and bursting in 10 minutes in other recipes, but have never experienced this in my oven. Once these juices muddle with the herbs and briny roasted olives, it’s all unquestionably worth it. Don’t forget to spoon any messy pan juices over the toasts.</p>", "totalTime": "", "recipeYield": "12 crostini, a very small batch. I usually double this for a small party.", "recipeIngredient": ["2 tablespoons olive oil", "1 cup grapes, seedless purple ones are my first choice, all will work", "1 cup olives, pitted kalamata are my first choice, all will work", "1 1/2 teaspoons finely chopped rosemary, divided", "Sea salt and red pepper flakes", "About 12 baguette slices, toasted", "3/4 cup ricotta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 tablespoons olive oil<br/>\n1 cup grapes, seedless purple ones are my first choice, all will work<br/>\n1 cup olives, pitted kalamata are my first choice, all will work<br/>\n1 1/2 teaspoons finely chopped rosemary, divided<br/>\nSea salt and red pepper flakes<br/>\nAbout 12 baguette slices, toasted<br/>\n3/4 cup ricotta</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 400°F (205°C). Combine olive oil, grapes, olives, 1 teaspoon rosemary, a couple pinches of sea salt and pepper flakes in a baking dish or roasting pan. Roast until grapes are wilted and leaking juices, about 35 to 55 minutes, rolling ingredients around in pan a few times throughout roasting time to encourage even cooking.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slather each toast with ricotta, then heap each with grapes, olives and their pan juices. Finish with remaining rosemary and eat immediately.</p>"}], "link": "https://smittenkitchen.com/2014/12-roasted-grape-and-olive-crostini"}