{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/avocado-cup-salads-two-ways1.jpg?w=500", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "avocado, gluten free, lunch, photo, quick, salad, vegan, vegetarian", "name": "Inspired a bit:", "author": {"@type": "Organization", "name": " By these avocados vinaigrette."}, "description": "<p>Avocado Cup Salads with Black Bean Confetti </p><p>You could bulk this up further with some diced tomatoes or even cooked shrimp, as we did in this salsa.</p>", "totalTime": "", "recipeYield": "Makes 8 mini-salad cups; I’d estimate 2 halves or 1 full avocado per person/meal", "recipeIngredient": ["1 cup black beans, cooked, drained (about 2/3 of a 15-ounce can)", "1 large bell pepper, finely diced (I used a mix of colors because we keep them around for the kid)", "1/4 cup finely diced white or red onion", "1 small jalapeno, seeded and minced", "1/4 cup olive oil", "2 tablespoons freshly squeezed lime juice (from about 1 lime)", "1/4 teaspoon coarse salt, plus more to taste", "1/2 teaspoon ground cumin", "Dashes of hot sauce or pinches of cayenne, to taste", "Chopped cilantro for garnish", "4 ripe avocados"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup black beans, cooked, drained (about 2/3 of a 15-ounce can)<br/>\n1 large bell pepper, finely diced (I used a mix of colors because we keep them around for the kid)<br/>\n1/4 cup finely diced white or red onion<br/>\n1 small jalapeno, seeded and minced<br/>\n1/4 cup olive oil<br/>\n2 tablespoons freshly squeezed lime juice (from about 1 lime)<br/>\n1/4 teaspoon coarse salt, plus more to taste<br/>\n1/2 teaspoon ground cumin<br/>\nDashes of hot sauce or pinches of cayenne, to taste<br/>\nChopped cilantro for garnish<br/>\n4 ripe avocados</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix black beans, pepper, onion and jalapeno in a medium bowl. In a small dish, whisk olive oil, lime juice, salt, cumin and hot sauce or cayenne. Adjust dressing seasonings to taste. Halve avocados and remove pits. Score avocado halves with a knife, cutting lines in both directions to form a grid, but being careful not to through the skin. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’re serving all four avocados right away, go ahead and mix the dressing and salad ingredients together, then heap each avocado half with salad and dressing and garnish with cilantro. If you’d like to stretch this over several days of lunches or the like, keep the mixed salad ingredients and dressing in separate dishes. When you’re ready to eat, cut and score your avocado, dot a little dressing directly on each half, heap with salad filling and drizzle with more dressing. Garnish with cilantro.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat with a spoon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Avocado Cup Salads with Cucumbers, Radishes and Ginger-Miso Dressing</b> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You could bulk this up further with cooked edamame. This <a href=\"https://smittenkitchen.com/blog/2010/04/avocado-salad-with-carrot-ginger-dressing/\">carrot-ginger</a> dressing would also be excellent here, but I didn’t want to make a simple recipe too complicated. My 4 year-old, who has peculiar tastes, thinks that dried seaweed snacks would also be good crumbled on top. Proceed at your own risk.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Makes 8 mini-salad cups; I’d estimate 2 halves or 1 full avocado per person/meal</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup finely diced cucumber (from about half a long English or 2 small Persian cukes), seeds removed<br/>\n1 cup finely diced radishes (from about 4 large red ones)<br/>\n2 scallions, finely chopped<br/>\n4 tablespoons toasted sesame oil<br/>\n2 teaspoons white miso (shiromiso, which is more mild/less salty)<br/>\n2 tablespoons rice vinegar<br/>\n1/2 teaspoon finely grated or minced fresh ginger root (or more to taste)<br/>\n1 teaspoon white sesame seeds, toasted<br/>\n1 teaspoon black sesame seeds<br/>\n4 ripe avocados</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix cucumber, radishes and scallions in a medium bowl. In a small dish, whisk sesame oil, miso, rice vinegar and ginger. Add dressing flavor and seasonings to taste. Halve avocados and remove pits. Score avocado halves with a knife, cutting lines in both directions to form a grid, but being careful not to through the skin. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’re serving all four avocados right away, go ahead and mix the dressing and salad ingredients together, then heap each avocado half with salad and dressing and garnish with mix of sesame seeds. If you’d like to stretch this over several days of lunches or the like, keep the mixed salad ingredients and dressing in separate dishes. When you’re ready to eat, cut and score your avocado, dot a little dressing directly on each half, heap with salad filling and drizzle with more dressing. Garnish with mix of seeds. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat with a spoon. </p>"}], "link": "https://smittenkitchen.com/2014/04-avocado-cup-salads-two-ways"}