{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/easiest-fridge-dill-pickles1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, cucumber, photo, pickled, quick, vegetarian", "name": "Easiest Fridge Dill Pickles", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>You can tweak these in any number of ways. You can add a couple cloves of garlic, lightly crushed  but still inside their skin. You can use 1/2 to 1 teaspoon dill seeds instead of the fresh dill or 1 tablespoon of pickling spice, if you prefer that flavor. You could add all or a part of one white onion, sliced paper thin (use one less Kirby to compensate for volume). You can add a bay leaf or two. But, for us at least, the treat is how you can skip all of the above and still make a perfect pickle snack. With four ingredients, you’ve got no excuse not to always have them on hand. </p><p>If you can’t find kirbys, seedless cucumbers (those long ones usually in plastic) also work here, although they’ll be less crunchy.</p><p>[Updated: A few people commented that they found these too salty. I’m so sorry. I’m now recommending a modified amount, to be safe. You can bump up the salt as high as 5 teaspoons if you find you’d like more.]</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["8 larger or to 10 smaller firm, fresh Kirby (pickling) cucumbers", "3 teaspoons kosher, coarse or pickling salt (if using a ", "<a href=\"https://smittenkitchen.com/tips/2010/06/29/not-all-salts-are-created-equally/\">featherweight brand such as Diamond</a>", ", use a little more)", "1 to 2 tablespoons chopped fresh dill", "1/2 cup white vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>8 larger or to 10 smaller firm, fresh Kirby (pickling) cucumbers<br/>\n3 teaspoons kosher, coarse or pickling salt (if using a <a href=\"https://smittenkitchen.com/tips/2010/06/29/not-all-salts-are-created-equally/\">featherweight brand such as Diamond</a>, use a little more)<br/>\n1 to 2 tablespoons chopped fresh dill<br/>\n1/2 cup white vinegar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Slice your cucumbers very thin — I used 1/8-inch slices here but usually go even thinner on a mandoline. Place them in a 1-liter or equivalent lidded jar. Add 3 teaspoons salt and dill, then pour in white vinegar. Close the jar and give it a few shakes to begin distributing the ingredients. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You’re going to find the liquid level in the jar worrisomely low as it is well below the pickle pile line, but don’t fret. Within an hour or two, the salt will draw the moisture from the cucumbers and wilt them, while the liquid becomes a perfectly balanced pickle brine.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place jar in the refrigerator near the front, which should remind you to shake it once or twice more over the new few hours. (Or whenever you’re back at the fridge.) You <i>can</i> eat them as little as 1 to 2 hours later, but they become ideal at 6 to 8 hours. They’ll keep in the fridge, submerged in their brine, for 3 weeks, though never around here.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Just a little NYC sourcing shout-out:</em> There are several local farms that bring kirby cucumbers to the Greenmarkets, but by far, my favorites to seek out come from Kernan Farms, where they have them for over a month each summer and they’re always incredibly crisp. During the growing season, they’re at St. Marks Church Tuesdays, Union Square Wednesdays, Borough Hall Thursdays, 97th Street Fridays, Grand Army Plaza and Abington Square Saturdays and Bensonhurst Sundays. </p>"}], "link": "https://smittenkitchen.com/2014/07-easiest-fridge-dill-pickles"}