{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/01/sizzling-chicken-fajitas1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, photo, tex mex, weeknight favorite", "name": "Sizzling Chicken Fajitas", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "", "recipeIngredient": ["Fajitas were traditionally made with skirt steak, and the name fajita or arracheras", "referred to the cut, which was once considered a throwaway cut, given to cattle hands along with other unpopular cuts as part of their pay. ", "<a href=\"http://www.austinchronicle.com/food/2005-03-04/261130/\">Here’s a great article on fajita history</a>", ". Needless to say, thin strips of skirt steak would be excellent here too. You could also use an increased medley of vegetables to make this vegetarian."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fajitas were traditionally made with skirt steak, and the name fajita or arracheras<br/>\nreferred to the cut, which was once considered a throwaway cut, given to cattle hands along with other unpopular cuts as part of their pay. <a href=\"http://www.austinchronicle.com/food/2005-03-04/261130/\">Here’s a great article on fajita history</a>. Needless to say, thin strips of skirt steak would be excellent here too. You could also use an increased medley of vegetables to make this vegetarian.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serves 4 to 5</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For the chicken</u><br/>\n1 1/2 pounds boneless, skinless chicken thighs (though, frankly, a little more or less will be fine here)<br/>\n2 tablespoons lime juice (half a juicy lime)<br/>\n1 1/2 teaspoons kosher salt<br/>\n1 1/2 teaspoons dried oregano<br/>\n2 teaspoons ground cumin<br/>\n1 teaspoon chili powder<br/>\n1/2 teaspoon smoked paprika<br/>\n1 garlic clove, minced or pressed<br/>\nFew dashes hot sauce, optional</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To assemble</u><br/>\n8 (6-inch) flour or corn tortillas<br/>\nOlive oil<br/>\n2 large bell peppers, cut into thin strips (I use a mix of green, red and other colors, if I can find them)<br/>\n1 large yellow or sweet onion, halved and sliced thin<br/>\nCoarse salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Fixings (pick your favorites)</u><br/>\n1 1/2 cup cooked black beans (1 15-ounce can, drained and rinsed)<br/>\nSalsa or pico de gallo<br/>\nSliced avocado or guacamole<br/>\nShredded cheese or sour cream<br/>\nMinced white onion or pickled red onions<br/>\nChopped cilantro, pickled jalalpenos, hot sauce and lime wedges</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Prepare chicken:</u> Slice chicken thighs into thin strips (1/4- to 1/2-inch wide). Place in bowl or freezer bag. Add lime juice, spices and garlic and mix together. Let marinate for 30 minutes or up to 2 days in the fridge.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>20 to 25 minutes before you’re ready to eat:</u> Heat oven to 250 and wrap tortillas in foil. Set on rack to wram. Set out fixings of your choice. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cook peppers, onions and chicken:</u> Heat your largest skillet (I use a 12-inch cast iron) on the highest heat. When very hot, drizzle in some olive oil to lightly coat the bottom of the pan. When this is nearly smoking hot, add the peppers in a single layer. <i>Wait.</i> (This will be a theme.) Try to get them a little charred underneath before you move them around. Once they’ve begun to brown, add the onions, plus some salt. Wait again for some color to develop before you move them. When peppers are nicely charred in spots and onions have softened and sweetened, scrape mixture onto a plate or bowl to clear the skillet. Heat skillet again on a very high heat with a thin slick of olive oil. Spread chicken strips in as much of a single layer as you can. Wait until they brown underneath to move them. Saute strips, regularly pausing so that they can get some color, until cooked through, about 4 to 5 minutes. Return peppers and onions to skillet. Heat again until everything is sizzling and bring to the table.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat immediately, spooned onto warm tortillas and piled with fixings of your choice. Repeat again tomorrow.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Shortcut recipes:</b><br/>\n<i>My Lazy Taco Slaw:</i> 1 bag of coleslaw mix + 2 scallions, thinly sliced + a spoonful or two of mayo + lime juice + salt to taste. If you don’t like mayo, use olive oil. I don’t recommend yogurt or sour cream because they might curdle. Creme fraiche would not. If you don’t have coleslaw mix, just shred a few cups of cabbage and add a grated large carrot to approximate it.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Slacker Pico de Gallo:</i> Diced tomatoes + minced white onion + 1 minced jalapeno + squeeze of lime juice + splash of olive oil + salt + cilantro, if that’s your thing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Pickled Red Onions:</i> Mix 1/4 cup red wine vinegar + 1/4 cup cold water + 1 1/2 teaspoons granulated sugar + 1 tablespoon Diamond Kosher salt or generous 1/2 tablespoon Morton or another brand of kosher salt until sugar and salt have dissolved. Add thinly sliced red onion. Let marinate for 30 minutes (for very light pickling) or up to a week in the fridge. Put on everything.</p>"}], "link": "https://smittenkitchen.com/2014/03-sizzling-chicken-fajitas"}