{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/11/pickled-cabbage-salad1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cabbage, gluten free, photo, pickled, salad, side dish, vegan, vegetarian", "name": "Pickled Cabbage Salad", "author": {"@type": "Organization", "name": "\nInspired by the health salad at Zabar’s"}, "description": "<p>My primary change to this from my last version, and from the versions I’ve had from delis, was the addition of celery seed. I added it on a whim, and we cannot get enough of the flavor. Just a little permeates the pickle mixture with a hint of celery, without actually using celery, which can get a little beige after pickling. This is a flexible recipe, however. You could add actual celery slices if you wish, red onion or a little red cabbage to create the ink pinky tangled look of the Russ and Daughter’s version (which has only a pinch of carrot and pepper strips in it, and no cucumber). The carrots, cucumbers and peppers I use here are modeled after the Zabar’s version.</p>", "totalTime": "", "recipeYield": "9 to 10 cups, which shrinks to 7 to 8 cups after pickling", "recipeIngredient": ["RECIPE_SUBHED__1<u>Brine</u>", "1 1/2 cups white vinegar", "1 1/2 cups water", "1/3 cup granulated sugar", "1/2 teaspoon celery seed", "1 tablespoon plus 2 teaspoons kosher salt* plus more to taste  ", "RECIPE_SUBHED__2<u>Salad</u>", "1 small head (2 pounds) green cabbage", "1 red bell pepper", "1 carrot (I used only 1/2 my very thick one)", "1 kirby cucumber"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Salad</u><br/>\n1 small head (2 pounds) green cabbage<br/>\n1 red bell pepper<br/>\n1 carrot (I used only 1/2 my very thick one)<br/>\n1 kirby cucumber</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Mix brine ingredients in the bottom of a medium bowl and set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prepare your vegetables: Trim and core cabbage and slice thinly with a knife, food processor slicing blade or adjustable-blade slicer. Place in a large bowl. Core, seed and thinly slice red pepper; peel and thinly slice or julienne carrot; thinly slice cucumber (I quartered mine first). Add vegetables to cabbage bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>By the time you’re done preparing your vegetables, the sugar and salt should in the pickling mixture should have dissolved. If not, whisk a few times until they do. Taste and adjust if you’d like it a little saltier — I added 1 more teaspoon of kosher salt in the end. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour pickling brine over vegetables and cover bowl with a lid or plastic wrap. Refrigerate for 1 hour or up to 1 week. Salad becomes more pickled as it rests. Eat with everything. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* <i>Not all salts are weighted equally:</i> <a href=\"https://smittenkitchen.com/tips/2010/06/29/not-all-salts-are-created-equally/\">Read more here.</a> I used Morton brand, which for 1 tablespoon plus 2 teaspoons clocks in at 24 grams. If using table or fine sea salt, use only 4 teaspoons. </p>"}], "link": "https://smittenkitchen.com/2014/11-pickled-cabbage-salad"}