{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2014/12/deep-dark-gingerbread-waffles11.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, christmas, photo, waffles, winter", "name": "Deep Dark Gingerbread Waffles", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "These waffles use more sugar than any other I’ve made, but they don’t end up tasting excessively sweet because the sugar is necessary to balance the intensity of the molasses. That said, you absolutely will not need syrup on top of these, despite my suggestion of it in photos. Just a dusting of powdered sugar and maybe, if you’re feeling fancy, a dollop of unsweetened whipped cream or crème fraîche will make these even more perfect. Serve with a mixed citrus salad (favorites: 1, 2, 3) and crispy bacon, if that’s your thing. And if it’s not, you can send it here.", "recipeIngredient": ["Prep time: 10 minutes", "Cook time: 15 minutes", "Yield: 15 small rectangular waffles; serves 4 to 5", "1 cup all-purpose flour", "3/4 teaspoon ground cinnamon", "1 tablespoon ground ginger", "1/8 teaspoon ground cloves", "1/8 teaspoon freshly grated nutmeg", "1 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/4 teaspoon fine sea or table salt", "1/2 cup buttermilk, yogurt thinned with a little milk, fresh apple cider or even stout beer", "1/2 cup molasses", "1/2 cup dark brown sugar, packed", "1/4 cup granulated sugar", "1 large egg", "3 tablespoons butter, melted, plus extra for brushing waffle iron", "Powdered sugar for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 cup all-purpose flour<br/>\n3/4 teaspoon ground cinnamon<br/>\n1 tablespoon ground ginger<br/>\n1/8 teaspoon ground cloves<br/>\n1/8 teaspoon freshly grated nutmeg<br/>\n1 1/2 teaspoons baking powder<br/>\n1/2 teaspoon baking soda<br/>\n1/4 teaspoon fine sea or table salt<br/>\n1/2 cup buttermilk, yogurt thinned with a little milk, fresh apple cider or even stout beer<br/>\n1/2 cup molasses<br/>\n1/2 cup dark brown sugar, packed<br/>\n1/4 cup granulated sugar<br/>\n1 large egg<br/>\n3 tablespoons butter, melted, plus extra for brushing waffle iron<br/>\nPowdered sugar for serving</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together the flour, cinnamon, ginger, cloves, nutmeg, baking powder, baking soda and salt. In a medium bowl, whisk together the buttermilk, molasses, sugars, egg and butter until combined. The butter will likely firm up and make little white splotches throughout; this is a-okay. Pour the wet into the dry ingredients and stir until just combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat waffle iron to a middle heat. Either brush waffle iron with melted butter or spray it lightly with a nonstick cooking spray. Ladle gingerbread batter into waffle iron until they’re about 3/4 filled out. Cook according to manufacturer’s directions. In my waffle iron, I like to cook them 1 to 2 minutes more.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To remove waffles: Open waffle iron. Wait about 30 seconds, giving them a chance to steam off a little. With tongs in one hand and a small spatula in the other, gently, carefully lift corners of each waffle section enough to slide the spatula underneath, then lift and slide some more until you can get the section out. Curse Deb, because these waffles are very sticky and eager to tear. Trust Deb, that they will be worth it. Spread them on a tray in a single layer to let cool slightly; within 1 minute, they should be crisp to the touch and easier to lift. Repeat with remaining batter. Try not to stack waffles — even though they’re firm, they will stick.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve immediately, dusted with powdered sugar and, if you’re feeling fancy, a dollop of barely or unsweetened whipped cream or crème fraîche.</p>"}], "link": "https://smittenkitchen.com/2014/12-deep-dark-gingerbread-waffles"}