{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/04/crispy-broccoli-with-lemon-and-garlic1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "broccoli, budget, citrus, lemon, side dish, vegetarian", "name": "Crispy Broccoli with Lemon and Garlic", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "Serves 2 as a side", "recipeIngredient": ["1 pound fresh broccoli", "3 tablespoons olive oil, divided", "1/2 teaspoon coarse or kosher salt", "A few pinches of pepper flakes, to taste", "Finely grated zest of half a lemon, or more to taste", "1 large or 2 small garlic cloves, minced", "Juice of half a lemon, or more to taste, to finish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound fresh broccoli<br/>\n3 tablespoons olive oil, divided<br/>\n1/2 teaspoon coarse or kosher salt<br/>\nA few pinches of pepper flakes, to taste<br/>\nFinely grated zest of half a lemon, or more to taste<br/>\n1 large or 2 small garlic cloves, minced<br/>\nJuice of half a lemon, or more to taste, to finish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 425°F (220°C). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Prep your broccoli: Wash broccoli well — seriously, there is always a stem-colored worm hidden in the florets when I buy organic or from a farmer’s market, hooray for fewer pesticides! — and pat dry. Slice straight through the broccoli stem(s) as close to the crown of florets as possible. The crown should naturally break into several large florets, and you can cut these down into more manageable chunks. I find that less mess is made and less broccoli rubble is lost when I cut not <em>down</em> through the florets tops to halve chunks but <i>up</i> through the attached stems. (See 2nd photo above.) After cutting through the stem, I use my hands to break the floret the rest of the way in two. Don’t let the stems go to waste. I peel off the tough outer skin and knots and cut the stems into 1/2-inch segments; they cook up wonderfully this way, and at the same speed as the florets.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle the first tablespoon of oil over your baking sheet or roasting pan and brush or roll it around so it’s evenly coated. In a large bowl, toss prepared florets and stems with remaining olive oil, garlic, pepper flakes, salt and lemon zest until they’re evenly coated. Spread broccoli in an even layer in prepared pan. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Roast for 20 minutes, then use a spatula to flip and move pieces around for even cooking. Roast another 10 to 15 minutes, checking every 5, until broccoli is toasty and as crisp as you like it. (As you can see, we like a serious char on ours.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>From the oven, taste a floret for seasoning and add more salt and pepper flakes if needed. Shower with fresh lemon juice and eat immediately, as-is or follow one of the adventures below.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>7 More Insanely Delicious Things To Do With Crispy Broccoli</strong> </p>"}], "link": "https://smittenkitchen.com/2015/04-crispy-broccoli-with-lemon-and-garlic"}