{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/11/kale-and-caramelized-onion-stuffing1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "kale, onion, photo, thanksgiving, vegetarian", "name": "Kale and Caramelized Onion Stuffing", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Technically, this is dressing. Stuffing is cooked inside the bird, dressing, on the outside.</p>", "totalTime": "", "recipeYield": "Serves 8", "recipeIngredient": ["1 1/4-pound (20 ounce) round of sourdough or dense country-style white bread", "1/2 cup olive oil, divided", "3 tablespoons unsalted butter, divided", "3 medium yellow onions, thinly sliced in half-moons", "Kosher salt", "1/2 teaspoon sugar or honey", "2 tablespoons sherry vinegar", "1 pound (large bundle) curly kale, center ribs and stems removed, chopped or torn into large chunks", "2 garlic cloves, minced", "2 cups vegetable, chicken or turkey broth, divided", "Red pepper flakes, to taste", "2 tablespoons sherry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4-pound (20 ounce) round of sourdough or dense country-style white bread<br/>\n1/2 cup olive oil, divided<br/>\n3 tablespoons unsalted butter, divided<br/>\n3 medium yellow onions, thinly sliced in half-moons<br/>\nKosher salt<br/>\n1/2 teaspoon sugar or honey<br/>\n2 tablespoons sherry vinegar<br/>\n1 pound (large bundle) curly kale, center ribs and stems removed, chopped or torn into large chunks<br/>\n2 garlic cloves, minced<br/>\n2 cups vegetable, chicken or turkey broth, divided<br/>\nRed pepper flakes, to taste<br/>\n2 tablespoons sherry</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 400°F. Slice crusts off bread (you can save them for breadcrumbs) and tear loaf into rough 1-ish-inch pieces. Place in a large bowl and drizzle with 4 tablespoons olive oil and toss well. Spread on a large rimmed baking sheet and toast in oven, tossing once or twice for even color, until golden brown and crisp on the outside but still a little tender inside, about 20 minutes. Let cool on sheet, then tip back into that large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, melt 1 tablespoon butter in 2 tablespoons oil in the bottom of a large saute pan over low heat. Add the onions, toss to coat them in oil and cover the pan and with the stove on the lowest heat possible, let them cook undisturbed for 15 minutes. (The steaming and wilting will help them caramelize much faster, yay.) Remove lid, raise heat to medium/medium-high, add sugar and 1 teaspoon salt and cook onions, stirring frequently, for another 15 to 20 minutes, until they’re a deep golden brown. Add 1 tablespoon sherry vinegar and use to scrape any stuck bits off bottom of pan, then cook off. Taste onions. If desired, add a second tablespoon of sherry vinegar and cook off in the same method. (I prefer them with 2 tablespoons.) Add onions to bowl with croutons.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add 2 more tablespoons olive oil to pan and heat garlic for half a minute, before adding kale. Get kale coated with garlicky oil, then add 2 tablespoons broth. Cook kale until wilted and somewhat tender, seasoning well with salt and pepper, about 6 minutes. Add sherry to pan and cook until it almost disappears. Add remaining broth and last two tablespoons of butter and bring mixture to a simmer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour kale-broth mixture over croutons and caramelized onions. Toss well to combine. Pour mixture into a 3-quart casserole dish and cover with foil. Bake for 15 minutes, then remove foil, and bake for another 15 to 20, until golden and crisp on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Do ahead: Each part of this (the croutons, the onions and the kale) can prepared up to 3 days in advance, and assembled and baked when needed. Keep the croutons at room tempearture in a container or bag. Keep the onions in the fridge, as well as the kale and broth mixture. </p>"}], "link": "https://smittenkitchen.com/2015/11-kale-and-caramelized-onion-stuffing"}