{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/02/the-i-want-chocolate-cake-cake1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, chocolate, everyday cakes, photo", "name": "The ‘I Want Chocolate Cake’ Cake", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I regret to tell you that this cake is nothing exactly new, and it’s not because I’m out of ideas (I hope not, at least! One should never taunt the idea faeries, of course.) but because when I found my perfect one-bowl chocolate cake (which we’ve made as an everyday loaf, then riffed as a fudgy layered sheet cake and red wine chocolate wonder, I promise, I can stop anytime) and ridiculously easy fudgy chocolate buttercream, there was no need to keep looking. Here, I’ve slimmed the base and dropped a little sugar to make a thin chocolate cake layer and topped it with an unholy, unapologetic amount of frosting. Because when you really need chocolate cake, I vote for doing it properly.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["Yield: 1 generously frosted 8×8-inch cake, which we cut into 16 small squares.", "Could also yield: 1 generously frosted 8-inch or 9-inch round cake, 12 very generously frosted cupcakes, or it could be doubled and baked in a 9×13-inch pan. Could also be scaled and stacked as a birthday cake. ", "RECIPE_SUBHED__1<u>Cake</u>", "6 tablespoons (85 grams) unsalted butter, at room temperature", "3/4 cup (145 grams) firmly packed dark brown sugar", "2 tablespoons (25 grams) granulated sugar", "1 large egg", "1 large egg yolk", "3/4 cup (175 ml) buttermilk (see Notes for other options)", "1 teaspoon (5 ml) vanilla extract", "1/2 cup (41 grams) Dutch cocoa powder", "1 cup (125 grams) all-purpose flour", "1/4 teaspoon baking soda", "1/2 teaspoon baking powder", "1/2 teaspoon table or fine sea salt", "RECIPE_SUBHED__2<u>Frosting</u>", "2 ounces (55 grams) unsweetened chocolate, melted and cooled", "1 1/2 cups (180 grams) powdered sugar (sifted if lumpy)", "1/2 cup (4 ounces or 115 grams) unsalted butter, at room temperature", "Pinch of fine sea salt (optional)", "1 tablespoons cream or whole milk", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Frosting</u><br/>\n2 ounces (55 grams) unsweetened chocolate, melted and cooled<br/>\n1 1/2 cups (180 grams) powdered sugar (sifted if lumpy)<br/>\n1/2 cup (4 ounces or 115 grams) unsalted butter, at room temperature<br/>\nPinch of fine sea salt (optional)<br/>\n1 tablespoons cream or whole milk<br/>\n1/2 teaspoon vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make the cake:</i> Heat oven to 350°F (175°c). Line the bottom of an 8-inch square cake pan with parchment paper, and either butter the parchment and exposed sides of the pan, or spray the interior with a nonstick spray. In a large bowl, use a hand or stand mixer to beat the butter and sugars until fluffy; scrape down bowl. Add the egg, yolk and vanilla and beat until combined, then the buttermilk and mix again. Scrape the bowl down well and don’t worry if the batter looks uneven. Place your flour, cocoa, baking soda, baking powder and salt in a sifter (I find this step necessary because my cocoa is very lumpy) and shake it over the batter bowl. Stir on low until just combined; scrape down bowl a final time. Scoop batter into prepared pan and smooth flat. Bake for <s>18 to 22 minutes</s> (updated, based on feedback) 25 to 35 minutes, until a toothpick inserted into the center comes out clean. Let cool for 5 to 10 minutes in cake pan on cooling rack, then flip out onto rack or serving plate to completely finish cooling before frosting. Speed this up by placing it outside for 10 minutes (thanks, winter!).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make the frosting:</i> Place frosting ingredients in a food processor and run machine to to mix. Scrape down bowl then process <s>for another 1 to 2 minutes</s> (updated based on feedback) just until smooth and somewhat fluffed. [Don’t have a food processor? Beat butter, powdered sugar and salt, if using, in a large bowl with an electric mixer until fluffy. Pour in chocolate, milk and vanilla, beat until combined, then one more minute to whip it further.] Scoop the frosting onto the cooled chocolate cake and swirl it around. Finish with rainbow sprinkles; don’t even fight it. Cut into squares and prepare for your family/roommates to completely freak out when they spy it on the counter. (But only share if they offer to do dishes.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cake keeps at room temperature for a day or two, or in the fridge up to a week, or so I’ve heard but never tested out.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Notes: </strong><br/>\n<em>Red wine chocolate cake, mocha chocolate cake</em>: You could replace the buttermilk in full with yogurt or sour cream thinned with a little milk or water, with red wine or replace 1/2 cup of it with strong coffee. (Keep 1/4 cup buttermilk so you’ll have an acidic ingredient to wake up the baking soda.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>I don’t have Dutched cocoa:</em> Dutch-process cocoa (generally speaking, it’s the standard in European brands) differs from natural cocoa (what you have if your cocoa isn’t labeled Dutch, or if it’s an American brand) in that its acidity has been neutralized to form a darker, nuttier cocoa that I prefer. That said, if you don’t have Dutched but only a regular or natural cocoa, I haven’t tested this cake with it but suspect that you’ll be just fine, although the cake may be less dark in color.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>How I like to swirl frosting</em>: I always use a small offset spatula (have I convinced you to buy one yet? Seriously, <a href=\"http://www.amazon.com/gp/product/B000WG14FC/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000WG14FC&amp;linkCode=as2&amp;tag=smitten-20&amp;linkId=ZZE3IQF47K57UFMR\">$4.</a> Do it.) and I think the secret is to always <i>push</i> the frosting from the center out, not pull it back. So, push and then make an S-swirl, push and S-swirl, repeat and always quit while you’re ahead (hard, because it’s so fun). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Confetti sprinkles:</em> I got mine from <a href=\"http://www.nycake.com\">New York Cake on 22nd Street</a> but, of course, <a href=\"http://www.amazon.com/gp/product/B008Y2TST0/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B008Y2TST0&amp;linkCode=as2&amp;tag=smitten-20&amp;linkId=SLRSPPISXH7F3JTN\">Amazon</a> sells them as well. </p>"}], "link": "https://smittenkitchen.com/2015/02-the-i-want-chocolate-cake-cake"}