{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/06/chocolate-chunk-granola-bars1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, dairy free, freezer friendly, gluten free, photo, snack", "name": "Chocolate Chunk Granola Bars", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>As mentioned, these are dairy, gluten and nut-free. They can easily (and should be) doubled to fit in the bottom of a 9×13 pan. Like most granola bar recipes, there’s flexibility here. I love the crispy crunch of uncooked millet, but you could instead use quinoa, quinoa flakes, wheat germ (although this would negate the GF status) or even just more oats to replace it. The sunflower seed butter could be replaced with tahini, or another nut butter if you needn’t make these nut-free. For the dried fruit, I used tart cherries because cherries and chocolate always remind me of Cherry Garcia Ice Cream, hooray. If you’ve made the thick, chewy granola bars from the archives, these are a bit thinner and I think you’ll find these less sweet and ingredient-heavy.</p>", "totalTime": "", "recipeYield": "16 2×2-inch granola bars", "recipeIngredient": ["1 1/4 cups (100 grams) rolled oats (be sure that they’re labeled gluten-free if needed; I prefer old-fashioned but any will work)", "1/4 cup (20 grams) rolled oats, finely ground, or 1/4 cup oat flour", "3/4 cup (60 grams) dried unsweetened shredded coconut (I used a medium grind)", "1/3 cup (65 grams) uncooked millet (see alternatives up top)", "1/2 teaspoon fine sea salt", "1/4 teaspoon ground cinnamon (optional)", "1 cup (about 140 grams) chopped dried fruit", "1 cup (170 grams) chopped dark chocolate or chocolate chips", "1/4 cup (65 grams) sunflower seed butter", "1/4 cup olive oil or coconut oil, warmed until liquefied", "1/4 cup (about 85 grams) maple syrup, honey or golden syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/4 cups (100 grams) rolled oats (be sure that they’re labeled gluten-free if needed; I prefer old-fashioned but any will work)<br/>\n1/4 cup (20 grams) rolled oats, finely ground, or 1/4 cup oat flour<br/>\n3/4 cup (60 grams) dried unsweetened shredded coconut (I used a medium grind)<br/>\n1/3 cup (65 grams) uncooked millet (see alternatives up top)<br/>\n1/2 teaspoon fine sea salt<br/>\n1/4 teaspoon ground cinnamon (optional)<br/>\n1 cup (about 140 grams) chopped dried fruit<br/>\n1 cup (170 grams) chopped dark chocolate or chocolate chips<br/>\n1/4 cup (65 grams) sunflower seed butter<br/>\n1/4 cup olive oil or coconut oil, warmed until liquefied<br/>\n1/4 cup (about 85 grams) maple syrup, honey or golden syrup</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350°F (175°C). Line an 8-by-8 inch square pan with two sheets of parchment paper, extending each up two sides, forming a “sling” for your bars to make them easy to remove.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, combine oats, oat flour or ground oats, coconut, millet, salt, cinnamon (if using), dried fruit and chocolate. In a separate, small bowl, whisk together sunflower seed butter, oil and sweetener of choice until smooth. Pour wet mixture into dry and stir until combined. Transfer to prepared pan, spreading until flat, then use an addition square of parchment paper to protect your hand as you press, press, <i>press</i> the ingredients tightly into all corners of the pan, until they can be pressed no flatter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake for 25 to 30 minutes, until the tops are golden and the edges are light brown. Let cool <i>completely</i> before cutting; they’ll be even easier to cut without crumbling if you chill them in the fridge first, so feel free to cool them there. Once cool, use the parchment “sling” to lift bars from pan and transfer to cutting board. Use a sharp, serrated knife in a very gentle sawing motion to cut bars into desired sizes (I usually go for 16 2×2-inch squares). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bars will keep at room temperature for up to a week in an airtight container, but I prefer to freeze them, individually wrapped, until needed. They only need to be out of the freezer for about an hour to fully defrost. </p>"}], "link": "https://smittenkitchen.com/2015/06-chocolate-chunk-granola-bars"}