{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/01/key-lime-pie1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "citrus, lime, photo, tarts pies", "name": "Classic Key Lime Pie", "author": {"@type": "Organization", "name": "\nAdapted somewhat liberally from the version at Joe’s Stone Crab in Miami, where I am not"}, "description": "<p>Most importantly, despite the name, you don’t need key limes to make this. I mean, if you can get them, please do. They’re wonderful. But I made this, as I often do, with regular grocery store Persian limes and it’s no less dreamy with them.</p>", "totalTime": "", "recipeYield": "Every key lime pie recipe agrees that a can of sweetened condensed milk is the king of ingredients. From there, they diverge. Some use more lime juice, some less. (I use 2/3 cup for a nicely tart filling; use only 1/2 cup if you’re more wary of the tartness of limes.) Some use more egg yolks, some use less. (I find I only need 3 for a good set and flavor, but you can go up to 5 if you’d like something extra-rich.) Not all insist that you whip your yolks until they’re pale and ribbony, but it makes for a lovely final texture and I think is worth it.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crust</u>", "1 1/2 cups (155 grams) finely ground graham cracker crumbs (from about 10 crackers)", "3 tablespoons (40 grams) granulated sugar", "2 pinches sea salt", "7 tablespoons (100 grams) unsalted butter, melted", "RECIPE_SUBHED__2<u>Filling</u>", "1 1/2 tablespoons finely grated lime zest", "3 large egg yolks (though extra-large would do you no harm here)", "1 14-ounce (396-gram) can sweetened condensed milk", "2/3 cup (155 ml) fresh lime juice (from about 1 dozen tiny key limes or 4 persian/regular limes)", "RECIPE_SUBHED__3<u>To Finish</u>", "3/4 cup (175 ml) heavy whipping cream", "1 to 2 tablespoons powdered or granulated sugar, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To Finish</u><br/>\n3/4 cup (175 ml) heavy whipping cream<br/>\n1 to 2 tablespoons powdered or granulated sugar, to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Heat oven:</i> To 350°F (176°C).</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make crust:</i> Combine graham crumbs, sugar and salt in a medium bowl and stir until mixed. Add butter and stir until crumbs are evenly coated. Press crumbs into the bottom and up the sides of a standard 9-inch pie dish. I like to use the outer edge of a heavy measuring cup to press in neat, firm sides but nobody will be the wiser if you just use your fingertips. Bake crust until lightly browned, about 10 minutes. Set on cooling rack while you prepare filling. Leave oven on.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make filling:</i> Zest limes into the bottom of a medium bowl until you have 1 1/2 tablespoons. Beat zest and egg yolks with an electric mixer until pale and thick, about 5 minutes. Add sweetened condensed milk and beat until thickened again, about 3 minutes more. Squeeze zested limes until you have 2/3 cups juice. Whisk into yolk mixture until combined. Pour into graham crust and bake pie for another 10 minutes, until set but not browned on top at all. Let pie cool completely before adding topping — you can do this outside (thank you, January!) or even in your freezer (but don’t forget about it) to hasten the process, and your pie reward, along.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Make topping:</i> In a medium bowl, beat cream and sugar until soft peaks are formed. Spread over top of chilled pie. Ideally, pie should be chilled at least another 2 to 3 hours with the cream on top so that it can fully set before you take a slice, but whether that happens is between you and your pie. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Key lime pie keeps in fridge for a week, though certainly not around here.</p>"}], "link": "https://smittenkitchen.com/2015/01-key-lime-pie"}