{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/03/potatoes-with-soft-eggs-and-warm-bacon-vinaigrette1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brunch, budget, easter, eggs, gluten free, photo, potatoes, put an egg on it, salad", "name": "Potatoes with Soft Eggs and Bacon Vinaigrette", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Salade Lyonnaise is traditionally made with poached eggs, and while I’ve got a technique that works pretty well for me [follow along over here], I started making soft-boiled-then-peeled eggs several years ago and haven’t poached a one since — I do so here as well. Crumbled blue cheese isn’t traditional either, but then again neither are potatoes. </p>", "totalTime": "", "recipeYield": "Serves 2 to 3 as a meal, 4 if you’ve got another dish out (we also roasted asparagus)", "recipeIngredient": ["1 1/2 pounds fingerlings, or small red or yukon gold potatoes", "4 large eggs", "1/4 pound frisee (French curly endive) or another sturdy lettuce", "6 ounces slab bacon or thick-cut bacon slices", "2 tablespoons finely chopped shallot", "3 tablespoons red wine vinegar", "1/2 teaspoon smooth Dijon mustard", "2 ounces crumbled blue cheese, or more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 pounds fingerlings, or small red or yukon gold potatoes<br/>\n4 large eggs<br/>\n1/4 pound frisee (French curly endive) or another sturdy lettuce<br/>\n6 ounces slab bacon or thick-cut bacon slices<br/>\n2 tablespoons finely chopped shallot<br/>\n3 tablespoons red wine vinegar<br/>\n1/2 teaspoon smooth Dijon mustard<br/>\n2 ounces crumbled blue cheese, or more to taste</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Cook potatoes:</em> In a large saucepan, cover potatoes with cold water, set a timer for 25 minutes (for small red or gold potatoes), and bring to a boil. Once boiling, reduce to a simmer. Cook until tender but not falling apart, which for small red potatoes usually takes me 25 minutes (fingerlings, because they’re thinner, might be worth checking at 20). Drain and when cool enough to touch, but still hot, halve lengthwise and arrange cut side up on a platter.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Meanwhile, cook eggs:</em> Bring medium saucepan of water to a boil. Lower eggs into it and boil for five (for a runnier egg) to six (for a less-runny but still loose egg) minutes. Drain and rinse egg briefly under cool water until cool enough to handle and carefully peel — because the egg inside is so soft, I recommend chipping off smaller pieces at a time and running it under water as needed so you don’t accidentally rip it open. Set aside. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Prep salad:</em> Tear frisee into bite-size pieces and put in a large bowl. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Right before you’re ready to serve everything, make vinaigrette:</em> If using slab bacon, cut lengthwise into 1/4-inch thick slices, then 1/4-inch thick sticks (lardons); if using bacon slices, just cut them crosswise into 1/4-inch lardons. Cook bacon in a heavy skillet over moderate heat, until bacon is 3/4 as crisp as you’d like it to get. Add shallots, and cook for 1 minute more. Whisk in red wine vinegar and Dijon and let simmer for 10 seconds. Immediately pour 3/4 hot dressing over potatoes and last 1/4 over frisee in bowl, tossing the lettuce to combine evenly. Season both with salt and pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To finish:</em> Top dressed potatoes with peeled eggs and use a knife to cut them into quarters, so they break open over the potatoes. Season cut eggs with salt and pepper again, sprinkle potato dish with blue cheese. Serve with frisee on the side or on top.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Note: I’ve made this a few times (can you blame me?) and sometimes I got a lot of “renderings” from the bacon and had more than enough dressing for the potatoes and side bowl of lettuce and a couple times it felt a little scant. If you don’t feel like you have enough dressing to stretch over the potatoes and lettuce, just cover the potatoes well. The lettuce can be always be lightly dressed with a splash of olive oil, teaspoon of red wine vinegar plus the salt and pepper.</p>"}], "link": "https://smittenkitchen.com/2015/03-potatoes-with-soft-eggs-and-bacon-vinaigrette"}