{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/03/16531757598_bac3f9a735_k.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "gluten free, meat, photo, pork meat, potatoes, savory projects, winter", "name": "Cornmeal-Fried Pork Chops and Goat Cheese-Smashed Potatoes", "author": {"@type": "Organization", "name": "\nFrom Heritage by Sean Brock, with a few adjustments"}, "description": "<p>Note: You are supposed to soak the chops in buttermilk overnight, or at least four hours, so start now!</p>", "totalTime": "", "recipeYield": "Serves 6. We halved this recipe, and wished we hadn’t because leftovers would have been awesome about now.", "recipeIngredient": ["RECIPE_SUBHED__1<u>For the pork chops</u>", "6 boneless pork chops (about 3 ounces each)", "About 3 cups buttermilk, whole milk if you can find it", "Kosher salt and freshly cracked black pepper", "2 cups yellow cornmeal", "Cayenne pepper", "Canola oil (or high heat safflower or sunflower, what I used) for shallow-frying", "RECIPE_SUBHED__2<u>For the potatoes</u>", "3 pounds small-to-medium red potatoes", "Kosher salt", "1 cup half-and-half (or 1/2 cup milk plus 1/2 cup heavy cream)", "6 ounces soft goat cheese", "8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, diced and chilled", "1/2 cup finely sliced fresh chives", "Freshly ground black or white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>For the potatoes</u><br/>\n3 pounds small-to-medium red potatoes<br/>\nKosher salt<br/>\n1 cup half-and-half (or 1/2 cup milk plus 1/2 cup heavy cream)<br/>\n6 ounces soft goat cheese<br/>\n8 tablespoons (1 stick, 4 ounces or 115 grams) unsalted butter, diced and chilled<br/>\n1/2 cup finely sliced fresh chives<br/>\nFreshly ground black or white pepper</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Marinate the pork chops:</em> Pound each pork chop (using a meat pounder or, in a pinch, I’ve also used a cast iron skillet, rather dramatically) between two pieces of plastic wrap to 1/8-inch thick. Place the chops in a container and cover them with the buttermilk. Cover and marinate at least four hours or overnight or in the refrigerator.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Prep the smashed potatoes:</em> Put the potatoes in a large pot, cover with water and add 1/4 cup salt. Bring the water to a simmer over medium-high heat, reduce the heat to medium-low, and cook the potatoes until fork-tender, about 20 minutes for small potatoes or 30 minutes for medium ones; try not to let the water boil.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Cook the chops:</em> Heat your oven to 200 degrees. Remove the chops from the buttermilk, discarding it and patting most of the buttermilk off the chops. Season the chops with salt and cracked pepper. Put the cornmeal in a shallow bowl and season it with salt and cayenne pepper. Dredge the chops in the cornmeal, gently shaking off the excess, and put on a large plate.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Brock wants you to cook these in two large cast-iron skillets, using the oil in each only once, discarding it and putting new oil in for the next chop. I used one 12-inch skillet that fit two chops and reused the oil a couple times, but the downside of this is that it will pick up black bits that fall into the oil as it cooks.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat a large cast-iron skillet over high heat. When the skillet is hot, add a  1/4-inch of oil to each and heat for 1 minute. Carefully place 2 pork chops in each skillet; do not shake the skillets or touch the chops for 1 minute. Reduce the heat to medium-high and cook the chops until golden brown, about 4 minutes. Carefully turn the chops over and cook until golden brown and crispy on both sides, about 3 to 4 minutes more. I found that my chops really wanted to stick on the second side, so slide a thin spatula underneath them to loosen them from the bottom of the pan before transferring the chops to a baking sheet to keep them warm in the oven. Discard the oil the skillet if it gets too murky and repeat with remaining chops.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Finish the potatoes:</em> When the potatoes are almost cooked, bring the half-and-half to a simmer in a small saucepan over medium heat. Drain the potatoes and place them in a large bowl. Using a wooden spoon, carefully smash each potato without breaking it apart. Pour the hot half-and-half over the potatoes; crumble the goat cheese, butter and chives over them then fold it together — I only did this once or twice, preferring to keep as many small pockets of goat cheese throughout as possible. Season with salt, if needed, and white or black pepper. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Serve:</em> The potatoes and chops together. Repeat as soon as possible.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Serve with:</strong> Brock recommends that you serve these with a cucumber and pickled green tomato relish, which sounds like everything I want to eat right now, but I would have had to have had 3 1/2 pounds heirloom green tomatoes and gotten started on it two weeks ago (1 week for each pickling stage). I’ll be trying it out this summer. In a pinch, I wish I’d made <a href=\"https://smittenkitchen.com/blog/2014/07/easiest-fridge-dill-pickles/\">these pickles</a> instead. </p>"}], "link": "https://smittenkitchen.com/2015/03-cornmeal-fried-pork-chops-goat-cheese-smashed-potatoes"}