{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/04/strawberry-rhubarb-soda-syrup1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "drinks, photo, picnics, rhubarb, spring, strawberries", "name": "Strawberry Rhubarb Soda Syrup", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "", "totalTime": "", "recipeYield": "3 cups, if you’re patient", "recipeIngredient": ["1 pound strawberries, stems removed and halved", "1 pound rhubarb, chopped into 1/2-inch segments", "1 cup granulated sugar", "1 cup water", "1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound strawberries, stems removed and halved<br/>\n1 pound rhubarb, chopped into 1/2-inch segments<br/>\n1 cup granulated sugar<br/>\n1 cup water<br/>\n1 lemon</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine strawberries, rhubarb, sugar and water in a large saucepan. Remove several strips of peel from lemon with a knife or peeler and add them to the pot. Bring mixture to a boil and then reduce it to a gentle simmer. Simmer for 20 minutes, or until fruit has completely collapsed, stirring occasionally. Remove from heat, add the juice of half the lemon (or more, to taste) and let fruit cool in syrup for maximum infusion. Once cool, pour mixture through a fine-mesh strainer (or, if you only have a coarse one, line it with cheesecloth or a lint-free towel); press solids with the back of a spoon or spatula to get the most syrup from them. You should have 2 cups right away, but I had to run an errand, left mine sitting in the strainer and was delighted to find 3 full cups of syrup when I got back. Pour into a glass bottle and chill until needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Save fruit pulp in a separate container; it can be used to stir into plain yogurt, oatmeal or even dollop on pancakes. (Be sure to fish out or at least look out for lemon peels if you do.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To make 1 glass of soda, pour 2 tablespoons of the syrup in the bottom of a glass, fill with ice and then seltzer or sparkling water. Give it a stir and add more syrup to taste; for a large glass, you might use up to 2 tablespoons more. Garnish with a lemon wedge, if you wish. Drink and pretend it’s spring.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Do ahead: Syrup should keep in the fridge for at least three weeks, if not longer. </p>"}], "link": "https://smittenkitchen.com/2015/04-strawberry-rhubarb-soda-syrup"}