{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/05/mushroooms-and-greens-with-toast1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "casserole, greens, kale, mushrooms, photo, vegetarian, weeknight favorite", "name": "Mushrooms and Greens with Toast", "author": {"@type": "Organization", "name": "\nAdapted just a little from Tara O’Brady’s Seven Spoons Cookbook"}, "description": "<p>I resisted, for once, but I think this would be lovely with some crispy eggs on top. But I’d otherwise consider this a one-pan meal. No, a one-pan miracle. For mushrooms, O’Brady suggests chanterelles, shiitake and oyster mushrooms and I admit I got carried away, buying a few fancy ones (a trumpet mushroom too!) along with creminis, but you could make this entirely with small white or brown mushroom and it would still be delicious. For the greens, kale, chard, spinach or nettles are suggested; I use lancinato kale leaves. And for a cheese, it really doesn’t matter what you use, only that you like it and it likes to melt. Chèvre, mozzarella, burrata, taleggio and fontina are all “fair game,” she writes. I went with a soft, melty fontina and it was perfect here. I used the bread I’m most obsessed with, massive whole wheat sourdough loaves that you can buy in quarters at Balthazar’s bakery on Spring Street or in Englewood, NJ or at any outlet of the Le Pain Quotidien chain, but of course any bread you enjoy eating will work well here too.</p>", "totalTime": "", "recipeYield": "Serves 4", "recipeIngredient": ["3 tablespoons unsalted butter, divided", "1 tablespoon olive oil", "1 1/2 pounds mixed mushrooms, cleaned, trimmed and torn into bite size pieces (see suggestions above)", "2 thick slices bread from a large, crusty loaf (I’d use 4 from a smaller loaf)", "2 cloves garlic or 1 shallot, minced", "1 tablespoon white wine vinegar, or more to taste (I used 2)", "1 fresh red chile, stemmed, seeded and minced or red pepper flakes, to taste", "Coarse salt and freshly ground black pepper", "6 ounces chopped fresh greens (see suggestions above)", "8 ounces of a good melting cheese, thickly sliced (suggestions above)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3 tablespoons unsalted butter, divided<br/>\n1 tablespoon olive oil<br/>\n1 1/2 pounds mixed mushrooms, cleaned, trimmed and torn into bite size pieces (see suggestions above)<br/>\n2 thick slices bread from a large, crusty loaf (I’d use 4 from a smaller loaf)<br/>\n2 cloves garlic or 1 shallot, minced<br/>\n1 tablespoon white wine vinegar, or more to taste (I used 2)<br/>\n1 fresh red chile, stemmed, seeded and minced or red pepper flakes, to taste<br/>\nCoarse salt and freshly ground black pepper<br/>\n6 ounces chopped fresh greens (see suggestions above)<br/>\n8 ounces of a good melting cheese, thickly sliced (suggestions above)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Melt 2 tablespoons butter and olive oil together in a large, heavy skillet over medium-high heat. One fully hot, add mushrooms to pan and cook, stirring regularly, until they’ve released their water and started to turn golden brown, about 8 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, grill or toast your bread.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>One the mushrooms have a nice color on them, add the garlic or shallots and cook, stirring constantly, for 1 minute. Drizzle with vinegar, most of the chile or chile flakes, salt and pepper and stir to combine. Add the greens; pretty much any kind aside from baby spinach will benefit from about 5 to 8 minutes cooking time, just until collapsed. If you’re me, you’ll add 1 more tablespoon vinegar for brightness at this point. Stir in remaining tablespoon butter and adjust seasonings to taste. Rip bread into irregular croutons and push them into the sauteed vegetables. Lay pieces of cheese atop everything. Turn the heat down to medium low, place a lid on the pan and let the cheese melt, which will take 5 to 10 minutes, depending on the pan and the kind of cheese you used. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Sprinkle with remaining chile, “hand out forks, then bring the the pan to the table.” </p>"}], "link": "https://smittenkitchen.com/2015/05-mushrooms-and-greens-with-toast"}