{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/06/crispy-frizzled-artichokes1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "artichokes, gluten free, grilling, italian, party snacks, photo, summer, vegetarian", "name": "Crispy Frizzled Artichokes", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>About the lemon: Artichokes love to turn brown the second you cut them. Rubbing the exposed sides or anywhere your knife touched the ‘choke with the cut side of a lemon half prevents this, but it’s honestly impossible to prevent all browning, no matter how careful you are. Here’s the good news: I find it really doesn’t matter. The browning has no effect whatsoever on taste, and also disappears the second the artichokes go into boiling water. So, don’t fret if you can keep up with oxidation process; it will all be the same in the long run. </p><p>Shown here: A mix of baby purple artichokes and monstrously huge globe artichokes.  </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["Baby or large artichokes, as many as you wish to prep and eat", "1 to 2 lemons, halved (1 should be fine for smaller amounts)", "Olive oil", "Coarse salt", "Chopped flat-leaf parsley (for garnish, optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Baby or large artichokes, as many as you wish to prep and eat<br/>\n1 to 2 lemons, halved (1 should be fine for smaller amounts)<br/>\nOlive oil<br/>\nCoarse salt<br/>\nChopped flat-leaf parsley (for garnish, optional)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Prepare artichokes</em>: Snap back toughest and unevenly sized outer leaves, peeling and plucking until you get to the paler yellowish leaves that are all the full length of the artichoke. Be careful of thorns; almost every leaf ends in one. If they’re particularly bothersome, you can lop off the bottom third of the artichoke at this point. (We will otherwise do it next.) For baby artichokes, cut off bottom 1/3 of leaves. For full-sized artichokes, cut off bottom 2/3 of leaves (<em>more than you see in my photos</em>), leaving only the top parts attached to the stem and heart. Rub all cut sides with lemon. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Use a knife to pare down rough spots where leaves met the heart. Use a vegetable peeler to remove the outermost layer of the stem and “neck” of the artichoke. With tiny artichokes, the stems are sometimes too small or in bad shape to be used, in which case, feel free to trim them off. Rub exposed sides with lemon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Halve baby artichokes lengthwise through the stem; for full-sized artichokes, quarter them through the stem. Rub cut sides with lemon.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’re using baby artichokes, you’re done with prep. If you’re using full-sized artichokes, you’ll need to take the additional step of cutting out and discarding the fibrous fuzzy (and unpleasant to eat) choke and the wiry (often purple) inner leaves. [See photos above for a visual aid.]</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Heat oven or grill:</em> Heat oven to 400 degrees, a gas grill to its highest setting or a charcoal grill to a very high temperature.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Par-boil artichokes:</em> Bring a pot of salted water to a boil. Add trimmed artichokes and the halved lemon you’ve been using to prevent browning. Boil them for 5 minutes (for baby artichokes) or 10 to 15 minutes (for full-sized artichokes), until a knife point inserted into the neck of the artichoke pierces easily to the center. Drain artichokes well; discard lemon half.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>If roasting artichokes:</em> Drizzle roasting pan with olive oil, spread drained artichokes in a single layer, drizzle with a little additional olive oil and shower with coarse salt. Roast baby artichokes for 15 minutes, then flip, and roast for another 10 to 15 minutes, until crisp and browned. Roast full-sized artichokes for 20 to 25 minutes, then flip, and roast for another 15 to 20, also until crisp and browned.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>If grilling artichokes:</em> In a large bowl, toss drained artichokes with a glug or so of olive oil, enough that they all glisten. Season with salt. If the grill grates are close enough together, I use tongs to arrange the artichokes in one layer. If not, you might need to use a vegetable tray to keep the artichokes from falling through. Grill until artichokes are crisp and brown.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To serve:</em> Shower with additional lemon juice (from second half of lemon), any extra salt (if needed) and parsley. Eat soon, or someone else will.</p>"}], "link": "https://smittenkitchen.com/2015/06-crispy-frizzled-artichokes"}