{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/03/the-consolation-prize-a-pineapple-lime-coconut-and-mint-mocktail1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "coconut, drinks, lime, photo, pineapple", "name": "The Consolation Prize (A Pineapple, Lime, Coconut and Mint Mocktail)", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>A little bit mojito, a little bit piña colada, this tastes like everything I miss about warm weather and sandy beaches, and is especially necessary when the weather report has the audacity to predict snow on the first day of spring.</p><p>Can you put rum in this? Of course you can! I can’t decide whether dark (the piña colada standard) or light (the mojito standard) would be better. I’ll let you know in a few months.</p><p>For four small drinks </p>", "totalTime": "", "recipeYield": "A couple notes: I didn’t photograph it this way, but we discovered later that the smallest splash of seltzer or sparkling water makes this drink foam up gorgeously, and tastes great too. The sweetness level here is fairly low, the way we like it, but I have a hunch that some people might like it with more honey, so definitely adjust to taste, especially if you’re doing what I know you’re going to ask next…", "recipeIngredient": ["A handful of mint leaves", "1 cup pineapple juice", "1/4 cup lime juice", "2 tablespoons honey", "3/4 cup coconut milk, well-shaken", "Ice cubes", "Seltzer, to taste", "Lime wedges, sprigs of mint or sliced fresh pineapple for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>A handful of mint leaves<br/>\n1 cup pineapple juice<br/>\n1/4 cup lime juice<br/>\n2 tablespoons honey<br/>\n3/4 cup coconut milk, well-shaken<br/>\nIce cubes<br/>\nSeltzer, to taste<br/>\nLime wedges, sprigs of mint or sliced fresh pineapple for garnish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In the bottom of a cocktail shaker, lightly muddle mint — no need to render it into small flecks, but if you break it up a little, more flavor will be released. Add pineapple, lime, honey, coconut milk and a few ice cubes and shake it well. Pour over ice cubes in glasses, finish with a splash of seltzer and garnishes. Close your eyes and pretend you’re somewhere tropical.</p>"}], "link": "https://smittenkitchen.com/2015/03-the-consolation-prize-a-mocktail"}