{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/12/gingerbread-layer-cake1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, celebration cakes, christmas, photo, winter", "name": "Gingerbread Layer Cake with Whipped Mascarpone Cream and Sugared Cranberries", "author": {"@type": "Organization", "name": "\nAdapted from Claudia Fleming (cake), Nancy Silverton (stabilized cream) and My Recipes (sugared cranberries) "}, "description": "", "totalTime": "", "recipeYield": "This recipe makes three thin cake layers. As most of us have 2 cake pans, at best, you could also make it into two thicker cake layers, giving it a little more baking time. Or, you could do as I did, which is to hold the last bit of batter in a bowl until the first layer comes out and can be unmolded. It holds up just fine at room temperature for an hour. You’ll have up to 1 cup more whipped cream than you’ll need; you can make a little less or just keep the rest in a jar for another dessert. The cream stays stable due to the added mascarpone, although that was my preference and creme fraiche or sour cream are usually what’s recommended. (Read more about why here.) Finally, the sugared cranberries are something I auditioned at the last minute for the first time so I’m hardly an expert (but hope to be, in two or three bags); you’ll want to start them the night or day before. You’ll have way more than you’ll need; the rest make pretty gifts, festive treats or can be scattered on plates when serving.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Sugared Cranberries</u>", "1 cup (200 grams) plus 1/3 cup (65 grams) granulated sugar", "1 cup water", "1 cup (100 grams) fresh cranberries ", "RECIPE_SUBHED__2<u>Cake layers</u>", "1 cup (235 ml) oatmeal stout or Guinness Stout", "1 cup (235 ml) dark molasses (ideally, not blackstrap)", "1/2 teaspoon baking soda", "3 large eggs", "1 cup (190 grams) packed dark brown sugar", "1 cup (200 grams) granulated sugar", "3/4 cup (150 grams) vegetable or another neutral oil", "2 cups (260 grams) all-purpose flour", "1 1/2 teaspoons baking powder", "2 tablespoons ground ginger", "1 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "1/4 teaspoon freshly grated nutmeg", "1/2 teaspoon kosher salt", "Pinch of ground cardamom", "RECIPE_SUBHED__3<u>Filling</u>", "2 cups (475 ml) heavy or whipping cream", "6 tablespoons (45 grams) powdered sugar", "1/2 cup (115 grams) mascarpone"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Filling</u><br/>\n2 cups (475 ml) heavy or whipping cream<br/>\n6 tablespoons (45 grams) powdered sugar<br/>\n1/2 cup (115 grams) mascarpone</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make sugared cranberries:</u> Bring 1 cup granulated sugar and 1 cup water to a gentle simmer (not a full boil) on the stove, stirring until sugar has dissolved. Remove from heat and add cranberries. Pour mixture into a bowl and let syrupy cranberries chill in fridge overnight, or at least 8 hours. The next morning, drain cranberries (you can reserve syrup for soda or sweetening cocktails). Place remaining 1/3 cup sugar in a bowl and roll cranberries in it. Arrange them on a tray or plate and refrigerate for another 45 minutes to an hour, so that the sugar sets. (They’ll feel mostly dry to the touch.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the cake layers:</u> Heat oven to 350°F. Butter and flour, or use a nonstick spray to coat three 9-inch round cake pans (see note above re: if you have fewer) and line the bottom of each with a fitted round of parchment paper.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring stout and molasses to a boil in a large saucepan and remove from heat; whisk in baking soda carefully — it will foam up. Cool to room temperature. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together sugars and oil. Whisk in eggs, then whisk in cooled stout-molasses mixture. Place dry ingredients in a fine-mesh sieve or sifter and shake over bowl. Stir until just combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Divide batter into prepared cake pans; you’ll have about (updated!) a scant (bit less than) <strong>2 cups or 515 grams</strong> of batter in each. Bake for 18 to 22 minutes, until a toothpick inserted into the center of the cake comes out batter-free. Cool in pan on rack for 5 minutes, then flip out onto cooling rack, carefully remove parchment paper (it’s sticky) and flip back right side-up, letting each layer cool completely. You can hasten this along outside (if it’s cold) or in the freezer. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make whipped mascarpone cream:</u> Beat heavy cream and powdered sugar in a large bowl with a whisk or electric beaters until soft peaks form. Beat in mascarpone, one spoonful at a time, just until it disappears into the cream. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assemble cake:</u> Place first cake layer on cake stand and level top with a serrated knife if it has domed. Spread with 1 cup whipped mascarpone. Repeat twice, then smooth sides. Decorate with sugared cranberries. Serve immediately, or keep refrigerated until needed.</p>"}], "link": "https://smittenkitchen.com/2015/12-gingerbread-layer-cake"}