{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/12/eggnog-waffles1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, gift guides, photo, waffles", "name": "Eggnog-Kissed Waffles", "author": {"@type": "Organization", "name": "\nAdapted from A Kitchen in France"}, "description": "<p>Let’s talk about these waffles. As someone who has found my waffle nirvana twice now — first, in Marion Cunningham’s Essential Overnight Waffles and a second time when I finally got Liège Waffles right at home — you might wonder why am I still making new waffle recipes. The problem with the other two is that they expect you to be a person who plans ahead. I am not. Like a lot of people in 2014, I was charmed by Mimi Thorrisson’s first cookbook, but it was her waffle recipe — yeasted, but with only a 30-minute rising time — that I was the most curious to try. I knew it wouldn’t be enough time for a full rise, but wondered how a half-risen waffle would taste; certainly not bad, right? While the results are never going to knock my favorite two out of their position, we enjoyed them for exactly what they were, a barely sweet lightweight waffle with a bit more nuance than the pancake batter-type. </p><p>As for the eggnog, well, I saw the yolks and the whipped whites and the suggested rum and my brain went straight to eggnog, as it will in December, and so I added nutmeg, cloves and vanilla too. The flavor here is eggnog-kissed; a gentle hint of eggnog. To amp up the holiday vibe, you might warm your syrup of choice with some mulling spices for a spiced syrup. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["1 1/2 cups whole milk", "2 tablespoons granulated sugar", "2 teaspoons (10 grams) crumbled fresh yeast or 1 teaspoon active or instant dry yeast", "2 cups (240 grams) all-purpose flour, sifted", "1/2 teaspoon finely grated nutmeg", "1/4 teaspoon ground cloves", "1/4 teaspoon fine sea salt", "3 large eggs, separated", "7 tablespoons (100 grams) unsalted butter, melted", "1 teaspoon vanilla extract or the seeds from half a vanilla bean", "2 tablespoons dark rum, brandy or bourbon (optional)", "Powdered sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 1/2 cups whole milk<br/>\n2 tablespoons granulated sugar<br/>\n2 teaspoons (10 grams) crumbled fresh yeast or 1 teaspoon active or instant dry yeast<br/>\n2 cups (240 grams) all-purpose flour, sifted<br/>\n1/2 teaspoon finely grated nutmeg<br/>\n1/4 teaspoon ground cloves<br/>\n1/4 teaspoon fine sea salt<br/>\n3 large eggs, separated<br/>\n7 tablespoons (100 grams) unsalted butter, melted<br/>\n1 teaspoon vanilla extract or the seeds from half a vanilla bean<br/>\n2 tablespoons dark rum, brandy or bourbon (optional)<br/>\nPowdered sugar, for dusting</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine milk and granulated sugar and heat until lukewarm, no more than 116 degrees F. Stir in yeast and set aside for 5 minutes. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk flour, nutmeg, cloves and salt together in a large bowl. Create a well in the center and pour in the milk-yeast mixture, the 3 yolks, butter, vanilla and rum. Mix until you have a smooth batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place egg whites in a clean bowl and beat with an electric mixer until stiff peaks form. Fold egg whites batter. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let batter stand at room temperature for 30 minutes, then cook according to your waffle-maker’s instructions. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>You can keep waffles warm in 225 degrees F oven until needed.  Dust with powdered sugar before serving.</p>"}], "link": "https://smittenkitchen.com/2015/12-eggnog-waffles-a-few-favorite-kitchen-things"}