{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/02/charred-cauliflower-quesadillas1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cauliflower, peppers, photo, sandwich, tex mex, vegetarian, weeknight favorite", "name": "Charred Cauliflower Quesadillas", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Poblanos are very mild hot peppers. You could use fewer or swap them with a small bell pepper for less heat, or swap one or both with a hotter jalapeño or other chile for more heat. </p>", "totalTime": "", "recipeYield": "6 quesadillas, serves 6", "recipeIngredient": ["2 small or 1 large fresh poblano chiles", "1 small head cauliflower, cored and cut into rough 1-inch chunks", "Salt and freshly ground black pepper to taste", "3 tablespoons olive oil, plus more for cooking quesadillas", "3 scallions, thinly sliced", "1 tablespoon lime juice", "2 cups (about 8 ounces) coarsely grated monterey jack cheese", "12 small (7-inch) flour tortillas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 small or 1 large fresh poblano chiles<br/>\n1 small head cauliflower, cored and cut into rough 1-inch chunks<br/>\nSalt and freshly ground black pepper to taste<br/>\n3 tablespoons olive oil, plus more for cooking quesadillas<br/>\n3 scallions, thinly sliced<br/>\n1 tablespoon lime juice<br/>\n2 cups (about 8 ounces) coarsely grated monterey jack cheese<br/>\n12 small (7-inch) flour tortillas</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Char peppers:</em> Over a gas burner turned to high, hold the poblanos over the flame with tongs and char them until they are black and blistered all over. Alternatively, you could do this under a broiler, turning them frequently for even blistering. Transfer hot chiles to a bowl and cover tightly with foil. Set aside to steam and let their skins loosen while you cook the cauliflower.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Char cauliflower:</em> In a large bowl, toss cauliflower with 3 tablespoons olive oil, salt and pepper, until it’s evenly coated. Heat your largest heaviest frying pan over high heat until almost smoking, add cauliflower, and let it cook until each piece has a few black spots but is not mushy, turning and moving it frequently to ensure even cooking. This will take 8 to 10 minutes. Transfer florets to cutting board to rest. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Mix filling:</em> When poblanos are cool enough to handle, peel the charred skin off with your fingertips or a paring knife. Pull out and discard stems and seed clusters, and slice peppers into 1/4-inch wide strips. Add to cauliflower on board and give both a rough chop together, reducing the cauliflower to no bigger than 1/2-inch chunks. Return cauliflower and peppers to the large bowl, add scallions, lime juice and salt to taste. You should have about 2 cups of cauliflower filling.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Assemble and cook quesadillas:</em> Lay out 6 tortillas and spread 1/3 cup cauliflower filling and 1/3 cup shredded cheese to each. Place second 6 tortillas on top as lids. Heat a skillet over medium heat. Once hot, coat lightly with olive oil and reduce heat to medium-low. Cook quesadillas until browned underneath, about 3 to 4 minutes. Carefully a flip — a large, thin spatula like <a href=\"http://www.amazon.com/gp/product/B000GGTYC8/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000GGTYC8&amp;linkCode=as2&amp;tag=smitten-20&amp;linkId=75U5LAE43ORGFDWL\">my favorite kind</a> helps here — and repeat on the second side. Repeat with remaining quesadillas. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>To serve:</em> Cut quesadillas into wedges and serve with your choice of fixings. Two of my favorites are below.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Cumin-Lime Crema</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 cup sour cream or Mexican crema<br/>\nA few gratings fresh lime zest<br/>\n1 tablespoon freshly squeezed lime juice<br/>\n1/2 teaspoon ground cumin<br/>\nPinch of salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine, adjust seasonings to taste, and serve alongside quesadillas.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Lazy Taco Slaw</b></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 bag coleslaw mix or (as used here) 3 cups finely shredded red cabbage and 1 coarsely grated carrot<br/>\nCoarse salt<br/>\nJuice of half a lime<br/>\n2 scallions, sliced thin<br/>\nA dollop of mayonnaise, sour cream or plain yogurt<br/>\nA dash of hot sauce (optional)<br/>\n1/4 cup roughly chopped cilantro or flat-leaf parsley leaves</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss cabbage mix, salt and lime together in a large bowl; set aside for 5 minutes. It will shrink down a bit. Stir in scallions, then mayo and hot sauce. Adjust seasonings/ingredients to taste, then stir in cilantro leaves. Serve alongside quesadillas or any of your favorite tortilla-clad meals. </p>"}], "link": "https://smittenkitchen.com/2015/02-charred-cauliflower-quesadillas"}