{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/06/oven-ribs-even-better1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "grilling, meat, photo, picnics, pork meat, summer", "name": "Oven Ribs, Even Better", "author": {"@type": "Organization", "name": "\nAdapted and updated from Molly’s and Harold McGee’s Dry Rub Ribs"}, "description": "", "totalTime": "", "recipeYield": "For 1 5-pound rack spare ribs; we estimate about a pound of ribs per person. We tripled this recipe for our first ribs party this summer, doubled it for our second. Makes about 1 cup rub per rack. (This is a thick coating and we prefer it this way.)", "recipeIngredient": ["1/2 cup packed dark brown sugar", "2 tablespoons paprika (sweet, hot or smoked, whichever variety you prefer)", "3 tablespoons chili powder", "1 tablespoon onion powder", "2 tablespoons kosher salt (Diamond brand, which is very lightweight; for most others, use 1 1/4 tablespoons; ", "<a href=\"https://smittenkitchen.com/tips/2010/06/29/not-all-salts-are-created-equally/\">more about why here</a>", ")", "Chipotle powder or ground red pepper (cayenne) to taste", "As many cranks of freshly ground black pepper as your arm is in for", "1 5-pound rack spare ribs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1/2 cup packed dark brown sugar<br/>\n2 tablespoons paprika (sweet, hot or smoked, whichever variety you prefer)<br/>\n3 tablespoons chili powder<br/>\n1 tablespoon onion powder<br/>\n2 tablespoons kosher salt (Diamond brand, which is very lightweight; for most others, use 1 1/4 tablespoons; <a href=\"https://smittenkitchen.com/tips/2010/06/29/not-all-salts-are-created-equally/\">more about why here</a>)<br/>\nChipotle powder or ground red pepper (cayenne) to taste<br/>\nAs many cranks of freshly ground black pepper as your arm is in for<br/>\n1 5-pound rack spare ribs</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>To finish: 2 teaspoons cider vinegar</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Tools: If you can find it, a wide roll of heavy-duty foil makes the racks much easier to wrap up. You’ll also want a large rack (cooking cooling sheets, so long as they’re metal and thus ovensafe, are just fine) and a large baking sheet per rack of ribs.  </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 200°F.* In a medium bowl, combine all of the spices and seasonings. On a piece of foil large enough to wrap around your ribs, place rack of ribs, meatier side up. Sprinkle half of spice rub over rack, patting it on generously, including the sides. Carefully — it can help have a second person hold the foil down while you lift the rack — flip the rack of ribs back onto the foil so that they’re now meatier side down. Pat on remaining rub. Tightly fold the foil to seal packets. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Set a metal rack (a cookie cooling sheet works well here) over a baking sheet and place foil-wrapped ribs on top. Bake for 4 hours, then reduce temperature to 175°F for 2 more hours, or until a fork easily penetrates the meat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Open packet of ribs very carefully and pour accumulated juices into a saucepan. I find this easiest with one person lifting/tilting ribs packet and the other one snipping a corner and making sure the juices only go where you want them to. Bring the saucepan to a full boil and reduce the mixture until it becomes thicker, syrupy and will coat a spoon — usually by at least half. Stir in vinegar. This is the “barbecue sauce” for those that like it on their ribs; it will be fairly salty and I always warn people to use it judiciously.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, cut the ribs apart and spread them on a serving tray. For extra caramelization, you can spread them back on their baking sheet (sans rack) and run them under the broiler for a couple minutes.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Serve ribs with sauce on the side.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* <strong>Let’s talk about timing:</strong> These cooking times and temperatures, laid out by the great Harold McGee, require 6 hours. But, real life ensures that I always start them late, and while “low and slow” is the barbecue bible for a reason — you’re always going to get the best meat from the longest gentlest cooking times — you’d be pretty amazed by the results of even 3-hour ribs. Long cooking times are not an exact science. As with humans, heh, some ribs are meatier than others and will take longer. Regardless, if you’re looking for guidelines, here are some other time and temperature combinations that have worked for us in the past: </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 1/2 to 3 hours at 300°F.<br/>\n3 1/2 to 4 hours at 250°F.<br/>\n4 hours at 225°F</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>We’ve also fiddled with combinations, such as a higher temperature at the beginning, and then, upon realizing they’d be ready sooner than we’d need them, turning them down to 175°F for the remaining time. And vice-versa, starting with the low temperatures in the original recipe, and realizing at the 4 hour mark, they were coming along too slowly and finishing them at 300°F. I hope these extra options make it easier, and not more confusing, to make yours at home.</p>"}], "link": "https://smittenkitchen.com/2015/06-oven-ribs-even-better"}