{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/08/takeout-style-sesame-noodles-with-cucumber1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chinese, cucumber, gluten free, lunch, photo, quick, summer, vegetarian, weeknight favorite", "name": "Takeout-Style Sesame Noodles with Cucumber", "author": {"@type": "Organization", "name": "\nSauce adapted from Ed Schoenfeld, via Sam Sifton "}, "description": "<p>Cold sesame noodles, lightened up for summer. I used wide, flat rice noodles (often sold as rice “sticks” typically used for pad Thai here, but 1/8-inch thick Chinese egg noodles, sold frozen or fresh at Asian markets, are more takeout traditional (but not gluten-free). Chinese sesame paste is made with toasted sesame seeds, while Middle Eastern tahini is usually made with plain, untoasted seeds. I used tahini, because it’s what I had on hand, and it works just fine. You can add an extra splash of toasted sesame oil to compensate for any lost toasted sesame flavor, if you wish. Peanut allergies? Just use sesame seed paste entirely here, and toasted sesame seeds for garnish. The flavor will be slightly different, but no less delicious. 2 teaspoons chile-garlic paste is the original recommendation but we just dotted it on the grown-up bowls, so not to scare the heat-averse 5 year-old. Note: while soy sauces are naturally gluten-free, some are brewed using trace amounts of wheat, and if you are gluten-free, it’s best to look for a clear gluten-free label before buying one. </p>", "totalTime": "", "recipeYield": "Serves 4, generously, and up to double that if served as shown, with lots of cucumber, peanuts and herbs", "recipeIngredient": ["3/4 pound dried rice noodles (see notes up top)", "2 tablespoons toasted sesame oil, plus a splash to loosen noodles", "2 tablespoons Chinese sesame paste or tahini (see note up top)", "1 tablespoon smooth peanut butter", "3 1/2 tablespoons soy sauce", "2 tablespoons Chinese rice vinegar", "1 tablespoon granulated or brown sugar", "1 tablespoon finely grated ginger", "2 teaspoons minced garlic (from 1 medium-large clove)", "Chili-garlic paste, to taste", "1/2 pound cucumber, very thinly sliced", "1/2 cup roasted salted peanuts, roughly chopped", "A handful of chopped fresh herbs, such as mint and cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3/4 pound dried rice noodles (see notes up top)<br/>\n2 tablespoons toasted sesame oil, plus a splash to loosen noodles<br/>\n2 tablespoons Chinese sesame paste or tahini (see note up top)<br/>\n1 tablespoon smooth peanut butter<br/>\n3 1/2 tablespoons soy sauce<br/>\n2 tablespoons Chinese rice vinegar<br/>\n1 tablespoon granulated or brown sugar<br/>\n1 tablespoon finely grated ginger<br/>\n2 teaspoons minced garlic (from 1 medium-large clove)<br/>\nChili-garlic paste, to taste<br/>\n1/2 pound cucumber, very thinly sliced<br/>\n1/2 cup roasted salted peanuts, roughly chopped<br/>\nA handful of chopped fresh herbs, such as mint and cilantro, for garnish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cook noodles according to package directions and rinse with cold water to cool. Drain well. Drizzle with a tiny splash of toasted sesame oil to keep them from sticking until dressed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Meanwhile, whisk sesame paste and peanut butter in the bottom of a small bowl, then whisk in soy sauce, rice vinegar, remaining 2 tablespoons sesame oil, sugar, ginger, garlic and chile-garlic paste to taste until smooth. Adjust flavors to taste. It might seem a bit salty from the bowl, but should be just right when tossed with noodles.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Toss sauce with cold noodles. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place a medium-sized knot of dressed noodles in each bowl, followed by a pile of cucumber. Garnish generously with peanuts and herbs. Serve with extra chile-garlic paste on the side. </p>"}], "link": "https://smittenkitchen.com/2015/08-takeout-style-sesame-noodles-with-cucumber"}