{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/09/the-perfect-manhattan1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bourbon, drinks, fall, photo", "name": "The Perfect Manhattan", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I’ve always been a little suspicious of the stories that surround old recipes; they often read too orchestrated, too twee — “the pie was dropped on the floor and voila! A tarte tatin was born!” etc. — to ring authentic. The Manhattan cocktail is no different. One disputed theory holds that the drink originated at the Manhattan Club in New York City in the 1870s, where it was created for a banquet that involved everyone from Winton Churchill’s mom to a failed presidential candidate that was so successful, everyone wanted the drink too.  Another, also disputed, argues that it was invented by a bartender named Black in the 1860s. I’m far more enchanted to have read about a North Frisian island named Föhr where the Manhattan cocktail is said to be popular — apparently many people there immigrated to Manhattan and back again at one point, taking the drink with them — mostly because they apparently make it just the way we like it: a little dry. Is it true? As my research has been inconclusive, as soon as I hit publish on this post, I’m going to get on my boat and find out.</p>", "totalTime": "", "recipeYield": "Makes 1 drink", "recipeIngredient": ["Ice", "2 ounces rye or bourbon whiskey", "1/2 ounce sweet vermouth, usually red", "1/2 ounce dry vermouth, usually white", "2 dashes angostura, peychauds or orange bitters", "Maraschino cherry (traditional) or small piece lemon peel for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Ice<br/>\n2 ounces rye or bourbon whiskey<br/>\n1/2 ounce sweet vermouth, usually red<br/>\n1/2 ounce dry vermouth, usually white<br/>\n2 dashes angostura, peychauds or orange bitters<br/>\nMaraschino cherry (traditional) or small piece lemon peel for garnish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add rye, vermouths and bitters to a cocktail shaker with ice and stir (if you want to be uber-traditional about it) or shake them together. Strain ice as you pour into a rocks or martini glass, or pour ice and drink into a tumbler. Garnish and enjoy slowly because this is bonkers potent.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Rye vs. bourbon and other whiskeys from a non-expert, i.e. corrections welcome:</strong> American rye whiskey must be distilled from at least 51% rye, but rye does not, by definition, have to be made in America. Canada produces a lot of rye whiskey, but by their own regulations. Bourbon must be distilled from at least 51% corn. It must be made in America and is most often made in Kentucky. Tennessee whiskey, basically bourbon whiskey from Tennessee, uses something called the Lincoln County Process in which whiskey, after it is distilled, is filtered through sugar-maple charcoal, making it amazing. American rye tends to be more dry and spicy than bourbon, which is fuller in body with a vanilla/caramel vibe. Rye is more traditional in the Manhattan cocktail, largely because Manhattan was a rye town when the drink was hatched in the late 1800s. How did I do? </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Angostura vs. peychauds vs. orange bitters:</strong> Angostura, traditional for the Manhattan, is made from a secret recipe, and is quite aromatic. Peychauds, slightly spicier and more sweet, is a great second choice (and what I used instead). Orange bitters are not traditional, but I think taste great in an Manhattan, although giving it more of an old-fashioned vibe.</p>"}], "link": "https://smittenkitchen.com/2015/09-the-perfect-manhattan"}