{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/01/my-ultimate-chicken-noodle-soup1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, photo, savory projects, soup, winter", "name": "My Ultimate Chicken Noodle Soup", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>You’ll want about 4 to 4 1/2 hours to make this in one afternoon. Or, you can break it up over two days or cooking periods by making the broth either on the stove in 2 to 3 hours or in a slow-cooker for longer (such as while you’re at work), at which point you’ll need just an hour to finish the soup, making it weeknight accessible. </p><p>If you’re a total heathen, as we sometimes are, you can use up to 12 ounces soup noodles here for recipe that will be almost more noodle than soup. But I recommend at least starting with the 9-ounce level before determining if overkill will be necessary.</p>", "totalTime": "", "recipeYield": "5 quarts, or about 10 to 12 meal-sized servings", "recipeIngredient": ["RECIPE_SUBHED__1<u>Broth</u>", "2 medium-large yellow onions, unpeeled, halved or 1 large onion plus 1 large leek, cleaned and cut lengthwise", "2 garlic cloves, peeled and smashed a little", "1 large carrot", "1 large parnsip (optional)", "1 celery rib", "4 quarts water", "4 pounds chicken bones (from about two carcasses leftover from a roast or rotisserie) or a combination of fresh chicken wings (my first choice), backs, necks or feet", "1 tablespoon kosher salt", "1/2 teaspoon dried thyme or 2 teaspoons chopped fresh", "1/8 teaspoon red pepper flakes", "1 tablespoon tomato paste", "1 bay leaf", "RECIPE_SUBHED__2<u>To Finish</u>", "3 bone-in skin-on chicken breast halves", "2 large carrots, peeled and diced or 1 large carrot and 1 large parsnip, diced", "1 large leek, trimmed and sliced into 1/2-inch segments", "1 to 2 celery ribs, chopped or diced", "9 ounces thin egg noodles or soup noodles of your choice", "2 tablespoons finely-chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To Finish</u><br/>\n3 bone-in skin-on chicken breast halves<br/>\n2 large carrots, peeled and diced or 1 large carrot and 1 large parsnip, diced<br/>\n1 large leek, trimmed and sliced into 1/2-inch segments<br/>\n1 to 2 celery ribs, chopped or diced<br/>\n9 ounces thin egg noodles or soup noodles of your choice<br/>\n2 tablespoons finely-chopped flat-leaf parsley</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Make the broth:</em> </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[On the stove] Combine all ingredients in a large (6 to 8 quart) stock pot over high heat and bring to a boil. Once boiling, reduce to a gentle simmer, skim any unpleasant looking foam (“skim the scum” is kitchen parlance for this step, but I’m trying to be polite) and cover with a lid. Simmer for 2 1/2 hours. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[In a slow-cooker] Combine all ingredients in a large (6 quart or larger) slow-cooker. Cook on LOW for 10 hours or HIGH for 5. Strain into a large pot (5.5 quarts or more) and let rest in the fridge until needed, or, if you’re finishing the soup right away, bring to a simmer on the stove. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Cook the chicken:</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>[Both methods] Add whole chicken breasts to simmering broth. Simmer for 20 minutes, until they’re cooked through, then strain broth [for stovetop method] or simply remove cooked chicken breasts [from the slow-cooker method] and set them aside. Taste broth, and adjust seasoning if needed. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Finish the soup:</em></p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add diced vegetables to simmering broth on stove and cook for 5 minutes, until firm-tender. Add soup noodles and cook according to package instructions, usually 6 to 10 minutes. Meanwhile, once chicken breasts are cool enough to handle, remove skin and bones and shred or chop into small chunks. Return chicken to soup and simmer for 2 minutes, until heated through. Finish with parsley and serve to some very lucky people. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>To de-fat the broth:</i> Once the broth portion is complete and the soup has settled a little, you can skim any fat that’s accumulated at the surface with a soup skimmer or spoon, to taste. If you’re going to chill the broth before finishing the soup another day, it’s easiest to take the fat off right before you use it; it will have solidified at the surface. P.S. Don’t toss it, please! It makes for wonderful <a href=\"https://smittenkitchen.com/blog/2008/02/matzo-ball-soup/\">matzo balls</a> and fried <a href=\"https://smittenkitchen.com/blog/2008/12/potato-pancakes-even-better/\">latkes</a>. </p>"}], "link": "https://smittenkitchen.com/2015/01-my-ultimate-chicken-noodle-soup"}