{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/04/17041084926_d38d46dae0_k.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "avocado, cucumber, dairy free, gluten free, photo, picnics, salad, side dish, vegetarian", "name": "Obsessively Good Avocado Cucumber Salad", "author": {"@type": "Organization", "name": "\nInspired by the side of Julia Turshen’s plate "}, "description": "<p>This salad is gluten-free, dairy-free, chametz-free and vegetarian… but you should make it anyway, heh, because it’s fresh and green and totally hits the spot. It also takes about 5 minutes, tops, to put together which means that you can make as much of a habit of it as we have. </p><p>There are a ton of ways to adapt it, too. Last Friday, I added some thinly sliced Romaine hearts for bulk, but still left it predominantly a cucumber and avocado bowl. I added the scallions, not Julia, but if they’re not your thing, skip them. If you’re not into lime and cilantro or parsley, try lemon and dill. If you’re not into mayo, try using yogurt. Or, skip the creamy dressing entirely. You could make a Tex-Mexish variation with minced jalapeno, olive oil and ground cumin, or a Japanese-ish version with a dressing of toasted sesame oil, miso, rice vinegar, ginger and garnished with toasted black and/or white sesame seeds. And if that’s still not enough to get you started, be warned that salads this simple might lead to you to add another dish, and then another, and then you might have as huge of a Spring feast as we had on Sunday night. Don’t worry, I told the family not to get used to it.</p>", "totalTime": "", "recipeYield": "Serves 2 as a main or 4 as a side", "recipeIngredient": ["3/4 to 1 pound seedless cucumber, washed and chopped into chunks", "2 thin or 1 regular scallions, thinly sliced", "1 large avocado, pitted and diced", "2 tablespoons mayonaise", "Juice of half a lime, plus more to taste", "Salt and hot sauce (we used Sriracha) to taste", "Chopped cilantro or flat-leaf parsley to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>3/4 to 1 pound seedless cucumber, washed and chopped into chunks<br/>\n2 thin or 1 regular scallions, thinly sliced<br/>\n1 large avocado, pitted and diced<br/>\n2 tablespoons mayonaise<br/>\nJuice of half a lime, plus more to taste<br/>\nSalt and hot sauce (we used Sriracha) to taste<br/>\nChopped cilantro or flat-leaf parsley to garnish</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Combine cucumber, scallions and avocado in a bowl. Whisk together mayo, lime and seasonings, adjusting levels to taste. Drizzle salad with dressing and garnish with cilantro or parsley. Repeat again tomorrow. </p>"}], "link": "https://smittenkitchen.com/2015/04-obsessively-good-avocado-cucumber-salad"}