{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/03/baked-chickpeas-with-pita-chips-and-yogurt1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, middle eastern, pantry, photo, vegetarian, weeknight favorite", "name": "Baked Chickpeas with Pita Chips and Yogurt", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>My baked chickpea curiousity began many years ago, when Amanda Hesser shared a recipe in the New York Times from a Basque cookbook for baked garbanzos in 1999 (yes, I’m old). I’d forgotten about it until the Times relaunched their Cooking section last fall, but I was thrown by the need for saffron threads, which are expensive to procure and likely meant that most people wouldn’t make it. So, I got to thinking about what other cultures and flavors could be applied, and landed in the Middle East. In short, it’s not the first time I’ve gone all the way around to realize later I was making something that already existed, a dish known as fatteh. </p><p>Note: To make this gluten-free, make your chips from gluten-free wraps or pitas. To make this vegan or dairy-free, make a lemon-tahini sauce, minus the yogurt. (It can be thinned with water, once you get the lemon level where you like it.) </p>", "totalTime": "", "recipeYield": "Serves 6 generously, if eaten nacho-style", "recipeIngredient": ["RECIPE_SUBHED__1<u>For the chickpeas</u>", "1 pound dried chickpeas (garbanzo beans) or 4 15-ounce cans cooked chickpeas", "1/4 cup olive oil", "2 medium yellow onions, halved and thinly sliced", "3 cloves of garlic, peeled and minced", "2 teaspoons ground cumin", "2 teaspoons ground coriander", "1 teaspoon paprika or ", "<a href=\"http://en.wikipedia.org/wiki/Sumac\">sumac</a>", "1/2 teaspoon cayenne, spoonful of harissa or a couple shakes of your favorite hot sauce (all adjusted to your heat preference)", "Few gratings fresh lemon zest", "2 teaspoons coarse sea or kosher salt (what I used for lightly salted broth, use more for unsalted, less for salted or canned beans)", "4 cups vegetable broth (for dried but soaked chickpeas), 1 1/2 cups vegetable broth (for cooked chickpeas)", "1 cup or more of water (will likely only need if beans weren’t pre-soaked)", "RECIPE_SUBHED__2<u>Fixings</u>", " (all instructions below)", "Fresh pitas for pita chips", "Big handful of parsley (or a mix of parsley, cilantro and mint would be good too)", "1/4 cup pine nuts", "Tomato-cucumber “relish” salad", "Lemon-tahini yogurt or plain yogurt", "Additional paprika or sumac for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Fixings</u> (all instructions below)<br/>\nFresh pitas for pita chips<br/>\nBig handful of parsley (or a mix of parsley, cilantro and mint would be good too)<br/>\n1/4 cup pine nuts<br/>\nTomato-cucumber “relish” salad<br/>\nLemon-tahini yogurt or plain yogurt<br/>\nAdditional paprika or sumac for sprinkling</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Soak dried chickpeas:</i> Do you have to soak beans before you cook them? <a href=\"http://www.seriouseats.com/2014/09/soaking-black-beans-faq.html\">Nope</a>, <a href=\"http://www.latimes.com/food/dailydish/la-dd-dont-soak-dried-beans-20140911-story.html#page=1\">no</a>, <a href=\"http://ruhlman.com/2011/03/how-to-cook-dried-beans/\">nope</a>. But it will save a lot of cooking time, making this more of a one-hour weeknight meal. So, if you can plan ahead, soak them in an ample amount of water at room temperature for 24 hours. Don’t have 24 hours? I soaked mine for 3. I will make final cooking time estimations based on soaking times. Using canned beans? Skip this step entirely.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>Prepare your chickpeas:</i> Heat oven to 375°F (190°C). In a large, heavy pot such as a Dutch oven (mine was 4 quarts, an ideal size), heat olive oil in the bottom of the pan over medium-high heat. Add onions and cook for 5 minutes, until they begin to soften. Add garlic and saute garlic and onions together for 3 to 4 minutes more, until everything is wilted. Add spices, zest and salt and cook with onions and garlic for one minute. Add drained soaked or canned chickpeas and:</p>"}], "link": "https://smittenkitchen.com/2015/03-baked-chickpeas-with-pita-chips-and-yogurt"}