{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/06/strawberry-cheesecake-ice-cream-pie1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "ice creamsorbet, photo, strawberries, summer, tarts pies", "name": "Strawberry Cheesecake Ice Cream Pie", "author": {"@type": "Organization", "name": "\nAdapted a bit liberally from Lisa Fain’s Mexican Coffee Ice Cream Pie"}, "description": "", "totalTime": "", "recipeYield": "An additional note about texture: The cream cheese base of this pie gets firm but not rock-hard in the freezer (a good thing), but the whipped cream topping can get very firm, almost popsicle-like. If this isn’t to your liking, you can add the whipped cream right before serving, or only let it firm up 10 minutes in the freezer, enough that it can stand up to the wet strawberry topping but not be fully frozen.", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crust</u>", "1 1/2 cups (155 grams) finely ground graham cracker crumbs (from about 10 crackers)", "3 tablespoons (40 grams) granulated sugar", "2 pinches sea salt", "7 tablespoons (100 grams) unsalted butter, melted", "RECIPE_SUBHED__2<u>Cheesecake filling</u>", "1 8-ounce package cream cheese, at room room temperature", "1 (14-ounce) can sweetened condensed milk", "1 teaspoon finely grated lemon zest", "1 teaspoon vanilla extract", "RECIPE_SUBHED__3<u>Whipped cream topping</u>", "1 cup heavy or whipping cream", "1 teaspoon vanilla extract", "1 tablespoon granulated sugar", "RECIPE_SUBHED__4<u>Strawberry sauce</u>", "1 pound strawberries, hulled and halved", "2 tablespoons sugar", "Juice of half a lemon", "1 tablespoon cornstarch", "2 tablespoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Strawberry sauce</u><br/>\n1 pound strawberries, hulled and halved<br/>\n2 tablespoons sugar<br/>\nJuice of half a lemon<br/>\n1 tablespoon cornstarch<br/>\n2 tablespoons water</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Make crust:</em> Heat oven to 350°F. Combine graham crumbs, sugar and salt in a medium bowl and stir until mixed. Add butter and stir until crumbs are evenly coated. Press crumbs into the bottom and up the sides of a standard 9-inch pie dish. I like to use the outer edge of a heavy measuring cup to press in neat, firm sides but nobody will be the wiser if you just use your fingertips. Bake crust until lightly browned, about 9 to 10 minutes. Set on cooling rack to cool completely. Once cool, you can even transfer it to the freezer to get it started on the chilling process. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Make cheesecake filling:</em> Beat cream cheese until soft and fluffy, then slowly beat in condensed milk until smooth.  Beat in zest and vanilla. [This step updated to ensure everyone avoids lumps.] Pour into cooled crust and freeze for 6 to 8 hours, until firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Make whipped cream topping:</em> Whip cream with sugar and vanilla until soft peaks form. Spread the whipped cream over the frozen filling and return to the freezer until firm, usually less than an hour.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><em>Make strawberry topping:</em> Combine strawberries, sugar, lemon, cornstarch and water in a medium, heavy saucepan. Let macerate for 15 to 20 minutes, then cook over medium-low heat to a simmer, stirring. Cook for 2 to 3 minutes more, then remove from heat and chill sauce completely. You can hasten this along by stirring it in a bowl set over a bowl of ice water. Chill strawberry sauce in fridge until needed. (We won’t be freezing this part.)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><i>To serve:</i> Using a hot, wet knife, cut pie into wedges and drape each with strawberry sauce. Eat, repeat. </p>"}], "link": "https://smittenkitchen.com/2015/06-strawberry-cheesecake-ice-cream-pie"}