{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/02/perfect-corn-muffins1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, muffin, photo, thanksgiving", "name": "Perfect Corn Muffins", "author": {"@type": "Organization", "name": "\nFrom Cook’s Illustrated, January/February 2015"}, "description": "<p>Maybe you didn’t grow up eating corn muffins and you’re wondering how they’re different from cornbread. I suppose from a distance they might seem similar — cornmeal, fat, leavener, baked into something of a quick bread — but true Southern cornbread would never have sugar in it and are decidedly less cakey. Given that I just learned that corn muffins the official state muffins of Massachusetts, I think we can safely presume that they’re what happens when you let Yankees near Southern staples. (I’m joking. Mostly.)</p><p>Most corn muffins are made with an equal or even greater amount of flour than cornmeal; these are 2/3 cornmeal, and seem like it wouldn’t be terribly hard to replace that last 1/3 with a gluten-free flour mix if needed. CI had set out to make a savory corn muffin, using only 3 tablespoons sugar, but I liked these with 1/4 to 1/3 cup for the light sweetness I remember growing up, but at a level that’s still anything but cloying. Finally, CI recommends Arrowhead Mills Organic Yellow Cornmeal, and says that you should not use coarse-ground or white cornmeal, but I used a mixture of fine yellow unfancy Indian Head cornmeal and medium-grind Bob’s Red Mill (I used this portion for the pre-cooking step, to soften it) and had no complaints about the final texture.</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["2 cups (280 grams) yellow cornmeal, to be divided", "1 cup (130 grams) all-purpose flour", "1 1/2 teaspoons baking powder", "1 teaspoon baking soda", "1 1/4 teaspoons fine sea or table salt", "1 1/4 cups (300 ml) milk, whole is best here", "1 cup (240 grams) sour cream (full-fat plain yogurt should work here too)", "8 tablespoons (115 grams) unsalted butter, melted and cooled slightly", "3 to 5 tablespoons (35 to 60 grams) sugar (see Note up top about sweetness)", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 cups (280 grams) yellow cornmeal, to be divided<br/>\n1 cup (130 grams) all-purpose flour<br/>\n1 1/2 teaspoons baking powder<br/>\n1 teaspoon baking soda<br/>\n1 1/4 teaspoons fine sea or table salt<br/>\n1 1/4 cups (300 ml) milk, whole is best here<br/>\n1 cup (240 grams) sour cream (full-fat plain yogurt should work here too)<br/>\n8 tablespoons (115 grams) unsalted butter, melted and cooled slightly<br/>\n3 to 5 tablespoons (35 to 60 grams) sugar (see Note up top about sweetness)<br/>\n2 large eggs</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 425°F (220°C). Either grease or line a 12-cup standard muffin tin with disposable liners.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk 1 1/2 cups cornmeal, flour, baking powder, baking soda and salt together in a medium bowl. In a large bowl (if you have a microwave) or a medium saucepan (if you do not), combine milk and remaining 1/2 cup cornmeal. In a microwave, cook cornmeal–milk mixture for 1 1/2 minutes, then whisk thoroughly, and continue to microwave in 30-second increments, mixing between them, until it’s thickened to a batter-like consistency, i.e. the whisk will leave a clear line across the bottom of the bowl that slowly fills in. This will take 1 to 3 minutes longer. On the stove, cook cornmeal mixture over medium heat, whisking constantly, until it thickens as described above, then transfer to a large bowl.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Whisk butter, then sugar, then sour cream into cooked cornmeal until combined. At this point, the wet mixture should be cool enough that adding the eggs will not scramble them, but if it still seems too hot, let it cool for 5 minutes longer. Whisk in eggs until combined. Fold in flour mixture until thoroughly combined and the batter is very thick. Divide batter evenly among prepared muffin cups; it will mound slightly above the rim.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake until tops are golden brown and toothpick inserted in center comes out clean, 13 to 17 minutes, rotating muffin tin halfway through baking to ensure even cooking. Let muffins cool in muffin tin on wire rack for 5 minutes, then remove muffins from tin and let cool 5 minutes longer. Serve warm.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>P.S. You can <a href=\"http://www.thekitchn.com/how-to-make-pretty-muffin-liners-out-of-parchment-paper-cooking-lessons-from-the-kitchn-213478\">make your own makeshift muffin liners</a> from 5 to 6-inch squares of parchment but please, maybe test it first to see if it can reach the heat the package promises, as these, despite advertising a heat limit of 450°F, set off my smoke detector multiple times and were definitely not worth the trouble.</p>"}], "link": "https://smittenkitchen.com/2015/02-perfect-corn-muffins"}