{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2015/03/carrot-graham-layer-cake1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "carrots, celebration cakes, easter, photo, spring", "name": "Carrot Graham Layer Cake", "author": {"@type": "Organization", "name": "\nAdapted from Taste of Home and TSKC’s S’More Cake"}, "description": "<p>The frosting amount is generous. You’ll have just shy of a cup more than you’ll need to frost it as I’ve shown it (which can be saved for tinting and decorating, if you wish). That said, I had intended to put a little more between each layer (closer to what you see on the top) but just didn’t plan well. Had I, I think I’d have used it up. Or, if you’d like to cover the sides of the cake, you should have enough.  </p><p>Finally, do you live somewhere where you can’t get graham crackers? Try digestive biscuits or speculoos, just grind them as finely as you can. </p>", "totalTime": "", "recipeYield": "1 9-inch 3-layer cake", "recipeIngredient": ["RECIPE_SUBHED__1<u>Cake layers</u>", "1 cup (125 grams) all-purpose flour", "3/4 cup (95 grams) finely ground graham cracker crumbs, plus extra for decoration if you wish", "3/4 teaspoon baking soda", "1 1/2 teaspoons baking powder", "3/4 teaspoon fine sea or table salt", "1 1/2 teaspoons ground cinnamon", "1/4 teaspoon ground nutmeg or a bunch of gratings of fresh", "3/4 teaspoon ground ginger", "3/4 cup (150 grams) granulated sugar", "3/4 cup (145 grams) dark brown sugar", "3/4 cup plus 3 tablespoons (210 grams) neutral oil or melted butter (i.e. 1 tablespoon short of 1 cup)", "3 large eggs", "3 cups (about 12 3/4 ounces or 360 grams) peeled and grated carrots ", "RECIPE_SUBHED__2<u>Filling</u>", "2 (8-ounce) packages cream cheese, softened (455 grams total)", "1 cup (2 sticks, 8 ounces or 230 grams) unsalted butter, at room temperature", "2 cups (240 grams) powdered sugar, sifted if lumpy", "2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Filling</u><br/>\n2 (8-ounce) packages cream cheese, softened (455 grams total)<br/>\n1 cup (2 sticks, 8 ounces or 230 grams) unsalted butter, at room temperature<br/>\n2 cups (240 grams) powdered sugar, sifted if lumpy<br/>\n2 teaspoons vanilla extract</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the cake:</u> Heat oven to 350°F (175°C). Line three 9-inch cake pans with a fitted round of parchment paper and coat with a nonstick cooking spray. Don’t have three matching cake pans? Me neither. As soon as you finish baking and unmolding the first cake layer, wipe out the baking pan, put down a new round of parchment and coat the pan with spray before using it again. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk together flour, graham crumbs, baking soda, baking powder, salt, cinnamon, nutmeg and ginger. In a medium-sized bowl, whisk (yes, you can use the same one) together the sugars, oil and eggs until smooth. Stir in grated carrots. Pour wet ingredients into dry and stir until flour just disappears. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour batter evenly between three prepared baking pans. Bake each layer for 15 to 18 minutes, until a tester comes out clean. Cake will seem soft and likely still sticky on top. Let rest in cake pans for 5 minutes on a cooling rack, then run a knife around the edges of the first cake layer to ensure no parts are sticking to the sides, flip cake out onto cooling rack, remove parchment paper and flip back right-side-up on another cooling rack. Repeat with remaining layers and let the cake layers cool completely before filling. To hurry the cooling process along, and to make this very soft cake easier to handle, you can place cake layers in your freezer until cool and slightly firm. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Fill the cake</u> With an electric mixer, beat cream cheese and butter together until smooth and fluffy. Beat in powdered sugar, a little at a time. Beat in vanilla until combined. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange first cake layer on a cake plate or stand. Spread top with frosting; repeat twice with remaining layers. If desired, sprinkle top decoratively with extra graham crumbs — I used a cookie cutter to make a loose outline of a flower shape on mine. Let cake chill until serving. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><strong>Do ahead:</strong> Cake is wonderful on the first day, and even more moist on the second and third and I’ve never met a person who had one last four days. Keep in fridge. To prepare further in advance, you can make the cake layers, wrap them well and freeze them until you’re ready to fill the cake. </p>"}], "link": "https://smittenkitchen.com/2015/03-carrot-graham-layer-cake"}