{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/02/everyday-meatballs1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "italian, meat, photo, weeknight favorite", "name": "Everyday Meatballs", "author": {"@type": "Organization", "name": "\nGenerously adapted over the years from Ina Garten with some helpful tips from Luisa Weiss"}, "description": "", "totalTime": "", "recipeYield": "22 to 24 small (about 1.5-inch or 1.5 tablespoon) meatballs", "recipeIngredient": ["1 pound ground meat (I use a mix of beef and pork)", "2/3 cup fresh bread crumbs or 1/2 cup panko", "1/3 cup milk or water", "2 tablespoon finely chopped parsley", "2 tablespoons finely grated Parmesan or Romano cheese (optional)", "2 teaspoons coarse or kosher salt, divided", "Pinches of red pepper flakes or few grinds of black pepper", "1/2 teaspoon onion powder", "2 large eggs", "2 garlic cloves, minced, divided", "2 tablespoons olive oil", "1 28-ounce can of tomato puree or crushed tomatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>1 pound ground meat (I use a mix of beef and pork)<br/>\n2/3 cup fresh bread crumbs or 1/2 cup panko<br/>\n1/3 cup milk or water<br/>\n2 tablespoon finely chopped parsley<br/>\n2 tablespoons finely grated Parmesan or Romano cheese (optional)<br/>\n2 teaspoons coarse or kosher salt, divided<br/>\nPinches of red pepper flakes or few grinds of black pepper<br/>\n1/2 teaspoon onion powder<br/>\n2 large eggs<br/>\n2 garlic cloves, minced, divided<br/>\n2 tablespoons olive oil<br/>\n1 28-ounce can of tomato puree or crushed tomatoes</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place meat, crumbs, milk or water, parsley, cheese (if using), 1 teaspoon salt, pepper, onion powder, eggs and half of your minced garlic in a large bowl. I like to mix all of this together with a fork, which does a good job of breaking up the eggs and chunks of meat. Form mixture into 1 1/2 to 2-inch meatballs and arrange on a plate. I like to let them set in the fridge for a bit — 30 minutes, if you can spare it — which helps them keep their shape. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large pot, heat 2 tablespoons olive oil over medium heat. Add remaining garlic and some pepper flakes and let sizzle until garlic is golden, 30 seconds to 1 minute. Add tomatoes (beware the splatter!) and season with remaining salt. Let mixture simmer over low heat for about 10 minutes (with a thicker puree) or 20 (for crushed tomatoes, which are usually more watery), stirring occasionally. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>With stove on the lowest heat possible to maintain a gentle simmer, add meatballs to sauce one by one, and cover with a lid. It will be hard but please don’t touch or move them for at least 20 minutes of the 25-minute cooking time, so that they have a chance to keep their shape. Meatballs should be fully cooked through at 25 minutes, but it cannot hurt to cut one in half to verify.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Eat however makes you happy:<br/>\n— as-is.<br/>\n— with spaghetti: I’ll cook it very al dente, a generous minute shy of done, reserve a little pasta water, then once the spaghetti is drained, place it back in the pot with a splash of the water and a ladle or two of the sauce beneath the meatballs and cook it together over high heat for a minute. Tip spaghetti into a large, wide bowl, add the meatballs on top. Note: If your family likes a lot of sauce with their spaghetti, you might consider making the meatballs with an extra half or whole can. Just use what you need.<br/>\n— “parmesan”-ed: Place meatballs in a shallow baking dish with some of their sauce. Tear about 8 ounces mozzarella over the top and broil until melted. Finish with some parmesan, if desired, some breadcrumbs fried in a little olive oil and/or chopped parsley.<br/>\n— with garlic bread (don’t do this, just don’t). [<a href=\"https://smittenkitchen.com/blog/2016/04/perfect-garlic-bread/\">But here’s a recipe for my favorite</a>, to make the decision more difficult.]</p>"}], "link": "https://smittenkitchen.com/2016/02-everyday-meatballs"}