{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/02/belgian-brownie-cakelets1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brownies blondies, chocolate, everyday cakes, photo", "name": "Belgian Brownie Cakelets", "author": {"@type": "Organization", "name": "\nAdapted and adjusted from Le Pain Quotidien, via the LA Times and Wednesday Chef"}, "description": "", "totalTime": "", "recipeYield": "I made several small adjustments to the recipe. The original recipe yields a persnickety 14, calls for superfine sugar and pastry flour; my adjusted recipe makes an even dozen with the ingredients you already have around, plus some much-needed salt. It’s also all mixed by hand in one bowl in under 5 minutes. I made one round with cocoa powder instead of flour, because, you know, gluten. While I would never not eat them, I was sad to find that they lost their shiny lid, which was less crisp too. Do know that the swap works, but if flour isn’t an issue for you, please keep it in there. I also made a batch with 2 tablespoons less sugar and we found them more enjoyably bittersweet; feel free to do the same if that’s your preference. These contain an unconscionable amount of butter and we shouldn’t question it; this isn’t the time for it. Someone is going to ask me if they can frost these. You may not. These are such a perfect self-contained luxury, save the frosting for some arid sheet cake that needs it. If you serve it with anything, my suggestion would be a dollop of barely sweetened whipped cream, a dusting of powdered sugar and/or some berries.", "recipeIngredient": ["7 ounces (200 grams) bittersweet chocolate (70 or 72%), roughly chopped", "7 ounces (200 grams or 14 tablespoons) unsalted butter, cut into chunks", "1 cup (200 grams) granulated sugar", "1/4 teaspoon fine sea salt", "4 large eggs", "2 tablespoons plus 1 teaspoon (20 grams) all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>7 ounces (200 grams) bittersweet chocolate (70 or 72%), roughly chopped<br/>\n7 ounces (200 grams or 14 tablespoons) unsalted butter, cut into chunks<br/>\n1 cup (200 grams) granulated sugar<br/>\n1/4 teaspoon fine sea salt<br/>\n4 large eggs<br/>\n2 tablespoons plus 1 teaspoon (20 grams) all-purpose flour</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Place chocolate and butter in a large heatproof bowl. Either over a saucepan of simmering water or in the microwave in 15- to 30-second bursts, stirring frequently, melt the two together. Off the heat, whisk in sugar, which should cool the mixture down significantly. Whisk in salt, then eggs, one at a time. Stir in flour. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cover bowl with plastic wrap and let sit at room temperature for 30 minutes. The batter will thicken a bit as it stands.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 325°F (165°C). </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Either coat a 12-cup muffin tin with nonstick spray or line it with cupcake papers. Spoon batter halfway into each cup and bake for 25 to 30 minutes (20 minutes in the mini-tart pans I show), or until a toothpick inserted into the center of cakelets comes out batter-free. (Fudgy crumbs are to be expected.) </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool on a rack for 5 to 10 minutes before unmolding. Puffed tops will fall a little as they cool.</p>"}], "link": "https://smittenkitchen.com/2016/02-belgian-brownie-cakelets"}