{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/03/churros1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, doughnut, photo, spanish", "name": "Churros", "author": {"@type": "Organization", "name": "\nRecipe cobbled from a few choux recipes I’ve used before; tips and technique mostly from Cook’s Country"}, "description": "<p>The recipe here creates a pretty standard cinnamon sugar-crusted churros with a puddle of chocolate — halfway between a chocolate sauce and a very rich, concentrated cup of hot cocoa — to dip it into. While you can fry without a thermometer and just keep an eye on things, as churros have a tendency to either overcook on the outside or undercook on the inside, you’ll find it easier with one. </p><p>P.S. Want to have even more fun with these? Make some homemade dulce de leche or cajeta to dip them in. </p>", "totalTime": "", "recipeYield": "About 18 6-inch churros", "recipeIngredient": ["RECIPE_SUBHED__1<u>Dough</u>", "2 cups (475 ml) water", "3 tablespoons (40 grams) unsalted butter, cold is fine", "2 tablespoons (25 grams) granulated sugar", "1 teaspoon (5 ml) vanilla extract", "1/2 teaspoon fine sea or table salt", "2 cups (260 grams) all-purpose flour", "2 large eggs", "1 1/2 to 2 quarts (about 1 1/2 to 1 2/3 liters) vegetable oil for frying", "RECIPE_SUBHED__2<u>Coating</u>", "2/3 cup (130 grams) granulated sugar", "1 1/4 teaspoons ground cinnamon or canela", "RECIPE_SUBHED__3<u>Chocolate</u>", "3/4 cup (175 ml) heavy or whipping cream", "5 ounces (140 grams) chopped semi- or bittersweet chocolate or about 1/2 cup chocolate chips", "Pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Chocolate</u><br/>\n3/4 cup (175 ml) heavy or whipping cream<br/>\n5 ounces (140 grams) chopped semi- or bittersweet chocolate or about 1/2 cup chocolate chips<br/>\nPinch salt</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the dough:</u> Heat water, butter, sugar, vanilla and salt in a medium-size saucepan until simmering and butter has melted. Remove from heat and dump in flour all at once. Mix vigorously with a spoon until the mixture forms a smooth ball and no floury bits are visible. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool 5 to 10 minutes, then add eggs, one at a time. You can beat them in with a large whisk and strong arm, or use a hand- or stand mixer. Be warned that the dough really likes to ride up the beaters of a handmixer, so keep it pushed down. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer churros to a pastry bag or strong gallon ziploc bag with a corner snipped off, fitted with a large closed star tip — Cook’s Country recommends a #8 pastry tip, 5/8-inch in diameter but I might have preferred a slightly smaller one so they were less thick. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If you’d like to make them the traditional way, you can skip right to the frying stage and pipe the churros in 6-inch or desired lengths (I played around with some blob-shaped minis) right into the oil, snipping them off with scissors at your desired length. But I found it a little easier to pipe them while still warm onto a large baking sheet that had been lined with parchment paper and sprayed lightly with a nonstick spray, so I was in less of a rush. If using this method, transfer the tray of shaped churros to the fridge for 15 minutes and up to a couple hours to help the shapes set before frying them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cook the churros:</u> Heat oven to 200 degrees to keep churros warm while you fry them in batches. Line a large plate with a couple layers of paper towels. Add oil to Dutch oven or cast iron skillet until it measures about 1 1/2 inches deep and heat over medium/medium-high heat to 375 degrees.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Gently drop a few churros at a time into the oil and fry until deep golden brown on all sides, which will take about 6 minutes. Turn them frequently so that they cook evenly. Adjust heat as needed so that the oil does not dip below 350 degrees. Once churros are cooked, remove from oil and drain on towels for a minute before transferring to a tray in the oven to keep warm. Return your oil to 375 degrees before adding more churros. Repeat with remaining dough.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Coat the churros:</u> Once all churros are fried, combine cinnamon and sugar on a plate. Roll warm churros, one by one, in sugar to coat, spooning more cinnamon-sugar on as you do for best coverage. Tap off excess. Do not let warm churros sit in cinnamon sugar for longer than needed to coat or the sugar will get clumpy.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the sauce:</u> Heat cream, chocolate and salt in a bowl in microwave in 30 second bursts, whisking between them, until chocolate has melted. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Dip warm churros in warm chocolate sauce, repeat as needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><b>Do ahead:</b> Choux dough, the style of dough used here, can be made and kept in bowl for up to a day before using, but it will be easier to pipe when it’s still warm. Piped raw churros should be good in the fridge for a few hours, but I haven’t tested it for a full day, though it stands to reason they’d keep that long too. Churros can be kept warm in oven before coating with cinnamon sugar for probably up to an hour before they might get dry. They’re best on the first day.</p>"}], "link": "https://smittenkitchen.com/2016/03-churros"}