{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/03/caramelized-brown-sugar-oranges-with-yogurt-and-mint1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, brunch, citrus, gluten free, orange, photo, winter", "name": "Burnt Sugar Oranges with Yogurt and Mint", "author": {"@type": "Organization", "name": "\nInspired by this combination from Nigella"}, "description": "<p>Let this be my contribution to the “no recipes” movement, because you are not going to need one here. What you need is some brown sugar, a few oranges, even imperfect ones, some yogurt and a few leaves of mint. You do not need measuring spoons. You will be most successful if you keep an eye on it, as broilers will vary in how fast they get things done. But, here’s roughly how to do it:</p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["A few oranges, even imperfect ones", "Nonstick cooking spray", "A little light brown sugar", "Plain Greek yogurt", "A few leaves of mint, sliced thin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>A few oranges, even imperfect ones<br/>\nNonstick cooking spray<br/>\nA little light brown sugar<br/>\nPlain Greek yogurt<br/>\nA few leaves of mint, sliced thin</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat your broiler. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Cut tops and bottoms off oranges, exposing the flesh inside and creating a flat edge that you can stand it up on. Then slice off all the white from each orange. Cut skinned oranges into 1/2-inch crosswise slices, so that each resemble a wheel or flower.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Line a heavy baking sheet with foil and lightly coat it with oil or a nonstick spray. Arrange orange slices in one layer on it. Dab or schmear each with a little bit of brown sugar — I used about 1/4 teaspoon on each. Run under the broiler until they begin to brown on top; this can take anywhere from 5 minutes in a very good broiler to 10 to 15 in my sleepy one. Keep an eye on it. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer oranges and any juices on tray to a bowl, cover with plastic wrap and chill in the fridge for several hours or overnight. More juices will have puddled by the morning. Place a few orange slices in a small glass or cup, top with yogurt, a spoonful of juices and mint. </p>"}], "link": "https://smittenkitchen.com/2016/03-caramelized-brown-sugar-oranges-with-yogurt"}