{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/03/eggs-in-purgatory-puttanesca-style1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brunch, budget, eggs, italian, photo, quick, weeknight favorite", "name": "Eggs in Purgatory, Puttanesca-Style", "author": {"@type": "Organization", "name": "\nInspired by Nigella Lawson, sauce riffed from Ellie Krieger"}, "description": "<p>Notes: </p><p>\nI went back and forth over calling the anchovy optional because I know they’re divisive (and also out of the question for vegetarians). Let me make It clear: it is. Not because you can make authentic puttanesca without them, but because if you’re in your own kitchen, cooking for yourself and not, say, an Italian cooking school textbook, and they’re not your thing, you should feel confident that if you skip them, this sauce will still have an abundance of salty zing. Me, I’ve come around to them, but if I hadn’t a tin already open from a recent Caesar bender, I wouldn’t run back to the store on a Monday night to make this. This food is about convenience and comfort; all that matters is that you pull that off.\nWe had this with a side of roasted cauliflower and I thoroughly enjoyed dabbing sauce on the florets, wondering if this should be a thing. And just like that, I was catching up on Rachel Roddy’s excellent columns in The Guardian last night and she’s already on it. This is a great option for someone who doesn’t eat eggs. \nYou could very easily amp up the vegetable component with 1 cup of thinly sliced mushrooms, sauteed for a couple minutes in the beginning with the olives and other ingredients, or with 1 cup of spinach, arugula or another leafy green of your choice, added right before the egg(s) and cooked until wilted (1 minute for spinach or arugula, longer for heartier leaves). \nIf you’re making this as a puttanesca to go over pasta, you’ll want to double the flavorful stuff. This is slightly milder because it’s eaten straight. \n</p>", "totalTime": "", "recipeYield": "Serves 1 to 4 (for 4 people, it would be 4 smallish one-egg servings)", "recipeIngredient": ["A glug (1 to 2 tablespoons) olive oil, plus extra to finish", "1 to 2 cloves garlic, peeled", "1/4 cup flat-leaf parsley leaves, plus extra for garnish", "2 tablespoons pitted black olives", "1 tablespoon capers, drained, rinsed", "1 anchovy filet, minced, or more to taste, if you prefer a heap of them", "1 teaspoon dried oregano or double that of fresh", "1/8 teaspoon crushed red pepper flakes, or more to taste", "1 (14-ounce) can diced or crushed tomatoes", "Salt, to taste", "1 to 4 large eggs (shown with 1)", "1/4 cup grated parmesan or pecorino cheese, plus extra to finish", "A slice of bread of your choice, per egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>A glug (1 to 2 tablespoons) olive oil, plus extra to finish<br/>\n1 to 2 cloves garlic, peeled<br/>\n1/4 cup flat-leaf parsley leaves, plus extra for garnish<br/>\n2 tablespoons pitted black olives<br/>\n1 tablespoon capers, drained, rinsed<br/>\n1 anchovy filet, minced, or more to taste, if you prefer a heap of them<br/>\n1 teaspoon dried oregano or double that of fresh<br/>\n1/8 teaspoon crushed red pepper flakes, or more to taste<br/>\n1 (14-ounce) can diced or crushed tomatoes<br/>\nSalt, to taste<br/>\n1 to 4 large eggs (shown with 1)<br/>\n1/4 cup grated parmesan or pecorino cheese, plus extra to finish<br/>\nA slice of bread of your choice, per egg</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>On a cutting board, pile garlic, 1/4 cup parsley, olives, capers, anchovies (if using), oregano and pepper and run a knife through them again and again until they’re chopped into a tiny rubble. Heat a small-medium skillet over medium heat. Once hot, swirl in a glug of olive oil and let it warm. Add garlic-parsley heap to pan and cook, stirring, 2 minutes. Add tomatoes carefully because they’re going to splatter like crazy, nd stir to combine. Lower heat to medium-low and simmer sauce for 5 minutes. Taste and add salt or more pepper flakes if needed.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make a small indentation in the sauce for each egg you’re using, and crack them in. Sprinkle the eggs and sauce with parmesan and cover pan pan partially with a lid. [This is when you should toast your bread; I like to brush mine with olive oil and run it under the broiler.] Let the eggs cook for 5 minutes, after which the whites are usually set and the yolks still loose, but when I use more than 1 to 2 eggs in the pan, this can take longer. Cook another minute or two if needed, but keep a close watch so you don’t accidentally hard cook them.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Drizzle pan with a little extra olive oil, then finish with more pepper, cheese and parsley. Eat with toasted bread.</p>"}], "link": "https://smittenkitchen.com/2016/03-eggs-in-purgatory-puttanesca-style"}