{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/03/sesame-soba-and-ribboned-omelet-salad1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "japanese, photo, put an egg on it, salad, summer, vegetarian, weeknight favorite", "name": "Sesame Soba and Ribboned Omelet Salad", "author": {"@type": "Organization", "name": "\nInspired by Heidi Swanson’s Near & Far and No Recipes’ Goma Hiyashi Chuka [Sesame Ramen Salad], dressing from the latter"}, "description": "<p>Notes:</p><p>\nI know I sound like a broken record, but I would love to convince you to always toast your nuts and seeds before using them. For sesame seeds, you can do these in a skillet over low heat but you must watch it like a hawk and stir often because once they start picking up color, they go from golden to brown very quickly. This time I did it in a 350 degree oven, stirring every 5 minutes (I also go ahead and do the whole jar, so I have them for the next time). It took longer but the flavor was off the charts. When I ground the seeds, the whole apartment smelled nutty and wonderful. \nThe water in the omelet ribbons may sound odd, but I found the final texture of the eggs a bit softer and more apt to ribbon without breaking with it. If you’d like, you can use mirin (sweet wine) instead of water, and skip the sugar.\nI love using soba (buckwheat) noodles here but ramen noodles are more traditional, and most rice noodles or rice “sticks” are gluten-free. You can make this a vegan dish by omitting the egg ribbons.\n</p>", "totalTime": "", "recipeYield": "Serves 4 for dinner", "recipeIngredient": ["RECIPE_SUBHED__1<u>Dressing</u>", "4 1/2 tablespoons toasted sesame seeds, plus more for garnish", "3 tablespoons water", "3 tablespoons soy sauce (use low-sodium for a less salty sauce)", "2 tablespoons plus 1 teaspoon tahini", "2 tablespoons plus 1 teaspoon  rice vinegar", "1 1/2 tablespoons toasted sesame oil", "3/4 teaspoon granulated sugar, or more to taste", "Chili sesame oil to taste", "RECIPE_SUBHED__2<u>Omelet Ribbons</u>", "Neutral cooking oil, to coat skillet", "3 large eggs", "3 teaspoons water", "A few pinches sugar", "A few pinches salt", "RECIPE_SUBHED__3<u>Assembly</u>", "1 9.5-ounce package buckwheat soba noodles", "Raw vegetables of choice (we used julienned carrots, cucumbers and radishes, plus some snipped chives on top, which have recently reappeared in my garden!)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Assembly</u><br/>\n1 9.5-ounce package buckwheat soba noodles<br/>\nRaw vegetables of choice (we used julienned carrots, cucumbers and radishes, plus some snipped chives on top, which have recently reappeared in my garden!)</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the dressing:</u> Put the toasted sesame seeds into a blender or food processor and run the machine until the seeds look like wet sand — it will take a couple minutes. Add the water, soy sauce, tahini, rice vinegar, sesame oil, sugar, salt and chili sesame oil and blend until combined. Taste and adjust ingredients to your preferences. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Make the omelet ribbons:</u> Whisk eggs with water, sugar and salt until well-blended and even in color. Heat a 10-inch skillet (I really like using a nonstick here and for other crepe-like things) over medium and coat very lightly with cooking oil. Pour in 1/3 of mixture, which will be enough to coat the pan very thinly. (If your pan is bigger or smaller, use less or more accordingly per batch, the goal is to keep the egg very thin.) Cook for 1 to 2 minutes, until the egg has set and the edges look dry. Carefully flip* the omelet and cook for 20 to 30 seconds on second side. Flip egg out onto paper towel to blot oil and repeat 2 more times. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Stack the three omelets together and roll them into a log. Use a sharp knife to slice the roll into very thin ribbons, thinner even than you see in my photos. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>Cook the noodles:</u> In well-salted water until tender but firm for the time recommended on your package of noodles, usually 4 to 5 minutes. Drain noodles and run cold water over them to cool. Drain again, shaking out excess water.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To serve:</u> My favorite way for a family meal is to put everything out in separate dishes and let each of us assemble to taste. (Or, if you’re <a href=\"https://www.flickr.com/photos/smitten/25534924090/in/photostream\">this</a> one, grab the bowl of egg ribbons and help yourself.) Or, you can toss the noodles with about half the sauce, then arrange it in a bowl with the omelet ribbons on top, followed by your vegetables. Garnish with extra sesame seeds and serve with additional sauce on the side. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>* One day, when I have video on this site, I will demonstrate my crepe-flipping “method” for you but hopefully this will help until then: I use two thin spatulas (such as offset icing spatulas or a flexible fish spatula). The first smaller one goes under the edge and lifts the omelet/crepe enough that I can hold the second larger spatula in my other hand and slide it under enough that it goes past the center of the omelet/crepe. From here, it’s easier to flip without tearing.</p>"}], "link": "https://smittenkitchen.com/2016/03-sesame-soba-and-ribboned-omelet-salad"}