{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/02/white-russian1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "date night, drinks, photo, winter", "name": "White Russian", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>I have yet to find three White Russian recipes in a row that agree on proportions. The closest thing I can find to a classic advocates 2 parts vodka, 2 parts coffee liqueur and 1 part heavy cream or 2:2:1, but I have also seen versions that are heavier on the vodka and cream (5:2:3), the liqueur (1:2:1) and/or just the cream (2:2:3). Let me be absolutely no help at all except to tell you that our favorite proportions are none of the above, but after repeated, high-stakes “testing” (goofing after the kids are sleep) in our “lab” (sofa watching Netflix), we feel this — which we call the 4:3:3 because when you cook as much as I do, even drinks are measured in tablespoons — is unquestionably the best balance. We use half-and-half instead of heavy cream; with heavy cream, 1 ounce is usually sufficient. </p><p>You can of course replace the cream with milk, cow or non-dairy. For more variations, see this list.</p>", "totalTime": "", "recipeYield": "Makes 1 drink", "recipeIngredient": ["2 ounces (4 tablespoons) vodka", "1 1/2 ounces (3 tablespoons) coffee liqueur (such as kahlua or tia maria)", "1 1/2 ounces (3 tablespoons) half-and-half or 1 ounce (2 tablespoons) milk plus 1/2 ounce (1 tablespoon) heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>2 ounces (4 tablespoons) vodka<br/>\n1 1/2 ounces (3 tablespoons) coffee liqueur (such as kahlua or tia maria)<br/>\n1 1/2 ounces (3 tablespoons) half-and-half or 1 ounce (2 tablespoons) milk plus 1/2 ounce (1 tablespoon) heavy cream</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Fill a short — or rocks — glass with ice. Add vodka and coffee liqueur. Finish with the cream. For the layered effect, pour the cream in a very slow drizzle off the back of a spoon held over — but not touching — the surface of the drink. To swirl it prettily, insert a stirrer along the inner wall of the glass only as a deep as the cream and move it around in a slow circle.</p>"}], "link": "https://smittenkitchen.com/2016/02-white-russian"}