{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/01/chicken-chili1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, gluten free, instant pot, photo, slow cooker, stew, tex mex, weeknight favorite", "name": "Chicken Chili", "author": {"@type": "Person", "name": "Source: Bon Appetit"}, "description": "Psst, there’s a vegetarian Three-Bean Chili in the archives. ", "totalTime": "2hr 30mins", "recipeYield": "Serves 6 generously, 8 in more moderate portions (i.e. what you see above)", "recipeIngredient": ["2 pounds boneless skinless chicken parts, cut into 3 to 4 large chunks (I use a 50/50 mix of breasts and thighs)", "1 small yellow onion, chopped small", "2 large garlic cloves, minced", "1 tablespoon ground cumin", "1 1/2 teaspoons dried oregano", "2 teaspoons fine sea salt", "Heat via 1 to 2 jalapenos or other fresh hot pepper, minced, or a ground chili powder of your choice, to taste", "1 28-ounce can crushed tomatoes, fire-roasted if you can find them or 2 10-ounce cans Ro-Tel (yield is a little less but not noticeable in final chili)", "2 2/3 cups small dried beans (I use half black beans, half small red beans; I do not presoak but do read the updated note up top; read the note at the bottom if you’re using kidney beans)", "5 1/3 cups water (can replace all or part with broth)", "To serve: Lime wedges, sour cream or Mexican crema, finely chopped white onion or thinly sliced scallion, chopped cilantro, corn or flour tortilla chips, and hot sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "(I have always wanted to write recipe instructions just like this!) Throw everything in the pot and turn the heat on:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: The chicken will likely have fallen apart, but you can help it along by reaching into the pot with two forks and shredding it to your desired texture. (For a pressure cooker, this is barely necessary; you can break up the chicken with the back of a spoon.) Taste and adjust seasonings. Serve with fixings of your choice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "P.S. We like this with baked tortilla chips. I estimate two small corn tortillas per person and cut them into 8 wedges. Brush a large baking sheet lightly with olive oil, arrange tortilla wedges in one layer, lightly dab the tops with more olive oil and sprinkle with fine salt. Bake at 350 for 10 minutes, check for color, and add more baking time as needed until they’re golden and crisp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Troubleshooting: It sounds like a some people are having trouble getting their dried beans to cook in the suggested times. I’m so sorry for the trouble. I tested this with different beans (Rancho Gordo and also Goya brand) and in different slow-cookers (an ancient one from Farberware and another from Proctor-Silex) and never had trouble; I’m beginning to suspect my slow-cooker is more robust than others in heat. This is little consolation to those of you with crunchy beans. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "So, to troubleshoot: If you’re worried or have had trouble in the past getting dried beans to cook in a reasonable amount of time in your slow-cooker, go ahead and soak them overnight first. But, I want you to soak them in the 5 1/3 cups of water and then use that water — which is now full of flavor — in the slow-cooker. This will also allow you to have the right liquid level at the end, since it will be impossible otherwise to know how much water your beans absorbed and adjust the recipe accordingly. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A note about kidney beans: I do not use kidney beans here, but small red ones, and I do not presoak my beans however if you are using red kidney beans, do keep in mind that due to a protein known as phytohaemagglutinin the FDA advises people who wish to use kidney beans in slow-cookers to first soak the beans for at least 5 hours, dump the water, boil them in fresh water for 10 minutes and then continue with the recipe. As your beans will have soaked up more liquid before they go in, you will find you need less to cook them in for the final chili. In terms of how freaked out you should be over kidney beans, from the FDA website: “Reports of this syndrome in the United States are anecdotal and have not been formally published.” And that this was mostly a concern reported in the last 70s in the UK. "}], "link": "https://smittenkitchen.com/2016/01-chicken-chili"}