{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/05/almond-rhubarb-picnic-bars-e14640188536441.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bars, cookie, photo, picnics, rhubarb, spring", "name": "Almond Rhubarb Picnic Bars", "author": {"@type": "Organization", "name": "Smitten Kitchen"}, "description": "<p>Consider these a spring riff on 2014’s apricot pistachio squares; here we make a more classic frangipane with toasted almonds and extract and the rhubarb, well, I know ombré and chevron are totally out these days (grandma would not approve) but this was honestly accidental, a thing that happens almost naturally when you bias-cut a great pile of rhubarb and try to puzzle-piece it into a pattern. If all of your rhubarb are pointing in the same direction when you cut them, that is, the greener bases on one side and the pinker tops on the other, and you work through the pieces from one side of the board to the other, a gentle transition of color happens on its own. Or, you know, you could just scatter pieces all over and it will all taste the same in the end. </p><p>You can double this recipe and make them in a 9×13-inch pan. </p>", "totalTime": "", "recipeYield": "I cut these into 16 2×2-inch squares", "recipeIngredient": ["RECIPE_SUBHED__1<u>Crust</u>", "1 cup (125 grams) all-purpose flour", "1/4 teaspoon fine sea or salt", "1/4 cup (50 grams) granulated sugar", "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine", "RECIPE_SUBHED__2<u>Filling</u>", "3/4 cup (75 grams or 2 1/2 to 2 3/4 ounces) sliced almonds, ideally toasted and cooled", "1 tablespoon (10 grams) all purpose flour", "A few pinches of sea salt", "6 tablespoons (75 grams) plus 1 teaspoon (5 grams) granulated sugar", "5 tablespoons (70 grams) unsalted butter, cold is fine", "1 large egg", "1/2 teaspoon almond extract, 2 teaspoons brandy or another flavoring of your choice (totally optional)", "1/2 pound rhubarb", "RECIPE_SUBHED__3<u>To finish</u>", "Powdered sugar or 1/4 cup jam of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p><u>To finish</u><br/>\nPowdered sugar or 1/4 cup jam of your choice</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 350 degrees F. Cut two 12-inch lengths of parchment paper and trim each to fit the 8-inch width of an 8×8-inch square baking pan. Press it into the bottom and sides of your pan in one direction, then use the second sheet to line the rest of the pan, perpendicular to the first sheet. This is going to make it very easy to remove the bars.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the crust: Combine the flour, salt and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps — that’s right, just keep running it; it might take 30 seconds to 1 minute for it to come together, but it will. [No food processor? Get the butter to room temperature and beat it with the sugar, then the flour and salt and mix until combined. Chilling it for 15 minutes or so will make it easier to press in.] </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Transfer the dough to your prepared baking pan and press it evenly across the bottom and 1/4-inch up the sides. Bake for 15 minutes, until very pale golden. For the sake of speed, transfer to a cooling rack in your freezer for 10 to 15 minutes while you prepare the filing.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Make the filling: In your food processor bowl (which I never bother cleaning between these steps), grind almonds, 6 tablespoons sugar, flour and salt together until the nuts are powdery. Cut the butter into chunks and add it to the machine. Run the machine until no buttery bits are visible. Add any flavorings and egg, blending until just combined. Spread filling over mostly cooled (warmth is okay but it’s hoped that the freezer will have firmed the base enough that you can spread something over it) crust. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Arrange the fruit: Trim rhubarb and cut it half horizontally top to bottom, i.e. like splitting a hamburger bun, with the flatter part on the bottom. [<strong>Update</strong>: <a href=\"https://www.flickr.com/photos/smitten/27695332052/in/photostream\">Does this diagram help?</a>] Keep tops and bottoms matched/stacked and cut stalks on the diagonal into about 1 1/4-inch lengths. The top and bottom of each segment should nicely “V” together, color side up, in a chevron pattern. If you mostly reach for the more green segments first and the pink-er segments second, you’ll end up with an ombré look on top. Sprinkle fruit with 1 teaspoon granulated sugar.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bake the bars: For 45 to 55 minutes, until they’re golden on top and a toothpick inserted into the almond cream underneath comes out cream-free. The rhubarb pieces are going to move around a little as it bakes so don’t be surprised if the pattern looks a little different when it’s done. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Let cool in pan on a rack, or in the fridge, or even in the freezer. You can decorate the bars with a little powdered sugar, or warm some jam and brush it over for a glossier finish. I find it easiest to get very clean cuts when the bars are very cold. A serrated knife, used gently, can ensure the rhubarb stays perfectly put if it’s not cold enough. While bars do not need to be refrigerated if it will just be a day or so, they keep longer and (I think) more nicely chilled.</p>"}], "link": "https://smittenkitchen.com/2016/05-almond-rhubarb-picnic-bars"}