{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2016/01/spaghetti-pie-with-pecorino-and-black-pepper1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "casserole, italian, pasta, photo, vegetarian, winter", "name": "Spaghetti Pie with Pecorino and Black Pepper", "author": {"@type": "Organization", "name": "\nAdapted from Justin Chapple at Food & Wine"}, "description": "<p>This pie plays off the flavors of classic cacio e pepe — these flavors will be, delightfully, the strongest — but, of course, I fiddled with it a little. The first time, I made it with 8 ounces each of pecorino romano and fontina (because although I love cheddar, I just couldn’t). The second time, I made with less of each (which was a mistake) and because I’ve become That Person, the kind of person that needs to see some green before I can allow something to become a regular meal, I added about a cup of blanched and finely chopped broccoli rabe (which was not). That said, while we enjoyed our green-flecked spaghetti wedges, we agreed we’d have liked it just as much with the greens on the side, preferably in a garlicky and pepper flake sauteed heap. </p>", "totalTime": "", "recipeYield": "", "recipeIngredient": ["A few important cooking notes: You must wrap your springform tightly in foil or you and your oven floor will end up in a very bad mood. Please (I beg here) cook your pasta until it’s a good two minutes from done as it will continue cooking in the oven and mushy pasta makes me sad. The greens here are optional (see above) but keep in mind that if you add them, you’ll want to do your best to remove every extra drop of moisture and anticipate that it will take longer to set. Finally, to me, good aged pecorino (usually sold with a black rind) makes all the difference here in providing a salty, funky kick. You can use parmesan if it’s all you’ve got, but you might find that you need more salt if you do.", " ", "Butter for greasing springform", "1/2 pound broccoli rabe, toughest stems saved for another use, chopped into few-inch segments (optional)", "1 pound dried spaghetti", "1 1/2 cups milk", "3 large eggs, lightly beaten", "2 to 3 teaspoons ground black pepper", "2 teaspoons coarse or kosher salt", "8 ounces aged pecorino cheese, finely grated, divided", "8 ounces fontina cheese, grated, divided"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>A few important cooking notes: You must wrap your springform tightly in foil or you and your oven floor will end up in a very bad mood. Please (I beg here) cook your pasta until it’s a good two minutes from done as it will continue cooking in the oven and mushy pasta makes me sad. The greens here are optional (see above) but keep in mind that if you add them, you’ll want to do your best to remove every extra drop of moisture and anticipate that it will take longer to set. Finally, to me, good aged pecorino (usually sold with a black rind) makes all the difference here in providing a salty, funky kick. You can use parmesan if it’s all you’ve got, but you might find that you need more salt if you do.<br/>\n <br/>\nButter for greasing springform<br/>\n1/2 pound broccoli rabe, toughest stems saved for another use, chopped into few-inch segments (optional)<br/>\n1 pound dried spaghetti<br/>\n1 1/2 cups milk<br/>\n3 large eggs, lightly beaten<br/>\n2 to 3 teaspoons ground black pepper<br/>\n2 teaspoons coarse or kosher salt<br/>\n8 ounces aged pecorino cheese, finely grated, divided<br/>\n8 ounces fontina cheese, grated, divided</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Heat oven to 425 degrees. Butter a 9-inch springform pan and this is very important, wrap the outside of the springform, focusing on the places where the ring meets the base, <em>tightly</em> in aluminum foil. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Bring a large pot of well-salted water to a boil. If using broccoli rabe, add it to the pot and boil for 1 to 2 minutes, until it has some give. Fish it out with a large slotted spoon and drain it well. Set aside.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Add spaghetti to boiling water and cook until (this is also important) 2 minutes shy of done, so very al dente, as the spaghetti will continue cooking in the oven. Drain well and let cool slightly.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>If using broccoli rabe, wring all extra moisture out of it and blot greens on paper towels to be extra careful. Mince rabe into very small bits. You’ll have about 1 cup total.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>In a large bowl, whisk eggs and milk together with salt and pepper. Stir in all but 1/2 cup of each cheese and chopped rabe, if using. Add spaghetti and toss to coat. </p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Pour into prepared springform and sprinkle remaining cheese on top. Bake for 35 to 40 minutes (without greens) and up to 15 minutes more (with greens, as they add moisture too), until the cheese is melted and bubbling and a knife inserted into the center of the pie and turned slightly will not release any loose egg batter into the center. If the top of your pie browns too quickly before the center is set, cover it with foil for the remaining cooking time.</p>"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<p>Turn on your oven’s broiler. Broil the pie a few inches from the heat for 2 to 3 minutes, until browned on top. Cut along springform ring to loosen, then remove ring. Run a spatula underneath the pie to loosen the base and slide onto a serving plate. Cut into wedges.</p>"}], "link": "https://smittenkitchen.com/2016/01-spaghetti-pie-with-pecorino-and-black-pepper"}