{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2017/12/dutch-apple-pie.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apple, fall, photo, recipes, tarts pies, thanksgiving", "name": " Dutch Apple Pie / Hollandse Appeltaart", "author": {"@type": "Person", "name": "Source: Cobbled together from several sources "}, "description": "Although most recipes I found had fairly common proportions, there were things that were inconsistent: some used self-rising flour, or added baking powder, but most did not. Some used only cinnamon (and a full tablespoon of it) to spice the filling, a few, but not many, others used several “apple pie spices” including ground ginger, nutmeg and more. All used raisins. Some plumped them first in brandy or rum but I never did, figuring they’d get plumped with spiced juices from the apples, a delicious thought. Many used 1 tablespoon vanilla-scented “custard powder” (an ingredient less common in the US) as a thickener (a mix of cornstarch and vanilla sugar would have a similar effect) but most others sprinkled the bottom crust with only plain breadcrumbs and one, semolina, to absorbed juices, something that fascinated me as controlling the juices in pies is a bit of an American pie-making obsessed. The choices I made, and loved, are reflected below but feel free to use all of the information here to tweak your version to your tastes.", "totalTime": "P0DT2H0M0S", "recipeYield": "8 to 12", "recipeIngredient": ["1/2 cup (100 grams) granulated sugar", "1/2 teaspoon coarse or kosher salt", "2 1/3 cups (300 grams) flour", "14 tablespoons (200 grams) butter, diced, no need to soften", "1 large egg", "1 teaspoon (5 ml) vanilla extract", "2 tablespoons (30 ml) cold water", "3 1/3 pounds (1500 grams or about 5 large apples) peeled, cored and sliced", "1 tablespoon (15 ml) lemon juice", "2 teaspoons ground cinnamon", "1/2 cup (100 grams) granulated sugar", "About 1/2 cup (70 grams) raisins", "4 tablespoons plain breadcrumbs (I used panko)", "1 large egg, beaten, to finish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make your dough: In the bottom of a large bowl, combine the flour, sugar and salt. Add the diced butter and using a pastry blender or your fingertips, work the butter into the flour until the mixture looks like coarse cornmeal, with the largest pieces the size of small peas. Add the egg, vanilla, and water, and if using a pastry blender, use that to work them into the butter-flour mixture, or if not, use a fork to work it in. Reach hands into bowl and lightly knead the mixture together into a single mass. Transfer to a piece of parchment or waxed paper or plastic wrap, and wrap it tightly. Chill in fridge until firm, at least 60 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At some point during this hour, make the filling: Combine apples, lemon, cinnamon, sugar and raisins in a large bowl and toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble crust: Coat a  9- to 9 1/2-inch (24 cm) diameter springform pan lightly with butter or nonstick cooking spray. Remove chilled dough from fridge and cut it roughly into thirds. On a well-floured counter, roll the first third to a circle the diameter your pan and fit it into the bottom. Roll out the second third of the dough and cut it into strips the height of your springform pan (usually 3 inches). Patch them up the inner sides of the springform. Use your fingertips to press and seal the sides and base together. If any holes form or there are spots you’re worried aren’t sealed well, patch in another pinch of dough. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your oven: To 350°F (175°C). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble pie: Sprinkle the bottom of the pie crust with breadcrumbs. Pour the apple-raisin mixture on top. Roll the last third of the dough into a large round and cut into thin strips. (Mine were about 1/2-inch wide.) Space them in a lattice pattern over the filling, either by arranging half in one direction and the second half in the other direction on top, or by getting cute and weaving them together. (Here is an ancient set of directions from me.) Trim the overhang so that the latticed top meets the walls of the crust, and press/pinch them together to seal it. Brush beaten egg over top crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake: For 60 to 70 minutes, until you can see filling bubbling slightly up between the latticed strips (use this to determine doneness, and the baking time as just an estimate), and crust is a deep golden brown. Let cool in springform on rack for 45 minutes or so before running a knife around the outside of the crust to ensure it isn’t sticking to the pan in any place, and opening the ring to serve it with an abundance of softly whipped, barely sweetened cream."}], "link": "https://smittenkitchen.com/2017/12-dutch-apple-pie"}