{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2017/12/salted-butter-chocolate-chunk-shortbread.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, cookie, recipes", "name": "Salted Butter Chocolate Chunk Shortbread", "author": {"@type": "Person", "name": "Source: Alison Roman's Dining In"}, "description": "Roman says that if you find it annoying to buy salted butter just for this recipe, you can use unsalted and add 3/4 teaspoon kosher salt instead. I would like you to know that if you’re buying European butter (and oh, if there was ever a time to splurge on it, it is here) in European packages, most will come in 250-gram blocks which is (drumroll) within 5 grams of what you need here and the recipe works perfectly even without this 5-gram pat of butter.", "totalTime": "P0DT2H30M0S", "recipeYield": "24 cookies", "recipeIngredient": ["1 cup plus 2 tablespoons (9 ounces or 255 grams) salted butter, cold, cut into small pieces", "1/2 cup (100 grams) granulated sugar", "1/4 cup (50 grams) light brown sugar", "1 teaspoon (5 ml) vanilla extract", "2 1/4 cups (295 grams) all-purpose flour", "6 ounces (170 grams) semi- or bittersweet dark chocolate, chopped (you want chunks, not thin shards of chocolate)", "1 large egg", "Demerara, turbinado, raw, or sanding sugar, for rolling", "Flaky sea salt for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the butter, granulated and brown sugars, and vanilla with an electric mixer until light and fluffy, scraping down bowl as needed. Add flour, and mix just until combined. Add chocolate chunks, mix just until incorporated. Mixture will look crumbly. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide between two sheets of parchment paper, waxed paper, or plastic wrap and use your hands to form the dough halves into log shapes about 2 to 2 1/4 inches in diameter. Chill until totally firm, about 2 hours. I hastened this along in the freezer (30 minutes, tops) but did feel that the cookies were better after resting longer. (But do know that it works!)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to bake the cookies, heat your oven to 350°F. Line one or two large baking sheets with parchment paper. Lightly beat the egg and open up your chilled cookies logs to brush it over the sides. Sprinkle the coarse sugar on the open paper or plastic wrap and roll the logs into it, coating them. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp serrated knife, cut logs into 1/2-inch thick rounds. You’re going to hit some chocolate chunks, so saw gently, squeezing the cookie to keep it from breaking if needed. Arrange cookie slices on prepared sheets one inch apart (they don’t spread much) and sprinkle each with a few flakes of salt. Bake for 12 to 15 minutes, or until the edges are just beginning to get golden brown. Let cool slightly before transferring to the cookies you don’t eat immediately to wire racks to cool.\nDo ahead: The dough can made ahead and stored, tightly wrapped in plastic, up to 1 week in the fridge, or 1 month in the freezer. Baked cookies keep in an airtight container for 5 days, or so I’ve heard."}], "link": "https://smittenkitchen.com/2017/12-salted-butter-chocolate-chunk-shortbread"}