{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/10/more-perfect-apple-pie.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "apple, fall, photo, tarts pies", "name": "Even More Perfect Apple Pie", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "This is an update to my 2006 apple pie recipe, with a few new tricks from the fantastic Bravetart cookbook.", "totalTime": "3 hours, mostly hands-off", "recipeYield": "8 to 12", "recipeIngredient": ["1/2 cup (95 grams) light or dark brown sugar", "1/4 cup (50 grams) granulated sugar", "1/4 teaspoon fine sea or table salt", "2 teaspoons ground cinnnamon", "Freshly grated nutmeg, to taste, or about 1/4 teaspoon ground", "1/4 teaspoon ground ginger", "1/8 teaspoon ground cloves", "4 1/4 to 4 1/2 pounds baking apples, shown here with mutsu (which is like a mix of Granny Smith and Golden Delicious) but more suggestions here", "3 tablespoons tapioca flour or starch", "1 recipe All Butter, Really Flaky Pie Dough, or your favorite recipe, or a storebought dough", "1 egg, lightly beaten (optional)", "Coarse or raw sugar for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make filling: Combine sugars, salt, and spices in your absolutely largest bowl. Peel, halve, and core your apples and cut them into thin (scant 1/4-inch) slices, adding them right to the big bowl. Toss to coat the slices as much as possible. Set aside for 1 to 4 hours at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare crust: Make your pie dough according to instructions. If you need to chill it for an hour or two before rolling it out, you can do so now. If yours is already chilled and ready to go, roll out the first half on a well-floured counter [more detailed instructions here] to a 14-inch circle and transfer it to 9-inch standard (not deep-dish) pie plate. With scissors or kitchen shears, trim overhang to one inch all around. Refrigerate dish and dough until needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For a regular pie lid, roll out the second dough half into the same sized circle, transfer it to a large parchment-lined baking sheet and chill this as well until needed. For a lattice or woven pie lid, you can use the same sized circle, or you can just roll it into a rectangle at least 14″ in one direction, and then as long or wide you can get it in the other. Transfer it to a parchment-lined baking sheet and chill this as well until needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven: To 400°F. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble pie: Stir tapioca starch into apple pie filling. Pour filling into prepared bottom crust and use your hands to pack and heap those softened apples as mounded as you can get them, then add a few more. Pour any juices that have accumulated carefully over apples; do not leave any behind. Either place your second pie dough round over the filling or cut it into strips to lattice the top. [Detailed classic lattice instructions here, or try some of Erin McDowell’s gorgeous iterations.] Trim the top crust or lattice strips to the edge of the pie dish. Fold the overhang from the lower crust over to form a thick rim, and crimp it together with your fingers or a fork to seal it. Brush top crust with egg, then sprinkle with sugar if desired. If your top crust is in one piece, cut a few vents in it with a sharp knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake pie: Reuse that sheet of parchment paper on the large baking sheet for easier cleanup, then transfer your prepared pie onto it. Bake for 75 minutes, turning once or twice for even color. If your pie is browning too fast, take a large square of foil, mold it over the back of a large bowl into a convex dome, then use that to cover the pie in the oven for the remaining baking time so it doesn’t brown much further. Pie is done when juices are bubbling visibly through the vents or lattice, or when the internal temperature reads 195°F. A tester inserted into the pie shouldn’t hit any overtly crunchy apple pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Cool pie for at least one hour at room temperature before cutting into it. However, your filling will not fully thicken until it has fully cooled, ideally in the fridge for a couple hours. You can rewarm slices as you serve them, if desired. Leftovers keep at room temperature for 2 to 3 days, and in the fridge for 1 week."}], "link": "https://smittenkitchen.com/2018/10-even-more-perfect-apple-pie"}