{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/11/robertas-roasted-garlic-caesar-salad.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "gluten free, photo, salad, savory projects", "name": "Roberta's Roasted Garlic Caesar Salad", "author": {"@type": "Person", "name": "Source: Roberta's Cookbook"}, "description": "You’ll have extra dressing (it makes 1 1/2 to 1 2/3 cups) and extra walnuts (it makes about 2 1/4 cups). The dressing keeps for one week in the fridge. The walnuts will keep easily 2 weeks in a jar at room temperature.", "totalTime": "P0DT1H0M0S", "recipeYield": "2, but you'll have extra walnuts and dressing", "recipeIngredient": ["1 head of garlic", "3/4 cup plus 1 tablespoon (175 grams) olive oil, plus a splash for the garlic", "1 garlic clove, peeled", "2 teaspoons (10 grams) smooth dijon mustard", "1 1/2 tablespoons (21 grams) white wine vinegar", "2 tablespoons (28 grams) sherry vinegar", "2 large egg yolks", "5 anchovy fillets", "Juice of half a lemon, plus more if needed", "Kosher salt", "Freshly ground black pepper", "2 cups (180 grams) walnut halves", "2 large egg whites", "3 packed tablespoons (30 grams) dark brown sugar", "1/4 cup (75 grams) honey", "Freshly ground black pepper", "1 teaspoon (5 grams) kosher salt", "2 romaine hearts, ends trimmed, leaves separated", "1/3 cup roasted garlic dressing (above)", "2 ounces pecorino romano cheese", "A handful of candied walnuts (above)", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": ""}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the roasted garlic dressing: Heat your oven to 350°F. Cut a quarter inch off the head of garlic and place the head, cut side up, on a big square of aluminum foil. Drizzle lightly with olive oil. Wrap it tightly in the foil and bake for a little less than 1 hour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the garlic from the oven and let it cool in the foil. Squeeze the roasted garlic out of 4 or 5 cloves and set the rest aside for another use (“its really good just spread on grilled bread,” the book tells us). Leave the oven on for the walnuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the roasted garlic, the raw clove of garlic, mustard, vinegars, egg yolks, anchovies, and lemon juice into a blender or food processor and blend for 30 seconds or until combined. With the machine one, add the olive oil in a slow, thin stream until it’s incorporated and the dressing looks smooth. Taste and add salt, pepper, and more lemon juice as desired. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the walnuts: Put the nuts on a baking sheet and toast 8 minutes, turing your baking sheet and tossing the nuts around halfway through.Remove them from the oven and let them cool. Turn the oven down to 275°F. Cover a large baking sheet with foil and (do what I didn’t do), coat the foil with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the egg whites until they begin to have body but not until they form soft peaks. Add the brown sugar, honey, and about 10 turns of a pepper grinder’s worth of black pepper to the whites, and combine. Add the walnuts to the mixture and mix until they’re all well coated. Spread them on the prepared baking sheet and sprinkle them evenly with the salt. Bake for about 24 minutes, turning the baking sheet about halfway through. The nuts should be dry and not sticky. Remove them from the oven and let them cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble: Place the romaine leaves in a large bowl. Pour about 1/4 cup roasted garlic dressing over the leaves, using your fingers to toss and coat the leaves evenly. (The book warns that tongs will damage the leaves here, and won’t distribute the dressing as easily.) Use the remaining tablespoon or so if needed, to taste (Romaine hearts vary a lot in size)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the lettuce between two plates. Grate the Pecorino over each plate. Scatter the walnuts over the two plates and give each a grind of black pepper. Eat with a knife and fork, blissfully."}], "link": "https://smittenkitchen.com/2018/11-robertas-roasted-garlic-caesar-salad"}