{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/02/slow-roasted-sweet-potatoes.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, photo, potatoes, savory projects, vegan, vegetarian, winter", "name": "Slow-Roasted Sweet Potatoes", "author": {"@type": "Person", "name": "Source: Michael Solomonov via Saveur"}, "description": "The first time we made these, I finished them with a sizzling toasted spice oil — basically a tadka or chaunk in Indian cooking — with a dollop of lightly salted, lemony yogurt and a little pile of black lentils on the side. It was amazing, but I almost felt like the sweet potato itself is so good, it deserves to be the whole story here. The second time, I couldn’t resist making a roasted garlic yogurt sauce and we finished the potatoes with pats of salted butter and I about wept from how good it was, so do know that this needs no bells and whistles to be worthy of your plate’s best real estate. We also had a red cabbage salad on the side that we barely remember, but this one would do nicely.", "totalTime": "P0DT3H0M0S", "recipeYield": "4", "recipeIngredient": ["4 medium sweet potatoes (about 3 pounds), scrubbed clean", "4 teaspoons olive oil", "2 teaspoons kosher salt", "1 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your oven to 275°F. Arrange sweet potatoes on a large, foil-lined baking sheet. Rub each with 1 teaspoon olive oil, 1/2 teaspoon salt (which will make a quite salty skin, use less if desired) and 1/4 teaspoon pepper until well coated. Bake until very soft inside and caramelized on the bottom, about 2 1/2 hours. Heat your broiler and run the potatoes underneath it — mine is fairly weak, and this took 5 to 10 minutes, but check in regularly, a more robust one might do it in 1 to 2 minutes — until lightly charred on top. Let potatoes cool 10 minutes, then gently crush potatoes with your hands to expose the flesh; season with salt and finish with butter, or a topping of your choice. Some more ideas: "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slow-Roasted Sweet Potatoes with Sizzling Spices: For each potato, heat 2 to 3 teaspoons of a neutral oil or ghee (not vegan, of course) over medium-high heat, add 1/2 teaspoon cumin seeds and 1/2 teaspoon yellow or brown mustard seeds; fry until they crackle and pop, about 20 to 30 seconds. Add 1/2 teaspoon chopped garlic and red pepper flakes to taste; fry another 15 seconds. Pour immediately over exposed potato flesh, and finish with salt. We ate this with some yogurt that had been salted and mixed with lemon juice, and some black lentils on the side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slow-Roasted Sweet Potatoes with Roasted Garlic Yogurt (not vegan, of course): Cut a head of garlic in half crosswise; drizzle exposed garlic with a little oil or butter and a pinch of salt. “Close” the garlic again and wrap the head tightly in foil. Place on baking sheet with potatoes. When potatoes are done, use a knife point to remove very soft and lightly browned garlic cloves from their paper shells and mash them with a fork in a small bowl. Stir in 1/2 cup plain yogurt, or more to taste. Season well with salt and pepper. We put pats of salted butter on the exposed potato flesh and dolloped this on top."}], "link": "https://smittenkitchen.com/2018/02-slow-roasted-sweet-potatoes"}