{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/10/candy-pork.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "coconut, photo, pork meat, stew, vietnamese, winter", "name": "Candy Pork", "author": {"@type": "Person", "name": "Source: Repertoire"}, "description": "Don’t be intimidated by the word caramel — Battilana’s instructions are perfect, and it’s a cinch.", "totalTime": "2hr 30mins", "recipeYield": "6 to 8", "recipeIngredient": ["8 ounces palm sugar, finely chopped, or 1 cup dark brown sugar", "3/4 cup fish sauce", "3 tablespoons canola or another neutral oil", "4 pounds boneless pork shoulder, cut into 2-inch-by-3-inch chunks", "Kosher salt and freshly ground black pepper", "1 cup thinly sliced shallots", "1 (2-inch-by-1-inch) piece fresh ginger, peeled and julienned", "2 cloves garlic, peeled and crushed", "2 to 3 Thai chilies (or 1 serrano), stemmed and thinly sliced", "3 cups coconut water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the palm or brown sugar in a medium heavy-bottomed saucepan over medium-low heat. Cook until the sugar melts, about 8 to 10 minutes, stirring frequently so the sugar doesn’t scorch. When the sugar is smooth and completely melted, remove the pan from the heat and slowly stir in the fish sauce. The mixture may seize; if it does, return it to low heat and continue stirring until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your oven to 300°F. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven over high heat — I use this pot for this, and most braises, although it exists at many lower price points — heat the canola oil. Season the pork pieces on all sides with salt and pepper. When the oil is hot, add some of the pieces of pork and sear until well browned on all sides, estimated at 8 minutes, but this part took me muh longer. Transfer to a rimmed baking sheet and repeat with the remaining pork. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the pork has been browned, reduce the heat to medium and add the shallots. Cook, stirring, until the shallots are softened, about 2 minutes, then add the ginger, garlic, and chilies and cook 1 minute more. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pork and any accumulated juices to the pot and add the caramel sauce and coconut water. The pieces of meat should poke up above the level of the liquid; if they’re completely submerged, transfer the meat and liquid to a different pot. Bring to a boil, then reduce the heat so the liquid is simmering. Cover the pot and transfer to the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 15 minutes of cooking, peek under the lid to check that the liquid is simmering gently. If it’s bubbling very vigorously, reduce the oven temperature to 275°F for the remaining cooking time. Cook the pork with the lid back on for 70 minutes—the meat should be tender but not falling apart. Uncover the pot and continue cooking for 30 minutes more, until the exposed bits of pork are caramelized and the meat is tender that a chunk can easily be pulled back with a fork, as you hope it will on your plate. Remove from the oven and serve with rice. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[We also had some yellow wax beans (trimmed, cooked for 2 minutes, plunged in ice water, then drained), carrots (I cut them with a julienne peeler and doused them with a a couple glugs of rice vinegar, an equal amount of water, plus sugar and salt to taste and let them sit in the fridge and lightly pickle until the pork was done and up to two days, then drizzled it with a little toasted sesame oil before eating) and I put extra sliced scallions and chiles on the side so the adults who like them could add them to their plates to taste.]"}], "link": "https://smittenkitchen.com/2018/10-candy-pork"}