{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/12/baklava-babka-1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bread, brunch, cake, celebration cakes, christmas, recipes", "name": "Baklava Babka", "author": {"@type": "Person", "name": "Source: Smitten Kitchen, with the filling inspired by Sprinkles Bakes"}, "description": "This recipe makes two individual loaves of babka or one larger ring-sized. I use a tube pan here; I have this one. (It’s the same one I use for my mom’s apple cake cake, if you’re looking for more uses for it.) Flavor-wise, it hopefully goes without saying that baklava, depending on the place you like yours from and even sometimes the person who makes it, ranges in flavors and nut compositions. If you have a favorite flavor combination (maybe you hate cinnamon in it but love rose water), use it here, tweaking the below to your preferences. Below are mine. I also hope it goes without saying that baklava is a sweet dessert! However, I did my best to keep the sugar in check here and was told by everyone who tasted it not to reduce it further. ", "totalTime": "P0DT3H0M0S", "recipeYield": "12 to 16", "recipeIngredient": ["6 tablespoons (85 grams) unsalted butter, melted and cooled", "3/4 cup (175 ml) whole or low-fat milk", "3 1/2 teaspoons (11 grams) instant yeast", "3/4 cup (150 grams) granulated sugar", "3 large eggs", "1 1/2 teaspoons vanilla extract", "4 1/2 cups (585 grams) all-purpose flour", "1 teaspoon fine sea salt", "2/3 cup (135 grams) granulated sugar", "1 1/2 teaspoons ground cinnamon", "2 cups (about 250 grams or 9 ounces) mixed nuts (I use one cup each of pistachios and walnuts)", "Finely grated zest of half a lemon or orange", "A few pinches of sea salt", "1 teaspoon vanilla extract", "1/4 to 1/2 teaspoon rose water or orange flower water (optional, to taste)", "1/8 teaspoon ground cloves and/or cardamom (optional)", "1/3 cup (75 grams) unsalted butter, melted", "3/4 cup (250 grams) honey, any kind you like", "3/4 cup (175 ml) water", "Pinch of sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In the bottom of the bowl of a stand mixer, whisk together butter, milk, yeast, sugar, eggs, and vanilla until smooth. Add flour and salt and use dough hook to bring the mixture together and knead on low speed for 5 to 7 minutes. Transfer to a greased bowl, cover tightly with plastic, and set aside for 1 to 2 hours (until about 1 1/2 times the original size; it doesn’t usually fully double for me, and this is fine) in a warm spot or overnight (and up to 2 days) in the fridge. If you’re chilling it in the fridge, you’ll want to take it out about 1 1/2 hours before using it so it has time to warm up again before rolling it out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the fillings: Combine cinnamon and sugar in a small bowl and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor combine the nuts, salt, vanilla, zest, and any other flavorings you plan to use until finely chopped but not like a powder or meal (think: couscous, or use my photos above as guidance). Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare pan(s): Coat two 9-by-4-inch loaf pans (although slightly larger or smaller will work here too) or one tube pan with butter or nonstick spray, and line the bottom of each with a rectangle or donut-shaped ring of parchment paper for extra security."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble babka(s): On a large, well-floured counter, roll out dough until it is about 24 inches wide (the side closest to you) and as long in length (away from you) as you can when rolling it thin, likely 12 to 14 inches. Dab last 1/2-inch (the edge furthest away from you) with water. Brush remainder of dough with melted butter. Sprinkle evenly with cinnamon sugar. Set aside 2 tablespoons of ground nuts and sprinkle the remainder over the cinnamon-sugar. Roll the dough up with the filling away from you into a long, tight tube. Seal the end to the roll as best as you can. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let’s briefly have a side chat about shaping your babka(s): If you’re making two separate loaves, go ahead and cut this tube in two even lengths now. If you’re making a ring-shaped single babka, you can do this with one long twist or in two shorter ones. The former scared me a little so I divided mine in half. If you think you’re up for it, go for a single rope. (If it gets pesky, you can always lop it in half later, before you fit it in.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "I find it much easier to slice this roll neatly in half by transferring it to a large, lightly floured tray (bending it into a U-shape is fine if you’re trying to keep it in a single rope) and freezing it for 10 to 15 minutes, until firmer to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape your babka(s): Trim last 1/2-inch off each end of log. Gently saw the log(s) in half lengthwise (I use a long serrated knife) and lay them next to each other on the counter, cut sides up. Pinch the top ends gently together. Lift one side over the next, forming a twist and trying to keep the cut sides facing up (because they’re pretty). Don’t worry if this step makes a mess, just transfer the twist as best as you can into the prepared pan or pans. (An extra spatula or set of hands can make this lifting easier.) If you find it too pesky to make the single ring with one twisted rope, you can do it in two pieces, as I did, doing your best to tuck and twist the ends around each other. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "I know you won’t believe me, but even if it looks like a total mess right now, even if your twists do not fill the pan, the dough will fill in any gaps by the time it is baked and will also look gorgeous once baked and glossy. It’s impossible to make this look ugly; I honestly tried my best and failed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let proof again: Cover the pan(s) with plastic wrap and let them rise in a warm place for about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your oven: To 350°F. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake babka(s): Sprinkle babka(s) with reserved nut mixture. Bake for 30 to 40 minutes, or until the tops are a deep golden brown. Baking times will vary due to size and number of twists. There are two ways to check for doneness: 1. The internal temperature will reach 185°F. 2. A skewer inserted into an underbaked babka will feel stretchy/rubbery inside and may come back with damp dough on it. When fully baked, you’ll feel almost no resistance. If you babka needs more time, put it back, 5 minutes at a time then re-test. If it browns too quickly, you can cover it with foil, but I don’t expect this to be necessary here."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While babka(s) are baking, make syrup: Combine honey, water, and a pinch of salt in a small saucepan and bring to a boil. Reduce to a simmer and cook until reduced by 1/3 (can eyeball it). Pour in a spouted bowl, if you have one, or just have a spoon and pastry brush nearby. As soon as the babka(s) leave the oven, pour and brush all the syrup over babka(s) — or leave a 1/4 cup behind for serving. It will seem like too much, but will taste just right — glossy and truly like baklava. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool until lukewarm, then loosen babka(s) from sides of pans with a knife and transfer to a serving plate, patting yourself on the back for putting parchment paper at the bottom of the pan and making this easier. Serve lukewarm or at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Store babkas: At room temperature for 3 days, or up to a week in the fridge, and a month or longer, triple-wrapped, in the freezer. I find most babkas not as great on the second and third days, but this recipe was the exception. Day three, currently, might be our favorite so far."}], "link": "https://smittenkitchen.com/2018/12-baklava-babka"}