{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/06/watermelon-and-cucumber-salad.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, cucumber, photo, quick, recipes, salad, summer, vegetarian, watermelon", "name": "Watermelon Cucumber Salad", "author": {"@type": "Person", "name": "Source: Adapted generously from Saladish"}, "description": "A couple notes: All of the amounts listed here are what I used, but consider them loosely and adjust to taste. I don’t think anyone is buying watermelon by the ounce, but rather grabbing what their store or market has. On a flavor note: I love this ingredient combination (watermelon and cucumber and salty, crunchy accents) so much, if you’re feeling creative, here are a few more directions do go with it: 1. Add some fresh slivered mint leaves and or razor-thin slivers of red onion. 2. Add the chile-lime flavors we use in this melon salad, or 3. I am eager to make this with a Indian chaat flavor vibe; if you can find chat masala spice packets, I promise it will be absolutely glorious sprinkled over this salad at the end. (This is my go-to brand.)", "totalTime": "P0DT0H15M0S", "recipeYield": "4", "recipeIngredient": ["About 1/4 a large seedless watermelon or 1 small (mini) watermelon", "2 small (Perisan-style) seedless cucumber, thinly sliced", "8 ounces ricotta salata, cut into matchsticks", "1/4 cup toasted, salted pepitas (hulled pumpkin seeds)", "Olive oil, for drizzling", "Sea salt and freshly ground black pepperr"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For small watermelon, halve it and then place each half cut side down and cut each half into 8 pie-like slices. Remove the rinds from each and cut each wedge into 1/2-inch thick triangles. For a larger watermelon, cut it into smaller wedges, remove the rinds, and cut into 1/2-inch thick triangles. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a large platter, scatter a thick layer of watermelon triangles, followed by a thinner scattering of cucumbers, ricotta salata matchsticks and pepitas. Drizzle lightly with olive oil and season with salt and pepper. Repeat this rustic layering and seasoning until your ingredients are used up, finishing with an extra generous drizzle of olive oil. Eat at once!"}], "link": "https://smittenkitchen.com/2018/06-watermelon-cucumber-salad"}