{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/05/ruffled-milk-pie.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brunch, cake, greek, photo, recipes", "name": "Ruffled Milk Pie", "author": {"@type": "Person", "name": "Source: Various"}, "description": "Flavors: This pie is traditionally made with a bit of lemon peel heated/infused in the milk and loads of cinnamon all around, both infused in the milk (via a cinnamon stick) and always sprinkled all over at the end. I skipped both the lemon and cinnamon and used half a vanilla bean inside the custard, but for a more traditional taste, you should not.", "totalTime": "P0DT1H0M0S", "recipeYield": "8", "recipeIngredient": ["5 tablespoons (70 grams) butter, melted (I used unsalted but if you want to use salted, just skip the added salt)", "About 7 sheets storebought filo, defrosted (mine were 12″x17″)", "3 large eggs", "1/4 teaspoon kosher salt", "1/2 cup (100 grams) granulated sugar", "1 1/2 teaspoons vanilla extract or seeds from half a vanilla bean", "1 1/2 cups (355 ml) whole (ideally) or lowfat (worked fine) milk", "Confectioners’ sugar, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees F. Brush a 9-inch round cake pan lightly with butter, then use a large sheet of parchment paper to fit into the bottom and up the sides of the pan, creasing as needed. (This allows you to remove the pie in once piece. You can also skip this and serve it right in the pan.) Brush inside of parchment with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place stack of filo sheets on counter and cover with a larger sheet of waxed or parchment paper (see note up top) followed by a larger lightweight dishtowel. Mist towel with water to get it damp all over, but not soggy wet. Remove first filo sheet and place it on unused part of counter and replace waxed paper and towel. Brush first filo sheet with butter and use your fingers to scrunch it the long way into a loose fan-like strip; don’t worry if it breaks or tears. Wind it up into a loose, messy spiral. Place in middle of prepared pan. Repeat this with remaining filo sheets, making 6 more ruffle spirals. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 20 to 25 minutes, checking at 20, until filo is medium golden brown (you can go a shade darker than I did) and crisp. Remove from oven, leaving oven on, and let rest on a cooling rack for 10 minutes while you prepare the custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk eggs, sugar, salt, and vanilla in the bottom of a medium bowl. Pour in milk, whisking the whole time. Once 10 minutes of resting is up, pour custard all over baked filo and return pie to oven. Bake for 15 to 20 minutes, until custard is set. Let cool slightly before serving, dusting generously with powdered sugar before you do."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Leftovers keep in fridge (impressively crisp, in fact) for, well, it’s been 3 days and I don’t think I’m going to find out if it can make it to 4, 5, or 6. But I think it can."}], "link": "https://smittenkitchen.com/2018/05-ruffled-milk-pie"}