{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/07/corn-fritters.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "corn, freezer friendly, lunch, pancakes, party snacks, photo, snack, summer, vegetarian", "name": "Corn Fritters", "author": {"@type": "Person", "name": "Source: Adapted from Deborah Madison's Local Flavors via Food52"}, "description": "The photos show me making a half-recipe. We got 12 to 16 fritters from it, just enough for our family with a few leftovers. Serve these with a simple green salad, or as a side for a heartier meal such as grilled chicken, sausage, or pork chops. They’re also good with an egg on top for breakfast. See additional flavor suggestions above.", "totalTime": "P0DT0H30M0S", "recipeYield": "24 small", "recipeIngredient": ["6 ears of corn (about 3 cups corn)", "4 scallions, both white and greens finely chopped", "1/2 cup chopped herbs of your choice (I used chives)", "About 1 cup (6 ounces) grated sharp cheddar", "3/4 teaspoon kosher salt, plus more to taste", "Freshly ground black pepper", "4 large eggs", "1 cup all-purpose flour, plus 2 more tablespoons if needed", "Olive or a neutral oil for frying (I used safflower)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Shuck corn and stand the first stalk in a large bowl. Use a sharp knife to cut the kernels from the corn into the bowl, then run the back of your knife up and down the stalk to release as much “milk” as possible into the bowl. Repeat with remaining ears. It’s okay if you get a little more or a little less than 3 cups of corn. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add scallions, herbs, cheese, and many grinds of black pepper and stir to evenly combine. Taste for seasoning; I usually find I needed more salt and pepper. Add the eggs and use a fork or spoon to stir until they’re all broken up and evenly coat the corn mixture. Add 1 cup of flour and stir to throughly coat. My mixture at this point (especially with bi-color corn) looked precisely like egg salad, to give you an idea of what you’re looking for: mostly kernels and just a little visible batter to bind it. A scoop of it should hold its shape unless pressed down; if yours does not, add the remaining flour. (For reference, I needed it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 to 3 tablespoons oil in a large frying pan over medium heat. Once hot and shimmering, add your first scoop of corn fritter batter and press it gently to flatten it. (I used a #40 scoop, which holds a little less than 2 tablespoons. Tinier fritters are easier to manage.) Corn fritters cook quickly so keep an eye on them. When the underside is a deep golden brown, flip and cook to the same color on the second side. Drain on a paper towel, sprinkling on more salt. When it’s cool enough to try, taste and adjust the seasonings of the remaining batter if needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "(Deborah Madison advises that if your fritter isn’t holding to add another egg and 1/3 cup flour to give it more “glue” but I didn’t find this necessary.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook remaining fritters in the same manner, adding more oil as needed. Try to get them to the table before finishing them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Fritters keep well in the fridge for up to 3 days, and freeze well too. I like to defrost and re-toast them in a 350 degree oven."}], "link": "https://smittenkitchen.com/2018/07-corn-fritters"}