{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/06/ciambellone-an-italian-tea-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, everyday cakes, italian, lemon, recipes", "name": "Ciambellone, An Italian Tea Cake", "author": {"@type": "Person", "name": "Source: Pastry Chef Jessica Weiss"}, "description": "The cake keeps for days at room temperature and goes so well with all of the berries currently in season at breakfast, for an afternoon snack, or for dessert, ours was gone at a disappearance rate usually associated sunken jammy strawberries, streuseled blueberries, and marbled bananas. ", "totalTime": "About an hour", "recipeYield": "12", "recipeIngredient": ["2 cups (400 grams) granulated sugar", "2 1/2 teaspoons fine sea or table salt", "Finely grated zest of 1 lemon", "Finely grated zest of half an orange", "1 1/4 cups plus 2 tablespoons (325 ml) neutral oil (such as sunflower, safflower, grapeseed or another vegetable oil)", "3/4 cup plus 1 tablespoon (about 185 grams) plain, not Greek, yogurt (see note)", "1/2 cup (120 grams) mascarpone cheese", "1 tablespoon plus 1 teaspoon (20 ml) vanilla extract", "4 large eggs", "3 cups (390 grams) all-purpose flour", "2 1/2 teaspoons baking powder", "1 cup (120 grams) powdered sugar", "Scant 2 tablespoons (30 ml) corn syrup", "About 3 tablespoons (45 ml) freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make cake: Heat oven to 375 degrees F. Coat bundt or tube cake pan (check notes for size tips) with nonstick cooking spray and coat with granulated sugar. Knock out any excess sugar from pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place sugar and salt in the bottom of a large bowl and use your fingertips to rub the zest into it. This abrasion helps release the most flavor from it. Whisk in oil, mascarpone, yogurt, and then eggs and vanilla until smooth. Sprinkle baking powder over batter and whisk it thoroughly into the batter, a good 10 turns around the bowl. Sift flour onto batter and use a rubber spatula to stir just until batter is smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop batter in large scoopfuls equally around your cake mold, then smooth, and drop on counter a few times to ensure there are no trapped air bubbles. Bake for about 40 minutes (times will range by shape and volume of pan), checking in at the 30 minute mark to rotate the pan for even coloring, and to ensure it’s not baking faster than anticipated. Cake is done when a toothpick or tester comes out batter-free (crumbs are fine). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake bakes, make the glaze: Whisk sugar, corn syrup, and 2 tablespoons of the lemon juice together until smooth, adding the last tablespoon of juice just if needed. You want this glaze thick, thicker than your regular drizzle glaze, because we want it to stick to the sides of the cake when it’s hot. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cake is done, let it rest on a cooling rack for 3 to 5 minutes, then remove it from the pan — yes, while piping hot. Brush glaze evenly over the top of the cake, and sides if you wish. Chef Weiss says “Use all of the glaze! Don’t be cheap.” And I listen to her. Glaze will set as cake cools. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cake is good at room temperature for 4 days. I loosely, really loosely, cover it with foil."}], "link": "https://smittenkitchen.com/2018/06-ciambellone-an-italian-tea-cake"}