{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/04/img_2794.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "asparagus, eggs, gluten free, lunch, photo, recipes, salad, spring, vegetarian", "name": "Asparagus and Egg Salad with Walnuts and Mint", "author": {"@type": "Person", "name": "Source: Six Seasons: A New Way With Vegetables"}, "description": "Is this a good place to admit that I’m not an asparagus-snapper? This idea that the asparagus knows exactly where to snap to separate the tender parts from the woody ends defies what I’ve experienced, which is that asparagus will snap halfway between your hands, no matter where you place them. [The Asapargus-Snapping Truthers are going to come for me in the comments; I hope they are kind.] I like McFadden’s suggestion more: choose one stalk from the bunch and snap or trim it to the right spot, then line up the remaining stalks and cut them to the same point. ", "totalTime": "15 to 30 minutes", "recipeYield": "4", "recipeIngredient": ["4 large eggs, cold from fridge", "1/2 cup (1 ounce or 30 grams) grated parmesan cheese", "1/2 cup (2 ounces or 55 grams) finely chopped lightly well-toasted walnuts", "1 teaspoon finely grated lemon zest", "Kosher salt and freshly ground black pepper", "Dried chile flakes", "1 pound asparagus, any thickness, tough ends trimmed", "About 1/4 cup fresh lemon juice", "1/4 cup lightly packed fresh mint leaves, chopped", "1/4 cup olive oil, preferably extra-virgin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a small/medium pot of water to boil. Gently lower in eggs and reduce heat to a simmer. Boil for 8 1/2 minutes, then quickly transfer eggs to an ice-cold water bath. Leave them there while you prepare the other ingredients, but ideally at least 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place parmesan, walnuts, and lemon zest in the bottom of a large bowl, along with 1 teaspoon salt, many grind of black pepper, and about 1/2 teaspoon chile flakes (or more or less to taste; I used half because: kids). Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the asparagus on a sharp angle into very thin slices and add to the parmesan mixture. Add 1/4 cup lemon juice and toss some more. Taste and adjust the flavors to your preference by adding more salt, black pepper, chile flakes, or lemon juice, and go a little bit heavy, so the flavors don’t disappear once you add the eggs. Add mint and olive oil toss, adjusting seasoning again. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel your cooled eggs. Cut in half, then each half into 6 to 8 chunks. Add to bowl with asparagus and give it one or two gentle stirs (I don’t want to get them too mashed up here). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Eat as is, or scoop onto 6 to 8 toasts or 3 large matzo sheets, halved into 6 more manageable “toasts” (obviously this would negate the gluten-free categorization)."}], "link": "https://smittenkitchen.com/2018/04-asparagus-and-egg-salad-with-walnuts-and-mint"}