{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/11/drop-cornbread-biscuits.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, photo, recipes, scones biscuits, thanksgiving", "name": "Drop Cornbread Biscuits", "author": {"@type": "Person", "name": "Source: Land O Lakes"}, "description": "Shown here are 8 large biscuits; you can make 12 smaller ones, just use the short end of the baking time range.", "totalTime": "P0DT0H20M0S", "recipeYield": "8 to 12", "recipeIngredient": ["1 3/4 cups (230 grams) all-purpose flour", "2/3 cup (90 grams) cornmeal", "1 to 2 tablespoons granulated sugar (use 1 for a more savory biscuit)", "1 tablespoon baking powder", "1/2 teaspoon fine sea or table salt", "1/2 cup (115 grams) cold butter, in cubes", "1 cup (235 ml) cold buttermilk (buttermilk substitutes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450°F. I covered my baking sheet with parchment paper but it shouldn’t be strictly necessary, and many shouldn’t go in this hot of an oven, so use your own discretion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir flour, cornmeal, sugar, baking powder, and salt in the bottom of a large bowl with a fork or whisk. Add butter and toss to coat cubes in dry mixture. Use your finger or a pastry blender to break the butter into smaller and smaller bits, until the largest is pea-sized. Add buttermilk and stir once or twice, until a dough comes together. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "My very scientific method of dividing the dough evenly is to press it gently into the bottom of your mixing bowl into roughly a circle. Cut into 8 or 12 wedges. Pull out one triangle of dough with a soup spoon for each biscuit, pressing it into a craggy, messy ball, then drop it onto your baking sheet. Repeat with remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 12 to 14 or 15 minutes; smaller ones should be done at 12, larger ones at 14 or 15. Remove from oven and serve warm. Biscuits are best on the first day. On the second, gently rewarming them will improve the texture."}], "link": "https://smittenkitchen.com/2018/11-drop-cornbread-biscuits"}