{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/03/melting-potatoes1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, potatoes, recipes, side dish, thanksgiving, vegetarian, weeknight favorite", "name": "Melting Potatoes", "author": {"@type": "Person", "name": "Source: Adapted from Real Simple"}, "description": "I made these with, and most often see recipes call for, Yukon Gold potatoes, which on the waxy/smooth end of the potato spectrum, and almost sweet when you roast them. But I’m reading here that floury/mealy potatoes (such as Russets) are often called for too. I haven’t tested it with them, so if you try them, let us know. I imagine they’d absorbed the broth even more luxuriously. I used all butter but I have read that olive oil with a little butter to finish, and/or clarified butter are equally popular, and less prone to burning. But I don’t think you should skimp on the fat. If you do, you’re going to eat roasted potatoes with broth, basically, and not roasted potatoes in a reduction of deeply browned butter and concentrated stock infused with herbs and garlic and I don’t know how you’re still reading this. Go! Make these now!", "totalTime": "P0DT0H50M0S", "recipeYield": "4 to 6", "recipeIngredient": ["4 tablespoons unsalted butter, melted", "2 teaspoons chopped fresh thyme or rosemary leaves (I skipped because mine are under snow)", "1 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "2 pounds yukon gold potatoes, peeled, cut into 1-inch slices", "1 cup chicken or vegetable stock or low-sodium broth", "3 to 4 garlic cloves, peeled and smashed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees F. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[This is really, crazy hot. If you’re really nervous, I suppose that 450 degrees or 475 will also work, but I made it both times at 500 without problems.]"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place melted butter in the bottom of a large bowl. Stir in herbs, if using, salt, and pepper. Add potato slices and mix to evenly coat them. Spread potato slices and all of the good stuff at the bottom of the bowl in a 9×13 (quarter-sheet) metal (a glass baking dish shouldn’t be used at this high of a temperature) baking pan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast potatoes for 15 minutes. Use a thin spatula (you all know by now how much I love a flexible fish spatula, especially here) to loosen potatoes and turn them over. Roast for a second 15 minutes, then carefully pour stock or broth into pan and add the garlic cloves. Roast for 15 minutes more, until potatoes are fully tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven. Transfer to a serving platter along with any remaining liquid in pan and serve warm to very lucky people."}], "link": "https://smittenkitchen.com/2018/03-melting-potatoes"}