{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/10/sunken-black-forest-cake1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, cherries, chocolate, date night, gluten free, passover, photo, recipes", "name": "Sunken Black Forest Cake", "author": {"@type": "Person", "name": "Source: Adapted from Now & Again"}, "description": "This recipe is adapted from the flourless chocolate cake in the Buvette cookbook, a project Turshen worked on. However, in the Buvette, the recipe has more butter and sugar; in Turshen’s book, it has less. When I tested it, my happy place was in the middle — too little sugar and the cake was dry, too much and the sweetness of the preserves overwhelm — and that’s what I’ve shared below. The kirsh in the cherries both loosens them and gives them a little kick. If you don’t have it, try light rum. If you don’t use either, try a tablespoon each of lemon juice and water.", "totalTime": "2hr 30mins", "recipeYield": "8 to 12", "recipeIngredient": ["12 tablespoons (170 grams or 6 ounces) unsalted butter, cubed", "12 ounces semi- or bittersweet chocolate chips (2 cups), or chopped chocolate", "6 large eggs, separated", "1/2 teaspoon fresh lemon juice, distilled white vinegar, or apple cider vinegar", "3/4 cup (150 grams) granulated sugar, divided", "1/2 teaspoon kosher salt", "3/4 cup heavy cream", "2 teaspoons granulated sugar, or more to taste", "2 teaspoons vanilla extract", "1/2 cup sour or regular cherry preserves", "2 tablespoons kirsch (sour cherry brandy, optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat butter and chocolate together until about 75% melted in the microwave or over the lowest heat in a saucepan. Remove from heat and stir until it’s finished melting and is smooth. Let it cool while you prepare the rest of the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your oven to 350°F (175°C). Coat the bottom and sides of a 9-inch round cake pan with nonstick cooking spray and line the bottom with a circle of parchment paper. Set it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg whites in the bowl a stand mixer fitted with a whisk attachment, in a large bowl and use a handheld electric mixer, or use a large whisk and a lot of elbow grease. Beat on medium-high speed until they’re foamy, then slowly pour in the lemon juice and half the sugar, continuing to beat until the egg whites are billowy and almost glossy and hold a soft peak. This is important: try not to overbeat them until they’re stiff and tight foam-looking; it leads to more dry cakes. Set the egg whites aside (if you only have one stand mixer bowl, scrape them into a separate bowl so you can use it again). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the egg yolks, remaining sugar, and salt into an empty bowl and beat on medium speed until thick and pale yellow, about 1 to 2 minutes. With the mixer running, slowly pour in the chocolate-butter mixture, and mix well. Use a rubber spatula to fold one-third of the beaten egg whites into the chocolate cake batter to lighten in. Fold half the remaining egg whites in carefully, then the second half. Turshen says to fold them into the batter by “cutting your spatula downward through the middle of the bowl, scraping it along the bottom of the bowl, and then pulling the mixture back up… folding them with the batter.”"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer batter to prepared cake pan and smooth the surface. Bake until the center is puffed up, and just barely firm/dry to the touch, and a toothpick inserted into the center comes out with just a few dry crumbs clinging to it, about 35 to 40 minutes. Try not to overbake it (the chocolate at the edges will smell toasty) or that cake can taste dry at the edges. Place the cake on a wire rack to cool completely; it will sink in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: Once cake is completely cool, beat the cream, sugar, and vanilla together until medium peaks form (I overbeat mine, whoops). In a small bowl, combine combine the preserves and kirsh. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a knife to loose then edges of the cake from the pan and invert it onto your rack. Peel off parchment paper, then invert it back onto a serving plate. Spoon the whipped cream into the center and then the preserves mixture on top. Cut into wedges and serve. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Leftovers keep covered in the fridge for 3 days, however, if the cherry-cream appearance doesn’t look great after a couple hours, although this has no effect on taste. To avoid this, you can just put the cherries on as you’re serving the cake in slices."}], "link": "https://smittenkitchen.com/2018/10-sunken-black-forest-cake"}