{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/05/chilaquiles-brunch-casserole.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, breakfast, brunch, casserole, eggs, recipes, tex mex, vegetarian", "name": "Chilaquiles Brunch Casserole", "author": {"@type": "Person", "name": "Source: Various"}, "description": "Could you add sauteed vegetables or bits of crispy bacon or chorizo to the layers before baking it? Of course you could. Could you use a high-quality tortilla chip instead of frying your own corn tortillas? I think you could. You’ll want to use 7.8 to 8 ounces of tortilla chips instead of what is listed below. ", "totalTime": "P0DT1H0M0S", "recipeYield": "8", "recipeIngredient": ["12 small (6-inch) corn tortillas, quartered and fried until crisp", "1 1/4 cups (from a 10-ounce can) red enchilada sauce [see Note]", "1 3/4 cups (from a 15-ounce can) black beans, drained and rinsed", "2 cups (8 ounces) coarsely grated shredded monterey jack or cheddar cheese (I used a mix)", "6 to 8 large eggs", "Kosher salt and freshly ground black pepper", "Thinly sliced scallions, sour cream, diced avocado, and hot sauce, to finish and serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375°F. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat a 3-quart baking dish (mine was 7.5-x-11.5 inches) with oil or a nonstick spray. Spread 1/4 of tortillas in bottom of dish. Drizzle/scatter with 1/4 (eyeballing it) of enchilada sauce, followed by black beans and cheese. Repeat 3 times. Bake for 15 minutes, until cheese is melted and tortillas have softened a little. Remove from oven to a cooling rack (leaving oven on) and use a spoon or fork to push little nests into the tortillas where you’d like each egg to go (it won’t fully hold it, but will help them stay in place). Crack 6 to 8 eggs into them, however many you’d like to use, season the eggs with salt and pepper and return casserole to the oven until the whites of the eggs are opaque but not fully set. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[“What? Deb, that’s gross!” you’re thinking right now but trust me, I’ve made dozens of baked egg casseroles and they all end up with hard-cooked yolks. Letting the whites finish cooking in the residual heat is the only way to avoid it. If you take it out when the whites are set, the residual heat will solidify the yolks.] "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and let rest on a rack for (about) 4 to 8  minutes, after which the whites should be fully set but the yolks still runny and serve with finishes of your choice."}], "link": "https://smittenkitchen.com/2018/05-chilaquiles-brunch-casserole"}