{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/09/foolproof-cacio-e-pepe.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, italian, pasta, photo, quick, vegetarian", "name": "Foolproof Cacio e Pepe", "author": {"@type": "Person", "name": "Source: Flavio de Maio via Elizabeth Minchilli"}, "description": "Here’s the magic of this technique: The recipe sticks to the 3-ingrdient-only premise, but it begins the sauce with cold water, forming the cheese and pepper into a thick, paste-like sauce, without any of the separated, gloppy cheese risk that can happen with pasta cooking water. No heat touches the sauce until it hits the piping hot pasta, so it melts only onto the noodles. At this point, you use spoonfuls of cooking water as needed to loosen it to a thick but lightly creamy consistency. And it works every time, which will I bet will a lot more often after today.", "totalTime": "P0DT0H15M0S", "recipeYield": "2 to 3, or to preference", "recipeIngredient": ["8 ounces dried spaghetti or tonnarelli", "4 ounces aged pecorino romano, finely grated", "A lot of freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of well-salted water to boil. Cook pasta to one minute shy of package instructions and taste for your desired doneness, cooking a minute longer if needed. We are not cooking the pasta and sauce further together on the stove, so the bite it has now is about what your final dish will."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While it’s cooking, combine all the pecorino (except a spoonful for garnish) and lots of freshly ground black pepper in a bowl. Add 1 tablespoon cold water and use an immersion blender to work it into a paste, adding additional cold water, 1 tablespoon at a time, only as needed. You want to form the mixture into a paste about the thickness of cream cheese or frosting. I use about 4 to 5 tablespoons total for this amount. Blend more than you think is needed; you want this paste as smooth as you can get it. You can do this same process in a food processor, even grinding the cheese in it instead of grating it first but it will require longer processing to get the rubble-like cheese smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before the pasta is done, scoop out a cup of hot cooking water and set it aside. Drain the pasta very quickly in a colander (no need to shake every drop of water off) and immediately drop it, piping hot, into a large bowl. Add 3/4 of cheese-pepper paste in dollops and toss to combine. It’s going to be too thick to form a sauce but once it has begun to coat the noodles, pour in one small ladleful of pasta water and toss, toss, toss (a lot of movement helps here) to loosen the paste into a lightly creamy consistency that evenly coats the spaghetti strands. Taste and add more of the cheese-pepper paste to taste, or use it all. Add more pasta water as needed only to loosen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish with reserved pecorino and a few grinds of black pepper. Eat immediately."}], "link": "https://smittenkitchen.com/2018/09-foolproof-cacio-e-pepe"}