{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/01/sheet-pan-meatballs-with-crispy-turmeric-chickpeas.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, meat, photo, recipes, turkey, weeknight favorite", "name": "Sheet Pan Meatballs with Chickpeas, Turmeric and Lemon", "author": {"@type": "Person", "name": "Source: Turmeric chickpeas adapted from NYTimes, meatballs from The Smitten Kitchen Cookbook"}, "description": "Meatballs take much less time to cook than chickpeas do to crisp, so they go in long after the chickpeas. The red onion that gets roasted will char a bit; we love it. Because I’ve been writing and reading comments here for as long as a 6th grader has been alive, I know that you’re about to tell me that you do not like fennel seeds. Yes, you can skip them. There’s enough else going on here. You could also add a teaspoon or two of whole cumin seeds, for an extra crunchy boost. But if you like fennel seeds or you’re on the fence, I think you’ll love them here.", "totalTime": "About an hour", "recipeYield": "4 to 6", "recipeIngredient": ["2 (15-ounce) cans chickpeas, drained and rinsed", "1 tablespoon fennel seed", "1 teaspoon ground cumin", "1 teaspoon ground turmeric", "1 large red onion, thinly sliced, divided", "2 tablespoons olive oil", "Kosher salt and freshly ground black pepper", "1 pound (455 grams) ground turkey", "1/2 cup panko, or another plain, dry breadcrumb", "1/4 cup plain yogurt", "2 tablespoons water", "1 teaspoon kosher salt", "1 large egg", "2 garlic cloves, minced", "1/2 teaspoon ground coriander", "1/2 teaspoon ground cumin", "1/2 teaspoon ground turmeric", "1/4 teaspoon cayenne, hot paprika, or red pepper flakes, plus more to taste", "2 tablespoons chopped cilantro, flat-leaf parsley or mint leaves, or a mix thereof, plus more to garnish", "3 tablespoons lemon juice (from about 3/4 of a lemon)", "3/4 cup plain yogurt", "Toasted pita wedges", "Harissa or another hot sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Combine chickpeas, fennel seed, cumin, 1 teaspoon turmeric and half the red onion slices on a rimmed baking sheet. Drizzle with olive oil, season with salt and pepper and toss to coat. Roast for 25 minutes, until beginning to firm/crisp up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make meatball mixture. Mix all ingredients in a large bowl with a fork or (my recent discovery) a potato masher to mix. Form into 1.75-inch meatballs; I use a #40 cookie scoop, which holds about 1 2/3 tablespoons. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove sheet pan with chickpeas from the oven (leave oven on) and move the chickpeas to the sides of the pan, clearing a space in the center. Lightly coat center with a thin coat of oil, either brush or spray it on, just to be safe. Add meatballs to oiled area, not touching. Place baking sheet in oven and bake 10 to 15 minutes, or until meatballs are cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss remaining onion slices with 2 tablespoons lemon juice and season with salt and pepper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine yogurt with remaining 1 tablespoon lemon juice and season with salt and pepper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meatballs are cooked, scatter remaining fresh herbs over the tray. Serve with lemony onions and yogurt, toasted pita wedges and hot sauce. Repeat as often as needed."}], "link": "https://smittenkitchen.com/2018/01-sheet-pan-meatballs-with-crispy-turmeric-chickpeas"}