{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2018/12/chocolate-caramel-tart-with-sea-salt.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chocolate, photo, recipes, tarts pies", "name": "Chocolate Caramel Tart", "author": {"@type": "Person", "name": "Source: Genius Desserts"}, "description": "Three things:I know caramel can be scary to make but I beg you to try it anyway because it’s just cooked sugar. That’s it. Repeat this to yourself as needed. You don’t need a thermometer. Fleming doesn’t give a temperature goal; she’s trying to keep it simple. Look for an amber/light copper color and that’s it, you’re there. Don’t look for what I did above; I overcooked it. I used it anyway; it’s faintly bitter but nobody minds.Someone gave me a gift certificate to Williams-Sonoma for Hanukah a few years ago, which led to me buying a bunch of things that nobody really needs but bring me great joy, such as a rectangular tart pan, so I used it here. It holds 75% of the volume of the recipe below, written for a standard (9.5/10-inch round) tart pan. If you have one and want to use it, just use 75% of every ingredient below and you’ll be set. Oh, and go ahead and use the whole egg yolk in the crust. It won’t cause problems.Finally, this is not the recipe as Fleming wrote it; you can find her version in the book and throughout the web. I have a lazier way to make tart crusts that I prefer, and I’d be crazy not to tell you about it.", "totalTime": "P0DT2H30M0S", "recipeYield": "8 to 12", "recipeIngredient": ["1/2 cup plus 1 tablespoon (70 grams) powdered sugar", "1 1/4 cups (155 grams) all-purpose flour", "1/4 cup (20 grams) Dutch-processed cocoa powder", "1/2 cup (115 grams) unsalted butter, diced", "1 large egg yolk", "3/4 teaspoon vanilla extract", "2 cups (400 grams) granulated sugar", "1/2 cup (120 grams) water", "1/4 cup (80 grams) light corn syrup", "1/2 cup (115 grams) unsalted butter, cut into tablespoons", "1/2 cup (120 grams) heavy cream", "2 tablespoons (30 grams) creme fraiche or sour cream", "Pinch or two flaky sea salt", "1/2 cup (120 grams) heavy cream", "3 1/2 ounces (100 grams) bittersweet chocolate, finely chopped (Fleming requests your “best quality”)", "Pinch or two flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make chocolate crust in a food processor: Pulse sugar, flour, and cocoa powder until mixed. Add butter and run the machine until it’s finely chopped and basically disappears into the dry mixture. Add yolk and vanilla and run the machine — not just pulse it — until the mixture begins to clump. It make take 30 seconds, but it will begin to form clumps. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make chocolate crust in a stand mixer: In bowl of an electric mixer, combine the butter, flour, confectioners’ sugar and cocoa. It’s going to be bumpy at first but keep letting the machine bang it up until it is softened, and keep beating until smooth. Scrape down sides. Add egg yolk and vanilla, and mix until blended. With this method, if the mixture feels too soft to press into a crust, wrap it in waxed or parchment paper and refrigerate it until mostly firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press crust into bottom and up sides of a 9.5- to 10-inch round tart pan with a removable bottom (for easier release). Keep a quarter-sized ball of crust aside to patch cracks later, if needed. Transfer pan to freezer and freeze until solid, about 20 minutes. Meanwhile, heat oven to 325 degrees F."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake crust: Prick frozen crust with a fork, coat a piece of foil with nonstick spray, and press it oiled-side-down tightly against the frozen crust, so it is fully molded to the shape. Bake tart with foil (no pie weights needed) for 15 minutes, then carefully, gently, a little at a time, peel back foil and discard. If cracks have form, this is when you patch them with reserved dough. Return to oven for 5 to 10 minutes more, until pastry looks dry and set. Let cool on a rack while you make the caramel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make caramel: In a large saucepan with a light-colored interior (this will make it easier to see the caramel’s color), combine the sugar, water, and corn syrup, then turn heat to medium-high. Cook undisturbed (no stirring needed, just tilt and swirl the pan if it looks uneven but really this shouldn’t be very necessary) until the sugar takes on an amber or pale copper color, about 10 minutes. Remove from heat and carefully whisk in the butter — it’s going to boil up and steam, be careful — until melted, then the cream and creme fraiche or sour cream and a couple pinches of salt, until smooth. Pour into prepared crust. Let caramel set in the fridge until cool and firm, about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make ganache: Place chopped chocolate in a heatproof bowl and bring cream to a simmer. Pour over chocolate and let sit undisturbed for 2 minutes, then whisk until smooth. Pour it over cooled caramel layer, spreading evenly with a spatula or butter knife. Let set in the fridge, another hour, or until firm to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Sprinkle the top of the tart with flaky sea salt. A knife dipped in hot water cuts fairly cleanly, but slices will become messy within a minute of being cut, so try to get them to their plates quickly. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To store leftovers: Fleming recommends doing so at room temperature, but I think it makes things too messy. Spray two small strips of foil with nonstick spray and press them against the cut/open sides of the tart and wrap them tight; this will keep it from spilling out in the fridge. Tart should keep in the fridge for a week, not that I believe it will."}], "link": "https://smittenkitchen.com/2018/12-chocolate-caramel-tart"}