{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/02/bodega-style-egg-and-cheese-sandwich.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "breakfast, eggs, quick, recipes, sandwich", "name": "Bodega-Style Egg and Cheese Sandwich", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "This makes one petite egg sandwich, which is all I need, but you can use the same method with two eggs and a slightly longer cooking time.", "totalTime": "Less than 5 minutes", "recipeYield": "1", "recipeIngredient": ["An English muffin, roll or two slices bread of your choice", "2 teaspoons butter or oil", "1 egg", "Salt and pepper", "1 slice of cheese or a small pile of grated or crumbled cheese", "Spoonful of sliced scallions, chives, crumbled bacon, or whatever else you want in your eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast your bread. Heat a medium-sized skillet, preferably nonstick, over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat one egg with a 1/2-teaspoon water, a couple pinches of salt and a few grinds of black pepper until just blended. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in your pan or brush it with oil, to thinly coat it. Pour in the egg and roll it around so it coats the pan, as a thin crepe would. Immediately place your cheese and/or other fillings in the middle. After a minute, the egg will have set. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the part of the egg closest to you over the cheese, like the first part of a business letter fold. Repeat this on the three remaining “sides,” forming a small square, or you can aim for more of a rectangle if that’s the shape your bread is. Leave the folded egg-and-cheese in the center of the skillet to cook for another 30 seconds, then slide onto your muffin or toast. Top the sandwich with the other half and eat immediately. Notice a couple sets of eyes gazing at you, perhaps wondering where their sandwich might be. Repeat a couple more times and not even mind because it’s so easy."}], "link": "https://smittenkitchen.com/2019/02-bodega-style-egg-and-cheese-sandwich"}