{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/01/crispy-rice-and-egg-bowl-with-ginger-scallion-dressing.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "budget, eggs, grain, lunch, pantry, put an egg on it, quick, recipes, vegetarian, weeknight favorite", "name": "Crispy Rice and Egg Bowl with Ginger-Scallion Vinaigrette", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "I make this with cucumbers and carrots because it’s what I have around most often, but I think this could be good with many other vegetables, even leftovers, so go ahead, clean out your fridge before it gets terrible. If you have extra time, I like to toss the carrots with 2 tablespoons each rice vinegar and water, 1/2 teaspoon sugar, 1/2 teaspoon fine sea salt to coat the strands. They begin to marinate/gently pickle while you do everything else. But the dressing is sufficient to flavor them if you’re in more of a rush.", "totalTime": "P0DT0H10M0S", "recipeYield": "4", "recipeIngredient": ["1 1/4 cups minced scallions, both green and white parts (from a 4-ounce bundle)", "2 tablespoons minced or finely grated fresh ginger", "Neutral oil (such as grapeseed, safflower, or sunflower)", "1/4 cup sherry or rice wine vinegar", "Fine sea salt", "About 1 heaped cup julienned or coarsely grated carrots (from about 8 ounces fresh)", "8 ounces small (Persian-style, about 2) cucumbers, thinly sliced", "3 cups cooked, cooled rice (my favorite here is short-grain brown or white)", "4 eggs", "Soy sauce or tamari (to serve)", "Toasted sesame oil (to serve)", "Sriracha, gochujang or another hot sauce of your choice (to serve)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: Mix scallions, ginger, 1/4 cup oil and sherry or rice wine vinegar in a bowl. Season with salt (I use about 1/2 teaspoon fine sea salt). Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crisp your rice: Heat a large frying pan over medium high. Add 1 to 2 tablespoons oil; you’ll want to coat the bottom with a thin layer of oil all over. Nonstick pan (as I used) are more forgiving here, so you can use the lower amount. Heat the oil until it’s hot, another minute, then scatter half the rice over the surface; it’s okay if small clusters remain. Season lightly with salt and do not touch it. In 3 to 5 minutes, the underside will become golden brown and crisp. Use a spatula to flip it in sections then fry on the other side until it is also crisp. Divide between two bowls and repeat with remaining rice, dividing it between two remaining bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crisp your egg: If there isn’t enough oil left in the pan (you want a thin layer), add another splash and heat this on high heat. Add eggs one at a time and season lightly with salt and pepper. Cook until brown, lacy, and crisp underneath, and the whites are opaque, bubbly and dramatic and the edges are brown. You can spoon some oil from the pan over the egg whites to help them cook faster. Place one egg on each bowl of rice. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble bowls: Arrange some cucumbers and carrots to each bowl. Spoon 2 tablespoons vinaigrette onto each bowls. Drizzle each egg with a half-teaspoon of tamari and toasted sesame oil, letting it roll onto the other ingredients, plus hot sauce to taste. Eat immediately. Repeat frequently. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: The dressing will keep for 5 to 6 days in the fridge; the chopped vegetables will keep for 3 to 4."}], "link": "https://smittenkitchen.com/2019/01-crispy-rice-and-egg-bowl-with-ginger-scallion-vinaigrette"}