{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/10/chickpea-and-kale-shakshuka.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, budget, casserole, eggs, fall, freezer friendly, gluten free, kale, north african, pantry, stew, vegetarian, weeknight favorite", "name": "Chickpea and Kale Shakshuka", "author": {"@type": "Person", "name": "Source: Family: New Vegetarian Comfort Food to Nourish Every Day, by Hetty McKinnon"}, "description": "Make the stew portion whenever time permits — I would even expect it to freeze well — then rewarm it on the stove and drop in eggs closer to when you’re ready to eat it. I’ve omitted the oven step in this recipe, because I found (mostly by forgetting to read the recipe) that it cooks just fine on the stove.", "totalTime": "P0DT0H45M0S", "recipeYield": "4 to 6", "recipeIngredient": ["Olive oil", "1 medium yellow onion, finely chopped", "2 garlic cloves, finely minced", "1 teaspoon ground cumin", "1 teaspoon ground coriander", "1/2 a jalapeño pepper, de-seeded and finely chopped", "Kosher salt and black pepper", "2 15-ounce cans cooked chickpeas, drained and rinsed (about 3 1/2 cups)", "15-ounce can crushed tomatoes (1 3/4 cups)", "1/2 cup (125ml) vegetable broth or stock", "4 ounces kale, stems removed (I use a package from the salad greens section)", "1 cup (150 grams) feta, crumbled", "4 to 6 large eggs (shown with 6)", "1 tablespoon za’atar", "Handful of mint leaves, chopped", "Toasted pita wedges, to serve (optional)", "Dollops of plain Greek yogurt, to serve (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep frying pan or low Dutch oven* casserole dish, heat a glug (1 to 2 tablespoons) olive oil over medium heat and, once hot, add the onion, garlic, spices, and jalapeño and cook for 4 to 5 minutes, until translucent. Add the tomatoes, stock, and chickpeas plus 1 teaspoon kosher salt and several grinds of black pepper and stir to combine, bringing the mixture to a simmer, lowering the heat if necessary to keep it from bubbling too hard. Cover with a lid and cook for 5 to 7 minutes, until the sauce has thickened slightly. Add kale and cover again, cooking until the greens have wilted, 2 to 4 minutes. Adjust seasoning if needed. Make wells for eggs and break an egg into each. Sprinkle eggs with additional salt and pepper, and the whole dish with feta. Cover and simmer for 6 to 10 minutes, until the whites are set but the yolks are runny.** "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, drizzle with olive oil, sprinkle with za’atar and mint, and serve with pita wedges and plain yogurt, if you wish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "* I’m using this pot, the pan that’s gotten the most use in my kitchen for the last five years."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "** The trickiest part of any baked egg dish is getting the eggs exactly right, neither undercooked or hard-boiled. I vote for checking them as often as needed and rotating the pan as needed to avoid a hot spot ruining a single egg. Most importantly, ask yourself: Am I eating this the second it comes off the stove or 10 or even 20 minutes later? If so, you can take them off ever-so-slightly wiggly in the whites because they’ll continue to set as the pan rests."}], "link": "https://smittenkitchen.com/2019/10-chickpea-and-kale-shakshuka"}