{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/11/perfect-apple-tarte-tatin.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, apple, french, tarts pies", "name": "Perfect Apple Tarte Tatin", "author": {"@type": "Person", "name": "Source: Adapted, just slightly, from Susan Spungen"}, "description": "While the recipe calls for 7 and almost always only needs 7 apples, I always start with 8, just in case one is too banged up to use, or they shrink enough that I can fit an extra piece in. Caramel apple pieces that don’t fit — you’ll figure out what to do with them. Look for apples that are relatively even in size for even “cobblestones” on the tart.", "totalTime": "50 to 60 minutes, plus cooling time", "recipeYield": "8", "recipeIngredient": ["Juice of half a lemon", "4 tablespoons (55 grams or 2 ounces) unsalted butter, cubed, very cold", "3/4 cup (150 grams) granulated sugar", "1 sheet of defrosted puffed pastry or a half recipe of extra-flaky pie crust", "7 to 8 medium-large Pink Lady, Gala, or Fuji apples (3 to 3 1/2 pounds; 1.3 to 1.5kg)", "Crème fraîche or softly whipped cream, unsweetened, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400°F (205°C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel your apples. Cut apples in thirds off of the core as best you can (no need for perfectly even thirds) and cut or scoop any remaining seeds out. Squeeze the juice of half a lemon over them and toss to coat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have the butter very cold and ready by the stove. Trust me. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour sugar into a large (11- to 12-inch) skillet and place over medium-high heat and cook, without stirring, until sugar is partially liquefied, about 4 minutes. Whisk until all unmelted sugar disappears into the caramel and nudge the heat down to medium low. We are going to cook it a little darker, but it will go quickly from here. Cook until the sugar is dark amber, 1 to 2 minutes (you can test this on an instant read thermometer, it’s about 350 to 370 degrees F but read the Note up top first; a drop of caramel poured on a white plate will look dark amber). Remove from heat, immediately add butter and whisk to melt and combine. This will hold the color where it is."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return to the heat and add the apples and cook over medium high heat. The caramel will seize up a bit and will seem too thick to coat the apples, but it will loosen up in a minute. Cook, gently stirring and turning to ensure even cooking, until apples soften and begin to turn translucent at the edges and are about 3/4 of the way cooked through, about 10 minutes. This is not an exact science; larger or more dense apples may take longer. On the flipside, if your apples are falling into mush here, they’re the wrong apples, it will not get better in the oven. Don’t worry about overcooking the caramel once the apples are in; this has never happened to me."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, transfer apples, rounded side down, one at a time to a smaller (10-inch) skillet with an oven-proof handle or a 10-inch (standard) pie dish. Arrange them in a concentric circle around the outside, overlapping each apple by about 1/3 and purposely crowding them. Arrange remaining apples in the center of the ring; it’s far less noticeable if the center is more messily arranged. If you began with 8 apples, you’ll probably find that you don’t need all the pieces. Pour any extra caramel in the skillet over the apples. Let this cool for 10 minutes, and use this time to roll out the pastry.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the dough out to a rough circle about one inch larger than the pan. If you’re not ready to use it yet, chill until needed on a lightly floured plate or tray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top sautéed apples with the pastry round, tucking the edges in all around. Cut a vent or two in the center, and place dish or skillet on a baking sheet. Bake for 25 to 30 minutes minutes, or until pastry is nicely browned and apples are bubbling around the edges. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a butter knife around the edges to loosen. Let cool in the pan at least 30 minutes and up to 60 minutes. Peek under the crust if you can, or tilt the pan slightly, looking for evidence that the caramel and juices have thickened slightly. To invert, top with a serving plate and grasp the pan and plate tightly together as a unit (wearing oven mitts if it is still warm;) and flip quickly. Remove the pan. If any apples stick to the pan, just replace them where they should go on the tart. Serve warm, with crème fraîche or whipped cream, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If it has cooled completely before you serve, either return to the oven (if in a pie dish) or the stove (if in a skillet) to warm up and loosen the caramel for a few minutes. Leftovers keep well in the fridge, rewarm gently before serving."}], "link": "https://smittenkitchen.com/2019/11-perfect-apple-tarte-tatin"}