{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/06/strawberry-summer-sheet-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, everyday cakes, recipes, strawberries, summer", "name": "Strawberry Summer Sheet Cake", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "This is a light update and scaled-up version of my Strawberry Summer Cake in the archives. In the original version, I suggest up to a 50% flour (here I’d suggest 1 cup) swap of barley flour, if you’ve got it. It’s not like other wholegrain flours, but much more silky and delicate. It has a subtle creamy, nuttiness goes well here.", "totalTime": "P0DT1H0M0S", "recipeYield": "12 to 16", "recipeIngredient": ["9 tablespoons (125 grams) unsalted butter, at room temperature", "3/4 teaspoon fine sea or table salt", "1 1/2 cups (300 grams) plus 3 tablespoons (40 grams) granulated sugar", "1 large egg", "1 large egg yolk", "1 1/2 teaspoons (8 ml) vanilla extract", "3/4 cup (175 ml) milk, whole is preferred but all varieties have worked", "2 1/4 teaspoons baking powder", "2 1/4 cups (295 grams) all-purpose flour", "1 1/2 pounds (680 grams) of the freshest, even a touch overripe, strawberries, hulled and halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your oven to 350°F (180°C). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly coat the sides and corners of a 9×13-inch cake pan with butter or nonstick spray, and fit the bottom with a rectangle of parchment paper. In a large bowl, beat butter, salt, and 1 1/2 cups of the granulated sugar until light and fluffy. Add egg, yolk, and vanilla and beat until combined. Add milk and mix until (updated) combined; it may look a little curdled but don’t fret, it will smooth out in a minute. Sprinkle baking powder evenly over batter and beat into batter for 20 seconds longer than will seem necessary — this ensures it’s perfectly distributed. Scrape down the bowl. Add flour and beat or stir until just combined. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread batter in prepared pan. Arrange strawberries cut side down, as snugly as you can get them to fit. If you have extra, nudge them in anyway. Leave no strawberries behind. Sprinkle with remaining 3 tablespoons of sugar — it will seem like a lot but helps the strawberries get jammy and gives the cake a great texture. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden brown and a toothpick inserted into the cake comes out free of wet batter (gooey strawberries are a given and doesn’t mean it’s underbaked) — about 45 to 48 minutes. Let cool in pan on a rack. Cut into squares and serve as is, or with lightly sweetened whipped cream, if you’re Deb. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Cake is even better a half- to a full day later, when the strawberries marry with better with the cake. I like to leave the cake uncovered at room temperature so it doesn’t get sticky on top."}], "link": "https://smittenkitchen.com/2019/06-strawberry-summer-sheet-cake"}