{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/01/cozy-cabbage-and-farro-soup.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "budget, cabbage, freezer friendly, grain, pantry, soup, vegetarian, winter", "name": "Cozy Cabbage and Farro Soup", "author": {"@type": "Person", "name": "Source: Adapted from Six Seasons"}, "description": "A few notes: This is a good soup to double because while it makes 4 portions, you’ll see, it’s not a speck over one standard soup bowl per person. If you double it, you’ll need to add the cabbage a little at a time until it shrinks down, but it otherwise shouldn’t be a problem in a 5 to 6-quart pot.", "totalTime": "P0DT1H0M0S", "recipeYield": "4", "recipeIngredient": ["1 pound cabbage, savoy or green", "Olive oil", "1 medium onion, thinly sliced", "Kosher salt and freshly ground black pepper", "3 garlic cloves, smashed and peeled", "1 sprig of rosemary or thyme (optional because I’ve forgotten it each time, and not regretted it)", "1 tablespoon red wine or white wine vinegar", "2/3 cup uncooked farro", "About 4 cups homemade or storebought chicken or vegetable broth", "1 tablespoon fresh lemon juice", "Shaved parmesan, to finish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut out the cabbage core and finely chop it. Cut the leaves into fine shreds or about 1/8-inch ribbons. Heat 1/4 cup olive oil in a large pot or Dutch oven over medium heat. Add the onion and cabbage core, some salt and pepper, and cook, stirring frequently, until the onion starts to soften but is not yet browned, about 5 to 7 minutes. Add the garlic and cook another 3 to 5 minutes, until the garlic softens too. Add the shredded cabbage leaves and herb sprig, if using. Reduce the heat to medium-low and cover the pot and let it steam a bit to soften the leaves, then toss the cabbage to combine with other ingredients. Cook, covered, until the cabbage is very sweet and tender, which the book says will take 30 minutes but I find 15 to 20 minutes usually does the trick. Stir occasionally. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small skillet, heat a glug of olive oil over medium and add the uncooked farro. Toast it, stirring, for a few minutes, until half a shade darker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cabbage is ready, stir in the vinegar. Taste and season with more salt and pepper. Add toasted farro and broth. Bring mixture to a lazy simmer and cook for 25 to 35 minutes, until farro is tender and all the flavors are married. The soup will be very thick, but if you’d prefer more liquid, add another 1/2 cup broth or water. Taste and adjust seasoning again. Stir in lemon juice. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle into bowls and finish each with a drizzle of olive oil and a shower of parmesan, with more parmesan passed at the table. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Soup keeps well in the fridge for 3 days, and for weeks or longer in the freezer."}], "link": "https://smittenkitchen.com/2019/01-cozy-cabbage-and-farro-soup"}