{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/12/unstuffed-mushroom-casserole.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "casserole, mushrooms, side dish, vegetarian", "name": "Unstuffed Mushroom Casserole", "author": {"@type": "Person", "name": "Source: Adapted from the Food Network"}, "description": "This is doubled from the original recipe and exactly as you see it here (filling a 2-quart baking dish) because the original makes way too little to share. You know that joke about spinach? It turns out white mushrooms reduce about 1/3 of their original volumes after cooking; don’t be disappointed.", "totalTime": "P0DT1H0M0S", "recipeYield": "8 as a side", "recipeIngredient": ["6 tablespoons olive oil", "3 pounds medium white button mushrooms, quartered", "Kosher salt and freshly ground black pepper", "6 cloves garlic, finely chopped", "8 ounces cream cheese, cut into pieces", "1 cup grated gruyere, comte, or cheddar etc.", "2 cups panko-style breadcrumbs", "1 cup grated parmesan", "1/2 cup fresh parsley, chopped", "4 tablespoons unsalted butter, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your oven oven to 350°F."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large frying pan (12-inch is ideal here) over medium-high heat, heat half (3 tablespoons) of the olive oil. Once it’s very hot, add half (1.5 pounds, but seriously, just eyeball this) of your mushrooms but don’t move them yet. Give them 1 to 2 minutes to brown underneath before adding 1/2 teaspoon kosher salt, a few grinds of black pepper, and half the garlic, then moving them around, trying to get them to brown on more sides until they begin releasing their liquid. Some have a little, some have a lot; in both cases you can to cook the mushrooms, stirring, until the liquid mostly, but not fully, cooks off — a thin puddle should remain. Scrape these mushrooms into a large bowl and repeat the process with the remaining olive oil, mushrooms, and garlic, plus more salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the second half of the mushrooms have mostly cooked off their liquid, add everything in the pan to the first half of mushrooms in the bowl. Add diced cream cheese and stir just until combined (the remaining liquid from the mushrooms should help it get saucy), then half of the panko (1 cup), all of the gruyere, half of the parmesan (1/2 cup), and most of the parsley (reserve some for garnish) and stir to combine. Transfer to a 2-quart baking dish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the butter and remaining panko (1 cup) and parmesan (1/2 cup) in a bowl with a couple pinches of salt. Sprinkle over top of the mushrooms and bake until the breadcrumbs are light golden brown, 25 to 30 minutes. Sprinkle with remaining parsley and eat right away. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make this ahead of time, please read: Since I’m usually making this to entertain and like to get things out of the way, I pause the recipe (in the fridge until needed, covered with foil) where you transfer the mixture to a baking dish. To finish cooking, I first get the mushroom mixture warm without the crumbs, leaving the foil on, about 10 minutes, and then bake it the rest of the way with the crumbs on, until they’re a light golden brown, usually another 25 minutes. If you put the crumbs on sooner, they get too dark. If you finish baking the dish with crumbs and later rewarm it, the mushrooms get a little overcooked and the crumbs too toasty."}], "link": "https://smittenkitchen.com/2019/12-unstuffed-mushroom-casserole"}