{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/05/raspberry-crumble-tart-bars.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, bars, picnics, raspberries, summer, tarts pies", "name": "Raspberry Crumble Tart Bars", "author": {"@type": "Person", "name": "Source: Adapted from Gourmet, August 2006"}, "description": "I changed a bunch of things about the recipe, so if you’re loyal to the original, look away now. First, it’s created for what I consider an unusual tart pan size (11 1/4 by 8-inch), which I have, but that doesn’t help most other people. You could also make it in a 10-inch round but I liked the idea of turning these into bars, since they’re so much more picnic-and-potluck friendly. Below, I’m sharing a scaled-down recipe for an 8×8-inch pan (or a 9-inch round pan, if you want to serve it in wedges) and (update: added at the end!) a scaled-up recipe for 9×13-inch slab tart bars. Making tart-height walls (1-inch) in a taller cake pan is a little fussy, but totally doable, and this recipe is forgiving. There’s a general belief that if you don’t parbake a bottom crust, it will be soggy, but all three of mine are crisp underneath — and even more so when the tart cools before I cut it, thanks to the unheavy and unsoggy filling. ", "totalTime": "30 minutes active, 2 1/2 hours with resting and baking time", "recipeYield": "16 squares", "recipeIngredient": ["1/2 cup (2 1/4 ounces or 65 grams) whole toasted almonds", "1 3/4 cups plus 2 tablespoons (245 grams) all-purpose flour", "3/4 teaspoon kosher salt", "3/4 cup (6 ounces, 12 tablespoons, or 170 grams) cold, unsalted butter, cut into cubes", "3 tablespoons (45 ml) cold water, plus an additional tablespoon, if needed", "1/2 cup plus 1 tablespoon (115 grams) granulated sugar", "3 6-ounce containers fresh raspberries (510 grams, 18 ounces, or about 4.5 cups)", "1 cup (4 1/2 ounces or 130 grams) whole almonds", "3 cups plus 3 tablespoons (415 grams) all-purpose flour", "1 1/4 teaspoons kosher salt", "1 1/3 cups (21 tablespoons, 10.5 ounces, or 300 grams) cold, unsalted butter", "1/3 cup (80 ml) cold water", "1 cup (200 grams) granulated sugar", "5 1/2 6-ounce containers fresh raspberries (905 grams, 32 ounces, or 8 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bars without a machine: Roughly chop almonds and set aside. Place your flour and salt in the bottom of a large bowl and stir to combine. Add your butter cubes to the flour mixture. Toss them around so that they’re coated and used your fingers to work the butter into the flour until the largest butter bits are the size of small peas. You can also use a pastry blender to achieve this."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bars in a food processor: Pulse almonds in your food processor until coarsely chopped. Set them aside and lightly wipe crumbs from workbowl. Add flour and salt and pulse to combine. Add butter and pulse the machine in short bursts until the the largest butter bits are the size of small peas. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Both methods: Divide butter-flour mixture into two bowls (each will have 1 1/2 cups of crumbs). Drizzle cold water over first bowl, use a spoon or spatula to mix it into shaggy clumps, then use your hands to quickly, gently knead it together into one ball. Wrap the dough in plastic wrap, flattening it a packet shape. Chill for 1 hour, or until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sugar and chopped almonds to second bowl of butter-flour mixture and use your fingertips to pinch them together, mashing up the buttery bits, until a loosely clumped streusel is formed. Set this aside. At this point, you can refrigerate both the crumbs and the dough overnight (and up to 3 days) and bake it when needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble your bars: Heat oven to 375 degrees F. Coat an 8×8-inch cake pan with nonstick spray. Line the bottom and two sides with a fitted piece of parchment paper. You can also make this in a 9- to 9.5-inch round tart pan. No need to line the bottom with parchment paper if there’s a removable base."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a well-floured counter, unwrap your packet of dough, sprinkle the top generously with flour, and roll you dough to a 10×10-inch square (or a 13-inch round for a round pan). Gently fold it into quarters and unfold it into your prepared pan, centering the dough as best as you can. Press into the bottom of the pan and 1-inch up the sides, folding the extra dough over the walls and pressing it against the sides to reinforce the edges. Don’t worry if it’s messy — mine totally was. The only thin you want to avoid is holes or tears; patch any that you see. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill base with berries and sprinkle evenly with crumble topping. It will seem like too much but it’s going to be perfect once it bakes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake bars: For 40 to 50 minutes, covering with foil if it browns before it’s done. Bars are done when they’re an even golden brown and (this is the most important part) you can see the berry juices bubbling through the crumbs. Let cool for 20 minutes on a cooling rack, then use the parchment sling to lift bars out of pan and cool the rest of the way on the rack. (Or, if using a tart pan with removable sides, remove them now.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Sprinkle with powdered sugar, if you wish, and use a serrated knife to cut into squares (or if a round pan, wedges). Bars keep at room temperature or the fridge, lightly wrapped, for 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To scale this up to a 9×13 quarter-sheet pan, use:\n1 cup (4 1/2 ounces or 130 grams) whole almonds3 cups plus 3 tablespoons (415 grams) all-purpose flour1 1/4 teaspoons kosher salt1 1/3 cups (21 tablespoons, 10.5 ounces, or 300 grams) cold, unsalted butter1/3 cup (80 ml) cold water1 cup (200 grams) granulated sugar5 1/2 6-ounce containers fresh raspberries (905 grams, 32 ounces, or 8 cups)\n9×13 quarter-sheet pan instructions: When you need to divide the crumbs in half, each half will have about [edited] 2 2/3 cups of butter-flour mixture. Line your 9×13-inch pan with a rectangle of parchment paper. Roll the crust to 13×17-inches and proceed as above. It took about 10 minutes longer to bake, but keep an eye on it, covering it with foil if it gets too brown too fast. I let it cool completely in the pan. "}], "link": "https://smittenkitchen.com/2019/05-raspberry-crumble-tart-bars"}