{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/09/crisped-chickpeas-with-herbs-and-garlic-yogurt.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, gluten free, lunch, pantry, quick, vegetarian, zucchini", "name": "Crisped Chickpeas with Herbs and Garlic Yogurt", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "Note: This makes enough chickpeas for two servings.", "totalTime": "P0DT0H20M0S", "recipeYield": "1", "recipeIngredient": ["1 15-ounce can chickpeas, drained and rinsed", "1 small garlic clove, minced or microplane-d", "1/2 cup plain yogurt", "Salt and red pepper flakes- Olive oil", "Half a large lemon", "1 small zucchini (about 6 ounces), thinly sliced", "Handful of chopped fresh mint, oregano, basil, parsley, or a mix thereof"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread chickpeas out in a single layer on a paper towel or two and roll around to pat dry; leave them there you fry them. Stir together garlic, yogurt, and a couple pinches of salt on a plate until mixed. Spread to cover most of bottom of plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat scant 4 tablespoons olive oil in a medium-large nonstick skillet over medium-high heat. Add chickpeas and cook, stirring to ensure they color evenly, until golden and crispy, about 10 minutes. They’re going to crackle and pop as they fry; be careful or use a splatter screen if you have one. Use a slotted spoon, transfer the chickpeas to paper towels to drain briefly then season well, while still very hot, with finely grated lemon zest, fine sea salt, and pepper flakes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another tablespoon or so of oil if needed to the pan and warm again over medium-high. Add the zucchini — you will not fit it all in one layer and that’s fine, just leave it there until browned underneath, a few minutes, then turn in sections, repeating the don’t-move-until-browned pause until the zucchini is tender and browned in spots. Season well with salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide zucchini onto prepared yogurt. Cut the zested lemon half into two wedges. Drizzle hot zucchini with juice from one of the wedges; place the second on the side of the plate for serving. Sprinkle half of chickpeas on top of zucchini (save the second half of the chickpeas for next time). Finish with a small drizzle of olive oil and fresh herbs. Eat right away."}], "link": "https://smittenkitchen.com/2019/09-crisped-chickpeas-with-herbs-and-garlic-yogurt"}