{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/11/roasted-cabbage-with-walnuts-and-parmesan.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, budget, cabbage, fall, gluten free, quick, salad, vegetarian, winter", "name": "Roasted Cabbage with Walnuts and Parmesan", "author": {"@type": "Person", "name": "Source: Adapted from Six Seasons"}, "description": "Don’t use too big a cabbage. I’ve gotten some shockingly large ones from the grocery that were too dense inside to get a nice crisp to them, without steaming first. Go with two small rather than one giant one, if you have options.", "totalTime": "20 miniutes", "recipeYield": "2 to 4", "recipeIngredient": ["1 medium-large (1 3/4 pounds) or two small heads savoy cabbage", "7 tablespoons extra-virgin olive oil, divided", "1 teaspoon kosher salt, plus more to taste", "Freshly ground black pepper", "Scant 1/2 cup (1.75 ounces) walnut halves and pieces", "1 large or 2 smaller garlic cloves", "1 large lemon", "Red pepper flakes, such as Aleppo (optional)", "Grated parmesan, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 475ºF. Remove any damaged outer leaves of cabbage and cut it 8 (for small ones) to 12 (for a large one) wedges. Coat a large baking sheet with 2 tablespoons olive oil. Arrange cabbage wedges in one layer, drizzling or brushing them with 2 more tablespoons olive oil and sprinkle with 1 teaspoon kosher salt and freshly ground black pepper to taste. Roast for 8 to 10 minutes, until charred underneath (don’t panic if you see a few thin black edges; they’re going to taste amazing). Use a spatula to flip each piece over and roast for 5 more minutes, until the edges of the cabbage are dark brown. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, while cabbage roasts, place nuts on a smaller tray or baking dish and roast them next to the cabbage for 4 to 5 minutes. Remove and scatter them, still hot, onto a cutting board and coarsely chop them. Scoop into a bowl and finely grate the zest of half a lemon and all of the garlic over it. Add remaning 3 tablespoons olive oil to walnuts, a few pinches of salt and red pepper flakes and stir to combine. If you’ve got a couple minutes to let it all infuse as it cools, let it rest. When ready, squeeze the juice of half your lemon in and stir to combine. Adjust flavors to taste, adding more lemon if needed; you want this dressing to be robust. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The moment the cabbage comes out of the oven, spoon the walnut dressing over the wedges. Grate parmesan all over, to taste. Serve immediately, while piping hot. There will be no leftovers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tools: This is forever my favorite spatula, and particularly helpful here when you have unweidly wedges to flip. I prefer a Microplane rasp with more surface area and use this one."}], "link": "https://smittenkitchen.com/2019/11-roasted-cabbage-with-walnuts-and-parmesan"}