{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/10/chicken-tikka-masala.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, fall, freezer friendly, gluten free, indian, weeknight favorite", "name": "Chicken Curry", "author": {"@type": "Person", "name": "Source: Chetna Makan"}, "description": "Note: This dish was previously, incorrectly called “Chicken Tikka Masala.” All the other recipe notes are at the end of the recipe, since there are many.", "totalTime": "P0DT1H0M0S", "recipeYield": "4 to 6", "recipeIngredient": ["2 1/4 pounds boneless, skinless chicken thighs, cut into 2-inch pieces", "1 cup plain, full-fat yogurt (I use Greek; with Greek, 2% worked too)", "4 garlic cloves, minced or grated, divided", "2-inch piece of ginger, minced or grated, divided", "2 teaspoons kosher salt, divided, plus more to taste", "2 to 3 tablespoons neutral oil or ghee", "2 large yellow onions, minced", "1 teaspoon cumin seeds", "About 2 1/2 cups small diced fresh tomatoes, from 3 to 4 roma tomatoes, or 1 15-ounce can crushed tomatoes", "2 tablespoons tomato paste", "1 1/2 teaspoons ground turmeric", "1 teaspoon garam masala", "1 tablespoon ground coriander", "1/2 to 1 teaspoon cayenne or a mild chile powder, such as kashmiri, or to taste", "1/2 cup water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine chicken thighs with yogurt, half of garlic, ginger, and salt in a bowl and set aside for whatever time you’ve got — you can use them right away, in an hour, or up to a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large (4 quarts), heavy pan with a lid, heat oil or ghee. Once hot add onions and cumin seeds, cook 5 minutes, until browned at edges. Add remaining ginger and garlic and cook one to two minutes more. Add remaining salt, turmeric, garam masala, coriander, and cayenne or another chile powder cook for two minutes. Add tomatoes and cook until they begin to break down, 4 minutes. Add tomato paste, cook for another 2 minutes. Add chicken and yogurt marinade from bowl, plus water, stir to combine, and bring to a simmer, stirring. Simmer 25 to 30 minutes over low heat, covered, stirring once or twice to ensure everything is cooking evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chicken is done when it is cooked through and very tender (you can cut a larger chunk in half to check for doneness). Adjust seasoning as needed and serve with rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Notes:\n* In the video, Chetna Makan makes this with one whole chicken that’s been skinned and cut into chunks; I do not doubt that having bones in the mix provide a deeper flavor. I went with boneless chicken thighs for speed and ease."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "* Re, fresh tomatoes: I often see fresh tomatoes suggested in Indian dishes and found it surprising, when they’re so lousy out of season and canned tomatoes are so consistent. But in Priya Krishna’s Indian-ish cookbook, she suggests that you only use canned tomatoes “if you have to.” She said she finds that even those sad fresh winter tomatoes seem to work better in bringing that necessary brightness to Indian dishes than canned ones.” I’ve used fresh tomatoes in dishes that call for them since, even firm, unjuicy ones, and really like the complexity they bring once cooked. I’m fully converted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "* Re, removing dairy: I definitely think you could marinate the chicken in full-fat coconut milk (I find the cans from Trader Joe’s particularly rich) for a similarly delicious dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "* Re, InstantPot: Yes, I think you could. Chunks of boneless thighs usually take 7 minutes for me on high, however, I suspect by the time the IP comes up to pressure and then releases, you’ll have saved little of the 25 minutes stovetop simmering time. But, the IP is hands-off, and that counts too."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "* About the name: Makan calls the recipe chicken curry, but I took the liberty of calling it by what seems to be its full dish name: chicken tikka masala. (Please correct me if I’m wrong.) I read mixed things about the word “curry,” which can be confusing — more here on why, but it’s basically it’s catch-all term that doesn’t mean a whole lot. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "* I’m using the pot you probably see all of the time here, a Staub 4-quart braiser. The rice you see is golden sella basmati rice; I bought mine at Kalustyan’s."}], "link": "https://smittenkitchen.com/2019/10-chicken-curry"}