{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/12/cider-glazed-bacon-wrapped-dates-2.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, appetizers, dairy free, dates, gluten free, party snacks", "name": "Cider-Glazed Bacon-Wrapped Date", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "This recipe has a few variables. Most thin bacon can be split in half to easily wrap two dates. You want to make sure that your bacon will wrap around each date twice before securing it with a toothpick as it will shrink a lot in the oven. Bigger or smaller dates will change the yield, too. I’m using Trader Joe’s today, for reference; each package has 14 slices and wraps 28 dates. I find bacon easier to work with cold from the fridge. If you can track down pitted dates, this fantastically easy recipe is even more so, but should you have no choice but to pit your own, it’s not hard, just make a slit down the side of the date and you can pop the pit out.  If you’d like to be fancy, this is really nice with some rosemary sprigs on the tray, roasted in the bacon drippings, cider vinegar, and salt.", "totalTime": "P0DT1H0M0S", "recipeYield": "Makes about 28 bites", "recipeIngredient": ["12 ounces bacon (thinner is better), each strip cut into two segments", "6 ounces pitted dates (about 28)", "1 1/2 tablespoons apple cider vinegar", "2 teaspoons maple syrup or honey", "A few pinches aleppo-style mild red pepper flakes", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees F. Wind bacon around each date, securing it with a toothpick and arranging it on a rimmed, foil-lined baking sheet or roasting dish. (I didn’t line with foil and suffered the dish-washing consequences.) Combine cider vinegar, maple syrup, and pepper flakes in a small bowl. Brush or spoon over each bacon-wrapped date; you can even very briefly roll them in the mixture to coat. Sprinkle with sea salt. Roast for [updated with reduced time for first check-in, based on recent comments] as little as 15 and up to 35 minutes, until bacon is a deep, crisp, sizzling brown — this varies a lot between brands. Check in on the early end, and then every 5 minutes thereafter, to get the color and crisp just right. If you have extra vinegar mixture, you can brush it on again in the second half of the baking time. Serve warm, sprinkling with more sea salt and/or pepper flakes to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Bringing these to a party? They rewarm well at almost any temperature. You can also bake them most of the way at home — until the bacon is cooked and mostly crisp, but not browned — and finish them up where you are, rewarming them as you do. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leftovers: Nah, no such thing."}], "link": "https://smittenkitchen.com/2019/12-cider-glazed-bacon-wrapped-dates"}