{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/11/dry-brined-turkey-with-roasted-onions.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "thanksgiving, turkey", "name": "Dry-Brined Turkey with Roasted Onions ", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "Read the notes at the end first, pretty please.", "totalTime": "4 to 5 hours from removing from fridge to serving, plus 1 to 2 days dry brine", "recipeYield": "12 to 16", "recipeIngredient": ["1 12- to 16-pound fresh turkey", "Kosher salt", "4 tablespoons maple syrup", "1/2 cup unsalted butter, melted", "1 tablespoon of a chile paste — gochujang, harissa, or chipotle — plus more to taste", "8 to 10 medium onions, half red, half yellow, peeled and cut into quarters", "1 to 2 tablespoons sunflower, safflower, or another high-heat friendly oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "1 to 2 days before serving: Make sure the giblets (usually in a bag) are removed from the turkey’s cavity. Sprinkle all over with kosher salt, using about 1 tablespoon per 4 pounds of bird, including some into cavities. I do this on a rack in my roasting pan. Loosely cover with plastic and place in the fridge for 1 to 2 days, and until 4 to 5 hours before you want to serve it. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "1 to 2 hours before roasting: Remove plastic and discard any juices that have collected around the bird. Allow to come to room temperature, which will take 1 to 2 hours. No need to rinse any salt off the bird; it’s all as it should be."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "2 1/2 to 3 1/2 hours before serving: Heat oven to 450°F with a rack on the lowest level of the oven. If you plan to stuff the turkey with anything, do so now. Truss the legs (tying them together) with kitchen twine or, uh, any other string you have around. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the onions with a splash of oil (don’t worry about seasoning, they’ll collect it from the pan) and arrange around the turkey. Combine 1 tablespoon of the melted butter with the maple syrup and chili paste in a small bowl, whisking until smooth. Brush this — or use your hands to coat — all over the turkey, leaving none behind. Here you’re supposed to tuck the wings under the bird to prevent the tips from burning, something I have never successfully done, if we’re being honest. Have a big piece of foil nearby for when you will want to cover the turkey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast turkey for 25 to 30 minutes, then — this is very important — reduce the oven heat to 350° and continue roasting the bird until a thermometer in thickest part of the breast reads 150 to 155. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beginning when you reduce the heat, periodically baste the turkey with 1 to 2 tablespoons of the remaining melted butter, and then, when you’re out of butter, with the juices from the pan. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "This turkey is going to brown fairly quick and quite dark. Don’t fret, it will not taste burnt, but go ahead and put the foil on when it gets as dark as you can stand it. Rotate the pan in the oven a couple times, and turn onions in pan over once, for even cooking. Remove the foil for the last 5 to 10 minutes of roasting, so the skin crisps up again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A 14 to 16 pound bird takes a total of 2 to 2 1/2 hours of roasting. A 19.5 pound bird once took over 3 hours. Keep in mind that if you’re opening and closing the oven door a bunch of times to move other dishes around, it will take longer to cook (up to 30 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rest, carve, and serve: Allow the turkey to rest at room temperature 15 to 20 minutes before carving, which you should estimate 20 or so minutes to do, depending on your comfort level. This will allow the juices to be locked in and the turkey to carry over to an internal temperature of 165°F. Use the rest time to rewarm any sides that need it and to make gravy (see below). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "I am not going to write out carving instructions because I personally cannot do it without watching a video. I pop this or this or this up on my phone (I recommend previewing them earlier and picking the one that works for you), hit the pause button a lot, and do my best. When you slice the turkey, make sure your knife is really, really sharp to get those clean cuts. Do you know what else really clean cuts do? Make people think you knew what you were doing. (I absolutely do not.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Your turkey is going to spill a lot of juices while you carve it. [Updated with a life-changing tip from Cindy in the comments.] Place your cutting board inside a rimmed sheet pan to collect the juices as you carve. Pour some over the sliced turkey (save any left for gravy), plus a final sprinkle of salt and pepper, before serving to keep it warm and seasoned. Arrange onions all around and serve with glee. You totally rocked this; I knew you would."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Notes:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Now, let’s talk about gravy. This is my core gravy recipe:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Very Simple Gravy\n8 cups turkey or chicken stock (I either use homemade chicken or Better Than Bouillon’s turkey base)\n1/2 cup unsalted butter\n2/3 cup all-purpose flour\n2 tablespoons dry marsala or cider vinegar"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in an empty pot or your emptied roasting pan and stir in flour. Cook this mixture over moderate heat, whisking, 3 minutes. Add marsala or vinegar, cooking for another minute. Add stock a little at a time, whisking constantly to prevent lumps, then bring to a simmer, whisking occasionally. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "However, there are three ways to approach this. The first, above, straight gravy and it’s ideal for people who do not want to stress about it, don’t want to wait until the more frenetic time when the turkey is out and needs to be curved, and even want to make it earlier in the day and rewarm it. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The second is more traditional. You use the same formula but you first pour off drippings that have collected under your turkey. Put them in a glass (or a beaker like this) to allow them to separate. Swap whatever fat accumulates on top with the same amount of butter in the recipe, and drippings with the equivalent amount of broth, and proceed as written."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The third is a little riskier, but you only live once, right? Place your roasting pan across two stove burners, and bring the liquid (which is a mixture of fat and juices) to a boil. Deglaze the pan, loosening any stuck bits, with a glug of dry marsala or a wine of your choice. Boil all of the juices off until only the fat remains. Eyeball it — you might have just 2 to 3 tablespoons, or you might have more. Add enough butter to get you to 8 tablespoons. Add the flour, and then, since you’ve concentrated flavors so intensely here, you can replace half of the stock with water, to essentially rehydrate them. Season as needed and cook as you would the core recipe.  "}], "link": "https://smittenkitchen.com/2019/11-dry-brined-turkey-with-roasted-onions"}