{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/10/white-bean-soup-with-crispy-kale.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "beans, gluten free, greens, kale, pantry, recipes, soup, weeknight favorite", "name": "White Bean Soup with Crispy Kale", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "To make this vegetarian, skip the pancetta and sauté the onion in 2 tablespoons of olive oil. To make this dairy-free, omit the cheese and sour cream.", "totalTime": "P0DT0H40M0S", "recipeYield": "4", "recipeIngredient": ["4 ounces diced pancetta", "Olive oil", "1 medium onion, chopped", "3 cloves garlic, minced", "Kosher salt", "Freshly ground black pepper", "4 cups vegetable or chicken broth", "1 1/2 pounds yukon gold potatoes, diced into 1/2-inch cubes (no need to peel)", "5 ounces curly kale leaves (from a salad-ready container)", "1 15-ounce can of cannellini or a smaller white bean, drained and rinsed", "1/2 cup finely grated parmesan", "Sour cream, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees F."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy pot, heat 1 tablespoon oil and pancetta over medium heat; cook, stirring, until pancetta is crisp all over. Remove with slotted spoon and drain on paper towels. Pour off all but two tablespoons fat from pan and leave the heat on. Add onion and garlic and cook until softened but not brown, about 5 minutes. Add broth, potatoes, 1/2 teaspoon kosher salt, and many grinds of black pepper. Bring to a simmer and cook, partially covered, until potatoes are tender (you can check by trying to smash one against the side of the pot with a spoon), about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile: Toss kale leaves with 1 tablespoon olive oil, rubbing it into the leaves. Spread them on your largest baking sheet, season with salt, and bake until the leaves are crisp, anywhere from 12 to 17 minutes. (It ranges due to whether there’s water clinging to them still and how much the pieces curl up.) You might want to move pieces around halfway to ensure they bake evenly. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once potatoes are tender, add beans and simmer for 3 minutes more. Blend soup until totally smooth. It will be thick. Taste and adjust seasonings if needed, adding more salt and pepper. Stir in half your cheese until melted and combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle into bowls. Dollop with sour cream, some kale chips torn into smaller chunks, pancetta, and remaining cheese if needed to please the masses."}], "link": "https://smittenkitchen.com/2019/10-white-bean-soup-with-crispy-kale"}