{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/03/extra-billowy-dutch-baby.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, breakfast, eggs, pancakes, quick, recipes", "name": "Extra-Billowy Dutch Baby Pancake", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "The two key things to keep in mind when aiming for Peak Billows in your puffy oven pancake are 1. Baking it long enough that the center sets too, getting a chance to slightly rumple, although it may not always. This usually involves setting the timer for the suggested time and checking back every 1 to 2 minutes after until it’s just right. 2. Having the right size pan for the batter yield. If there’s too little, the pancake will not have the same dramatic heights. The yield here is intended for one 12-inch round ovenproof skillet, two 9-inch round ovenproof skillets, the equivalent sized baking dishes, or even a 9×13-inch pan. If you pan is smaller, simply scale the recipe down. For the 2-quart oval casserole dish shown up top, I used 3/4 of this batter, i.e. 3 eggs, 6 tablespoons each flour and milk. Finally, I know people often balk at the amount of butter, and this uses less than some recipes, but it’s essential that there’s enough in the pan that the pancake can slide around and rumple over it; if there’s any even slight sticking, it will not.", "totalTime": "P0DT0H30M0S", "recipeYield": "2 to 4", "recipeIngredient": ["2 to 3 tablespoons unsalted butter", "4 large eggs", "1/2 cup (65 grams) all-purpose flour", "1/2 cup milk (ideally whole milk but most varieties will work)", "1/4 teaspoon kosher salt", "If savory: Freshly ground black pepper, wilted spinach or sauteed greens, bacon or ham cheese, herbs or comte, herbs (shown here with ham, gruyere, and chives)", "If sweet: 1 tablespoon granulated sugar in batter, powdered sugar to finish, lemon juice, syrup, fresh berries, shaved chocolate, or chocolate sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees F with one 12-inch round ovenproof skillet, two 9-inch round ovenproof skillets, the equivalent sized baking dishes inside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat eggs thoroughly with a whisk or fork. Add salt and flour, whisk until lumps disappear. Add milk, whisking until smooth. If you know you’d like your pancake to end up sweet, you can add 1 tablespoon granulated sugar to the batter; if you know you’d like it to be savory, you can add freshly ground black pepper. But, you can also choose your own adventure when it comes out. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When oven and baking vessel are fully heated, wearing potholders, carefully remove skillet(s) or baking dish(es) from the oven. Melt butter inside and roll it around so it goes up the sides, too. If using one large dish, two-ish tablespoons is often sufficient; it’s best to use three tablespoons between two dishes, however."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into buttered dish(es) and return it to the oven. Bake for 12 to 13 minutes to start, and then in additional 1 to 2 minute increments until the edges are deeply golden brown and the centers are just beginning to color. Have your finishes ready to go. Transfer to a cooling back or trivet. I finish sweet pancakes with lemon juice and a good coating of powdered sugar, and savory pancakes with grated cheese, vegetables and/or ham or bacon, and fresh herbs. Eat immediately; these pancakes are best hot from the oven."}], "link": "https://smittenkitchen.com/2019/03-extra-billowy-dutch-baby-pancake"}