{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/06/burrata-with-charred-and-raw-sugar-snap-peas.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "grilling, peas, quick, recipes, salad, side dish, summer, vegetarian", "name": "Burrata with Charred and Raw Sugar Snap Peas", "author": {"@type": "Person", "name": "Source: Adapted from Where Cooking Begins"}, "description": "I finished the peas with more olive oil, mint (or basil), and lemon, and used Music’s suggestion of adding more heat through Calabrian chiles in oil (dried red pepper flakes work too). This alone makes a fancy salad kind of meal, or but grilled chicken sausages or a sheet pan of your favorite meatballs would make it more substantial. ", "totalTime": "15 active minutes", "recipeYield": "4 as a salad course, 2 as a main", "recipeIngredient": ["1 8-ounce ball burrata", "Olive oil, for drizzling and brushing", "Flaky sea salt", "Freshly ground black pepper", "Half a lemon", "1 pound sugar snap peas", "1 to 2 thick-cut slices crusty bread (I’m using miche here)", "A handful of mint and basil leaves, torn or thinly sliced", "Chiles in oil or red pepper flakes to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Butterfly your burrata: Drain burrata and gently dab dry on a paper towel. Place on serving platter. Begin to cut in half vertically (i.e. into left and right halves) but stop halfway and turn knife sideways (in either direction) and cut out to wall of burrata but not through. Use knife to flip it open onto the plate, then spread the center cream a bit into a flat layer. Repeat on second side. Drizzle lightly with olive oil and sprinkle with flaky salt. Let sit at room temperature while you prepare everything else, or up to an hour, if you have the time. Taking the chill off it is the key for the creamiest insides and best flavor. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim/de-string your sugar snaps and place in a large bowl. Drizzle with 1 tablespoon olive oil (or more, to taste), many grinds of black pepper, and sea salt and toss to evenly coat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate or shred your bread with your fingers into coarse crumbs. I omitted my crusts because they were stale and very dark. You want a little shy of 1 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill instructions: Prepare your grill for medium-high direct heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crumbs on the grill: Place a small cast iron frying pan on a medium-high heat on your grill and place the torn bread and a glug of olive oil inside, enough to dampen the crumbs. Season with salt and cook the crumbs, stirring from time to time, until they’re golden and crisp. About a minute before they reach the perfect color, finely grate the zest of half a lemon over them and stir to heat and combine. Set crumbs aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill your sugar snaps: Place half your prepared sugar snaps in on a wire rack or grill basket on a grill and grill, tossing occasionally, until charred in spots, about 3 to 5 minutes. Transfer back to bowl with remaining raw sugar snaps and toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stove instructions: Make the crumbs on the stove by following the above instructions but use a large, heavy frying pan over medium-high heat, the same one you’ll use again for the sugar snaps. Scoop the crumbs out into a bowl to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blister your sugar snaps on the stove: Heat the large, heavy frying pan you used for the crumbs over high heat. Add half of prepared sugar snaps and cook, tossing occasionally, until charred in spots, about 3 to 5 minutes. Transfer back to bowl with remaining raw sugar snaps and toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: Scatter charred and raw sugar snap mixture over butterflied burrata along with crumbs. Drizzle with more olive oil, flaky sea salt. Add mint or basil leaves and serve with chiles in oil or red pepper flakes to taste."}], "link": "https://smittenkitchen.com/2019/06-burrata-with-charred-and-raw-sugar-snap-peas"}