{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/07/zucchini-quesadillas.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "gluten free, lunch, summer, summer squash, tex mex, vegetarian, zucchini", "name": "Zucchini Quesadillas", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "We stuff a lot of zucchini into 6 6-inch quesadillas here. For my family, it serves us 4, but we always eat it with salad (see the lazy slaw at the end here) and sometimes another vegetable (this would be great). It might be safer to scale it up for robust appetites. I kept the filling mild with Aleppo pepper so that my kids would eat it, but for adults, I’d definitely mince a hot pepper and cook it into the filling along with the garlic.", "totalTime": "P0DT0H35M0S", "recipeYield": "6 quesadillas", "recipeIngredient": ["3 tablespoons olive oil, plus more for frying quesadillas", "2 to 3 garlic cloves, thinly sliced", "1/2 teaspoon mild (aleppo) or hotter red pepper flakes", "1 1/2 pounds zucchini or other slim summer squash, halved and thinly sliced", "Kosher salt", "1 lime, halved", "6 ounces grated monterey jack cheese", "12 6-inch corn tortillas", "Sliced avocado, chopped fresh cilantro, additional lime, and thinly sliced jalapeno to finish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium. Once hot, add oil. Once oil is hot, add garlic and cook, stirring, until just golden at the edges, about 1 minute. Add zucchini, 1 teaspoon kosher salt, and red pepper flakes and increase heat to medium-high. Cook, turning over occasionally, until zucchini becomes soft and starts to break down, about 5 minutes. Reduce heat slightly and cook 7 to 10 minutes more, at which point the zucchini will be jammy and very tender. Taste for seasoning — I needed about 1/2 teaspoon more salt here. Add the juice of half your lime and scrape mixture into a wide bowl. Let cool slightly while you prepare any toppings or grate the cheese you probably haven’t yet, if you’re me."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cheese to zucchini mixture and mix. Lay out 6 of your tortillas and divide the filling between them, going all the way to the edges. Place remaining 6 tortillas on top. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While you could use your large skillet again, I prefer a nonstick for these quesadillas. Heat the skillet of your choice over medium and add a couple teaspoons of oil. Transfer your assembled quesadillas to the skillet and cook until deeply golden and crisp underneath, letting whatever cheese seeps out cook and crisp in the pan. Flip quesadilla(s) and repeat on second side. Try to take all of the lacy brown cheese with you when you remove your finished quesadillas from the pan. Squeeze the juice of the remaining lime half over them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve halved or in wedges with additional lime wedges, avocado, cilantro, and jalapeno."}], "link": "https://smittenkitchen.com/2019/07-zucchini-quesadillas"}