{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/05/img_0560.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "chicken, grilling, summer", "name": "Exceptional Grilled Chicken", "author": {"@type": "Person", "name": "Source: Smitten Kitchen and Gourmet, 2003"}, "description": "At the end are three vinaigrette/sauce options; I could never choose a favorite but shown here is the first one, adapted from Gourmet. Note: The chicken quantity here is relatively small; it works for our family on weeknights. You probably won’t regret doubling it, and you’ll want to double the vinaigrette/dressing you use as well. Finally, don’t have a grill? Blast your chicken in oiled, shallow baking pans a very hot oven (500 degrees) until the skin is crisp, then reduce the heat (to 400 degrees) and roast the rest of the way, about 30 to 40 minutes total cooking time.", "totalTime": "40 minutes active time", "recipeYield": "4", "recipeIngredient": ["2 quarts cold water", "2 tablespoons granulated or brown sugar", "1/4 cup Diamond kosher salt (use 2 tablespoons if any other brand)", "3 1/2 pounds chicken parts with skin and bones", "Oil for grill", "One of the three vinaigrettes, below"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brine your chicken: In a large, sealable freezer bag or container with lid, mix water, salt, and sugar. Add chicken parts and seal container or bag. Refrigerate for 1 hour and up to 6 hours. When you can’t wait any longer, remove from the brine and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make your vinaigrette: Whisk together one of the ingredient combinations below in a large bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare your grill: If using a gas grill, heat all burners to high for 10 minutes, then adjust to moderately high right before you add the chicken. If using a charcoal grill and you have room enough to do so, leave about one-quarter of grill free of charcoal and heat the rest of the charcoals until they’re grayish-white, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill your chicken: Lightly oil your grill racks. Arrange chicken on racks, cover with lid, and cook until well=browned, turning over once, about 6 to 8 minutes total for smaller parts (wings, thighs, and drumsticks) and 8 to 10 minutes for breasts. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once chicken is well-browned, if you’re using a gas grill with multiple sections, turn off the center heat and move chicken pieces onto it. If you’re using a gas grill with one heat control, reduce it to medium. If you’re using a charcoal grill and have left an area free of charcoal, move the chicken onto it. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook browned chicken, covered with lid, moving chicken around grill as needed and turning over occasionally, until cooked through, anywhere from 12 to 20 minutes (less for smaller parts, of course; gas grills tend to take longer) or until a thermometer inserted into the deepest part of your piece of chicken is 160 to 165 degrees.* "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When chicken is almost done, place lemon or lime halves, if using, cut sides down, uncovered, over lit burner until grill marks appear, about 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: Transfer chicken to bowl with vinaigrette and toss to evenly coat. You can also cover this bowl with foil to keep it warm until needed. Serve grilled chicken with grilled lemons or limes, if using, and any extra vinaigrette on the side. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[We ate this with the Vinegar Slaw with Cucumbers and Dill from my first cookbook, a forever favorite. It keeps really well should you want to stretch it over a few days.]"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About temperatures: The USDA recommends 165 degrees F, but the heat will continue to rise after you take the chicken off the grill, so I take mine off at 160 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About thermometers: A good recipe is one thing, but nothing will more quickly help you perfect any cooked meat dish, grilled or roasted, than a thermometer. For years, I somewhat resisted recommending my favorite (a Thermapen) because it was expensive; it makes sense for people who cook or develop recipes for a living. However, they released a much less expensive one a few years ago (ThermoPop), and it works just as well — I immediately bought one and often buy it as a gift. Not sponsored, but I hope that goes without saying for every single thing on this site."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Three vinaigrettes/sauces: "}], "link": "https://smittenkitchen.com/2019/05-exceptional-grilled-chicken"}