{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/12/img-8611-2.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bananas, cake, recipes, winter", "name": "Banana Toffee Cake", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "You can also bake this cake in an 8×8-inch square (I cut this into 16 small squares) or 9-inch round cake (8 to 12 wedges) single cake layer — do so for 25 to 27 minutes, until until a toothpick inserted into the cake comes out batter-free. I suspect you’re about to ask me why there is molasses and some white sugar in this cake when molasses + white sugar = brown sugar, but I feel that the white sugar keeps the cake from being too gummy and the molasses adds a slightly intense balance that brown sugar does not.", "totalTime": "P0DT1H0M0S", "recipeYield": "12", "recipeIngredient": ["1/2 cup (4 ounces or 115 grams) unsalted butter, melted and cooled slightly", "1/4 teaspoon fine sea or table salt", "1/2 cup (95 grams) packed dark brown sugar", "6 tablespoons (75 grams) granulated sugar", "1 tablespoon molasses or treacle", "1 teaspoon vanilla extract", "2 large eggs", "2/3 cup (170 grams) mashed bananas (2 medium bananas, or about 12 ounces unpeeled)", "1/2 cup (120 ml) buttermilk, well-shaken", "1 teaspoon baking powder", "3/4 teaspoon baking soda", "1 3/4 cups (230 grams) all-purpose flour", "4 tablespoons (2 ounces or 55 grams) unsalted butter, cold is fine", "1 cup (235 ml) heavy cream, divided (half for sauce, half for whipping)", "1/2 cup (95 grams) dark brown sugar", "1/4 teaspoon flaky sea salt plus more to finish", "1/2 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make cake: Heat oven to 350°F. Coat 12 standard muffin cups in butter or with nonstick spray. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together butter, salt, brown sugar, granulated sugar, molasses, and vanilla until combined. Add mashed banana and whisk again. Add eggs and whisk until incorporated, then buttermilk. Sprinkle baking soda and baking powder on batter and whisk until combined and then (don’t skip this), 10 to 20 more times, ensuring that it very well dispersed in the bowl. Add flour and mix only until it disappears. Divide batter between 12 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 14 to 16 minutes, until a toothpick inserted into the cakes comes out batter free. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cakes bake, make the toffee sauce: Combine butter, 1/2 cup of the heavy cream, and sugar in a larger saucepan than you think you’ll need over medium-high heat and bring to a simmer. Simmer, whisking frequently, for 5 to 7 minutes — the mixture thickens slightly. Add a couple pinches of salt and vanilla. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "… And whipped cream: In a medium-large clean bowl, beat remaining 1/2 cup heavy cream with an electric or you-powered whisk until it forms soft peaks. Don’t add sugar to this; I promise it does not need it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Remove one warm cake from the muffin tin and either plate it dome side-up or you can cut the dome off the cake with a serrated knife and serve the cake upside-down, as shown. (You can use the cake tops to pacify hangry people in your kitchen.) Ladle the cake generously with the toffee sauce, finish with a big dollop of the cream and a few flakes of sea salt. Repeat with remaining cakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: I find whipped cream keeps for many hours in the fridge without a problem, but if you’re worried, you can use this trick to keep it for several days. The sauce keeps for a week or two; it can be reheated in about 20 seconds in the microwave, just until it liquefies, or back on the stove in a small saucepan. The cake keeps for 3 to 4 days at room temperature in an airtight container before seeming stale to me. If you can gently rewarm it before serving, all the better. "}], "link": "https://smittenkitchen.com/2019/12-banana-toffee-cake"}