{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/05/potato-vareniki-with-pelmenista.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "dumplings, potatoes, russian, savory projects, vegetarian", "name": "Potato Vareniki", "author": {"@type": "Person", "name": "Source: Chef Bonnie Morales of Kachka and Kachinka Restaurants"}, "description": "I’m sharing one dough (which is also in the Kachka cookbook) and two filling recipes. The first filling is my way — a lightly luxurious potato mash, good enough for everyday. The second is Bonnie Morales’s recipe that didn’t make it into the Kachka cookbook. It is honestly the most luxurious bite of potato I have ever eaten. The process is cheffy: you sieve, you add eggs, there’s semolina for thickening. If you love potato vareniki and want to have the single most exquisite bite of potato vareniki that could ever cross your lips and don’t have a chef coming over to make it for you, this is the way to do it. If you’re looking for a starter potato vareniki that I promise is still miles better than anything from a store, use the simpler recipe.", "totalTime": "P0DT2H30M0S", "recipeYield": "Makes about 110 dumplings by hand or 111 to 148 in a pelmenitsa; a serving is 20 bite-sized dumplings", "recipeIngredient": ["1 1/2 pounds (680 grams) yukon gold potatoes, peeled and diced (weight is for whole potatoes)", "1 cup plus 2 tablespoons milk, any variety", "1 teaspoon kosher salt", "2 tablespoons unsalted butter", "A few grinds of black pepper", "1 1/2 pounds (680 grams) yukon gold potatoes, peeled and diced (weight is for whole potatoes)", "Whole milk, as needed", "5 tablespoons (70 grams) unsalted butter", "1 teaspoon kosher salt", "1 large egg plus 1 yolk, whisked until uniform", "5 tablespoons (55 grams) fine semolina flour", "2 teaspoons chopped fresh dill (optional)", "3 1/2 cups (450 grams) all-purpose flour, plus more for counter", "1 tablespoon kosher salt (Diamond brand, use half for any other brand)", "1 large egg", "3/4 cup plus 2 to 3 tablespoons cold water", "A combination or your choice of: Butter, plain vinegar, minced fresh dill, caramelized onions, sour cream (bonus if you find the extra-rich stuff from a Russian store). Shown up top is Kachka’s sauerkraut powder (their own recipe, dehydrated and ground) and I’d be remiss if I didn’t tell you that these are served with a caviar buerre blanc at the restaurant, the recipe is on p. 304 in the cookbook"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the simple potato filling: Place potatoes in medium saucepan and add milk and salt; milk should just barely cover the potatoes. Bring to a simmer and cook, stirring occasionally, until potatoes are cooked through, about 15 minutes. Remove from heat and add butter and a few grinds of black pepper. Mash until very smooth, adjust seasonings to taste, and set aside to cool until needed. You can hurry this along in the fridge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the luxurious potato filling: Place potatoes in medium saucepan and add as much milk as you need to cover the potatoes. Bring to a simmer and cook, stirring occasionally, until potatoes are cooked through, about 15 minutes. Strain off milk, saving 2 tablespoons, discarding the rest. Place cooked potatoes and reserved milk back in pot, add salt and butter, and use a potato masher to gently bring the ingredients together. Transfer potato mixture to a sieve and use a spoon or bowl scraper to push it through. Once potatoes are passed, let mixture cool to room temperature. Use a spatula to gently fold in egg until just combined. Add semolina and mix until uniform, trying not to overwork the mixture. Add dill, if using. Place in refrigerator until fully cooled before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dumpling dough: Combine flour and salt in a large bowl with a fork. Add half the water and the egg and use the fork to mix them into the dough. Drizzle in all but last 1 tablespoon of remaining water, mixing as you pour until dough forms shaggy clumps. Use your hands to bring the dough together inside the bowl, using the last tablespoon of water if needed. Knead it several times in the bowl before transferring it to your counter. Knead dough for 10 to 12 minutes (set a timer; don’t skimp!) until it forms a smooth, elastic dough. Return to empty bowl and cover bowl tightly with plastic wrap. Let rest at room temperature for 1 hour, which relaxes the dough and makes it easy to roll thin. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You can also make the dough in a stand mixer, using the dough hook to knead for 5 to 7 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form vareniki, both methods: Grab a spray bottle of water (or a dish of water and a pastry brush, although just your finger is sufficient for hand-formed dumplings), a rolling pin, and liberally dust a rimmed baking sheet with flour. Remove one-quarter of dough (for hand-formed dumplings) or one-sixth of dough (for pelmenitsa dumplings) from bowl, keeping the rest wrapped until needed. On a very well-floured counter (Bonnie explains that the dough will only absorb as much flour as it needs and no more, so you cannot use too much) and roll it out on a lightly floured countertop until it’s thin enough that you can see light through it if you hold it up; you should be able to roll it to the thinness of pasta dough. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form vareniki by hand: Cut out rounds of dough with a 2-inch round cutter or a drinking glass. Using two spoons, a small scoop, or a pastry bag, fill each round of dough with a blob of filling — about 1 teaspoon. Dab, brush, or mist the edges of the dough with water, then fold the round into a half-circle, pressing the edges to seal. Take the edges and pull them towards each other, pinching the corners to seal in a tortellini shape. As you shape a few dumplings, you’ll get a sense of how much filling you can stuff into each dumpling and still stretch the dough around it to seal. Transfer the shaped dumplings to your prepared baking sheet. Gather the scraps together back into the ball. Repeat with the remaining dough and filling, rerolling the scraps after they’ve rested enough that you can roll them out again. (If they resist rolling, wait 5 minutes, try again, repeating this until the scraps roll as thinly as the first round did.) I like to slide my tray of vareniki into the freezer while working on the next batch; they’re easier to move around once semi-frozen. At this point, you can cook them right away — semi-frozen or fresh — or freeze them for future use. (Freeze the rest of the way on the baking sheet so they don’t stick, then transfer to sealed bag)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form vareniki with a pelmenitsa: Drape the rolled-out dough over your pelmenitsa, so that it reaches over the ends of the mold. Press or pat the dough lightly so that an imprint of the mold below is made on the dough; this is so you know where to center the filling. With two spoons, or a pastry bag fitted with a wide tip, scoop or pipe a little blob of filling into each of the 37 divots. You’ll need just a heaping teaspoon or so in order to still be able to seal things (don’t get carried away with the amount of filling!). When you have piped filling into all the slots, roll out a second piece of dough until it’s slightly larger than your mold. Lightly spray some water over the top of your filled vareniki, or lightly brush the exposed dough with water if you don’t have a spray bottle, and then gently place the second round of dough over the top. Firmly roll over the top with your trolling pin, several times as needed, to seal the vareniki and cut the dough between them. Remove the outer trimmings that are not part of the dumplings themselves. (Depending on how thin I’ve gotten the dough, I can reuse these to make a 4th pelemenista of dumplings, hence the range in yield. Let the dough rest until it rolls easily again.) Turn the pelmenitsa upside-down over the prepared baking sheet and nudge the filled dumplings out. Don’t worry if they don’t separate right away. Slide the tray into the freezer while you repeat with the remaining dough and filling. (Once they are firm, you can easily break them apart.) You can cook them right away — semi-frozen or fresh — or freeze them for future use. (Freeze the rest of the way on the baking sheet so they don’t stick, then transfer to sealed bag)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook your vareniki: Bring a large pot of salted water to a boil. Add the dumplings, about 20 per person (or 12 to 15 if they’re larger). Adjust the heat as needed to maintain a healthy-but-not-too-vigorous boil. Add the dumplings and give it a few good stirs, making sure none stick to the bottom of the pot. Cook until the dumplings rise to the surface, and then 1 minute more (this will take 4 to 5 minutes). If you’re not sure if they’re done, you can always remove one and cut it in half — it should be hot in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish and serve: While the dumplings cook, prepare a mixing bowl to dress your dumplings. Everyone likes their vareniki a little differently but I’ve been forever converted to Bonnie’s method. For each serving, you want to place a good pat (about 2 teaspoons to 1 tablespoons) of butter and 1 to 2 teaspoons of plain vinegar in the bottom of your bowl. Add salt and pepper, if you wish. When the vareniki are done, use a large slotted spoon (this is my favorite) to transfer the dumplings, shaking off the extra water, right into the bowl. Toss! The butter will melt and come together with the vinegar from the heat of the dumplings. Keep stirring, whirling everything together until the vareniki look glossy and lightly sauced and you are astounded by your newfound cheffy skills. Transfer to individual bowls and let everyone add the finishes they wish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: The simple potato filling is good in fridge for 4 to 5 days, the luxurious one for 2 days."}], "link": "https://smittenkitchen.com/2019/05-potato-vareniki"}