{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/02/salted-peanut-tart.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "bars, photo, tarts pies", "name": "Salted Peanut Tart", "author": {"@type": "Person", "name": "Source: Smitten Kitchen, but inspired by Houseman Restaurant"}, "description": "You could also make this tart as bars! Line an 8×8-inch square baking pan with two pieces of parchment paper, each extending up two sides. Press the crust dough evenly across the bottom and 1/4-inch up the sides of this pan. Parbake at 350 (no weights or freezing required) for 15 minutes, until very pale golden. Continue with topping as written; topping baking time is the same as tart. Once cool, cut into 16 square bars.", "totalTime": "P0DT1H30M0S", "recipeYield": "8 to 10", "recipeIngredient": ["1 cup plus 2 tablespoons (150 grams) all-purpose flour", "1/4 teaspoon fine sea or table salt", "1/3 cup (40 grams) powdered sugar", "1/2 cup (4 ounces or 115 grams) unsalted butter, cold is fine, cut into a few chunks", "1/2 teaspoon vanilla extract", "4 tablespoons (2 ounces or 55 grams) unsalted butter", "2/3 cup (125 grams) packed light or dark brown sugar", "1/3 cup (110 grams) honey or golden syrup", "1/2 teaspoon apple cider vinegar (optional)", "1/2 teaspoon vanilla extract", "2 large eggs", "2 cups (about 10 ounces or 285 grams) salted peanuts", "Flaky sea salt and plain sour cream to finish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350°F (175°C). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: Combine the flour, salt, and sugar in the bowl of a food processor. Add butter and vanilla to the bowl, then run the machine until the mixture forms large clumps — just keep running it; it might take another 30 seconds for it to come together, but it will. Set a marble or two of dough aside, and transfer the rest of it to a 9-inch round tart pan with a removable bottom set on a large baking sheet (for drips and stability of use) and press the dough evenly across the bottom and up the sides. Transfer to freezer for 15 minutes, until solid. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Parbake crust: Once firm, prick all over with a fork. Coat a piece of foil with nonstick spray, and press it oiled-side-down tightly against the frozen crust, so it is fully molded to the shape. Bake tart with foil (no pie weights needed) for 15 minutes, then carefully, gently, a little at a time, peel back foil and discard. If cracks have formed, use the marbles of dough you set aside to patch it. Return to oven for 5 minutes, until just barely golden at edges and dry to the touch. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make filling: In a medium saucepan, melt butter over medium heat and continue cooking it, stirring frequently, until it smells nutty and brown bits form at the bottom of the pot. Whisk in brown sugar and golden syrup or honey and cook at a simmer, whisking constantly, for one minute. Pour into a large bowl, scraping out all of the browned bits from the pot that you can, and place in the fridge or, as I did, on your very cold patio, for (updated to suggest less time as per comment responses) a few minutes, until it has cooled somewhat. Whisk in apple cider vinegar (with cuts the sweetness and adds complexity, not a vinegary flavor, promise), vanilla, and eggs, one at a time, then stir in peanuts. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake tart: Pour filling into prepared tart shell, top with a little flaky salt, if you wish, and bake for 23 to 28 minutes, until just faintly jiggly in the center and golden brown all over. Cool on a rack to room temperature, or, like me, you can rush this along in the fridge, but don’t let it fully chill. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve: Decorate (if you wish) with powdered sugar. Serve in wedges at room temperature (not cold, which can be too firm) with a dollop of sour cream."}], "link": "https://smittenkitchen.com/2019/02-salted-peanut-tart"}