{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/10/skillet-ravioli-with-spinach.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, budget, pasta, quick, recipes, spinach, vegetarian, weeknight favorite", "name": "Skillet Ravioli with Spinach", "author": {"@type": "Person", "name": "Source: Inspired by a dish by Theodora Kaloudis on Marley Spoon"}, "description": "", "totalTime": "P0DT0H15M0S", "recipeYield": "4", "recipeIngredient": ["1 tablespoon olive oil", "2 large garlic cloves, chopped", "5 ounces baby spinach (from a salad-ready container)", "Salt and freshly ground black pepper or red pepper flakes", "18 ounces refrigerated or frozen ravioli", "1/2 cup grated parmesan", "6 tablespoons mascarpone cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "\nHeat broiler with a rack about 6 inches from the heat source, if you can make adjustments."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In medium-large (mine is 10 inches) ovenproof skillet over medium-high heat, heat oil and add garlic. Cook until garlic is barely golden, about 30 seconds to 1 minute. Add spinach and few pinches of salt, and cook until spinach is wilted, about 3 to 4 minutes. Season to taste. Use tongs or a spoon to transfer garlic and spinach to a bowl. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cold ravioli and 1/2 cup water, and a few more pinches of salt in the skillet and bring to a boil over high, then reduce heat to medium. Place a lid (any lid will do) on top and let steam for 3 to 5 minutes (the longer time for frozen). Check a piece of ravioli to see that it’s heated through and tender. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the mascarpone in tiny dollops around the ravioli, which is very fragile right now and doesn’t like to be moved a lot, but give it a gentle turn or two. Season with salt and pepper. Add the spinach back, and do the same. Sprinkle the top of the pan with parmesan and broil until the ravioli are browned in places, anywhere from 3 to 6 minutes, depending on how robust your broiler is. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Eat right away. Leave leftovers in skillet and rewarm in oven."}], "link": "https://smittenkitchen.com/2019/10-skillet-ravioli-with-spinach"}