{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/06/simplest-spaghetti-al-limone.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, budget, italian, lemon, pasta, quick, recipes, summer, vegetarian", "name": "Simplest Spaghetti al Limone", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "I am usually no fan of Microplane (specifically Microplane rasp-ed) parmesan. I find it fluffy and weightless. I prefer my parmesan with more bite, gravitas. But here, it’s the very best way to go, rendering parmesan so fine that merely a whisk will turn it into a sauce. Plus, you’ll already be using it for the lemon zest, right? If you don’t have one, use the tiniest holes on a box grater. You can also use the food processor method we do in the cacio e pepe, blending it to a as-smooth-as-possible paste in the machine before returning it to the bowl where the pasta will go.", "totalTime": "P0DT0H15M0S", "recipeYield": "2 to 3", "recipeIngredient": ["Coarse salt", "1/2 pound (8 ounces or 225 grams) dried spaghetti", "1 lemon", "3 1/2 ounces (100 grams) parmesan cheese", "Freshly ground black pepper", "3 tablespoons (45 ml) olive oil", "Fresh basil leaves, torn"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the spaghetti in well-salted water according to package directions. While it boils, finely grate (with a rasp-style grater; here’s the most common one but I prefer this size) the zest of half your lemon into the large bowl you’ll use to serve your dish. Add the juice of the whole lemon (about 4 tablespoons). Use the same rasp to grate the parmesan on top. Add olive oil, about 1/2 teaspoon salt (and more to taste), and several grinds of black pepper and combine them with a whisk until very well mixed and as smooth as possible. When the pasta reaches the ideal texture, scoop out 1 cup of cooking water, set it aside, and drain the rest. Quickly turn piping hot spaghetti to lemon-parmesan mixture in bowl and use tongs or spoons to toss it until all of the strands are coated. Don’t worry if the mixture seems too thick or sticky — first get the strands as evenly coated as possible. Add reserved pasta water, a tiny splash (about 1 to 2 tablespoons) at a time, tossing the whole time, only until the spaghetti looks glossy and lightly sauced, but no so much that you “wash” the sauce off the pasta. You might only need a single splash to achieve this. Add basil leaves and toss to combine, then serve. If you finish each serving with a little extra olive oil, salt, pepper, and parmesan, you’ll be glad you did. "}], "link": "https://smittenkitchen.com/2019/06-simplest-spaghetti-al-limone"}