{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/01/plush-coconut-cake-vegan.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, coconut, dairy free, everyday cakes, photo, vegan", "name": "Plush Coconut Cake", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "This, as written, is fantastic everyday or snack cake with a simple glaze and [updated to note] a mild coconut flavor, but I could totally see it getting ready for a party as a two-layer cake. I bet it would be a gorgeous confetti cake, too. If you’re not deeply into coconut, use a flavorless oil or vegan butter instead of coconut oil and then soy, almond, or oat milk instead of canned coconut milk to give you a more neutral launchpad for other flavor combinations. I can’t wait to see what you come up with.", "totalTime": "P0DT0H40M0S", "recipeYield": "8 to 12", "recipeIngredient": ["2 cups plus 3 tablespoons (285 grams) all-purpose flour", "1 1/2 teaspoons baking soda", "1/2 teaspoon fine sea salt", "1 cup (200 grams) granulated sugar", "1/2 cup (110 grams) coconut oil, warmed just enough to liquefy", "1 1/2 cups full- or low-fat coconut milk (see Note)", "1 tablespoon (15 ml) plain vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees F. Line the bottom of 9-inch round cake pan with a fitted round of parchment paper and coat the bottoms and sides with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together flour, baking soda, salt and granulated sugar in the bottom of a large mixing bowl. Add coconut oil, coconut milk, and vinegar and whisk until batter is smooth. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour into prepared pan. Bake for 25 to 30 minutes [updated to note: it’s sounding in the comments like it’s taking some people a bit longer — it’s not done until the center is set, even if it’s longer than it took me], or until the top is springy and a tester inserted in the center comes out batter-free. Cool the cake in the pan on a wire rack for 10 minutes, then cut around it with a knife to ensure it is loosened and flip it out onto a cooling rack to cool the rest of the way."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you wish to make a glaze: Whisk together 3/4 cup powdered sugar with 1 to 2 tablespoons of the leftover coconut milk, adding a little at a time, until it is smooth but not too runny. Add a pinch of salt, if you wish. Once cake is fully cool, spread over the top of the cake and smooth to the edges with a knife or small offset spatula, where it will find its way down the sides decoratively on its own. I added some white confetti sprinkles, but toasted coconut chips would be nice here too."}], "link": "https://smittenkitchen.com/2019/01-plush-coconut-cake"}