{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/12/unfussy-sugar-cookies.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cookie, recipes", "name": "Unfussy Sugar Cookies", "author": {"@type": "Person", "name": "Source: Bake at 350 (cookies) + Smitten Kitchen (technique)"}, "description": "The cookie recipe (ingredient list) is adapted from the one I’ve been using as long as I’ve known about it and a cult favorite on the internet, from the wonderful Bake at 350 blog. What I like about them is that they crisp without being being unpleasantly crunchy or dry, and they hold shapes nicely when baked, and they don’t forget the salt. The original recipe calls for salted butter; should you only have unsalted, add 1/2 teaspoon fine sea or table salt. However, the process (immediate roll out, no flour, etc.) is just the way I prefer to make — unfussy and very doable. The icing recipe makes enough to coat the cookies as shown, but you might need extra if your designs are thicker or more elaborate.", "totalTime": "P0DT2H0M0S", "recipeYield": "About 80 1.5-inch cookies", "recipeIngredient": ["3 cups (390 grams) all-purpose flour", "1/2 teaspoon fine sea or table salt (if using unsalted butter only)", "2 teaspoons baking powder", "1 cup (200 grams) granulated sugar", "1 cup (8 ounces or 225 grams) salted or unsalted butter", "1 large egg", "1 teaspoon (5 ml) vanilla extract", "1 large egg white, ideally pasteurized (or use meringue or egg white powder as per label instructions)", "1 1/4 cups (150 grams) powdered sugar", "Pinch of salt", "A few drops of a flavoring of your choice (optional) (lemon, almond, vanilla)", "Food coloring and sprinkles, as you wish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cookies in a food processor: Combine flour, salt (if butter is unsalted), baking powder, and sugar in a large bowl or the work bowl of your machine, whisking to combine well. Cut butter into small cubes and add to dry ingredients. Run the machine, scraping down as needed, until the butter fully disappears into the flour mixture, which will look sandy and clump easily between your fingertips. Add the egg and vanilla and run the machine until it blends into an even cookie dough, scraping down a few times to make sure it mixes evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cookies with a stand or hand mixer: Combine sugar and salt (if butter is unsalted) in a large bowl or the bowl of your mixer. (The order here is different because the butter takes longer to soften, longer than we want to beat the flour for.) Cut butter into small cubes and add to the sugar mixture and beat with the paddle or beater attachments until the butter and sugar are an even, soft texture — you’ll want to scrape down the bowl a few times and be patient, especially with a hand mixer, but once the two are combined, no need to beat further (until fluffy) as you would with other cookie recipes. Add egg and vanilla and beat until evenly combined, scraping down bowl. Add baking powder and beat it an additional 30 seconds beyond what is needed to make the baking powder disappear (we want to disperse it extremely well). Add flour and mix only until it disappears."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Both methods: Divide dough in half and (edited to add) if it’s in loose chunks, gently knead it together into one mass on a sheet of parchment paper. Place a second sheet of parchment paper over the dough and roll each dough half between 2 large pieces of parchment paper into your desired thickness — I like these the most in the 3/16- to 1/4-inch range (link to the optional spacers I’m using at the end), the thinner one is shown in the final cookies. Slide each parchment-and-cookie-dough slab onto the back of a baking sheet, thin tray, or thin cutting board and place in freezer for 15 to 20 minutes, until solid. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven: To 350 degrees F."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape cookies: Carefully remove top sheet of parchment paper from first cookie dough slab and place the side that touched the dough down on a large baking sheet. Cut cookies into your desired shape. Here I’m using a fluted pastry wheel (link at end) to cut the cookies into 1.5-inch squares. Peel each cookie off the bottom sheet of parchment (this should be easy if they’re still frozen; if they’re not, return the slab to the freezer for 3 to 5 more minutes) and arrange on baking sheet with 2 inches between them. Repeat with remaining slab of cookie dough. If you have any dough to reroll, do it again between two sheets of parchment paper and freeze this slab until solid again before cutting into it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cookies: Until they are a light golden brown at the edges (if there’s no color, there’s little flavor), rotating trays once while baking to ensure even baking, about 10 to 12 minutes. Thinner and smaller cookies are done faster; larger ones will take longer, of course. Use cookie color as your guide, however, not the timer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cookies set for one minute on the tray after removing from the oven then transfer to a cooling rack to let the cookies cool completely. It’s not like this takes very long inside, but I’m impatient and put them outside when the weather permits. You can stop right here — look how fast you made cookies! you’re a wizard! — or you can decorate them… "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the icing: Whisk your egg white (or substitute reconstituted from egg white or meringue powder) in a large bowl until loose and frothy. Add salt and 1 cup of powdered sugar, beating until smooth. Add flavorings, if desired, and last 1/4 cup of sugar — it’s pretty stiff at this point, which is how you want it. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Decorate cookies as shown here: To dip your cookies, scrape half of icing into wide bowl. Add water, 1/4 teaspoon at a time (a little goes a long way) to thin the frosting until it can thinly but mostly opaquely coat a dipped cookie. Skim the top of each cookie in the frosting, using a knife, spatula, or your finger (I won’t tell) to catch any drips before you flip it over. Arrange back on parchment-lined baking sheet to set completely. Once again, I tend to rush this outside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the remaining, thicker half of your icing into a sandwich or freezer bag, cut the tiniest nip off the corner of the bag, and pipe designs of your choice on top. If you’re adding sprinkles, do so every 3 to 4 cookies or the icing will begin set and the sprinkles won’t adhere. Let them set until completely solid, anywhere from 30 minutes to 2 hours, depending on how thick the piping is. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Store: Iced, set cookies will keep for weeks in an airtight container at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tools: I have this food processor, this stand mixer, and this handmixer, although the latter is not my favorite. I find these two brands of parchment paper to be the most reliable/least sticky but of course haven’t tried them all. I’m using this pastry wheel. I am using these thick rulers to make rolling even slabs of dough really easy, but this is probably better, or you might just prefer rolling pin bands. If you don’t want to use a raw, pasteurized egg white, meringue powder is a wonderful thing. I’m using this pearly sanding sugar to decorate and can’t find dragees as tiny as I have online (think: large poppy seeds) but I’d buy these stars or this mixed sprinkle set in a heartbeat as an alternative. As always, nothing here is sponsored, I just hoped it would be easier to put all the links in one place vs. scattered throughout the comments as people ask."}], "link": "https://smittenkitchen.com/2019/12-unfussy-sugar-cookies"}