{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/05/braised-ginger-meatballs-in-coconut-broth.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "dairy free, meat, photo, pork meat, soup, thai", "name": "Braised Ginger Meatballs in Coconut Broth", "author": {"@type": "Person", "name": "Source: Adapted from Food & Wine"}, "description": "I’ve made these before with a mixture of chicken and pork and it works just fine. If you can find it, one stalk of lemongrass, outer leaves removed and cut into 1-inch lengths, is a great addition here; add it with the ginger and garlic to the broth and remove it at the same time. I always add a bit of greens to this recipe. Baby spinach is the quickest. Since it’s May, thinly sliced asparagus or trimmed asparagus in 1-inch segments would be wonderful. Add chiles to taste; two are called for. I often just put a few slices in (because: kids), and then marinate the rest in a little vinegar, setting them out to be spooned on top by those who want more heat.", "totalTime": "P0DT0H45M0S", "recipeYield": "6", "recipeIngredient": ["2 pounds ground pork", "2 large eggs", "3 tablespoons panko breadcrumbs", "2 tablespoons finely chopped peeled fresh ginger", "2 garlic cloves, minced", "1 tablespoon fish sauce", "2 teaspoons kosher salt", "One 13 1/2-ounce can unsweetened coconut milk", "2 cups chicken stock or low-sodium broth", "1/4 cup thinly sliced peeled fresh ginger", "2 garlic cloves, thinly sliced", "2 fresh red chiles, thinly sliced, plus extra for serving  (see Note)", "Finely grated zest and juice of 1/2 lime", "1 tablespoon fish sauce", "1 teaspoon ground turmeric", "1/2 teaspoon granulated sugar", "Kosher salt", "A few handfuls of baby spinach", "Roughly chopped fresh mint and cilantro leaves", "Additional lime wedges", "Steamed jasmine rice (I estimate about 1/4 cup cooked per serving)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meatballs: Preheat your oven to 425°. Combine all of the ingredients in a large bowl; I like to do so with a fork or potato masher. Form the mixture into 1 1/2-inch meatballs (I used this scoop) and arrange them on a large rimmed baking sheet about \u20281-inch apart. Bake until the meatballs are golden brown and just cooked through, about 12 to 14 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the broth: In a large, ideally wide, saucepan, combine the coconut milk, stock, ginger, garlic, chiles (to taste), lime zest and juice, fish sauce, turmeric, and sugar. Bring to a boil over high heat, then reduce the heat so the broth is simmering. Simmer 10 minutes, until the flavors are infused into the broth. You can leave everything in, but I like to remove everything with a skimmer for a smooth broth. Season to taste, if needed, with salt. \u2029Add the meatballs to the broth, return to a simmer, cover, and simmer until cooked through and tender, about 10 to 15 more minutes. Add spinach and cook just to wilt. Season the broth with more sugar, salt and lime juice if necessary. Serve with herbs, additional chiles, lime wedges, and rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do Ahead: The uncooked meatballs can be refrigerated on a baking sheet for up to one day. The broth can also be prepared in advanced; it will keep for three days."}], "link": "https://smittenkitchen.com/2019/05-braised-ginger-meatballs-in-coconut-broth"}