{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/08/ultimate-zucchini-bread.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "cake, everyday cakes, muffin, summer, zucchini", "name": "Ultimate Zucchini Bread", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "", "totalTime": "1 hour 20 minutes, plus overnight cooling", "recipeYield": "8 to 10", "recipeIngredient": ["2 cups (13 ounces or 370 grams) grated, packed zucchini, not wrung out, grated on the large holes of a box grater", "2 large eggs", "2/3 cup (160 ml) of a neutral oil (I use safflower), olive oil, or melted unsalted butter", "1/2 cup (95 grams) packed dark brown sugar", "1/2 cup (100 grams) granulated sugar", "1 teaspoon vanilla extract", "1 teaspoon fine sea or table salt", "1 1/4 teaspoons ground cinnamon", "1/8 teaspoon ground or freshly grated nutmeg", "3/4 teaspoon baking soda", "1/2 teaspoon baking powder", "2 cups (260 grams) all-purpose flour", "2 tablespoons (25 grams) raw or turbinado sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees F. Lightly coat a 6-cup or 9×5-inch loaf pan with nonstick spray. Place grated zucchini in a large bowl and add oil, eggs, sugars, vanilla, and salt. Use a fork to mix until combined. Sprinkle cinnamon, nutmeg, baking soda, and baking powder over surface of batter and mix until combined — and then, for extra security that the ingredients are well-dispersed, give it 10 extra stirs. Add flour and mix until just combined. Pour into prepared loaf pan and smooth the top. Sprinkle with the raw or turbinado sugar — don’t skimp. Bake for 55 to 60 minutes, until a toothpick or tester inserted into the middle cake but also into the top of the cake, closer to the dome, comes out batter-free. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool completely in the pan. Leave in pan, unwrapped, overnight or 24 hours, until removing (carefully, so not to ruin flaky lid) and serving in slices. Zucchini bread keeps for 4 to 5 days at room temperature. I wrap only the cut end of the cake in foil, and return it to the baking pan, leaving the top exposed so that it stays crunchy."}], "link": "https://smittenkitchen.com/2019/08-ultimate-zucchini-bread"}