{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/04/toasted-pecan-cake.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "brown butter, cake, gluten free, passover, photo", "name": "Toasted Pecan Cake", "author": {"@type": "Person", "name": "Source: Adapted liberally from Joan Nathan via the NYT"}, "description": "I don’t have cup measurement for pecans or pecan meal because it’s just too inconsistent. (Every cup of nuts will weight something different depending on size and how many are broken and nut meal is even more inconsistent as you can just pack and pack it, the weight getting higher and higher.) I don’t want to mess this cake up for you with estimates. If you don’t have a scale, please simply buy 1 pound (455 grams) and do your best to estimate what removing 1/16 would look like (picture: 1/4, then 1/4 of that removed). Even if you’re a smidge off, it will still be more accurate than cups here. ", "totalTime": "70 to 85 minutes", "recipeYield": "8, generously", "recipeIngredient": ["15 ounces (420 grams) whole or chopped pecans, or pecan meal/flour", "1 cup (200 grams) granulated sugar", "9 tablespoons (130 grams) unsalted butter, plus additional for pan", "7 large eggs, separated", "1 teaspoon kosher salt", "1 1/2 teaspoons vanilla extract or the seeds from half a bean", "Whipped cream and berries, for garnish, if you wish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven: To 350 degrees F. Oil or butter a 9-inch round pan and set aside. I lined mine with parchment for easier removal. While I don’t expect it to stick much if you don’t use parchment, I always think we’re better safe than sorry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’re starting with whole or chopped pecans, toast them: Spread nuts in one layer on a sheet tray. Toast for 10 minutes, tossing once midway so that they cook evenly. They should smell nutty and appear one shade darker. Let them cool completely before using. You can hasten this along in the fridge or freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind your pecans: Once they’re cool, grind the nuts with sugar and salt in a food processor or high-speed blender until finely chopped, but stop before they seem to glue together (i.e. become a nut butter). Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brown your butter: In a medium saucepan, melt butter over medium heat. It will melt, then foam, then turn clear golden and finally start to turn brown and smell nutty. Stir occasionally, then frequently as it begins to take on color, scraping up any bits from the bottom as you do. Don’t take your eyes off the pot as while you may be impatient for it to start browning, the period between the time the butter begins to take on color and the point where it burns is often less than a minute. As soon as the butter takes on a nutty color and smell, remove from heat and pour into a large bowl to cool. You can hasten this along in the fridge or freezer, but keep an eye on it in the freezer especially, as you don’t want it solidified."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat egg whites: Until they form stiff peaks, but not beyond this point, when they might seem to have a dry and crumbly foam. Set them aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At last, assemble the cake batter: Add egg yolks and vanilla to the cooled browned butter in the large bowl and whisk until thoroughly combined. Stir in pecan-sugar-salt mixture, or, if you’re starting with pecan meal/flour, stir it in along with the granulated sugar and salt. The batter will be very thick. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/3 of the whipped egg whites and stir to combine; this will help loosen the batter so it’s easier to add the remaining whites. Add the remaining egg whites and gently, carefully fold them into the pecan mixture, trying not to deflate the egg whites. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour into prepared cake pan and smooth top. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake: Until a toothpick inserted into the center comes out clean, about 35 to 40 minutes. Allow to cool for 10 minutes in the pan, then remove from the pan and let finish cooling on a rack. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: I swirled mine with 1 cup of heavy cream plus 2 tablespoons granulated sugar and 1 teaspoon vanilla extract, softly whipped, and piled it with berries and a few chopped pecans. It could also be finished simply, with just a dusting of powdered sugar. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: Cake keeps for 5 to 6 days in the fridge. Without cream, it doesn’t need to be refrigerated, but if you’d like to have it more than 3 days, I think it less prone to going bad if chilled."}], "link": "https://smittenkitchen.com/2019/04-toasted-pecan-cake"}