{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/03/perfect-spaghetti-and-meatballs.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "italian, meat, pasta, photo", "name": "Perfect Meatballs and Spaghetti", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "There’s actually a lot flexibility in the meatballs. A blend of pork, beef, and veal is traditional. I usually go half-half with the first two, but I’ve also made these entirely with ground turkey (a mix with dark meat it in is much better) and they’re a little softer (you could use a tablespoon less milk) but taste delicious. You can skip the parmesan and replace the milk with water if you want to make it dairy-free. You could use ricotta instead of milk for extra richness. You could add finely chopped prosciutto to the meat mixture, or even use ground sausage meat for half of the meat mixture. You can use 1 tablespoon finely grated onion instead of onion powder, and you could make your own breadcrumbs from any old piece of bread and grinding it up — use 2/3 cup instead of 1/2.", "totalTime": "P0DT0H50M0S", "recipeYield": "4 and up to 6 with sides", "recipeIngredient": ["1 pound ground meat (see note up top for suggestions)", "1/2 cup panko-style breadcrumbs", "1/3 cup milk, any kind", "2 tablespoon finely chopped parsley, plus more to serve", "2 tablespoons finely grated parmesan or pecorino romano cheese, plus more to serve", "2 teaspoons coarse or kosher salt, divided", "Red pepper flakes and/or freshly ground black pepper", "1/2 teaspoon onion powder", "2 large eggs", "3 garlic cloves, minced, divided", "2 tablespoons olive oil", "1 28-ounce can of crushed tomatoes", "1 pound dried spaghetti"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of very well-salted water to boil and heat your oven to 425 degrees F. Line a large baking sheet with foil for easy cleanup, and coat it lightly with a nonstick spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place meat, crumbs, milk, parsley, cheese, 1 teaspoon salt, pepper, onion powder, eggs, and one-third of your minced garlic in a large bowl, and mash everything together with a fork or potato masher until evenly mixed. Using wet hands if needed, form mixture into 2-inch meatballs (I used a 3 tablespoon scoop) and arrange on prepared tray. Roast for 12 minutes, until cooked through (you can cut one in half). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once water is boiling, cook spaghetti until one minute shy of tender. Set aside 1 cup of cooking water before draining pasta. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep saute pan or wide saucepan, heat 2 tablespoons olive oil over medium heat. Add remaining two-thirds of garlic and a pinch or two of pepper flakes and let sizzle until garlic is golden, 30 seconds to 1 minute. Add tomatoes (beware the spatter!) and season with remaining 1 teaspoon salt. Let mixture simmer for about 5 minutes, stirring occasionally, although longer will do it no harm if your meatballs aren’t ready yet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meatballs come out of the oven, add them to the sauce and stir so they are coated. Reduce heat to a low simmer, put a lid on the pot, and simmer meatballs in the sauce for 10 minutes. At this point, should you not be eating them right away, you can remove them from the heat and set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to serve: Return your spaghetti to its empty cooking pot. Push meatballs aside and grab a few ladles of their cooking sauce and pour over spaghetti. Add half of reserved pasta water and cook spaghetti and sauce over high heat for one minute, tossing the whole time. Use additional pasta water as needed to loosen. Use tongs to transfer spaghetti into a large, wide serving bowl. (If you give the bowl a little spin as you lower the spaghetti into it, you can make cute little piles.) Add the meatballs and their sauce on top. Garnish with parsley and additional grated cheese. Eat right now; do not wait."}], "link": "https://smittenkitchen.com/2019/03-perfect-meatballs-and-spaghetti"}