{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2019/03/extra-flaky-pie-crust-1.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "recipes, tarts pies", "name": "Extra-Flaky Pie Crust", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "Previously, my pie dough rules were: use all butter (it’s very flaky if used well, and tasty too), keep everything cold, use a pastry blender, work the butter into the flour until the largest bits are the size of small peas, and only use enough water to pull the dough together. I am still loyal to all-butter crusts, but I’ve come around to mixing your dough with your fingers (with a satisfying squash of each cube, although I’m never giving up my pastry blender), I’ve added a little folding to the rolling-out steps, which improves structure and increases the expansion of flaky layer, and that with this, you can get away with leaving the butter in larger, lima bean-sized pieces. Finally, I actually get the dough pretty damp — you’ll be sure it’s too soft and sticky, but I promise, it’s not — and it’s not a problem at all. In fact, because we’re using a higher proportion of butter in this dough, and butter is very hard when it’s cold, I find that this extra moisture makes what would otherwise be a very firm dough easier to roll.", "totalTime": "15 minutes prep, 1 to 2 hours to chill", "recipeYield": "For one standard double-crust pie, two single-crust pies, or this lattice-slab shown here", "recipeIngredient": ["2 cups (260 grams) all-purpose flour", "1 tablespoon (15 grams) granulated sugar", "3/4 teaspoon fine sea or table salt", "1 cup (230 grams, 8 ounces, or 16 tablespoons) cold, unsalted butter", "1/2 cup (120 grams) very cold water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place your flour, sugar, and salt in a large bowl and whisk to combine. Cut your butter into small cubes (1/2-inch is ideal here) and add them into the flour mixture. Toss them around so that they’re coated and used your fingers to squash each butter cube into flatter, lima-bean like pieces. It’s totally fine if this is bigger than you’re used to. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[You could also use a pastry blender, stand mixer, or a food processor, but go very easy on it, especially the food processor — you want flat-ish, lima bean-sized pieces of butter, not the usual “coarse meal” or “small pea-sized” mixture. If using a food processor, when you’re done, dump this butter-flour mixture into a large bowl before continuing.] "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour water over butter-flour mixture and use a flexible silicone spatula or scraper to bring it together into a dough that will seem too wet and sticky, but will be just fine. Divide dough into two parts, and wrap each half into flat-ish packets wrapped in plastic, waxed or parchment paper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill in the fridge until firm — one to two hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap first packet of dough, place on a well-floured counter, sprinkle the top generously with flour, and roll it out into a thick-ish long rectangle. Brush off excess flour off dough with your hands and fold it as you would a business letter, into thirds. Continue to roll this packet into the shape needed for your final pie — shown here 10×15-inch, but a 14-inch round is the usual size for a standard pie crust. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "From here, you’ll want to follow the instructions for the pie you’re making. Looking for ideas? Start here!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A fun breakfast pastry I only made to showcase this awesome pie crust but actually ended up abundantly flaky and just a little sweet: Heat oven to 425 degrees F. Mix 4 cups sliced rhubarb (here about 1/4-inch thick), 3 tablespoons tapioca starch, 1/3 cup granulated sugar, a pinch of salt, a pinch of ginger, and the juice of half a lemon. Roll both pie dough halves into 10×15-inch rectangles; keep them firm and cool in the fridge while not using them, especially if they’ve gotten soft or your kitchen is hot. Place first half on a parchment-lined baking sheet. Spoon filling on, leaving a 1.5-inch border. Cut second dough into on the diagonal into strips, whatever width you’d like. Lay every other strip over rhubarb filling in one angled direction. Form a lattice with remaining strips in the opposite direction. Trim strips so that they’re flush with bottom crust area. Fold crust over the lattice top and filling all around the pie, crimping to tighten the seal. Brush with an egg wash (1 egg, beaten lightly with 1 teaspoon water) and sprinkle with coarse or raw sugar. Bake for about 25 minutes, until golden all over. Let cool to warm before cutting into squares."}], "link": "https://smittenkitchen.com/2019/03-extra-flaky-pie-crust"}