{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2020/01/roasted-squash-and-tofu-with-ginger.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "gluten free, vegan, vegetarian, winter squash", "name": "Roasted Squash and Tofu with Ginger and Garlic", "author": {"@type": "Person", "name": "Source: Diana Henry's From the Oven to the Table"}, "description": "The book focuses on what we’d call sheet pan meals but large sheet pans aren’t as much of a thing across the pond, but roasting dishes (a little smaller) are. Nevertheless, I tried to squeeze this onto one large (half-sheet) pan vs. the two baking dishes she suggests in the book and my tofu didn’t come out very crisp. If this doesn’t bother you, squeeze away.", "totalTime": "P0DT0H45M0S", "recipeYield": "2 to 4", "recipeIngredient": ["14-ounce package extra-firm tofu", "2 pounds winter squash (such as kabocha or acorn)", "3 tablespoons honey or brown sugar (see Note)", "1/3 cup soy sauce (see Note)", "1/2 to 2 teaspoons crushed red pepper flakes, or to taste", "1-inch piece fresh ginger, peeled and finely grated", "7 tablespoons vegetable or peanut oil, divided", "Kosher salt and freshly ground black pepper", "6 garlic cloves, very thinly sliced", "1 tablespoon toasted sesame seeds", "2 scallions, trimmed and thinly sliced on the diagonal", "Juice of half a lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain your tofu and remove as much water as you can: There are two easy ways to ensure your tofu gets as crisp as possible, but the first requires advanced planning. 1. The first is one that a dear reader has been pressing (get it? sorry) me/us to try for years: freezing it. You can freeze your tofu as soon as you get it home, still in the package, or already drained. Once defrosted, it easily shakes off all of its water (you’ll want to blot it though) and even has a lovely texture. But, this requires a little more planning. 2. The second is a little faster, but some say less effective: place your block of on a few layers of paper towel with more towels over it (and even a tray or plate on top to weight it) and to set aside for 5 minutes, or until needed. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your oven: To 400°F. Cover 1 to 2 baking sheets with parchment paper for easy cleanup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare tofu and vegetables: Cut tofu into 1/2-inch slices, and then in half again. Halve and seed your squash — I like to remove the seeds with a metal soup spoon, which makes it much easier to get it clean. Cut squash into 1/2 to 3/4-inch thick wedges. If using two pans, you can arrange the squash on one and the tofu on another. If using one, try to puzzle them together as I do above; it will be more snug."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the honey or sugar, soy sauce, pepper flakes (to taste), ginger, and 4 tablespoons of the oil. If using two pans, pour 2/3 of the marinade over the squash and 1/3 over the tofu, and turn each slice of squash over gently to coat on both sides. If using only one, use all the marinade, coating the squash and tofu together. In all cases, season the squash and tofu with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook: Roast for 15 minutes, then using a thin metal spatula (this is my favorite), turn the squash and tofu chunks over. In a small bowl, combine the remaining 3 tablespoons oil with the garlic and spoon this all over the squash and tofu. Return pan(s) to the oven and roast until the tofu is dark and the squash is completely tender, 10 to 15 more minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve: Directly from the pan(s) or arranged on a serving plate. Scatter with sesame seeds and scallions, and squeeze lime juice over."}], "link": "https://smittenkitchen.com/2020/01-roasted-squash-and-tofu-with-ginger"}