{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2020/02/2020-01-30-03.54.22-2.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "celebration cakes, wedding cake", "name": "New Classic Celebration Cake", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "This a 3-layer 9-inch celebration cake — not a wedding cake tier, which would be taller. (We will get to scaling it up for a wedding at the end.) This is for birthdays and anniversaries and anything else worth celebrating on a smaller scale, like how awesome you are. The cake will be just over 3 inches tall without flowers, and 3.5 inches with them. The cake layers are a generous 3/4 inch tall. The salted caramel makes 1 1/3 cups of sauce but you will only need 1/2 cup per 9-inch layer, so 1 cup total as shown. The frosting yields 6 cups. You’ll need 4 to 4 1/2 cups to coat the top and sides, and for a thin layer around and under the salted caramel as a barrier, leaving you a generous 1 1/2 to 2 cups to decorate. (Don’t need to decorate? Simply make 2/3 of the frosting recipe below.) The German buttercream (whipped vanilla bean custard) frosting is adapted and simplified from Stella Parks (Serious Eats) and Erin Clarkson (Cloudy Kitchen). A more detailed description of each recipe element is above.", "totalTime": "2 hours plus cooling time", "recipeYield": "12 to 16", "recipeIngredient": ["1 cup (8 ounces or 225 grams) unsalted butter", "2 tablespoons powdered milk", "1 3/4 cups (350 grams) granulated sugar", "1 teaspoon fine sea salt", "1/2 teaspoon baking soda", "4 teaspoons baking powder", "2 3/4 cups (360 grams) all-purpose flour", "2 large eggs", "2 cups (475 ml) buttermilk, well shaken", "1 tablespoon (15 ml) vanilla extract", "1 cup (200 grams) granulated sugar", "6 tablespoons (3 ounces or 85 grams) salted butter, in 1T slices", "1/2 cup plus 2 tablespoons (135 grams) heavy cream, cold is fine", "Sea salt flakes, for assembly", "1 cup plus 2 tablespoons (225 grams) granulated sugar", "1/3 cup (45 grams) cornstarch", "1/4 + 1/8 teaspoon fine sea salt", "3 large eggs, cold is fine", "1 1/2 cups milk (355 ml), whole or low-fat, cold is fine", "1 tablespoon vanilla bean paste or the seeds from 1 large vanilla bean", "1 tablespoon (15 ml) vanilla extract", "1 1/4 pounds (20 ounces, 2 1/2 cups, or 570 grams) unsalted butter, slightly cooler than room temperature (firm-soft, not mushy)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the brown butter cake layers: "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven: To 325 degrees F. Coat 3 9-inch cake pans with nonstick spray and line the bottoms with a fitted circle of parchment paper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Don’t have three? Don’t fret. I found no noticeable loss in cake quality when baking the layers one after the other, but you will need to divide you batter evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brown the butter: Melt butter in a deep skillet or wide saucepan (I’ve been using this white coated one, which makes the color change easier to see) over medium/medium-high heat. Once melted, keep cooking the butter, stirring, until faint golden specks of brown appear at the edges and in the pan, then add the powdered milk. It will get lumpy; do your best to smash the lumps, don’t worry, though, we will get rid of any stubborn ones later. Remove from heat as it begins browning; butter will continue to toast in the hot pan. When it reaches a moderately deep brown/hazelnut color, pour into a bowl and let cool to lukewarm or room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: Place sugar, flour, salt, baking powder, and baking soda in the bowl of a stand mixer and combine with the paddle attachment on low for 30 seconds. Pour in the browned butter (and any sediment in the bowl) and continue to mix on a low-medium speed for 2 minutes. The paddle should beat any remaining brown butter lumps smooth. Scrape the bowl and paddle down, raise the speed to medium, and beat for another minute. With machine running, add buttermilk and mix until combined; scrape down bowl, all the way underneath, where butter-sugar-flour sediment will want to collect, promise. Add the eggs and vanilla and beat until thoroughly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cakes: Divide batter between three cake pans. Bake cake layers for 17 to 20 minutes, until a toothpick inserted into the center of each cake comes out batter-free. Rotate your cake pans during the baking time; most oven racks aren’t totally level and we want the layers to be. Let cool in pans for 5 minutes, before flipping out onto a cooling rack, removing the parchment paper, and flipping back onto another. Let cool completely. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: If you’re not assembling the cake today, wrap them in 1 to 2 layer of plastic wrap and freeze until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salted butter caramel filling: "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have everything ready (chopped butter, cream) and reach-able because this will go quickly. Pour sugar in a large skillet over medium-high heat and cook, without stirring, until sugar is partially liquefied, about 4 minutes. Whisk until all unmelted sugar disappears into the caramel and nudge the heat down to low. We are going to cook it a little darker, but it will go quickly from here. Cook until the sugar is deep amber, 1 to 2 minutes (you can test this on an instant read thermometer, 305 to 310 degrees but, I find it easier to eyeball — it can burn while you wait for the thermometer to finish climbing). Add butter, 1 tablespoon at a time, whisking until each piece melts before adding the next. Slowly drizzle in cream, whisking the whole time — if done slowly, the sugar should not seize up/re-solidify but even if it does, don’t worry, we will cook the caramel further."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return heat to a medium-high and cook until caramel reaches 245 degrees F, about another 5 to 7 minutes. Remove from heat and pour into a bowl and cool to room temperature. At room temperature, it will thicken to spreadable fudge consistency. You can speed this along in the fridge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: If you’re not filling the cake today, refrigerate until needed, up to 1 week. It will be almost solid from the fridge. Microwave in 10-second bursts, stirring thoroughly between them, just until caramel softens slightly for spreading. No need to get it hot again, or the butter will want to separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vanilla bean custard frosting:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, off the heat, combine sugar, cornstarch, and salt with a whisk. Add eggs, one at a time, whisk thoroughly between each addition to make sure no dry ingredients are stuck along the edges. Slowly pour in milk, whisking the whole time, followed by the vanilla bean paste. Bring saucepan to stove and cook over medium heat, whisking the whole time, until mixture begins to bubble. As soon as it does, set a timer for 1 minutes and continue whisking (it will get immediately thick and require some real muscle to do this but I believe in you) the entire time. The custard will take on a yellow color and be very thick. Remove from heat and whisk in vanilla extract. Scrape custard into a small bowl to cool completely, or the bowl of an electric mixer. Press a piece of plastic wrap against the surface to keep a skin from forming. If you’re not finishing the frosting today, refrigerate the custard until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to finish the frosting, scoop custard (cold from fridge is fine) into the bowl of a stand mixer (if it’s not there already) and use the whisk attachment to beat the custard for 2 to 3 minutes at medium-high, until pulverized and a little fluffy. Keeping the machine running, add the softened butter a few tablespoons at a time, whipping it throughly into the custard between each addition. Continue until you’ve used all of the butter and whip for 3 to 4 minutes after that, so the frosting is as fluffy as can be. Finally, run the machine at a lower speed for half a minute, just to make any very large holes smaller."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Do ahead: The custard portion can be refrigerated until needed, up to 4 days. The completely frosting can be refrigerated for 3 days. Take it out a 1 to 2 hours before you need it (bringing it to a cool room temperature) and briefly rewhip it with the whisk attachment before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cake:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you cake layers are frozen, you can use them right away — no need to defrost first. If they’re at room temperature but difficult to work with because they’re so soft (this is more an issue with larger cake sizes than 9-inch), you might want to briefly semi-freeze them before getting to work. Cold cakes are easier to trim, frost, and move around. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assess your three cake layers for how much they match each other in size by stacking them. If the sides are very uneven and will require a lot of trimming to make them stack neatly (we want the sides to be a straight vertical line), do this now. If you have a cake circle, plate, or bowl that’s slightly smaller than the diameter of the cake, using this as a stencil to trim with can make it much neater. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Then, place your first layer on a cake plate. If you have a revolving cake stand, use this too. Use a sharp serrated knife to level the cake — i.e. remove any doming for a perfectly flat top. Brush off any loose crumbs. Coat cake top with a thin layer of the buttercream. Place a big scoop of frosting in a pastry bag, or a sandwich bag with the corner snipped off and pipe a thick ring of frosting around the edges of the cake. Place cake layer in the freezer, just to solidify the frosting. While you’re chilling it, repeat this process on the second cake layer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If your salted butter caramel filling is at room temperature, you’re good to go. If it’s solid from the fridge, microwave it in 10-second bursts, stirring thoroughly between them, just until caramel softens slightly for spreading. No need to get it hot again, or the butter will want to separate out. You’re looking for a thick fudge-like consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the frosting on the first cake layer is chilled solid, spoon (in 1-tablespoon blobs) the salted butter caramel onto the cake top. Use an icing spatula or spoon to nudge it as flat as possible — it’s okay if this never looks even (see my photos for moral support) because it will smooth out as it sits between cake layers. 1/2 cup caramel for each cake layer should provide a perfect height of filling. Sprinkle the surface of the caramel lightly with flaky sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the second cake layer (with a solidified frosting dam) on top and repeat this process. Place the third cake layer (still untrimmed) on top of the second layer of caramel. Press the layers firmly together from the top with your hands. Trim the top flat and even, as you did with the other layers. Your cakes should line up nicely with even sides because you already trimmed their circumference, but if any small amount needs shaving, do it now, being careful not to cut so much that you break the caramel filling dam you piped around the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the top and sides of the cake with a thin layer of frosting — it’s fine if you can see the cake through it. This is called a crumb coat and its goal is to keep the crumbs out of the final frosting. Briefly chill your cake until this frosting is firm to the touch; I use the freezer, as usual."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the top and sides of the cake with a more generous layer of frosting, your final coat. If you’d like to create the sides you see in my photo, congratulations, this is the easiest way on earth to decorate a cake: With your cake on a revolving cake stand, or even a lazy Susan, give the cake a spin and gently press the edge of a small or medium offset spatula or butter knife against the cake and keep it spinning while you draw the knife up the sides. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "How to turn this celebration cake into a wedding cake: "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As I mentioned in the headnotes, this celebration cake is 3 to 3 1/2 inches tall, which is perfect for a regular party. For a wedding cake tier, you will want it taller, about 4 1/2 inches, before you add any flowers. (See our conversation up top about the size of cake slices.) To turn this 9-inch celebration cake into a 9-inch tier for a wedding cake, multiply every single cake ingredient by 1.5. The layers will be taller, about 1 1/4 inches tall. You will not, however, need to increase the salted caramel filling or the frosting because we’ll have enough leftover frosting that it can cover the extra 1.5″ of height. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "So, that’s a 9-inch cake tier. What if you want to make what I did, a 6-inch and 12-inch tier as well? Here we use my cake math. For a 6-inch tier with exactly the same height as the 9-inch tier (4 1/2 inches), you’ll want to halve this scaled up 9-inch recipe. For a 12-inch tier, you’ll want to double the 9-inch. For everything in between and/or over, I’ve described above how I do the math."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "How to make a buttercream flower garden"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "I made my first flower-topped cake in 2018 for that German chocolate wedding cake that was naked cake-style (no frosting on the sides) and needed some prettiness on top. I was inspired by the stunning garden Molly Yeh had piped on top of her rose rose cake earlier that year. Alas, she hadn’t posted a tutorial on how she did it until a couple weeks after the wedding I needed it for (the nerve!), so — for better or worse — I was left to my own devices.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The internet is full of tutorials on how to make absolutely stunning buttercream flowers and more from pastry tips. This isn’t that. This is much sloppier; this is for people who like the look of flowers but also don’t want to work too hard for them. I have a feeling I’ll never convince you that my method is shockingly easy, but I’m telling you, it truly is. Here’s why:"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "1. Flowers Not Found in Nature: While you might be able to use Ateco Tip #79 to make a Lily of the Valley and Tip #150 to make Carnations, I’m never going to do that. Instead, I watched a few flower-making tutorials (these are wonderful), immediately scrambled them in my brain, and then just used various tips to make bloop and u’s and blobs in cone-d and concentric shapes and found that when surrounded with leaves in leaf colors from leaf-making tips, they’re surprisingly indistinguishable from Flowers Found In Nature, which is great because I’m coincidentally indistinguishable from a person who is going to feel bad if her posies don’t look like posies. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "2. The One-Bowl, One-Bag Method: I was about to mix a small bowl of each color I wanted to use and set it up individual bags for each color when I was overwhelmed with a feeling I am extremely familiar with in projects where I’ve bitten off a lot: Must I? Do I haaaaave to? Isn’t there an easier way? And so I tried something else: "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "– Fit a single, large pastry bag with a coupler. A coupler allows you to switch decorating tips without having to change the bag.\n– Put a small amount of frosting in a smallish bowl. The more colors you’ll want to use, the less frosting you’ll need right now. I use a couple tablespoons at a time for this small cake shown here. Arrange the colors you’ll want to use in some sort of chromatic order. Tint this blob of frosting with the first one and put it in the bag.\n– Put a tiny schmear of frosting on your flower nail. Place your first square of parchment on top. Pipe a bunch of blops, bops, or swirls into something flower-ish. Carefully pull the paper off the flower nail and put it on your tray.\n– Make a few more flowers. Before the frosting in the bag runs out, add another scoop of plain frosting to the bowl and tint it with your next color. Mix it with any frosting left in the bowl from the previous color. Add it to the piping bag.\n– Continue to make flowers. Change tips whenever you’re bored of the shape you’ve been using or go back to an earlier one. Add colors as needed. Instead of having distinct colors in each flower, you’ll have blends, ombre-ish. It’s much prettier, in my opinion; a lovely reward for this lazier method.\n– When your tray is full, freeze it. If you think you’ll need a second tray of flowers to cover your cake, continue until you have more than you’ll think you’ll need. Very soon, the flowers will be solid and will be very easy to lift from the parchment squares and arranged on the cake.\n– Tint some frosting in a leaf-y green. Place a leaf tip on your piping bag. (I’d probably first squeeze out any remaining flower color, since we want the leaves to be clearly leaf-like.) Use the leaf tip to fill in the spaces between the flowers. I have a couple leaf-ish tips and a couple shade of green in the set I have, so I moved between them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tools: I have these disposable pastry bags (but would get these compostable ones next time), this AmeriColor gel paste color set (these are particularly floral but there are lots of other color themes to choose from), this set of tips, which is more than I’ll ever need."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "More? Shortly, I will put up an Instagram Story of this whole process, which will probably make the frosting and decorating parts simpler. Update: Here it is! I’m thinking about going one further with this — an Instagram Live Q&A one day next week where you can ask me anything you want to know about wedding cakes and I, a not-expert but enthusiastic make-do-er, will do my best to answer them. I’ll keep you posted on a date/time for that."}], "link": "https://smittenkitchen.com/2020/02-new-classic-wedding-cake-how-to"}