{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2020/04/crumbled-crispy-potatoes.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "5 ingredients or fewer, brunch, gluten free, potatoes, side dish, vegetarian", "name": "Crispy, Crumbled Potatoes", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "Use any amount of potatoes you like here; I start with 4 (10 ounces each) because there are four of us. It’s okay if your potatoes are larger or smaller, they may just take more or less time to boil. You want to use Russet or Idaho potatoes here — you need a “floury” not “waxy” potato for it to crumble into nice, craggy nuggets. Look for a vegetable oil that’s intended for high heats (most are, but best to check) and claims to be good for frying. If you can find it, peanut oil is my favorite for fried potatoes, but as I could not either, I can assure you that vegetable oil works fine.", "totalTime": "1 hour 30 minutes, plus chilling time", "recipeYield": "4", "recipeIngredient": ["4 medium/large Russet potatoes", "Kosher salt", "2 cups vegetable or peanut oil", "Finishes of your choice (see suggestions in post)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil your potatoes: Place potatoes in a medium/large pot and cover with an inch or two of cold water and big spoonful of salt. Bring to a boil over high heat; once boiling, reduce to a simmer and cook until a toothpick or skewer can be inserted into potatoes without crunchy resistance. From the time I turn on the stove with cold water in the pot, this takes 45 to 55 minutes with 10-ounce potatoes. Drain and chill in fridge for several hours, overnight, or up to three days. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble and fry your potatoes: Once potatoes are fully cool in the center (you can check by inserting a skewer or toothpick and holding it there for a few seconds; if it feels cold to the touch when you remove it, the potato is chilled inside), heat oil in a 9-inch heavy frying pan to 350 degrees F. You could use a bigger one and it will go faster, but you’ll need more oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a tray with paper towels or a torn paper bag to blot oil. Messily crumble and tear potatoes with your hands into large and small chunks, including the skin. Add 1/3 to 1/2 of the potatoes to the oil at a time. Let them fry for 8 to 10 minutes, turning pieces over as they brown underneath, until pieces are a deep golden brown all over — don’t compromise on the color. Remove with a slotted spoon, shake excess oil back into pan, and drain on towels, showering immediately with salt. Repeat with remaining potatoes. Eat immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rewarm potatoes: In a 350 degree oven on a big tray."}], "link": "https://smittenkitchen.com/2020/04-crispy-crumbled-potatoes"}