{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2020/02/sweet-potato-salad-with-toasted-pepita-dressing.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "avocado, beans, lunch, potatoes, salad, side dish, vegan, vegetarian", "name": "Sweet Potato Salad with Warm Pepita Dressing", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "I looked for longer, thinner sweet potatoes here, so the slices weren’t too big. If you’d like more heat, paper-thin slices of a hot pepper such as a jalapeno or serrano would be a great addition here.", "totalTime": "P0DT1H0M0S", "recipeYield": "4", "recipeIngredient": ["2 pounds (about 4 medium) sweet potatoes", "6 tablespoons olive oil", "1 1/2 teaspoons kosher salt", "Freshly ground black pepper", "1/4 cup pepitas (hulled pumpkin seeds), raw or roasted", "1 teaspoon mild (Aleppo-style) or hot red pepper flakes, or less to taste", "2 limes", "1 15-ounce can black beans", "1 large avocado", "1 big handful fresh cilantro", "4 thin scallions", "1 cup crumbled cotija (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees F. Cut potatoes in half lengthwise, and then into 1/4-inch half-moon slices. Coat a large baking sheet with 1 tablespoon of the olive oil. Scatter sweet potatoes over and toss them with another 1 to 2 tablespoons olive oil, 1 1/2 teaspoons kosher salt, and many grinds of black pepper. Spread them evenly in pan; they won’t fit in one single layer at this point and that’s fine as they shrink as they roast. Roast for 20 minutes, until browned underneath, then flip potatoes and roast another 15 minutes, until all of the pieces are tender and have brown spots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes roast, combine pepitas with 3 tablespoons olive oil in a small skillet and warm over medium heat. Let pepitas sizzle in oil for 1 to 2 minutes but keep a close eye on them; raw ones may be able to handle more time but already toasted ones will need less to get one shade darker. Remove from heat, season with salt to taste plus red pepper flakes. Set aside until potatoes are ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and rinse your black beans. Halve avocado and remove the pit. Leave halves in their skin and cut avocado into thin slices, not cutting through the skin. Roughly chop cilantro, thinly slice scallions (white and green), and halve your limes, cutting one further into wedges. Squeeze one lime wedge over avocado to keep it from browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When potatoes are ready, immediately spoon pepitas and oil over potatoes, and squeeze the juice of your limes halves over. Scatter tray with black beans. Use a spoon to remove avocado slices in sections and fan them out over the tray. Sprinkle pan with cilantro and scallions, plus cotija if you’re using it (recipe will, of course, no longer be vegan). Season well with additional salt and pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop sections of potatoes and their toppings onto plates, serve with extra lime wedges, and eat right away. Leftovers keep nicely for a few days in the fridge; I didn’t rewarm them."}], "link": "https://smittenkitchen.com/2020/02-sweet-potato-salad-with-pepita-dressing"}