{"@context": "http://schema.org", "@type": "Recipe", "image": "https://smittenkitchendotcom.files.wordpress.com/2020/03/pina-colada.jpg?w=640", "nutrition": {}, "recipeCuisine": "", "keywords": "", "aggregateRating": "", "recipeCategory": "drinks, pineapple, summer", "name": "Piña Colada", "author": {"@type": "Person", "name": "Source: Smitten Kitchen"}, "description": "Fresh pineapple can range in sweetness, juiciness, and intensity so feel free to adjust these proportions to your tastes. I definitely think you could use a bag of frozen pineapple chunks instead of fresh here; I usually find them a touch more sweet. ", "totalTime": "10 minutes, plus freezing time", "recipeYield": "2", "recipeIngredient": ["1 medium-large fresh pineapple", "6 tablespoons (3 ounces) sweetened cream of coconut, from a can", "6 tablespoons (3 ounces) white rum", "1 tablespoon fresh lime juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare your pineapple:* Cut the tree-like top off and then one slice off the bottom, both to remove the skin and to create a flat surface underneath to stabilize the pineapple. Cut one clean 1/2-inch slice from the bottom and set it aside to garnish your drink later. Cut the skin off the rest of the pineapple in large strips, making sure to cut deep enough into the flesh to remove all of the skin. Quarter the pineapple and turn each quarter on its side. Remove the core from each quarter in one long cut. Cut the pineapple quarters into 1/2-inch slices. Cover a baking sheet or tray with plastic (makes for easier removal and no lost juice) and arrange pineapple chunks in one layer. Freeze until solid.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make your drinks: Place 3 cups of pineapple chunks in a blender along with cream of coconut, rum, and lime. Blend until absolutely smooth and velvety. Taste, adjusting flavors as you wish. Pour into 8-ounce glasses and garnish with reserved pineapple. I added an extra drizzle of coconut milk on top, just because. Garnish with a maraschino cherry and paper umbrella, if you wish. Enjoy right away."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "[* If you’re going to ask me if I’ve tried this, I have and would like those 15 minutes of my life back. If you’re going to ask me if I’ve tried this, no, but if you do, please report back.]"}], "link": "https://smittenkitchen.com/2020/03-pina-colada"}