{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry Coffeecake", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H", "recipeYield": "About 20 servings", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "active dry yeast, flour, raspberries, dessert, fall, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 255, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "4 grams", "sodiumContent": "218 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup milk", "2 packages active dry yeast", "6 tablespoons unsalted butter, at room temperature, and some for greasing the bowl and pan", "2 teaspoons grated orange zest", "6 tablespoons sugar", "3 eggs, beaten", "3/4 cup orange juice", "4 cups all-purpose flour, and some for kneading", "2 teaspoons kosher salt", "1 cup fresh raspberries", "2/3 cup all-purpose flour", "1/2 cup brown sugar", "1/2 cup sliced almonds", "1/2 teaspoon kosher salt", "3 tablespoons unsalted butter, cold and cut into pieces", "1 cup fresh raspberries", "1 cup confectioners' sugar", "2 tablespoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake, heat the milk to lukewarm. Place in a large bowl and whisk in the yeast. Let stand for 5 minutes. Cream together the butter, orange zest and sugar. Stir in the eggs one at a time. Slowly stir in the orange juice. Whisk the butter mixture into the yeast mixture. Stir in 1 cup of the flour. Stir in another cup of flour, the salt and the raspberries. Gradually work in the remaining flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a well-floured surface, knead the dough until smooth, about 10 minutes, adding more flour if needed to made a soft, workable dough. Place the dough into a large, buttered bowl, cover with a towel and set aside in a warm place until doubled in bulk, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the filling, place the flour, brown sugar, almonds and salt in a food processor and pulse until combined. Add the butter and pulse until well mixed. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough and roll it out into a 15-by-17-inch rectangle. Spread the filling over the dough and press it in with the rolling pin. Scatter the raspberries evenly over the dough. Starting at one of the longer ends, tightly roll up the dough like a jellyroll."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a large bundt or kugelhopf pan. Place the dough in the pan and pinch the ends together to seal securely. Cover and let rise until doubled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Bake for 20 minutes. Lower the heat to 350 degrees and bake until browned and cooked through, about 50 minutes longer. Let stand for 10 minutes. Combine the confectioners' sugar and lemon juice. Turn the cake out of the pan and drizzle with the glaze."}]}