{"@context": "http://schema.org", "@type": "Recipe", "name": "Swordfish Roll-Ups As Prepared In Messina", "description": "", "author": {"@type": "Person", "name": "Paula Wolfert"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "main course, swordfish", "aggregateRating": null, "recipeIngredient": ["6 or 12 metal or bamboo skewers", "2 1/4 pounds swordfish, cut into 3/4-inch steaks, untrimmed (see notes)", "5 tablespoons olive oil", "1 tablespoon minced onions", "1 tablespoon minced carrot", "1/2 tablespoon crushed garlic", "2 cups grated fresh bread crumbs, preferably Italian semolina", "3 heaping tablespoons salted capers, rinsed, plumped and drained (see notes)", "5 tablespoons grated pecorino cheese", "1 teaspoon finely grated lemon rind", "1 teaspoon finely chopped parsley leaves", "Salt and pepper to taste", "Lemon juice to taste", "12 imported bay leaves, cut into halves or quarters", "1 small onion, quartered, separated into 1-inch segments", "Pinches of granulated sugar", "1/3 cup extra-virgin olive oil", "2 tablespoons hot water", "2 1/2 tablespoons lemon juice", "1 teaspoon grated lemon rind", "1/2 teaspoon fresh oregano or thyme", "3/4 teaspoon salt", "1/2 teaspoon pepper", "1/4 teaspoon sugar", "1 tablespoon chopped fresh Italian flat parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut off and discard swordfish skin and center bone. Cut each fish steak into pieces approximately three by three by three-quarter inches thick. Cut each piece horizontally into three even slices, making 24 swordfish slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve and chop any trimmings for the stuffing. Place each slice between sheets of oiled waxed paper. Use a flat mallet to gently pound them (see notes). They should become about one-third larger in size. Avoid breaking the flesh. Keep fish refrigerated between sheets of waxed paper or plastic wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the caper stuffing, place oil, swordfish trimmings, vegetables and garlic in a large skillet and cook one minute or until the vegetables are soft but not brown. Add bread crumbs to the skillet and mix well over low heat, 30 seconds. Scrape into a clean bowl; add the remaining ingredients and, if necessary, one to two tablespoons water to help bind the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place slices on work surface. Evenly divide stuffing and place a portion of the filling on each slice. Roll up one slice, press in sides, then squeeze gently to form the shape of a stuffed grape leaf (see notes). Repeat with the remaining slices. Slip a small piece of bay leaf and an onion segment on either side of each roll. Thread rolls onto skewers. If necessary, fasten any openings with toothpicks. Brush rolls with olive oil and sprinkle lightly with granulated sugar (to develop a good color when broiled). Refrigerate until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salmoriglio sauce, combine the first eight ingredients in a blender jar and blend until smooth and creamy. Pour into a sauce boat. Stir in the parsley. Adjust seasoning. Can be prepared in advance to this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook over charcoal or very close to heated broiler about one and one-half minutes to a side. Baste with the salmoriglio sauce and serve at once."}]}