{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese Roast Pork (Char Siu)", "description": "", "author": {"@type": "Person", "name": "Robert Farrar Capon"}, "image": null, "totalTime": "PT6H45M", "recipeYield": "Enough for several meals serving 3 to 4 people", "recipeCuisine": "chinese", "recipeCategory": "dinner, weekday", "keywords": "brown bean sauce, pork, soy sauce, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "0 grams", "proteinContent": "40 grams", "saturatedFatContent": "4 grams", "sodiumContent": "517 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds boneless lean pork (pork tenderloin, boned butt or shoulder, or boned fresh ham)", "1 tablespoon brown bean sauce", "1 clove garlic, minced", "1/2 cup chicken stock or water", "1 teaspoon salt", "4 tablespoons sugar", "1 tablespoon light soy sauce", "1 teaspoon tomato paste", "1/2 teaspoon five-spice powder", "1 teaspoon sherry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut pork into neat billets about 6 by 3 by 1 1/2 inches and place in bowl. Put brown bean sauce, garlic, stock, salt, sugar, soy sauce and tomato paste in small saucepan and warm, stirring until everything is well blended. Remove from heat and stir in five-spice powder and sherry. Pour sauce over pork; mix to coat all pieces, cover and allow to marinate in refrigerator for at least 6 hours, turning a few times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Place a large shallow pan half full of hot water on the bottom of the oven (or on the lowest rack). Wipe top rack, which should be at least 7 inches above the water, with paper towel dipped in vegetable oil. Turn pork once more in marinade to coat well and place pieces directly on the rack, leaving spaces between them but arranging them so that the drippings will fall into the water (the water will also provide moisture during cooking). Bake 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to 350 degrees and bake 10 minutes more. (For sweeter pork, brush pieces lightly during the last 10 minutes with 2 tablespoons honey mixed with 2 tablespoons marinade.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pork pieces from oven; if it will not be used immediately as an ingredient in one of the following dishes, cool, wrap and refrigerate or freeze until needed. To use, cut into pieces to match the dish you have in mind; for example, dice pork if dish contains diced vegetables."}]}