{"@context": "http://schema.org", "@type": "Recipe", "name": "Parmesan Cream Crackers", "description": "Crackers can be made with just flour and water (as in water crackers, or matzo), but like almost everything else, they’re better with richer ingredients. These are typically made with butter, oil, and milk or cheese, or both, along with flavorings like seeds, herbs and spices. I like a simple, flakey, buttery cracker, often with cheese. This could stem from my childhood addiction to Cheez-Its. Once you get the hang of it, which will take exactly one try, play around. You might skip the cheese and add freshly chopped rosemary or thyme to the dough. Swapping pepper for salt as a topping makes a difference. Or top with minced garlic or onion, sesame or poppy seeds, or whatever is on your favorite commercial cracker. In every case, you are going to make it better.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/crackers-videostill/crackers-videostill-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "About 4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "appetizer, flour, parmesan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 290}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 291, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "11 grams", "sodiumContent": "203 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour, more as needed", "1/2 teaspoon salt", "1/2 cup finely grated fresh Parmesan cheese", "4 tablespoons unsalted butter", "1/4 cup cream or half-and-half, more as needed", "Coarse salt, pepper, sesame or poppy seeds, minced garlic or whatever you like for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Line a baking sheet with parchment paper or lightly dust with flour. Put flour, salt, cheese and butter in bowl of a food processor. Pulse until flour and butter are combined. Add about 1/4 cup cream or half-and-half and let machine run for a bit; continue to add liquid a teaspoon at a time, until mixture holds together but is not sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out dough on a lightly floured surface until 1/2-inch thick or even thinner, adding flour as needed. Transfer sheet of dough to prepared baking sheet (drape it over rolling pin to make it easier). Score lightly with a sharp knife, pizza cutter or a pastry wheel if you want to break crackers into squares or rectangles later on. Sprinkle with salt or other topping if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until lightly browned, about 10 minutes. Cool on a rack; serve warm or at room temperature or store in a tin for a few days."}]}