{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Meatloaf", "description": "This is a recipe that helps explain the Twitter-era term \"humblebrag.\" I made it for the celebrated writer and filmmaker Nora Ephron after a different recipe resulted in a disaster and I had to discard the result with only a few hours before my dinner with -- did I mention? -- Nora Ephron. It derives from a meatball dish once cooked by the chef Mark Ladner at the restaurant Lupa in Manhattan, and published as a recipe in Details magazine in the early years of the century. I scaled it up over the years, increasing some spices here and there, lessening others, until I had what I thought to be a pretty terrific meatloaf. But don't take my word for it. “This is remarkable,” Ms. Ephron told me. I'm bragging about it still.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/03/21/dining/21COOKING_MEATLOAF2/21COOKING_MEATLOAF2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, times classics", "keywords": "ground turkey, italian sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 748}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 461, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "1 gram", "proteinContent": "24 grams", "saturatedFatContent": "9 grams", "sodiumContent": "652 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 cloves garlic, minced", "1 tablespoon finely chopped fresh rosemary", "1/4 teaspoon red pepper flakes", "1 cup fresh bread crumbs of any provenance", "1/2 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "1/4 cup whole milk", "1 pound ground turkey", "1 pound sweet Italian pork sausage, casing removed, crumbled", "1/4 cup extra-virgin olive oil", "4 ounces bacon, chopped", "1 medium red onion, finely chopped", "1 28-ounce can whole tomatoes, preferably San Marzano, seeds removed", "1 cup red wine", "1/4 bunch mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Combine 2/3 of the garlic, the rosemary, pepper flakes, bread crumbs, salt and pepper. Add the milk and mix. Add the turkey and sausage and mix once more to combine; don’t overmix. Transfer onto a board and shape into a fine meatloaf, about 9 inches long and 4 inches wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in a baking pan with high sides (a 9 x12 pan with 2-inch sides works well), drizzle with about 2 tablespoons of olive oil and bake for 25 minutes, turning halfway through to brown evenly. Remove from the oven and reduce the heat to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium saucepan over medium heat, fry the bacon in the remaining 2 tablespoons of oil until it starts to curl and its fat is rendered. Add the onions and remaining garlic, cooking until the onions are translucent, about 4 minutes. Add the tomatoes and wine and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the sauce over the meatloaf, cover tightly with foil and bake until a meat thermometer inserted at the center reads 150 degrees, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the meatloaf to a platter and let stand, tented with foil, for 10 to 20 minutes; its internal temperature will rise to 160 to 165. Cut into thick slices, spoon tomato sauce over the top and scatter with torn mint leaves."}]}