{"@context": "http://schema.org", "@type": "Recipe", "name": "Peanut Butter Blossoms", "description": "For as long as anyone can remember, wedding receptions in Pittsburgh have featured cookie tables, laden with dozens of homemade old-fashioned offerings like lady locks, pizzelles and buckeyes. For weeks ahead, sometimes months, mothers and aunts and grandmas and in-laws hunker down in the kitchen baking and freezing. These peanut butter and chocolate cookies were part of the spread at Laura Gerrero and Luke Wiehagen's wedding in 2009. The recipe came from the bride's family.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/11/24/dining/24COOKING-PEANUTBUTTERBLOSSOMS2/24COOKING-PEANUTBUTTERBLOSSOMS2-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "5 dozen cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "chocolate, peanut butter, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1472}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 100, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "44 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3/4 cups all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon salt", "4 ounces (1 stick) butter, at room temperature", "1/2 cup smooth peanut butter (or other creamy nut butter)", "1/2 cup granulated sugar, plus more for rolling", "1/2 cup light brown sugar", "1 large egg", "1 tablespoon milk, half-and-half, oat milk or nut milk", "1 teaspoon vanilla extract", "Nonstick spray or vegetable oil for cookie sheet (optional)", "5 dozen (one 11-ounce package) Hershey’s Kisses, foil removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together flour, baking soda and salt; set aside. Using an electric mixer, cream together butter, peanut butter, 1/2 cup granulated sugar and light brown sugar. Add egg, milk and vanilla; beat until well blended. Gradually add flour mixture, mixing thoroughly. If the dough is very soft, refrigerate for about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Spray, oil or line a cookie sheet with nonstick liner and set aside. Roll dough into 1-inch balls. (For a precise number of cookies, divide the dough into 5 pieces, and shape each piece into 12 balls.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll cookies in sugar and place 2 inches apart on cookie sheet. Bake until very light brown and puffed, 6 to 8 minutes. Remove sheet from oven and lightly press a candy kiss into center of each cookie, allowing it to crack slightly. Return to oven until light golden brown, 2 to 3 minutes. Remove from oven, cool completely and store in an airtight container."}]}