{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Bouillabaisse", "description": "This is a wonderful do-ahead chicken dish. Look for free-range, humanely raised chicken; you can now find free-range chicken already cut up and skinned. When I tested this recipe, I bought one package of thighs, one of drumsticks and one of breasts (which I cut in half). I had 16 pieces of chicken, enough for eight very generous servings. Marinate the chicken the day before you make this dish, and make it at least one day ahead through step 3 so that you can easily skim off the chicken fat. And if you want to make it for a smaller group, just halve the quantities.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/bouillabaisse-still/bouillabaisse-still-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "french", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "appetizer, main course, dairy-free, gluten-free, halal, healthy, high fiber, kosher, nut-free, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 181}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 600, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "4 grams", "proteinContent": "37 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1119 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 1/4 pounds cut up chicken (drumsticks, thighs, breasts - 16 pieces), skinned", "1/2 cup Pernod or Pastis (anise flavored aperitif)", "Salt", "freshly ground pepper to taste", "2 generous pinches saffron threads", "2 tablespoons extra virgin olive oil", "2 medium onions, sliced", "2 medium carrots, peeled and diced", "2 stalks celery, diced", "6 large garlic cloves, minced", "1 (14-ounce) can chopped tomatoes, with liquid", "1 teaspoon fresh thyme leaves, or 1/2 teaspoon dried thyme", "1/2 teaspoon fennel seeds, crushed in a mortar and pestle", "A bouquet garni made with a bay leaf and a couple of sprigs each thyme and rosemary", "1 quart chicken or turkey stock", "1 1/2 pounds Yukon gold or new potatoes, scrubbed and sliced", "1/2 pound green beans, trimmed and broken in half", "A handful of chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut chicken breasts in half for smaller pieces. Season all of the chicken with salt and pepper, and toss in a very large bowl with one pinch of the saffron and the Pernod or Pastis. Transfer the chicken pieces to a large resealable bag, pour in the liquid from the bowl and seal the bag. Place the bag in a bowl, and refrigerate overnight. If possible, move the chicken around in the bag from time to time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the marinade, and pat dry with paper towels. Heat a large, heavy skillet over medium-high heat, and add 1 tablespoon of the oil. When the oil is hot, working in batches, brown the chicken on all sides, about five minutes per batch. Remove to a baking sheet or bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy casserole or Dutch oven over medium heat, and add the remaining tablespoon of olive oil. Add the onions and cook, stirring often until they soften, about five minutes. Add the carrots and celery and a generous pinch of salt, and cook, stirring, until tender and fragrant, five to eight minutes. Stir in the garlic, cook for another minute until fragrant, and then add the tomatoes, thyme and salt to taste. Cook, stirring, until the tomatoes have cooked down and smell fragrant, about 10 minutes. Add the dark meat pieces to the pot, along with any juice that has accumulated in the bowl or sheet pan. Add the crushed fennel seeds, the stock, bouquet garni and potatoes, and bring to a simmer. Season to taste. Add the remaining pinch of saffron, cover and simmer 20 minutes. Add the breast meat pieces, and simmer another 30 minutes. Check to see that the potatoes are tender. If they are not, simmer for another 10 minutes. Taste and adjust seasonings. If serving the next day (recommended), use tongs to transfer the chicken pieces to a bowl, and cover tightly. Remove the bouquet garni and discard. Refrigerate the chicken and the broth with the vegetables overnight, and skim off the fat from the surface of the broth the next day. Return the chicken to the pot to reheat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken is simmering, or while reheating, blanch the beans for five minutes in a medium pot of boiling salted water. Transfer to the chicken stew. Taste and adjust seasonings. Stir in the parsley and serve in wide soup bowls."}]}