{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant, Tomato and Chickpea Casserole", "description": "This dish is based on a Middle Eastern staple traditionally served with fresh Arabic bread at room temperature, though I like to serve it warm. The casserole tastes best if made a day ahead.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/05/health/05recipehealth_600/05recipehealth_600-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, casseroles", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, eggplant, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1267}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 212, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "10 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "739 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 large eggplant or 2 medium (1 pound), peeled if desired, cut in half lengthwise, then sliced about 1/2 inch thick", "Salt to taste", "3 tablespoons extra virgin olive oil", "1 large onion, sliced thin across the grain", "2 to 4 garlic cloves (to taste), minced", "1 (28-ounce) can chopped tomatoes", "2 tablespoons tomato paste", "Pinch of sugar", "1/8 teaspoon cinnamon", "1 sprig basil", "1 (15-ounce) can chickpeas, drained", "3 tablespoons chopped flat-leaf parsley (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Line a baking sheet with aluminum foil, and brush the foil with olive oil. Place the eggplant slices on the foil, sprinkle with salt and brush each slice lightly with oil. Place in the oven for 15 minutes or until lightly browned. Remove from the heat, and carefully fold the foil in half over the eggplant. Crimp the edges together, so that the eggplant is sealed inside the foil and will continue to steam and soften. Leave for at least 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the tomato sauce. Heat 2 tablespoons olive oil in a large, heavy skillet over medium heat. Add the onion. Cook, stirring often, until tender, about five minutes, and add the garlic and a generous pinch of salt. Cook, stirring, until the garlic is fragrant, about a minute. Add the tomatoes, tomato paste, sugar, cinnamon, basil and salt to taste. Bring to a simmer, and simmer uncovered, stirring often, for 20 to 25 minutes, until the sauce is thick and fragrant. Add freshly ground pepper, then taste and adjust salt. Remove the basil sprig, and stir in the drained chickpeas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a 2-quart baking dish or gratin. Cover the bottom with thin layer of tomato sauce, and make a layer of half the eggplant. Spoon half the remaining sauce over the eggplant, and repeat the layers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 30 minutes, until bubbling. Remove from the heat, and allow to cool for at least 10 to 15 minutes. Sprinkle on the parsley before serving."}]}