{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Pork and Greens With Noodles", "description": "This Asian noodle dish is a simple combination of greens seasoned with ginger, garlic and pork. For a vegetarian version, you could substitute tofu for the pork.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/17/health/17recipehealth_600/17recipehealth_600-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves four", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "dairy-free, healthy, high fiber, greens, pork, soba noodles, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 399, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "3 grams", "sodiumContent": "896 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 large bunch or 2 smaller bunches greens, such as Swiss chard, beet greens, turnip greens or kale (about 1 1/2 pounds), stemmed and washed well in several changes of water", "Salt to taste", "8 ounces Japanese somen noodles, soba or wide rice vermicelli", "1 teaspoon dark sesame oil", "1/2 pound lean pork, cut in 1/4- by 2-inch strips", "2 tablespoons vegetable, canola or peanut oil", "2 large garlic cloves, minced or pressed", "1 tablespoon minced or grated fresh ginger", "2 tablespoons soy sauce", "1/4 cup chicken stock or water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot with water, and bring to a boil. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the greens. Cook the greens 1 to 2 minutes, until just tender, and transfer with a slotted spoon or deep-fry skimmer to the ice water. Drain and squeeze out the water (you don’t have to squeeze them completely dry). Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the noodles. Bring the water in the pot back to a boil, add the noodles, and stir to separate the strands. Add a couple of tablespoons cold water, just so the water doesn’t boil over. Boil somen noodles for two minutes, rice vermicelli for five to seven minutes, until tender. Drain and rinse with cold water. Place in a bowl of cold water, then drain and toss with the sesame oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy skillet or wok over high heat until hot enough to evaporate a drop of water on contact. Add 1 tablespoon of the oil, swirl to coat the pan, and reduce the heat to medium-high. Add the pork, and stir-fry for two to three minutes, until the meat is cooked through and there are no longer any traces of pink."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining oil, ginger and garlic, and stir-fry until fragrant and beginning to color, about 20 to 30 seconds. Stir in the greens, noodles, soy sauce and stock or water. Stir together until heated through, and serve."}]}