{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Soup", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner, lunch, one pot, soups and stews", "keywords": "appetizer, main course, cabbage, chicken, gluten-free, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 501, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "3 grams", "proteinContent": "39 grams", "saturatedFatContent": "9 grams", "sodiumContent": "861 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["One 5-to-5 1/2-pound chicken", "Sea salt", "4 ribs celery", "1 medium carrot, peeled", "1 medium leek, white and light-green parts only", "3 sprigs savory or thyme", "3 bay leaves", "1 large head garlic", "1-2 dried, medium-spicy chilies, like chilhuacle, ancho or New Mexican", "1 1/2 tablespoons olive oil", "Half of a small savoy cabbage, cored and cut into 3/4-inch cubes", "Freshly ground black pepper", "1 lime, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the wing tips, feet and legs from the chicken. Slice along both sides of the backbone, removing it along with the attached head and neck. Leave the first joint of the wings attached to each breast half. Season the breast halves and legs liberally with salt and leave at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop 1 rib of the celery, the carrot and half of the leek into 1?2-inch pieces. Put them in a large stockpot with the herbs and 5 smashed unpeeled garlic cloves. Arrange the wing tips, backbone and feet on top as level as you can. Add water to barely cover, 6 to 8 cups. Bring to a boil, then simmer for 30 minutes, skimming off impurities. Add the legs and breasts and weigh them down with a small plate to keep them submerged. Return to a boil, then lower the heat until barely bubbling and simmer for 30 minutes more. Let sit off the heat for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the remaining celery and leek into ¼-inch cubes. Peel and thinly slice the remaining garlic. Grind the chilies, with seeds, to make 2 tablespoons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the legs and breast halves from the pot and let them cool. Strain the stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the stockpot dry, set over low heat and add the oil. When hot, add the sliced garlic and gently sauté for 30 seconds. Add the ground chilies and cook for 1 minute. Return the stock to the pot, bring to a boil and lower to a simmer. Add the cabbage, celery and leeks and simmer for 30 minutes. Season to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard the chicken skin, pick the meat from the bones and cut it across the grain into large chunks. Add to the soup and let sit for 15 minutes off the heat. Just before serving, bring to a simmer and serve with a lime wedge."}]}