{"@context": "http://schema.org", "@type": "Recipe", "name": "Asparagus Frittata With Smoked Trout", "description": "Asparagus and eggs always go beautifully together. This omelet is enriched with omega-3 fats, as well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/06/03/health/03recipehealth_600/03recipehealth_600-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Makes one 10-inch frittata", "recipeCuisine": "", "recipeCategory": "", "keywords": "asparagus, eggs, smoked trout, gluten-free, halal, healthy, kosher, low-carb, low sugar, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 41}, "recipeIngredient": ["3/4 pound asparagus, woody ends snapped off, cut in 1/2-inch lengths", "8 large eggs", "1/2 teaspoon salt, preferably kosher salt, or to taste", "A few twists of the pepper mill", "3 tablespoons low-fat milk or regular milk, to taste", "1/2 pound smoked trout, diced or broken into small pieces", "3 tablespoons chopped chives", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the asparagus until tender and still bright green, about five minutes. Drain and refresh under cold water. Dry on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Stir in the salt, pepper, milk, asparagus, smoked trout and chives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop a bit of egg into the pan; if it sizzles, pour in the egg mixture. Tilt the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, lifting the edges of the omelet to let the eggs run underneath during the first minute or two of cooking. Turn the heat down to low, cover (use a pizza pan if you don’t have a lid that will fit your skillet) and cook 10 minutes, shaking the pan gently every once in a while. Loosen the bottom of the omelet with a wooden spatula while tilting the pan from time to time, so that the bottom doesn’t burn. The eggs should be just about set; cook a few minutes longer if they’re not. Meanwhile, preheat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the omelet under the broiler for one to two minutes, watching very carefully to make sure the top doesn’t burn. Remove from the heat, and allow to cool for 15 minutes. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large, round platter, and cut into wedges or diamond-shaped pieces. If serving the next day, cover with plastic and then foil. Refrigerate overnight."}]}