{"@context": "http://schema.org", "@type": "Recipe", "name": "Vina Slatalla’s Beef Barley Soup", "description": "", "author": {"@type": "Person", "name": "Michelle Slatalla"}, "image": null, "totalTime": "PT5H", "recipeYield": "10-12 servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "appetizer, main course, barley, short ribs, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "recipeIngredient": ["3 to 4 pounds short ribs, split", "Root vegetables, washed and halved (2 parsnips, 2 turnips, 4 large carrots)", "2 onions, halved and stuck with 2 cloves in each half", "4 to 5 celery stalks, including leaves", "1 cup parsley", "Salt", "Pepper", "1/2 cup barley, rinsed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Place short ribs in roasting pan large enough to hold them in a single layer and roast 1 hour, turning once or twice. Pour off fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place large stew pot on stove. Put in the short ribs, parsnips, turnips, 2 carrots, onions, 2 to 3 stalks celery, 1/2 cup parsley, salt and pepper. Add water to cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring broth to a boil, then reduce heat and simmer, covered, for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let pot cool on stove for a half-hour or so to let flavors set. Strain broth, reserving ribs, and return strained broth to pot. Let cool to room temperature. Meanwhile, remove beef from ribs, reserving meat and discarding bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When broth is cool, skim fat. Return broth to stove, bring to a boil, and add barley and salt and pepper to taste. Reduce heat and simmer for 40 minutes, skimming frequently. Chop remaining carrots and celery, add to pot, and simmer for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add reserved beef and remaining parsley. Heat through, skim again, and serve."}]}