{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Herb Risotto", "description": "This classic risotto is flooded with fresh herbs at the very end of cooking. Serve it as a main dish or a side. Use a combination of sweet herbs and vivid-tasting salad greens, like wild arugula.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/06/17/health/17recipehealth_600/17recipehealth_600-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "arborio or carnaroli rice, fresh herbs, gluten-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegetarian, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 292}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 586, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "81 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "22 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1406 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["7 cups chicken stock or vegetable stock", "4 garlic cloves, minced", "2 cups finely chopped fresh herbs, such as parsley, tarragon, chives, chervil, dill, basil, chives and arugula (4 cups leaves)", "2 tablespoons extra virgin olive oil", "2/3 cup finely chopped onion or leek", "Salt, preferably kosher salt, to taste", "1 1/2 cups arborio or carnaroli rice", "1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "Freshly ground pepper", "1 teaspoon finely chopped lemon zest", "1 tablespoon freshly squeezed lemon juice", "1/2 cup freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan, and bring it to a simmer on the stove, with a ladle nearby or in the pot. Make sure that it is well seasoned. Combine the herbs and one of the minced garlic cloves in a bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy skillet or saucepan. Add the onion or leek and 1/2 teaspoon salt, and cook gently until it is just tender, about three minutes. Do not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the rice and the remaining three cloves of garlic, and stir just until the grains of rice become separate and begin to crackle. Add the wine and cook, stirring, until it is absorbed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice and should be bubbling, not too slowly but not too quickly. When the rice is just tender all the way through but still chewy, usually in 20 to 25 minutes, it is done. Taste now and correct seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of stock to the rice. Stir in the herbs, pepper, lemon zest and juice, and Parmesan, and remove from the heat. The mixture should be creamy. If you put some on a plate and tilt the plate the mound of rice should flatten out. Serve right away."}]}