{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Rice With Carrots and Leeks", "description": "This is a very simple, comforting pilaf. In addition to flavonoids and vitamins, the carrots and leeks bring lots of sweet flavor that is beautifully complemented by a final spritz of lemon juice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/28/health/28recipehealth_600/28recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "", "keywords": "brown rice, carrot, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 72}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 328, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "890 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 pound leeks, white and light green parts only, trimmed, cut in half lengthwise, washed thoroughly and cut in 1/2-inch slices", "1/2 pound carrots, peeled and sliced", "2 garlic cloves, halved, green shoots removed and thinly sliced", "1 cup brown rice (short- or long-grain)", "Salt to taste", "2 1/2 cups water", "2 to 3 tablespoons freshly squeezed lemon juice, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over a medium-sized, heavy skillet or saucepan, and add the leeks and carrots. Cook, stirring, until the leeks are tender and translucent and the carrots have softened slightly, about five minutes. Add the garlic and salt to taste. Cook, stirring, until the garlic smells fragrant, about a minute. Add the rice and about 1/2 teaspoon salt, and stir to coat the grains with olive oil. Add the water, and bring to a boil. Reduce the heat, cover and simmer over low heat until the rice is tender, about 45 minutes. Remove from the heat, and do not remove the cover for 10 minutes. Then stir in the lemon juice, and taste and adjust salt. Serve hot or warm."}]}