{"@context": "http://schema.org", "@type": "Recipe", "name": "Lobster With Pasta and Mint", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/Lobster-With-Pasta-and-Mint/Lobster-With-Pasta-and-Mint-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "dairy-free, nut-free, lobster, mint, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 57}, "recipeIngredient": ["Salt", "1 1 1/2-pound live lobster", "4 tablespoons olive oil", "1 tablespoon minced garlic", "Crushed red chili flakes to taste", "1 pound long pasta, like linguine", "1/2 cup chopped mint, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt it. Put about an inch of water into another large pot, add a not-too-big pinch of salt, put in lobster and cover pot. Steam lobster until it is red, about 3 minutes; you do not have to cook it through. Remove it and keep water simmering with cover off. As soon as you can, remove lobster’s tail and claws; return body to simmering liquid. Remove meat from claws and tail and return shells to pot; chop meat roughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a large skillet over medium heat. Add garlic and lobster meat and toss; cook until it sizzles, then add chili flakes and lower heat. Strain lobster-cooking water, discarding body and shells; you will want a couple of cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook pasta until it is not even close to tender, but just bending. Drain it, reserving some cooking liquid if you have less than 2 cups of lobster liquid. Add pasta to lobster/garlic mixture, with about a cup of lobster liquid. Cook, stirring occasionally, until pasta is tender, adding more liquid as necessary. Stop cooking when pasta is tender, taking care not to add too much liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and add more salt, chili flakes or olive oil if you like. Stir in the mint and serve."}]}