{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Vinaigrette", "description": "It's hard to imagine five minutes better spent in the kitchen than those making vinaigrette, the closest thing there is to an all-purpose sauce. At its most basic, vinaigrette is acid and oil, salt and pepper, with additional flavors as desired. This standard vinaigrette begins, not surprisingly, with extra-virgin olive oil. To vary the flavor, you could use walnut or hazelnut oil or, if you want to play down the flavor of oil, a neutral oil like grapeseed or canola. It continues with good wine vinegar, which could take you from champagne vinegar to an extra-mild Asian rice vinegar. (Balsamic and sherry vinegars are too dominant for many uses.) Lemon juice is a fine substitute, but because it is less acidic than most vinegars, you will need more of it.\n", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT5M", "recipeYield": "About  3/4 cup", "recipeCuisine": "", "recipeCategory": "easy, condiments", "keywords": "oil, vinegar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 161, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "2 grams", "sodiumContent": "59 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup extra virgin olive oil", "3 tablespoons or more good wine vinegar", "Salt", "freshly ground black pepper", "1 large shallot, cut into chunks (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all ingredients except shallot in a blender and turn on machine; a creamy emulsion will form within 30 seconds. Taste and add vinegar a teaspoon or two at a time until balance tastes right to you."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shallot, if using, and turn machine on and off a few times until shallot is minced within dressing. Taste, adjust seasoning and serve. (This will keep, refrigerated, for a few days.)"}]}