{"@context": "http://schema.org", "@type": "Recipe", "name": "Goat-Cheese Cheesecake", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "P2DT2H", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, goat cheese, mascarpone", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 563, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": null, "proteinContent": "15 grams", "saturatedFatContent": "28 grams", "sodiumContent": "596 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cups plus 2 tablespoons (11 ounces) cream cheese, at room temperature", "8 ounces fresh goat cheese, at room temperature", "1/2 cup sugar", "Half of a vanilla bean, split lengthwise, seeds scraped and reserved", "1 1/2 cups mascarpone cheese", "4 large eggs, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees. In the bowl of an electric mixer fitted with the paddle attachment, combine the cream cheese, goat cheese, sugar and vanilla seeds and beat until smooth and creamy. Add the mascarpone and beat until smooth. Add the eggs and mix well, scraping down the sides of the bowl with a spatula as necessary. Strain the mixture into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tightly wrap the outside of an 8-inch springform pan with foil, making sure there are no gaps. Spoon the mixture into the pan and place it in the center of a larger baking pan. Pour enough very hot water into the baking pan to reach two-thirds of the way up the side of the springform pan. Cover the entire baking pan with foil. Pierce the foil in several places with a knife. Bake for 1 hour, then lift off a corner of the foil to allow the steam to escape. Re-cover the pan and bake 50 minutes longer, or until the cake looks set around the edges but is still slightly jiggly in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cake to a wire rack to cool completely. The cake can be made up to 2 days in advance and kept covered in the refrigerator. Serve with seasonal fruit, fruit sorbet or nut brittle."}]}