{"@context": "http://schema.org", "@type": "Recipe", "name": "Mahony’s Beef Po’ Boys", "description": "Benjamin Wicks, proprietor of Mahony’s Po-Boy Shop on Magazine Street in New Orleans, which opened in the summer of 2008, is a raver and ranter with the heart of an old-timer. “Why don’t people care about making great po’ boys?” he asked The Times, rhetorically, a year later. And then he gave us a terrific recipe that will take a little time to pull off, but results in a beef Po' Boy sandwich of uncommon excellence. Think of it as project food for a festive weekend lunch, and your guests will thank you. Add cheese and French fries for added pow.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/02/12/dining/mahonys-po-boy/mahonys-po-boy-articleLarge.jpg", "totalTime": "PT3H45M", "recipeYield": "Enough for 10 sandwiches", "recipeCuisine": "", "recipeCategory": "dinner, lunch, one pot", "keywords": "beef, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 77}, "recipeIngredient": ["1 cup all-purpose flour", "Salt", "freshly ground black pepper", "7 pounds beef chuck roll, sliced into 2-inch-thick portions", "1/2 cup vegetable oil, or as needed", "6 to 7 stalks celery, cut into 3/4-inch dice", "2 yellow onions, peeled and cut into 3/4-inch dice", "2 green bell peppers, cored and cut into 3/4-inch dice", "2 jumbo carrots, peeled and cut into 3/4-inch dice", "1 cup peeled garlic cloves, each clove halved lengthwise", "7 cups dry red wine", "2 tablespoons dried rosemary", "2 tablespoons dried thyme", "1 bay leaf", "1/3 cup chopped parsley leaves", "5 loaves French or Italian bread", "Mayonnaise", "shredded lettuce", "sliced tomatoes", "sliced pickles to dress sandwiches"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Place flour in a large, wide bowl and season generously with salt and pepper. Add beef, dust well on all sides and shake off excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, heavy Dutch oven or roasting pan with a lid over medium-high heat. Add enough oil to cover the bottom and heat until shimmering. Working in batches, add beef and sear well on all sides. Transfer beef to a platter and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add celery, onions, peppers, carrots and garlic to pan; if necessary, add more oil. Sauté until vegetables are tender and golden brown, about 15 minutes. Add wine and 3 cups water. Stir, scraping the bottom of the pan. Add rosemary, thyme, bay leaf and parsley. Stir well, add beef, and stir again to mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover, and transfer to oven. Cook until beef is very tender, about three hours. Transfer beef to a deep platter and keep warm. Remove and discard bay leaf. Using a hand-held immersion blender or stand blender, purée vegetables and any remaining bits of meat in pan juices to make sauce. Cut beef into slices. Slice each bread loaf in half lengthwise and crosswise, spread one side with mayonnaise, thickly layer in meat, wet with gravy, and top with lettuce, tomatoes and pickles."}]}