{"@context": "http://schema.org", "@type": "Recipe", "name": "Georgian Cilantro Sauce", "description": "Years ago, I found an intriguing recipe for a sauce similar to this one. I loved it, but it wasn’t until I read Dara Goldstein’s “The Georgian Feast,” from which this recipe is adapted, that I realized this sweet, pungent sauce is a mainstay of Georgian national cuisine, often served with grilled meat, chicken or vegetables.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/03/health/03recipehealth_600/03recipehealth_600-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "1 1/2 cups", "recipeCuisine": "eastern european", "recipeCategory": "condiments, dips and spreads", "keywords": "cilantro, dried apricots, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 366, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "421 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["2 ounces dried apricots", "1 cup boiling water", "1/3 cup shelled walnuts (1 ounce)", "2 to 4 garlic cloves (to taste), halved, green shoots removed", "1/4 cup freshly squeezed lemon juice", "1/2 teaspoon salt (more to taste)", "Freshly ground black pepper to taste", "Pinch of cayenne", "2 cups cilantro leaves (2 good-size bunches), coarsely chopped", "1 1/2 cups parsley leaves (1 1/2 bunches), coarsely chopped", "1/2 cup coarsely chopped mixed basil, tarragon, and dill", "5 tablespoons walnut oil (or more, to taste)", "1/2 cup soaking water from the apricots, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried apricots in a bowl and pour on the boiling water. Let sit for at least an hour, more if possible, even overnight. Drain over a measuring cup and retain 1/2 cup of the soaking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with the steel blade, and drop in the garlic. When it is chopped and adhering to the sides of the bowl, stop the machine and scrape down the bowl. Add the walnuts, and process with the garlic. Scrape down the sides of the bowl. Add the drained apricots, the lemon juice, salt, pepper and cayenne to the bowl, and process to a puree. Add the cilantro and other chopped herbs, and puree, stopping the machine to scrape down the sides several times. Combine the walnut oil and soaking water from the apricots, and with the machine running, gradually add it to the puree. Process until smooth. Transfer to a bowl, and let sit for one hour. Taste and adjust salt. Serve with beans, chicken, meat or fish, grilled or roasted vegetables, or grains."}]}