{"@context": "http://schema.org", "@type": "Recipe", "name": "Milk-Poached Chicken Breasts with Young Vegetables", "description": "The light, herbal freshness that enlivened many of our grüner veltliners suggested a dish with a certain freshly picked delicacy, one that might satisfy on a soft summer evening. Not firing up the grill or the oven is an extra bonus.The idea is to poach chicken breasts gently in milk — “gently” is operative here — then serve them in a soup that has captured the flavors of vegetables. Baby carrots, potatoes, tiny onions and, for the wine, some peas (an ingredient we mentioned often during the tasting) make for a pretty plate. And, according to my granddaughters, ages 7 and 9, a delicious one, too. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken breast, milk, vegetables, gluten-free, nut-free, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 528, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "69 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1361 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 skinless, boneless chicken breast halves (about 2 pounds total)", "Salt", "freshly ground white pepper", "4 garlic cloves, slivered", "3 cups whole milk", "1 pound baby Yukon Gold potatoes, peeled and halved", "18 baby carrots, peeled, 1/2-inch of stem left on", "24 tiny pearl onions, blanched and peeled", "1/2 pound sugar snap peas", "6 tablespoons crème fraîche", "Fleur de sel", "1/4 cup minced chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken with salt and pepper. Place in sauté pan to hold them closely in single layer. Scatter with garlic. Add milk. Bring to a very gentle simmer and cook, turning a few times, 18 minutes. Never let milk boil at any time or it will curdle. Remove chicken to a platter, tent with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes to milk in pan. Simmer gently 15 minutes. Add carrots. Simmer until potatoes are tender, another 15 minutes or so. Add onions and peas. Simmer 3 minutes. Remove from heat. Whisk in crème fraîche. Season milk with salt and pepper as needed. Dish can be set aside up to 45 minutes, then reheated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice each chicken breast half across in three pieces, each about an inch wide. Return chicken to pan and bring to slow simmer just enough to reheat dish. Arrange chicken pieces and vegetables in 6 shallow soup plates. Ladle in milk sauce. Sprinkle chicken with fleur de sel and chives. Serve."}]}