{"@context": "http://schema.org", "@type": "Recipe", "name": "Panini With Artichoke Hearts, Spinach and Red Peppers", "description": "Here’s a great way to pack a lot of nutrients into a sandwich. If you use frozen artichoke hearts, the panini are quickly assembled.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/04/10/health/artichoke.panino.jpg/artichoke.panino.jpg-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "artichoke hearts, bread, spinach, halal, healthy, high fiber, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 206}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 414, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "8 grams", "proteinContent": "18 grams", "saturatedFatContent": "7 grams", "sodiumContent": "636 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 ounces (1 bag) baby spinach", "3 tablespoons olive oil", "2 garlic cloves, minced", "12 ounces frozen or fresh cooked artichoke hearts, sliced", "1 teaspoon fresh thyme leaves", "Salt, preferably kosher salt", "freshly ground pepper", "1 large or 2 smaller roasted sweet red peppers, sliced", "1/4 pound fontina or Gruyère, thinly sliced or grated", "8 slices whole grain country bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil. Fill a bowl with ice water. Add the spinach to the boiling water and blanch for 10 to 20 seconds. Transfer to the ice water to cool for a few minutes, then drain and squeeze out excess water. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a large, heavy skillet over medium heat, and add the garlic. Cook, stirring, until the garlic is fragrant, about 30 seconds, and stir in the artichoke hearts. Stir for a few minutes, until the artichoke hearts are beginning to color, and add the thyme leaves and the spinach. Toss together and season to taste with salt and pepper. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a panini grill. Top four of the bread slices with the artichoke hearts and spinach. Add strips of roasted pepper, then cheese. Top with the remaining bread and press together. Brush the outside of the bread (top and bottom slices) with olive oil. Place in the panini maker and grill for four to five minutes, until the cheese has melted and the bread is toasty. Slice in half and serve hot."}]}