{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Stew", "description": "", "author": {"@type": "Person", "name": "David Leite"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/lambstewportuguese/lambstewportuguese-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "chicken livers, lamb shoulder, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1115, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "87 grams", "fiberContent": "1 gram", "proteinContent": "64 grams", "saturatedFatContent": "35 grams", "sodiumContent": "1484 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 6-pound bone-in lamb shoulder; bones removed and cut into 3-inch pieces, rinsed well and reserved, or 3 pounds boneless lamb shoulder (see note)", "3 ounces chicken livers", "5 garlic cloves, minced", "3 bay leaves", "1 tablespoon sweet paprika", "1 1/2 cups dry white wine", "4 tablespoons olive oil, or as needed", "Coarse salt", "Ground white pepper", "1 yellow onion, cut crosswise into thin half-moons", "2 cups beef stock", "3 sprigs flat-leaf parsley, chopped, more for serving (optional)", "Boiled red potatoes, cooked white rice for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut lamb and chicken livers into 1 1/2-inch chunks, and place in a glass, stainless steel or other nonreactive bowl. Add garlic, bay leaves, paprika, 1/4 cup wine, 2 tablespoons olive oil, 2 teaspoons salt and 1/2 teaspoon white pepper. Mix well. Cover and refrigerate at least 2 hours, preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat remaining 2 tablespoons olive oil in a large Dutch oven over medium-high heat. When oil shimmers, add bones and sear until well-browned, 7 to 10 minutes. Transfer to a plate. If pan is dry, add a bit more oil. Working in batches, add lamb mixture and sear, turning occasionally, until edged with brown, 6 to 8 minutes. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to medium, add onion and sauté until limp, about 10 minutes. Add lamb and any juices, the bones, remaining 1 1/4 cups wine, beef stock and parsley. Bring to a boil, reduce heat to low and cover. Simmer, stirring occasionally, until lamb is tender, about 1 1/2 hours; if liquid level becomes low, add water as needed. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard bones and bay leaves. If a smooth sauce is desired, transfer lamb to a bowl, cover and keep warm. Strain and discard solids from liquid. To serve, spoon stew into shallow bowls. If desired, accompany with boiled peeled red potatoes or long grain white rice drizzled with olive oil and sprinkled generously with minced parsley."}]}