{"@context": "http://schema.org", "@type": "Recipe", "name": "Scalloped Potatoes", "description": "This recipe comes from Cheryl Rogowski, whose family has been farming the rich black earth on their patch of Orange County, N.Y., for more than 50 years. They started growing Keuka Golds because the two best-known potatoes in the country — russets and Yukon Golds — did not grow well there. Keukas have yellow flesh, rich flavor and pale skin like Yukons, but they can handle the region’s drastic temperature swings, short growing season, divergent soils and uneven rainfall. For this dish, Yukons work equally well.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2017/09/19/dining/Scalloped-Keuka-Gold-Potatoes/Scalloped-Keuka-Gold-Potatoes-articleLarge.jpg", "totalTime": "PT1H35M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, winter, gluten-free, heavy cream, potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 955}, "recipeIngredient": ["3 tablespoons butter, more for greasing pie plate", "4 cloves garlic, minced", "1 medium leek, white and light green parts only, minced", "4 small cipollini onions, minced", "2 tablespoons minced French tarragon leaves plus 1 tablespoon finely chopped, for garnish", "3 cups heavy cream", "2 pounds (about 6 medium) Keuka Gold potatoes (unpeeled), sliced 1/8-inch thick", "Salt", "Ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 9-inch deep-dish glass pie plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide saucepan, combine 3 tablespoons butter, garlic, leek and onions. Place over medium-low heat and sauté until mixture is light golden, about 15 minutes. Add 2 tablespoons tarragon, the cream and potatoes, and mix well. Simmer gently until potatoes are barely tender, about 15 minutes. Season with salt and white pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer potatoes to pie plate, spreading them evenly and pressing lightly to compact them. Drizzle with 2 to 3 tablespoons of cream from pan. Cover with foil and bake for 40 minutes. Remove foil and continue to bake until top is light golden brown, about 10 more minutes. Remove from heat and allow to rest for 15 minutes. Garnish with a sprinkling of chopped tarragon, and serve."}]}