{"@context": "http://schema.org", "@type": "Recipe", "name": "Puree of Shell Beans and Potato", "description": "This puree of fresh shell beans and potato is inspired by a signature dish from Apulia, in southern Italy, that's made with dried, split fava beans and potato. The dish is traditionally served with cooked greens, but you can also offer it as a side dish or as an appetizer with bread. Use any type of bean for this. If you use scarlet runners, the puree will have a purple hue. In any event, it is best to serve the puree warm.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/25/health/25recipehealth_600/25recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, one pot, soups and stews", "keywords": "appetizer, main course, side dish, fall, gluten-free, halal, kosher, vegan, vegetarian, potato, shell beans", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 219, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "376 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 pound shell beans, shelled (about 1 3/4 cups shelled)", "1 small onion, halved", "3 to 4 large garlic cloves (to taste), peeled and crushed", "A bouquet garni made with a sprig each parsley and sage, and a bay leaf", "Salt to taste", "1 russet potato, about 10 ounces, peeled and diced", "About 6 tablespoons plus 1 teaspoon extra virgin olive oil", "About 1/4 cup broth from the beans (more to taste)", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the beans, onion, garlic, bouquet garni and potato in a heavy saucepan or soup pot. Add enough water to cover by two inches. Add salt, and bring to a simmer. Cover and simmer 40 to 45 minutes, or until the beans and potato are tender. Taste and adjust salt. Remove and discard the onion and the bouquet garni. Drain though a strainer or colander set over a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough bean broth to get a moist puree, beginning with 1/4 cup and adding more as needed, and stir again to incorporate. Taste, adjust salt and add freshly ground pepper. Heat gently in the pot, stirring, and drizzle a little more olive oil over the top. Serve warm."}]}