{"@context": "http://schema.org", "@type": "Recipe", "name": "Strata With Mushrooms and Chard", "description": "I make stratas — savory bread puddings — when I find myself with a stale baguette on hand, even if it’s so hard that the only way to slice it is to saw it. A strata is as comforting as macaroni and cheese, and it makes a great one-dish meal.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/12/22/health/nutrition/22recipehealth_ready/22recipehealth_ready-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "eggs, stale bread, halal, healthy, kosher, nut-free, vegetarian, main course, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 131}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 292, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "15 grams", "saturatedFatContent": "5 grams", "sodiumContent": "473 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound stale bread, sliced about 3/4 to 1 inch thick", "3/4 ounce dried mushrooms", "8 ounces Swiss chard, stemmed and cleaned", "2 garlic cloves, 1 cut in half, green shoots removed, the other minced", "1 1/2 cups low-fat milk", "2 ounces Gruyère cheese, grated (1/2 cup, tightly packed)", "1 ounce Parmesan cheese, grated (1/4 cup, tightly packed)", "2 tablespoons extra virgin olive oil", "1 teaspoon chopped fresh rosemary", "Salt", "freshly ground pepper", "4 large eggs", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If the bread is soft, toast it lightly and rub each slice front and back with the cut clove of garlic. Cut in 1-inch dice. If the bread is stale, just rub the slices with garlic and cut them into 1-inch dice. Place in a very large bowl, and toss with 2/3 cup of the milk. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried mushrooms in a bowl or a Pyrex measuring cup, and cover with 1 1/2 cups boiling water. Allow to sit for 30 minutes. Set a strainer over a bowl, line with cheesecloth, a coffee filter or paper towels, and drain the mushrooms. Squeeze the mushrooms over the strainer to extract all of the broth. Rinse, away from the strainer, in several changes of water to wash off sand. Squeeze out excess water. Chop coarsely. Measure out 1 cup of the mushroom broth, and combine with the remaining milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil or butter a 2-quart baking dish or gratin. Heat a large skillet over medium-high heat, and add the chard. Stir until the leaves begin to wilt in the liquid left on them after washing. Cover the pan, and let the chard steam until it has completely collapsed, about two minutes. Uncover and stir. When all of the chard has wilted, remove from the pan and rinse briefly with cold water. Press or squeeze out excess liquid. Chop coarsely and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 tablespoon of the olive oil to the pan, turn the heat down to medium and add the minced garlic. Cook, stirring, until fragrant, about 30 seconds, and stir in the reconstituted mushrooms, the rosemary and the chard. Stir together for a couple of minutes, and season to taste with salt and pepper. Remove from the heat, and transfer to the bowl with the bread cubes. Add the cheeses, and toss together. Arrange in the baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat together the eggs in a medium bowl. Add salt to taste (I use 1/2 to 3/4 teaspoon), the remaining milk and the mushroom broth. Add a few twists of the peppermill and pour over the bread. Press the bread down into the custard mixture. Sprinkle a little Parmesan over the top, and drizzle on the remaining olive oil. Place in the oven, and bake 40 to 50 minutes, until puffed and browned. Remove from the oven, and serve hot or warm."}]}