{"@context": "http://schema.org", "@type": "Recipe", "name": "Cock-a-Leekie", "description": "", "author": {"@type": "Person", "name": "Frank Bruni"}, "image": "https://static01.nyt.com/images/2014/06/06/dining/Cock-a-Leekie/Cock-a-Leekie-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "british", "recipeCategory": "dinner", "keywords": "bacon, chicken, potato, fall, winter, main course", "aggregateRating": null, "recipeIngredient": ["2 quarts salt-free homemade chicken stock or commercial low-sodium chicken broth", "2 medium leeks, trimmed of roots and tough dark green leaves, quartered lengthwise and thoroughly washed", "4 whole star anise", "1 4-pound fresh free-range organic chicken, cut into 8 pieces and skinned", "Salt", "12 small to medium red potatoes, halved", "4 ounces (about 12) dried prunes, cut into 1/4-inch slices", "2 cups heavy cream", "8 slices smoked bacon", "1/4 cup minced mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken stock in a large saucepan and place over high heat to bring to a boil. Meanwhile, set aside a large bowl of ice water. When stock is boiling, add leeks and poach for 2 minutes. Remove with tongs and place in ice water until cool, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add star anise and chicken pieces to broth. Reduce heat to low and simmer gently until chicken is just done, about 30 minutes. Transfer chicken and anise to a bowl and add enough hot broth to just cover; set aside. Return remaining broth to high heat and reduce to 1 1/2 to 2 cups. Meanwhile, in a medium pan of lightly salted water, boil red potatoes until tender, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add prunes and cream to reduced broth. Boil until prunes are soft and sauce has thickened enough to coat the back of a spoon, about 15 minutes. Meanwhile, in a large skillet over medium heat, fry bacon until lightly browned and beginning to crisp, about 5 minutes. Add leeks and continue to cook until leeks are lightly browned, another 5 minutes. Transfer bacon and leeks to paper towels to drain; keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season sauce with salt to taste. Drain potatoes and toss with mint. Drain chicken (broth may be reserved for another use), discarding star anise. To serve, place chicken on a plate, ladle with prune sauce, and top with leeks and bacon. Add potatoes and serve."}]}