{"@context": "http://schema.org", "@type": "Recipe", "name": "Restaurant-Style Pork Chops", "description": "A '90s-restaurant-style dish that came to The Times from Matthew Kenney, a chef whose career soared in that decade, these pork chops make for a dinner that is as steady and simple as it is elegant and rich. The chops are broiled beneath a glaze of maple syrup and balsamic vinegar, then served with soft apple slices and a dusting of Clinton-era nostalgia: chopped pecans and candied ginger. (Polenta is the perfect accompaniment -- stir in some goat cheese and rosemary instead of the more typical butter and Parmesan.)", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Restaurant-style-Pork-Chops/Restaurant-style-Pork-Chops-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 Servings", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "fall, gluten-free, main course, pork, pork chops", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 375}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 735, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "4 grams", "proteinContent": "43 grams", "saturatedFatContent": "7 grams", "sodiumContent": "895 milligrams", "sugarContent": "59 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup maple syrup", "1 tablespoon balsamic vinegar", "1 tablespoon dark brown sugar", "1/2 teaspoon ground cinnamon", "1/2 cup pecans", "4 (1 1/4-inch thick) pork chops", "Kosher salt", "freshly ground black pepper", "Extra-virgin olive oil", "2 green apples, cored", "1/4 cup finely chopped candied ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a broiler or light a charcoal grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small nonreactive bowl, whisk together the syrup, vinegar, sugar and cinnamon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a small pan over medium heat, add the pecans and about 2 tablespoons of the maple-syrup sauce and cook for a few minutes, until the nuts are glazed and fragrant. Transfer the nuts to a plate and spread them out to cool. Transfer the cooled nuts to a cutting board, chop roughly and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the pork chops aggressively with salt and pepper, then drizzle with olive oil. When the broiler is hot, or the coals are covered with gray ash and you can hold your hand 5 inches above them for only 1 to 2 seconds, broil or grill the meat for approximately 7 minutes per side. Brush with some of the remaining maple glaze every 2 or 3 minutes, turning them frequently to prevent the sugar from burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chops are cooked, remove from the broiler or grill and let them rest for 5 minutes before serving. Meanwhile, slice the cored apples into thick rounds, drizzle with olive oil, season lightly with salt and pepper and place on the broiler pan or grill until tender when pierced with a fork. These, too, should be brushed with the maple glaze and turned frequently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve chops with the apple slices, sprinkled with pecans and candied ginger."}]}