{"@context": "http://schema.org", "@type": "Recipe", "name": "Winter Squash Puree With Tahini", "description": "This popular appetizer from the Middle East is a sort of sweet-tasting hummus, in which winter squash substitutes for chickpeas. This recipe is an adaptation of one by the cookbook author Clifford A. Wright.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/20/health/20recipehealth_600/20recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 3 1/2 cups", "recipeCuisine": "middle eastern", "recipeCategory": "", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter, side dish, tahini, winter squash", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 169, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "491 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 pounds winter squash, like butternut", "1/3 cup sesame tahini, stirred if the oil has separated out", "2 large garlic cloves, halved, with green shoots removed", "Salt to taste", "2 to 4 tablespoons freshly squeezed lemon juice, to taste", "1/2 teaspoon cumin seeds, lightly toasted and ground", "Pomegranate seeds for garnish", "extra virgin olive oil for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Cover a baking sheet with foil and brush lightly with olive oil. If using butternut squash, cut the squash in half, scoop out the seeds and stringy membranes, and lay cut-side down on the foil-covered baking sheet. If using a thick slice of squash, scrape off any membranes. Bake 45 minutes to one hour, or until very soft. A knife should cut through it without resistance, and the skin should be wrinkled. Remove from the heat and allow to cool, then peel and transfer to a food processor fitted with the steel blade. Add the tahini, and puree until smooth and creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the garlic and 1/2 teaspoon salt in a mortar and pestle, and mash to a paste. Add to the food processor along with the lemon juice and cumin, and blend together. Add salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound the puree in a wide bowl or on a plate. Drizzle a little olive oil over the top, and garnish with pomegranate seeds. Serve with warm pita bread."}]}