{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Marinated Tomatoes and Summer Herbs", "description": "The easiest summer dinner known to man, <I>pasta con salsa crudo</I>, is a one-bowl, infinitely variable riot of seasonal flavors. It can be made with fancy Italian tuna and local heirloom tomatoes for foodies, or with supermarket mozzarella and tomatoes for children, or with excellent olives and extra pine nuts for vegetarians. It puts you in the kitchen for about a half-hour at the tail end of lunchtime. After that, all there is to do is cook the pasta, and serve with or without crusty bread, boiled corn, sliced tomatoes, or a nice, simple green salad.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/07/19/dining/19COOKING-PASTA-MARINATED-TOMATOES2/19COOKING-PASTA-MARINATED-TOMATOES2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, quick, pastas", "keywords": "appetizer, main course, pasta, tomato, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 700}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 617, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "88 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "5 grams", "proteinContent": "16 grams", "saturatedFatContent": "3 grams", "sodiumContent": "510 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["About 1 1/2 pounds ripe tomatoes, halved or quartered if small, diced if large", "Salt", "2 cans olive oil-packed tuna or 1 pound mozzarella cheese, diced (optional)", "2/3 cup pitted oil-cured black olives, halved, or 1/2 cup pitted green olives, chopped, or 3 tablespoons capers (optional)", "2/3 cup chopped fresh herbs (basil, parsley, mint, chives, cilantro, scallion tops, or a combination), more for garnish", "Freshly grated zest of 1 lemon (optional)", "About 3/4 cup extra virgin olive oil", "Freshly ground black pepper", "2 pounds short pasta, like fusilli, farfalle or penne", "Hot red pepper flakes (optional)", "1/2 cup toasted pine nuts (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Up to 4 hours before serving, put tomatoes in a large bowl and sprinkle all over with salt. Set aside for 30 minutes, then drain off liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tuna and its oil, olives or capers, if using. Add herbs and zest. Add olive oil, salt and pepper to taste and stir gently, flaking tuna into pieces. Cover and set aside at least 1 hour or up to 3 hours, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook pasta in plenty of boiling salted water. Drain very well. Combine tomatoes and pasta well, then taste and add more oil, salt and pepper to taste. Add red pepper flakes if desired. Sprinkle with pine nuts, if using, and chopped herbs. Serve immediately."}]}