{"@context": "http://schema.org", "@type": "Recipe", "name": "Epigram of Lamb", "description": "This recipe is an adaptation of one that ran in The Times in 1879 and came from a publication called Young Ladies’ Magazine. And although it takes two days to make the actual work involved is brief. The recipe instructs you to serve it with peas, although I’ve seen other versions insisting on asparagus; both are great choices. I made two small changes to the Times recipe. Rather than frying the cutlets in lard (feel free to do so if you like), I used a combination of butter and olive oil. And I included lemon wedges for squeezing over the cutlets at the table, an Italian touch.\n\nAfter making epigram of lamb, Eric Korsh, the chef at Restaurant Eloise in Sebastopol, Calif., called it a “perfect simple recipe.” The braising makes for tender, fragrant cutlets, and there’s something in the sautéing that makes the fat in the lamb seem extra succulent. “It’s like lamb Wiener schnitzel, but beautiful,” Korsh said.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/21/dining/Epigram-of-Lamb/Epigram-of-Lamb-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "bread crumbs, lamb breast, main course", "aggregateRating": null, "recipeIngredient": ["2 pounds lamb breast, trimmed of excess fat", "1/2 Spanish onion, chopped", "1 large carrot, peeled and chopped", "2 ribs celery, chopped", "3 cloves", "8 black peppercorns", "3 sprigs parsley", "4 sprigs thyme or sage or rosemary (or all 3)", "Salt", "Freshly ground black pepper", "2 eggs, lightly beaten", "1 to 2 cups coarse dry bread crumbs", "1 tablespoon butter, more if needed", "1 tablespoon olive oil, more if needed", "1 lemon, cut into wedges", "Cooked fresh peas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the lamb in a large, heavy braising pot. Add the onion, carrot, celery, cloves, peppercorns, parsley and thyme. Season with salt. Add just enough water to cover and set over medium-high heat. When it comes to a boil, reduce the heat and simmer, covered, until the meat is falling off the bone, 1 1/4 to 2 hours. Let the meat cool in the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the meat on a large plate or baking sheet. Cover with plastic wrap. Cover with another plate or baking sheet, place a weight on top and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, slice the lamb on the bias. The slices should be about 1/3-inch thick. Season with salt and pepper. Arrange one shallow bowl with the beaten egg and another with the bread crumbs. Place a large nonstick sauté pan over medium heat and add the butter and olive oil. Dip the lamb cutlets first in the egg, then the bread crumbs. Fry until golden brown on both sides, 2 to 3 minutes per side. Do this in batches, adding more butter and olive oil if needed. Serve with lemon wedges and fresh green peas."}]}