{"@context": "http://schema.org", "@type": "Recipe", "name": "Country Captain", "description": "Country Captain is a dish you’ll find throughout the Lowcountry of South Carolina and Georgia, in restaurants and home dining rooms alike. It has been a staple of Southeastern Junior League cookbooks since at least the 1950s and is found in various forms in older cookbooks as far back as the 18th century. It is, simply, chicken fried in butter or bacon fat, then stewed in the oven with tomatoes fragrant with curry and pepper and served over white Carolina rice. Made correctly, it captures exactly that moment of excitement you can feel when first arriving in the region from far away: a sense that everything really is different in the South, that it is the one last, true regional culture in the United States.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/07/24/dining/sifton-country-captain-horizontal/sifton-country-captain-horizontal-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, one pot", "keywords": "bacon, chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 545}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1072, "unsaturatedFatContent": "47 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "78 grams", "fiberContent": "9 grams", "proteinContent": "65 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1579 milligrams", "sugarContent": "12 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/4 cup flour", "Kosher salt", "Freshly ground black pepper", "1 teaspoon dried thyme", "2 tablespoons butter", "3 pounds (about 8) chicken thighs", "4 slices bacon", "1 medium yellow onion, diced", "1 medium green pepper, seeded and diced", "2 ribs celery, diced", "1 tablespoon minced garlic", "2 tablespoons curry powder", "3 tablespoons currants", "1 28-ounce can chopped tomatoes and their juices", "3 tablespoons slivered almonds, toasted", "Cooked white rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour, 2 teaspoons kosher salt, 1 teaspoon freshly ground black pepper and the thyme in a bowl. In a large skillet, melt the butter over medium-high heat until it foams. Dredge the chicken in the flour mixture, shaking off excess, and fry, in batches if needed, until browned on all sides, about 8 minutes. Transfer the chicken to a plate and drain off all but 1 tablespoon of the fat in the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to medium heat, add the bacon and fry until crispy. Transfer to a plate. Once cool, crumble and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion, pepper, celery, garlic, curry powder and 1 tablespoon of the currants to the skillet and sauté over medium-high heat until soft and fragrant, about 7 minutes. Stir in the tomatoes and their juices, bring to a boil and simmer over medium-low heat for 10 minutes. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread 1 cup of the tomato sauce in the bottom of an ovenproof casserole large enough to hold the chicken snugly in one layer. Arrange the chicken on top. Pour the remaining sauce over and around the chicken. Cover tightly with foil and bake for 35 minutes. Remove the foil and cook for 15 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with the crumbled bacon, remaining currants and slivered almonds. Serve with cooked rice and any condiments you wish."}]}