{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Asparagus, Fresh Fava Beans and Saffron", "description": "Fava beans top my list of spring favorites. The 15 minutes that it will take you to shell and skin these high-protein, high-fiber treasures is time well spent, because their season is, sadly, a short one. A warning, though: fava beans are toxic to individuals with favism, caused by an inherited blood enzyme deficiency. Be cautious when trying fava beans for the first time.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT1H", "recipeYield": "Serves four to six", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "gluten-free, healthy, high fiber, kosher, low cholesterol, nut-free, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 529, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "82 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "15 grams", "proteinContent": "28 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1399 milligrams", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds fava beans", "About 7 cups chicken or vegetable stock, as needed", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion or spring onion", "Salt, preferably kosher salt, to taste", "2 garlic cloves, minced", "1 1/2 cups Italian arborio rice", "1 pinch of saffron threads", "1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "1 pound asparagus, trimmed and cut into 1-inch pieces", "1/2 cup freshly grated Parmesan cheese", "Freshly ground pepper to taste", "2 tablespoons chopped chives (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fava beans. Shell them while you bring a medium pot of water to a boil. Drop the beans into the water, and boil small favas for one minute, large favas for two minutes. Transfer at once to a bowl of ice-cold water. Drain. Remove the skins, using your thumbnail to open up the skin at the spot where the bean attached to the pod, then gently squeezing out the bean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the stock or broth into a saucepan, and bring it to a boil. Add the asparagus, and blanch for three minutes. Remove the asparagus with a slotted spoon or skimmer, refresh in a bowl of cold water, drain and set aside. Turn down the heat under the stock, and keep at a simmer with a ladle nearby or in the pot. Make sure that it is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a wide, heavy skillet or saucepan, and add the onion and 1/2 teaspoon salt. Cook, stirring, until tender, about three minutes. Add the garlic and the rice. Cook, stirring, until the grains of rice are separate and beginning to crackle, about one to two minutes. Rub the saffron between your thumb and fingers, and stir into the rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine, and stir over medium heat until it has been absorbed by the rice. Begin adding the simmering stock, two ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice and should be bubbling, not too slowly nor too quickly. Cook, stirring often, until the liquid is almost absorbed. Add another ladleful or two of the stock, and continue to cook in this fashion — adding more stock when the rice is almost dry, then stirring — for 15 minutes. Then stir in the asparagus and the fava beans and another ladleful or two of stock. Continue adding stock and stirring the rice for another 10 to 15 minutes, until the rice is cooked al dente and the vegetables are tender. Add more stock to the rice, and stir in the Parmesan, pepper and chives. Remove from the heat. Taste and adjust salt. The rice should be creamy. Stir once and serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than lumping in a mound."}]}