{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple Budino", "description": "", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, eggs, maple syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 791, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "65 grams", "fiberContent": null, "proteinContent": "7 grams", "saturatedFatContent": "39 grams", "sodiumContent": "325 milligrams", "sugarContent": "44 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup maple syrup (preferably grade B)", "4 cups heavy cream", "3/4 teaspoon kosher salt", "1/2 teaspoon vanilla extract", "1 large egg", "7 large egg yolks", "1/3 cup dark brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Fill a kettle with water and place over high heat to bring to a boil. In a 4 to 6 quart saucepan, bring maple syrup to a boil and cook over medium heat until thickened and reduced by about half, about 5 minutes. Remove from heat and whisk in cream, salt and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together egg, yolks and brown sugar. Add about a third of the cream mixture, and whisk to blend. Pour into remaining cream mixture and whisk until well blended. Strain through a fine-mesh strainer. Divide evenly among six 8-ounce ramekins, and place in a deep metal baking or roasting pan (using a glass or ceramic pan may increase baking time). Carefully add enough boiling water to pan to come halfway up sides of ramekins. Cover pan securely with foil to seal it closed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 20 minutes, then rotate pan, release steam by lifting foil cover and replace foil securely. Continue baking — rotating pan, releasing steam and re-covering every 15 to 20 minutes — until custards are completely set around edges and slightly loose in centers, about an hour more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from oven, remove foil and allow custards to come to room temperature in water bath. Remove from pan, cover each custard with plastic wrap (not touching surface) or a small plate and refrigerate for at least 30 minutes or up to 2 days before serving."}]}