{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Shrimp With Snow Peas and Red Peppers", "description": "This is not unlike the shrimp with snow peas you get in many Cantonese restaurants. But there are more vegetables in this version.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/18/health/18recipehealth_600/18recipehealth_600-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves four", "recipeCuisine": "asian", "recipeCategory": "dinner, one pot", "keywords": "dairy-free, gluten-free, healthy, nut-free, main course, shrimp, snow peas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "20 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1022 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound snow peas or sugar snap peas, strings and stems removed", "2 teaspoons cornstarch", "1 1/2 tablespoons soy sauce", "1 tablespoon rice wine or dry sherry", "2 teaspoons sesame oil", "1 teaspoon sugar", "1 pound medium shrimp, shelled and deveined", "1/2 cup chicken or vegetable stock", "2 tablespoons vegetable, peanut or canola oil", "1 tablespoon chopped fresh ginger", "3 large garlic cloves, green shoots removed, minced", "1 red bell pepper, cut into 1-inch squares", "3 scallions, trimmed and cut into 1-inch lengths, dark green parts separated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the snow peas or sugar snap peas. Boil 30 seconds, and transfer immediately to the ice water. Allow to cool for a few minutes, drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, mix together 1 teaspoon of the corn starch, 1 1/2 teaspoons soy sauce, 1 teaspoon of the rice wine or sherry, 1 teaspoon of the sesame oil, and 1/2 teaspoon of the sugar. Add the shrimp, and stir together to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining corn starch, soy sauce, rice wine or sherry, sesame oil and sugar in another bowl. Add the stock, and stir together well. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy nonstick skillet or wok over high heat until a drop of water evaporates immediately upon contact. Add 1 tablespoon of the oil, and turn the heat to medium. Add the ginger and garlic, and stir together for about 20 seconds, then add the red pepper and the white and light green parts of the scallions. Stir-fry for two to three minutes, until the pepper begins to soften. Stir to the side of the pan. Add the remaining oil and the shrimp. Cook, stirring, for two minutes, stir in the snow peas or snap peas, and continue to stir-fry for another two or three minutes until the shrimp is pink and cooked through. Give the sauce a stir, and add it to the pan along with the dark green ends of the scallions. Stir everything together with the sauce until the shrimp and vegetables are lightly glazed. Serve hot, with rice."}]}