{"@context": "http://schema.org", "@type": "Recipe", "name": "Heavenly Hots", "description": "This recipe appeared in The Times in an article by Joanna Pruess. The recipe came from Bridge Creek Restaurant in Berkeley, Calif. A few tips: Don’t cook the pancakes all the way through. You want the center to be a pocket of cream. The pancakes are so fragile that it may take a few tries to flip them. I used the thinnest, most flexible spatula I own, wedged it halfway under the pancake, letting the other half hang, then turned my wrist and gently laid it down on the other side. I recommend this over more aggressive flipping, which will tear the pancakes.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2016/05/24/dining/24COOKING-HEAVENLY-HOTS2/24COOKING-HEAVENLY-HOTS2-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Makes 50 to 60 small pancakes", "recipeCuisine": "italian", "recipeCategory": "breakfast, dinner", "keywords": "eggs, sour cream, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "recipeIngredient": ["4 large eggs", "1/2 teaspoon salt", "1/2 teaspoon baking soda", "4 tablespoons cake flour", "2 cups sour cream", "3 tablespoons sugar", "Solid vegetable shortening for greasing griddle or skillet"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together all the ingredients except the vegetable shortening in a large bowl; beat until smooth. This can also be done in a blender. Chill the batter overnight. (The batter will keep, refrigerated, for up to one week.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, heat the griddle or skillet over medium-high heat. Beat the batter to re-emulsify it. Lightly coat the griddle or skillet with shortening. Drop small spoonfuls — I used ¾ tablespoon — of batter onto the griddle, making sure that when they spread out they measure less than 3 inches in diameter. When a few bubbles appear on top of the pancakes and the bottoms are browned, turn and cook the second side briefly. (You don’t want to cook the pancakes all the way through because you want the center to remain creamy.) Serve with syrup or honey on the side."}]}