{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey and Red Pepper Hash", "description": "This sweet and spicy turkey and red pepper hash is much like a beef picadillo that might be used to fill an empanada or to stuff a chili pepper. I make quick soft tacos most often with warm corn tortillas. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/02/16/science/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "Serves six to eight", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, weekday", "keywords": "gluten-free, healthy, main course, red pepper, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 28}, "recipeIngredient": ["1 (28-ounce) can tomatoes, with juice", "2 tablespoons canola oil", "1 medium red onion, finely chopped", "2 red bell peppers, cut in small (1/4 inch) dice", "2 large garlic cloves, minced", "Salt to taste", "1 1/2 pounds ground turkey", "10 black peppercorns, ground in a spice mill", "1 teaspoon ground cinnamon", "2 teaspoons medium-hot chili powder", "4 cloves, ground in a spice mill (1/2 teaspoon ground cloves)", "1 tablespoon plus 1 teaspoon rice vinegar", "12 to 16 corn tortillas", "3 tablespoons chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the tomatoes with their juice until smooth in a food processor fitted with the steel blade or in a blender. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy nonstick skillet. Add the onion. Cook, stirring, until tender, three to five minutes. Add the bell peppers, garlic and a pinch of salt. Cook, stirring, until crisp-tender, about five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the turkey to the pan and season with salt, ground pepper, cinnamon, chili powder and cloves. Raise the heat to medium-high, and press the turkey into a layer in the pan. Let it brown for a minute or two. Continue to stir, press down into the pan and cook until all of the meat is nicely browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the puréed tomatoes and vinegar, and bring to a simmer. Turn the heat to medium-low, and simmer uncovered, stirring often, until the tomatoes have cooked down and caramelized slightly, 20 to 30 minutes. Taste and adjust seasoning. Remove from the heat, serve on hot corn tortillas and sprinkle with chopped cilantro. Alternatively, use as a filling for enchiladas, quesadillas or vegetables."}]}