{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp in Tomatillo and Herb Sauce", "description": "This fragrant, pungent shrimp dish is an adaptation of a dish from Veracruz. In the authentic dish the herbal flavor comes from hoja santa, an aniselike Mexican herb that isn’t easy to find in the United States. I’ve created a flavor that is reminiscent of hoja santa by combining basil, tarragon and mint.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/09/17/health/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "Serves four", "recipeCuisine": "mexican", "recipeCategory": "dinner, easy, weekday", "keywords": "gluten-free, healthy, main course, shrimp, tomatillo", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 194, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "21 grams", "saturatedFatContent": "1 gram", "sodiumContent": "806 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 large garlic cloves, peeled and halved", "Salt to taste", "2 tablespoons extra virgin olive oil", "1/2 pound tomatillos, husked", "2 serrano chilies, stemmed", "1/2 cup fresh basil leaves", "2 tablespoons fresh mint leaves", "1 tablespoon fresh tarragon leaves", "1 1/4 pounds medium shrimp, peeled and deveined", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic in a mortar and pestle with a generous pinch of salt and grind to a paste. Add 1 tablespoon of the olive oil and blend together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler. Cover a baking sheet with foil and place the tomatillos on top, stem side down. Place under the broiler at the highest rack setting and broil two to five minutes, until charred on one side. Turn over and broil on the other side for two to five minutes, until charred on the other side. Remove from the heat and transfer to a blender, tipping in any juice that may have accumulated on the baking sheet. Add the chilies, basil, mint and tarragon and blend until smooth. Season to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the shrimp with salt and pepper. Heat the remaining tablespoon of olive oil over medium-high heat in a heavy saucepan and add the shrimp. Cook on one side for one minute, then, using tongs, turn the shrimp over and cook on the other side for one minute. Remove from the pan and set aside on a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic paste to the hot pan and cook, stirring, for another 30 seconds to a minute, until fragrant. Add the tomatillo mixture, stir together, turn the heat to medium low and simmer, stirring often, for five minutes, until the sauce thickens slightly. Return the shrimp to the pan, bring to a simmer and cook, stirring often, for about three minutes, until the sauce coats the shrimp and the shrimp is tender but still moist. Taste, adjust salt and serve."}]}