{"@context": "http://schema.org", "@type": "Recipe", "name": "Samfaina", "description": "This Catalan dish is akin to ratatouille, the French dish that rummages around in the summer garden to combine eggplant, zucchini, bell peppers, tomatoes and onions in a pot that simmers over low heat. The vegetables soften and collapse into one another, and the flavors meld. Samfaina goes further, though: The ingredients are chopped into very small pieces, then cooked for several hours until the mixture is so thick and caramelized that it almost resembles a vegetable marmalade. It’s often used as a sauce for rabbit, chicken or salt cod, but it can also be a side dish unto itself. It is a time investment — lots of chopping to be done before hours of cooking and simmering — but your efforts will yield dinner for the rest of the week. The samfaina will taste better the next day, and it’s delicious hot or cold. Spoon it on a sautéed or grilled piece of fish, grilled sausages, poached eggs or a thick piece of toast. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/21/dining/Samfaina/Samfaina-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, one pot", "keywords": "eggplant, red bell pepper, gluten-free, vegan, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 156, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "672 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 medium eggplant, peeled and diced very small", "Salt", "1/4 cup extra virgin olive oil", "2 medium onions, very finely chopped", "4 large garlic cloves, minced", "2 red bell peppers (or one red and one green), peeled, seeded and sliced in thin strips or diced small", "1 medium zucchini, peeled and finely chopped", "Black pepper", "1 pound ripe tomatoes, peeled, seeded and chopped, or a 14-ounce can, drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay eggplant pieces on two layers of paper towels. Sprinkle with salt. After 30 minutes, squeeze out liquid and pat dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil over medium heat in an earthenware casserole over a flame tamer or in a Dutch oven. Add onions and cook, stirring often, until they soften, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a generous pinch of salt and the garlic, and stir for about 30 seconds. Add the remaining olive oil along with the eggplant, bell peppers, zucchini and black pepper. Turn the heat to low, stir, cover and cook until the vegetables are soft, about 1 hour, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tomatoes, season with salt, cover again and cook until the mixture has reduced to a thick relish, 2 to 3 more hours, stirring occasionally. Taste and adjust seasonings. Before serving, allow to sit for at least 1 hour, or better yet refrigerate overnight."}]}