{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Hour Texas Chili", "description": "One-Hour Texas Chili can be used for Frito pie. You top either a small open bag of Fritos, or a pile of Fritos on a plate, with this beef chili, grated Cheddar cheese and chopped onions. When served on a plate, some people call it a Straw Hat.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/onehourtexaschili/onehourtexaschili-articleLarge.jpg", "totalTime": "PT1H40M", "recipeYield": "6 to 8 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "chili pepper, ground beef, spices, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 163}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 240, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "27 grams", "saturatedFatContent": "3 grams", "sodiumContent": "406 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 dried ancho chiles, stems and seeds removed", "2 dried chipotle chiles, or substitute canned chipotle chiles and forgo soaking them", "2 tablespoons vegetable oil or rendered bacon fat", "1 medium yellow onion, quartered", "4 cloves garlic, chopped", "2 pounds ground beef chuck, preferably coarsely ground passed through the large holes of a grinder only once", "4 dried pequin chiles or ¼ teaspoon cayenne pepper", "1 tablespoon ground cumin", "1 teaspoon dried oregano", "1/2 teaspoon ground cloves", "1/2 teaspoon ground cinnamon", "Salt", "pepper", "2 teaspoons masa harina, or as needed", "2 tablespoons lime juice", "Grated Cheddar cheese, for garnish", "Diced onions, for garnish", "Pickled jalapeños, sliced, for garnish", "Sour cream, for garnish", "Fritos, for serving, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy skillet, heat the dried ancho and chipotle chiles on medium-high heat about a minute on each side. Turn off the heat, cover the chiles with water and soak them until rehydrated, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a Dutch oven or other large pot over medium heat, heat 1 tablespoon vegetable oil or bacon fat. Add the onions and sauté until they start to brown, about 10 minutes. Add the garlic and cook for 30 more seconds. Transfer to a blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the ground beef into balls the size of marbles. Return the Dutch oven to medium heat, add 1 tablespoon vegetable oil or bacon fat and, when it is hot, add the meatballs. Stir occasionally until lightly browned, about 10 minutes, then remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the chiles well, and remove and discard stems and seeds. Add the chiles to the blender. Add the canned chipotles, if using, pequin chiles or cayenne, cumin, oregano, cloves, cinnamon and 1 cup water. Blend until smooth. Add to the Dutch oven with the browned meatballs along with 4 cups water. Bring to a boil, then reduce heat to low and simmer uncovered for 45 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust salt and pepper to taste. If the chili looks too thin, slowly stir in the masa harina. Add the lime juice, and simmer for 15 minutes more. Serve topped with grated cheese, diced onions, pickled jalapeños and sour cream. Or serve as Frito pie: For each serving, mound 1 cup Fritos in a bowl and top with 1 cup chili, ¼ cup grated cheese, 1 tablespoon diced onions, sliced jalapeños and sour cream."}]}