{"@context": "http://schema.org", "@type": "Recipe", "name": "Sesame Flatbread", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, sesame oil, whole wheat flour, appetizer, fall, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 362, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "159 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon active dry yeast (4 grams)", "1 teaspoon sugar (5 grams)", "1 1/2 cups all-purpose flour 182 grams, more for work surface", "1/2 cup whole-wheat flour (67 grams)", "1 teaspoon fine sea salt (5 grams)", "6 tablespoons unsalted melted butter or canola oil 85 grams, more for bowl and baking sheet", "3 tablespoons toasted Asian sesame oil (42 grams)", "2 tablespoons sesame seeds (20 grams)", "Coarse sea salt, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together 2/3 cup warm water (154 grams), yeast and sugar. Let the mixture stand until foamy, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk together the flours and salt. Stir in the yeast mixture and butter or canola. Knead the dough on a lightly floured surface until smooth and elastic. Transfer dough to a lightly greased bowl and cover it with a dish towel. Let it rise in a warm place until doubled, about 1 1/2 hours. Punch down the dough and knead it for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees. Divide the dough into 6 equal balls. On a lightly floured surface, roll out a ball into an 8-inch circle. Brush with sesame oil and sprinkle with 1 teaspoon sesame seeds. Fold in all four sides of the circle to meet in the middle, forming a rectangle. Roll the dough again to 8 inches in diameter, then brush with sesame oil, fold in the sides again and roll to 8 inches. Brush the surface with additional sesame oil and transfer dough to a large greased baking sheet. Sprinkle with coarse sea salt. Repeat with the remaining dough balls. (You may need to use several baking sheets, or bake in batches, keeping unrolled dough loosely covered with plastic wrap or a dish towel until ready to use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden and slightly puffed, 7 to 10 minutes. Transfer to a wire rack to cool slightly."}]}