{"@context": "http://schema.org", "@type": "Recipe", "name": "Lion’s Head Meatballs", "description": "", "author": {"@type": "Person", "name": "Andrea Reusing"}, "image": null, "totalTime": "PT2H", "recipeYield": "Serves 6", "recipeCuisine": "asian", "recipeCategory": "dinner, project", "keywords": "main course, mushroom, pork", "aggregateRating": null, "recipeIngredient": ["10 dried black mushrooms (available at Asian markets)", "6 cups chicken stock", "2 1/2 pounds fatty ground pork (at least 30 percent fat), preferably from a pasture-raised pig", "2 egg whites", "1/2 cup plus 1 tablespoon shao xing wine or dry sherry", "3 tablespoons soy sauce", "2 tablespoons plus 1 1/2 teaspoons sugar", "1 tablespoon toasted sesame oil", "3 1/2 teaspoons kosher salt plus more to season", "1/2 teaspoon freshly ground black pepper", "3/4 cup minced scallions, white and light-green parts only; reserve green parts for garnish", "2 tablespoons finely minced ginger", "2 quarts plus 2 tablespoons vegetable oil", "1/3 cup ginger, sliced into very thin threads or matchsticks", "3/4 cup dry white wine", "1 teaspoon black vinegar (optional)", "18 medium shiitake mushrooms, stems removed", "2 tablespoons cornstarch, mixed with 2 tablespoons water", "3 bunches watercress, trimmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the dried mushrooms in 2 cups hot chicken stock until partially softened, about 30 minutes. Meanwhile, in a large bowl, combine the pork, egg whites, 3 tablespoons shao xing, soy sauce, 2 tablespoons sugar, sesame oil, 2 teaspoons salt and pepper with a wooden spoon, mixing thoroughly for about 3 minutes. Stir in the scallions and minced ginger. Form the mixture into 12 large meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep, heavy pot, add 4 inches of vegetable oil. Heat over medium-high until it reaches 375 degrees. With a slotted spoon, gently lower 3 or 4 meatballs into the oil and fry for 3 to 4 minutes, until they are deep golden brown but still raw in the center. Drain on a paper towel and repeat with the remaining meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Place a large, heavy casserole over low heat and add the soaked black mushrooms and their liquid, the remaining 4 cups chicken stock, the ginger threads, 6 tablespoons shao xing, wine, vinegar, sugar and 1½ teaspoons salt. Increase the heat to medium and bring to a low simmer. Cook, uncovered, 15-20 minutes, until the mushrooms have completely softened and the broth is fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the meatballs and return the broth to a simmer. Cover the casserole and place it in the oven for about 20 minutes, or until the meatballs are just cooked through. Remove the casserole from the oven and increase the heat to 450. With a slotted spoon, remove the mushrooms and meatballs to a large plate or bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, toss the shiitakes with 2 tablespoons vegetable oil and a generous amount of salt. Transfer to a baking sheet, tops facing up, and roast until golden brown, 7 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the black mushrooms are cool enough to handle, trim their stems with kitchen shears and discard. Dice the black mushroom caps into ½-inch cubes and return them to the casserole. Place the casserole over low heat, adjust the seasoning and, while stirring, gradually add the cornstarch-water mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium-high and lay the watercress into the simmering liquid, taking care to keep the stems facing the same direction and gently pushing down until the watercress is partially submerged. After a minute, as the watercress begins to wilt, use tongs to gently turn over. Cook another minute or so until just wilted. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the watercress in warm shallow bows and distribute the meatballs and shiitakes on top. Divide the broth between the bowls, making sure to spoon some over the meatballs and shiitakes. Garnish with reserved scallions."}]}