{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Zucchini Fritters", "description": "These zucchini fritters are based on a recipe I learned from the cookbook author Diane Kochilas. A classic mezze served in Greek taverna, they’re like a Greek version of latkes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/02/19/health/19recipehealth_600/19recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT2H20M", "recipeYield": "Serves six to eight", "recipeCuisine": "greek", "recipeCategory": "", "keywords": "appetizer, feta, zucchini, halal, healthy, kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 380}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 365, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "7 grams", "sodiumContent": "436 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds large zucchini, trimmed and grated on the wide holes of a grater or food processor", "Salt", "2 eggs", "1/2 cup chopped mixed fresh herbs, such as fennel, dill, mint, parsley (I like to use mostly dill)", "1 tablespoon ground cumin", "1 cup fresh or dry breadcrumbs, more as necessary", "Freshly ground pepper", "1 cup crumbled feta", "All-purpose flour as needed and for dredging", "Olive oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt the zucchini generously and leave to drain in a colander for one hour, tossing and squeezing the zucchini from time to time. Take up handfuls of zucchini, and squeeze out all of the moisture. Alternately, wrap in a clean dish towel, and squeeze out the water by twisting at both ends."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the eggs and add the shredded zucchini, herbs, cumin, bread crumbs, salt and pepper to taste and feta. Mix together well. Take up a small handful of the mixture; if it presses neatly into a patty, it is the right consistency. If it seems wet, add more breadcrumbs or a few tablespoons of all-purpose flour. When the mixture has the right consistency, cover the bowl with plastic wrap and refrigerate for one hour or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 inch of olive oil in a large frying pan until rippling, or at about 275 degrees. Meanwhile, take up heaped tablespoons of the zucchini mixture, and form balls or patties. Lightly dredge in flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil is very hot, add the patties in batches to the pan. Fry until golden brown, turning once with a spider or slotted spoon. Remove from the oil, and drain briefly on a rack. Serve with plain Greek style yogurt if desired."}]}