{"@context": "http://schema.org", "@type": "Recipe", "name": "Butter-Fried Oysters", "description": "There are easier ways to fry oysters, and faster ways, too, but if you’re going to bother to make them at home, you might as well have the best way. I won’t pretend it’s not a little bit of a project. There are bread crumbs to make, from a day-old French loaf. It’s easy if you have a blender or food processor — just remove the crust and pulse the cubes into fluffy crumbs. My recipe also calls for clarified butter. It can be made ahead, it keeps, and it really makes a difference.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/butterfriedoysters/butterfriedoysters-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, bread, butter, oyster", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 81}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 775, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "3 grams", "proteinContent": "31 grams", "saturatedFatContent": "26 grams", "sodiumContent": "823 milligrams", "sugarContent": "4 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 pound unsalted butter", "1 large, day-old French loaf or other hearth-style white loaf", "1 cup all-purpose flour", "Salt", "pepper", "24 shucked oysters, drained", "3 eggs, lightly beaten", "Red-pepper mayonnaise, optional", "Lemon wedges, optional", "Watercress or arugula, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a small saucepan over low heat, then raise the heat a little and cook at a bare simmer for about 10 minutes. Allow to cool slightly, then pour through a fine-meshed strainer. (Save any milky juices, solids or foam left behind to add to rice or vegetables.) The clarified butter can be kept in a covered jar in the refrigerator for several weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the crusts from the French loaf. Tear the bread into chunks and pulse in a food processor or blender to make about 4 cups of crumbs. The crumbs will keep in the refrigerator, loosely covered, for several days, or for longer in the freezer, tightly wrapped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the flour generously with salt and pepper. Dip the oysters in the flour and then in the beaten eggs. Spread a layer of bread crumbs on a baking sheet. Place the oysters on the sheet and sprinkle with more crumbs. Roll the oysters in the crumbs so that they are well coated, adding more if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wide cast-iron skillet over a medium-high flame. Add clarified butter to a depth of 1/2 inch. Toss in a bread crumb — if it browns quickly the butter is hot enough. Carefully slip in breaded oysters in a single layer, frying in batches if needed to avoid crowding. Adjust the heat to keep the oysters gently bubbling in the butter. It should take about 2 minutes to get a golden, crisp coating. Turn the oysters and brown the other side, then drain on kitchen towels. Serve hot with red-pepper mayonnaise, lemon wedges and arugula or watercress, if you like."}]}