{"@context": "http://schema.org", "@type": "Recipe", "name": "Evelyn Sharpe's French Chocolate Cake", "description": "Just as there will always be a place in the world for an understated but luxurious black dress, there will always be a place for flourless chocolate cake. This recipe from 1969 was one of the first published, long before the cake became fashionable. Today it may be a cliché, but it’s a swanky one. This cake is dense, but not the solid block of sweet that can make you wonder if you’re just eating chocolate ganache in cake form. Of course, since the recipe has so few ingredients, it is imperative to use truly delicious chocolate. The proportion of cacao, in case you’re wondering, should fall between 60 and 70 percent.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/cake/cake-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "10 servings", "recipeCuisine": "french", "recipeCategory": "quick", "keywords": "chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 612}, "recipeIngredient": ["1 pound semisweet chocolate", "10 tablespoons unsalted butter, softened", "1 tablespoon unbleached all-purpose flour (or matzo meal)", "1 tablespoon sugar", "4 eggs, separated", "Sweetened whipped cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line the base of an 8-inch springform pan with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the chocolate gently in the top of a double boiler over hot, not boiling, water. This is a critical step in the preparation and should be done very slowly (or it can be done more speedily in the microwave)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the melted chocolate from the heat and stir in the butter, flour and sugar. Beat the yolks lightly and whisk into the chocolate mixture gradually."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until they hold a definite shape but are not dry and fold into the chocolate mixture. Overbeating or underbeating will ruin the cake. The beaten egg whites should be folded smoothly, quickly and easily into the chocolate mixture. Pour into the prepared pan and bake for 15 minutes. Turn off the heat; open the oven door, leaving it ajar, and allow the cake to cool completely in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The cake is best served a little warm. Decorate with whipped cream. Run a long, thin knife under hot water and then slice the cake into small slivers. It is rich."}]}