{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck or Rabbit Livers With Onion Marmalade", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, duck liver, onion, rabbit liver, gluten-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 425, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "17 grams", "saturatedFatContent": "11 grams", "sodiumContent": "642 milligrams", "sugarContent": "22 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 tablespoons butter", "1 ½ pounds onions, peeled and thinly sliced", "½ cup sugar", "1½ teaspoons salt", "7 tablespoons sherry vinegar", "1 cup inexpensive red wine", "1 pound duck or rabbit livers", "1 teaspoon pepper", "2 tablespoons cooking oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "First, make the marmalade. Sizzle the butter in a saucepan over medium-high heat until it is nut brown, 3 to 4 minutes, then immediately add the onions, sugar and ½ teaspoon of the salt. Reduce the heat and stew gently until the onions are dark caramel brown, 30 to 45 minutes, being careful to not blacken them. Add the vinegar and wine and cook for another 30 minutes, stirring from time to time, until the butter floats separately from the onions. You need only a few spoonfuls of this for the livers, but don’t be angry! The ingredients were cheap, and this will keep for weeks, stored in a jar in the refrigerator. From thence it shall come to enliven sandwiches, charcuterie, roasts and all kinds of other stuff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On to the livers. Warm a plate in a low oven. Trim, rinse and pat the livers dry; season with the pepper and the remaining salt. Warm the oil in a nonstick skillet and fry the livers for about a minute and a half per side. Let them rest for 5 minutes on the warm plate, then slice and serve with a few tablespoons of marmalade on polenta, toast or crêpes parmentier (see recipe here)."}]}