{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Chilaquiles With Chicken", "description": "Chilaquiles is a sort of top-of-the-stove tortilla casserole. In its simplest form, it consists of a freshly made salsa into which you stir fried tortillas. Sometimes eggs are added, and sometimes chicken as well. The salsa can be red or green; even thick black beans may be used. I favor microwave-toasted tortillas, but if you don’t have the time, use baked tortilla chips. Serve this right after you’ve stirred in the tortilla chips, because if they’re not fried, they will quickly become soggy. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/03/health/03recipehealth_600/03recipehealth_600-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves four", "recipeCuisine": "mexican", "recipeCategory": "brunch", "keywords": "canned tomatoes, chicken breast, corn tortillas, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 241}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 327, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "8 grams", "proteinContent": "19 grams", "saturatedFatContent": "4 grams", "sodiumContent": "953 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (28-ounce) can tomatoes", "1 jalapeño chile, or 2 serranos, seeded for a milder sauce and chopped", "1/4 cup chopped onion, soaked for a few minutes in cold water, drained and rinsed", "2 garlic cloves, halved, green shoots removed", "1 tablespoon canola oil", "1/2 to 1 cup water, chicken or vegetable stock, as needed", "Salt to taste", "1 large chicken breast, poached and shredded about 2 cups shredded meat", "8 corn tortillas, toasted and coarsely broken up, or 2 cups baked tortilla chips", "1/2 cup crumbled queso fresco or feta cheese", "2 tablespoons chopped cilantro", "1 small red or white onion, cut into thick rings, soaked for five minutes in cold water, then drained, rinsed and dried on paper towels"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the tomatoes, chiles, chopped onion and garlic in a blender, and blend until coarsely pureed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy nonstick skillet or a wide saucepan over medium-high heat, and add a drop of the puree. It should sizzle. Add all of the tomato puree, and cook, stirring, for about five to ten minutes, until the sauce darkens, thickens and begins to stick to the pan. Add water or stock if the mixture seems dry, and season to taste with salt. Turn the heat to low, and simmer, stirring often, for about 15 minutes, until the sauce coats the front and back of a spoon. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the chicken and heat through. Stir in the tortilla chips or pieces, stir together for a half minute, and remove from the heat. Spinkle the cheese, cilantro and sliced onion over the top, and serve."}]}