{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Turkey, Mushrooms and Peas", "description": "Turkey makes an unexpected but welcome addition to this traditional risotto.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/11/30/science/01reciphealth/01reciphealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves four to six", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "appetizer, main course, arborio rice, turkey, gluten-free, healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 485, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "22 grams", "saturatedFatContent": "3 grams", "sodiumContent": "883 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 ounce dried porcini mushrooms (about 1 cup)", "5 cups well-seasoned chicken or vegetable stock", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "1 1/2 cups arborio rice", "1 to 2 garlic cloves to taste, minced", "Salt", "freshly ground pepper to taste", " 1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "1 1/2 cups diced turkey", "1 cup thawed frozen peas or cooked fresh peas", "2 tablespoons minced chives", "1/4 to 1/2 cup freshly grated Parmesan cheese (1 to 2 ounces)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mushrooms in a large Pyrex measuring cup, and pour in 2 cups boiling water. Allow to sit for 30 minutes. Line a strainer with cheesecloth, place it over a bowl and strain the mushrooms. Squeeze the mushrooms over the strainer then rinse several times to rid them of sand. Set aside. Combine the mushroom soaking liquid with the stock in a saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer over low heat, with a ladle nearby or in the pot. Make sure that the stock is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy nonstick skillet or a wide, heavy saucepan. Add the onion and a generous pinch of salt, and cook gently until the onion is just tender, about three minutes. Do not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the rice, porcinis and garlic. Stir until the grains separate and begin to crackle. Add the wine, and stir until it is no longer visible in the pan. Begin adding the simmering stock a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice and should be bubbling neither too slowly nor too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock, and continue to cook in this fashion, adding more stock and stirring when the rice is almost dry. You do not have to stir constantly, but stir often. After 15 minutes, stir in the turkey and the peas, and continue to add stock as instructed above. The risotto is done in 20 to 25 minutes, when the rice is just tender all the way through but still chewy. Taste now and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful or two of stock to the rice. Stir in the chives and Parmesan, and remove from the heat. The mixture should be creamy (add more stock if it isn’t). Serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}]}