{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Halibut With Lemons, Olives and Rosemary", "description": "Fish can be finicky dinner-party fare, especially for the distracted cook. Step away for a moment to sip your cocktail and your fillets might go from pearly to parched. This dish, though, inspired by one from Southern Italy, elegantly feeds a crowd. The fish, halibut, is seasoned with chile, salt and olive oil, then topped with rosemary, lemon and olives and roasted. It’s a lighter main dish that won’t leave anyone hungry.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/roasted-halibut-lemons-rosemary/roasted-halibut-lemons-rosemary-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "dairy-free, gluten-free, fish, halibut, olives, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1252}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 270, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "43 grams", "saturatedFatContent": "1 gram", "sodiumContent": "651 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 (8-ounce) halibut fillets, preferably at least 1-inch thick", "1 1/2 teaspoons extra virgin olive oil, more to taste", "Kosher salt", "Ground chile pepper, preferably Turkish or Aleppo", "2 rosemary branches", "1 small lemon, very thinly sliced", "1/4 cup sliced, pitted calamata or other good-quality black olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Place fish in a baking dish, brush fillets with 1 teaspoon of oil and season with salt and chile pepper. Top each fillet with a rosemary branch and several slices of lemon. Drizzle remaining oil over lemon slices and sprinkle with additional salt. Scatter olives over fish and pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until just opaque, about 10 minutes. If lemon slices have not browned or singed (this will depend on how thinly you slice them), place pan under broiler for 1 to 2 minutes. Serve drizzled with more olive oil; sprinkle with more salt and chili, if desired."}]}