{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Hash With Bacon and Melted Onions", "description": "In his home-cooking book “Ad Hoc at Home,” the surgically precise chef Thomas Keller gives instructions for cooking onions ideally for hash: melted but not mush, sweet but not stringy. His meat of choice is bacon, a nice shortcut for home cooks who may not have a haunch of beef around. This is an adaptation of his recipe. True to Keller form, this is not a weekday breakfast dish (it will take you a good 20 minutes to cook down the onions, and you'll dirty a few pots), but it is well worth an hour or so of your Sunday morning.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/01/17/dining/17COOKING-SWEET-POTATO-HASH1/17COOKING-SWEET-POTATO-HASH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "bacon, sweet potato, gluten-free, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "recipeIngredient": ["8 cups sliced onions (3 large ones)", "Kosher salt", "1 bay leaf", "4 sprigs thyme", "10 black peppercorns", "1 garlic clove, smashed and peeled", "1 stick unsalted butter, in 8 pieces", "12 ounces best-quality bacon, sliced about 1/2-inch thick", "3 pounds sweet potatoes, peeled, cooked (boiled, roasted or microwaved) and diced", "1 tablespoon minced chives", "Poached or sunny-side-up eggs, for serving optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put onions in a large skillet, place over medium-low heat, and sprinkle with 1/4 teaspoon salt. Cook, uncovered, reducing the heat to maintain a low simmer, about 20 minutes, until onions are soft and swimming in liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tie the bay leaf, 3 sprigs thyme, peppercorns and garlic in a piece of cheesecloth. Add to onions along with butter, stir and cover (not too tightly, some steam should be allowed to escape). Cook slowly 30 to 35 minutes, until onions are meltingly tender and coated in butter. The mixture should look creamy at all times: if butter separates or if pan looks dry, stir in cold water 1 teaspoon at a time. Season to taste with salt. (Onions can be made up to 3 days in advance and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut bacon crosswise into thick matchsticks. Pour 2 tablespoons water into a medium saucepan and set over medium heat. Add bacon, reduce heat to low, and cook for 30 minutes. Bacon will render its fat and become golden, but not completely crisp. Using a slotted spoon, transfer bacon to paper towels. Pour off excess fat from pan, leaving a thick film on bottom to cook hash; reserve the extra fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 200 degrees. Spread half of potatoes in pan, sprinkle with salt and add half the leaves of the remaining sprig of thyme. Cook undisturbed, over medium-low heat, until crisp, about 5 minutes. Add 1/2 cup melted onions and a quarter of the bacon and gently fold together until heated through. Transfer to an ovenproof serving bowl and keep warm. Repeat with remaining potatoes, a quarter of the bacon, another 1/2 cup onions (refrigerate leftover onions; they make a great sauce for fish) and remaining thyme leaves. Sprinkle hash with chives (if using) and remaining bacon. Serve hot, topped with eggs if desired."}]}