{"@context": "http://schema.org", "@type": "Recipe", "name": "Winter Strawberry Gelato", "description": "I’m calling this “winter” strawberry gelato only because I’m making it with frozen organic strawberries. You can use sweet, fresh strawberries when they’re in season. The recipe is inspired by Sherry Yard, a pastry chef who taught me that you can make perfectly wonderful ice cream with no cream and no eggs. I make this one with 2 percent milk, but you could use whole milk. If you’re thinking of using skim milk, substitute water and make sorbet.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/04/05/business/05recipehealth/05recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "Just under five cups, serving six to eight", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, gluten-free, healthy, vegetarian, milk, strawberry, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 104, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "64 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["1 1-pound bag frozen strawberries; or 1 pound ripe, sweet strawberries, hulled", "1/2 cup sugar, preferably organic fair-trade sugar", "1/4 cup water", "2 cups milk (2 percent or whole)", "2 teaspoons fresh lemon juice", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 1-quart container and one smaller container — for any extra gelato — in the freezer. Combine the strawberries, sugar and water in a medium saucepan, and bring to a simmer. Simmer until the strawberries thaw and become very soft, about 15 minutes. Remove from the heat, and transfer half the mixture to a blender. Since the mixture is hot, just cover the top of the blender jar with a dish towel pulled down tight. Blend until smooth, and then add half the milk. Blend again until smooth. Repeat with the remaining strawberries and milk. Transfer to a bowl, and chill in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the lemon juice and salt, and transfer to the container of an ice cream maker. Freeze according to the manufacturer’s directions. Scrape into the chilled container, and return to the freezer for at least two hours before serving. If frozen solid, allow to soften in the refrigerator for 20 to 30 minutes before serving."}]}