{"@context": "http://schema.org", "@type": "Recipe", "name": "Cherry Tomatoes Stuffed With Pesto", "description": "When I lived in Provence, I followed the local custom of setting a couple of pots of basil by my kitchen door to keep the flies away. I’m not sure why it works, but the essential oils in basil — which make this herb so heavenly, although apparently not to flies — have been shown to have anti-bacterial properties. A few studies have shown that the oils can inhibit some pathogenic bacteria that have become resistant to antibiotics. Basil also contains flavonoids that are believed to have some antioxidant properties; it’s an excellent source of vitamin K, and a very good source of iron, calcium and vitamin A. I’ve been serving these appetizers for decades. You can also make a warm side dish with medium-size tomatoes (see variation below).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/10/12/science/11recipehealth600/11recipehealth600-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves 12 as an hors d’oeuvre, six to eight as a side dish", "recipeCuisine": "italian", "recipeCategory": "easy, quick, weekday", "keywords": "appetizer, side dish, basil, cherry tomatoes, gluten-free, healthy, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 77, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "103 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 or 2 garlic cloves, to taste", "1 1/2 cups fresh basil leaves", "2 tablespoons pumpkin seeds or Mediterranean pine nuts", "Salt", "freshly ground pepper to taste", "1/4 cup extra virgin olive oil", "1/3 cup (2 1/2 ounces) freshly grated Parmesan", "1 pint cherry tomatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pesto, turn on a food processor fitted with the steel blade, and drop in the garlic. When it is chopped and adhering to the sides of the bowl, stop the machine and scrape down the sides of the bowl with a spatula. Add the basil, pumpkin seeds or pine nuts, salt, pepper and olive oil to the food processor, and process until smooth and creamy. Add the Parmesan, and pulse until well combined. You can also use a mortar and pestle. Add the basil leaves gradually, and mash with the pestle. Add the pumpkin seeds or pine nuts, garlic, salt and pepper. Mash to a paste with the basil. Work in the olive oil and the Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a paring knife, cut thin slices from the tops of the cherry tomatoes. Use a grapefruit spoon or small spoon to scoop the seeds and flesh from the center of each tomato. Lightly salt the hollowed out tomatoes if desired, and place them, cut side down, on a rack to drain for 15 minutes. Fill with the pesto, arrange on a platter and serve. Refrigerate or freeze any excess pesto."}]}