{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti Squash Gratin With Basil", "description": "Recently on the Recipes for Health page on Facebook, I asked readers what they were finding in their weekly delivered produce boxes. Requests for spaghetti squash recipes came pouring in. I was working on basil dishes already, so I decided to combine the two ingredients in this gratin.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/10/13/science/13recipehealth/13recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves six as a main dish, eight as a side", "recipeCuisine": "", "recipeCategory": "dinner, casseroles", "keywords": "gluten-free, healthy, gruyère, spaghetti squash, main course, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 443}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 182, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "719 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 spaghetti squash, about 3 pounds", "1 tablespoon extra virgin olive oil", "1 medium onion, finely chopped", "2 garlic cloves, minced", "Salt", "freshly ground pepper", "3 large eggs", "1/2 cup low-fat milk", "2 tablespoons chopped fresh basil (1/4 cup basil leaves)", "2 ounces Gruyère cheese, grated (1/2 cup)", "2 tablespoons freshly grated Parmesan or pecorino romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Pierce the squash in several places with a sharp knife. Cover a baking sheet with foil, and place the squash on top. Bake for one hour, turning the squash every 20 minutes until it is soft and easy to cut into with a knife. Remove from the heat, and allow the squash to cool until you can handle it. Cut in half lengthwise, and allow to cool further. Remove the seeds and discard. Scoop out the flesh, and place in a bowl. Run a fork through the flesh to separate the spaghetti-like strands, then chop coarsely. Measure out 4 cups squash. (Use whatever remains for another dish, or freeze.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a 2-quart gratin or baking dish. Heat the oil over medium heat in a large, heavy skillet, and add the onion. Cook, stirring, until tender, about five minutes. Add the garlic and a generous pinch of salt. Cook, stirring, for another 30 seconds to a minute until fragrant. Add the squash. Cook, stirring often, for five minutes until the strands of squash are a little more tender. Season to taste with salt and pepper, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Add the milk, salt (about 1/2 teaspoon), pepper and basil. Stir in the squash mixture and the Gruyère, and combine well. Scrape into the baking dish. Sprinkle the Parmesan or pecorino over the top, and gently press down to moisten."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 40 to 45 minutes until nicely browned and sizzling. Remove from the heat, and allow to cool for 10 to 15 minutes before serving. Serve hot, warm or room temperature."}]}