{"@context": "http://schema.org", "@type": "Recipe", "name": "Winter Squash Pie", "description": "Could you make Claire Fountain’s traditional pumpkin pie with a can of processed orange mystery pulp? Of course, Ms. Fountain says — if you think you can live with yourself after. But you’ll need to turn in your C.S.A. badge and your copy of “The Omnivore’s Dilemma.” ", "author": {"@type": "Person", "name": "Michael Tortorello"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/squashpie-still/squashpie-still-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 248, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "153 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium-size winter squash (Ms. Fountain likes Buttercups and orange Hubbards; if you go canned, and she’s definitely not recommending that, use unsweetened pumpkin)", "3/4 cup sugar (half white, half brown, packed)", "1/2 cup heavy cream", "1 tablespoon cornstarch", "2 teaspoons cinnamon", "1 teaspoon freshly grated nutmeg", "1/8 teaspoon crushed cloves", "Pinch of salt", "1 pie crust, homemade, of course", "4 eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the squash in half. This is the moment for the biggest knife in the drawer. Scoop out the seeds. Place each half facedown on a baking sheet lined with parchment or foil. Bake for 30 to 50 minutes at 385 degrees, until squash feels soft on the outside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After it cools from blistering to merely hot, scrape the meat from the skin with a spoon. Run the squash through a food processor until it looks like baby food. Measure 15 ounces — or roughly 2 1/4 cups — for the pie. Go ahead and feed the rest to a baby."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs. Add sugar and beat some more. Add heavy cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the cooked squash purée with the egg batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the cornstarch, cinnamon, nutmeg, cloves and salt in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the spice mixture to the squash goop. Unless you want a mouthful of cloves, might as well stir again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If your Thanksgiving table is filled with blue-ribbon bakers who can detect a little soft dough from across the room, blind-bake the crust for a flakier bottom. If you’re anyone else — including Ms. Fountain, at times — you’ll probably skip this step."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the filling into the pie crust. Bake the pie at 350 degrees for 35 minutes. Or 45. Or maybe 50. But don’t overbake. If the center jiggles like the back end of one of those music video dancers you wish the kids wouldn’t watch, it’s done. Serve with fresh whipped cream. After the kids go to sleep, Ms. Fountain says, whip in a shot of rum."}]}