{"@context": "http://schema.org", "@type": "Recipe", "name": "Longevity Noodles With Chicken, Ginger and Mushrooms", "description": "During Chinese New Year, long noodles are eaten in all corners of China. “Longevity noodles,” also presented at birthday celebrations, are never cut or broken by the cook, and if they can be eaten without biting through the strands, it’s considered even more auspicious. Longevity noodles are usually stir fried, presenting challenges to the home cook.\n\nNoodles should be stir-fried alone and lightly oiled so that they don’t clump together in the wok, and all ingredients must be completely dry so they sear properly.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2020/01/25/dining/jm-longevity-noodles/jm-longevity-noodles-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 3 main-dish servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "chicken, lo mein, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1477}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 615, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "69 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "38 grams", "saturatedFatContent": "3 grams", "sodiumContent": "832 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces thin fresh noodles, like lo mein or tagliarini", "2 teaspoons toasted sesame oil", "12 ounces boneless, skinless chicken thighs, cut into 1/4-inch-thick, bite-size slices", "1 tablespoon finely shredded ginger", "1 teaspoon plus 1 tablespoon Chinese rice wine or dry sherry", "1 teaspoon cornstarch", "1 teaspoon plus 1 tablespoon soy sauce", "Salt", "1/4 teaspoon ground white pepper", "2 tablespoons peanut or vegetable oil", "1/4 teaspoon red pepper flakes", "5 ounces (about 3 cups) thinly sliced Napa cabbage", "4 ounces (about 2 cups) fresh shiitake mushrooms, stems removed, caps thinly sliced", "1/2 cup finely shredded scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium saucepan of water to boil over high heat and cook noodles until just done, 3 to 5 minutes, stirring to prevent sticking. Drain in a colander and rinse with cold water until cool, then shake well to remove water. Return noodles to pot, add sesame oil, and toss."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chicken in a shallow bowl and add ginger, one teaspoon rice wine, cornstarch, one teaspoon soy sauce, 1/4 teaspoon salt and pepper. Mix gently to combine. In a small bowl, combine remaining one tablespoon rice wine and one tablespoon soy sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok over high heat until a bead of water evaporates almost on contact. Swirl in one tablespoon peanut oil, add red pepper flakes and stir-fry 10 seconds using a metal spatula. Push pepper flakes aside and add chicken, spreading in a single layer to maximize contact with the wok. Let cook undisturbed one minute, until chicken begins to sear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir-fry chicken and pepper flakes together, tossing in the wok, for a minute or 2 until just done. Remove to a bowl. Add cabbage and mushrooms and stir-fry one minute until just wilted but not cooked. Empty into the bowl with chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat wok, swirl in remaining one tablespoon peanut oil, and add noodles. Stir-fry 30 seconds, moving constantly to heat through. Swirl soy sauce-rice wine mixture and add to wok along with chicken-vegetable mixture and scallions. Sprinkle on 3/4 teaspoon salt and stir-fry a minute or 2 until chicken and vegetables are heated through."}]}