{"@context": "http://schema.org", "@type": "Recipe", "name": "Ginger-Glazed Short Ribs", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT5H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "dry red wine, short ribs, vegetables, main course", "aggregateRating": null, "recipeIngredient": ["3 cups dry red wine", "7 to 8 pounds bone-in short ribs, separated into whole ribs", "Kosher salt", "2 whole heads garlic, papery outer skins removed, cut in half horizontally", "5 large fresh shiitake mushroom caps, halved", "2 carrots, peeled and chopped", "2 medium yellow onions, peeled and quartered", "1 celery stalk, chopped", "1 4-inch piece fresh ginger, peeled and sliced crosswise 1/4-inch thick", "About a dozen allspice berries, lightly crushed", "1 cinnamon stick", "1 sheet konbu, 5 inches by 6 inches available at Japanese or health-food stores", "A dozen sprigs fresh thyme", "6 to 8 cups chicken stock, homemade or low-sodium canned", "6 tablespoons red wine vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. In a saucepan, boil the wine over high heat until reduced to 1/2 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously sprinkle the ribs on all sides with salt and transfer to a large roasting pan, bone side up. Scatter the garlic, mushrooms, carrots, onions, celery, ginger, allspice, cinnamon, konbu and thyme on the ribs. Mix 6 cups of the stock and vinegar with the reduced wine and add to the ribs. The liquid should come about 2/3 of the way up the sides of the meat. Add more stock if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pan tightly with layers of foil. Transfer to the oven and cook until the meat is very tender, 3 1/2 to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and carefully remove the foil. When the ribs are cool enough to handle, transfer them to a dish. Remove and discard the bones and any bits of vegetables and spice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the liquid in the pan through a sieve and discard the solids. Let the liquid settle, then spoon off the fat or use a fat separator. You should have about a quart of liquid. (At this point, you can refrigerate the meat and sauce, separately, for up to three days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish the dish, heat the oven to 375 degrees. Put the strained liquid back in the roasting pan and bring to a boil on the stove. Add the meat in a single layer. Transfer to the oven and baste frequently with the liquid, until shiny and thick but not sticky, and until the ribs are well glazed, 10 to 20 minutes. Serve the ribs with extra sauce."}]}