{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Tagine With Eggplant and Olives", "description": "Priorat, near the Mediterranean coast of Spain and a stone’s throw from Barcelona, produces wines with dark fruit flavors, spice, bold complexity and ample alcohol. To compete with reds like these, the food alongside must take no prisoners.It would have been simple enough to sear some rib-eyes, lamb chops or lusty sausages. But I looked across the Mediterranean to North Africa and came up with a tagine in which chicken is coated with robust spices and becomes more than mere white noise. Eggplant and olives round out the dish, and a splash of sherry vinegar brightens the sauce.If you have yet to equip your kitchen with a genuine terra-cotta tagine, you can cook the dish in a covered sauté pan or a fancy-pants tagine of enameled cast iron. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, easy, weekday", "keywords": "chicken, eggplant, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 59}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 664, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "5 grams", "proteinContent": "46 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1016 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons ground cumin", "1 tablespoon smoked paprika", "1 chicken, cut in 10 pieces", "3 tablespoons extra virgin olive oil", "1 medium red onion, quartered lengthwise", "2 small eggplants, about 1 pound total, quartered lengthwise", "3 garlic cloves, slivered", "1/3 cup pitted black niçoise olives", "1/2 cup chicken stock", "2 tablespoons sherry vinegar", "Salt", "black pepper", "1 tablespoon chopped tarragon, plus a few sprigs for garnish", "Rice or couscous for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On a plate, blend the cumin and paprika together. Dip the chicken pieces in spices to coat both sides. Heat 1 tablespoon oil in a large, heavy skillet over medium-high heat and brown chicken on both sides. Remove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions to the skillet and sear on cut sides until browned. Remove. Lower heat to medium and add remaining 2 tablespoons oil. Lightly brown eggplant on cut sides. Remove. Add garlic and olives, cook until the garlic has softened, then add the stock and vinegar. Bring to a simmer, deglazing the pan, then turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the browned onions. Scatter them in a terra-cotta tagine or in a sauté pan with a cover, then lay the chicken pieces on top. Chop the eggplant in 1-inch chunks and distribute them over the chicken. Pour stock mixture, with olives and garlic, on top. Season with salt and pepper and scatter chopped tarragon on top. Cover the tagine or pan and cook on medium-low heat for 40 minutes. Remove from heat and let rest 10 minutes. Garnish with tarragon sprigs and serve with rice or couscous."}]}