{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Meatballs With Chives and a Lime Raita", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": null, "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "chicken thigh, fresh herbs, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 58}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 231, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "0 grams", "proteinContent": "25 grams", "saturatedFatContent": "3 grams", "sodiumContent": "492 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup plain yogurt", "1/2 cup peeled, seeded, finely chopped cucumber", "Kosher salt", "1 teaspoon lime juice", "Black pepper or cayenne, to taste", "Sugar or honey, as needed", "Paprika (optional)", "1/2 cup about 1 slice white bread, crust removed", "2 to 4 tablespoons milk", "1 pound boneless, skinless chicken thighs", "2 tablespoons minced chives", "1 tablespoon finely chopped fresh tarragon, basil and mint, or other mixed herbs", "1 teaspoon kosher salt", "1/8 teaspoon black pepper", "1/8 to 1/4 teaspoon minced fresh serrano chilies or other hot peppers (optional)", "Olive oil", "Butter (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the raita: Run a piece of cheesecloth under cold water and wring it out well. Line a colander or sieve with the dampened cloth. Set this over a bowl and add the yogurt. While it drains, lightly salt the cucumber in a small bowl. Let both the yogurt and cucumber sit for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the liquid from the cucumber. Carefully lift the cheesecloth and invert it above the bowl of cucumber until the yogurt falls away. Add the lime juice and season to taste with salt and black pepper or cayenne. (Draining the whey from the yogurt removes much of the acidity, but if the raita seems too tart, sweeten it with a pinch of sugar or a little honey.) If you choose, sprinkle with a little paprika."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meatballs: Cover the bread with as much of the milk as it will absorb.Let it soak while you grind the chicken in a food processor. You want a fairly coarse mix, not a fine paste. (You are welcome to buy ground chicken, but grinding your own yields a more appealingly chunky meatball and guarantees that you will get the more moist and flavorful thigh meat instead of chicken breast, which is too dry to make a respectable meatball.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the bread to wring out the milk, then drop it into a mixing bowl. Mash it thoroughly with a fork and add the chicken, chives, herbs, salt, pepper and chilies, if using. (Not everyone appreciates fresh hot peppers, and they can be omitted.) Mash and mix it all together with the fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To test the seasoning, cover the bottom of a skillet with olive oil, mixed with butter, if you like, and heat over a medium flame. Fry a small meat patty until the inside is no longer pink and taste it. If it seems bland, add more salt or pepper to the meat. Wet your hands and roll meatballs, about an inch across, and fry them, turning every few minutes to brown the entire surface, 7 to 10 minutes. Transfer to a plate and serve with the lime raita."}]}