{"@context": "http://schema.org", "@type": "Recipe", "name": "Ginger Fried Rice", "description": "This recipe comes to The Times from the fertile mind of the chef Jean-Georges Vongerichten. Like all fried-rice dishes it begins with leftover rice (freshly cooked rice is too moist to fry well). It’s jasmine rice here, but white from Chinese takeout works nearly as well and is more convenient. Perhaps unsurprisingly — this is a chef’s recipe, after all — separate cooking processes are called for: ginger and garlic are crisped, leeks softened, rice and eggs fried. But no step takes more than a few minutes, and the results are absolutely worth the effort.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/12/dining/12friedrice/12friedrice-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, quick, weekday, weeknight, one pot", "keywords": "eggs, rice, gluten-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 634}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 371, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "6 grams", "sodiumContent": "868 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup peanut oil", "2 tablespoons minced garlic", "2 tablespoons minced ginger", "Salt", "2 cups thinly sliced leeks, white and light green parts only, rinsed and dried", "4 cups day-old cooked rice, preferably jasmine, at room temperature", "4 large eggs", "2 teaspoons sesame oil", "4 teaspoons soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat 1/4 cup peanut oil over medium heat. Add garlic and ginger and cook, stirring occasionally, until crisp and brown. With a slotted spoon, transfer to paper towels and salt lightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat under skillet to medium-low and add 2 tablespoons peanut oil and leeks. Cook about 10 minutes, stirring occasionally, until very tender but not browned. Season lightly with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise heat to medium and add rice. Cook, stirring well, until heated through. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a nonstick skillet, fry eggs in remaining peanut oil, sunny-side-up, until edges are set but yolk is still runny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide rice among four dishes. Top each with an egg and drizzle with 1/2 teaspoon sesame oil and 1 teaspoon soy sauce. Sprinkle crisped garlic and ginger over everything and serve."}]}