{"@context": "http://schema.org", "@type": "Recipe", "name": "Panade", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Panade/Panade-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6", "recipeCuisine": "french", "recipeCategory": "dinner, one pot", "keywords": "fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 58}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 539, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "6 grams", "proteinContent": "24 grams", "saturatedFatContent": "19 grams", "sodiumContent": "1411 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons butter", "2 leeks, white parts only, finely chopped (about 1½ cups)", "6 cups whole milk", "Salt", "4-6 slices day-old country bread, each 1 inch thick", "1 small butternut squash (about 1 pound), peeled, seeded and cut into ¼-inch-thick slices", "1 bunch black kale or Swiss chard, center stems removed", "1 head cauliflower (about 1½ pounds), trimmed and cut into ½-inch-thick slices", "½ pound fontina cheese, thinly sliced", "Heavy cream, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Melt 2 tablespoons of the butter in a saucepan over medium heat. Add the leeks and sauté until softened, about 5 minutes. Add the milk, the remaining 4 tablespoons butter and 2 teaspoons salt. Bring to a boil and then remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the bottom of a heavy, ovenproof 5-quart pot with 2 or more slices of the bread. Arrange the squash slices in an even layer on top of the bread and pour in 2 cups of the hot milk mixture. Top with 2 or 3 slices of bread and then with the kale. Arrange the cauliflower slices over the kale. Press down on the ingredients to compact them if they don’t quite fit into the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the remaining milk mixture over the top. Stop adding the milk when the level is almost to the rim. Season with salt. Cover the pot with a lid or aluminum foil. Bake for 30 minutes. Uncover and arrange the cheese over the top. Return to the oven uncovered and bake until the liquid is absorbed and reduced and the cheese has melted and browned, 30 to 40 minutes. (When the panade has cooled, it should appear dry.) Serve immediately or let cool and refrigerate for up to 3 days. To reheat, cut the panade into wedges and put on individual ovenproof plates. Pour ¼ cup cream over the top of each wedge and bake for 15 to 20 minutes in an oven preheated to 375."}]}