{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Grain Artisan Free-Form Loaf", "description": "", "author": {"@type": "Person", "name": "Harold Mcgee"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/whole-grain-artisan-loaf/whole-grain-artisan-loaf-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Four 1-pound loaves", "recipeCuisine": "", "recipeCategory": "", "keywords": "side dish, whole wheat flour, yeast", "aggregateRating": null, "recipeIngredient": ["1 pound 9 ounces (about 5 1/2 cups) whole wheat flour", "10 ounces (about 2 cups) unbleached all-purpose flour, more for dusting", "1 1/2 tablespoons (2 packets) granulated yeast", "1 tablespoon kosher salt", "1 4/10 ounces (about 1/4 cup) vital wheat gluten", "Cornmeal, as needed", "Seeds for sprinkling on bread, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In bowl of a 14-cup food processor with dough attachment, or heavy-duty stand mixer with paddle, combine whole wheat flour, all-purpose flour, yeast, salt and wheat gluten. Add 4 cups lukewarm (100 degrees) water and mix just until well blended, about 2 minutes; dough will be very wet and loose."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a container with a slightly vented lid, or a bowl covered loosely with plastic wrap. Allow dough to rise at room temperature until it begins to collapse, about 2 hours; longer rising times (even overnight) will not harm dough. After rising, cover securely and refrigerate, and use dough over the next 14 days. Do not punch down or knead dough at any time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To bake: Prepare a baking peel by sprinkling liberally with cornmeal, or line a large baking sheet with parchment paper. Tear off a 1-pound (grapefruit-size) mass of dough, and dust very lightly with flour. Quickly shape into a ball, stretching surface so that it is smooth. Stretch ball gently to elongate it, and place on baking peel. Cover loosely with plastic wrap and set aside to rest for 90 minutes for refrigerated dough, or 40 minutes for fresh unrefrigerated dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thirty minutes before baking, heat oven to 450 degrees with a baking stone placed on middle rack, and an empty broiler tray on a lower rack or bottom of oven. Just before baking, use a pastry brush to paint top of loaf with water. Sprinkle with seeds if desired. Slide loaf onto pizza peel or place on baking pan and put in oven. Quickly pour 1 cup hot water into broiler tray in oven, and close door. Bake until richly browned and firm to touch, about 30 minutes; adjust baking times as needed for larger or smaller loaves. For best texture, allow bread to cool before serving."}]}