{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Noodles With Tofu and Peppers", "description": "This simple stir-fry is a dish to throw together when you want something like fried rice but don’t have any cooked rice at hand. Begin soaking the noodles before you begin to chop the vegetables, and they’ll be ready to stir-fry when the other prep is done.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/09/29/science/01recipehealth/01recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves four", "recipeCuisine": "asian", "recipeCategory": "dinner, weekday, one pot", "keywords": "gluten-free, healthy, vegan, vegetarian, main course, rice noodles, tofu", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 195}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 371, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "642 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["7 to 8 ounces thin rice stick noodles", "1/2 cup reduced-sodium chicken or vegetable broth", "1 tablespoon low-sodium soy sauce", "1 tablespoon Shao Hsing rice wine or dry sherry", "2 teaspoons Asian sesame oil", "3/4 pound tofu, cut in 1/2-by-1-inch dominoes and blotted dry", "1 tablespoon minced garlic", "1 tablespoon minced ginger", "1/4 teaspoon red pepper flakes, or 1 to 2 teaspoon minced jalapeño", "1 green bell pepper, cut in thin julienne", "1 red bell pepper, cut in thin julienne", "2 tablespoons peanut oil or canola oil", "1 bunch scallions, trimmed and sliced very thin", "1/2 cup chopped cilantro", "Salt to taste", "1/2 teaspoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the noodles in a large bowl, and cover with warm water. Soak for at least 20 minutes, until soft. Drain in a colander, and cut into 6- to 8-inch lengths with kitchen scissors. Set aside, within reach of your wok or pan. Combine the broth, soy sauce, rice wine or sherry, and sesame oil in a small bowl. Combine the garlic, ginger and pepper flakes or minced jalapeño in another bowl. Have everything within reach of your wok or pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates from the surface within a second or two. Swirl in 1 tablespoon of the oil by adding it to the sides of the pan and tilting the pan side to side. Add the tofu. Reduce the heat to medium-high, and stir-fry one to two minutes until the tofu begins to brown. Add the garlic, ginger and chili, and stir-fry for no more than 10 seconds. Add the peppers, and stir-fry two minutes. Add the broth mixture, the drained noodles, the scallions, salt and sugar. Stir-fry one to two minutes until the noodles are just tender and the broth has been absorbed. Add the cilantro, and stir-fry another 30 seconds to a minute until well combined. Serve."}]}