{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey and Hominy Chili With Smoky Chipotle", "description": "Making an authentic pozole — the fragrant Mexican hominy stew — has been on my list of things to do for years, but it can be very labor intensive. One recipe by Diana Kennedy, the author of Mexican cookbooks, calls for trimming hominy and boiling a pig’s head. Just reading about it causes my enthusiasm to wane. This stew is a compromise; a sort of a pozole-chili hybrid, loaded with ground turkey, bell peppers, hominy and pinto beans. Chile powder adds heat, jalapeño brightness and canned chipotle chile in adobo smokiness and depth. A bottle of beer provides a pleasant bitterness that complements the spice. This recipe makes a very large batch perfect for entertaining or for stocking the freezer, but you can easily half it to feed a family of four.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/turkey-hominy-chili-chipotle/turkey-hominy-chili-chipotle-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "ground turkey, white hominy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 479}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 444, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "10 grams", "proteinContent": "32 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1116 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons olive oil", "2 1/2 pounds ground turkey", "2 teaspoons kosher salt", "1/2 teaspoon freshly ground black pepper", "6 garlic cloves, chopped", "2 tablespoons chili powder", "2 large Spanish onions, chopped", "1 red pepper, chopped", "1 green pepper, chopped", "1 to 2 jalapeño peppers, to taste, seeded and chopped", "1 28-ounce can tomato purée", "2 15-ounce cans white hominy, drained", "2 15-ounce cans pinto beans, drained", "1 12-ounce bottle beer", "2 to 3 chipotles in adobo sauce, to taste, minced", "1 teaspoon dried oregano", "2 bay leaves", "Sour cream, for serving", "5 scallions, white and light green parts, sliced, for serving", "1 bunch chopped cilantro, for serving", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot over medium-high heat, warm 1 tablespoon oil. Brown half the ground turkey with 3/4 teaspoon salt and 1/4 teaspoon pepper, stirring occasionally until golden, 6 to 8 minutes. Stir in half the garlic and half the chili powder and sauté for another 30 seconds. Using a slotted spoon, transfer turkey to a bowl. Brown remaining turkey in same manner, transferring it to bowl with rest of turkey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 2 tablespoons oil to pot and sauté onions, bell peppers and jalapeño peppers with remaining 1/2 teaspoon salt. Cook, stirring, until onion is translucent, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return ground turkey and any liquid in bowl to pot and add tomato purée, hominy, beans, beer, chipotles, oregano and bay leaves with 3 cups water. Simmer chili, partly covered, until it is thick enough for your taste, about 1 hour. Serve hot, garnished with sour cream, scallions, cilantro and lime wedges."}]}