{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Braised Chinese Mushrooms and Baby Bok Choy", "description": "A classic Chinese dish is bok choy served with dried black mushrooms, soaked until soft and then flavored with soy sauce and other ingredients.", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/braised-chinese-mushrooms-baby-bok-choy/braised-chinese-mushrooms-baby-bok-choy-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy", "keywords": "baby bok choy, chinese dried mushrooms, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 335, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "10 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "584 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon vegetarian oyster sauce or stir-fry sauce, like Lee Kum Kee brand (sold at Asian markets or on Amazon.com)", "1 tablespoon soy sauce", "1 1/2 teaspoons sugar", "1 teaspoon sesame oil", "1/2 cup vegetable broth or water", "1 teaspoon rice wine or dry sherry", "14 Chinese dried mushrooms, soaked in warm water until softened, stemmed and squeezed dry, or fresh shiitake mushrooms, stemmed", "2 tablespoons vegetable oil", "1 teaspoon cornstarch", "14 baby bok choy", "2 scallions, white part only, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine oyster or stir-fry sauce, soy sauce, sugar, sesame oil, vegetable broth and rice wine or sherry. Mix well, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large pot about three-quarters full of water, and place over high heat to bring to a boil. Meanwhile, in a skillet large enough to hold all the mushrooms in one snug layer, heat the vegetable oil over medium heat until shimmering. Add mushrooms, and stir-fry for 2 minutes. Add reserved sauce, and reduce heat to low. Cover, and simmer for 20 minutes, turning mushrooms over once or twice. If the pan becomes dry, add 1 to 2 tablespoons water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine cornstarch with 2 teaspoons water, and mix well. Add to the mushrooms. Stir gently for 30 seconds, until mushrooms are glossy. Cover, and turn off heat. Add the baby bok choy to the boiling water, and blanch until crisp-tender, about 1 1/2 minutes. Drain well and arrange on a platter with the leaves pointed toward the center. Place the mushrooms in the center, and garnish with chopped scallions. If desired, serve with rice."}]}