{"@context": "http://schema.org", "@type": "Recipe", "name": "Alkaline Semolina Noodles", "description": "", "author": {"@type": "Person", "name": "Harold Mcgee"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "2 to 3 servings", "recipeCuisine": "asian", "recipeCategory": "project", "keywords": "main course, side dish, scallion, semolina flour", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "0 grams", "sodiumContent": "5037 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons baking soda", "1 1/2 cups semolina flour", "Salt, to taste", "Neutral vegetable oil, to taste", "2 slivered scallions, to taste", "Chili flakes, to taste", "Sesame oil (optional)", "Soy sauce (optional)", "Chili-garlic paste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the baking soda on a piece of foil and bake in a 250-degree toaster oven for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the flour in a food processor. Dissolve 1 teaspoon of the baked baking soda, taking care to avoid touching it, in 6 1/2 tablespoons water. (Keep the rest tightly covered for another use.) Start the processor and slowly pour in the water-baking soda mixture. Process for about a minute until evenly mixed but still mostly granular. Remove the dough and press it together into a mass, then knead for a minute or two. If it does not come together, knead in a little more water, a teaspoon at a time. Wrap and let rest for an hour at room temperature, or overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into two pieces. Roll one piece out until slightly thicker than the widest roller setting on a pasta machine, about 3/8 inch. Pass the strip of dough through the pasta machine at its widest setting, then repeat at successively narrower settings until the dough is about 1/16- inch thick. Fit the narrow cutters onto the pasta machine and cut the dough into noodles. Repeat with the second piece of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of unsalted water to a boil. Cook the noodles until al dente, 3 to 4 minutes. Transfer to a colander, rinse briefly with cold water, and drain. To highlight the eggy flavor of the noodles, toss with salt, vegetable oil, scallions and chili flakes to taste. For a more full-flavored dish, toss instead with sesame oil, soy sauce and chili-garlic paste, or your favorite condiments."}]}