{"@context": "http://schema.org", "@type": "Recipe", "name": "Pizza Dough With Sourdough Starter", "description": "Peter Reinhart, author of “Artisan Breads Every Day” and “American Pie,” said a 24-hour wait will improve any dough: take your favorite recipe, let it sit overnight, then enjoy the upgrade. Mr. Reinhart recommends letting the dough rise at room temperature for three hours, then refrigerating it.", "author": {"@type": "Person", "name": "Oliver Strand"}, "image": null, "totalTime": "P1DT20M", "recipeYield": "Dough for 4 12-inch pizzas or 5 9-inch pizzas", "recipeCuisine": "", "recipeCategory": "quick, project", "keywords": "flour, sourdough starter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 83}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 503, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "102 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "4 grams", "proteinContent": "16 grams", "saturatedFatContent": "0 grams", "sodiumContent": "354 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces sourdough starter (<a href=\"http://cooking.nytimes.com/recipes/1013152-sourdough-starter\" target=\"_blank\">see recipe</a>)", "10 ounces 00 flour such as Divella or King Arthur Italian Style (about 2 cups)", "6 ounces high-gluten flour such as King Arthur Sir Lancelot (about 1 cup plus 1 tablespoon)", "1/2 ounce salt (about 4 teaspoons)", "Additional flour, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your fingers, break the starter dough into 1-inch pieces in a bowl and mix with 1 cup room temperature water until soupy and chunky. In the bowl of a stand mixer, combine the flours and salt, then add the starter and water. Mix with a wooden spoon until the dough begins to bind, then let rest for 5 minutes. Using the dough hook, knead on the mixer’s second-lowest setting for 5 to 7 minutes, until dough pulls away from the bowl and becomes a smooth ball. Lift dough hook, scraping off any excess dough. Settle a sheet of plastic wrap on the dough, and let rest for 3 to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut dough into 4 8-ounce pieces. (For smaller pizzas, divide into 5 6-ounce pieces.) Turn each piece out on a floured surface, folding and kneading three or four times until it becomes a smooth ball. Place each piece in a plastic bin large enough to allow it to double in size, let a sheet of plastic wrap settle on the dough, and cover with a lid. Refrigerate for 48 hours, or at least 24 hours, before shaping and baking."}]}