{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli and Endive Salad With Feta and Red Peppers", "description": "Parents appreciate broccoli because it’s one vegetable that their children will eat. But what about broccoli for adults? How much plain steamed broccoli do you really want to eat? We rarely base a meal on this healthy food, yet there are plenty of ways to move it to the center of your plate. For main dishes, I am most likely to use broccoli in a salad, a soup or pasta. Those little flowers — the crown of the broccoli is the plant’s flower — are like sponges for tasty sauces, dressings and broths. Like other cruciferous vegetables in the Brassica family (kale, collard greens, cabbage, Brussels sprouts and cauliflower), broccoli contains sulfur-containing phytonutrients that have gotten a lot of attention from nutritionists for their potential cancer-fighting properties. It’s packed with vitamins C, A, K and folate, as well as with fiber. And broccoli is a very good source of manganese, tryptophan, potassium, B vitamins, magnesium, iron, calcium, zinc and vitamin E. In this beautiful salad, the bitter flavor of the endive is countered by the sweet red peppers and broccoli.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/02/02/health/nutrition/02recipe.health.ready/02recipe.health.ready-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, salads and dressings", "keywords": "belgian endive, broccoli, red bell pepper, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 96, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "404 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons sherry vinegar or champagne vinegar", "1 teaspoon balsamic vinegar", "Salt, preferably kosher salt, to taste", "1 small garlic clove, minced or pureed", "1 teaspoon Dijon mustard", "6 tablespoons extra virgin olive oil, or use 2 tablespoons buttermilk and 1/4 cup extra virgin olive oil", "12 ounces broccoli crowns (2 good-size crowns)", "1 red bell pepper, roasted if desired", "1 tablespoon lightly toasted pine nuts", "6 Belgian endives, leaves separated", "2 tablespoon chopped fresh herbs, such as parsley, chives, tarragon, chervil", "3 ounces feta, crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing. Mix together the vinegars, salt, garlic, mustard and oil, or use the buttermilk and oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of generously salted water to a boil. Fill a bowl with ice water. Add the broccoli to the boiling water, and cook 2 1/2 minutes. Transfer to the ice water, let cool for a few minutes and drain. Dry on paper towels. Toss in a bowl with the red pepper, pine nuts, feta and half the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide salad bowl, toss together the endives, herbs and remaining dressing. Top with the broccoli mixture, and serve."}]}