{"@context": "http://schema.org", "@type": "Recipe", "name": "Bean Soup With Cabbage, Winter Squash and Farro", "description": "Wondering what else you can do with the cabbage and winter squash in that box of delivered produce? Here’s a meal in a bowl, perfect for a cold winter night.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/01/11/science/13recipehealth/13recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H45M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "borlotti beans, butternut squash, pinto beans, fall, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 178}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "12 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "659 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound borlotti or pinto beans, soaked overnight or for six hours in 1 quart water", "2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "1 medium carrot, chopped", "1 small celery stalk, with leaves, chopped", "2 teaspoons chopped fresh sage", "4 large garlic cloves, minced", "1 pound green cabbage, cored and shredded", "Salt", "freshly ground pepper", "1 pound butternut squash, peeled, seeded and diced (about 2 cups)", "A bouquet garni made with a few sprigs each thyme and parsley, 2 sage leaves and a Parmesan rind", "Generous 1/2 teaspoon dried rosemary, crumbled", "1 (14-ounce) can chopped tomatoes, with liquid", "1/2 cup farro (spelt), cooked", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy soup pot or Dutch oven. Cook the onion until it begins to soften, about three minutes. Add the carrot, celery and sage, and continue to cook, stirring, until the vegetables are tender, about five minutes. Add half the garlic. Cook, stirring, until fragrant, about one minute. Add the cabbage and a generous pinch of salt, and cook, stirring often, until the cabbage is limp, about 10 minutes. Drain the soaked beans, and add them to the pot, along with the squash, bouquet garni and 2 quarts water, or enough to cover by two inches. Bring to a boil, reduce the heat, add salt to taste and simmer 1 1/2 to 2 hours until the beans are tender. Remove the bouquet garni, and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the soup is simmering, heat the remaining olive oil over medium heat in a medium-size nonstick skillet. Add the remaining garlic and the rosemary. Cook for a half-minute to a minute until fragrant, and stir in the tomatoes. Add salt. Cook for 10 to 15 minutes, stirring often, until the tomatoes have cooked down and the mixture is thick, beginning to stick to the pan and delicious. Stir into the soup along with the cooked farro. Continue to simmer for another 30 minutes. Taste and adjust salt, and add lots of freshly ground pepper. Serve with freshly grated Parmesan."}]}