{"@context": "http://schema.org", "@type": "Recipe", "name": "Home/Made Mushroom Lasagna", "description": "Monica Byrne, with her partner, Leisah Swenson, runs a tiny restaurant in Red Hook, Brooklyn, called Home/Made. A plurality of words that appear on the Home/Made menu: “cheese,” “smoked,” “bacon,” “caramelized.” Three of those four appear in Byrne’s lasagna, leaving out only bacon, which would be a fine addition. She layers smoked mozzarella over a painting of rich, garlicky béchamel and sheets of pasta, then radicchio roasted into sweetness and tossed in sauce. Sautéed mushrooms add heft and loamy funkiness, and a mixture of Fontina and Gruyère add zing.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Home-Made-Mushroom-Lasagna/Home-Made-Mushroom-Lasagna-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1182}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 814, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "5 grams", "proteinContent": "33 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1006 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup extra-virgin olive oil or <a href=\"http://cooking.nytimes.com/recipes/1013947-herb-oil\">herb oil</a>", "6 large shallots, peeled and minced", "1 1/2 pounds mushrooms, wild or best available oyster, shiitake, cremini, trimmed and sliced", "1 cup dry white wine", "1 softball-size head of radicchio, halved, cored and cut into 1/2-inch slices", "Kosher salt", "freshly ground black pepper", "4 tablespoons unsalted butter, or herb oil", "3 large cloves garlic, peeled and minced", "4 tablespoons flour, ideally instant or all-purpose", "3 cups whole milk", "1/2 teaspoon grated nutmeg", "1 cup Gruyère cheese, grated", "1 cup Fontina cheese, grated", "2 tablespoons best-quality truffle oil (optional)", "2 9-ounce boxes of no-boil lasagna sheets", "1 baseball-size ball of smoked mozzarella, sliced", "1 cup fresh Parmesan, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350. Place a large sauté pan over medium-high heat and add 1/4 cup of the olive oil or herb oil. When it begins to shimmer, add half of the shallots and cook, stirring occasionally, until translucent. Add mushrooms and toss to coat, then cook until they begin to color but are still plump, approximately 12 to 15 minutes. Add white wine to deglaze pan and allow to cook down into a syrup, approximately 5 to 7 minutes. Put the mushrooms into a large bowl and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in another bowl, toss the radicchio with 1/4 cup olive oil or herb oil and season with salt and pepper. Spread the strips out onto a baking pan and place in the oven until the strips are lightly browned around the edges, approximately 15 minutes. Combine with mushrooms and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the béchamel. Place a saucepan over medium heat and melt the butter. When it foams, add the rest of the shallots and cook until they begin to turn translucent. Add the garlic and stir to combine, then cook until the garlic has started to soften. Sprinkle flour over the top and stir to combine, then cook gently until the mixture has turned light brown and gives off a nutty scent, approximately 10 minutes. Add milk to the mixture, whisking all the while, until the sauce is thick and creamy. Add the nutmeg and 1/4 cup of grated Gruyère and 1/4 cup of grated Fontina, then stir to combine. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve a cup of béchamel. Pour the rest over the mixture of mushrooms and radicchio, and stir to combine. Add truffle oil, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble lasagna. Spread plain béchamel across the bottom of a 9- by-13-inch baking pan. Place a layer of lasagna sheets across the sauce, being careful not to overlap. Spread a generous layer of mushroom mixture on top of the pasta, and follow with some grated Fontina and Gruyère. Put another layer of pasta above the cheese, and top with smoked mozzarella. Repeat until the pasta is gone and the pan is full. Top with remaining cheeses and a generous amount of grated Parmesan. Cover with a buttered sheet of aluminum foil and place in the oven for 45 minutes. Remove foil and cook until top is golden and bubbling."}]}