{"@context": "http://schema.org", "@type": "Recipe", "name": "Mark Bittman's Sushi Rice", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian, japanese", "recipeCategory": "easy, weekday", "keywords": "gluten-free, vegan, vegetarian, rice vinegar, short-grain white rice, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 53}, "recipeIngredient": ["1 cup rice vinegar", "3/8 cup sugar", "2 tablespoons salt, plus a pinch", "1 piece konbu (kelp), about 3 or 4 inches square", "2 cups short-grain white rice", "1 teaspoon sake, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine vinegar, sugar and 2 tablespoons salt in a container and shake or stir until dissolved. Add konbu and let sit about 30 minutes before removing konbu and covering container. Let sit for at least 2 hours and up to several days. (Room temperature is fine.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash rice in several changes of water until water runs clear. Combine with sake, a pinch of salt, and 2 1/2 cups water (if you’re using a rice cooker) or 3 cups water (if you’re cooking it on stovetop). Cook until water is absorbed, 38 minutes in a rice cooker, about 25 minutes in a covered pot over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn rice into a large bowl, preferably wooden, and let cool for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rubber spatula, a wooden paddle or spoon, gently fold sweetened vinegar into rice, a little at a time. You will probably need about 1/2 cup for this amount of rice, but a little bit less or more is fine. Rice should be glistening and moist but not wet, and sweet but not overly so. Use immediately with sushi toppings of your choice."}]}