{"@context": "http://schema.org", "@type": "Recipe", "name": "Chimichurri Hanger Steak", "description": "To be tempted by Argentina is to dream of steak on a grill, and it’s no accident that the meat echoes the density of the malbecs from Mendoza. Terroir, or sense of place, helps define character and flavor. Good beef delivers a tight package of sweetness, earthiness and minerality, just like the best of these wines. And what would beef in Argentina be without a slather of chimichurri, the iconic parsley-based green sauce? It is both sharply hot and herbaceously cool, especially with the addition of mint to play up the whiff of eucalyptus in the wines. In this recipe, though, the chimichurri is not really a sauce. It is meant to play a more intimate role, seasoning the steak inside and out. My choice of steak is hanger, which often delivers an appealing funkiness, even when it is not from grass-fed beef like that in Argentina.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/chimichurri-hanger-steak/chimichurri-hanger-steak-articleLarge-v3.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "brazilian", "recipeCategory": "dinner, easy, steaks and chops", "keywords": "jalapeño, parsley, steak, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 104}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 638, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "1 gram", "proteinContent": "46 grams", "saturatedFatContent": "14 grams", "sodiumContent": "639 milligrams", "sugarContent": "0 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["1 cup packed flat-leaf parsley", "1/2 jalapeño, seeded", "1 garlic clove", "2 tablespoons minced mint leaves", "6 tablespoons extra virgin olive oil", "1 tablespoon red wine vinegar", "1/4 teaspoon crushed red chili flakes", "Salt", "pepper, to taste", "Cayenne, to taste", "3 tablespoons panko", "1 hanger steak, about 2 pounds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mince parsley, jalapeño and garlic and mix in a bowl with mint, oil and vinegar. Season with chili flakes, salt, pepper and cayenne until it has a kick. Reserve 3 tablespoons and add panko to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butterfly steak with a sharp knife, slicing it not quite all the way through, so it opens it like a book. Lightly pound any thicker areas to make meat more uniform. Spread chimichurri-panko mix on one side of cut surfaces, fold other side over and fasten the edge with metal or wooden skewers. Coat outside of steak with reserved chimichurri. Chill 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light grill or broiler and, while it heats, allow steak to come to room temperature. Grill or broil steak to medium rare, about 6 to 8 minutes per side depending on heat. Let rest 10 minutes, remove skewers and cut in thick slices."}]}