{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Short Ribs", "description": "", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "4 servings or 4 to 6 cups of shredded meat", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "main course, short ribs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 135}, "recipeIngredient": ["1 750-milliliter bottle red wine", "1 tablespoon olive oil", "3 pounds beef short ribs, cut 2 inches thick", "6 medium carrots, cut into 1/4-inch slices", "4 onions, coarsely chopped", "1 head garlic, halved crosswise", "7 sprigs thyme", "8 ounces (2 sticks) butter", "1 cup light brown sugar", "3 tablespoons tomato paste", "1/2 cup all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, boil wine until reduced by about half. Meanwhile, place a large, wide Dutch oven over high heat. Add olive oil and when it is very hot, add short ribs and sear until well browned on all sides. Transfer short ribs to a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Return Dutch oven to medium-high heat. Add carrots, onions, garlic and thyme. Sauté until lightly browned, about 3 minutes. Add butter and continue to sauté until vegetables are tender, another 1 to 2 minutes. Add brown sugar and tomato paste. Cook, stirring, another 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return short ribs to Dutch oven and sprinkle with flour. Cook, stirring well, until flour is incorporated and beginning to brown. Add reduced wine and bring to a boil. Skim any foam. Cover, leaving lid slightly ajar, and transfer to oven. Cook until meat is very tender and falling off the bone, about 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Short ribs may be served on the bone or the meat removed and served in chunks or shreds. To serve sauce, strain vegetables and any liquid from Dutch oven, pressing down to extract as much liquid as possible; discard solids. To de-fat sauce, skim surface or chill to remove excess fat, reheat, and serve over or mixed with short ribs."}]}