{"@context": "http://schema.org", "@type": "Recipe", "name": "Razor Clam Ceviche", "description": "In 2011, razor clams were showing up on menus all over New York City. Some chefs steamed them, some served them with pasta, others decided they would be great in ceviches, as here.  A shopping tip for razor clams: the thinner the better. Though the shells usually gape a bit, they should nearly close when touched. Razor clams are much more perishable than hard clams, but their shelf life can be extended by steaming them for use in salads later. Shaunna Sargent, the chef at Corsino restaurant in Manhattan, is among the chefs who froze the clams for a few hours to make the meat easier to remove and more tender. Regardless of whether they are raw or frozen, a paring knife is all that is needed to shuck them. Be sure to scrub the shells first in running water to remove any sand or grit.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/Razor-Clam-Ceviche/Razor-Clam-Ceviche-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 appetizer servings, or 24 canapés", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "appetizer, clams, grapefruit, gluten-free", "aggregateRating": null, "recipeIngredient": ["1 pound razor clams, rinsed and scrubbed", "1 pink grapefruit, peeled, segmented, juice reserved", "1 teaspoon pink peppercorns", "12 fresh mint leaves, slivered", "1 tablespoon extra virgin olive oil", "Salt", "Round tortilla chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a paring knife to gently pry apart clam shells and then cut meat away, discarding any gritty dark parts and a half-inch of the dark, hard siphon. Cut meat into half-inch pieces. Place in a bowl. Dice grapefruit segments and add them to the bowl with reserved juice, pink peppercorns, mint and olive oil. Fold together and refrigerate 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season clam mixture with salt to taste. Serve in appetizer portions with chips, or drain well and pile onto chips to make canapés."}]}