{"@context": "http://schema.org", "@type": "Recipe", "name": "White-Fish Fillets With Grilled Cabbage", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2011/11/06/magazine/06eat3/06eat3-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "2 to 4 servings", "recipeCuisine": "scandinavian", "recipeCategory": "dinner", "keywords": "dry white wine, savoy cabbage, white fish, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 881, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "1 gram", "proteinContent": "116 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1788 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt", "4 savoy cabbage leaves", "8 ounces skinless white-fish fillets like black sea bass, cod or halibut, cut into 4 small pieces", "4 teaspoons chopped fresh dill", "Salt", "black pepper", "Olive oil as needed", "1 tablespoon neutral oil (like grapeseed or corn)", "2 tablespoons butter", "Several sprigs of thyme", "1 meaty skeleton from a small white fish, like sea bass, chopped", "2 cups dry white wine", "Microgreens or flowers for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill with the rack very close to the flame and the heat quite hot. Bring a large pot of water to a boil and salt it. Remove the thickest part of the central vein of each cabbage leaf without cutting the leaf in half. Blanch the cabbage leaves in the boiling water until just tender, about 30 seconds; drain on paper towels. Put a piece of fish on one side of each leaf and top with 1 teaspoon dill, a sprinkle of salt and pepper and a drizzle of olive oil. Fold the other half of the leaf over the fish and trim the edges with a big cookie cutter or a knife to form an oval. Rub the outside with a little bit of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the neutral oil and 1 tablespoon of the butter in a skillet large enough to hold the fish bones in one layer over medium-high heat; when the butter melts, add the thyme and fish bones and cook, stirring occasionally, until very well browned, about 5 minutes. Add the remaining 1 tablespoon butter and the wine and cook until creamy and reduced in volume, about 10 minutes. Strain and discard the fish bones. Season the sauce with salt and pepper and keep it over very low heat while you grill the fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the fish packages for 30 seconds per side; the cabbage should brown and the fish should steam but just barely. (You can tell whether the fish is done by poking a toothpick into it. If it meets a little resistance, it’s ready; if it’s very rubbery, it’s not.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the sauce or use an immersion blender to foam it up a bit. Drizzle the cabbage and fish with sauce, garnish with microgreens or flowers and serve."}]}