{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fries With Fresh Vegetables", "description": "Over 50 percent of this colorful chicken stir-fry is composed of vegetables. Use chicken tenders or chicken breast.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/06/science/05recipehealth/05recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "Serves three to four", "recipeCuisine": "asian", "recipeCategory": "dinner, weekday", "keywords": "chicken breast, ginger, vegetables, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 246}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 270, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "21 grams", "saturatedFatContent": "3 grams", "sodiumContent": "530 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt to taste", "1/2 pound broccoli florets, cut to the same size about 4 cups", "3/4 pound skinless, boneless chicken breast or tenders, preferably from a small producer of free-range chickens, cut into pieces 1/4-inch thick and 1 inch long", "2 tablespoons finely shredded or minced ginger", "1 tablespoon minced shallot", "1 tablespoon minced garlic", "2 tablespoons Shao Hsing rice wine or dry sherry", "1 tablespoons low-sodium soy sauce", "2 teaspoons cornstarch", "3/4 teaspoon sugar", "1/4 teaspoon red pepper flakes", "1/4 cup chicken broth or water", "2 teaspoons rice vinegar", "2 tablespoons peanut or canola oil", "1 large red bell pepper 6 to 8 ounces, cut in 2-inch julienne"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of lightly salted water to a boil. Add the broccoli florets and blanch, stirring the broccoli, for one minute until the water is coming back to a boil. Drain and shake out excess water. Lay the broccoli florets on a kitchen towel to drain further."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the chicken, 1 tablespoon of the ginger, 1 tablespoon of the rice wine or sherry, the soy sauce, 1 teaspoon of the cornstarch, sugar and red pepper flakes. Stir together well, and place within arm’s reach of your pan (refrigerate if not cooking right away)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the broth, vinegar, remaining cornstarch and rice wine or sherry in a small bowl, and place within arm’s reach of your pan. Have the remaining ingredients measured out and near the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or a 12-inch skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Add the oil to the sides of the pan and tilt the pan to distribute. Carefully lay the chicken pieces in one layer in the wok or pan. Let the chicken sear undisturbed for one minute, then add the shallot, garlic and remaining ginger. Stir-fry with the chicken for one minute until the chicken is lightly colored but not quite cooked through. Add the red pepper and broccoli to the wok, and stir-fry one minute. Stir the broth mixture and add to the wok. Season with salt to taste. Stir-fry one to two minutes until the chicken is cooked through and the broccoli and peppers are crisp-tender. Serve with brown rice, white rice or noodles."}]}