{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Whole Grain Crackers", "description": "There are plenty of whole-grain crackers on store shelves, but none taste as good to me as those made at home. You can use a mix of grains and flours to make them, including gluten-free varieties like millet, buckwheat and rice flours, and top them with any number of seeds, herbs or spices. They&rsquo;re quick to mix together and very easy to roll out. &ldquo;Healthy” crackers can be hard and dry, but this week&rsquo;s offerings are not. I use olive oil in all of them, and some work best with a small amount of butter. I&rsquo;ve been making sesame crackers for decades, tweaking my recipe over the years. They have a wholesome, rich, nutty flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/05/03/science/02recipehealth/02recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "About four dozen crackers", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "appetizer, healthy, vegan, vegetarian, sesame seeds, whole wheat flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 73}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 32, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "17 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 cups whole-wheat flour", "1/2 cup toasted sesame seeds", "1/2 teaspoon salt", "5 tablespoons extra virgin olive oil or sesame oil", "4 to 5 tablespoons water, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees with the racks positioned in the middle and upper third. Line two baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the flour, sesame seeds and salt in a mixing bowl, in the bowl of a stand mixer, or in a food processor fitted with a steel blade. If using a mixing bowl, add the oil and cut in with a fork. If using a stand mixer, mix at medium speed. In a food processor, pulse until the mixture is crumbly. Add the water, and mix with your hands, or at medium speed in a mixer or in the food processor, until you can gather the dough into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly dust your work surface and roll out the dough, or roll out between pieces of parchment, plastic or wax paper. Cut into desired shapes -- squares, diamonds or cookie-cutter shapes -- and place on the baking sheet, close together but not touching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 15 to 20 minutes until lightly browned, switching the sheet trays front to back and top to middle halfway through. Remove from the heat, and allow to cool on racks."}]}