{"@context": "http://schema.org", "@type": "Recipe", "name": "Pigeon Peas With Mango", "description": "This dish is based on a recipe from “660 Curries,” by Raghavan Iyer. I’ve given you the option of using cayenne and sesame seeds instead of Mr. Raghavan’s garam masala, but I encourage you to make the spice mix if you can. You can find pigeon peas and curry leaves in Indian markets. Pigeon peas resemble split yellow peas in color and flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/04/26/health/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Four servings", "recipeCuisine": "indian", "recipeCategory": "one pot", "keywords": "gluten-free, healthy, vegetarian, mango, yellow pigeon peas, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 177, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "311 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 heaped cup skinned yellow pigeon peas toovar or toor dal, preferably the un-oily variety, picked over for stones", "1 medium ripe mango, peeled, seeded and chopped", "1/2 teaspoon cayenne plus 1 teaspoon ground toasted sesame seeds, or 2 tablespoons Maharashtran sesame-flavored garam masala (see below)", "Salt to taste", "1/2 teaspoon ground turmeric", "10 to 12 curry leaves", "2 tablespoons ghee (clarified butter) or canola oil", "2 teaspoons cumin seeds", "1/4 cup finely chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pigeon peas in a medium, heavy saucepan. Cover with 1 inch of water, and roll around the peas. The water will cloud. Drain through a strainer, and return to the pot. Repeat several times until the water is no longer very cloudy when you cover the peas. Drain and return to the pot, then add 3 cups water and bring to a boil over medium-high heat. Skim off and discard any foam. Stir the peas, reduce the heat to medium-low, cover and simmer, stirring from time to time, for 10 minutes. The peas will be partly tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mango, the garam masala or the cayenne, salt, turmeric, curry leaves and 1 cup water. Bring back to a boil, then reduce the heat again to medium-low. Cover and simmer 20 minutes, stirring occasionally, or until the peas are tender and falling apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the peas are simmering, heat the ghee or oil in a small, heavy skillet over medium-high heat. Add the cumin seeds. When they begin to sizzle, turn a reddish brown and smell nutty, remove from the heat. Add the cilantro, and stir until the sizzling stops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pigeon peas and mango are very tender, remove the curry leaves and mash the mixture with the back of your spoon. Scrape in the seasoned ghee or oil, and stir together. Cover and simmer five minutes until the flavors are nicely blended. Taste, adjust salt and serve."}]}