{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti and Meatballs", "description": "There’s little more comforting on a weeknight — or any night — than spaghetti, tossed in marinara sauce and paired with savory meatballs. This hearty recipe features three kinds of meat — ground pork shoulder, veal and beef chuck, along with minced bacon — rolled into small balls, which are then browned in a sauté pan, and baked until cooked through. Serve the whole thing with a bowl of grated Parmesan, ready to be heaped on.", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2011/02/20/magazine/20Food-t-000_CA1/20Food-t-000_CA1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "ground beef, spaghetti, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 170}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 841, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "91 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "6 grams", "proteinContent": "39 grams", "saturatedFatContent": "13 grams", "sodiumContent": "862 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 loaf fresh ciabatta, crusts removed, whirred in a blender or food processor to make crumbs (about 2 cups)", "1/3 cup heavy cream", "1 teaspoon fresh oregano leaves, chopped", "¼ teaspoon red-pepper flakes", "1 teaspoon black pepper", "2 teaspoons salt", "½ cup minced bacon about 3 slices", "½ pound ground pork shoulder", "½ pound ground veal", "½ pound ground beef chuck", "2 tablespoons butter", "2 tablespoons olive oil", "1 pound spaghetti", "2 cups marinara sauce", "Grated Parmesan cheese, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meatballs: In a large bowl, combine bread crumbs and cream. Let it sit for 5 minutes, then mash the mixture with a fork. Mix in the oregano, pepper flakes, black pepper, salt and bacon. Gently work in the pork, veal and beef. Be careful not to knead it into oblivion, or the meatballs will be tough little pebbles. Fry a little of the mixture in some butter and oil in a skillet and taste, adjusting seasonings. Roll into small meatballs, about an inch across. (If you have a kitchen scale, measure an ounce apiece.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. In a large sauté pan, warm the butter and olive oil over medium-high heat. Brown the meatballs, turning every couple of minutes. (Work in batches if they won’t all fit in the pan.) Transfer them to a roasting pan big enough to hold them all. Pour 2 cups of cold water into the pan and transfer it to the oven to bake for 20 to 30 minutes or so, until the meatballs are cooked through. Transfer to a plate and cover with aluminum foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the spaghetti in a large pot of salted water, and heat the marinara sauce in a pot. When the spaghetti is tender, toss it with the sauce. Season to taste. Put the cheese in a bowl and set it on the table. Make sure to ask your family if they want their meatballs on top of the spaghetti or on the side."}]}