{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoky Cheese Grits with Summer Succotash", "description": "This recipe, adapted from “Sara Moulton’s Everyday Family Dinners,” came to The Times in 2010 as part of a Pete Wells column on redefining the mise en place. Ms. Moulton uses downtime in the cooking process to an advantage: She instructs you to chop the onion and shuck the corn as the edamame cooks. The recipe comes together in about 40 minutes, making it a good one for a busy weeknight -- succotash without suffering.", "author": {"@type": "Person", "name": "Pete Wells"}, "image": null, "totalTime": "PT40M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "southern", "recipeCategory": "brunch, dinner, weekday", "keywords": "gluten-free, vegetarian, main course, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 59}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 370, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "6 grams", "sodiumContent": "605 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup frozen edamame", "2 large ears fresh corn or 2 cups thawed frozen corn kernels", "1 medium onion", "1 tablespoon vegetable oil", "1 garlic clove", "1 cup whole milk", "Salt", "black pepper", "1 cup quick-cooking grits", "2 cups cherry or grape tomatoes", "1 tablespoon balsamic vinegar", "¼ pound smoked Gruyère, Gouda or cheddar cheese", "1 tablespoon unsalted butter", "2 tablespoons chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the edamame following the package directions; drain well. Cut the corn from the cobs, if using fresh corn. Finely chop the onion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the vegetable oil in a large skillet over medium heat. When hot, add the onion, reduce the heat to medium-low and cook for about 5 minutes, until it has softened. Push the garlic through a garlic press into the skillet. Stir and cook for 1 more minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine 2½ cups water, the milk, ½ teaspoon salt and ¼ teaspoon black pepper in a large saucepan and bring to a boil over high heat. Very gradually whisk in the grits, reduce the heat to medium and cook, stirring frequently, for about 8 minutes, or until the grits are thick and creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the milk and water are coming to a boil, halve the tomatoes and add them, with the vinegar, to the onions and garlic. Cook for about 2 minutes, then add the edamame and corn and cook for 3 more minutes, stirring occasionally. Add salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely grate the cheese. Stir the cheese and butter into the grits and add salt and pepper to taste. Serve the succotash on top of the grits and sprinkle with the chives."}]}