{"@context": "http://schema.org", "@type": "Recipe", "name": "Celery Root, Potato and Apple Purée", "description": "Classic celery root and potato purées combine two parts potatoes with one part celery root. I’ve reversed the proportion here for a lighter purée that also incorporates apple — the “secret ingredient.\" Rather than milk, I usually use the broth from the celery root and apples.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/01/19/science/21recipehealth/21recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "easy, quick, weekday", "keywords": "apple, celery root, potato, fall, gluten-free, healthy, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 177, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "638 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 pound Yukon gold potatoes, peeled and cut in half", "2 large celery roots, about 2 pounds, peeled and cut into large pieces", "1 large or 2 small tart apples, such as a Granny Smith, peeled, cored and quartered", "1/2 cup, approximately, warm milk or broth from the celery root", "2 tablespoons butter or walnut oil (or a combination)", "Salt", "freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in one saucepan and the celery root and apples in another. Barely cover with water and add salt to taste to each, about 1/2 teaspoon. Bring to a boil, reduce the heat and simmer until tender, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the potatoes, and return to the pot. Cover tightly, and allow to sit for five minutes to steam and dry out. Drain the celery root and apples through a strainer set over a bowl. Purée all of the produce using a food mill or a potato ricer. Stir together, and whisk in the milk or the broth until the mixture is fluffy. Add the butter or walnut oil to the hot purée, stir until the butter melts, and season to taste with salt and pepper."}]}