{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Wheat Spaghetti With Green Garlic and Chicory", "description": "This dish is inspired by a classic oil and garlic pasta. I’ve added chicory, a bitter green that is much loved in southern Italy but underused here. It’s sold with lettuces in the supermarket, often called escarole or curly endive. Chicory contains a type of soluble fiber called inulin, which some studies suggest may have a positive effect on blood sugar levels.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/05/10/science/11recipehealth/11recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "chicory, green garlic, whole wheat spaghetti, healthy, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 8}, "recipeIngredient": ["1 head chicory (also sold as escarole and curly endive lettuce)", "1/4 cup extra virgin olive oil", "2 tablespoons minced green garlic", "1 dried red pepper, broken in half, or 1/4 teaspoon red pepper flakes", "Salt to taste", "3 tablespoons chopped flat-leaf parsley", "3/4 pound whole-wheat spaghetti", "A generous amount of freshly ground pepper", "1/4 cup freshly grated Parmesan, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. Meanwhile, remove the tough outer leaves of the chicory, and clean the remaining leaves of sand. When the water comes to a boil, salt generously and add the chicory. Blanch one minute, then transfer to the ice water with a skimmer or slotted spoon (do not drain the water from the pot). Drain the chicory, squeeze out water and chop. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the olive oil, garlic and chili pepper in a large, heavy skillet. Heat over medium heat until the garlic begins to sizzle. Allow the garlic to sizzle for about a minute, but do not let it color. Remove the skillet from the heat and set aside. If using a whole chili pepper, remove it and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water back to a boil, and add the spaghetti. Cook al dente following the timing directions on the package. While the pasta is cooking, return the frying pan to medium heat. When the garlic begins to sizzle again, add the chicory. Toss together, season to taste with salt and pepper, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the spaghetti is cooked al dente, remove 1/2 cup of the pasta water and add it to the pan with the chicory. Stir together well. Drain the pasta, and toss with the chicory and garlic. Serve, topping each serving with a spoonful of Parmesan."}]}