{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoke-Roasted Chicken Thighs With Paprika", "description": "These chicken thighs are roasted in the heat of a covered grill, smoke commingling with the tint and flavor of paprika to create, thanks to caramelized honey, a sort of crust that makes it very difficult to stop eating. You start by making a paste of sweet and hot paprikas, honey, lemon juice, garlic and butter. Rub that all over the meat, then cook the chicken on a charcoal grill over indirect heat until done. If using a gas grill, make sure one side of the grill is unheated, and either swap out the paprika for the smoked version known as pimenton de la vera or wrap two small mounds of moistened wood chips in heavy aluminum foil and pierce the tops of the packets with the tines of a fork. Place those on the hotter side of the grill before roasting the chicken.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/06/26/dining/26COOKING-ROASTED1/26COOKING-ROASTED1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "chicken, paprika, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 296}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 720, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "2 grams", "proteinContent": "47 grams", "saturatedFatContent": "16 grams", "sodiumContent": "994 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon sweet paprika", "2 tablespoons hot paprika", "2 tablespoons honey", "1 tablespoon lemon juice", "4 cloves garlic, peeled and minced", "2 tablespoons softened butter", "8 bone-in chicken thighs (about 3½ pounds)", "Kosher salt", "freshly ground black pepper to taste", "Lemon wedges, for garnish", "Mint leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in a grill with a cover, leaving about 1/3 of the grill free of coals. If using a gas grill, make sure one side of the grill is unheated, and either swap out the paprika above for the smoked version known as pimenton de la vera or wrap two small mounds of moistened wood chips in heavy aluminum foil and pierce the tops of the packets with the tines of a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine the paprikas, honey, lemon juice, garlic and butter and stir to make a paste. Season the chicken with salt and pepper, then coat thoroughly by hand with the spice paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken on cooler side of grill and cover. If using wood chips, place the foil packets, pierced side up, on the hotter side of the grill and cover. Roast chicken for 15 minutes, turn, cook for 10 to 15 minutes more, or until cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, warm or at room temperature, with lemon wedges, sprinkled with mint leaves."}]}