{"@context": "http://schema.org", "@type": "Recipe", "name": "Food-Processor Apple Tart", "description": "I use the food processor for just about every pastry dough there is — and have for 20 years. And I cut far more even slices, far faster than I ever could by hand, of almost anything sliceable.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/food-processor-apple-tart/food-processor-apple-tart-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "About 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 324, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "10 grams", "sodiumContent": "150 milligrams", "sugarContent": "20 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups all-purpose flour, plus more for rolling", "1/2 teaspoon salt", "4 tablespoons sugar", "11 tablespoons frozen or cold unsalted butter, cut into chunks, plus more for greasing", "1 egg yolk", "3 tablespoons ice water, plus more if necessary", "2 to 3 pounds tart apples", "1 tablespoon lemon juice", "1/2 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put flour, salt and 2 tablespoons of the sugar in food processor and pulse once or twice. Add 10 tablespoons of the butter, leaving the remaining tablespoon of butter at room temperature to soften. Process until the mixture is uniform, about 10 seconds (do not over-process). Add egg yolk and process for another few seconds. Add 3 tablespoons ice water and pulse just until you can form the dough into a ball, adding another tablespoon or two of ice water if necessary (if you overdo it and the mixture becomes sodden, add a little more flour). Form into a ball, wrap in plastic and freeze for 10 minutes or refrigerate for at least 30 minutes. You can refrigerate it for up to a couple of days or freeze, tightly wrapped, for up to a couple of weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put dough on floured surface and roll into a circle with a diameter about 2 inches greater than that of an 8- to 10-inch tart pan. Transfer dough to pan, pressing it into the corners and sides and using a knife to cut the edges flush with the rim of the pan. Freeze for 30 minutes or refrigerate for about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Prick surface of dough several times with a fork. Butter one side of a piece of foil large enough to cover crust; press foil onto crust, buttered side down. Weight foil with a pile of dried beans or rice or pie weights. Bake for 12 minutes; remove from oven and remove weights and foil. Reduce the oven temperature to 350 degrees and continue baking the crust until golden brown, another 10 minutes or so. Remove crust from oven and turn oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and core apples, then slice with slicing blade of a food processor. Toss with lemon juice to prevent browning. When crust has cooled slightly, arrange apple slices in concentric circles in tart shell, with circles overlapping. Sprinkle with remaining 2 tablespoons sugar and the cinnamon, then dot with remaining tablespoon butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put tart pan on baking sheet and bake until apples are quite soft (a thin-bladed knife will pierce them easily) but still hold their shape, about 40 minutes. Cool on rack for about 20 minutes. Serve at room temperature."}]}