{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Shell Beans and Tomatoes", "description": "Many cooks find working with fresh shell beans, so smooth and cool in your hands, to be unexpectedly satisfying. The pods may be tough, but the beans inside are tender and ready to cook, and they need not be skinned after removal from the pods. Once shelled, fresh beans require just 40 to 45 minutes of simmering. And in terms of nutrition, they have everything dried beans have to offer: lots of protein and fiber, calcium, iron, folic acid and potassium.At my local farmers’ market, I’ve found large scarlet runner beans (they really are more purple than red, and some farmers call them purple runners); mottled pink-and-white cranberry beans (also known as borlotti, they come in the most beautiful pink pods); creamy, pale yellow cannelinis; and similar bean with pink markings called yellow Indian woman beans. Many are heirloom varieties and each is a little different, but they all have creamy textures and a wonderful fresh flavor. This is a very comforting pasta. I like to use large shells or tubes, which catch the beans and sauce.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/21/health/21recipehealth_600/21recipehealth_600-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves four", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "healthy, vegetarian, main course, pasta, shell beans, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 468, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "82 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "8 grams", "proteinContent": "17 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1885 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 to 1 1/4 pounds shell beans (about 1 3/4 to 2 cups)", "1 small onion, halved", "7 cups water", "4 large garlic cloves, 2 crushed, 2 minced", "A bouquet garni made with a few sprigs each of parsley and thyme, a sprig of sage, a Parmesan rind and a bay leaf", "Salt to taste", "2 pounds tomatoes", "2 tablespoons extra virgin olive oil", "Pinch of sugar", "1 large basil sprig, plus a handful of fresh basil leaves, slivered", "3/4 pound pasta, preferably large shells or tubes, or bow ties", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the beans, onion, water, the crushed garlic cloves, bouquet garni and salt to taste in a heavy saucepan or soup pot, and bring to a simmer. Cover and simmer 45 minutes, or until the beans are tender. Taste and adjust salt. Remove and discard the onion, the bouquet garni and the garlic cloves. Drain though a colander set over a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beans are cooking, bring a large pot of water to a boil and drop in the tomatoes. Blanch for 30 seconds, then transfer to a bowl of cold water. Drain, core and peel. Cut the tomatoes in half. Place a strainer over a bowl, and squeeze the seeds out of the tomatoes into the strainer. Press the seed pods against the strainer to extract as much juice as you can, and then discard the seeds. Chop the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy nonstick skillet over medium heat, and add the minced garlic. Cook, stirring until fragrant, about 30 seconds, and add the tomatoes, sugar, the basil sprig and salt to taste. Cook, stirring often, until the tomatoes have cooked down to a thick sauce and smell fragrant, about 15 to 20 minutes. Taste and adjust salt. Stir in 1/2 cup of the bean broth and mix together. Stir in the beans. Keep warm while you cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water back to a boil, salt generously and add the pasta. Cook al dente, until firm to the bite, following the timing instructions on the package. (Check the pasta a minute or two before the end of the suggested cooking time.) Drain the pasta and toss with the beans, tomatoes, and slivered basil. Serve with Parmesan on the side."}]}