{"@context": "http://schema.org", "@type": "Recipe", "name": "Torrisi Turkey", "description": "The roast turkey breast that Rich Torrisi and Mario Carbone serve for lunch at their restaurant Parm in New York City is about the moistest, most luxuriously flavorful turkey available on the planet: rich and buttery, deep with rich turkey taste. They wrap a brined breast in plastic wrap and aluminum foil and place it in an intensely humid low-temperature oven that leaves the meat dense with moisture, heavy with flavor. Then they paint a glaze of honey and roasted garlic on the meat and place it in a hot, dry oven to create a crust. The result is turkey that tastes emphatically of turkey. And you can do it at home.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/18/dining/Torrisi-Turkey/Torrisi-Turkey-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "garlic, turkey breast, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 545}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 573, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "58 grams", "saturatedFatContent": "5 grams", "sodiumContent": "815 milligrams", "sugarContent": "29 grams", "transFatContent": null}, "recipeIngredient": ["1 cup kosher salt", "1 cup sugar", "2 boneless turkey breasts, 3 to 4 1/2 pounds each", "8 heads garlic, lightly smashed but intact", "4 teaspoons extra virgin olive oil", "1/2 cup honey", "1 tablespoon kosher salt", "1 tablespoon pepper", "1 tablespoon thyme leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To brine the turkey: In a medium saucepan, bring 2 quarts water to a boil with the salt and sugar. Pour into a large pot, and add 2 quarts cold water. Once the brine is cool, submerge the turkey breasts and refrigerate overnight, or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the glaze: Heat oven to 375 degrees. Toss the garlic heads with the olive oil in a small casserole dish, cover and roast until the garlic is soft, about 1 hour and 10 minutes. Leave covered until cool enough to handle, then squeeze the garlic cloves from their skins into a food processor and purée. Add the honey, salt and pepper. Cover until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the turkey: Heat oven to 250 degrees. Remove the breasts from the brine and wrap each one four times in plastic wrap and once in aluminum foil. Insert an oven-safe thermometer into the center of one breast and place both on a wire rack in a roasting pan. Add water to reach to just below the rack. Cook until the internal temperature reaches 135 degrees, 2 to 3 hours. Near the end of cooking time, fill a large bowl halfway with ice water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the turkey from oven and raise temperature to 425 degrees. Without removing thermometer or wrapping, submerge the turkey in the ice bath for 5 minutes. Remove foil, plastic wrap and turkey skin. Pat dry and brush glaze liberally on all sides of the breasts. Roast until glaze is golden, 15 to 20 minutes. Sprinkle with fresh thyme and serve thinly sliced, hot or cold."}]}