{"@context": "http://schema.org", "@type": "Recipe", "name": "Farfalle With Cabbage and Black Kale", "description": "Cavolo nero, or black kale, is my favorite of all the kales. For this dish I cut the blanched kale and cabbage into thin ribbons and cook them in a little olive oil with garlic, shallot and chili flakes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/11/23/science/21recipehealth/21recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "black kale, cabbage, farfalle, fall, healthy, low cholesterol, low-sodium, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 467, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "74 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "18 grams", "saturatedFatContent": "3 grams", "sodiumContent": "517 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 bunch black kale cavolo nero, stemmed and washed", "1/4 medium head of cabbage about 1/2 pound, kept intact on the core", "2 tablespoons extra virgin olive oil", "1 small shallot, minced", "2 large garlic cloves, minced", "1/2 teaspoon chili flakes", "Salt to taste", "3/4 pound farfalle", "1 to 2 ounces Parmesan, grated 1/4 to 1/2 cup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil; you’ll use it first to blanch the kale and cabbage and then to cook the pasta. Fill a large bowl with ice water. When the water comes to a boil, salt generously and add the kale. Blanch 3 minutes and, using a skimmer or a slotted spoon, transfer kale to the bowl of ice water, then drain and squeeze out excess water. Place on a cutting board and cut into thin ribbons. Add the wedge of cabbage to the pot and blanch for 3 minutes. Transfer to the ice water, then drain and squeeze out excess water. Cut away the core and cut crosswise into thin ribbons. Cover the pot and keep the water at a simmer for cooking the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, wide skillet and add the shallot. Cook, stirring until tender, about 3 minutes, and add the garlic and chili flakes. Cook, stirring, until the garlic is fragrant, 30 seconds to a minute, and add the kale and cabbage to the pan. Stir together for a couple of minutes, then add 1/2 cup of the blanching water to the pan. Cook uncovered, stirring often, for 5 minutes, then add another 1/2 cup of the blanching water to the pan and cook for another 5 minutes. Cover the pan and turn the heat to medium-low. Simmer for another 5 minutes. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring the remaining water in the pasta pot back to a boil and add the farfalle. Cook al dente, about 10 minutes. If desired, add another 1/4 to 1/2 cup of the pasta water to the kale and cabbage, then drain the pasta and add to the pan. Toss together and transfer to a platter, a wide pasta bowl or plates. Top with the Parmesan, and serve."}]}