{"@context": "http://schema.org", "@type": "Recipe", "name": "Marinated Giant White Beans and Beets", "description": "Many Greeks love giant white lima beans. This recipe is an adaptation of a dish prepared by the Greek chef Jim Botsacos for a Clean Monday celebration to benefit the Gennadius Library in Athens. Don’t soak the beans or they’ll fall while they cook. Mr. Botsacos serves this with skordalia.  ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/02/24/science/24recipehealth_600q/24recipehealth_600q-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "Serves six to eight", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 171, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "424 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dried large lima beans", "1 large white onion, cut in half", "4 garlic cloves, crushed", "1 bay leaf", "Salt to taste", "1/4 cup fresh lemon juice", "1/3 cup extra virgin olive oil", "1/2 cup finely chopped celery", "1/2 cup finely chopped yellow or red bell pepper", "1/2 cup finely chopped red onion, soaked for five minutes in cold water, drained and rinsed optional", "2 tablespoons chopped fresh dill", "8 small beets, greens cut away, scrubbed", "1/3 cup red wine vinegar or sherry vinegar", "Salt to taste", "2 garlic cloves, cut in half", "1/2 teaspoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beans in a large pot. Cover by 2 inches with water, and bring to a gentle boil. Skim off any foam, and add the onion, garlic and bay leaf. Turn the heat to low, cover and simmer 30 minutes. Add salt to taste, and simmer an additional 20 minutes until just tender. Remove from the heat. Remove and discard the onion, garlic cloves and the bay leaf. Allow the beans to cool in the liquid, then drain through a strainer set over a bowl. Gently toss the beans in a bowl with the lemon juice, olive oil, celery, peppers, onion and herbs. If desired, add 2 to 4 tablespoons of the bean broth. Season to taste with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the beets while the beans are cooking. Place in a saucepan, cover with water, add 1/4 cup of the vinegar and salt to taste. Bring to a boil, reduce the heat and simmer until tender, 30 to 45 minutes, depending on the size of the beets. Remove from the heat, add the garlic to the pot and set aside to cool. Remove the beets from the pot (do not drain), slip off the skins and cut in wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the remaining vinegar, the sugar and 1/4 cup of the beet broth (discard the garlic). Toss with the beets. Arrange the beans on a plate or in a bowl and surround with the beets. If you wish, serve this dish with skordalia."}]}