{"@context": "http://schema.org", "@type": "Recipe", "name": "Adobo-Fried Chicken", "description": "This chicken is simmered in an adobo broth of vinegar, bay leaves, sugar and soy sauce for 15 minutes, giving the meat a strong foundation in the Philippines before it is dunked in buttermilk, then breaded and fried. Make the dipping sauce and refrigerate it before you simmer the meat, so you can dig in as soon as the fried chicken has drained and cooled. A well-seasoned cast-iron pan and a splatter screen will help to keep your chicken crispy and your stovetop clean.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/06/28/dining/28COOKING-FRIEDCHICKENGUIDE15/28COOKING-FRIEDCHICKENGUIDE15-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "buttermilk, chicken, chili, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 164}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 756, "unsaturatedFatContent": "47 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "64 grams", "fiberContent": "1 gram", "proteinContent": "25 grams", "saturatedFatContent": "13 grams", "sodiumContent": "679 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons fresh lemon juice", "2 tablespoons maple syrup", "2 tablespoons fish sauce", "1 tablespoon soy sauce", "2 fresh Thai bird or habanero chiles, thinly sliced", "2 1/2 cups distilled white vinegar", "3 garlic cloves, finely minced", "4 bay leaves", "1 1/2 teaspoons black peppercorns", "1 teaspoon sugar", "1/4 cup soy sauce", "1/2 teaspoon red pepper flakes", "1 teaspoon salt", "2 pounds chicken pieces with skin, thighs and/or drumsticks, plus wings if desired (do not use breasts)", "Salt", "2 cups buttermilk", "1 cup all-purpose flour", "1 teaspoon paprika", "1/2 teaspoon black pepper", "About 8 cups peanut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dipping sauce: Combine all the ingredients with 3/4 cup water in a small bowl. Cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the broth: In a large pot with a tight lid, combine all the ingredients with 1 1/2 cups water, or enough to barely cover chicken. Cover and bring to a simmer over medium heat. Simmer for 5 minutes, then turn heat down as low as it will go."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange chicken pieces on a work surface and season with salt. Add to broth, cover and poach for 15 minutes, turning once halfway through. Make sure liquid does not get hotter than a gentle simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off heat and allow chicken to cool in the liquid about 20 minutes. Transfer chicken to a plate lined with paper towels. Pat dry. Discard broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour buttermilk into a large shallow bowl. In a sealable plastic bag, combine the flour, 1 teaspoon salt, the paprika and the pepper. Working a few pieces at a time, dip chicken in buttermilk, shake off any excess liquid, then drop into bag with flour mixture. Seal bag and turn to coat pieces. Remove pieces from bag, shake off any excess flour and transfer to a large plate. Let stand at room temperature for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pour oil into a large, deep cast-iron skillet fitted with a deep-frying thermometer until it comes just halfway up the sides. Heat oil to 365 degrees. Cook chicken pieces 3 or 4 at a time for 8 to 10 minutes, turning every minute or so, depending on how thick the pieces are; wings will cook faster and drumsticks will take longest. Be sure to keep oil temperature between 350 and 365 degrees. The chicken is cooked when internal temperature reaches at least 165 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, lift chicken out of oil and drain on paper towels. Let cool for at least 15 minutes (chicken should still be hot, but not scorching). Season again with a little salt and transfer to a platter. Serve hot, with the dipping sauce."}]}