{"@context": "http://schema.org", "@type": "Recipe", "name": "Soft Black Bean Tacos With Salsa and Cabbage", "description": "Canned black beans and lots of cabbage combine in a quick, utterly satisfying one-dish taco dinner.  They can be served open-faced or folded over<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/21/dining/softbbtacos/softbbtacos-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, easy, quick", "keywords": "black beans, cabbage, corn tortillas, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 152}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "21 grams", "proteinContent": "21 grams", "saturatedFatContent": "4 grams", "sodiumContent": "970 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon canola or grape seed oil", "1 teaspoon medium-hot chili powder (more to taste)", "1 teaspoon ground lightly toasted cumin seeds (more to taste)", "2 cans black beans, with liquid", "Salt to taste", "8 corn tortillas", "1 cup fresh or bottled salsa", "3 ounces either queso fresco, feta, or sharp cheddar, grated or crumbled", "2 cups shredded cabbage"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy skillet over medium-high heat and add the chili powder and ground cumin. Allow the spices to sizzle for about half a minute, until very fragrant, and stir in the black beans and 1/2 cup water. Cook, stirring and mashing the beans with the back of your spoon, for 5 to 10 minutes, until thick and fragrant. Be careful that you don’t let the beans dry out too much. If they do, add a little more water. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the tortillas, two or three at a time, in a dry skillet over medium-high heat, or in a microwave. Top with the black beans, salsa, cheese and cabbage. Fold the filled tortillas over if desired and serve. Alternatively, one at a time, place a tortilla on a plate, top with the beans and cheese and heat through for 30 seconds to a minute in a microwave. Then top with salsa and a generous handful of cabbage, and serve."}]}