{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Roasted Red Peppers and Goat Cheese", "description": "Years ago, I stayed with an Italian friend in Bologna who worked long hours at his job. By the time he got home, he was hungry, so he’d start water boiling and cast about his tiny kitchen to see what he could use for dinner. Then, to my fascination, he’d whip up a delicious pasta sauce from almost nothing: a few anchovies and some walnuts, or a can of tuna and another of beans. Yesterday’s bread became today’s bread crumbs, browned in olive oil with garlic and tossed with spaghetti, olives, capers and jarred tomato purée.  I try to keep a jar of roasted peppers handy at all times. They’re useful for panini, pizzas and especially pastas like this one. Spanish piquillo peppers are particularly sweet, but bell peppers will do as well. If you have basil, it’s delicious in this dish — but not required.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/12/07/science/06recipehealth/06recipehealth-articleLarge-v2.jpg", "totalTime": "PT10M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas", "keywords": "goat cheese, pasta, red pepper, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 173}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 444, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "15 grams", "saturatedFatContent": "4 grams", "sodiumContent": "346 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "1 cup thinly sliced roasted sweet red peppers", "Salt", "freshly ground pepper", "4 large basil leaves, cut in slivers chiffonade optional", "3 ounces goat cheese, crumbled", "3/4 pound pasta, any shape"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Meanwhile, heat the olive oil over medium heat in a large, heavy skillet. Add the garlic. Cook, stirring, until fragrant, about 30 seconds. Add the sliced roasted peppers, and stir together for about a minute until well infused with the oil and garlic. Season with salt and pepper, and stir in the basil (if using) and goat cheese. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, salt generously and add the pasta. Cook until al dente — firm to the bite — following the recommendations on the package. Ladle about 1/2 cup of the pasta cooking water into the frying pan, and stir well so that the goat cheese begins to melt. Drain the pasta, and toss immediately with the pepper mixture in the pan. Serve."}]}