{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Poached Pacific Sole With Lemon Caper Sauce", "description": "A fish piccata of sorts, this dish is easy to make and the lemon-caper sauce marries well with delicate varieties like sole, fluke or flounder, as well as more robust fish like swordfish. Start by laying fish fillets out in a baking dish and seasoning them with salt and pepper. Finely chop some shallots and briefly cook them in a skillet before adding wine. Pour the wine and shallots over the fish, cover with foil and bake until opaque and the fish pulls apart easily when gently probed with a fork. Meanwhile, whisk together garlic, capers, lemon juice and olive oil. When the fish emerges from the oven, pour the liquid from the dish back into the skillet to make a pan sauce. Reduce it to about 1/4 cup — thicker than you may imagine — stirring all the while. Add the garlic-caper mixture and some chopped parsley, whisk together and serve on top of the fillets, the mild flesh of the fish bathing in the bright, brawny flavors of the sauce. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11sole/11sole-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "capers, lemon, sole, dairy-free, gluten-free, healthy, kosher, low-carb, low sugar, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 423}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 299, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "22 grams", "saturatedFatContent": "3 grams", "sodiumContent": "632 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds Pacific sole or flounder fillets", "Salt and freshly ground pepper", "1 tablespoon extra-virgin olive oil", "3 tablespoons finely chopped shallot", "1 cup dry white wine (you can also use rosé; the sauce will have a pink hue)", "1 plump garlic clove, minced or puréed (more to taste)", "2 tablespoons capers, rinsed and coarsely chopped", "1/4 cup fresh lemon juice", "3 tablespoons extra-virgin olive oil", "2 to 4 tablespoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Oil or butter one or two baking dishes large enough to accommodate the fish fillets in one layer. Lay the fish in the dish(es) and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a small or medium skillet and add the shallot. Cook, stirring, until tender and translucent, about 3 minutes. Add the wine to the pan, bring to a boil, and pour the wine and shallots over the fish. Return the skillet to the stove (make sure the heat is off) for later use. Cover the baking dish with foil and place in the oven. Bake 8 to 10 minutes, or 5 minutes for each 1/2 inch of thickness, until the fish is opaque and pulls apart easily with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish is in the oven, whisk together the garlic, capers, lemon juice and olive oil. You can also mash the garlic in a mortar and pestle and work in the capers, lemon juice and olive oil, though I prefer the capers chopped, even some intact, and not puréed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the fish is done remove it from the oven and carefully transfer to a platter or plates. Cover and keep warm. Pour the liquid in the baking dish into the skillet and turn the heat on high. Reduce, stirring often, to about 1/4 cup – it should be thick – and stir in the garlic and caper mixture and the parsley. Whisk together, taste and adjust seasoning, pour over the fish and serve. "}]}