{"@context": "http://schema.org", "@type": "Recipe", "name": "Crisp Peanut Butter Sandwich Cookies", "description": "Inspired by two recipes in Maida Heatter’s “Book of Great Cookies,” these crisp treats are the best peanut butter cookies I’ve ever tasted.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/10/05/science/05recipehealth/05recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "24 to 28 cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "brown sugar, peanut butter, whole wheat pastry flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 124}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 109, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "54 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 ounces (1 1/4 cups) whole-wheat pastry flour", "1 teaspoon baking soda", "1/4 teaspoon salt", "4 ounces (1 stick) unsalted butter, cut into 1/2-inch pieces", "Heaped 1/2 cup smooth organic peanut butter, with no salt or sugar added, plus 2 tablespoons for filling the cookies", "5 ounces (3/4 cup) raw brown sugar", "1 egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flour, baking soda and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cream the butter and 1/2 cup of peanut butter in a mixer fitted with the paddle attachment. Scrape down the sides of the bowl, add the raw sugar and beat on medium speed for 1 to 2 minutes. Add the egg and beat together. Scrape down the sides of the bowl and gradually add the flour mixture, beating at low speed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a piece of parchment or wax paper on your work surface and spoon the dough onto the paper in a strip 12 to 14 inches long and about 2 inches thick. Fold the paper over the dough and shape the strip of dough into a log. Wrap in plastic and refrigerate several hours or, preferably, overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees Fahrenheit with racks positioned in the middle and lower portions. Line baking sheets with parchment. Remove the log of dough from the refrigerator and cut it in half. Rewrap one half and return to the refrigerator. Cut the remaining half into thin rounds, no thicker than 1/4 inch, and place them on the parchment-lined baking sheets about 1 inch apart, with the rows staggered. Place 1/4 teaspoon of peanut butter in the center of each round. Remove the other half of the dough from the refrigerator and slice in rounds. Place each round on top of a peanut butter-topped round. When all of the rounds are covered, lightly flour your fingertips and seal the cookies by pressing down gently all the way around. It won’t matter if the top cracks a little. Your rounds should be about 2 1/2 inches in diameter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake in the middle of the oven for 15 to 16 minutes, or until the cookies are lightly colored and semi-firm to the touch, switching the baking sheets top to bottom and front to back halfway through. Remove from the heat and allow to cool completely before eating. They won’t be crisp until they cool."}]}