{"@context": "http://schema.org", "@type": "Recipe", "name": "Bean and Green Herb Stew", "description": "This is inspired by a famous Persian stew that is traditionally made with chicken and kidney beans. I came across a vegetarian rendition of the stew in Louisa Shafia’s wonderful new book, “The New Persian Kitchen.” Louisa uses tofu in her stew; I’m just focusing on the beans, herbs and spinach.<br/><br/>It’s crucial to cook red kidney beans thoroughly, because they contain a naturally occurring toxin called phytohemagglutinin that causes extreme intestinal distress but is reduced to harmless levels when the beans are boiled for a sufficient amount of time (10 minutes is sufficient, according to the Food and Drug Administration, but of course beans require a lot more cooking than that to soften). You should not cook them in a crockpot because the temperature may not be high enough to destroy the toxin, and you should discard the soaking water.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/03/19/science/18recipehealth/18recipehealth-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, dried limes, red beans, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "13 grams", "proteinContent": "16 grams", "saturatedFatContent": "0 grams", "sodiumContent": "742 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 cup red kidney beans (either the small or the larger, more elongated variety), soaked for 4 hours or longer in 1 quart water", "1 bay leaf", "2 large onions, 1 cut in half, the other thinly sliced", "Salt to taste", "3 tablespoons extra virgin olive oil or grapeseed oil, plus additional olive oil for drizzling", "4 garlic cloves, minced", "1 generous bunch spinach (about 3/4 pound), stemmed, washed thoroughly and coarsely chopped, or 2 6-ounce bags baby spinach", "1 cup tightly packed, coarsely chopped flat-leaf parsley", "1 cup tightly packed, coarsely chopped cilantro", "1 cup thinly sliced scallions (2 bunches)", "2 dried limes (available in Persian markets), soaked in hot water to cover for 15 minutes (optional) (place a small plate over the limes to keep them submerged)", "Freshly ground pepper", "Fresh lemon juice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the kidney beans and rinse. Place in a large saucepan and add 1 quart fresh water. Bring to a boil over medium-high heat and skim off any foam. Add the bay leaf, halved onion, 1 of the garlic cloves, and salt to taste. Reduce the heat to low, cover and simmer 1 hour. Remove the bay leaf and halved onion and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 3 tablespoons oil over medium heat in a heavy soup pot or Dutch oven and add the sliced onion. Cook, stirring often, until it begins to color. Turn the heat to low, add a generous pinch of salt and continue to cook, stirring often, until the onion is dark brown and has melted down to about half its original volume, about 20 minutes. Stir in the remaining garlic and cook, stirring, until it is fragrant, about 30 seconds. Add the beans with their broth and bring to a simmer. Simmer, partly covered, for 30 to 60 minutes, until the beans are tender. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the spinach by the handful, stirring until wilted before adding the next handful, until all of the spinach has been added. Stir in the herbs and scallions. Using a needle, pierce the limes in a few places and add them along with 1/2 cup of their soaking water (if you aren’t using the limes, just add an additional 1/2 cup water). Simmer for 10 to 15 minutes, until the greens and herbs are tender but still bright. Taste and adjust salt. Add pepper. Remove the dried limes before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with lemon wedges and squeeze fresh lemon juice into each bowl. "}]}