{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Soba, Baked Tofu and Green Bean Salad With Spicy Dressing", "description": "You can make this salad with wide rice noodles, but I love the nutty flavor and wholesomeness of buckwheat soba.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/15/science/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "weekday, salads and dressings", "keywords": "green beans, soba noodles, tofu, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 201}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 362, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "13 grams", "saturatedFatContent": "2 grams", "sodiumContent": "715 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound tofu", "1 tablespoon low-sodium soy sauce", "1 teaspoon minced ginger", "1 garlic clove, minced", "1 teaspoon agave nectar", "1 tablespoon canola, rice bran oil or grape seed oil", "1 teaspoon dark sesame oil", "1/2 pound green beans, trimmed and cut into 1-inch lengths (about 2 cups)", "Salt to taste", "3/4 pound soba noodles", "1/4 cup dark sesame oil", "1 tablespoon of the tofu marinade", "2 tablespoons rice vinegar", "1 garlic clove, minced or pureed", "2 teaspoons minced ginger", "1/2 teaspoon hot chile oil or 1/8 to 1/4 teaspoon cayenne pepper (to taste)", "1 tablespoon soy sauce", "1/3 cup buttermilk", "1/4 to 1/2 cup chopped cilantro (to taste)", "1 tablespoon lightly toasted sesame seeds or black sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the baked tofu: Preheat the oven to 375 degrees. Line a sheet pan with parchment. Pat the tofu dry with paper towels and cut into dominoes, about 1/3 inch thick. In a large, wide bowl whisk together all of the marinade ingredients for the tofu. Pat each piece of tofu with paper towels, then dip into the marinade, making sure to coat both sides. Transfer to the baking sheet. Bake for 7 to 10 minutes, until the edges are just beginning to color and the marinade sets on the surface of the tofu. Remove from the heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 3 or 4 quarts of water to a boil in a large pot. Add salt to taste and the green beans. Boil 5 minutes and using a slotted spoon or skimmer, transfer to a bowl of cold water and drain. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water back to a boil. Add the soba gradually, so that the water remains at a boil, and stir once with a long-handled spoon or pasta fork so that the noodles don’t stick together. Wait for the water to come back up to a rolling boil – it will bubble up, so don’t fill the pot all the way – and add 1 cup of cold water. Allow the water to come back to a rolling boil and add another cup of cold water. Allow the water to come to a boil one more time and add a third cup of water. When the water comes to a boil again, the noodles should be cooked through. Drain and toss with 2 tablespoons of the sesame oil. (If using rice noodles, boil 5 to 6 minutes without adding the water, until cooked al dente)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together 1 tablespoon of the tofu marinade, the rice vinegar, garlic, ginger, hot chile oil or cayenne, soy sauce, remaining sesame oil and buttermilk. Pour over the noodles, add the beans, tofu and cilantro, and gently toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wide skillet over medium-high heat and add the noodle salad. Toss in the pan until heated through and serve."}]}