{"@context": "http://schema.org", "@type": "Recipe", "name": "Pesto and Pistou", "description": "I use pesto and pistou in many other dishes besides pasta. Pesto is a nutritionally dense condiment; basil is a great source of flavonoids that are believed to have antioxidant and antibacterial properties. It&rsquo;s also an excellent source of vitamin K, and a very good source of iron, calcium and vitamin A. Purists will only use a mortar and pestle for pesto. I like the results I get using a hand blender inside a straight-sided jar. As long as you make the full batch, this is the best machine to use, as it pur&eacute;es the basil much more efficiently than a food processor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/10/18/science/17recipehealthpesto/17recipehealthpesto-articleLarge-v2.jpg", "recipeYield": "1/2 to 2/3 cup", "recipeCuisine": "french, italian", "recipeCategory": "easy, quick, condiments", "keywords": "basil, garlic, parmesan, gluten-free, healthy, low cholesterol, low-sodium, raw, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 800, "unsaturatedFatContent": "55 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "81 grams", "fiberContent": "1 gram", "proteinContent": "15 grams", "saturatedFatContent": "16 grams", "sodiumContent": "817 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 or 2 garlic cloves, to taste", "2 cups fresh basil leaves, tightly packed 2 ounces", "2 tablespoons Mediterranean pine nuts* (for pesto; omit for pistou)", "Salt", "freshly ground pepper to taste", "1/3 cup extra virgin olive oil", "1/3 cup (1 1/2 ounces) freshly grated Parmesan, or a mixture of pecorino Romano and Parmesan more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a hand blender, place the garlic, basil, pine nuts, salt and olive oil in a pint jar. Stick the hand blender right down into the mixture and turn on. Blend until smooth. You may have to start and stop a few times at the beginning, and scrape down the sides of the jar. Once the mixture is smooth, add the cheese and stir or blend together. If using a food processor fitted with the steel blade, turn on and drop in the garlic. When it is chopped and adhering to the sides of the bowl, stop the machine and scrape down the sides of the bowl with a spatula. Add the basil, pine nuts, salt, pepper and olive oil to the food processor and process until smooth and creamy. Add the Parmesan and pulse until well combined. If using a mortar and pestle, add the basil leaves a handful at a time and mash with the pestle. Add the pine nuts, garlic, salt and pepper, and mash to a paste with the basil. Work in the olive oil and the Parmesan."}]}