{"@context": "http://schema.org", "@type": "Recipe", "name": "Poundcake and Strawberries", "description": "A hard man I know made this dessert once out of supermarket cake and industrial strawberries, to serve small children who were maybe slightly afraid of him. They gurgled with delight when he slid bowls of it before them: the cake cut into large cubes and served beneath the macerated strawberries, with fresh whipped cream. This formed a bond between them all. In the crowd in which I run, poundcake and strawberries has since become a spring and summer standard, the cake home-made and, when we're lucky, the strawberries gathered from fields nearby. But not always. A supermarket version is a worthy substitute.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/05/16/dining/ss-poundcake-and-strawberries/merlin_154348446_aedb960e-7c0a-4337-adef-bb2882f40efe-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, strawberry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 145}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 327, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "10 grams", "sodiumContent": "75 milligrams", "sugarContent": "23 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound unsalted, softened butter (4 sticks), cubed, plus extra for greasing the cake pan", "1 pound granulated sugar (2 cups)", "8 large eggs", "1 pound all-purpose flour (4 cups), plus extra for flouring the cake pan", "1/2 teaspoon salt", "1 1/2 teaspoons vanilla extract", "Zest of 1 large lemon", "Juice of 1 large lemon", "1 quart strawberries, rinsed and sliced", "1/2 cup white sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. In a bowl or a standing mixer, beat the butter until it is creamed, then add the\nsugar, beating until it is well mixed. Beat\nthe eggs in a bowl and add them to\nthe mixture. Add the salt. Add the flour,\na little bit at a time, and then the\nvanilla, the lemon zest and juice, mixing to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease and flour a Bundt pan or\ntwo cake pans. Pour in the batter. Bake for approximately 1 1/4 hours, or until a knife inserted into the center of the cake comes out clean. Turn the cake out\nand allow to cool on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cake into large cubes. Combine strawberries with sugar in a bowl and allow to sit for 20 to 30 minutes. Put strawberries on top of cake. Top with whipped cream."}]}