{"@context": "http://schema.org", "@type": "Recipe", "name": "Mendiant Tart With Dark Chocolate Ganache", "description": "", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2013/03/13/dining/13JPCARM4/13JPCARM4-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "1 8- or 9-inch tart", "recipeCuisine": "french", "recipeCategory": "", "keywords": "all-purpose flour, dark chocolate, heavy cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["1/4 teaspoon vanilla extract", "2 large eggs", "499 grams (3 1/2 cups) all-purpose flour, plus more for flouring work surface", "155 grams (1 1/3 cup) confectioners’ sugar", "Pinch of kosher salt", "1/2 pound (2 sticks) cold unsalted butter, cubed", "Nonstick baking spray", "226 grams (1/2 pound) 70-percent-cacao dark chocolate, chopped", "1 1/2 cups heavy cream", "2 tablespoons wildflower honey", "Pinch of kosher salt", "Toasted whole walnuts and pistachios", "Mini-marshmallows or large marshmallows snipped into jagged shapes", "Strips of orange confit", "Shards of candied ginger", "Fleur de sel or Maldon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tart shell: In a small bowl, combine the vanilla, 1 whole egg and the yolk of another, reserving the remaining egg white for sealing the baked shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with a paddle attachment, combine the flour, sugar and salt. Mix on low speed, then add the butter and continue until mixture has a sandy consistency, about 2 minutes. Add vanilla-egg mixture and continue to mix until the dough comes together around the paddle, 3 to 5 minutes. Divide dough into 2 disks and wrap individually in plastic. Chill until dough is cold but not too hard to roll, about 30 minutes. (The second disk may be double-wrapped in plastic and frozen for up to 1 month; defrost in the refrigerator overnight before using.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Apply nonstick baking spray to a fluted 8- or 9-inch tart pan with a removable bottom. On a lightly floured surface, roll out 1 chilled disk to 1/8-inch thickness, about 11 or 12 inches in diameter. Gently roll dough onto a floured rolling pin, and unroll into tart pan. Press dough into pan&rsquo;s corners, being sure it remains the same thickness all around. Roll the rolling pin across pan edges to cut off excess dough. Place pan in freezer for about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line tart shell with a 12-inch-round sheet of parchment paper, and pour in 3 cups of pastry weights, dry beans or rice. Bake until edges of dough start to color, about 10 minutes. Allow to cool slightly before removing parchment and weights. Return to oven until base of pastry loses its sheen and is slightly golden, another 5 to 7 minutes. Lightly whisk the reserved egg white, and brush it over the entire inner surface of the shell. Return shell to oven to dry the egg white, about 1 minute. Remove from heat and allow to cool completely before filling. (Cooled shell may be wrapped in plastic and stored at room temperature for up to 24 hours before filling.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ganache: Place chocolate in a medium bowl. In a small saucepan, combine cream, honey and salt. Bring to a simmer and immediately pour over the chocolate; allow to sit for 1 minute. Using a spatula, begin stirring mixture in the center of the bowl, widening the circle as the cream and chocolate emulsify to create a silky ganache."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour ganache into shell, filling it to the brim. Allow to rest in a cool place for 10 minutes so chocolate can lightly set. Gently and artfully place toppings on the ganache surface. Let rest in a cool place for another hour, or refrigerate for 20 minutes for a faster set. Serve at room temperature, slicing with a sharp knife first dipped in hot water."}]}