{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Wheat and Roasted Vegetables with Herb Salad", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, weekday, salads and dressings", "keywords": "fresh herbs, green wheat, vegetables, vegan, vegetarian", "aggregateRating": null, "recipeIngredient": ["1/4 cup extra virgin olive oil", "1 cup mixed diced 1/3 inch carrot, onion and celery", "1 bay leaf", "3 cups green wheat (labeled as frik see note)", "5 1/2 cups vegetable broth or water", "Salt", "freshly ground black pepper", "4 cups spinach leaves", "1 bunch asparagus, trimmed of coarse bottom ends", "1 cup baby turnips, halved", "1 cup peeled cippoline onions or spring onions, halved if larger than a quarter", "1 cup baby carrots, trimmed", "1 cup fennel bulb, thinly sliced with core still attached", "1 cup yellow or green wax beans, trimmed", "1 cup morel or shiitake mushrooms, cleaned and trimmed of stems", "1 bunch spring garlic or 1/4 cup small (or halved if large) garlic cloves", "5 sprigs fresh thyme", "Extra virgin olive oil", "1/4 cup parsley leaves", "1/4 cup basil leaves", "1/4 cup whole mint leaves", "Juice and finely grated zest of 1 lemon", "1/4 cup calamata or other briny black olives, halved lengthwise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the green wheat: Place a medium saucepan over medium heat, and add olive oil, diced vegetables and bay leaf. Stir, cover and cook, stirring occasionally, until tender, about 5 minutes. Add green wheat and cook uncovered, stirring, until lightly browned, 3 to 5 minutes. Add broth or water, and season to taste with salt and pepper. Cover and reduce heat to low. Simmer, stirring every five minutes, for 30 minutes. Meanwhile, prepare roasted vegetables and herb salad."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For roasted vegetables: Preheat oven to 400 degrees. Spread vegetables, mushrooms, garlic and thyme in a roasting pan. Lightly coat with olive oil and season liberally with salt and pepper. Roast until just tender (be careful not to overcook), about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the herb salad: In a medium bowl, combine parsley, basil, mint, lemon juice, lemon zest and olives. Add olive oil to taste, and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: When frik is cooked, mix in the spinach just before serving, and adjust salt and pepper to taste. Place a serving of green wheat in center of each of four plates, and arrange roasted vegetables on top as desired. Garnish each plate with herb salad, and serve immediately."}]}