{"@context": "http://schema.org", "@type": "Recipe", "name": "Curried Egg Salad", "description": "Here is a recipe our colleague Jeff Gordinier got from the New York chef Jesse Schenker in the process of writing an article about Mr. Schenker’s efforts to lose weight. It is for a much lighter version of the egg salad you may ordinarily make, with Greek yogurt standing in for mayonnaise and a number of egg yolks held back from the finished dish. But it is important to note that you don’t have to do that. You can make this dish with all the yolks if you like, and pile the result into the midst of a green salad or on top of a roll, and you’ll have a fine meal indeed.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2014/08/18/dining/curriedegg/curriedegg-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About 1 cup", "recipeCuisine": "", "recipeCategory": "easy, lunch, quick", "keywords": "curry powder, eggs, greek yogurt, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 283}, "recipeIngredient": ["4 hard-boiled eggs, peeled", "1 teaspoon plain 2-percent-fat Greek yogurt", "1/4 teaspoon extra virgin olive oil", "2 teaspoons lemon juice, or to taste", "1/2 teaspoon finely grated lemon zest", "1/2 teaspoon sriracha, or to taste", "1/4 teaspoon sherry vinegar, or to taste", "1/3 teaspoon curry powder, or to taste", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine one of the eggs with the whites of the three remaining eggs. (Discard the three yolks or reserve for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fork, chop or lightly mash the eggs. Add the yogurt, olive oil, lemon juice, lemon zest, sriracha, vinegar and curry powder. Season with a pinch of kosher salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix well and adjust seasonings as needed. If desired, spread egg salad on any healthful fiber cracker with single-digit carbohydrates per serving (in grams), and top with sliced cucumber."}]}