{"@context": "http://schema.org", "@type": "Recipe", "name": "Bean and Farro Soup With Cabbage and Winter Squash", "description": "This is a big, comforting soup — nothing fancy, just a hearty potage with lots of texture and layers of sweet and savory, earthy and vegetal flavors. Serve it to hungry houseguests and children for lunch or dinner.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/bean-farro-soup-cabbage/bean-farro-soup-cabbage-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Serves six to eight", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "healthy, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 107}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "7 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "552 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound (1 1/4 cups) borlotti beans, pinto beans or red beans, soaked overnight or for six hours in 1 quart water", "2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "1 medium carrot, chopped", "1 small celery stalk, with leaves, chopped", "2 teaspoons chopped fresh sage", "4 large garlic cloves, minced", "Salt", "freshly ground pepper to taste", "1 pound green cabbage, cored and shredded", "A bouquet garni made with a bay leaf, a couple of sprigs each parsley and thyme", "1 Parmesan rind, wrapped in cheesecloth or tied together", "1 pound butternut squash, peeled, seeded and diced about 2 cups", "1/2 cup farro", "Generous 1/2 teaspoon crumbled dried or 1 teaspoon minced fresh rosemary", "1 (14-ounce) can tomatoes, with liquid, chopped", "Freshly ground pepper to taste", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans. Heat 1 tablespoon of the olive oil over medium heat in a large, heavy soup pot or Dutch oven, and cook the onion until it begins to soften, about three minutes. Add the carrot, celery and sage, and continue to cook, stirring, until tender, about five minutes. Add half the garlic, and cook, stirring, until fragrant, about one minute. Add the cabbage and 1/2 teaspoon salt, and cook, stirring often, until limp, about 10 minutes. Add the beans, bouquet garni and 2 quarts water, or enough to cover by 2 inches. Bring to a boil, add salt to taste, reduce the heat and simmer one hour. Stir in the squash, and continue to simmer for 30 minutes to an hour, until the beans and squash are tender. Using an immersion blender, partially puree the soup to thicken it, or puree 2 cups in a blender. (If using a blender, do this in batches and cover the blender with a kitchen towel to avoid hot soup splashing). Return to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the soup is simmering, combine the farro or wheat berries and 2 cups water in a medium saucepan and bring to a boil. Add 1/4 to 1/2 teaspoon salt (to taste), reduce the heat, cover and simmer until tender, about 45 minutes. If there is water left in the pan, drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining oil in a medium-size skillet over medium heat, and add the garlic and rosemary. Cook for 30 seconds to a minute, until fragrant, and stir in the tomatoes. Add salt to taste, and cook, stirring often, until the tomatoes have cooked down and the mixture is thick, beginning to stick to the pan and delicious, 10 to 15 minutes. Stir into the soup. Continue to simmer for another 30 minutes. Stir in the farro. Taste and adjust salt, and add lots of freshly ground pepper. Serve with freshly grated Parmesan."}]}