{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Lamb Sausage With Grilled Onions and Zucchini", "description": "This is modeled after North African merguez, which is sometimes served as part of an elaborate couscous meal, but good on a bun, too. For its deep rust-red color, merguez relies on lots of dried sweet red pepper (paprika) and a goodly amount of hot red pepper (cayenne). Garlic, cumin and coriander are strong supporting players.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/06/12/dining/12KITCH2_SPAN/12KITCH2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "24 (2-ounce) sausages, 6 to 8 servings", "recipeCuisine": "african", "recipeCategory": "dinner", "keywords": "ground lamb, onion, zucchini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 117}, "recipeIngredient": ["3 pounds ground lamb, or a mixture of half lamb and half beef or veal", "2 teaspoons toasted cumin seeds", "2 teaspoons toasted coriander seeds", "1 teaspoon black peppercorns", "6 allspice berries", "2 teaspoons salt, more as needed", "1/2 teaspoon cayenne", "Pinch cinnamon", "4 tablespoons mild paprika", "8 large garlic cloves, smashed to a paste", "1/2 teaspoon toasted cumin seeds", "1/2 teaspoon toasted coriander seeds", "1/2 teaspoon toasted caraway seeds", "1 teaspoon paprika", "Cayenne, to taste", "2 garlic cloves, smashed to a paste", "2 tablespoons red wine vinegar", "1 tablespoon lemon juice", "1/4 teaspoon salt", "4 tablespoons olive oil", "2 sweet onions, such as Vidalia, in 1/2-inch crosswise slices", "Olive oil", "Salt and pepper", "4 medium zucchini, in 1/2-inch lengthwise slices", "2 heads bibb or other lettuce, washed", "3 or 4 large ripe tomatoes, cut in wedges", "2 tablespoons roughly chopped cilantro", "2 tablespoons roughly chopped mint", "Pita breads, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sausage, put ground lamb in a mixing bowl. Using a spice mill or mortar and pestle, grind cumin, coriander, black pepper and allspice. Add to lamb, along with salt, cayenne, cinnamon, paprika and garlic. Mix well with hands to incorporate. Fry a little piece of the mixture in a small skillet. Taste for seasoning and adjust salt if necessary. Mix again and refrigerate at least 2 hours or, preferably, overnight. Form mixture into 24 two-ounce patties."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the vinaigrette, grind cumin, coriander and caraway. Combine with paprika and a good pinch of cayenne in a small bowl. Add garlic, vinegar, lemon juice and salt. Whisk in olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a charcoal grill or use a grill pan. The heat should be moderate. Grill sausages, in batches if necessary, for about 2 minutes per side, until just done. Keep warm. Paint onion slices with a little olive oil, season with salt and pepper, and grill until softened slightly, about 2 minutes per side. Repeat with zucchini. Keep at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large platter with lettuce leaves and pile sausages in the middle. Arrange onions and zucchini around the platter. Salt the tomatoes and distribute. Whisk the vinaigrette, then drizzle over everything. Sprinkle with cilantro and mint, and serve with warm pita breads, if desired."}]}