{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Wheat Irish Soda Bread With Bulgur", "description": "If you have ever been to Ireland you have tasted soda bread, a moist, easy to make bread that is rich and nutty tasting when made with whole wheat flour. It is a very quick and easy bread to make as long as you are willing to get your hands sticky. When you pull the bread from the oven wrap it loosely in a kitchen towel and allow to cool. This softens the crust and makes it easier to cut.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/03/05/science/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "1 9-inch loaf (about 16 generous slices)", "recipeCuisine": "irish", "recipeCategory": "weekday", "keywords": "appetizer, buttermilk, medium bulgur wheat, whole wheat flour, halal, healthy, kosher, low-fat, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "recipeIngredient": ["120 grams (about 3/4 cup) medium (#2) bulgur", "1 cup boiling water", "460 grams (about 3 2/3 cups) whole wheat flour", "8 grams baking soda (1 1/2 teaspoons)", "10 grams salt (about 1 1/2 teaspoons)", "2 cups buttermilk (more as needed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bulgur in a bowl and pour on 1 cup boiling water, or enough to cover the bulgur by about 1/2 inch. Cover the bowl and allow the bulgur to sit for 30 minutes, until all the water has been absorbed and the grains are tender. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile preheat the oven to 450 degrees and line a baking sheet with parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the flour in a large, wide bowl and sift in the baking soda and salt. Mix in with your hands or with a wide spatula. Make a well in the middle of the flour and pour in the buttermilk. Add the bulgur to the well, then mix in the flour from the sides of the bowl to the center using a wide rubber spatula, a wide wooden spoon or your hands, turning the bowl and sweeping the flour from the sides into the buttermilk. Mix until the bulgur and buttermilk have been incorporated into the flour, then scrape out onto a lightly floured work surface. The dough should be soft and a bit sticky. Flour your hands so it won’t stick to them. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently knead the dough, only enough to shape it into a ball, then with floured hands gently pat it down to a 2-inch high round, about 9 inches in diameter. Place it on the parchment-lined baking sheet and cut a 1/2-inch deep cross across the top. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake 20 minutes at 450 degrees. Turn down the heat to 375 degrees and bake for another 15 to 20 minutes, until the loaf responds with a hollow sound when tapped on the bottom. Remove from the oven, wrap loosely in a cloth or kitchen towel, and cool on a rack."}]}