{"@context": "http://schema.org", "@type": "Recipe", "name": "Toasted Spaghetti Primavera", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Toasted-Spaghetti-Primavera/Toasted-Spaghetti-Primavera-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, pastas, project", "keywords": "bucatini, miso, vegetables, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 854, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "134 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "20 grams", "proteinContent": "28 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1706 milligrams", "sugarContent": "28 grams", "transFatContent": null}, "recipeIngredient": ["1 cup fresh English peas, shelled, shells reserved, or 1 cup frozen peas", "4 cups snap peas", "Fine sea salt", "1 small Romanesco broccoli, cut into small florets", "12 sugar snap peas", "20 1-inch-long carrots, cleaned", "4 thin asparagus spears", "6 very small French breakfast radishes, trimmed", "About 6 tablespoons olive oil, plus more for drizzling", "1 teaspoon finely grated garlic", "1 tablespoon minced green garlic", "1 teaspoon chopped capers", "1/2 teaspoon red-pepper flakes", "1 teaspoon red miso paste", "Zest and juice of 1 lemon", "1 pound bucatini", "1/4 cup thinly sliced parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 cups water to a boil. Reduce heat to low, add pea shells and steep for 90 minutes. Strain and cool. Discard shells and reserve 2 cups of broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Bring a large pot of heavily salted water to a boil. Prepare an ice-water bath. Drop the peas into the boiling water and cook until just soft, about 2 minutes (30 seconds if frozen). Using a strainer, transfer the peas to the ice water, then remove and roughly chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return water to a boil. Boil the Romanesco and sugar snaps for 30 seconds; transfer to ice water with a slotted spoon. Boil carrots for 1 to 3 minutes and transfer them to the ice water. Save boiling water for the pasta, adding more water and salt as needed. Carefully separate the sugar snaps in half along their seams so that half of the peas remain hinged on each half of the shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a vegetable peeler or mandoline, slice asparagus and radishes lengthwise. Spread on a baking sheet. Toss with olive oil. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan set over medium heat, add 2 tablespoons olive oil. Add the garlic, green garlic, capers, pepper flakes and a large pinch of salt. Sauté until fragrant but before the garlic browns, 30 to 60 seconds. Add the pea broth and the miso paste and bring to a boil. Add the peas, sugar snaps, carrots and Romanesco. Season to taste with salt, miso, lemon zest and lemon juice. Remove from the heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 20 minutes before serving, break the pasta into 2-inch pieces and place on a baking sheet. Coat with 2 tablespoons olive oil and toast in the oven until golden, 10 to 15 minutes. Immediately transfer to the boiling salted water and cook until al dente. Transfer to the miso broth. Set over medium heat and stir until well combined and hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion the pasta and broth into 4 bowls. Top each with a few slices of asparagus and radish, a sprinkle of parsley and, if you choose, miner’s lettuce or edible pansies. Drizzle with olive oil."}]}