{"@context": "http://schema.org", "@type": "Recipe", "name": "Lot 2's Pecorino Fried Bread With Broccoli", "description": "Katherine Youngblood, the chef de cuisine at Lot 2 in Brooklyn, sautées heirloom broccoli with garlic, chile flakes, anchovy and plenty of lemon, and serves it heaped on olive oil-fried bread showered with pecorino. The oily crunch of the bread, the saltiness of the cheese and the sweetness of the broccoli combine into something that, had it not been for my sense of propriety, would have had me licking the plate. I made a few minor edits while testing the recipe, taking down the olive oil by just a bit and streamlining the method. The result is a wonderful melding of simple ingredients and techniques that is easy to replicate at home, whenever the craving strikes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/03/06/dining/06TAKEOUT_SPAN/06TAKEOUT-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "appetizer, broccoli, country bread, pecorino", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 94}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 330, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "6 grams", "sodiumContent": "624 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound broccoli di ciccio, broccolette or regular broccoli", "4 garlic cloves", "1/4 cup plus 1 tablespoon extra-virgin olive oil", "4 (1-inch thick) slices day-old pain au levain or rustic white bread", "6 anchovies, roughly chopped", "1/2 teaspoon chile flakes", "Juice and finely grated zest of 1/2 lemon", "Salt, to taste", "1/2 cup grated pecorino Romano cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Prepare a large bowl of ice water. If using regular broccoli, cut into 2-inch pieces. Trim broccoli di ciccio or broccolette but leave whole. Blanch broccoli until bright green and just tender, about 1 minute. Transfer to ice water to cool. Let drain and squeeze out extra moisture. Roughly chop broccoli into bite-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mince 3 garlic cloves and halve the remaining one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a heavy-bottomed skillet over medium-high  until hot but not smoking. Fry 2 pieces of bread until golden brown, about 2 minutes per side. Set bread aside. Repeat with 2 more tablespoons olive oil and remaining bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining  tablespoon oil to skillet. Add minced garlic, the anchovies and chile flakes, and cook for about 30 seconds or until fragrant. Add broccoli and heat until warmed through, 1 to 2 minutes. Turn off heat and stir in lemon juice and zest and a pinch of salt, or to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub fried bread with garlic clove halves and sprinkle with some of the cheese. Place broccoli on top of bread and garnish with more cheese."}]}