{"@context": "http://schema.org", "@type": "Recipe", "name": "Edna Lewis’s Lemon Cheese Layer Cake", "description": "This recipe for lemon cheesecake by the Southern chef Edna Lewis was featured in a Times article about Southern cakes. It is a lovely layer cake that makes economical use of yolks and whites, and it’s nothing like what a New Yorker thinks of as cheesecake. The “cheese” is really an eggy lemon curd piled between layers of cake made sturdy by egg whites. More lemon curd covers the whole cake, its layers visible beneath the slightly translucent jelly. The cake tastes better the next day.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": null, "totalTime": "PT2H", "recipeYield": "One  layer cake", "recipeCuisine": "southern", "recipeCategory": "sauces and gravies", "keywords": "dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 28}, "recipeIngredient": ["1 cup (2 sticks) unsalted butter at room temperature, more to grease pan", "3 1/4 cups cake flour", "2 1/4 teaspoons baking powder", "1/4 teaspoon salt", "2 cups granulated sugar", "8 egg whites", "1 cup milk", "2 teaspoons vanilla extract", "2 1/4 cups granulated sugar", "3/4 cup plus 1 tablespoon fresh lemon juice", "3/4 cup (1 1/2 sticks) unsalted butter, melted", "12 egg yolks", "3 tablespoons finely grated lemon zest", "1/2 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Grease three 9-inch cake pans and line with parchment or waxed paper. Mix flour, baking powder and salt and sift onto a piece of waxed paper or parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, beat sugar and butter until light and fluffy, scraping sides as needed. Whisk egg whites until well blended but not foamy, and add to batter in 4 batches, making sure each addition is well incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add dry ingredients and milk to batter, alternately, in 4 batches, mixing each only until just blended. Mix in vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter among 3 pans. Gently drop each one on a counter to eliminate large air bubbles. Bake for about 20 minutes or until cake springs back in center when pressed or a cake tester comes out clean. Let rest for 5 minutes, then remove cake from pan and cool completely on rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make curd: Put all ingredients in a non-reactive saucepan and whisk to blend. Set over medium heat and cook, stirring constantly, until filling thickens and a candy thermometer registers 170 degrees. This can take 10 to 15 minutes. Do not let filling simmer or boil. Remove from heat and pour into a bowl to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a cake layer on a cake stand or plate and spread 2/3 cup curd on top to the edges. Stack another layer and continue until all layers have been used. Use remaining curd on top and sides. Filling is somewhat translucent, so layers will be visible through curd on sides. If layers slide while frosting, push 3 or 4 long wooden skewers through them to hold until cake sets. Cake is best left covered at room temperature overnight."}]}