{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish Hummus with Yogurt", "description": "This is much like the familiar Middle Eastern chickpea purée, but instead of tahini, the chickpeas are blended with yogurt. It’s lighter than the version made with tahini, and it’s nice either warm or at room temperature. Skinning the chickpeas makes a more delicate, smoother purée, and it doesn’t take as long as you’d think, but I leave the step as an optional one. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/28/science/30recipehealth/30recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H15M", "recipeYield": "2 cups, serving 8 to 12", "recipeCuisine": "turkish", "recipeCategory": "", "keywords": "appetizer, dried chickpeas, garlic, greek style yogurt, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 66}, "recipeIngredient": ["6 ounces (1 cup) dried chickpeas, rinsed, picked over and soaked for 4 to 6 hours, or overnight", "Salt to taste", "2 garlic cloves, green shoots removed", "1/2 teaspoon ground cumin", "3 tablespoons freshly squeezed lemon juice", "3 to 4 tablespoons extra virgin olive oil, to taste", "1/4 cup thick Greek-style or drained yogurt", "Fresh pomegranate seeds", "Ground cumin", "Black olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the soaked chickpeas and place in a pot with 1 quart of water. Bring to a boil, reduce the heat and simmer 1 hour. Add salt to taste and continue to simmer for another hour, or until chickpeas are thoroughly tender. Remove from the heat. Drain but retain about 1/2 cup of the cooking liquid. You should have 2 cups cooked chickpeas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with the steel blade and drop in the garlic. When the garlic is chopped and adhering to the sides of the bowl, stop the food processor and scrape down the sides of the bowl. Add the chickpeas, salt and cumin, and turn on the machine for about 30 seconds. Stop the machine, scrape down the sides, and start the machine again. With the machine running, add the lemon juice, olive oil and yogurt, and blend until smooth. Taste and adjust salt. Thin out as desired with cooking broth from the chickpeas, or with more yogurt. Transfer to a wide bowl, and garnish if desired. Serve with warm pita bread."}]}