{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Cauliflower", "description": "This dish is derived from a Marcella Hazan recipe. It’s dead simple, and the cauliflower can be precooked a day ahead or so. Or, the whole thing can be made at once: cook the cauliflower in water, scoop it out and then, later, cook the pasta in the same water. It’s already boiling, and you want the taste of the cauliflower anyway, so why not? The cauliflower gets cooked more, in a skillet with toasted garlic, so don’t boil it to death, although you do want it to be tender. And in the original Minimalist recipe, from 2000, bread crumbs were added to the skillet along with the cauliflower, but since some pasta water is usually added to the skillet to keep the mixture saucy, the bread crumbs become soggy. Better, then, to stir the bread crumbs in at the very end. They should be very coarse and ideally homemade, and if they’re toasted in olive oil in a separate skillet before you toss them in, so much the better.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/08/dining/califlowervid/califlowervid-mediumThreeByTwo440.jpg", "totalTime": "PT40M", "recipeYield": "3 or 4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, easy", "keywords": "main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 578}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 686, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "112 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "8 grams", "proteinContent": "21 grams", "saturatedFatContent": "3 grams", "sodiumContent": "678 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 head cauliflower, about 1 pound", "Salt and black pepper", "1 tablespoon minced garlic", "1/4 cup olive oil", "1 pound penne, fusilli or other cut pasta", "1 cup coarse bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Trim the cauliflower and divide it into florets. Add about a tablespoon of salt to the water and boil cauliflower until it is tender but not mushy. Using a slotted spoon or strainer, remove the cauliflower and set it aside. When it is cool enough to handle, chop it roughly into small pieces. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large deep skillet over medium-low heat, sauté garlic in olive oil, stirring occasionally, until garlic is golden. Start cooking pasta in same pot and same water as was used for the cauliflower. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the garlic is ready, add the cauliflower to skillet and turn heat to medium. Cook, stirring occasionally. When pasta is just about done — it should be 2 or 3 minutes short of the way you like it — drain it, reserving about a cup of cooking liquid. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta to skillet containing the cauliflower, and toss with a large spoon until they are well combined. Add salt and pepper to taste, along with just enough pasta water to keep the mixture moist but not soupy. When the mixture is hot and the pasta is tender and nicely glazed, mix in the bread crumbs."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pasta With Cauliflower", "description": "Mark Bittman reaches back into the Minimalist vault to share one of his favorite recipes.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/08/dining/califlowervid/califlowervid-mediumThreeByTwo440.jpg", "uploadDate": "2011-09-30T19:10:05.000Z", "duration": "PT3M54S"}}