{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pizza With Grilled Eggplant and Cherry Tomatoes", "description": "The grilled eggplant slices are equally good on their own, or use them instead of crusts for “eggplant pizzas” (see variation below). The slices have to be thick, so that you get a creamy interior with a charred exterior. If they’re too thin, they’ll just burn.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/02/science/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "3 10-inch pizzas", "recipeCuisine": "", "recipeCategory": "pizza and calzones", "keywords": "cherry tomatoes, eggplant, pizza crust, halal, healthy, high fiber, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["1 large or 2 long Asian eggplants, cut into rounds 3/4¾ -inch thick rounds", "Vinaigrette dressing", "Extra virgin olive oil (about 3 tablespoons)", "Salt", "3 10-inch pizza crusts <a href=\"http://cooking.nytimes.com/recipes/1014838-pizza-on-the-grill \">(1 recipe)</a>", "3/4¾ cup marinara sauce", "1 box cherry tomatoes, cut in half along the equator", "Hot red pepper flakes", "1 tablespoon fresh thyme leaves or dried oregano", "3 ounces crumbled feta, 2 ounces freshly grated Parmesan, or 5 ounces mozzarella, shredded if fresh, sliced if low-moisture", "1 bunch fresh basil, torn into pieces or cut into wide strips if the leaves are big"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a hot grill. If you wish, marinate the eggplant slices in a vinaigrette dressing for 15 minutes before grilling (this is an optional step). Oil the hot grill rack with olive oil, either by brushing with a grill brush or by dipping a folded wad of paper towels in olive oil and using tongs to rub the rack with it. Brush the eggplant slices lightly with olive oil and season with salt. Place on the hot grill, not quite directly over the hottest heat, and grill for about 5 minutes, until charred. Turn the pieces over and grill for another 5 minutes. If they are getting too black too quickly, move away from the direct heat. They need to cook long enough so that they’re charred on the outside and creamy and soft in the middle. Remove from the heat and cut into bite-size wedges. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a round of dough on a lightly dusted baker’s peel or rimless baking sheet. Slide the pizza dough from the peel or baking sheet onto the grill rack. If the dough has just come from the freezer and is easy to handle, you can just place it on the rack without bothering with the peel. Close the lid of the grill – the vents should be closed —-- and set the timer for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift up the grill lid. The surface of the dough should display some big air bubbles. Using tongs, lift the dough to see if it is evenly browning on the bottom. Rotate the dough to assure even browning. Keep it on the grill, moving it around as necessary, until it is nicely browned, with grill marks. Watch closely so that it doesn’t burn. When it is nicely browned on the bottom (it may be blackened in spots), use tongs or a spatula to slide the dough onto the baking sheet or peel, and remove from the grill.  Cover the grill again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make sure that there is still some flour on the peel or baking sheet and flip the dough over so that the uncooked side is now on the bottom. Brush the top lightly with oil, then top with a thin layer of marinara sauce (no more than 1/4¼  cup). Arrange eggplant pieces and cherry tomatoes, cut side up or down, on top of the marinara sauce. Sprinkle with hot red pepper flakes and thyme or oregano. Season with salt and pepper if desired. Dot with feta or mozzarella or sprinkle with Parmesan. Drizzle on a little more olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide the pizza back onto the grill. If using a gas grill, reduce the heat to medium-high. Close the lid and cook for 2 to 3 more minutes, until the bottom is brown. Open the grill and check the pizza; the top should be hot. If you feel that it needs more time but the bottom is getting too dark, move the pizza to a cooler part of the grill and close the top. Use a spatula or tongs to remove the pizza to a cutting board. Cut into wedges and serve. Repeat with the other two crusts."}]}