{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Bean and Fava Bean Salad With Walnuts", "description": "Skinning the fava beans for this summer salad does require a little effort, but you're left with a bright green, healthy salad. Walnuts, toast them or don't, add crunch and the dressing adds zing.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/09/science/09RECIPEHEALTH_SPAN/09recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, weekday, salads and dressings", "keywords": "dairy-free, gluten-free, healthy, high fiber, kosher, low cholesterol, low-sodium, vegan, vegetarian, fava beans, green beans, walnut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 256, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "10 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "507 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds green beans, ends trimmed", "1 1/4 pounds fava beans, shelled", "1 tablespoon chopped tarragon", "1/2 cup walnuts, lightly toasted if desired, coarsely chopped", "1 small shallot, minced, rinsed with cold water and drained on a paper towel", "1 tablespoon red wine vinegar or sherry vinegar", "1 tablespoon fresh lemon juice", "Salt and freshly ground pepper", "1 teaspoon Dijon mustard", "1 small garlic clove, minced or puréed (optional)", "1/4 cup extra virgin olive oil", "2 tablespoons walnut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a boil, add salt to taste and add the green beans. Boil 4 to 5 minutes, until just tender. Transfer (use a skimmer so that you don’t have to drain the pot) to a bowl of cold water, then drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skin the favas. Bring the water in the pot back to a boil. Fill a bowl with ice water. Drop the shelled fava beans into the boiling water and boil 2 to 3 minutes (5 minutes if the beans are bigger than your thumbnail). Drain and transfer immediately to the cold water. Allow the beans to cool for several minutes, then slip off their skins by pinching off the eye of the skin and squeezing gently. Hold several beans in one hand and use your other thumb and forefinger to pinch off the eyes; have a bowl for the shelled favas close at hand and this will not take a very long time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir together the vinegar, lemon juice, salt, pepper, mustard, and garlic. Whisk in the oils. Toss with the green beans and favas, walnuts, tarragon and shallot in a salad bowl, and serve."}]}