{"@context": "http://schema.org", "@type": "Recipe", "name": "Garbanzos and Greens with Chorizo", "description": "", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/01/30/dining/30KITCH_SPAN/30KITCH-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "chickpea, chorizo, kale, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 140}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 227, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "382 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup dried chickpeas (garbanzo beans)", "1/2 onion, stuck with a clove", "1 small carrot, peeled, cut in 2-inch chunks", "1 small bay leaf", "Salt", "2 tablespoons olive oil", "1 large onion, finely diced (about 1 cup)", "Salt and pepper", "6 ounces Spanish chorizo, diced", "2 teaspoons minced garlic", "1/4 teaspoon pimentón", "1 teaspoon cumin seeds, lightly toasted and coarsely ground", "1 pound kale or chard, washed and cut in wide ribbons", "1/4 cup pine nuts, lightly toasted, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over chickpeas, put them in a large bowl and cover with cold water. Soak for at least 8 hours, preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain chickpeas (they should have swelled considerably) and put them in a soup pot. Cover with 6 cups water, add the onion stuck with clove, the carrot and the bay leaf. Bring to a boil over high heat, then lower heat and let chickpeas simmer gently. Skim any foam that rises to the surface. Cook for 1 to 1 1/2 hours until chickpeas are tender. (If chickpeas seem to be drying out during cooking, add 1/2 cup water to keep them submerged in liquid.) Season generously with salt, and leave chickpeas to cool in the broth (cooking liquid). You should have about 2 1/2 cups cooked chickpeas. (They may be cooked a day in advance, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a deep, wide skillet over medium-high heat. Add the diced onion, season with salt and pepper, and cook, stirring occasionally, until softened and lightly browned, about 5 minutes. Add the chorizo and let it fry a bit, then turn heat to medium. Add the garlic, pimentón and 1/2 teaspoon of the cumin, and stir to coat. Add the cooked chickpeas and 1/2 cup broth. Bring to a simmer, add the greens and sprinkle with a little salt. Stir to allow the greens to wilt. Put on the lid and cook for 4 to 5 minutes, until greens are completely cooked. Stir well, taste and adjust seasoning if necessary. To serve as a tapa or side dish, transfer to a cazuela or deep serving platter. Sprinkle with the remaining 1/2 teaspoon cumin and the pine nuts, if using. Alternatively, to serve as soup, spoon the garbanzo-and-greens mixture into 4 deep soup bowls. Ladle 1 cup heated broth into each bowl, and sprinkle soup with the remaining cumin."}]}