{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta", "description": "For those who have sworn off mashed potatoes because of the carbohydrates and fats, and for those who cannot eat wheat and so have said good-bye to pasta, polenta may be just the thing. Polenta is a delicious gruel, an elegant mush made by cooking cornmeal (or occasionally semolina or buckwheat) in salted water. From humble origins, polenta now appears on the fanciest restaurant menus, usually served as an accompaniment to meat and fish. But it can be a main event. It can be served hot and runny from the pot, or else sliced, grilled, pan-seared or gratinéed. And polenta can be topped with any number of sauces or vegetable ragouts. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/06/08/health/08recipehealth_600/08recipehealth_600-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "healthy, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1040 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup polenta", "1 quart water", "1 teaspoon salt", "1 tablespoon unsalted butter", "3/4 cup polenta", "3/4 teaspoon salt", "3 cups water", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Combine the polenta, water and salt in a 2-quart baking dish. Stir together, and place in the oven. Bake 50 minutes. Remove from the oven, and stir in the butter. Use a fork or a spatula to stir the polenta well, and return to the oven for 10 minutes. Remove from the oven, and stir again. Carefully taste a little bit of the polenta; if the grains are not completely soft, return to the oven for 10 minutes. Serve right away for soft polenta, or let sit five minutes for a stiffer polenta. Spoon onto a plate. Make a depression in the middle, and serve with the topping of your choice or plain, as a side dish. Alternatively, for grilling or use in another recipe, allow to chill and stiffen in the baking dish, or scrape into a lightly oiled or buttered bread pan and chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the polenta, salt and water in a 2 1/2- to 3-quart microwave-safe bowl, and stir together. Cover the bowl with a plate, and place in the microwave. Microwave on high for eight minutes. Remove from the microwave carefully, wearing oven mitts, as the bowl will be quite hot. Carefully remove the plate from the top, and allow the steam to escape. Stir in the butter, and mix well with a fork. Cover the bowl again with the plate and return to the microwave. Microwave on high for three minutes. Again, remove from the microwave carefully, wearing oven mitts. Carefully remove the plate from the top, and allow the steam to escape. Stir the polenta, and return to the microwave for three more minutes. Carefully remove from the microwave. Stir and serve, or pour into a lightly buttered bread pan and allow to cool, then slice and grill or sear in a lightly oiled pan."}]}