{"@context": "http://schema.org", "@type": "Recipe", "name": "Sri Lankan Breakfast Buns With Seeni Sambol Onion Confit", "description": "", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2013/07/17/dining/17CINNAMON5/17CINNAMON5-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "16 buns", "recipeCuisine": "", "recipeCategory": "breakfast", "keywords": "all-purpose flour, cinnamon, red onion, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 217, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "196 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4-ounce package (2 teaspoons) dry yeast", "1 large egg, lightly beaten", "1/4 cup milk", "600 grams (4 cups) all-purpose flour, or as needed", "2 teaspoons salt", "2 tablespoons sugar ", "4 tablespoons unsalted butter, room temperature, cut into small cubes", "Nonstick spray or vegetable oil, for greasing", "2 tablespoons vegetable oil", "2 to 4 fresh curry leaves (can be found in specialty stores or on line) ", "1 pound red onions, peeled and cut into slivers", "1 teaspoon crushed red pepper for spicy filling, 1/2 teaspoon for mild to medium", "1 teaspoon salt", "1 tablespoon sugar", "1 teaspoon tamarind paste", "1 teaspoon minced fresh ginger", "1 teaspoon of ground Sri Lankan (preferred) or other cinnamon", "1 large egg yolk beaten with 1 tablespoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Using an electric mixer fitted with a dough hook (or working by hand), combine 1 cup water and the yeast. Mix together. Add the egg, milk, 4 cups flour, salt, sugar and butter. Knead until smooth. Turn into a greased bowl, cover with greased plastic wrap and let rise until doubled in size, about 2 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 16 balls and let rise for 30 minutes.\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the confit: In a large skillet over medium-high heat, heat the oil, then add the curry leaves and onions. Saut&eacute; until the onions begin to soften, about 5 minutes, then add red pepper, salt, sugar, tamarind, ginger and cinnamon. (Cinnamon from Sri Lanka, formerly known as Ceylon, can be found at Whole Foods, in specialty stores or online; look for brands labeled Sri Lankan or Ceylonese.) Continue to saut&eacute; until the onions are very soft, about 10 minutes. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside a baking sheet lined with parchment paper or a nonstick liner. Punch down each ball of dough and press with your fingers to form a circle about 5 inches in diameter. Put a tablespoon of onion filling in one quadrant of the circle, then fold the dough over like a half moon to cover the filling. Lift the portion of the half-moon that has no filling, and fold over once again; the result should resemble one-quarter of a pie. Pinch only the rounded edges of the dough together, tuck them under, and place the bun on the baking sheet. Repeat, placing the buns several inches apart. Brush the tops with the egg yolk mixture, and set aside to rest for about 20 minutes while the oven heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Bake the buns until lightly golden on top and bottom, 12 to 15 minutes; be careful not to overbake or the dough will be dry. Serve warm or at room temperature, for breakfast or a snack."}]}