{"@context": "http://schema.org", "@type": "Recipe", "name": "Soba and Herb Salad With Roasted Eggplant and Pluots", "description": "This dish is inspired by a Yotam Ottolenghi soba salad that pairs eggplant and soba with mango. Instead of mango, this recipe calls for plums or Pluots, the trademark for a cross between plums and apricots. This recipe offers a contrast of the savory/spicy and fruity/sweet.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/10/science/12recipehealth/12recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "easy, salads and dressings", "keywords": "dairy-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 382, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "7 grams", "proteinContent": "13 grams", "saturatedFatContent": "2 grams", "sodiumContent": "784 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["2 long eggplants, about 1 pound, cut in 3/4-inch dice\n", "Salt to taste\n", "1/3 cup sunflower oil\n", "9 ounces (1 package) soba noodles\n", "1 tablespoon dark sesame oil\n", "6 ounces firm tofu, cut in 1/2-inch dice and blotted dry\n", "1 tablespoon soy sauce\n", "1 to 2 serrano or Thai chiles, minced (to taste)\n", "2 firm but ripe plums or pluots, cut in thin slices\n", "1 cup basil leaves (preferably Thai basil), chopped, torn or cut in slivers\n", "1 cup chopped cilantro\n", "2 to 4 tablespoons chopped chives\n", "1/3 cup seasoned rice vinegar\n", "Juice and grated zest of 1 lime\n", "1 large garlic clove, minced or pureed\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Cover a sheet pan with foil. Place the eggplant in a large bowl and season with salt to taste. Add 2 tablespoons of the oil and toss well. Spread on the baking sheet in an even layer. Place in the oven and roast for 20 minutes, or until the eggplant is soft when you pierce it with a fork and beginning to brown on the edges. It will look dry on the outside surfaces. Remove from the oven and very carefully fold over the foil and crimp the edges so that the eggplant is now contained within a foil envelope, where it will steam and become softer. Set aside until the eggplant cools."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the soba noodles. When they’re done, drain, rinse with cold water, shake well in the colander and transfer to a bowl. Add the sesame oil and stir together. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok or a large heavy frying pan over high heat until a drop of water evaporates within a few seconds when added to the pan. Add 1 tablespoon of the sunflower oil and the tofu. Let sit in the pan to sear for 30 seconds, then stir-fry until lightly browned. Add 1 teaspoon of the soy sauce, toss together, then remove from the heat and add to the noodles. Add the roasted eggplant and the minced chiles, the plums or pluots and all of the chopped herbs if serving right away, half of them if serving later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup mix together the seasoned wine vinegar, the remaining soy sauce, salt to taste, the lime juice and zest, and the garlic. Whisk in the remaining oil. Taste and adjust seasoning. Toss with the noodle salad and serve.\n"}]}