{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear Vanilla Sorbet", "description": "Pear sorbet has always been a favorite of mine. Wait until your pears are nice and ripe, for maximum flavor. I keep my pears in a brown paper bag with an apple to speed this process along. The pear and vanilla combo is heavenly.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/12/science/13recipehealth/13recipehealth-articleLarge-v2.jpg", "totalTime": "PT4H30M", "recipeYield": "Makes about 5 cups, serving 6 to 8", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegetarian, dessert, honey, pear, vanilla bean, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 185, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "4 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "6 milligrams", "sugarContent": "41 grams", "transFatContent": null}, "recipeIngredient": ["125 grams (1/2 cup) water", "1 vanilla bean or 1 teaspoon vanilla", "160 grams (approximately 3/4 cup) sugar", "1,125 grams (4 large) ripe pears, peeled, quartered and cored", "30 grams (approximately 1 tablespoon plus 1 teaspoon) clover honey", "40 grams (approximately 2 tablespoons) corn syrup or agave nectar", "2 teaspoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the water in a medium saucepan. Cut the vanilla bean in half lengthwise and, using the tip of a paring knife, scrape the seeds into the water. Add the pods and the sugar. Bring to a simmer and simmer until the sugar dissolves.  Add the pears and simmer 10 minutes, or until soft when pierced with a knife and translucent on the surfaces. Remove from the heat and stir in the honey, corn syrup or agave nectar, and lemon juice. Allow to cool.  Remove the vanilla bean pods from the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the pears with the syrup in a blender until smooth. Chill for 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill a container in the freezer. Using an immersion blender, blend the pear mixture for 30 seconds. Freeze in an ice cream maker following the manufacturer’s directions. Transfer to the container and freeze for at least two hours to pack."}]}