{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Pear Pies", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/Pear/Pear-articleLarge.jpg", "totalTime": "PT5H30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 673, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "12 grams", "sodiumContent": "186 milligrams", "sugarContent": "34 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup all-purpose flour, plus more for flouring surface", "1/2 cup cake or pastry flour", "1/4 cup confectioners’ sugar", "1/4 teaspoon salt", "4 tablespoons butter, at room temperature", "1 large egg, beaten", "1 tablespoon butter", "1/4 cup packed light-brown sugar", "1/4 teaspoon ground cinnamon", "1/2 vanilla bean, split lengthwise and seeds scraped out with a knife", "1 tablespoon honey", "1/2 teaspoon grated lemon zest", "2 slightly unripe Bartlett pears about 1 pound, peeled, quartered, cored and cut into 1/2-inch chunks", "1 egg", "3 cups vegetable oil", "Ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Pulse the flours, sugar and salt in a food processor to combine. Add the butter and pulse again until the flour looks like cornmeal, then pulse in the egg until the mixture clumps together. Knead the dough a few times, press it into a disc and wrap loosely in plastic. Refrigerate for at least 30 minutes before rolling out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a medium skillet over medium-high heat, melt the butter with the sugar, cinnamon, vanilla seeds, honey and lemon zest. Stir constantly for 5 minutes. Add the pears and cook, stirring from time to time, until they start to soften, about 5 minutes. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg with 1 tablespoon water. Line a baking sheet small enough to fit in your freezer with parchment or wax paper. On a floured surface, roll out the dough to 1/8 inch thick and cut into circles with a 4-inch cutter. Gather the unused dough into a ball and repeat until you have used all the dough. You should have 8 to 10 circles. Place on the baking sheet and refrigerate for about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, make the pies: brush the outer 1/2 inch of a pastry circle with the egg wash, then spoon a heaping tablespoon of pears onto the circle, off center. Top the pears with as much of the liquid from the pan as will fit without spilling out, about 1/4 teaspoon. Lift the edge opposite the pears with a spatula and fold the pastry to cover the pears, making a half-moon shape. Crimp the edges with the tines of a fork to seal the pie. Transfer to the lined baking sheet. Repeat with the remaining pastry circles. (If the dough starts to tear, chill it.) Freeze for at least 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving the pies, in a large, heavy skillet set over high heat, add enough oil to rise 1/2 inch up the pan and heat until it reaches 350 degrees or a pinch of dough immediately bubbles and starts to brown. Fry 3 or 4 pies at a time, turning them once, until both sides are golden, 4 to 5 minutes. If they start to turn dark brown, lower the heat a little. Remove with a slotted spoon and drain on brown paper bags. Repeat with the remaining pies. Serve warm, with ice cream."}]}