{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Leeks With Romesco Sauce", "description": "In Catalonia there is an annual ritual called the calçotada, an outdoor barbecue that revolves around local spring onions called calçots. After harvest, the onions, which look like baby leeks, are grilled, then wrapped in newspapers to steam for a bit. They’re served with romesco sauce, the nut-thickened pepper purée that is another regional specialty. For this picnic recipe, I’ve substituted leeks for the spring onions and reversed the process, steaming the leeks at home, then finishing them on a wood fire to get the smoky flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/grilled-leeks-romesco-sauce/grilled-leeks-romesco-sauce-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "spanish", "recipeCategory": "", "keywords": "appetizer, healthy, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 219, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "250 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium red pepper, roasted, peeled, seeds and membranes removed", "6 ounces tomatoes (1 large or 2 roma)", "1 thick slice (about 1 ounce) baguette or country-style bread, lightly toasted", "1 large garlic clove, peeled", "1/4 cup toasted almonds, or a combination of almonds and skinned roasted hazelnuts", "1/2 to 1 teaspoon pure ground chili powder or red pepper flakes, to taste pepper flakes are hotter", "2 teaspoons chopped fresh Italian parsley", "1/2 teaspoon sweet paprika or Spanish smoked paprika (pimentón)", "Salt", "freshly ground pepper to taste", "1 tablespoon sherry vinegar", "1/4 cup extra virgin olive oil, as needed", "6 fat leeks, or 12 baby leeks", "2 tablespoons extra virgin olive oil", "Salt", "freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the romesco sauce. Preheat the broiler, and cover a baking sheet with foil. Place the tomatoes on the baking sheet, and place under the broiler at the highest setting. Broil for two to four minutes until charred on one side. Turn over, and broil on the other side for two to four minutes until charred. Remove from the heat, transfer to a bowl and allow to cool. Peel and core."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with the steel blade, and drop in the garlic cloves. When the garlic is chopped and adheres to the sides of the bowl, stop the machine and scrape down the sides. Add the toasted almonds (or almonds and hazelnuts), bread and chili powder or flakes to the bowl. Process into a paste. Scrape down the sides of the bowl, and add the pepper, tomatoes, parsley, paprika, salt and pepper. Process until smooth. With the machine running, add the vinegar and olive oil in a slow stream. Process until well mixed, then scrape into a bowl. Taste and adjust seasoning, adding salt as desired. If possible, allow the sauce to stand for an hour at room temperature before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away the dark green ends of the leeks. Trim the root end. Cut fat leeks lengthwise into quarters, and rinse thoroughly under cold water to wash away any sand. If your leeks are 1/2 inch in diameter they needn’t be cut; if they are between 1/2 inch and an inch, you can just cut them in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring an inch of water to a boil in the bottom of a steamer. Place the leeks in the steamer, and steam 10 minutes. Transfer to a bowl, and toss with the olive oil and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a medium-hot grill. Grill the steamed leeks for five minutes, turning often, just until grill marks appear. Remove from the heat, and serve with romesco sauce."}]}