{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Lentil and Sweet Potato Stew With Chipotles", "description": "The sweetness of the sweet potatoes infuses this Mexican-inspired lentil dish along with the heat of the chipotles, which also have a certain sweetness as well because of the adobo sauce they’re they are packed in. The combination, with the savory lentils, is a winner.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/26/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "mexican", "recipeCategory": "dinner, one pot", "keywords": "chipotle chilies, green lentils, sweet potato, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegan, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 832}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "5 grams", "proteinContent": "10 grams", "saturatedFatContent": "0 grams", "sodiumContent": "614 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "2 garlic cloves, minced", "Salt to taste", "2 teaspoons cumin seeds, lightly toasted and ground", "2 medium carrots, diced", "1 1/2 cups brown or green lentils, rinsed", "6 cups water", "2 medium-size sweet potatoes (aka yams, with dark orange flesh, 1 to 1 1/4 pounds), peeled and cut in large dice", "1 to 2 chipotles in adobo, seeded and chopped (to taste)", "2 tablespoons tomato paste", "1 bay leaf", "1/4 cup chopped fresh cilantro or parsley (to taste)", "Lime wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or Dutch oven and add the onion. Cook, stirring often, until it softens, about 5 minutes, and add the garlic and a generous pinch of salt. Cook, stirring, until the garlic smells fragrant, about 30 seconds, and add the ground cumin seeds and carrots. Stir together for a minute, then add the lentils, water, sweet potatoes, chipotles, tomato paste, salt to taste and the bay leaf. Bring to a boil, reduce the heat, cover and simmer 40 to 45 minutes, until the lentils and sweet potatoes are tender and the broth fragrant. Taste and adjust seasoning. Stir in the cilantro or parsley, simmer for another minute, and serve, passing lime wedges so diners can season their lentils with a squeeze of lime juice if desired."}]}