{"@context": "http://schema.org", "@type": "Recipe", "name": "Tamales", "description": "A couple of things to consider when making tamales, a staple at Christmas time in Mexican households and for special occasions. First, think of assembling tamales like making crepes: The first one or two never work, but they help you become comfortable with the process. Second, don’t be tempted to overfill the tamales; a couple of good tablespoons of filling will do it. If you use too much it will make it harder to seal neatly and the filling will likely seep out the top of the husk during cooking. ", "author": {"@type": "Person", "name": "Suzanne Lenzer"}, "image": "https://static01.nyt.com/images/2014/03/19/dining/tamales/tamales-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "About 24 tamales and sauce", "recipeCuisine": "mexican", "recipeCategory": "dinner, project, sauces and gravies", "keywords": "chili, masa, pork shoulder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 281, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "6 grams", "sodiumContent": "305 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds pork shoulder", "1/2 onion, roughly chopped", "3 garlic cloves, smashed", "2 bay leaves", "1 teaspoon cumin seed, crushed", "3 tablespoons kosher salt", "6 to 8 dried New Mexico or California chiles", "2 Roma tomatoes", "1 teaspoon cumin seed, crushed", "1 teaspoon kosher salt", "1/4 cup dry masa (flour for tamales)", "1 bag dried corn husks, about 24", "1 cup lard ", "4 cups dry masa ", "1 tablespoon baking powder", "2 teaspoons kosher salt", "3 1/2 to 4 cups warm chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Braise the meat. Place the pork in a pot with the onion, garlic, bay leaves, cumin, salt and enough water to cover 2/3 of the meat; bring to a boil and reduce to a simmer. Cook for about 2 hours or until the meat is fork tender and easy to shred. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce. Heat the oven to 350 degrees. Stem the chiles and seed if desired (seeds will make the sauce spicier). Place on a baking sheet and roast until lightly toasted, about 5 minutes.\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the toasted chiles to a medium saucepan along with the tomatoes, cumin and salt. Cover with about 3 cups of water and bring to a boil. Reduce to a simmer and cook for about 30 minutes or until the ingredients are soft and fragrant. Cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cooled sauce to a food processor and purée. Add the masa and continue to blend until thick. Taste and adjust the seasonings as desired. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the meat is cool, shred and combine with enough sauce to moisten well. Taste and reseason as needed. Transfer any extra sauce to an airtight container to serve alongside the tamales or to freeze to use later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the corn husks in hot water for 30 minutes to an hour or until malleable. Remove the husks and pat dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough, using a standing or hand mixer, cream the lard in a large bowl until light and fluffy. Add the masa, baking powder and salt, and mix until combined; the mixture will be dry and resemble peas. Begin adding the warm stock about a cup at a time and continue to mix until the dough becomes light and spongy. You may not need the full 4 cups of stock. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a steamer in a large deep pot with a lid and fill with 2 inches of water; bring to a boil and reduce to a low simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hold a husk in one hand with the wide end facing you. (If this is awkward you can also lay the husk flat on a clean work surface.) Using a spatula, spread the masa mixture in an even layer, no more than 1/4-inch thick, all over the lower 2/3 of a husk leaving the pointed end clean. Be sure to spread the masa all the way to the right side of the husk, but leave at least 1/2 inch clean on the left side so the batter doesn’t overlap when the husks are sealed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 2 to 3 tablespoons of the meat and sauce mixture into the center of the masa and fold the husk over to enclose. Fold the top of the husk down like an envelope and place in the prepared steamer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam for 1 to 1 1/2 hours or until the masa is light and fluffy and releases easily from the husk."}]}