{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Chops Puttanesca", "description": "The muscular sear and smoky, crisp burnish of grilled food has immense appeal. But achieving it requires time and attention to hot coals. The grill master may scoff, but I have increasingly come to rely on my oven, sealing the deal with a slow bake after a quick sizzle atop the grill or stove. That’s how I made these pork chops, with their lusty Neapolitan topping to accompany a sturdy aglianico. The slow cooking gently brings the meat to tenderness, guarding its juices. It also grants the cook nearly an hour to assemble the rest of the dinner, and what does the grill master know about that? (You might consider moving the meat away from the fire and covering the grill, but the temperature will not be as consistent and will require monitoring.) Penne or other modest macaroni dressed with just olive oil and chile flakes is excellent alongside, to share the sauce with the meat.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/06/27/dining/27COOKING-PORK-CHOPS2/27COOKING-PORK_CHOPS2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, steaks and chops", "keywords": "main course, pork chops", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 92}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 709, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "2 grams", "proteinContent": "73 grams", "saturatedFatContent": "11 grams", "sodiumContent": "516 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cloves garlic, divided", "1/2 teaspoon dried oregano", "1/2 teaspoon crushed red chile flakes", "1/4 teaspoon salt", "2 tablespoons extra-virgin olive oil", "1 tablespoon red wine vinegar", "4 12-ounce rib pork chops, preferably heritage, about 1 1/4-inch thick", "1 small red onion, finely chopped", "8 ounces ripe tomatoes, finely chopped", "4 anchovy fillets in oil, drained and mashed", "2 tablespoons pitted oil-cured black olives, chopped", "1/2 tablespoon capers in vinegar, drained", "1 1/2 tablespoons golden raisins", "1/2 cup dry red wine", "1 teaspoon fresh oregano leaves, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash 1 clove garlic with dried oregano, 1/4 teaspoon chile flakes and salt to a paste in a mortar. Stir in 1 tablespoon olive oil and the vinegar. Spread this mixture on both sides of the pork. Set aside. Heat grill. Heat oven to 225 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining oil in a small skillet, add onion and sauté until translucent. Mince remaining garlic and stir in. Add tomatoes, anchovies, remaining chile flakes, olives, capers and raisins. Stir in wine and cook on low until mixture is thick, about 10 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill pork close to source of heat, turning once, until nicely browned but not cooked through, about 2 minutes per side. (You can also cook the chops in a grill pan or skillet over high heat for about 2 minutes per side). Transfer pork to a baking dish, slather with tomato mixture and place in oven for 45 minutes for medium, longer for more well done. Arrange pork on a serving platter, spoon any pan juices over it, scatter with oregano and serve."}]}