{"@context": "http://schema.org", "@type": "Recipe", "name": "Glazed Lamb Ribs", "description": "This is a recipe loosely based on one for a snack that used to be served at DBGB, Daniel Boulud’s giddy sausage-and-beer restaurant on the Bowery in Manhattan: crunchy little nuggets of small-boned lamb breast served with a pale yogurt sauce with a mild pepper kick under a zing of lemon zest. You can divide the cooking in two if you like, roasting the meat on one day, then finishing it on a grill or under a broiler a day or so later. And you can bail on the sprinkle if it's too much work. But not the glaze and not the yogurt! (Here's <a href=\"https://cooking.nytimes.com/recipes/1013642-minted-yogurt-sauce\">the recipe</a>.)", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/Glazed-Lamb-Ribs/Glazed-Lamb-Ribs-articleLarge.jpg", "totalTime": "PT3H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, sauces and gravies", "keywords": "summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 582, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "81 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "13 grams", "sodiumContent": "582 milligrams", "sugarContent": "70 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 racks lamb ribs", "2 tablespoons Kosher salt", "6 cloves garlic, peeled and finely diced", "6 sprigs thyme", "3 sprigs rosemary", "2 bay leaves", "1 cup sherry vinegar", "1 cup honey", "1 tablespoon fennel seeds, cracked", "1 tablespoon coriander seeds, cracked", "1 tablespoon ground freshly ground black pepper", "1 tablespoon ground Aleppo chili", "2 tablespoons unsalted butter, cold", "2 tablespoons coriander seeds, toasted and cracked, or 1 tablespoon ground coriander", "2 teaspoons Aleppo chili", "2 teaspoons Kosher salt, or to taste", "Zest of 1 lemon", "1 tablespoon parsley, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 275. Trim most of fat from the surface of the lamb racks and place them in a large roasting pan. Combine salt, garlic and herbs and rub over lamb. Place in oven and roast for 2 hours. Remove pan from oven and turn ribs, then return to oven for 30 to 60 minutes longer, or until the lamb is just tender and starting to pull away from the bone. Remove pan from oven and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the glaze. Combine vinegar and honey in a small sauce pan placed over moderate heat. Add fennel, coriander, black pepper and Aleppo chili and bring to a slight simmer. Lower heat and allow the mixture to reduce by half. Remove from heat and whisk in the cold butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a fire in grill or preheat broiler in oven. Combine coriander, chili, salt, lemon and parsley in a small bowl and set aside. Slice ribs into individual pieces, cutting between each bone. When coals are covered with gray ash and fire is hot, put chops on grill directly over coals or on a pan in the broiler. Using a pastry brush, coat lamb lightly with glaze and continue to cook, turning occasionally, until the meat begins to turn golden and crisp, approximately 5 to 7 minutes. Remove to a platter and sprinkle with the topping."}]}