{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Tagine With Green Olives", "description": "If you can get your hands on ras el hanout, you can use it instead of making the spice mixture. And no worries if you don’t have a tagine — a covered Dutch oven will work just fine.   ", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT2H50M", "recipeYield": "Serves 4", "recipeCuisine": "moroccan", "recipeCategory": "dinner", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 59}, "recipeIngredient": ["3/4 teaspoon ground coriander", "1/2 teaspoon ground cumin", "1/8 teaspoon cinnamon", "1/2 teaspoon paprika", "Generous pinch cayenne", "Pinch saffron", "1/4 cup extra-virgin olive oil", "2 pounds lamb stew meat, cut into chunks", "1/2 teaspoon salt", "1/4 teaspoon pepper", "1 medium onion, sliced into medium-width pieces about 1 cup", "1 clove garlic, peeled", "1 tablespoon diced, fresh ginger (from about 1 inch)", "Juice of 1 orange", "1 14-ounce can diced or chopped tomatoes", "1 2-inch-long piece of orange peel", "2 cups chicken broth", "1 teaspoon honey", "1 medium carrot, sliced ½-inch thick about 1 cup", "1 celery rib, sliced ½-inch thick about 1 cup", "1/4 cup sliced almonds", "1 1/2 tablespoons sesame seeds", "8 green olives, sliced into quarters about 1/4 cup", "1 1/2 cups basmati rice, rinsed 3 times", "1 bay leaf, preferably fresh", "Grated zest of 1 lemon", "Pinch of salt", "1/4 teaspoon red-pepper flakes", "1 tablespoon unsalted butter", "Juice of 1 lemon", "1 orange, sectioned and chopped about ¼ cup", "2 scallions, sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the spice mixture", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the spice mixture by stirring together the spices in a small bowl. Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, ovenproof stew pot or tagine, heat the oil over medium-high heat. Season the lamb all over with salt and pepper. Add the meat to the pot and stir to coat in the oil. Brown for about 5 minutes, stirring occasionally to make sure the meat browns evenly on all sides. Transfer the meat to a bowl and set it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat to medium and add the onion, stirring to coat. Sauté for about a minute, until it begins to soften. Add the garlic and ginger and add the meat back to the pot. Stir everything together. Squeeze the orange juice into the pot and mix well. Add the tomatoes, orange peel, spice mixture, chicken broth and honey. Mix well. Raise the heat to medium-high and bring the mixture to a simmer, then cover the pot and put it in the oven. Cook for 1 hour or until the meat is about half-cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the carrots and celery and return the pot to the oven. Cook for another 30 to 45 minutes, until the sauce is thick and reduced and the lamb is tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the tagine is in the oven, toast the almonds and the sesame seeds in a small pan over low heat until the nuts are golden, about 5 minutes, stirring regularly to make sure the almonds don’t burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 15 minutes before the tagine is finished, make the citrus rice: Put the rice and 2 cups of water in a large pot set over high heat. Add the bay leaf, lemon zest, salt, red-pepper flakes and butter. When the water boils, lower the heat and cover the pot with a tight-fitting lid. Continue to simmer until the liquid has been absorbed, about 12 minutes. Turn off the heat. Add the lemon juice, orange pieces and scallions and mix well. Transfer to a large bowl and serve immediately."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the tagine", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the garlic clove and orange peel from the tagine. Add the olives and spoon the tagine onto a large serving plate. Sprinkle the almonds and sesame seeds on top. Serve immediately, with citrus rice."}]}]}