{"@context": "http://schema.org", "@type": "Recipe", "name": "Buckwheat Blini With Caviar", "description": "The holidays present a number of opportunities to splurge, and New Year’s Eve is the ultimate night for it. Though it may seem a cliché, the classic combination of blini and caviar is the perfect example — indulgent, elegant and delectable to the extreme. If you are hosting a small crowd for drinks (preferably Champagne or vodka with these), it’s all you need to serve, though it also can be a sit-down first course. Preparation is simple: the blini are topped with a dab of crème fraîche, a spoonful of caviar and a drizzle of butter.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/12/26/dining/26KITCH_SPAN/26KITCH_SPAN-articleLarge-v2.jpg", "totalTime": "PT3H15M", "recipeYield": "About 60 3-inch blini, 10 to 12 servings", "recipeCuisine": "russian", "recipeCategory": "lunch", "keywords": "buckwheat flour, caviar, yeast, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 46}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 267, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "10 grams", "sodiumContent": "164 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 package dry active yeast", "1 teaspoon sugar", "3 cups slightly warm milk", "1 cup all-purpose flour", "1 cup buckwheat flour", "1/2 teaspoon salt", "2 tablespoons melted butter", "4 eggs, separated", "6 ounces crème fraîche", "1/4 pound (1 stick) melted butter, kept warm", "At least 125 grams caviar or trout roe", "2 tablespoons finely cut chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In large mixing bowl, dissolve yeast and sugar in 1 cup milk. Stir in 1/2 cup all-purpose flour and let stand until bubbly, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine remaining all-purpose flour, the buckwheat flour and salt. Add 2 cups milk to the yeast mixture  and gradually whisk in flour-salt mixture until you have a smooth, thick batter. Whisk in melted butter. Cover bowl with plastic wrap. Leave at room temperature and let batter slowly double in size, about 2 to 3 hours. (The batter may remain at room temperature even longer if necessary.) You may also mix batter and refrigerate overnight. Bring to room temperature before proceeding with recipe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to cook blini, stir down batter, which will have become quite frothy. Beat egg yolks and whisk into batter. In a separate bowl, beat egg whites until stiff. Gently fold egg whites into batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon batter onto a hot, lightly greased griddle, using a large soup spoon to make blini that are 3 inches in diameter. Cook for about 2 minutes, until bottom is well browned. Flip and cook 1 minute more. (Wait until surface is covered in bubbles before flipping.) Keep warm in a low oven. Serve with a dollop of crème fraîche, a drizzle of butter, a generous spoonful of caviar and a sprinkling of chives."}]}