{"@context": "http://schema.org", "@type": "Recipe", "name": "Buckwheat Crêpes", "description": "My favorite French street food, these are easy crêpes to make. If you keep them in the freezer, you can pull one out and top it with blanched spinach and a fried or poached egg for a quick and delicious meal. In France the crepe is made on a large, flat, hot griddle, and the egg is cracked right on top of it. That doesn’t work well in a home crêpe pan. It’s easier to have the crêpe already made and then top it with the fried egg.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/04/30/health/30recipehealth_600/30recipehealth_600-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "About 12 8-inch crêpes", "recipeCuisine": "french", "recipeCategory": "brunch", "keywords": "buckwheat flour, gruyère, spinach, halal, healthy, kosher, low-sodium, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 127}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 146, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "198 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup low-fat (2 percent) milk", "1/3 cup water", "3 large eggs", "1/2 teaspoon salt", "2/3 cup buckwheat flour", "1/2 cup unbleached white flour", "3 tablespoons canola oil", "6 ounces baby spinach", "Salt, preferably kosher salt", "freshly ground pepper to taste", "2 buckwheat crêpes, above", "2 eggs, poached or fried for four minutes", "2 tablespoons grated Gruyère cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the milk, water, eggs and salt in a blender. Cover the blender, and turn on at low speed. Add the flours, then the canola oil, and increase the speed to high. Blend for one minute. Transfer to a bowl, cover and refrigerate for one to two hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a seasoned 7- or 8-inch crêpe pan over medium heat. Brush with butter or oil, and when the pan is hot, remove from the heat and ladle in about 3 tablespoons batter. Tilt or swirl the pan to distribute the batter evenly, and return to the heat. Cook for about one minute, until you can easily loosen the edges with a spatula. Turn and cook on the other side for 30 seconds. Turn onto a plate. Continue until all of the batter is used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil, and add the spinach. Blanch for 20 seconds, and transfer to a bowl of ice water. Drain and squeeze dry. Chop and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the crêpes in a dry skillet over medium heat (or use the skillet you used to fry your eggs). Top with a spoonful of spinach, and top the spinach with the egg, setting the egg to one side so you can fold the crêpe over. Sprinkle the cheese over the top, fold the crêpe over, and transfer to a plate with a spatula. Serve hot."}]}