{"@context": "http://schema.org", "@type": "Recipe", "name": "Walnut Fougasse or Focaccia", "description": "What’s called focaccia in Italy is fougasse in Provence. Fougasse, though, is often shaped like a leaf, which is easy to do and very pretty. The nutty, toasty whole grain bread is irresistible.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/09/science/12recipehealth/12recipehealth-articleLarge-v2.jpg", "totalTime": "PT4H", "recipeYield": "12 servings", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "appetizer, dairy-free, halal, healthy, kosher, low cholesterol, low sugar, vegan, vegetarian, walnut, walnut oil, whole wheat flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 223, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "193 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 teaspoons (8 grams) active dry yeast", "1 teaspoon (5 grams) sugar", "1 1/2 cups lukewarm water", "2 tablespoons (25 grams) walnut oil", "250 grams (approximately 2 cups) whole wheat flour", "250 grams (approximately 2 cups) unbleached all-purpose flour or bread flour", "1 3/4 teaspoons (12 grams) salt", "1 cup (100 grams) walnuts, coarsely chopped", "1 tablespoon extra virgin olive oil if making focaccia (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer, or in a large bowl, dissolve the yeast and sugar in the water. Add the walnut oil, whole wheat flour, 200 grams of the all-purpose or bread flour and salt and mix together briefly using the paddle attachment. Change to the dough hook and beat for 8 to 10 minutes at medium speed, adding the remaining flour as necessary. The dough should eventually form a ball around the dough hook and slap against the sides of the bowl as the mixer turns but it will be sticky. Remove from the bowl, flour your hands and knead for a minute on a lightly floured surface, and shape into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If kneading the dough by hand, dissolve the yeast in the water with the sugar as directed. Stir in the walnut oil, whole wheat flour, salt, and all-purpose flour by the half-cup, until the dough can be scraped out onto a floured work surface. Knead, adding flour as necessary, for 10 minutes, until the dough is elastic. Shape into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry your bowl and oil lightly with olive oil. Place the dough in it, rounded side down first, then rounded side up. Cover tightly with plastic and let rise in a warm spot for 1 1/2 to 2 hours, or in the refrigerator for 4 to 8 hours, until doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough. A handful at a time, knead the walnuts into the dough, until they are evenly distributed. Divide the dough into two equal pieces for smaller breads, or make one large focaccia or fougasse (see instructions below). Cover with lightly oiled plastic and let the dough rest for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees, preferably with a baking stone in it. Line 2 baking sheets with parchment paper and oil the parchment. Roll or press out each piece of dough into an oval or rectangle measuring about 9 by 7 inches. To do this efficiently, roll the  dough, stop and wait 5 minutes for the gluten to relax, then roll again, and repeat until the dough reaches the right size. For fougasse, using a paring knife, make an incision down the center of the oval or rectangle, starting about 2 inches in from the top and ending 2 inches from the bottom. Make 3 diagonal slashes out from the center of the bread towards the edge, leaving about an inch of dough on either side of the center incision. The incisions should resemble the veins of a leaf. Leave a 2-inch border at the edge of the dough. Transfer the loaves to the baking sheets. Gently pull the bread apart at the slashes. Cover with lightly oiled plastic wrap and a towel, and let rest for 30 minutes. For focaccia, roll or press out the dough and transfer to the parchment-lined baking sheet. Cover with a damp towel and let rest for 30 minutes. Just before baking, use your fingertips to dimple the dough all over, and if desired drizzle on a tablespoon of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One at a time, bake the breads on top of the baking stone for 20 to 25 minutes, until deep golden brown. Let rest for at least 10 minutes before serving, or allow to cool completely."}]}