{"@context": "http://schema.org", "@type": "Recipe", "name": "Pâte à Choux for Cheese Puffs and Cream Puffs", "description": "Making pâte à choux is not difficult at all. It is simply a matter of bringing water and butter to a boil, then dumping in flour and stirring it until a mass forms, which takes only a minute or two. You let the steaming dough cool for a moment, then beat in a few eggs, one at a time. That’s it.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2012/12/12/dining/12KITCH1_SPAN/12KITCH1_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "About 60 bite-size puffs", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, eggs, gruyère, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 208, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "0 grams", "proteinContent": "8 grams", "saturatedFatContent": "9 grams", "sodiumContent": "135 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 stick unsalted butter (8 tablespoons, or 1/4 pound), in 1-inch chunks", "1/2 teaspoon salt", "1 cup all-purpose flour (135 grams)", "4 whole eggs, and 1 egg lightly beaten for glaze", "Pinch cayenne", "Pinch freshly grated nutmeg", "Black pepper, to taste", "4 ounces grated cheese, like Comté or Gruyère"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put butter and salt in medium saucepan with 1 cup water, and bring to a boil. Add flour, and stir with wooden spoon or sturdy whisk until mixture comes together, about 1 minute. Lower heat and cook for 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to bowl of stand mixer fitted with paddle attachment. Mix at medium speed to cool mixture slightly. Increase speed and begin to add eggs, one at a time. Make sure each egg is fully incorporated before adding the next. After fourth egg has been added, beat for a minute more, until dough is smooth and glossy. Stop machine, add cayenne, nutmeg, pepper and grated cheese, then mix briefly to combine. (If you don’t have a mixer, you can also beat the dough vigorously by hand.) Scrape down sides of bowl and remix, then put mixture in pastry bag."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line two 12-by-18-inch baking sheets with parchment. On each sheet, pipe six rows of 1 1/2-inch-round mounds of dough, five to a row, with at least 1 inch of space between them. (If you prefer, use two soup spoons to put the dough on the sheet.) Brush each mound with beaten egg, smoothing the tops with a finger if not quite round."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 10 minutes, then reduce heat to 375 degrees. Continue baking for about 25 minutes, turning baking sheets as necessary, until mounds are puffed, golden and crisp. Serve immediately or cool on a rack and reheat later."}]}