{"@context": "http://schema.org", "@type": "Recipe", "name": "Striped Bass or Mahi Mahi With Fennel, Leeks and Tomatoes", "description": "Fennel is a classic accompaniment to fish throughout the Mediterranean. Any firm white fish will work here. Porgy and sea bass are also good choices. The sauce is almost like a vegetable ragout.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/04/science/04recipehealth/04recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, nut-free, fennel, fish, leek, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 162}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 351, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "8 grams", "proteinContent": "39 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1144 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 to 2 pounds striped bass or mahi mahi fillets (or other firm fish)", "Salt and freshly ground pepper", "Juice of 1/2 lemon", "2 tablespoons extra virgin olive oil", "2 large leeks, white and light green parts only, cut in half lengthwise, cleaned and thinly sliced across the grain", "2 garlic cloves, minced, or 1 bulb green garlic, minced", "Salt to taste ", "2 medium fennel bulbs, quartered, cored and thinly sliced", "1 14-ounce can chopped tomatoes, with juice", "Freshly ground pepper", "2 tablespoons chopped fresh dill", "2 tablespoons chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the fish fillets in a baking dish or on a sheet pan and season with salt and pepper. Squeeze the lemon juice over the fish and refrigerate while you make the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large lidded sauté pan that will accommodate all of the fish in one layer (see note below), heat the olive oil over medium heat and add the leeks. Cook, stirring, until they begin to soften, about 3 minutes, and add the garlic and a large pinch of salt. Cook, stirring, until the garlic is fragrant, about 30 seconds to a minute, and add the fennel. Turn down the heat to medium-low, cover the pan and cook, stirring often, until the fennel is tender, 10 to 15 minutes. Uncover the pan, add the tomatoes, salt to taste, and the pepper and cook uncovered, stirring often, for 10 to 15 minutes, until the tomatoes have cooked down and the mixture is thick and fragrant. Stir in the dill and 1 tablespoon of the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the fish over the fennel mixture. (Note: If the pan isn’t big enough, divide the mixture between two pans.) Cover and place over medium heat. Simmer 10 minutes, or until the fish is opaque and pulls apart easily with a fork. Sprinkle on the remaining parsley and serve the sauce and fish together, with rice or potatoes."}]}