{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Mac-n-Cheese", "description": "When Kim Quay needed a name for her catering and prepared food business, in Morrisville, Pa., her mother suggested Comfort Food. Ms. Quay, whose menu is based on whatever foods the local farmers happen to be providing, thought the name was apt. She likes to take traditional foods and recreate them based on the season and the produce that is available. Adding pureed butternut squash to this dish cuts the cheese in half but adds more flavor. Ms. Quay said it’s one of her most popular fall dishes. “We sell so much of that, and you don’t have to feel as bad eating it,’’ she said. “You might not want to eat it every single day, but you’re still lowering the guilt factor.’’", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2012/11/16/health/wellveggie_comfort2/wellveggie_comfort2-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "sauces and gravies", "keywords": "fall, kosher, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 319}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 517, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "12 grams", "sodiumContent": "768 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound elbow macaroni, cooked according to package directions", "1 large butternut squash", "2 tablespoons olive oil", "6 tablespoons butter", "3/4 cup all-purpose flour", "7 cups milk", "2 cups sharp cheddar cheese, shredded", "Salt", "Pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the butternut squash. Preheat oven to 375 degrees. Cut squash in half lengthwise; remove seeds. Place in roasting pan and drizzle with olive oil. Place in oven and cook until soft all the way through, about 1 hour. Set aside until cool. When cooled, remove skin and place in food processor. Purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make cheese sauce. Melt butter in saucepan. Add flour. Stir to make a roux and cook 3 minutes, stirring the entire time. Add 3 cups milk and stir until thickened. Add the rest of the milk and bring to a boil, stirring occasionally. Add shredded cheese and stir until melted. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the dish: Place cooked elbow macaroni in bowl. Pour half of the cheese sauce over and add puréed, roasted butternut squash. Fold together. If it seems too dry, add the rest of the cheese sauce. Place in an ovenproof dish and heat for 15 minutes at 325 degrees."}]}