{"@context": "http://schema.org", "@type": "Recipe", "name": "Melted Red Peppers and Garlic", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2012/12/05/dining/05JULIA1_SPAN/05JULIA1_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Two jars", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "appetizer, bell pepper, garlic, thyme, vegan, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "recipeIngredient": ["3 1/2 to 4 pounds bell peppers, all red or a mix of red, orange and yellow", "1/4 pound hot red peppers (optional)", "1/4 cup thinly sliced garlic, cut into slivers", "1 cup extra-virgin olive oil, plus extra for jars", "4 to 6 sprigs fresh thyme, plus extra for jars", "1/2 teaspoon wine vinegar", "Salt", "Two 1-pint or 1/2-liter jars"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stem and seed the peppers and cut them into thick strips, about 3/4-inch wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet, combine the garlic and olive oil over low heat until the oil begins to bubble. A few handfuls at a time, add the peppers and turn to coat with the oil. When all the peppers are in the pan, add the thyme and vinegar and adjust the heat to a low simmer. Sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until the peppers are soft and sweet and garlic has almost dissolved, about 45 minutes, shaking the pan and stirring gently every 10 minutes. Don&rsquo;t stir too often or the peppers will begin to break down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the peppers are cooked, use tongs to lift them out of the pan and into jars. Strain the oil and divide between jars. Top off with extra olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Store in the refrigerator for up to two months. Serve on toasts, with cheese or cured meats, or add to frittatas or pasta sauce."}]}