{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa, Spinach and Poached Egg", "description": "I’m in that third situation a few nights a week, and often all I want to eat is a salad — but a salad with substance. I’m hungry at the end of the day, and dinner is the one meal of the day that I sit down to enjoy in a leisurely fashion, whether alone or in company. I’ve found that one of the most enjoyable ways to bulk up my salads (as well as panini and grain-and-vegetable combos) is to top the dish with a poached egg. Sometimes poached eggs are the centerpiece of my dinner, cooked in marinara or spicy tomato sauce and served with toasted country bread or over rice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/10/25/science/24recipehealth/24recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "1 serving", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "eggs, quinoa, spinach, gluten-free, healthy, high fiber, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 397, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "15 grams", "proteinContent": "22 grams", "saturatedFatContent": "4 grams", "sodiumContent": "937 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 allspice berry", "1 clove", "8 coriander seeds", "1/8 teaspoon freshly grated nutmeg", "1/8 teaspoon ground cinnamon", "Half of a 12-ounce bunch of fresh spinach, stemmed and washed thoroughly, or 1 bag baby spinach, rinsed", "Salt", "freshly ground pepper", "1 teaspoon extra virgin olive oil", "3/4 cup cooked quinoa", "1 or 2 eggs to taste, poached (see above)", "1/4 ounce (1 tablespoon) crumbled feta, or 1 to 2 tablespoons drained yogurt, seasoned, if desired, with puréed garlic"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind the allspice berry, clove and coriander seeds in a spice mill or a mortar and pestle. Add the nutmeg and cinnamon and mix together. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wide, heavy skillet over high heat and wilt the spinach in the water left on the leaves after rinsing. Season to taste with salt and pepper. Transfer to a colander, and press out excess water with the back of a large spoon. Chop coarsely and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a medium skillet and add the spices. As soon as they begin to sizzle, add the quinoa and stir together for a couple of minutes. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach your egg or eggs if you haven’t already done so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the quinoa in the center of a dinner plate and make a well in the middle. Pile the spinach into the well. Top with the poached egg or eggs and season with salt and pepper. Sprinkle on the feta or spoon on the garlic-spiked yogurt and enjoy."}]}