{"@context": "http://schema.org", "@type": "Recipe", "name": "Tom and Jerry", "description": "This drink has nothing to do with the cartoon cat and mouse, or Jerry Thomas, the celebrated New York barman of the 1800s, who often boasted of inventing it. It is a rich holiday elixir, a relative of eggnog that flourished in America in the 19th and early 20th centuries, and is frequently (though not definitively) credited to Pierce Egan, the English chronicler of sports and popular culture. Robert Simonson brought this version of the drink, which is especially popular in Wisconsin and is bordering states, to The Times in 2012. It is adapted from Audrey Saunders, the owner of the Manhattan cocktail bar Pegu Club. She decreased the sugar and added Angostura bitters and vanilla. “It makes a huge difference,” she said. It’s best on snowy days, when it can warm and comfort from within.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/tom-and-jerry/tom-and-jerry-articleLarge-v2.jpg", "recipeYield": "1 drink, with batter for about 10 drinks", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "cognac, milk, rum, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 48}, "recipeIngredient": ["6 eggs (yolks and whites separated)", "1 pound sugar", "1 ounce añejo rum", "3 tablespoons vanilla extract", "3/4 teaspoon ground cinnamon", "1/4 teaspoon ground allspice", "1/4 teaspoon ground nutmeg", "1/4 teaspoon ground cloves", "2 dashes Angostura bitters", "6 ounces milk", "1 ounce añejo rum", "1 ounce V.S. Cognac"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: In a bowl, beat egg yolks until they are as thin as water. While beating, gradually add sugar, rum, vanilla, spices and bitters. In a separate bowl, beat egg whites until stiff. Fold into yolk mixture. If not using immediately, refrigerate batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the drink: In a small saucepan, bring milk to boil. Meanwhile, warm a roughly 10-ounce Irish coffee mug in the oven. Pour in 2 ounces batter. Add 1 ounce rum and 1 ounce Cognac. Fill with boiling milk, stirring briskly with a small whisk while adding, so batter and milk are well mixed. Dust with nutmeg."}]}