{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Green Tomatoes With Bacon Rémoulade", "description": "Tart unripe tomatoes are the star of this dish: Tossed in a cornmeal batter, then fried in bacon fat for just a couple of minutes per side. The crisp outside yields to a soft middle, finished with a relish of pickled tomatoes and smoky-sweet bacon. Or, skip the relish, and do as our commenters suggested: Pair it with a creamy mayonnaise sauce, infused with red peppers or even sriracha.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/08/07/dining/07APPEJP3/07JPAPPE3-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "southern", "recipeCategory": "easy", "keywords": "appetizer, side dish, bacon, green tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 65}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 674, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "4 grams", "proteinContent": "20 grams", "saturatedFatContent": "8 grams", "sodiumContent": "641 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound bacon (about 6 thick slices)", "1/2 pound pickled green tomatoes, finely chopped, plus pickling liquid", "1 tablespoon minced fresh chives, plus more for serving", "1 egg yolk", "1/4 teaspoon coarse kosher salt", "1/2 cup neutral oil, like grapeseed, safflower or canola", "1/4 cup olive oil", "1 teaspoon coarse kosher salt", "1 teaspoon black pepper", "3 large unripe green tomatoes, sliced 1/4-inch thick", "1 1/2 cups all-purpose flour", "4 large eggs, beaten with a splash of water", "1 1/2 cups cornmeal", "Hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bacon rémoulade: In a large nonstick skillet over high heat, cook bacon until crisp, about 6 minutes. Transfer to a plate lined with paper towels to drain. Reserve the bacon grease in the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine pickled tomatoes and chives. Crumble in bacon. In a medium bowl, combine egg yolk, 1 tablespoon green tomato pickling liquid (or lemon juice), 1 teaspoon cold water and 1/4 teaspoon salt. While whisking constantly, slowly drizzle in neutral oil and olive oil until sauce begins to thicken into mayonnaise. Add more pickling liquid to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop 1/2 cup of the pickled-tomato-and-bacon relish and mix it into mayonnaise to make rémoulade. Save remaining relish for serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tomatoes: Sprinkle 1 teaspoon salt and 1 teaspoon pepper over green tomatoes and set aside. Put flour in a shallow bowl, the eggs in another shallow bowl, and the cornmeal in a third. Line a rimmed baking sheet with parchment paper. Add tomatoes to flour one or two at a time. Coat all over, shake off any excess and transfer to eggs. Dip both sides in eggs, shake off any excess and transfer to cornmeal. Press tomatoes into cornmeal until well coated on both sides, and then transfer to baking sheet. Repeat with remaining tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the nonstick skillet with the bacon grease over medium heat. Line a rimmed baking sheet with paper towels or a paper bag. When grease is hot but not smoking, add tomatoes to pan in batches of 3 to 4. Cook 2 to 3 minutes per side, or until golden brown. Transfer to lined baking sheet and sprinkle with salt while still hot. Repeat with remaining tomatoes. Serve fried tomatoes with rémoulade, bacon and pickled green tomato relish and hot sauce."}]}