{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet Green, Rice and Ricotta Blinis", "description": "The idea for this comes from Deborah Madison’s Chard, Ricotta and Saffron Cakes, from her amazing and wonderful new book, “Vegetable Literacy,” which explores vegetables from 12 families of the vegetable kingdom. Ms. Madison is always inspiring, and I think this is her best book to date. These are chunkier than pancakes because of all the rice, but they are more cake than fritter. Let them rise on the griddle – don’t press them down – and allow them to cook for 3 minutes on each side. I like to serve them with a dollop of tomato sauce. You can make smaller cakes to serve as hors d’oeuvres or snacks.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/04/16/science/15recipehealth/15recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "24 about 2 1/2-inch cakes, serving 6 to 8", "recipeCuisine": "russian", "recipeCategory": "dinner, weekday", "keywords": "beet greens, brown rice, ricotta, halal, healthy, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "5 grams", "sodiumContent": "329 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound beet greens, or a mix of beet greens and other greens, such as chard or mustard greens, washed, stemmed and coarsely chopped (6 cups tightly packed)", "1 cup (8 ounces) ricotta cheese", "2 eggs, beaten", "1/2 cup low-fat milk (2 percent)", "5 tablespoons grated Parmesan", "1/2 cup whole-wheat pastry flour or white whole-wheat pastry flour", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 cup cooked brown or white rice, preferably medium- or short-grain", "2 tablespoons finely chopped chives", "2 teaspoons finely chopped marjoram", "Freshly ground pepper", "Olive oil for the pan or griddle", "Marinara sauce for serving (optional) "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the greens above an inch of boiling water for 1 to 2 minutes, just until wilted. Remove from the heat, allow to cool and squeeze out excess water. Chop fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat together the ricotta, eggs, milk and Parmesan. Sift together the flour, baking powder and salt and whisk into the ricotta mixture. Stir in the greens, rice, herbs and pepper. The mixture will be thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a griddle or a heavy nonstick skillet over medium-high heat. Brush with olive oil, enough to coat the bottom, and drop the batter in by the heaped tablespoon. Cook for about 3 minutes, until dark brown and nicely risen, and turn over. Cook for another 2 to 3 minutes, until brown on the other side. The pancakes will be moist in the middle, but there should not be a raw flour taste. Remove from the heat and serve, or cool on a rack and heat later in a medium-low oven. Serve with a dollop of tomato sauce."}]}