{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Sesame Noodles With Sweet Peppers", "description": "This mildly spicy dish requires minimal cooking, so it's great for a hot day.  Both udon and soba noodles will work in this dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/09/science/13recipehealth/13recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "easy, salads and dressings", "keywords": "cucumber, noodles, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 158}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 314, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "2 grams", "sodiumContent": "610 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons tahini (a runny variety if possible, available in Middle Eastern markets)", "1 tablespoon soy sauce", "2 tablespoons seasoned rice wine vinegar", "1 to 2 teaspoons hot red pepper oil (to taste)", "Pinch of cayenne (optional)", "2 teaspoons finely minced fresh ginger or 1 teaspoon ginger juice (see below)", "Salt and freshly ground pepper to taste", "1 tablespoon sesame oil", "1/4 cup vegetable or chicken broth or water (more to taste)", "3/4 pound udon or soba noodles", "1 tablespoon dark sesame oil", "1 yellow or red pepper, cut in thin 2-inch strips", "1 Persian cucumber or 1/3 European cucumber, cut in 2-inch julienne", "1 medium-size ripe tomato, diced", "1 cup chopped cilantro", "1/4 cup chopped chives or scallions", "1 tablespoon black sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For ginger juice, grate a 1-inch piece of ginger. Wrap in a piece of cheesecloth, twist both ends of the cheesecloth and, holding the package over a bowl, wring out so that the juice is squeezed through the cheesecloth into the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl or measuring cup, whisk together all of the ingredients for the dressing. Taste and adjust seasoning. You can make it spicier if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the noodles. I like to cook wheat udon and soba the Japanese way. Bring 3 or 4 quarts of water to a boil in a large pot. Add the noodles gradually, so that the water remains at a boil, and stir once with a long-handled spoon or pasta fork so that they don’t stick together. Wait for the water to come back up to a rolling boil — it will bubble up, so don’t fill the pot all the way — and add 1 cup of cold water. Allow the water to come back to a rolling boil, and add another cup of cold water. Allow the water to come to a boil one more time, and add a third cup of water. When the water comes to a boil again, the noodles should be cooked through. Drain and toss with1 tablespoon sesame oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the noodles, pepper, cucumber, tomato, cilantro, chives or scallions and black sesame seeds in a large bowl. Toss with the dressing and serve. The salad can also be refrigerated for a few hours before serving. In this case add half the cilantro now and the rest just before serving."}]}