{"@context": "http://schema.org", "@type": "Recipe", "name": "Not-Too-Sweet Wok-Popped Coconut Kettle Corn", "description": "I’m usually not a big fan of sweet kettle corn, but I wanted to make a moderately sweet version because some people love it and it is nice to be able to offer a sweet snack for the holidays. I realized after testing this recipe that I do like kettle corn if it isn’t too sweet. The trick to not burning the sugar when you make kettle corn is to add the sugar off the heat at the end of popping. The wok will be hot enough to caramelize it.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/17/health/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT5M", "recipeYield": "About 12 cups popcorn", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "appetizer, brown sugar, popcorn, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 71}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 159, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "12 grams", "sodiumContent": "56 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons coconut oil", "6 tablespoons popcorn", "2 tablespoons raw brown sugar", "Kosher salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the coconut oil in a 14-inch lidded wok over medium heat. When the coconut oil melts add a few kernels of popcorn and cover. When you hear a kernel pop, quickly lift the lid and pour in all of the popcorn. Cover, turn the heat to medium-low, and cook, shaking the wok constantly, until you no longer hear the kernels popping against the lid. Turn off the heat, uncover and add the sugar and salt. Cover again and shake the wok vigorously for 30 seconds to a minute. Transfer the popcorn to a bowl, and if there is any caramelized sugar on the bottom of the wok scrape it out. Stir or toss the popcorn to distribute the caramelized bits throughout, and serve."}]}