{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage Stuffed With Chicken and Mushrooms", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2013/01/30/dining/30PAIR/30PAIR-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "eastern european", "recipeCategory": "dinner, weekday", "keywords": "cabbage, chicken breast, white mushrooms, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 396, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "6 grams", "proteinContent": "22 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1088 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large head green cabbage", "4 tablespoons extra-virgin olive oil", "2 medium onions, sliced", "4 cloves garlic, sliced", "Salt", "1/2 pound white mushrooms, sliced", "Ground white pepper", "1 pound skinless, boneless chicken breast, ground", "1/4 cup minced fresh dill", "1/2 cup dry white wine", "1 cup chicken stock", "1 tablespoon flour", "1 cup sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cabbage in freezer overnight. The next day, remove cabbage and, under warm running water, peel off at least 12 large leaves. Cut heavy spines out of leaves. Set leaves aside. Quarter and core remaining cabbage and slice thin. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in a large, heavy saut&eacute; pan or 4-quart casserole. Add onions and garlic, dust with salt, cover and sweat on low about 10 minutes, until onions are soft but not brown. Remove onions and garlic. Add 1 tablespoon oil and the mushrooms and saut&eacute; on medium until mushrooms are tender and starting to brown. Remove. Finely chop 1 cup of the cooked onions with the mushrooms by hand or in a food processor. Season well with salt and white pepper, then mix with chicken. Add 1 tablespoon dill. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining oil in pan, add sliced cabbage and rest of sweated onions and cook on medium-low, covered, until cabbage is soft, about 10 minutes. Turn off heat. Place a couple of tablespoons of the chicken mixture on a cabbage leaf, fold and roll leaf around filling. Place seam-side down in pan on cabbage and onions. Repeat with rest of leaves and filling, placing cabbage rolls snugly in pan. Add wine and stock, bring to a simmer, cover and cook gently 40 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cabbage rolls to a platter or bowl. Cover to keep warm. Mix flour with 3 tablespoons of the sour cream until smooth and stir into sliced cabbage and liquid in the pan. Bring to a simmer and cook briefly to thicken. Taste for seasoning. Spoon sliced cabbage mixture onto a rimmed serving platter. Top with cabbage rolls. Mix remaining dill with remaining sour cream, place in a bowl and serve alongside. "}]}