{"@context": "http://schema.org", "@type": "Recipe", "name": "Whelks with Parsley and Garlic Butter", "description": "Whelks are a type of sea snail, or gastropod, inhabiting the Atlantic Ocean and some of its bays and sounds in North America and Europe. In Europe, especially in England, where people eat lots of shelled creatures that might make Americans shudder, whelks are extremely popular.\n\nWhelks range in size from a couple of inches — a dozen or so in a pound — to eight or nine inches long. So-called common whelks are the smallest and the ones to seek at the fish market for their briny-sweet taste and only slight chewiness. Larger varieties, like the channeled whelk or the knobbed whelk, are usually sold as scungilli.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/12/19/dining/19SUBWHELKS_SPAN/19SUBWHELKS_SPAN-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "appetizer, butter, garlic, whelks", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 8}, "recipeIngredient": ["1 ounce garlic (about 7 cloves), germ (the green sprout) removed", "1 1/2 ounces flat-leaf parsley (about 1/2 bunch), heavy stems removed", "8 ounces (2 sticks) soft unsalted butter", "Salt", "1/4 teaspoon ground black pepper", "Pinch cayenne", "1 pound whelks (about 12), the smaller the better, scrubbed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a running food processor, drop garlic through feed tube to mince. Place parsley in container of machine and pulse to mince. Add butter and seasonings, and process until well blended. No bits of butter should show. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring several quarts of water, heavily salted (like seawater), to a boil. Add whelks and boil 4 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place butter mixture in a metal bowl fitted into a small saucepan of simmering water, or in a double boiler. Whisk until mixture melts, then transfer to a serving dish or small individual bowls. Serve 2 to 3 whelks a person, with melted-butter mixture for dipping."}]}