{"@context": "http://schema.org", "@type": "Recipe", "name": "Noodle Bowl With Mushrooms, Spinach and Salmon", "description": "I love spinach, barely cooked, in a noodle bowl. Use either bunch spinach from the farmers’ market or baby spinach for this one.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/06/04/science/05recipehealth/05recipehealth-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "easy, quick, soups and stews", "keywords": "dairy-free, halal, healthy, high fiber, kosher, nut-free, main course, salmon fillet, soba noodles, spinach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 226}, "recipeIngredient": ["6 cups kombu stock, chicken stock or vegetable stock\n", "Soy sauce or salt to taste\n", "6 ounces Japanese soba noodles, cooked and tossed with 2 teaspoons sesame oil \n", "6 fresh shiitake mushrooms, stemmed and thinly sliced (simmer stems in stock for 20 minutes, remove them and discard), or 6 cremini mushrooms, trimmed and thinly sliced\n", "12 to 16 ounces salmon fillet without skin, trimmed of fat and cut into 4 equal pieces\n", "1 large bunch spinach, stemmed, washed in 2 changes of water and coarsely chopped (about 6 cups) or 1 6-ounce bag baby spinach, rinsed\n", "1 bunch scallions, thinly sliced, light and dark green parts kept separate\nCilantro leaves and sprigs for garnish\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer. Taste and adjust seasoning, adding soy sauce or salt if desired. If the noodles have been refrigerated, warm them by placing them in a strainer and dipping the strainer into the simmering broth. Then distribute the noodles among 4 deep soup bowls. \n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sliced mushroom caps, the salmon fillets, the spinach and the white and light green parts of the scallions to the simmering stock. Cover and turn off the heat. Allow to sit for 5 minutes without removing the cover. The salmon should be just cooked through. Leave it a little longer if you want it more opaque.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a piece of salmon on top of the noodles in each bowl. Ladle in the soup, taking care to distribute the spinach, mushrooms and scallions evenly. Sprinkle on the dark green parts of the scallions, garnish with cilantro and serve.\n"}]}