{"@context": "http://schema.org", "@type": "Recipe", "name": "Post-Thanksgiving Cobb Salad", "description": "The classic California Cobb salad is a composed salad made with chicken breast, lettuce, avocado, tomatoes, chopped hard-boiled eggs, bacon, and blue cheese. It should never be a jumble: the elements are arranged on a platter or in a wide bowl side by side, then dressed, and it’s up to the diner to mix them together. This version dispenses with the bacon and reduces the amount of Roquefort or blue cheese called for in the traditional Cobb. Tomatoes are not in season so I have eliminated them, too, and replaced them with grated carrots. Chopped toasted almonds, which can be salted if you can handle it, can stand in for the bacon. <br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/27/science/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "Serves 6 as a main dish", "recipeCuisine": "", "recipeCategory": "lunch, salads and dressings", "keywords": "avocado, roquefort cheese, shredded turkey, fall, gluten-free, healthy, high fiber, raw", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 410, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "5 grams", "proteinContent": "22 grams", "saturatedFatContent": "6 grams", "sodiumContent": "614 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small or medium garlic clove", "Salt, preferably kosher salt, to taste", "1 teaspoon chopped fresh thyme leaves", "1 teaspoon Dijon mustard", "2 tablespoons red wine vinegar", "1 tablespoon fresh lemon juice", "1/4 cup extra virgin olive oil", "1/4 cup canola or grapeseed oil", "2 cups shredded cooked turkey, chicken breast or chicken breast tenders (12 ounces cooked)", "2 romaine hearts, or 1 romaine heart and 1 head bibb lettuce, cut crosswise in chiffonade", "1 small head radicchio, cut in chiffonade (optional)", "2 tablespoons chopped fresh parsley, or 1 tablespoon each parsley and tarragon", "3 hard-boiled eggs, chopped", "1 large ripe but firm avocado, sliced or diced", "1 large or 2 medium carrots, peeled and grated", "2 ounces (about 1/2 cup) Roquefort or blue cheese, crumbled", "1/4 cup chopped toasted almonds (salted or barbecued if desired)", "2 tablespoons chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing. Cut the garlic in half and place in a mortar with a generous pinch of salt and 1 teaspoon of the olive oil. Mash to a paste. Add the thyme and the mustard and mix together. Whisk in the lemon juice, vinegar, remaining olive oil and the canola oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the lettuces in a large bowl and toss with 1 tablespoon of the parsley (or parsley and tarragon) and 3 tablespoons of the dressing. Arrange down the center of a large serving platter or wide bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the turkey or chicken with 1 teaspoon of the chives and 2 tablespoons of the dressing. Place on top of the lettuce chiffonade, down the length of the center of the platter. Season the chopped eggs with salt and pepper and toss with 1 tablespoon of the dressing. Place in a strip next to the turkey or chicken. Toss the grated carrots with 2 teaspoons of the parsley or parsley and tarragon and 1 tablespoon of the vinaigrette. Place in a strip on the other side of the chicken. Slice the avocado, season with salt and pepper. Arrange half down one side of the salad and half down the other. Sprinkle the blue cheese and chopped almonds over everything. Garnish with the remaining parsley and chives. Pour the remaining dressing over all, and bring the salad to the table or buffet. Make sure that each serving is a crosswise serving so that all of the elements of the salad are included."}]}