{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Baby Squash, Long Beans, Corn and Chiles With Soba Noodles", "description": "Long beans stir-fry more quickly than regular green beans because they have a thinner husk, but if you can’t find long beans you can use regular ones, like Blue Lakes. I used purple long beans for this stir-fry but green ones will work as well. Make sure to drain and dry the vegetables on several thicknesses of paper towels after you wash them so that they sear properly. <br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/07/16/science/17recipehealth/17recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, quick", "keywords": "baby squash, long beans, soba noodles, dairy-free, healthy, high fiber, kosher, low cholesterol, vegan, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 331, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "1 gram", "sodiumContent": "746 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["8 ounces soba noodles", "Salt to taste", "2 teaspoons sesame oil", "3/4  pound purple or green long beans, ends trimmed, cut into 1-inch pieces", "1 pound baby squash, cut into 1-inch pieces", "Kernels from 2 ears corn", "1 bunch scallions, cleaned, halved lengthwise and cut in 1/2-inch pieces", "1 tablespoon soy sauce (more if desired)", "1 tablespoon Shao Hsing rice wine or dry sherry", "1/4 cup vegetable stock or water", "1/4 to 1/2 teaspoon salt (to taste)", "1/8 teaspoon ground black pepper", "1/4 to 1/2 teaspoon sugar (to taste)", "3 teaspoons minced garlic", "2 teaspoons minced ginger", "2 serrano chiles, minced", "2 tablespoons peanut, canola, rice bran or grape seed oil", "2 to 4 tablespoons chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "First cook the soba noodles. Bring 3 or 4 quarts of water to a boil in a large pot. Add salt to taste. Add the noodles gradually, so that the water remains at a boil, and stir once with a long-handled spoon or pasta fork so that they don’t stick together. Wait for the water to come back up to a rolling boil — it will bubble up, so don’t fill the pot all the way — and add 1 cup of cold water. Allow the water to come back to a rolling boil, and add another cup of cold water. Allow the water to come to a boil one more time, and add a third cup of water. When the water comes to a boil again, the noodles should be cooked through. Drain and toss with the sesame oil in a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the vegetables. The squash, corn and white parts of the scallions can be in one bowl, the beans should be in another."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup combine the soy sauce, rice wine or sherry, and stock or water. Combine the salt, pepper and sugar in another small bowl and the garlic, ginger, and chiles in another. Have all of the ingredients within arm’s length of your pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Add the oil by pouring it on the sides of the pan and swirling the pan, then add the garlic, ginger and chiles and stir-fry for no more than 10 seconds. Add the long beans and stir-fry for 1 minute. Add the squash, corn and the white part of the scallions and stir-fry for 2 minutes. Add the salt, pepper, and sugar, toss together and add the soy sauce mixture. Stir-fry for 1 minute, or until most of the liquid has cooked off. Remove from the heat and transfer to a platter or bowl. Add the noodles to the hot wok, toss until heated through, and divide among plates. Top with the vegetables and serve. "}]}