{"@context": "http://schema.org", "@type": "Recipe", "name": "Rainbow Potato Roast", "description": "Each different type of potato here has its own distinctive flavor and texture as well as color. Some will roast more quickly than others but it doesn’t matter to me if certain pieces in the mix become very soft. My favorite mix here consists of sweet potato, purple potatoes, fingerlings, Yukon golds and red bliss.<br/><br/>", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/02/27/science/28recipehealth/28recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "garlic, olive oil, potato, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 321}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 242, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "425 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 garlic clove, cut in half", "1 1/2 pounds mixed white, yellow, purple, red and sweet potatoes (Yukon golds, fingerlings, red potatoes etc.), peeled if desired and cut in 1-inch pieces (I peel sweet potatoes but not potatoes with smooth skins.)", "Salt and freshly ground pepper", "2 teaspoons chopped fresh sage", "3 tablespoons extra virgin olive oil", "1 ounce Parmesan, grated (1/4 cup) (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Rub a 2- or 3-quart baking dish or gratin with the cut side of the garlic and then brush with olive oil. Alternatively, line a sheet pan with parchment and omit the garlic. Place the potatoes in a large bowl. Season to taste with salt and pepper, add the sage and 2 tablespoons of the olive oil and toss again. Arrange in the baking dish or on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 40 minutes, stirring every 10 minutes. If you are using a baking dish the  some of the potatoes might stick, but just coax them away from the dish with your spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining oil and the cheese if using, stir together and bake another 10 minutes, until the potatoes are crispy on the edges. Serve hot or warm."}]}