{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Bluefish Pâté", "description": "Bluefish is not a famous table fish; it is inexpensive and widely available, but you don’t see it in restaurants often, even in this ravaged-ocean, sell-anything era. (Some states have issued advisories limiting its consumption, citing high levels of PCBs in the meat.) The knock on it is it’s oily, it’s “fishy.” Its dark, compact meat is for cats, not fine, upstanding people like us.\n\nHow untrue — and demonstrably so, as the following recipe will show!\n\nA fresh-caught bluefish of moderate weight, quickly cleaned and kept on ice, is as fine an eating fish as American waters produce. Alan Davidson, the British seafood don, says much the same in his indispensable “North Atlantic Seafood,” albeit in a different accent: “It does not keep very well,” reads Davidson’s entry for Pomatomus saltatrix, “but, if bought and cooked with dispatch, offers firm flesh of an excellent taste.” Bluefish, in short, is an excellent protein.\n\nSome words about what you’re dealing with: dense meat with an off-white, almost gray hue, the pork shoulder of seafood. Bluefish lends itself to tough treatment: smoking, for instance, or slow-poaching in oil.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/06/06/dining/Smoked-Bluefish/Smoked-Bluefish-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "Makes about 1 1/2 cups", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, bluefish fillet, cream cheese, hickory chips", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["1 cup hickory chips, soaked in water for at least 30 minutes", "1/2 pound skin-on bluefish fillets, bones removed", "1 tablespoon extra virgin olive oil", "Kosher salt", "freshly ground black pepper", "1/2 pound smoked bluefish (presmoked, grilled or leftovers from the Dijonnaise may be used)", "4 ounces (1/2 cup) cream cheese", "2 tablespoons butter", "1 tablespoon Cognac", "1 tablespoon minced red onion", "1 lemon", "Salt", "freshly ground black pepper", "Hot pepper sauce", "Crackers", "sliced baguette or pumpernickel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To smoke bluefish: Build a small charcoal fire in one-third of a grill fitted with a lid. When the coals are covered with gray ash and the fire is at medium heat (you can hold your hand 5 inches above the coals for 3 to 4 seconds), add a handful of the wet hickory chips to the fire. Rub the fish with the olive oil and sprinkle generously with salt and pepper. Place the fish, flesh side down, on the grill directly over the coals. Cook, covered, for 4 minutes, then transfer to the side of the grill without coals. Cover the grill and cook until the fish is opaque all the way through, about 6 minutes more. Remove the fish and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pâté: Flake the bluefish into the bowl of a food processor, discarding the skin. Add the cream cheese, butter and Cognac and pulse to combine. Add the onions, the strained juice of half the lemon and a pinch each of salt and pepper, then pulse again to combine. The purée should straddle the consistency line between a pâté and a mousse. Season with hot pepper sauce and more lemon juice, salt and pepper to taste. Serve immediately or store in an airtight container for a day or two."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the cold pâté in ramekins or turn out onto plates, accompanied by crackers, sliced baguette or pumpernickel."}]}