{"@context": "http://schema.org", "@type": "Recipe", "name": "Canned Poached Pears", "description": "You will need two pint-size wide-mouth Ball or Kerr jars with bands and new lids, available at many hardware stores or at freundcontainer.com. Avoid table-ripe fruit. Ripe or very ripe fruit may produce a mushy result.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Canned-Poached-Pears/Canned-Poached-Pears-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Makes 2 pints (Serves 6)", "recipeCuisine": "", "recipeCategory": "project", "keywords": "bartlett pear, lemon, wine, dessert, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 7}, "recipeIngredient": ["3 firm Bartlett pears", "1/4 cup lemon juice (bottled or fresh)", "1 cup sugar", "5 or 6 sprigs fresh thyme", "1/2 cup apple cider or other fruit juice", "2 small bay leaves", "6 whole peppercorns", "2 2-inch strips lemon peel, pith removed", "1/2 cup red or white wine", "Amaretto cookies", "Ricotta", "Confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Have ready two clean wide-mouth pint jars with screw-on bands. You can reuse jars and bands if they aren’t chipped or dented, but you must use new lids every time you process. Bring a small pot of water to a simmer over medium-low heat and add two new lids. Simmer for a few minutes, then turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the pears in half from pole to pole. Using a small spoon, scoop out the seeds. Trim the stem ends to create round pear halves, leaving the pears as large as possible. Peel. Place the lemon juice in a bowl with 2 cups of water. Stir and add the peeled pears."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the sugar, thyme and 1 cup of water in a medium saucepan and bring to a low boil over medium heat to dissolve the sugar. Add the cider and heat through. Add the pears and simmer for a few minutes, until they are heated through. Gently pack the pears, cut-side down, in the jars. Three halves will fit in each jar. Tuck one bay leaf, 3 or so peppercorns and a lemon peel in each jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the syrup over the pears, filling the jars about ¾ full. Using a butter knife, gently release any air bubbles. Top the jars with the wine, leaving ½ inch of space between the liquid and the lid. If the pears bob a bit above the liquid, it’s O.K."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the rims of the jars with a clean towel, place the lids on and screw on the bands fingertip-tight — don’t crank them closed. Place the jars in a pot with a rack and cover with water by 2 inches. Bring to a boil and simmer gently for 20 minutes. Turn off the heat, let the jars rest for 5 minutes, then remove them to cool. You will hear a popping sound as the vacuum seals the lid to the jar. When the jars are cool, check the seals: Press on the lids. They should be taut and pulled down toward the inside of the jar. If a lid bounces when you press on it, the seal is imperfect and you will have to reprocess the jar with a new lid, or refrigerate and eat within two weeks. The pears may float in the liquid; it’s O.K. Store in a cool, dark place for up to a year. Refrigerate after opening."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, drain the pears and boil the canning liquid in a small saucepan until syrupy and reduced by half. Drizzle over the pears. They are good at room temperature, cold or warmed in the syrup. Garnish with crumbled amaretto cookies or a dollop of ricotta sweetened with confectioners’ sugar."}]}