{"@context": "http://schema.org", "@type": "Recipe", "name": "Smothered Pork Chops", "description": "Get the best pork chops you can, and the thickest, and give yourself a good 12 hours or more of lead time to soak them in the brine. If you are omitting the anise in the brine, you could add some flavor to the dredging flour — chili powder, say, or smoked paprika.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/08/02/dining/02COOKING_PORKCHOPS1/02COOKING_PORKCHOPS1-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat", "keywords": "chicken stock, onion, pork chops, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1396}, "recipeIngredient": ["8 thick, bone-in pork chops (more if using smaller chops)", "Anise brine (<a href='http://www.nytimes.com/recipes/1014391/Anise-Brine.html'>see recipe</a>)", "4 tablespoons neutral oil, like peanut or safflower, or lard", "1 cup all-purpose flour", "8 medium yellow onions, peeled and thinly sliced", "1 bay leaf", "Kosher salt and freshly ground pepper to taste", "2 quarts pork stock or chicken stock", "1 tablespoon finely chopped parsley, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonreactive container, submerge the pork in the brine and place in refrigerator for at least 12 hours or overnight, then remove the chops and dry well with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325. Heat the oil or lard in a large ovenproof pot or Dutch oven set over medium heat. Dredge the chops in the flour, shaking off the excess. Reserve the leftover flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the chops in the fat, about 4 minutes per side, until they are brown and crisp on the exterior, and transfer to a plate. Reduce heat to medium-low. Add the onions and bay leaf and cook, stirring often, until the onions are softened, about 15 minutes. Season well with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 6 tablespoons flour to the onions, stir well and allow to cook 3 or 4 minutes. Slowly add the stock, stirring and scraping the pan well, until it is incorporated and the mixture is slightly thickened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return chops to the pot and bring to a simmer, then cover tightly and cook in the oven until very tender, 2 or more hours. Transfer chops to a plate and place pot on stovetop, over medium heat. Reduce sauce until it is thick enough to resemble gravy, skimming excess oil and foam if necessary. Return chops to pot to reheat, then serve with their gravy over rice or mashed potatoes. Garnish with parsley if you like."}]}