{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomatoes Stuffed With Bulgur and Herbs", "description": "These stuffed tomatoes make a great summer dish. You can serve them either warm or at room temperature. I like using bulgur for stuffed vegetables, because it’s light and softens quickly.  ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/08/12/health/nutrition/12recipehealth.ready/12recipehealth.ready-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, bulgur, fresh herbs, tomato, healthy, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 186, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "465 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup medium or coarse bulgur", "Salt to taste", "6 medium-size, ripe but firm tomatoes", "1/2 cup mixed chopped fresh herbs, such as parsley, dill, mint, chives, chervil and basil", "1/4 cup lightly toasted pine nuts", "3/4 teaspoon cinnamon", "2 tablespoons extra virgin olive oil", "1 cup thickened yogurt or thick Greek yogurt", "1 or 2 cloves garlic (to taste)", "1 tablespoon chopped fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bulgur in a bowl and add 1/4 teaspon salt. Mix together. Bring 1 cup water to a boil, and pour over the bulgur. Allow to sit for 30 minutes or until the bulgur is soft and fluffy. Transfer to a strainer and press out excess water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Slice off the tops of the tomatoes, about 3/4 inch down from the stem (or far enough down that it will be easy for you to hollow them out). Using a teaspoon or a grapefruit spoon, carefully scoop out the seeds, taking care not to cut through the skins. Place in a strainer set above a bowl. Rub the seed pods against the strainer to extract the juice. Discard the seeds. Carefully scoop out the pulp, and chop fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the bulgur, herbs, garlic, pine nuts, the chopped tomato pulp, 1/4 cup of the strained juice and 1 tablespoon of the olive oil. Season to taste with salt and pepper. Season the hollowed out tomatoes with salt and pepper. Fill each tomato with the bulgur filling (you may have some stuffing left over). Place in a baking dish that is small enough to fit the tomatoes snugly. Drizzle 1/2 teaspoon olive oil over each one, and place the caps on top. Pour about 1/2 inch of water into the pan, and cover with foil. Bake 45 minutes. Remove from the oven and uncover. Serve warm, or allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the garlic with a pinch of salt in a mortar and pestle. Stir into the yogurt, along with the mint. Serve the stuffed tomatoes with a dollop of the yogurt."}]}