{"@context": "http://schema.org", "@type": "Recipe", "name": "Macedonian Cheese Pie", "description": "IMPROBABLY, in Romania, in the somewhat drab Black Sea city of Constanta, the owners of the pizzeria where we stopped for a snack and some wine had New York connections. It was all very convivial. But what really got my attention was something listed on the menu as Macedonian cheese pie. Imagine pizza-size calzone filled with feta.I made it not long after I returned from that trip. Later, I made it again, with the addition of some strips of sweet roasted peppers. It was even better, and hit its stride with some French sparkling wines that had modest effervescence, pleasant fruitiness and bright acidity.Next time, I might sprinkle chili flakes on the cheese, or smear some of that Balkan chili and pepper condiment, ajvar, on the dough before adding the cheese. No “might” about it. I will use the ajvar next time. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/macedonian-cheese-pie/macedonian-cheese-pie-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "eastern european", "recipeCategory": "dinner", "keywords": "appetizer, bell pepper, feta, rosemary", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 401, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "13 grams", "saturatedFatContent": "7 grams", "sodiumContent": "393 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 packet instant yeast", "3 tablespoons extra virgin olive oil", "1 teaspoon salt", "1/2 teaspoon coarsely ground pepper", "2 3/4 to 3 cups flour", "1 medium red bell pepper", "9 ounces feta, crumbled", "1 rosemary sprig, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the yeast with 1 cup warm water in a large bowl. Stir in 2 tablespoons oil, the salt and the pepper. Add 2 1/2 cups flour, 1/2 cup at a time, and mix well to make a soft dough that’s still a bit sticky. Knead it in the bowl or on a floured surface, adding more flour as necessary, until most of the stickiness is gone and the dough is elastic and still soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a medium-size bowl with 1/2 tablespoon oil. Add the dough, cover with a towel or a paper towel and let rise until doubled, about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, completely char the outside of the pepper over a gas burner or under a broiler. Scrape off charred peel. Remove core and seeds, and cut in slivers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Grease a baking sheet or pizza pan with the remaining oil. Cut the dough in half. Stretch and roll one half into a 14-inch circle and place on pan. Scatter the cheese on the dough to within an inch of the edge. Scatter the pepper strips over the cheese. Roll and stretch the remaining dough into a 14-inch circle. Place it on top of the filling, fold the bottom edge over the top edge and pinch to seal. Cut a small slit in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake about 30 minutes, until browned. If desired, place the sprig of rosemary standing up in the slit for a festive touch. Cool 5 minutes before cutting into wedges."}]}