{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushrooms and Chives With Tofu Croutons", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": "https://static01.nyt.com/images/2014/04/22/dining/Tofu-Croutons/Tofu-Croutons-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "2 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, weekday", "keywords": "chives, firm tofu, mushroom, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 8}, "recipeIngredient": ["1/2 pound firm tofu", "2 tablespoons cornstarch", "3 cups vegetable oil", "Salt", "3 tablespoons vegetable oil", "2 tablespoons julienned fresh ginger", "2 cups yellow or green chives or both, trimmed, cut crosswise into 2-inch pieces", "1 cup prince mushrooms sold in Asian stores, trimmed, sliced diagonally 1/4 -inch thick, and then sliced into 1/4-inch wide strips", "1 cup oyster mushrooms, trimmed and halved or quartered lengthwise", "1 cup baby portobellos or baby shiitakes, stemmed and halved or quartered", "1 1/2 cups vegetable broth", "2 tablespoons soy sauce", "2 teaspoons vegetarian oyster sauce", "1 1/2 teaspoons cornstarch", "Salt to taste", "white pepper, to taste", "2 teaspoons sesame oil", "1 teaspoon vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the tofu croutons", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the tofu croutons: Pat tofu very dry on paper towels. Cut tofu into 1/2-inch cubes, and carefully coat in cornstarch. Pour the oil into a wok or small deep-fryer and heat to 350 degrees. Working in batches, if needed, deep-fry the tofu for 5 to 6 minutes, until golden and crispy. Using a slotted spoon, remove the tofu and place on paper towels. Season with salt, and set aside. Discard the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mushrooms and chives: In a large skillet or wok, heat 3 tablespoons of oil over medium-high heat until shimmering. Add 1 tablespoon of the ginger and stir rapidly for 30 seconds. Add chives and stir for 30 seconds. Add mushrooms and stir-fry until softened, about 8 minutes. Transfer to a platter, and set aside. Clean the skillet or wok, and wipe dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix vegetable broth, soy sauce and oyster sauce; set aside. In another small bowl, mix the cornstarch with 2 tablespoons cold water; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the large skillet or wok, add stock mixture and bring to a boil. Add cornstarch mixture and stir for 20 seconds. Add the mushrooms and chives mixture and heat through. Season with salt and white pepper to taste."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the mushrooms and chives", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mushrooms and chives mixture into the center of a platter. Arrange the tofu croutons around the edges. Garnish with the remaining tablespoon of julienned ginger. Drizzle with sesame oil, sprinkle with vinegar."}]}]}