{"@context": "http://schema.org", "@type": "Recipe", "name": "Pizza Rustica (Easter Pie)", "description": "A deep-dish cousin to quiche that's packed with Italian deli meats and cheeses like prosciutto, pepperoni, soppressata, mozzarella and provolone, this rich pie, also called Easter pie, is traditionally made on Good Friday and served on the holiday to celebrate the end of Lent. This version came to The Times from Carlo's Bakery, in Hoboken, N.J., of “Cake Boss” fame, and it is the only savory item the bakery makes. It's typically eaten at room temperature, but the staff at Carlo's enjoys it warm right out of the oven.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/pizzarustica/pizzarustica-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "One 10-by-15-inch pie", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles, pies and tarts, pizza and calzones", "keywords": "cheese, eggs, meat, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 257}, "recipeIngredient": ["6 cups all-purpose flour, plus more as needed", "1/4 teaspoon salt", "1 pound chilled salted butter, cut into large pieces", "5 large eggs, beaten", "12 ounces prosciutto, in 1/4-inch dice", "8 ounces boiled ham, in 1/4-inch dice", "8 ounces pepperoni, in 1/4-inch dice", "8 ounces soppressata, in 1/4-inch dice", "8 ounces mozzarella, in 1/4-inch dice", "8 ounces provolone, in 1/4-inch dice", "2 pounds ricotta", "4 ounces grated pecorino Romano", "10 large eggs, beaten", "1 teaspoon pepper", "1 large egg, beaten, for brushing crust"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the dough: In a large bowl, whisk together 6 cups flour and the salt. Using a pastry cutter, large fork, or two knives, cut the butter into the flour until the mixture resembles coarse crumbs. Add eggs and knead for 1 minute. Add about 1 1/4 cups ice water, a little at a time, to form a cohesive dough. Knead the dough on a lightly floured surface until it forms a large smooth ball, about 5 minutes. Cover with plastic wrap and set aside for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling: Mix the meats, cheeses, the 10 eggs and pepper in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Divide the dough into two pieces: two-thirds for the bottom crust and one-third for the top. On a lightly floured surface, roll out the larger portion of the dough into a rectangle to line the bottom and sides of a 10-by-15-inch glass baking dish, with some overhang. Add the filling and smooth it lightly. Moisten the edges of the dough with a little water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the remaining dough to cover the top of the dish with some overhang. Trim off excess dough and crimp the edges to seal. Poke several sets of holes across the top with a fork. Bake for 45 minutes. Remove from the oven and brush top and edges with the beaten egg, then return to the oven until golden brown, another 45 minutes. Let pie cool completely before serving."}]}