{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai-Style Sea Scallop Cakes", "description": "This version of the Thai appetizer tod mun is not completely authentic, but it is pretty faithful to the flavors of the original. Kaffir lime leaf is used in many dishes throughout Southeast Asia and Indonesia (the limes are also known as makruts, but in South Africa, “kaffir” is a racial insult). It provides the unique floral, citrusy flavor. The lime leaf is not absolutely necessary in this recipe, but it’s a bit of a pity to leave it out. The leaves are available, if not from your local Asian grocery, then online (try kaffirlimeleaves.com). Most tod mun recipes call for any white-fleshed fish, but this recipe calls for sea scallops, which give the cakes a wonderful texture.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2011/11/02/dining/02KITCH1_SPAN/02KITCH1_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "thai", "recipeCategory": "", "keywords": "appetizer, sea scallop, white fish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 129, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "628 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup rice wine vinegar", "1/4 cup brown sugar", "2 or 3 tiny Thai chiles, red or green, thinly sliced", "2 tablespoons chopped or crushed roasted unsalted peanuts", "2 teaspoons fish sauce", "1 teaspoon grated ginger", "1 pound sea scallops, or 1/2 pound sea scallops plus 1/2 pound halibut, cod or other firm white-fleshed fish", "1/2 teaspoon salt", "1/2 teaspoon black or white pepper", "2 teaspoons fish sauce", "2 small garlic cloves, smashed to a paste with a little salt", "1 two-inch piece ginger, peeled and grated", "6 scallions, thinly sliced", "2 teaspoons finely chopped serrano or jalapeño chile, or to taste", "1/2 cup cilantro leaves and tender stems, roughly chopped", "4 kaffir lime leaves, slivered thinly", "1 small egg, lightly beaten", "Peanut or coconut oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dipping sauce, combine all ingredients in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sea scallop cakes, put the sea scallops in the bowl of a food processor. Add the salt, pepper, fish sauce, garlic and ginger. Process to a fine-ground paste, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the scallions, chile, cilantro, kaffir lime leaves and egg. Pulse a few times to combine well. The paste can be transferred to another container and refrigerated until ready to cook, up to a day ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour peanut or coconut oil to a depth of 1/4 inch into a wide skillet and turn the heat to medium high. When the oil is hot, carefully add the fish cake mixture in large spoonfuls. Fry in batches if necessary to avoid crowding. Adjust the heat to allow the cakes to brown gently for about 3 minutes, then flip them. Flatten them gently with a spatula and cook for 2 to 3 more minutes. Drain on absorbent paper, then serve hot, with the dipping sauce."}]}