{"@context": "http://schema.org", "@type": "Recipe", "name": "Bean-Hole Baked Beans", "description": "This recipe is a project that can be time- and labor-intensive. You need to dig a hole in your yard and build a fire in that hole to cook the beans. An important note: Failing to dig the hole, and using your oven instead, will result in beans that lack bona fides but are 98 percent as good as the ones that guy cooked in a hole in his yard.  This recipe will take about 3 hours plus soaking time for the oven method.", "author": {"@type": "Person", "name": "John Willoughby"}, "image": "https://static01.nyt.com/images/2014/03/05/dining/05beanhole/05beanhole-articleLarge.jpg", "totalTime": "PT10H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "dried beans, molasses, salt pork, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 458, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1029 milligrams", "sugarContent": "29 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds dried beans of your choice (soldier, pea, Jacob’s Cattle, great northern, yellow eye, etc.)", "3 onions, thinly sliced", "3/4 cup molasses", "1/2 cup maple syrup", "2 tablespoons dry mustard", "2 tablespoons kosher salt", "1 tablespoon black pepper", "1 pound salt pork, sliced into pieces about 2 inches by 1/2 inch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak beans overnight in water to cover or quick-soak: Put beans in a large pot, add water to cover by 2 inches and bring to a simmer over medium-high heat. Simmer for 2 minutes, then remove from heat and allow to stand for 1 hour. Drain and rinse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you don’t already have a bean hole, dig a hole about half again as large as whatever pot you plan to cook the beans in. (The key is that there be 6 inches between the top of the hole and the top of the pot.) Build a fire in the hole using about 10 pieces of cord wood. When the fire is burning well, add 10 softball-size rocks, then continue to burn until the wood is reduced to embers. You should have a bed of embers 2 to 3 inches deep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, drain and rinse the beans and put them into a 6-quart Dutch oven or other large, heavy pot along with all remaining ingredients except the salt pork. Stir well to combine. Lay the salt pork slices on top of the beans, then add water to cover by about an inch. Bring just to a simmer over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the rocks from the bean hole. Put the pot into the hole on top of the embers, cover it with a triple layer of heavy-duty foil, then put the rocks back into the hole around and on top of the pot. Fill in the hole with dirt, covering the pot. Come back 8 hours later, remove the pot from the hole and serve the beans."}]}