{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Heads of New Garlic", "description": "This is a seasonal variant of a classic French dish, chicken fricasseed with 40 cloves of garlic, made with the new garlic available in farmer’s markets in early summer. You can certainly make it with whatever garlic you have on hand — the bulbs cook slowly and lose their pungency in the process, becoming sweet and unctuous — but it is sensational with young garlic: bright and deep at once, fragrant and magical spread on bread. It is one of the great summertime dinners, whenever you make it.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/07/24/dining/24KITCH_SPAN/24KITCH-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 501, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "33 grams", "saturatedFatContent": "9 grams", "sodiumContent": "908 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small chicken, about 3 pounds", "Salt and pepper", "2 tablespoons butter ", "1 large onion, diced (about 2 cups)", "6 heads new garlic", "Several large thyme sprigs", "1 cup white wine", "Parsley or basil, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With a sharp knife, remove back bone from chicken. Cut chicken into 4 pieces: 2 legs with thighs attached, and the breast split lengthwise, wings attached. (Reserve back bone, giblets and extraneous chicken fat for another use.) Season chicken pieces generously with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Melt butter in a Dutch oven or enameled pot with lid over medium-high heat. Add onion and cook briskly, stirring occasionally, until nicely browned, 5 to 8 minutes. Meanwhile, cut stalk and roots from garlic heads and trim off one layer from each head’s tough exterior. Cut heads in half, top to bottom. Add garlic to onions, season with salt and pepper, and stir to coat. Place thyme sprigs on onion mixture, then add chicken pieces in one layer. Add wine and 1 cup water and bring to a simmer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover pot and transfer to oven. Bake for 35 minutes, covered. Remove lid and bake for 10 minutes, or until chicken has browned and juices at thigh run clear when probed with paring knife. Let it rest off heat for 10 to 15 minutes. (If desired, cut breasts in half and divide thigh from drumstick with a sharp knife.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve each guest a piece of chicken and several garlic halves. Spoon pan juices over everything. Sprinkle with chopped parsley or basil if desired."}]}