{"@context": "http://schema.org", "@type": "Recipe", "name": "Gluten-Free Whole Grain Cheese and Mustard Muffins", "description": "A savory muffin with a delicious strong flavor.<br/><br/>One of my favorite savory muffins. Add the nuts if you want more texture, but they have plenty without them. Because the cheese and mustard add such a nice strong flavor, I don’t mind using a gluten-free blend that includes bean flour in these muffins because I don’t really taste the bean flour.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/01/29/science/30recipehealth/30recipehealth-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "12 muffins (1/3 cup capacity cups)", "recipeCuisine": "", "recipeCategory": "breakfast, weekday", "keywords": "appetizer, cornmeal, dijon mustard, sharp cheddar cheese, gluten-free, halal, healthy, kosher, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 58}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 188, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "337 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["70 grams (approximately 1/2 cup) millet meal (you can grind the millet in a spice mill)", "70 grams (approximately 1/2 cup) cornmeal", "140 grams (approximately 1 cup) gluten-free whole grain mix or gluten-free all purpose mix", "10 grams (2 teaspoons) baking powder", "5 grams (1 teaspoon) baking soda", "3 1/2 grams (rounded 1/2 teaspoon) salt", "2 eggs", "40 grams (2 tablespoons) Dijon mustard", "300 grams (1 1/4 cups) buttermilk", "75 grams (1/3 cup) canola or grape seed oil", "115 grams (1 cup, tightly packed) grated sharp cheddar cheese", "50 grams (1/2 cup) chopped walnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees with the rack adjusted to the middle. Oil or butter muffin tins. Sift together the flours, baking powder, baking soda and salt into a medium bowl. Add any grainy bits remaining in the sifter to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate large bowl beat together the eggs, mustard, buttermilk and oil. Quickly whisk in the dry ingredients and mix until well combined. Do not beat for too long; a few lumps are fine but make sure there is no flour sitting at the bottom of the bowl. Fold in the cheese and walnuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon or ice cream scoop, fill muffin cups to the top. Place in the oven and bake 25 to 30 minutes, until lightly browned and well risen. Remove from the heat and if the muffins come out of the tins easily, remove from the tins and allow to cool on a rack. If they don’t release easily, allow to cool and then remove from the tins."}]}