{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised-Then-Baked Ham", "description": "Here is a sensible prescription from Julia Child for cooking a whole ham, which was featured in a New York Times article by Julia Moskin that explored the quandary of how to make a flavorful Easter ham. Braise the meat in wine and water to finish the cooking, then roast it in a hot oven to crisp the surface. The end result is glazed with mustard and brown sugar and crusted with golden bread crumbs. One note: this is a recipe for a cured ham, not a fresh one.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/03/25/dining/25HAM_SPAN/25HAM_SPAN-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "2 to 3 servings a pound", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "ham, herbs, vegetables, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 151}, "recipeIngredient": ["1 cooked, bone-in “city ham,” whole or half, 8 to 12 pounds", "3 tablespoons butter or vegetable oil", "1 cup sliced carrots", "1 cup sliced onions", "Herb bundle of 12 parsley sprigs, 6 thyme sprigs, 1 bay leaf, 12 peppercorns, 3 cloves, tied together in cheesecloth", "1 bottle dry white wine", "Glaze, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If there is tough skin covering the top of the ham, cut it off to expose the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep pot, heat butter or oil over medium-high heat. Add carrots and onions and sauté until tender and golden brown, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ham on the vegetables, fatty side up. Add herb bundle, wine and 1 quart water and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for 2 to 3 hours at a bare simmer; baste with ladle every 20 minutes. After 2 hours, test with meat thermometer: ham is ready when internal temperature reaches 135 degrees. Turn off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Drain ham, reserving cooking liquid to use for stock (it freezes well). Place ham on a rack in a roasting pan, fatty side up, and score fat in a diamond pattern with tip of sharp knife. If using glaze, brush it on now."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place ham in oven; roast 15 to 20 minutes until lightly browned. If using glaze, brush on more after first 10 minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven, tent with foil, and let rest 20 to 30 minutes before carving."}]}