{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Curry Potpie", "description": "", "author": {"@type": "Person", "name": "Steven Stern"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Chicken-Curry-Pot-Pie/Chicken-Curry-Pot-Pie-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "5 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, curry powder, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 76}, "recipeIngredient": ["3 1/2 cups all-purpose flour, or as needed", "2 teaspoons kosher salt", "3 1/2 teaspoons baking powder", "11 tablespoons very cold unsalted butter, cut into 1-inch cubes", "1 1/4 cups buttermilk", "2 tablespoons canola oil", "2 1/2 pounds bone-in chicken thighs, skin removed", "1/4 cup Madras curry powder", "2 lemon grass stalks, tops trimmed, bases halved lengthwise and smashed", "3 white onions, cut into 3/4-inch dice", "1/2 to 3/4 cup fish sauce", "4 large carrots, peeled and cut into 3/4-inch dice", "3 large Yukon Gold or baking potatoes, peeled and cut into 3/4-inch dice", "1 1/4 cups coconut milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the buttermilk biscuits", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Have ready five 24-ounce oval (or 7-inch round) gratin dishes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the buttermilk biscuits: In a large bowl, whisk the flour, salt and baking powder to combine. Transfer 1 cup of the dry ingredients to a food processor, and sprinkle with the cubes of butter. Pulse 5 to 7 times until the butter pieces are pea-size. Transfer to the bowl with the remaining dry ingredients, and stir to distribute the butter evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make several depressions in the flour mixture with your fingers; add the buttermilk a little at a time, mixing with your fingers, until it is all incorporated. Gently work the dough just until it comes together. Cover lightly, refrigerate 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the chicken curry: Warm the oil in a 5-quart saucepan over medium-high heat, then add the chicken thighs, curry powder and lemon grass. Cook, stirring, until the thighs are seared on all sides and the curry powder is chestnut brown, 3 to 5 minutes. Add the onions and 1/2 cup fish sauce, and cook over medium heat, stirring and scraping the bottom of the pot, for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the carrots and enough water to cover. Bring to a boil, reduce heat, and simmer uncovered until the carrots are tender, about 20 minutes. Transfer the chicken to a plate and discard the lemongrass. Add the potatoes and coconut milk to the pan, and bring to a simmer. Pull meat from chicken thighs in bite-size pieces. Return the meat to the curry and continue to cook, uncovered, until potatoes are tender, about 20 more minutes. Taste sauce and, if needed (fish sauces vary in saltiness), season with up to 1/4 cup additional fish sauce."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the chicken curry", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For assembly: Heat oven to 425 degrees. Divide the biscuit dough into five portions. On a lightly floured work surface, roll out each portion so it will cover the top of a gratin dish to within 1/2-inch of the edges. Distribute the chicken curry among the 5 dishes and top each with dough. Bake until the biscuits are golden, 15 to 20 minutes."}]}]}