{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Cabbage, Carrot and Broccoli Stem Latkes With Caraway and Sesame", "description": "I love finding things to do with broccoli stems. I find that allowing the cabbage mixture to sit for 10 to 15 minutes before forming the latkes allows the cabbage to soften a bit, and the latkes hold together better.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/12/11/science/15recipehealth/15recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "About 30 latkes, serving 6", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "broccoli stems, carrot, red cabbage, dairy-free, halal, healthy, high fiber, kosher, nut-free, vegetarian, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 217, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "374 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 cups shredded red cabbage", "1/2 pound carrots, shredded (about 1 1/2 cups)", "1 1/2 cups shredded peeled broccoli stems", "2 tablespoons sesame seeds", "2 teaspoons caraway seeds", "1 teaspoon baking powder", "Salt to taste", "3 tablespoons oat bran", "3 tablespoons all-purpose flour", "3 tablespoons cornmeal", "2 tablespoons buckwheat flour", "3 eggs, beaten", "About 1/4 cup canola, grape seed or rice bran oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees. Line a sheet pan with parchment and place a rack over another sheet pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl mix together the shredded cabbage, carrots, broccoli stems, baking powder, sesame seeds, caraway seeds, salt, oat bran, flour, cornmeal and buckwheat flour. Taste and adjust salt. Add the eggs and stir together. Let the mixture sit for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large heavy skillet over medium heat. Take a 1/4 cup measuring cup and fill with 3 tablespoons of the mixture. Reverse onto the parchment-lined baking sheet. Repeat with the remaining latke mix. You should have enough to make about 30 latkes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oil to the pan and heat for 3 minutes or until hot. When it is hot (hold your hand a few inches above – you should feel the heat), slide a spatula under one portion of the latke mixture and transfer it to the pan. Press down with the spatula to flatten. Repeat with more mounds. In my 10-inch pan I can cook four at a time without crowding; my 12-inch pan will accommodate 4 or 5.  Cook on one side until golden brown, about 4 to 5 minutes. Slide the spatula underneath and flip the latkes over. Cook on the other side until golden brown, another 2 to 3 minutes. Transfer to the rack set over a baking sheet and place in the oven to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot topped with low-fat sour cream, Greek yogurt or crème fraîche."}]}