{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Pork Dip", "description": "This roast pork dip sandwich, with shredded meat slathered in a rich roux-based dipping sauce, comes from Brian Landry, the chef and an owner of Borgne Restaurant in New Orleans. Pork butt, pierced with garlic slivers and rubbed with fresh rosemary, is slow-roasted until meltingly tender on a bed of vegetables that flavor the final sauce. The meat can be made ahead and then reheated before it is tucked into a crusty roll, a delicious tweak on the po’ boy. “They say the sign of a good po’ boy is how many napkins it takes to get through a sandwich,” Mr. Landry said. “This one takes a lot of napkins.” At Borgne he garnishes it with crispy fried onions, Tabasco-enhanced mayonnaise and melted Swiss cheese.", "author": {"@type": "Person", "name": "Suzanne Lenzer"}, "image": "https://static01.nyt.com/images/2013/01/23/dining/23SUPERBOWL3_SPAN/23SUPERBOWL3_SPAN-articleLarge-v2.jpg", "totalTime": "PT5H", "recipeYield": "10 to 12 servings", "recipeCuisine": "creole", "recipeCategory": "lunch, sandwiches, sauces and gravies", "keywords": "baguette, chicken stock, pork butt, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 141, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "394 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bone-in pork butt (approximately 5 to 7 pounds)", "1 head garlic, broken into individual cloves and peeled", "Kosher salt", "Black pepper", "1 tablespoon fresh thyme, finely chopped, plus 1 teaspoon leaves", "2 teaspoons fresh rosemary, finely chopped", "3 celery stalks, roughly chopped", "1 carrot, roughly chopped", "1 onion, roughly chopped", "2 fresh bay leaves", "4 cups chicken stock", "1 cup white wine", "1/2 cup crushed tomatoes", "3 tablespoons unsalted butter", "3 tablespoons all-purpose flour", "Crusty rolls or baguette"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Using a small knife, make several incisions about 1/2 inch long and 1 inch deep all over the pork. Cut garlic cloves in half lengthwise and insert garlic pieces into each incision. Generously season pork all over with salt, pepper, chopped thyme and rosemary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place celery, carrot, onion and bay leaves in a large roasting pan. Lay pork butt on top, fat side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast pork for 30 minutes, then lower oven temperature to 300 degrees. Add chicken stock, wine and tomatoes to roasting pan. Continue to cook pork until internal temperature registers 190 degrees with an instant-read thermometer and meat is fork-tender, another 3 to 4 hours. If pork begins to brown too quickly, cover loosely with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer pork to a platter and allow to rest for at least 20 minutes. Using a fine sieve, strain cooking liquid. Skim off as much fat as you can and reserve liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a medium saucepan over medium heat. Whisk in flour and cook, stirring constantly until a light brown roux is formed, 7 to 8 minutes. Whisk in 4 cups of the drippings and cook, stirring constantly, until mixture is smooth and reaches the consistency of sauce, about 10 minutes. Season with thyme leaves, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pork is cool enough to handle, shred with a fork, then add it along with the sauce back to a large pan and reheat. Serve on crusty rolls or baguette, garnished as desired."}]}