{"@context": "http://schema.org", "@type": "Recipe", "name": "Red-Cooked Beef Short Ribs With Daikon", "description": "This technique, called red cooking, involves simmering meat with soy sauce, sugar and sweet aromatics like star anise and cinnamon. It happens in a wok, but instead of a quick high-heat stir-fry, it is a slow braise, more like a savory stew. Once the stew is assembled and simmering, it’s mostly a matter of waiting. Top off the liquid from time to time, but add only enough to barely cover the meat. The final step of cooking down the sauce intensifies the seasoning, accentuating the pungency of ginger and orange.  ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/10/30/dining/30KITCH_SPAN/30KITCH_SPAN-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "beef, daikon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "3 grams", "proteinContent": "28 grams", "saturatedFatContent": "13 grams", "sodiumContent": "665 milligrams", "sugarContent": "8 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["2 pounds boneless beef short ribs or chuck, cut in 1/2-inch strips", "Salt and pepper", "2 tablespoons soy sauce", "2 tablespoons Chinese sweet wine or sherry", "2 teaspoons grated ginger", "3 garlic cloves, minced", "1 cinnamon stick", "2 star anise ", "1/2 teaspoon Sichuan peppercorns", "2 small strips orange peel", "4 dry red chiles, available in Asian markets", "2 tablespoons vegetable oil", "2 tablespoons sugar", "2 teaspoons potato starch dissolved in 2 tablespoons cold water (optional)", "1 pound daikon radish, peeled and sliced 1/4-inch thick ", "1 teaspoon toasted sesame oil", "Cilantro sprigs", "1/4 cup slivered scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put meat in a medium saucepan, cover with cold water and bring to a boil over high heat. Reduce heat and simmer 2 to 3 minutes, skimming off any foam. Drain meat in colander, discarding liquid. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer meat to medium bowl and season lightly with salt. Add soy sauce, wine, ginger, garlic, cinnamon, star anise, Sichuan peppercorns, orange peel and chiles. Mix to coat and marinate 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1 tablespoon vegetable oil in a wok or skillet over medium-high heat. When oil is hot, add sugar and stir until beginning to brown, about 1 minute. Add marinated meat and stir-fry 2 minutes. Add 2 cups water and bring to boil. Cover, reduce heat and simmer until meat is tender, 40 minutes to an hour, adding water occasionally to keep meat barely covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prevent meat from overcooking, remove and set aside, then bring remaining cooking liquid to a rapid simmer over high heat and reduce to intensify color and flavor. (Or thicken sauce with potato starch.) Return meat to wok and coat with reduced sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 1 tablespoon vegetable oil in a separate pan over medium-high heat. Add daikon, season with salt and pepper, and stir-fry until crisp-tender, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put beef in a serving dish and arrange daikon on a platter. Drizzle both with sesame oil and garnish with cilantro sprigs and scallions."}]}