{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Tilefish With Garlic, Herbs and Lemon", "description": "All cooks needs a basic sautéed fish fillet recipe in their repertory, and this one could not be much simpler. It does require a step that may intimidate on first glance: you baste the fish with the fat you’re cooking it in. Don’t worry. Just use a good amount of fat in the pan, about a tablespoon per person (you could get away with a little less if you insist, or use half white wine and half fat). Basting helps cook the fish evenly and keeps it and moist. In this recipe, the fat is butter. As the fish cooks, the butter browns, taking on a nutty scent that is classic with seafood. Tilefish is specified but any firm fillet will do, from sea bass to grouper.\n", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/06/11/dining/dj-dinner/dj-dinner-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "garlic, lemon, tilefish, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 114}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 352, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "44 grams", "saturatedFatContent": "10 grams", "sodiumContent": "640 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["2 skinless tilefish or other sturdy, thick white fish fillets (about 7 to 8 ounces each), skins removed", "Kosher salt, to taste", "Black pepper, to taste", "2 1/2 tablespoons unsalted butter", "3 green garlic shoots or scallions, thinly sliced", "1 1/2 tablespoons finely chopped chives, mint, lovage and/or sorrel", "1 tablespoon minced lemon thyme or regular leaves", "2 teaspoons finely chopped tarragon, basil or marjoram", "Juice of 1/2 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove any remaining pin bones in the fish, pat dry, and season both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauté pan over medium heat, melt butter. Once butter has begun to foam, lay fish in pan. Add green garlic or scallions and a pinch of salt. Without disturbing the fish, tilt the pan toward you; using a spoon, ladle green garlic butter over fish. Continue basting fish for 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, gently flip fish. Reduce heat to low, cover pan and cook for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover pan, add herbs and continue basting fish with butter until it is just cooked through, another minute or two longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer fish to a serving platter or individual plates, pour pan sauce over the top, and pour lemon juice over everything. Season with more salt and black pepper if needed. Serve immediately."}]}