{"@context": "http://schema.org", "@type": "Recipe", "name": "Israeli Couscous and Spicy Herb Frittata", "description": "In Italy leftover pasta is often recycled into a frittata. I decided to do the same with some Israeli couscous that I had tossed with a spicy Yemeni herb and chili paste called zhoug that I found in Yotam Ottolenghi’s book “Jerusalem.” I liked the couscous with the chili paste better in this pretty frittata than I did on its own. You won’t use up all of the zhoug in the frittata but you will be glad to have the relish on hand to use as a condiment. Note that I do not cook my Israeli couscous in boiling water; I find that it becomes too mushy that way.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/03/health/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 6 as a main dish, 12 as a starter", "recipeCuisine": "mediterranean", "recipeCategory": "brunch, dinner, lunch", "keywords": "appetizer, main course, halal, healthy, kosher, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "246 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups, tightly packed, cilantro leaves and stems, coarsely chopped", "2 serrano chiles, coarsely chopped", "3/4 teaspoon cumin seeds, ground", "4 cloves, ground", "Scant 1/4 teaspoon cardamom seeds, ground", "1/8 teaspoon sugar", "1/4 to 1/2 teaspoon salt, to taste", "1 garlic clove, peeled, green shoot removed, crushed or chopped", "2 tablespoons extra virgin olive oil", "2 tablespoons water", "1 cup Israeli couscous", "Salt to taste", "6 eggs", "1/3 cup spicy herb paste", "1/4 cup thick Greek style yogurt", "Salt to taste (about 1/2 teaspoon)", "1 tablespoon extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the zhoug, place all of the ingredients except the olive oil and water in a mini-food processor or small food processor and pulse several times. Add the olive oil and water and pulse until you have a coarse paste. It should not be a purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To reconstitute the couscous, place in a medium size microwave-safe bowl and add salt to taste. Bring 1 1/2 cups water to a boil and pour over the couscous. Let sit for 30 minutes, until most of the liquid has been absorbed. Drain off excess water and place a plate over the bowl. Place in the microwave and microwave for 3 minutes. Carefully remove from the microwave – the bowl will be hot. Carefully remove the plate, taking care to avoid steam. Stir in 1/3 cup of the spicy herb paste. Taste, adjust salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Stir in salt to taste (I use about 1/2 teaspoon), the yogurt, and the couscous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium-high heat in a heavy 10-inch nonstick skillet. Hold your hand above it; it should feel hot. Drop a bit of egg into the pan and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. Once a few layers of egg have cooked during the first couple of minutes of cooking, turn the heat down to low, cover 10 minutes, shaking the pan gently every once in a while. From time to time remove the lid and loosen the bottom of the omelet with a wooden spatula, tilting the pan, so that the bottom doesn’t burn. It will however turn golden. The eggs should be just about set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Uncover the pan and place under the broiler, not too close to the heat, for 1 to 3 minutes, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly and puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking and allow it to cool for at least 5 minutes and for up to 15. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, at room temperature, or cold."}]}