{"@context": "http://schema.org", "@type": "Recipe", "name": "Rick Katz’s Brownies for Julia Child", "description": "In this unusual brownie recipe from the Boston pastry chef Rick Katz, half of the recipe’s eggs and sugar are mixed in with the chocolate, while the other half are beaten until they double in volume and are as light as sponge. Whipping the eggs creates the surprisingly creamy, soft and definitively fudgy texture.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2015/09/28/dining/28BROWNIES/28BROWNIES-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "18 brownies", "recipeCuisine": "", "recipeCategory": "", "keywords": "chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 246}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 274, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "9 grams", "sodiumContent": "145 milligrams", "sugarContent": "24 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour", "1 teaspoon salt", "2 sticks (8 ounces) unsalted butter, cut into 16 pieces", "4 ounces unsweetened chocolate, coarsely chopped", "2 ounces bittersweet chocolate, coarsely chopped", "2 cups sugar", "1 teaspoon pure vanilla extract", "4 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Getting ready: Center a rack in the oven and preheat the oven to 350 degrees. Put a 9-inch square baking pan (Pyrex is good for this) on a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the flour and salt together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a heatproof bowl over a saucepan of gently simmering water, put the butter in the bowl and top with the chopped chocolate. Stir frequently until the ingredients are just melted — you don’t want them to get so hot that the butter separates. Add 1 cup of the sugar and whisk gently just to incorporate it, then remove the bowl from the pan of water. Stir in the vanilla and transfer the warm chocolate to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the remaining 1 cup sugar into the bowl of a stand mixer or a medium bowl and, using a whisk, stir in the eggs. Switch to a rubber spatula and, little by little, add one half of the sugar-egg mixture to the warm chocolate, stirring very gently but without stopping — you don’t want the heat of the chocolate to cook the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the whisk attachment or with a hand mixer, beat the remaining sugar and eggs on medium-high speed for about 3 minutes, or until they double in volume. Using the spatula and a light touch, fold the whipped eggs into the chocolate mixture, stopping just short of blending them in completely. Sprinkle the dry ingredients over the batter and delicately fold them in, working only until they disappear. Scrape the batter into the pan and smooth the top with the spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 to 28 minutes, or until the top looks dry. Poke a thin knife into the center and take a peek: the brownies should be only just set and still pretty gooey. Transfer the pan to a rack and cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The brownies are fragile and best cut in the pan. Cut eighteen 1 1/2-x-3-inch bars."}]}