{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Cauliflower Gratin With Tomatoes and Goat Cheese", "description": "Roasting is one of my favorite ways to prepare cauliflower, and I have always loved preparations that pair the vegetable with coriander seeds. I use coriander seeds and cinnamon to season the tomato sauce that I toss with the roasted cauliflower and sautéed red onions, then add a couple of eggs beaten with goat cheese.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/23/health/23recipehealth/23recipehealth-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch", "keywords": "fall, winter, gluten-free, halal, healthy, kosher, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2314}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 179, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "547 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium-size head of cauliflower", "Salt and freshly ground pepper to taste", "3 tablespoons extra virgin olive oil", "1 small or 1/2 large red onion, cut in half or quarters (if using a whole onion) lengthwise, then sliced thin across the grain", "2 garlic cloves, minced", "1 teaspoon fresh thyme leaves", "1 (14 8/10-ounce) can chopped tomatoes in juice", "1/8 teaspoon cinnamon", "1/2 teaspoon coriander seeds, lightly toasted and coarsely ground", "2 eggs", "2 1/2 ounces soft goat cheese (about 1/2 cup plus 2 tablespoons)", "2 to 3 teaspoon chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Line a baking sheet with parchment or foil. Cut away the bottom of the cauliflower stem and trim off leaves. Cut cauliflower into 1/3 inch thick slices, letting the florets on the edges fall off. Toss all of it, including the bits that have fallen away, with 2 tablespoons of the olive oil, salt, and pepper. Place on baking sheet in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast for 15 to 20 minutes, stirring and flipping over the big slices after 8 minutes, until the slices are tender when pierced with a paring knife and the small florets are nicely browned. Remove from oven and cut large slices into smaller pieces. You should have about 2 cups. Transfer to a large bowl. Turn oven down to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a 1-1/2 to 2-quart baking dish or gratin. Heat remaining oil over medium heat in a medium-size skillet or a wide saucepan and add onion. Cook, stirring, until tender, about 5 minutes. Add a generous pinch of salt and the garlic and thyme and continue to cook, stirring, until garlic is fragrant, 30 seconds to a minute. Add tomatoes, cinnamon, ground coriander seeds, and salt and pepper to taste and bring to a simmer. Cook, stirring often, over medium-low heat, for 10 to 15 minutes, until the tomatoes have cooked down and the sauce is fragrant. Taste and adjust seasoning. Add to bowl with the cauliflower and stir everything together. Scrape into prepared baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 2 tablespoons of the goat cheese. Beat eggs, then add the remaining cheese and beat together until smooth. Pour over cauliflower mixture, making sure to scrape out every last bit with a rubber spatula. Dot top with small pieces of the remaining goat cheese and sprinkle on chives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 30 minutes, until top is beginning to brown in spots. Remove from oven and allow to sit for 5 to 10 minutes before serving."}]}