{"@context": "http://schema.org", "@type": "Recipe", "name": "Kolaches", "description": "", "author": {"@type": "Person", "name": "John T. Edge"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/kolaches/kolaches-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "12 kolaches", "recipeCuisine": "eastern european", "recipeCategory": "breakfast", "keywords": "all-purpose flour, cream cheese, dried fruit, dessert, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 435, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "13 grams", "sodiumContent": "288 milligrams", "sugarContent": "20 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/4 ounce (1 packet) dry yeast", "1 cup whole milk, lukewarm (110 to 115 degrees)", "1/4 cup granulated sugar", "3 cups all-purpose flour (about 420 grams), more for kneading", "12 tablespoons (1 1/2 sticks) unsalted butter", "2 large eggs", "1 teaspoon salt", "Vegetable oil, as needed", "1 cup dried apricots, prunes or other dried fruit", "2 tablespoons granulated sugar", "1/4 teaspoon ground cinnamon", "1/2 teaspoon finely grated lemon zest", "8 ounces cream cheese, softened", "1/4 cup granulated sugar", "3 tablespoons all-purpose flour", "1 large egg yolk", "1/2 teaspoon finely grated lemon zest", "2 tablespoons all-purpose flour", "2 tablespoons granulated sugar", "1 tablespoon unsalted butter", "1/8 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: In a large bowl, combine the yeast, milk, sugar and 1 cup flour. Mix well, cover and let rise until doubled in size, about 20 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 8 tablespoons (1 stick) of the butter. Pour into a large bowl and whisk in the eggs and salt. Add to the flour mixture and mix well. Slowly add the remaining 2 cups of flour; the dough will be soft and moist. Turn onto a floured surface and knead for 10 minutes, adding flour as necessary to make a soft workable dough. Place in an oiled bowl, cover and let rise until doubled in size, about 1 hour. Meanwhile, make your choice of filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dried-fruit filling: Place the fruit in a small saucepan and add 1/2 cup water or just enough to cover. Set aside until plumped and softened, about 1 hour. When the fruit is ready, add the sugar, cinnamon and lemon zest. Simmer over low heat for 15 minutes. Pur&eacute;e in a food processor or blender and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cream cheese filling: Using an electric mixer, beat together the cream cheese and sugar until fluffy. Add the flour, egg yolk and lemon zest. Mix to blend and set aside.\n\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the dough has risen, punch it down and divide evenly into 12 pieces. Roll the pieces into balls and place on an oiled baking sheet several inches apart. Flatten each ball slightly so it is about 3 inches in diameter. Cover and let rise for 30 minutes. Heat the oven to 375 degrees. Meanwhile, prepare the crumble topping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the topping: In a medium bowl, combine the flour, sugar, butter and cinnamon. Crumble with your fingers until the mixture resembles bread crumbs. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble and bake the kolaches: With your finger, gently make an indentation in the center of each bun, being careful not to flatten too much. Fill with 1 tablespoon of filling and sprinkle with topping. Bake until risen and pale gold, 12 to 15 minutes. While baking, melt the remaining 4 tablespoons butter. When the kolaches are removed from the oven, brush with melted butter and serve warm."}]}