{"@context": "http://schema.org", "@type": "Recipe", "name": "Irish Trifle", "description": "I call this Irish trifle because it was my Irish ex-in-laws who introduced me to this wonderful dish. It is one of the most irresistible desserts I make. I love to have leftovers because the cake just keeps soaking up that amazing custard sauce, which is spiked with sherry. I use up a few of the egg whites left over from making the crème anglaise in the cake, opting for a biscuit, in which the egg whites are beaten to a meringue, over a richer sponge cake. Although jam is traditional in this trifle, you could always top the cake with a berry compote instead.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/25/dining/25eggs4/25eggs4-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "brunch, lunch", "keywords": "cake, crème anglaise, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "recipeIngredient": ["1 tablespoon butter, softened, for greasing pan", "85 grams cake flour (scant 3/4 cup)", "14 grams cornstarch (1 1/2 tablespoons)", "120 grams eggs (2 extra-large eggs plus 1 tablespoon)", "150 grams sugar (2/3 cup), divided", "2 teaspoons vanilla extract", "85 grams egg whites (2 1/2 whites)", "Pinch of salt", "1 tablespoon butter, melted", "1/3 cup cream sherry, more to taste", "1/3 cup raspberry jam", "2 2/3 cups chilled crème anglaise (see <a href='http://www.nytimes.com/recipes/1015855/cr-and-egrave-me-anglaise.html'>recipe</a>)", "1 cup plus 1 tablespoon heavy cream", "Freshly grated nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Brush a 9-inch cake pan with softened butter and lightly flour sides. Lay pan on a sheet of parchment paper and trace around bottom of pan. Cut parchment round and place in pan with pencil marks facing down. Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift cake flour and cornstarch into a bowl or onto a sheet of parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of the stand mixer fitted with the paddle, combine 2 eggs, half the sugar and the vanilla. Mix at low speed for 30 seconds to combine. Turn mixer to highest speed and beat for 5 minutes, until mixture is light, pale and fluffy. Turn mixer down to medium and beat for 3 minutes. Scrape mixture out into a large bowl. Gently fold in half the flour mixture, then gently fold in remaining half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the stand mixer bowl thoroughly with soap and hot water, then dry. Add egg whites, remaining sugar and salt to bowl. Using the whisk attachment, beat at medium speed for 3 to 4 minutes, or long enough to obtain a soft, creamy meringue. Do not over-whip; you do not want a stiff and dry meringue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully fold half the egg white mixture into batter, along with melted butter. Carefully fold in remaining egg white mixture. Gently scrape into prepared cake pan. Put cake pan on a baking sheet and place in oven. Bake 30 minutes, until light golden brown and a tester comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and reverse onto a rack. Remove parchment paper and cool for 5 minutes, then flip cake over and let cool completely. Wrap tightly in plastic if not using right away. Cake can be made a few days ahead and refrigerated, or frozen for several weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the trifle: At least 6 hours, and no more than 24 hours, before you plan to serve trifle, spread top of cake with jam and cut into 2-inch squares. Line a flat wide bowl (preferably a trifle dish) with cake squares, in one layer. Douse cake with 2 to 4 tablespoons cream sherry, more if desired. Cover with parchment or plastic wrap , set a plate on top, and set a weight (such as a large can of tomatoes) on top of the plate. Cover and refrigerate for 4 hours or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover cake. Spike crème anglaise with a tablespoon or two of sherry if desired, and pour over cake. Chill for an hour or more in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, beat cream until it forms soft peaks, and flavor it with a spoonful of cream sherry if desired. Spoon over trifle. Dust with a very small amount of nutmeg and serve."}]}