{"@context": "http://schema.org", "@type": "Recipe", "name": "Bibimbap With Tuna, Sweet Potato, Broccoli Rabe or Kale, and Lettuce", "description": "I keep the tuna in one piece when I marinate it and cook it, then slice it after it’s seared so it won’t be overcooked. If you want to reduce the calories and carbs here, substitute winter squash or another vegetable of your choice for the sweet potatoes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/bimbaptuna/bimbaptuna-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "4 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, healthy, high fiber, low-sodium, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "recipeIngredient": ["12 ounces albacore tuna (usually 2 steaks)", "1 tablespoon soy sauce", "1 teaspoon brown sugar", "1 tablespoon sesame oil", "1 to 2 garlic cloves, to taste, minced or puréed", "1 tablespoon minced ginger", "2 scallions, finely chopped", "Freshly ground pepper to taste", "2 tablespoons rice vinegar", "1 tablespoon sesame oil", "2 large garlic cloves, minced or puréed", "2 to 3 scallions, minced", "1 tablespoon toasted sesame seeds", "Salt to taste", "Korean red pepper paste (kochujang) to taste (available at Korean markets)", "3/4 pound broccoli rabe, rinsed, thick stems trimmed away, or kale, stemmed and washed", "2 medium sweet potatoes, baked", "Soy sauce to taste", "1 tablespoon canola oil", "1 heart of romaine lettuce, cut crosswise in thin strips (chiffonade)", "1 1/2 to 2 cups brown rice, barley, quinoa or another grain of your choice, cooked (keep hot)", "4 eggs (optional)", "Korean red pepper paste (kochujang) to taste (available at Korean markets)", "2 sheets nori seaweed (kimgui), lightly toasted* and cut into thin strips (optional)", "2 teaspoons toasted sesame seeds or black sesame seeds", "Toast nori sheets (if not toasted already) by quickly passing them over a gas flame (hold with tongs), until crisp."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the tuna. Mix together the soy sauce, sesame oil, garlic, ginger, scallions and pepper. Lay the tuna steaks in the marinade, turn over, cover and refrigerate for 30 minutes, turning the fish over every so often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the rice vinegar, sesame oil, garlic, scallions, sesame seeds, chili paste and salt to taste in a small bowl or measuring cup. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish is marinating, blanch the broccoli rabe or kale. Bring a medium pot of water to a boil, add salt to taste, and blanch the broccoli rabe or kale for 2 to 3 minutes, until just tender. Transfer to a bowl of cold water, drain and squeeze out excess water.  Remove from the heat and toss in a bowl with 1 tablespoon of the vinegar and sesame oil mixture. Add salt or soy sauce to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the baked sweet potato into thick slices. Peel if desired. Keep warm. Toss the shredded romaine with 1 tablespoon of the vinegar-sesame mixture (or more to taste)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok or large, heavy skillet over medium-high heat until a drop of water evaporates immediately on contact. Add the canola oil. Sear the tuna for 2 to 3 minutes on each side, depending on how rare or cooked you like it. Remove to a plate. Cut in thin slices across the grain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the eggs in the hot pan (or in a separate nonstick skillet) until the whites are set and the yolks are still runny. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 4 wide soup bowls. Place a mound of hot grains in the middle of each one and surround with the sliced tuna and vegetables, as well as kimchi if desired, each ingredient in its own little pile. Place a fried egg and a small spoonful of chili paste on top of the rice and garnish with the toasted nori and sesame seeds. Serve at once. Diners should break the egg into the rice. Pass the chili paste and add more as desired."}]}