{"@context": "http://schema.org", "@type": "Recipe", "name": "Savory Waffles", "description": "“One thing my kids really love,” says Chef Linton Hopkins, “is when it’s raining outside at lunchtime and we make a batch of savory waffles. Instead of sugar and syrup, we just fold in Parmesan and Gruyère, if I have some sitting in the refrigerator, and salt and pepper. We have a waffle iron that has shapes of animals and a barn, so I ask my kids, ‘Do you want to be the pig today? Or the chicken? Or have a cow?’?” Try adding herbs and other seasonal produce, like pumpkin puree, to the batter instead of cheese. In the springtime you can add sautéed and chopped asparagus to the batter.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2011/10/17/health/Well_veggie_asparagus/Well_veggie_asparagus-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "recipeIngredient": ["2 cups waffle and pancake mix", "2 eggs", "2 cups milk", "2 tablespoons vegetable oil", "Salt and pepper", "3/4 cup grated rennet-free Parmesan cheese", "1/2 cup grated rennet-free Gruyère or similar cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 200 degrees and place a waiting plate to warm inside. Heat a waffle maker until a flick of water beads and bounces around."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, add waffle mix, eggs, milk, oil, salt and pepper, and mix until just combined, adding more milk if the mix is too thick. It should be the consistency of pudding. Then fold in the cheeses."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter the waffle maker, and spoon judicious dollops of the mix onto the center of the hot waffle iron and spread just a bit. The mix will spread when the lid closes and expand as it cooks, so adding too much will be a bit messy as it bubbles out the sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the waffles finish, use a fork to lift them off and put them in the oven to stay warm while the rest are made. Waffles are best served warm. Freeze any leftover waffles to enjoy later."}]}