{"@context": "http://schema.org", "@type": "Recipe", "name": "Chestnut Honey Squares", "description": "The inspiration for this foolproof recipe came from the Paris bakery Moulin de la Vierge. These honey-kissed squares can be made ahead, do not require exotic equipment, are relatively simple (you pat the crust in the pan) and are beautiful, with a glistening glaze. Stored in an airtight container, they stay fresh for days. ", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": "https://static01.nyt.com/images/2013/12/18/dining/18HONEYSQUARES_SPAN/18HONEYSQUARES-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "32 squares", "recipeCuisine": "", "recipeCategory": "", "keywords": "almonds, honey, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 87, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "2 grams", "sodiumContent": "37 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["120 grams (3/4 cup) unbleached all-purpose flour \n", "45 grams (1/2 cup) almond meal (see note) \n", "35 grams (3 tablespoons) sugar, preferably unrefined vanilla sugar (see note)\n", "1/2 teaspoon salt, preferably fine sea salt \n", "6 tablespoons unsalted butter, chilled and cut into cubes\n", "1 large egg yolk \n", "1/2 teaspoon pure vanilla extract\n", "4 tablespoons unsalted butter\n", "80 grams (1 cup) sliced almonds\n", "30 grams (1/3 cup) candied orange or lemon peel, cut into tiny cubes\n", "65 grams (1/3 cup) sugar, preferably vanilla sugar \n", "2 tablespoons chestnut honey or other intensely flavored honey\n", "1/2 teaspoon vanilla extract\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Line a 9 1/2-inch-square baking pan with parchment, letting it hang over the sides for easier removal later. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastry: In a food processor, combine flour, almond meal, sugar and salt. Pulse to blend. Add the butter and pulse until the mixture resembles coarse crumbs. Add egg yolk, vanilla and 1 tablespoon of water. Pulse to incorporate. Add 2 to 3 tablespoons of water through the feed tube, tablespoon by tablespoon, pulsing until just before the pastry forms a ball. You may not need all the water. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out into the prepared baking pan. Press the dough evenly into the bottom of the pan. Place in the oven on the center rack and bake until the pastry begins to brown around the edges, 12 to 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pastry is baking, prepare the topping: In a saucepan, melt the butter over low heat. Add the almonds, candied peel, sugar, honey and vanilla extract. Heat just until the ingredients are incorporated. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan and spread the almond-honey mixture evenly over the pastry. Return the pan to the oven and bake until the topping is a deep gold, 12 to 15 minutes. Remove and transfer to a rack to cool in the pan. Once it has cooled, remove from the pan and cut into 32 squares. Store in an airtight container at room temperature for up to 3 days."}]}