{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Grilled Chicken With Lemon", "description": "The secret to grilling chicken is a combination of low heat, indirect grilling (in which the food is set off from, not over, the coals), and a final blast of hot, direct heat.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "poultry, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 13}, "recipeIngredient": ["1 chicken, cut into 8 or 10 pieces", "Juice of a lemon", "Salt and pepper", "Chipotle peach salsa, optional (see recipe)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal, wood or gas fire in a grill big enough to bank coals to one side once they get hot. With a gas grill, turn heat to high on one side and leave other side off; if there are three burners, you can set the two side ones to medium or even low and cook in the middle. When grill is hot, put chicken on least hot part, skin-side up, and cover grill. Let chicken cook for about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When bottom of chicken is lightly seared and meat is beginning to look cooked, turn meat over in the same part of grill. Cover again and check after about 10 minutes. When skin is lightly browned, turn again. Continue to cook in the least hot part of grill until chicken looks close to done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point, you can set chicken aside for a couple of hours, if you wish. When ready to serve, move chicken to hot side of grill. With a gas grill, simply ignite the burner that is under chicken. Cook attentively, turning chicken until it is brown and crisp all over, 5 to 10 minutes. Serve hot, warm or at room temperature; just before serving, drizzle with lemon juice and sprinkle with salt and lots of pepper. Serve, if you like, with chipotle-peach salsa."}]}