{"@context": "http://schema.org", "@type": "Recipe", "name": "Thumbprint Cookies With Toasted Nuts and Whole Grains", "description": "You can use any type of toasted nut or whole-grain flour in this recipe, generating infinite possibilities. Cashews, pumpkin seeds, pistachios, hazelnuts; barley, brown rice or oat flour; any jam you like. We chose pecans and rye flour, aiming at a cookie with a little salt and tang.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/12/07/dining/07COOKING-THUMBPRINTCOOKIES2/07COOKING-THUMBPRINTCOOKIES2-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "About 4 dozen cookies", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, pecans, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 84}, "recipeIngredient": ["1 1/2 cups pecans (6 1/2 ounces)", "1 1/2 cups dark rye flour (6 1/2 ounces)", "2/3 cup granulated sugar (4 1/2 ounces)", "1/4 teaspoon fine sea salt", "9 tablespoons unsalted butter, cut into pieces and softened at room temperature", "Jam, marmalade or lemon curd, for filling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread pecans on a baking sheet and toast until golden, 8 to 10 minutes. Remove from oven and let cool completely. Line two baking sheets with parchment paper or nonstick baking mats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor fitted with the metal blade, combine nuts, flour, sugar and salt and pulse until very finely ground, about 1 minute. Transfer to a large bowl and add butter by hand, a few pieces at a time, massaging butter into dry ingredients until it forms a shaggy dough. (If dough seems dry and is not coming together, work in water, 1 tablespoon at a time, until it does.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a lightly floured work surface and bring it together with your hands. Have a bowl of warm water at hand nearby. Divide dough in half, dip your hands in water and roll each lump into a thin log, about 15 inches long and 1/2 inch across. Cut each log into 1/2-inch slices and roll each slice into a ball, dipping hands in water as needed to prevent dough from sticking. Transfer balls to prepared pans, spacing them about 1/2 inch apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your pinkie or the rounded end of a small wooden spoon, press into the top of each ball to make a well. As you press, use your other hand to hold the ball and shape it around the finger or handle into a small, flat-bottomed cup. The goal is to give the dough an even thickness throughout the cookie. Place pans in refrigerator and chill cookies for at least 30 minutes or up to 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cookies for 10 to 12 minutes, rotating baking sheets halfway through to ensure even browning, until cookies are golden around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove baking sheets from oven and let cookies cool completely. (The recipe can be made up to this point 3 days ahead and stored in an airtight container.) When ready to serve (up to 8 hours ahead of time), use a pastry bag or a small spoon to fill each well with jam, marmalade or preserves."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Recipe Lab | Thumbprint Cookies", "description": "With this recipe, you can use any nut or whole-grain flour to make a truly modern Christmas cookie.", "thumbnailUrl": "https://static01.nyt.com/images/2015/12/07/dining/07COOKING-THUMBPRINTCOOKIES2/07COOKING-THUMBPRINTCOOKIES2-mediumThreeByTwo440.jpg", "uploadDate": "2013-12-12T16:41:03.000Z", "duration": "PT1M17S"}}