{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Pecan Pie", "description": "Here is a pie that might make Thanksgiving purists shake their heads. Chocolate and pecan? But bear with us. The bittersweet chocolate adds depth to what is traditionally an achingly sweet pie, and the bourbon gives it a grownup finish. For detailed instructions on pie crust, check out our <a href=\"http://cooking.nytimes.com/guides/how-to-make-pie-crust\">pie guide.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/11/19/dining/chocolatepecanpie/chocolatepecanpie-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "chocolate, pecans, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 881}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 634, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "18 grams", "sodiumContent": "237 milligrams", "sugarContent": "41 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups all-purpose flour (150 grams), plus more for dusting", "1/4 teaspoon fine sea salt", "10 tablespoons unsalted butter, preferably high-fat, European style, chilled and cubed", "2 to 4 tablespoons ice water, as needed", "1 1/2 cups pecan halves (170 grams)", "6 tablespoons unsalted butter", "2 ounces bittersweet chocolate, chopped (56 grams)", "3/4 cup dark corn syrup", "4 large eggs", "1/2 cup packed light brown sugar (100 grams)", "1 tablespoon unsweetened cocoa powder (5 grams)", "2 tablespoons bourbon", "1/4 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a food processor, pulse together the flour and salt. Add butter and pulse until the mixture forms chickpea-size pieces. Add ice water, 1 tablespoon at a time, and pulse until the dough just comes together. It should be moist but not wet. On a lightly floured surface, gather the dough into a ball. Flatten into a disk with the heel of your hand. Cover tightly with plastic wrap and refrigerate for at least 1 hour and up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, after removing plastic wrap, roll out dough to a 12-inch circle. Transfer crust to a 9-inch pie plate. Fold over any excess dough, then crimp edges. Prick crust all over with a fork. Chill crust for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough chills, heat the oven to 375 degrees. Line chilled crust with aluminum foil and fill with pie weights or dried beans. Bake for 25 minutes. Remove foil and bake until very pale golden, 5 to 10 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce oven temperature to 350 degrees. Spread pecans on a rimmed baking sheet. Toast nuts, shaking pan occasionally, until fragrant, 8 to 10 minutes. Cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a small saucepan over low heat, melt butter and chopped chocolate, stirring until smooth; cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together cooled chocolate-butter mixture, corn syrup, eggs, sugar, cocoa powder, bourbon and salt. Pour the mixture into the prepared crust. Arrange pecans over filling. Transfer to a large rimmed baking sheet. Bake until the filling is just set when the pan is jiggled, 30 to 40 minutes. Remove pie from the oven and cool completely on a wire rack before serving."}]}