{"@context": "http://schema.org", "@type": "Recipe", "name": "Perciatelli With Broccoli, Tomatoes and Anchovies", "description": "This Southern Italian pasta is inspired by a dish that calls for the light green cauliflower used in Sicily. I love the mix of broccoli, anchovies and olives set off by the sweetness of the currants, but since my son doesn’t like currants or raisins, I’ve made them optional.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/09/30/science/30recipehealth/30recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, pastas", "keywords": "broccoli, pasta, tomato, fall, summer, halal, healthy, high fiber, kosher, low cholesterol, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 490, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "77 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "8 grams", "proteinContent": "20 grams", "saturatedFatContent": "3 grams", "sodiumContent": "792 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup golden raisins or currants (optional)", "1 pound baby broccoli", "Salt to taste", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "2 anchovy fillets, rinsed and chopped", "2 teaspoons fresh thyme leaves", "1 pound tomatoes, grated, or 1 14-ounce can chopped tomatoes, with juice", "8 imported black olives, pitted and chopped", "Freshly ground pepper to taste", "3/4 pound perciatelli (also sold as bucatini) or spaghetti", "2 to 4 tablespoons grated pecorino or Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the raisins in a small bowl and cover with warm water. Let sit for 20 \nminutes while you prepare the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, salt generously and add the baby broccoli. Blanch for 4 minutes and, using a skimmer or tongs, transfer to a bowl of cold water. Drain and shake out excess water. If the stems are thick and hard, peel. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy skillet and add the garlic. Cook, stirring, until it smells fragrant, about 30 seconds to a minute, and add the anchovies, thyme and tomatoes. Turn the heat down to medium-low and cook, stirring often, until the tomatoes have cooked down and smell fragrant, about 10 minutes. Stir in the olives. Drain the raisins or currants and add, along with the broccoli and about 1/4 cup of the cooking water from the broccoli. Season to taste with salt and pepper. Cover, turn the heat to low and simmer 5 to 10 minutes, stirring occasionally, until the broccoli is very tender and the sauce is fragrant. Keep warm while you cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water back to a boil and cook the pasta al dente, following the timing\ninstructions on the package. Check the sauce and if it seems dry add another 1/4 to 1/2 cup of the pasta cooking water. Drain the pasta and transfer to the pan with the sauce. Toss together and serve, sprinkled with pecorino or Parmesan. If desired, drizzle a little olive oil over each serving."}]}