{"@context": "http://schema.org", "@type": "Recipe", "name": "Frittata With Red Peppers and Peas", "description": "This is one of the best destinations I can think of for frozen peas, and reason enough to have a bag on hand in your freezer at all times. Red peppers keep very well in the refrigerator, and you can also use jarred red peppers for this if you don’t have a fresh one on hand. The frittata looks beautiful on a buffet.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/07/31/health/nutrition/31fritta.recipe.ready/31fritta.recipe.ready-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, lunch, weekday", "keywords": "appetizer, main course, eggs, frozen peas, red bell pepper, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 106}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 217, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "4 grams", "sodiumContent": "454 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "2 bunches scallions, trimmed and cut in thin slices", "1 large red bell pepper, seeded and diced", "1 to 2 plump garlic cloves (to taste), minced", "Salt and freshly ground pepper", "1 cup frozen peas, thawed (you can do this by covering with boiling water for 10 minutes, then draining)", "10 large or extra-large eggs", "3 tablespoons low-fat milk", "2 tablespoons minced flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the olive oil in a 12-inch nonstick frying pan over medium heat and add the scallions and red pepper*. Cook, stirring often, until the scallions are tender and the red pepper beginning to soften. Add the garlic, salt (about 1/2 teaspoon), and a few twists of the pepper mill, and continue to cook until the pepper is tender, another 3 to 5 minutes. Stir often. Remove from the heat and scrape into a bowl. Rinse and dry the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Stir in 1/2 teaspoon salt, some freshly ground pepper, the milk, peas, parsley, and the cooked scallions and red pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining olive oil over medium-high heat in the 12-inch nonstick skillet. Hold your hand above it; it should feel hot. Drop a bit of egg into the pan and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to low, cover (use a pizza pan if you don’t have a lid that will fit your skillet), and cook 10 minutes. From time to time remove the lid and loosen the bottom of the frittata with a wooden spatula, tilting the pan, so that the bottom doesn’t burn. It will however turn a deep golden brown. The eggs should be just about set; cook a few minutes longer if they’re not. Meanwhile, light the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the frittata under the broiler for 1 to 3 minutes, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly, and it will puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking, and allow it to cool for at least 5 minutes and for up to 15. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve warm, at room temperature, or cold."}]}