{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread Cookies", "description": "These traditional cookies came to The Times by way of Jennifer Steinhauer in an article about her grandmother's beloved Christmas cookie recipes. Isabelle Steinhauer would bake between “15 and 20 varieties each season: cream cheese wreaths shot from a cookie press; papery wafers carefully dipped in colored sugar; elaborate cutout cookies of nursery rhyme characters, their eyes fashioned from metallic dragées that the F.D.A. has written off as inedible; all manner of confections with nuts.” There's nothing fancy about these gingerbread cookies, but they are tender, gently spiced (feel free to add more to taste) and completely wonderful with a glass of cold milk. If you don't like using shortening, some readers have had good luck using half solid coconut oil and half softened butter instead.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2018/11/20/dining/gingerbread-cookies/gingerbread-cookies-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 dozen cookies", "recipeCuisine": "", "recipeCategory": "brunch, easy, lunch", "keywords": "cinnamon, clove, ginger, gingerbread, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 677}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 149, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "132 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup light brown sugar", "1 cup light molasses", "1 cup vegetable shortening", "1 tablespoon baking soda", "1 egg, lightly beaten", "1/4 teaspoon salt", "2 teaspoons baking powder", "1 tablespoon ground ginger", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground cloves", "4 to 4 1/2 cups all-purpose flour, more for rolling dough", "Royal icing and cinnamon candies, for decorating, optional."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine brown sugar, molasses and shortening. Place over medium-low heat and stir just until mixture is melted and smooth. Remove from heat and mix in baking soda and 1/4 cup cold water. Set aside and allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add egg, salt, baking powder, ginger, cinnamon and cloves; stir to mix well. Add 4 cups flour and mix well, adding up to 1/2 cup more if dough seems sticky. Shape into a ball, cover and refrigerate for at least 2 hours, up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Line baking sheets with parchment paper and set aside. On a lightly floured surface, roll out dough to 1/4-inch thickness, and cut into gingerbread boy shapes with a 5-inch-long cookie cutter. Arrange on baking sheets 1 1/2 inches apart, and bake until risen and no longer shiny, about 10 minutes. Remove from heat and allow cookies to cool. If desired, decorate with royal icing and cinnamon candies. Store in an airtight container."}]}