{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana Pudding With Pistachio Crumble", "description": "This banana pudding is not the usual vanilla-wafer-topped affair, and it doesn’t come from the South. It came to The Times in 2013 from Fedora, a restaurant in Manhattan, and it is divine: a rich, creamy custard fragrant with puréed ripe banana, topped  with lightly salted, crisp crumbles of pistachio butter cookie. It is also irresistible — sweet, creamy, salty, crunchy — and all too easy to lap up. The pudding and crumble can be made entirely in advance (up to three days), though don’t sprinkle the crumbs over the top until you're ready to serve. You want to maintain the crunch for as long as possible, and once the cookie meets the pudding, the countdown begins. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/03/18/dining/DJ-clark/DJ-clark-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "banana, pistachio, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 74}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 978, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "108 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "4 grams", "proteinContent": "13 grams", "saturatedFatContent": "32 grams", "sodiumContent": "396 milligrams", "sugarContent": "68 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 large very ripe (lightly speckled) bananas, peeled", "3 cups whole milk", "1 cup heavy cream", "300 grams sugar (about 1 1/2 cups)", "60 grams cornstarch (about 1/2 cup)", "1 vanilla bean, split lengthwise, seeds scraped", "4 grams kosher salt (about 1 teaspoon)", "6 large egg yolks", "15 tablespoons unsalted butter", "70 grams pistachios (about 1/2 cup)", "155 grams all-purpose flour (about 1 1/4 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion or standard blender, purée bananas until very smooth. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot set over medium heat, combine milk, cream, 150 grams (3/4 cup) sugar, cornstarch, vanilla bean and seeds, and 2 grams (1/2 teaspoon) salt, and cook, whisking, until liquid comes to a simmer and begins to thicken. Take the pot off the heat and whisk in banana purée, egg yolks and 3 tablespoons butter. Return pot to the heat and bring the mixture back to a simmer, whisking constantly. Cook for another 3 to 5 minutes, until thick. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pudding to a bowl set in a larger bowl filled with ice water and whisk for 5 or until the pudding is cool to touch. Discard vanilla bean, divide the pudding in serving bowls, cover and refrigerate for at least 3 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the crumble. Heat oven to 350 degrees and line a baking sheet with parchment paper. In a small saucepan set over medium heat, melt the remaining 12 tablespoons (1 1/2 sticks) butter and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse the pistachios a few times until roughly chopped. Add the flour, remaining 150 grams (3/4 cup) sugar, and remaining 2 grams (1/2 teaspoon) salt, and pulse until the ingredients are just combined. Add the melted butter and pulse a few times until the mixture forms pea-sized crumbs. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the crumbs to the prepared baking sheet. Bake until crumble starts to brown at the edges, about 15 minutes. Remove pan from the oven and using a flat spatula, flip the crumble over, piece by piece, so that the browned side is now on the bottom. The pieces will break apart; this is O.K. Bake for another 8 to 10 minutes, or until the crumble is golden-brown and very crisp. Transfer to a rack and let cool completely before breaking apart into crumbs. Serve crumble sprinkled over the banana pudding. (You will have extra crumble.)"}]}