{"@context": "http://schema.org", "@type": "Recipe", "name": "Grits Cakes With Country Ham and Bourbon Mayonnaise", "description": "As my friend Karen always says, “You know it’s going to be a good party if the host is deep-frying something when you arrive.” If you agree, consider serving these crisp-edged, golden grits cakes topped with bourbon mayonnaise and country ham at your next holiday shindig. These golden cubes, from the chef Kyle Knall at Maysville restaurant, can be prepared ahead of time, except for the frying part, which should be done within 20 minutes of serving. Southern country ham is worth seeking out, but if you can’t find it and didn’t have time to mail-order it ahead, you can substitute a good Serrano ham or prosciutto. Either way, it’s party food at its best.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/12/25/dining/25TAKEAWAY_SPAN/25TAKEAWAY_SPAN-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "12 servings", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "appetizer, country ham, grits", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 85}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 203, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "32 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large egg yolk, at room temperature", "1 1/2 teaspoons Dijon mustard", "Juice of 1/2 lemon", "1 cup grapeseed oil, more for frying", "2 teaspoons bourbon", "1 teaspoon salt, more for mayonnaise", "1/4 teaspoon black pepper, more for mayonnaise", "2 cups milk", "4 tablespoons unsalted butter", "1 teaspoon hot sauce, such as Tabasco", "1 cup coarse corn grits", "All-purpose flour, as needed", "Sliced country ham, torn into thin slivers, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mayonnaise: In a small bowl, whisk together egg yolk, mustard and lemon juice. Whisking constantly, drizzle in 1 cup grapeseed oil in a slow, steady stream until emulsified and fluffy. Whisk in the bourbon and season with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the grits: In a medium pot over medium-high heat, combine milk, 2 cups water, butter, hot sauce, 1 teaspoon salt, and 1/4 teaspoon pepper. Bring to a boil; slowly whisk in grits and lower heat to a simmer. Cook until grits are very tender, about 1 1/2 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the hot grits evenly into a 9-inch baking pan (the grits should be about 1 inch in thickness). Cool completely and cut into 1-inch squares. Toss each square lightly with flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large skillet with 1/2-inch grapeseed oil and place over medium heat. You will know oil is hot enough if a drop of water splashed into the pan sizzles. Fry the grits squares until golden and crisp all over, about 2 minutes per side. Drain on a plate lined with paper towel. Serve each topped with a sliver of country ham and a dollop of mayonnaise."}]}