{"@context": "http://schema.org", "@type": "Recipe", "name": "Falafel", "description": "You shouldn’t reject deep-frying at home; I do it about once a month. It can be fast and easy, and you can deep-fry plants. (And anything else.)\n\nFrying is thought of as messy, but this can be mitigated by the simplest of measures: using a pot that is heavy, broad and deep, like a well-made stockpot. Choose this, add a fair amount of oil, and the process is simplified and neat.\n\nAdd your food in batches and don’t crowd; you do not want the temperature to plummet, nor do you want the pieces of food nestling against one another. (Though it’s fine if they bump.) You may or may not have to turn the pieces, but that’s easy, because they’ll be floating and they won’t stick. Remove them with a slotted spoon, tongs or spider; you’ll know when they’re done because the color will be evenly gorgeous.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2013/10/23/dining/23JPFLEX2/23JPFLEX2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch", "keywords": "appetizer, side dish, chickpea", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 599}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 243, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "8 grams", "proteinContent": "12 grams", "saturatedFatContent": "0 grams", "sodiumContent": "179 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3/4 cups dried chickpeas or 1 cup dried chickpeas plus 3/4 cup dried split fava beans", "2 cloves garlic, lightly crushed", "1/2 onion, quartered", "1 teaspoon ground coriander", "1 tablespoon ground cumin", "Scant teaspoon cayenne, or to taste; or mild chile powder to taste", "1/2 cup chopped fresh parsley or cilantro leaves", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper, or to taste", "1/2 teaspoon baking soda", "1 tablespoon freshly squeezed lemon juice, or more to taste", "Neutral oil, like grapeseed or canola, for deep-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put beans in a large bowl and cover with water by 3 to 4 inches — they will triple in volume as they soak. Soak for 24 hours, checking once or twice to see if you need to add water to keep the beans covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain beans well and transfer to a food processor with all the remaining ingredients except the oil; pulse until minced but not puréed; add water tablespoon by tablespoon if necessary to allow the machine to do its work, but keep the mixture as dry as possible. (Too much water and your falafel will fall apart. If that happens, add more ground beans.) Taste and adjust seasoning, adding more salt, pepper, cayenne or a little more lemon juice as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put at least 2 to 3 inches of oil (more is better) in a large deep saucepan (the narrower the pan, the less oil you need; but the more oil you use, the more you can cook at one time). Turn heat to medium high and heat oil to about 350 (a pinch of batter will sizzle immediately; a piece of falafel will sink halfway to the bottom, then rise)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop out heaping tablespoons of the mixture and shape it into balls or small patties. Fry in batches, without crowding, until nicely browned, turning as necessary; total cooking time per batch will be less than 5 minutes. Serve hot or at room temperature."}]}