{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Dreams", "description": "Lynn House, most recently of the Chicago bar Blackbird, drew on her Southern background for this rich cocktail.  “One of my greatest memories as a child was making pies with my grandmother for the holidays,” she said. “There would be apple, pecan, pumpkin and, of course, sweet potato pies.” To her beloved sweet potatoes, Ms. House adds rum, maple syrup, cream and cinnamon. “Adding the whole egg to the cocktail turns it into a flip, which is a very traditional holiday drink,” she said. The result is a creamy and comforting dessert drink, with an almost puddinglike texture.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2013/12/06/dining/video-holiday-drinks-potato/video-holiday-drinks-potato-mediumThreeByTwo440.jpg", "totalTime": "PT10M", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "quick, cocktails", "keywords": "rum, sweet potato, winter", "aggregateRating": null, "recipeIngredient": ["1 8-ounce can diced sweet potatoes in light syrup", "2 ounces spiced rum", "1 egg", "1/2 ounce maple syrup, preferably grade B", "Whipped cream, slightly sweetened", "1 cinnamon stick, or pinch ground cinnamon, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty the can of sweet potatoes, including syrup, into a blender. Purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a cocktail shaker, combine 2 heaping teaspoons of the purée with the rum, egg and maple syrup. Shake vigorously without ice. Half-fill shaker with ice and shake again. Strain mixture into a cocktail glass or coupe. Top with a dollop of whipped cream. Grate cinnamon stick over the top, or dust with ground cinnamon."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Sweet Potato Dreams", "description": "Lynn House of Chicago created a eggnog-inspired cocktail with the addition of sweet potatoes.", "thumbnailUrl": "https://static01.nyt.com/images/2013/12/06/dining/video-holiday-drinks-potato/video-holiday-drinks-potato-mediumThreeByTwo440.jpg", "uploadDate": "2013-12-09T15:41:13.000Z", "duration": "PT1M23S"}}