{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Almonds", "description": "Watch the nuts carefully during toasting as they go from golden and fragrant to burnt very quickly. The almonds can be stored in an airtight container at room temperature for up to a week.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2010/11/10/health/10well_almonds/10well_almonds-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 cups", "recipeCuisine": "", "recipeCategory": "", "keywords": "almond, appetizer, dairy-free, gluten-free, kosher, vegan, vegetarian, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "recipeIngredient": ["2 tablespoons sugar", "1 teaspoon salt", "1/2 teaspoon ground cinnamon", "1/4 teaspoon pepper", "1/8 teaspoon ground cloves", "1/8 teaspoon ground allspice", "2 cups raw whole almonds", "1 tablespoon canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust an oven rack to the middle position and preheat the oven to 350 degrees Fahrenheit. Mix all the spices together. In a large bowl, toss the nuts with the oil, then toss with the spice mixture to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the nuts out over a rimmed baking sheet. Toast, stirring often, until the nuts are fragrant and lightly browned, 10 to 15 minutes. Let the nuts cool completely on the baking sheet before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For Orange-Fennel Almonds: Mix 1 teaspoon grated orange zest, 1 teaspoon fennel seeds, 1 teaspoon salt, and 1/4 teaspoon pepper together. Substitute the orange zest mixture for the spice mixture and 1 tablespoon olive oil for the canola oil. Before serving, toss the nuts with 1 teaspoon more grated orange zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For Spicy Chipotle Almonds: Mix 1 teaspoon ground cumin, 1 teaspoon salt, 3/4 teaspoon chipotle chile powder, 1/2 teaspoon garlic powder and 1/4 teaspoon pepper together. Substitute the cumin mixture for the spice mixture and 1 tablespoon olive oil for the canola oil."}]}