{"@context": "http://schema.org", "@type": "Recipe", "name": "Danny Bowien's Pastrami", "description": "I grew up in Oklahoma City, where barbecue and smoked meats are pretty much a prerequisite for family gatherings. And yet, like many families, <a href=\"http://cooking.nytimes.com/thanksgiving\">Thanksgiving</a> around my house included the traditional turkey and ham, which got a little boring. Pastrami brings something different to the table. The idea is to keep the prep simple; the meat takes a long time to cook, but once you have it in the oven or smoker, you don’t have to attend to it. It easily feeds a large crowd and, since it isn’t your typical Thanksgiving centerpiece, it will be a conversation starter. Serve it with plenty of hot mustard.", "author": {"@type": "Person", "name": "Danny Bowien"}, "image": "https://static01.nyt.com/images/2013/11/12/dining/video-bittman-bowien/video-bittman-bowien-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "15 to 20 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "main course, pastrami", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 133}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 209, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "14 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1855 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 5- to 8-pound point-cut corned beef (either red or gray)", "1 cup spicy brown mustard", "1/2 cup Asian fish sauce", "1/2 cup salt", "1/2 cup ground black pepper", "1/2 cup brown sugar", "Pickled mustard condiment, for serving <a href=\"http://cooking.nytimes.com/recipes/1015718-pickled-mustard-condiment\">(see recipe) </a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Two nights before serving, place the corned beef in a large pot and cover with water. Refrigerate and soak for 24 hours, changing the water every four hours if possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before serving, in a small bowl, mix the spicy brown mustard and fish sauce, and rub all over the meat. In another bowl, mix the salt, pepper and brown sugar. Sprinkle evenly all over the meat; do not rub it in. Place the meat on a rack placed over a baking sheet, and refrigerate uncovered for about 12 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Very early in the morning, remove the meat from the refrigerator and allow to rest for 1 hour to come to room temperature. Meanwhile, heat an oven to 200 degrees; or if you have a smoker, set it to 212 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill or large grill pan until very hot, about 10 minutes; if using an indoor grill or pan, make sure the room is well ventilated. Place the meat on the grill or pan fat side down, and allow it to sear on one side for 2 minutes. Continue turning and searing on each side — including the ends — for 2 minutes a side. Repeat for a second searing on each side; the meat should have a hard sear with grill marks. (If you are using a smoker, there’s no need to sear the meat first.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the meat well in aluminum foil and place in a shallow baking dish. Bake for 12 hours; the finished meat should jiggle. (If you are using a smoker, do not wrap the meat in foil. Smoke for about 10 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the foil from the meat and raise the oven temperature to 400 degrees. When the oven is heated, return the meat to the oven and allow to roast until the crust is blackened and firm but still gives to the touch, 3 to 5 minutes. Remove from the heat and allow to rest for 10 minutes. Slice and serve with the pickled mustard condiment spooned on the side."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Danny Bowien’s Thanksgiving Pastrami", "description": "Hanukkah and Thanksgiving coincide this year, so the chef Danny Bowien of Mission Chinese Food and Mark Bittman demonstrate how to make holiday pastrami, no smoker necessary.", "thumbnailUrl": "https://static01.nyt.com/images/2013/11/12/dining/video-bittman-bowien/video-bittman-bowien-mediumThreeByTwo440.jpg", "uploadDate": "2013-11-14T20:50:12.000Z", "duration": "PT3M15S"}}