{"@context": "http://schema.org", "@type": "Recipe", "name": "Raw Lime Cordial", "description": "Cordials can be a bit cowlick-y, sticking out here and there: kind of tart, kind of sweet, a bit bitter, and all a touch in disarray. But giving them 24 hours to mellow or cure in the refrigerator somehow brings them into harmony. This uncooked cordial requires a lot of time but none of it at the stove, and results in mind-boggling flavor: a dense, sweet syrup with a magnified fresh lime aroma and the perfect tart zip.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": null, "recipeYield": "", "recipeCuisine": "", "recipeCategory": "non-alcoholic drinks", "keywords": "ginger, lime, sugar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 287, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "4 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "4 milligrams", "sugarContent": "65 grams", "transFatContent": null}, "recipeIngredient": ["18 limes, room temperature, very ripe, well puffed and heavy", "2 1/2 cups sugar", "1 lb fresh ginger (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash limes in a sinkful of warm water, scrubbing with your hands or a vegetable brush, and let them dry them on a dish towel. Peel them with a vegetable peeler, removing as little of the underlying white pith as possible. To begin each, it’s helpful to cut the polar ends off, where the stem attaches and opposite. This should produce about 140 grams of peels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut limes in half and juice them. This should produce about 2 1/2 cups of juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a non-reactive, coverable container, add sugar to juice and stir until fully dissolved, 3 to 5 minutes. Crush peels up in handfuls to release the oils as you add them into the juice mix. Stir a bit to initiate extraction of the oils. (If you’re making a ginger version, wash the ginger, then shred it in a blender or food processor (no need to peel it), employing some of the lime juice to allow it to liquefy, and add it into the lime mixture, stirring well.) Cover and refrigerate for 12 to 24 hours. When ready, strain the cordial off from the peels in a fine mesh strainer or chinoise. Funnel cordial into covered container or cappable bottle and return to refrigerator for another day, to cure, before using. Makes roughly 1 liter."}]}