{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom and Wild Rice Strudel", "description": "I’ve always loved the combination of wild rice and mushrooms. The wild rice adds great texture to an already “meaty” filling, and also helps to bind it. I top the phyllo dough with some of the rice before adding the filling, so that the rice can absorb some of the liquid from the filling and keep it from saturating the phyllo dough.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/17/science/19recipehealth/19recipehealth-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 6 ", "recipeCuisine": "mediterranean", "recipeCategory": "brunch, dinner, lunch", "keywords": "fall, winter, healthy, kosher, low sugar, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 40}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 277, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "7 grams", "sodiumContent": "309 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 ounces feta, crumbled (about 3/4 cup)", "1 egg, beaten", "2 cups <a href=\"http://www.nytimes.com/recipes/1015828/mushroom-rago-and-ucirc-t.html\">mushroom ragoût</a>", "1/4 cup chopped fresh parsley, dill, or chives, or a combination", "1 1/2 cups cooked wild rice (1/2 cup uncooked)", "2 tablespoons butter, melted", "3 tablespoons extra virgin olive oil", "8 sheets phyllo dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the egg with the feta. Stir in the mushroom ragoût, chopped herbs and 1/2 cup of the cooked rice. Add a little freshly ground pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the melted butter and olive oil in a pyrex measuring cup or microwave-safe bowl, heat very slightly at 50 percent power and stir together. Place 8 sheets of phyllo dough on your work surface. Cover with a dish towel and place another, damp dish towel on top of the first towel. Each time you take a piece of phyllo from the pile, replace the towels so that the phyllo doesn’t dry out. Place a sheet of parchment on your work surface horizontally, with the long edge close to you. Take a sheet of phyllo from the pile and lay it on the parchment. Brush the first sheet of phyllo lightly with the butter and olive oil mixture and top with the next sheet. Continue to layer all eight sheets, brushing each one before topping with the next one. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the top sheet of phyllo dough with the butter and olive oil mixture. Spread the remaining wild rice over the surface, leaving a 3-inch margin at the bottom and a 2 1/2 inch margin at the top and on the sides. Spread the mushroom mixture over the rice. Fold the bottom edge of the phyllo up over the filling, then fold the ends over and roll up like a burrito. Using the parchment paper to help you lift the strudel, place both the parchment paper and the strudel on a baking sheet with the seam side down. Brush with butter and olive oil and make 3 or 4 slits on the diagonal along the length of the strudel. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the strudel in the oven and bake 20 minutes. Remove from the oven, brush again with the butter and olive oil, rotate the pan and return to the oven. Continue to bake for another 25 to 30 minutes, until golden brown. Remove from the heat and allow to cool for at least 20 minutes and preferably for 30. Serve warm. Reheat in a medium (325 degrees) oven if the strudel loses its crispiness before you are ready to serve. It will crisp up in about 10 minutes."}]}