{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan de Muerto", "description": "You’ll find this pan de muerto, or bread of the dead, at the center of the elaborate Day of the Dead altar festooned with sugared skulls, flowers and other mementos of the family’s departed.", "author": {"@type": "Person", "name": "Rachel Wharton"}, "image": "https://static01.nyt.com/images/2013/10/30/dining/30Bread/30Bread-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Three 7-inch rounds", "recipeCuisine": "mexican", "recipeCategory": "", "keywords": "bread, dessert, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["560 grams (4 cups) all-purpose flour, plus more as needed", "100 grams (1/2 cup) plus 2 tablespoons sugar", "1 1/2 teaspoons salt", "29 grams (1 ounce) fresh cake yeast (available in some supermarkets and specialty food markets)", "4 large eggs", "1/2 cup plus 2 tablespoons lard, softened, plus additional as needed", "1 cup whole milk", "1 large egg white (optional)", "1 tablespoon sesame seeds (optional)", "1 tablespoon melted shortening (optional)", "1  tablespoon sugar or cinnamon-sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound 560 grams of flour in a large mixing bowl. Sprinkle with 1/2 cup of the sugar and salt. Add yeast, breaking it up with your fingertips. Mix lightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a well in the center of the flour mixture. In the well, add eggs and 1/2 cup of the lard. With your fingers or a wooden spoon, slowly draw flour into eggs and shortening until they’re mixed into the flour. Gradually add the milk. The dough will be messy and very sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flour a work surface heavily, and have more flour ready to use. Turn dough onto the surface and begin to knead aggressively, sprinkling with flour liberally until dough is soft, smooth and supple, and rebounds after a touch. Divide into four equal pieces and form into smooth rounds. Allow to rest in a warm spot for 20 minutes. Meanwhile, grease a large baking sheet with lard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once they have rested, gently flatten three of the four pieces into 6-inch rounds, patting them around the edges so they retain a slight dome in the middle. Place them on the baking sheet several inches apart; if necessary, use more than one sheet. To the fourth piece, add remaining 2 tablespoons lard, 2 tablespoons sugar, and 2 tablespoons flour, kneading until well incorporated. This is for decorating the rounds with the traditional skull and crossbones; it will be supple but stiffer than the bread dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crossbones decorations, divide the decorating dough into three equal sections. From one section, break off a ball about 1 inch in diameter and set aside. Divide the remaining part of that section into two, rolling each into a rope a few inches long, with some parts of the rope fatter than the others. (Do this by gently rolling the dough with your hand outstretched, with only the three middle fingers touching the dough, so that the dough between your fingers is puffier than the rest.) Cross the two “bones” in an “X” across a round of bread, and place the small ball of dough in the center. Repeat with remaining dough. Set the breads aside to rise for one hour. Meanwhile, heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The bread may be baked plain, or gently brushed with egg white and sprinkled with sesame seeds. Bake until browned and fragrant, about 45 minutes, or until it produces a hollow sound when tapped on the bottom. If baked plain, it may be brushed afterward with melted lard and dusted with sugar or cinnamon sugar. Serve warm or at room temperature."}]}