{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Tart Crust", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT20M", "recipeYield": "Makes enough for an 8- to 10-inch tart", "recipeCuisine": "french", "recipeCategory": "quick", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 216, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "9 grams", "sodiumContent": "111 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups all-purpose flour, plus more for rolling", "1/2 teaspoon salt", "2 tablespoons sugar", "10 tablespoons (1 1/4 sticks) frozen or cold unsalted butter, cut into chunks", "3 tablespoons ice water, plus more if necessary", "1 egg yolk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour, salt, and sugar in the container of a food processor and pulse once or twice. Add the butter all at once; process until the mixture is uniform, about 10 seconds (do not over-process). Add the egg and process another few seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the mixture in a bowl and add 3 tablespoons ice water; mix with your hands until you can form the dough into a ball, adding another tablespoon or 2 of ice water if necessary (if you overdo it and the mixture becomes sodden, add a little more flour). Form into a ball, wrap in plastic, and freeze for 10 minutes or refrigerate for at least 30 minutes). (You can refrigerate for up to a couple of days, freeze for up to a couple of weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a countertop with flour and put the dough on it; sprinkle the top with a little flour. Use a rolling pin to roll with light pressure, from the center out. If the dough is sticky, add a little flour (if it continues to become sticky, and it’s taking you more than a few minutes to roll it out, refrigerate or freeze again). Roll, adding flour and rotating and turning the dough as needed; use ragged edges of dough to repair any tears, adding a drop of water while you press the patch into place."}]}