{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Summer Three-Bean Salad With Tofu and Soy Vinaigrette", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 main course or 6 appetizer servings", "recipeCuisine": "asian", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "beans, tofu, vegan, vegetarian", "aggregateRating": null, "recipeIngredient": ["For the tofu-soy vinaigrette:", "1 cup silken tofu", "1/2 cup soy sauce", "2 tablespoons sugar", "2 tablespoons sambal oelek chili paste", "2 tablespoons sherry vinegar", "1 tablespoon sesame oil", "1 cup canola oil", "For the radishes and beans:", "1 pound radishes, preferably a mix of different kinds, trimmed and thinly sliced", "Salt", "2 pounds fresh beans, preferably a mix of three kinds, such as green, yellow wax, and Romano, or haricot verts, snow peas and sugar snap peas, trimmed", "For the tofu croutons:", "4 cups vegetable oil, or as needed", "2 tablespoons cornstarch", "1/2 pound firm tofu, patted dry and cut into 1/2-inch cubes", "Salt", "1 to 2 tablespoons black sesame seeds, lightly toasted", "1 to 2 tablespoons white sesame seeds, lightly toasted."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tofu-soy vinaigrette: In a blender, combine the tofu, soy sauce, sugar, sambal oelek, vinegar and sesame oil. Blend until smooth. With the motor running at medium-low speed, slowly add the canola oil; the vinaigrette will become very thick. May be covered and refrigerated for up to a week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the beans and radishes: Prepare two bowls of ice mixed with water. Place the sliced radishes in one of the ice baths. Bring a large pot of heavily salted water to boil. Add the beans and boil until they are crisp-tender, about 4 minutes. Drain under cold water, then place in the remaining ice bath to chill. Drain well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the tofu croutons: Pour oil into a wok or small deep-fryer over high heat, and heat to 350 degrees. Meanwhile, put cornstarch into a wide, shallow bowl, and add tofu, tossing gently to coat. Working in batches, if needed, deep-fry the tofu until golden and crispy, 5 to 6 minutes. Using a slotted spoon, transfer to paper towels to drain. Season with salt, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the radishes well, and place in a large bowl. Add blanched beans, and toss to mix. Add vinaigrette to taste, reserving any excess for another use. Mix well, and season with salt to taste. To serve, place in individual serving plates or bowls, top with tofu croutons, and sprinkle with black and white sesame seeds."}]}