{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Scented Sweet Potato Gratin With Apple and Pear", "description": "The vegetarians and vegans at your table will love this, but so will the meat eaters. Orange is a flavor that complements sweet potatoes, and the walnut oil contributes a subtle background nuttiness. Make sure to stir the mixture every 15 minutes as it bakes, so that the sweet potatoes on the top layer don’t dry out. The apple and pear slices may fall apart, but that’s fine, they won’t disintegrate and they’ll contribute wonderful flavor to the dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/11/02/science/01wellrecipe/01wellrecipe-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "casseroles", "keywords": "dairy-free, gluten-free, kosher, vegetarian, fall, orange, sweet potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 216, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "6 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "621 milligrams", "sugarContent": "21 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds sweet potatoes, peeled and sliced about 1/4 inch thick", "2 tart apples, such as Pink Lady, peeled, cored, and sliced", "1 large ripe but firm pear, peeled, cored and sliced", "Salt to taste", "2 tablespoons mild honey, such as clover (substitute agave nectar for vegans)", "2 tablespoons walnut oil, plus more for greasing the pan", "2 teaspoons finely chopped or grated orange zest", "2 1/2 cups freshly squeezed orange juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Oil a 3-quart gratin or baking dish with walnut oil. Toss together the sweet potatoes, apples and pear in a large bowl. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan or in a microwave at 50 percent power, heat the honey (or agave nectar) and the walnut oil together just until warm. Add to the sweet potato mixture, add the orange zest and toss together well until the fruit and vegetables are well coated. Scrape into the baking dish, making sure to scrape out all of the honey and oil using a rubber spatula. Pour on the orange juice. Set the baking dish on a sheet pan and place in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 1 hour, setting the timer so that you remember to stir the mixture at 15-minute intervals. Cover the pan with foil and continue to bake for another 1/2 hour, or until the sweet potatoes are thoroughly tender and the liquid in the pan is syrupy. Allow to cool for about 10 minutes (or longer) before serving."}]}