{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet-and-Spicy Roasted Tofu and Squash", "description": "This is a meal with complex flavors and a variety of textures: velvety from the honey-roasted squash, tender and juicy from the tofu, with the occasional crunch from the sesame-seed garnish and a slight chew from the squash peel. I like to serve this dish with more hot sauce on the side, preferably over brown rice or lightly dressed baby spinach, though it’s also good served all alone. As long as the squash and the tofu have each other, that’s all they really need.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/01/08/dining/08DINNER_SPAN/08DINNER-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, squash, tofu, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 470}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "829 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 (14-ounce) package extra-firm tofu, drained", "2 pounds dumpling, delicata or acorn squash, halved and seeded", "1 1/2 tablespoons soy sauce, more to taste", "1/2 teaspoon sriracha or other hot sauce", "Kosher salt,  and black pepper", "1/4 cup peanut oil", "1 tablespoon honey", "1 tablespoon toasted sesame seeds", "2 tablespoons chopped celery leaves or cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain tofu and slice into 1/2-inch-thick slabs. Cut each slab in half. Arrange tofu on a large baking sheet or several plates lined with several layers of paper towels. Place another layer of paper towels on top and weigh down tofu with another baking sheet or more plates topped with a heavy cookbook or cans. Let stand for 20 minutes. Pat tofu dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While tofu drains, heat oven to 425 degrees. Cut squash into 1/2-inch-thick half-moons. Cut each slice in half again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together soy sauce, sriracha and a pinch of salt. Whisk in peanut oil. Spoon 3 tablespoons of the mixture into a separate bowl and reserve. Whisk honey into the original mixture. Spread squash out on a large baking sheet and pour honey-soy mixture over it. Sprinkle squash lightly with salt and pepper and toss well. Roast until bottoms are golden brown, about 20 minutes. Flip and roast until uniformly golden and soft, about 10 minutes more. Transfer squash to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust the heat to broil and position a rack just below the heating element. Toss tofu with reserved soy mixture and arrange in a single layer on a baking sheet (you can use the same one you used for the squash). Cook until crispy and golden, about 2 minutes per side. Toss hot tofu with squash, sesame seeds and celery leaves, adding more soy sauce if you like."}]}