{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Butternut Squash and Red Onions", "description": "Here is an easy, healthy addition to a Thanksgiving feast or weekday dinner from Yotam Ottolenghi and Sami Tamimi, which was included in a Julia Moskin video feature in 2013. Chop up a few red onions and a butternut squash, roast them in high heat, and drizzle them with tahini sauce, herbs and pistachios. That’s it. (Keep an eye on the onions, though. They may cook faster than the squash.)", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2013/11/11/dining/video-thanksgiving-squash/video-thanksgiving-squash-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "onion, squash, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 743}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 200, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "508 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["About 1/2 cup olive oil, plus extra for pans", "4 large red onions", "Coarse salt and black pepper", "4 pounds butternut squash cut into 1/2-inch wedges, peeled or unpeeled", "1/3 cup pine nuts or shelled green pistachio nuts (optional)", "2 tablespoons coarsely chopped flat-leaf parsley, mint, cilantro or a combination, for garnish", "1/4 cup tahini paste", "2 tablespoons lemon juice", "1 small clove garlic, crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 475 degrees. Lightly coat two large baking sheets with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel onions, leaving root ends intact. Cut each onion in half from stem to root. Cut each half into 4 wedges, leaving the root intact so that each wedge holds together. Spread on a baking sheet, sprinkle with salt and pepper and drizzle with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the squash in a large mixing bowl. Add 1/4 cup olive oil, 1 teaspoon salt and about 1/4 teaspoon pepper; toss to coat. Spread on a baking sheet, peel side down (if intact)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place both pans in oven and roast for 30 to 40 minutes, until the vegetables have taken on some color and are cooked through. Keep an eye on the onions, as they may cook faster than the squash and need to be removed earlier."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using nuts, pour 1 tablespoon oil into a small frying pan and place over medium-low heat. Add nuts and 1/2 teaspoon salt and cook for 2 minutes, stirring often, until the nuts are golden brown and smell toasty. Immediately remove from the heat and dump onto a cutting board to stop the cooking. If using pistachios, chop coarsely when cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make tahini sauce, place tahini in a bowl. Add lemon juice, 1/4 cup water, garlic and 1/4 teaspoon salt. Whisk until sauce is the consistency of honey, adding more water or a tablespoon of olive oil if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the vegetables are cooked, set aside until ready to serve. (The vegetables should be served the same day they are made. They can be served at warm room temperature, or reheated just before serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, combine vegetables on a large serving platter. If using tahini sauce, drizzle on top. Sprinkle herbs and, if using, nuts on top and serve."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Roasted Butternut Squash With Onions", "description": "This recipe from Yotam Ottolenghi and Sam Tamimi’s, “Jerusalem: A Cookbook” is a twist on a classic Thanksgiving dish.", "thumbnailUrl": "https://static01.nyt.com/images/2013/11/11/dining/video-thanksgiving-squash/video-thanksgiving-squash-mediumThreeByTwo440.jpg", "uploadDate": "2013-11-13T00:15:12.000Z", "duration": "PT1M54S"}}