{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinine Syrup", "description": "Here is a recipe for homemade quinine syrup, which will take the staid gin and tonic up a few notches. The syrup is made from cinchona, the bark of a shrub originally from Peru but now cultivated in various tropical climes worldwide, from which is extracted the alkaloid quinine, the original anti-malarial medication. It is available at a well-stocked herb store or, as always, online.", "author": {"@type": "Person", "name": "Toby Cecchini"}, "image": null, "totalTime": "P4DT30M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "orange, quinine, simple syrup", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 342, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "93 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "707 milligrams", "sugarContent": "85 grams", "transFatContent": null}, "recipeIngredient": ["4 cups water", "¼ cup (1 ounce/20 grams) cinchona bark, powdered (a coffee grinder does this well)", "3-4 cups rich simple syrup (by volume, two parts sugar to one of boiling water, stirred to dissolve)", "¼ cup citric acid, also known as lemon salt", "3 limes, only the peeled zests", "3 lemons, only the peeled zests", "2 sour or Sevilla oranges, only the peeled zests (or peel of 1 grapefruit or pomelo)", "1 cup chopped lemongrass (3-4 stalks)", "9 whole allspice berries", "6 whole cardamom pods", "¼ teaspoon kosher salt", "1 tablespoon lavender"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a covered saucepan, bring all ingredients except the simple syrup to a boil and reduce heat immediately; simmer on low for a half hour, then remove from heat and allow to cool fully. Transfer to a carafe and chill for two days. Strain through a superfine chinois or cheesecloth, or by using a plunger press coffee maker. Return to carafe and refrigerate for a day or two, allowing sediment to accumulate on bottom. When layer seems stable, gently decant off the clearer liquid without disturbing the sediment “mud.” It should be about 3 cups at this point; add to this liquid an equal measure of rich simple syrup, mixing well. Funnel into a clean, cappable bottle and refrigerate. Makes roughly 6 cups or 1.5 liters."}]}