{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Kale in Tomato Water", "description": "", "author": {"@type": "Person", "name": "Elaine Sciolino"}, "image": "https://static01.nyt.com/images/2014/02/10/dining/recipe-kale-soup2/recipe-kale-soup2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings (3 stuffed kale leaves per serving)", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "kale, tomato, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 247, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "7 grams", "proteinContent": "7 grams", "saturatedFatContent": "8 grams", "sodiumContent": "661 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt", "12 large kale leaves, stemmed", "2 1/2 pounds green zebra tomatoes or any combination of ripe heirloom tomatoes", "3 or 4 bay leaves, preferably fresh", "2 medium new potatoes", "1/4 cup salted butter", "1/2 sweet onion, minced", "1 small zucchini, finely chopped", "6 to 8 medium-size kale leaves, thinly sliced (1 packed cup)", "2 to 3 sprigs fresh thyme, leaves removed", "1 fresh hyssop branch (optional)", "1/4 cup unroasted pistachios, chopped", "Black pepper ", "A few drops of pistachio or walnut oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Blanch the large kale leaves for 30 seconds, drain and transfer to an ice bath or run under cold water to stop the cooking. Set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve and core the tomatoes; transfer to a medium saucepan and place over high heat. Bring to a boil and let soften for 2 to 3 minutes. Crush the tomatoes with a potato masher. Reduce to a simmer and continue to cook for 10 minutes. Remove from heat and cool. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the tomato water through two layers of cheesecloth. (Don&rsquo;t force the extraction.) When all liquid has drained, discard the cheesecloth and pulp, add the bay leaves and let stand for 15 minutes. Discard the bay leaves and set aside the tomato water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the potatoes in salted water until tender when pierced with a knife, 10 to 15 minutes. Drain, peel and cut into small cubes, about 1/4-inch square."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a medium saucepan over medium-high heat, melt the butter and add the onion, zucchini and sliced kale leaves. Cook for 15 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes, pistachios, thyme and hyssop, if using, and stir gently to just combine. (Do not mash.) Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a 10-inch square piece of plastic wrap on a clean work surface. Place 1 large kale leaf in the center of the plastic and spoon about 2 tablespoons of the filling into the center of the leaf. Gather up the edges of the plastic wrap and twist to form a ball with the kale leaf at the bottom; tie the plastic tightly at the base of the ball. Repeat with remaining kale and stuffing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a steamer to a boil, reduce to a low simmer, and add the plastic-wrapped kale. Gently steam the bundles for 5 minutes. (Be careful; if heat is too high the plastic will melt.) Remove the bundles, carefully untie and serve, seam side down, in the warm tomato water. Drizzle with the oil and sprinkle with pepper.\n"}]}