{"@context": "http://schema.org", "@type": "Recipe", "name": "Preserved Roasted Tomato Purée", "description": "Preserving a glut of tomatoes at the end of summer is a smart (though messy) move for cooks who want those bright flavors in the depths of January. Roasting the tomatoes before puréeing them adds depth and a subtle smoky flavor — a welcome addition to soups and sauces. Use any kind of tomatoes you like, as long as they are ripe; Brandywines and what are often called Rutgers varieties (Reds, Jersey Reds and Ramapos) work well, as do paste or Roma tomatoes. You’ll need four pint-sized jars (16 ounces each) for purée storage.", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2014/09/11/dining/tomato2-still/tomato2-still-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 pint-sized jars", "recipeCuisine": "", "recipeCategory": "", "keywords": "summer, tomato, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 138, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "9 grams", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "38 milligrams", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["10 pounds red, ripe, firm paste or Roma tomatoes (about 20 to 30, depending on size)", "Lemon juice, bottled lemon juice or citric acid", "Salt (kosher, pickling or fine sea only), optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Core and halve tomatoes and scoop out seeds and gel. Pile tomatoes into a large roasting pan, or on 2 sheet pans, cut side up. Do not add oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast tomatoes for 2 hours. Thoroughly purée tomatoes using a blender or immersion blender. It should be smooth and velvety, with no pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a rack in a large stockpot or line pot with a folded kitchen towel, then fill pot with water and bring to a boil. Add pint jars and boil for 10 minutes. Jars may be left in warm water until ready to fill. Alternatively, sterilize jars by running them through a dishwasher cycle, keeping them warm in the machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off heat and add flat lids to soften their rubber gaskets. Rings and lids may be left in water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a nonreactive pan, bring purée to a brisk boil for 5 minutes. Ladle hot tomato purée into warm jars leaving 1/2 inch head space, plus room to accommodate lemon juice. If using citric acid, fill to 1/2 inch head space."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Into every pint jar, add one tablespoon lemon juice or 1/4 teaspoon citric acid. If using salt, add 1/2 teaspoon to each pint jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe jar rims clean with a damp towel. Place lids on jars, screw on rings and lower jars upright into boiling water. Return to a full boil and process for 35 minutes. Transfer jars to a folded towel and let cool for 12 hours. Jars will ping as they seal. Once cool, test seals by removing rings and lifting jars by flat lids. If a lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within three days or reprocessed. Rings and jars may be reused, but a new flat lid must be used each time."}]}