{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Carrots With Turmeric and Cumin", "description": "These are based on Suzanne Goin’s turmeric-spiced root vegetables from her wonderful new book “The A.O.C. Cookbook.” I use her technique for roasting the carrots, and use the same spices she uses, but I make the dish with a little less olive oil and butter to cut down on calories. Suzanne serves her mix of carrots, turnips, parsnips and rutabagas with Greek yogurt seasoned with kaffir lime juice and zest, and mint chutney. They are also delicious on their own.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/14/science/13recipehealth/13recipehealth-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick", "keywords": "appetizer, side dish, fall, winter, gluten-free, halal, healthy, kosher, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 957}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 121, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "268 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 medium carrots, peeled", "2 tablespoons extra virgin olive oil", "Salt and freshly ground pepper to taste", "1 tablespoon fresh thyme leaves", "1/2 teaspoon cumin seeds, lightly toasted", "1/2 teaspoon coriander seeds, lightly toasted", "2 tablespoons unsalted butter, at room temperature", "1/2 teaspoon turmeric", "1/2 teaspoon Aleppo pepper or mild chili powder", "2 tablespoons chopped fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Cut the carrots in half lengthwise and crosswise. If the carrots are fat at one end, cut the fat half in half again lengthwise, so that the pieces are more or less equal in thickness. Place in a large bowl and toss with the olive oil, salt and pepper, and thyme leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy baking sheet in the oven for 3 to 4 minutes. Remove from the oven and place the carrots on it in one layer. Roast for 20 to 25 minutes, stirring the carrots every 10 minutes. They should be slightly caramelized and tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the carrots are in the oven place the cumin and coriander seeds in a mortar and pestle and grind. Add the soft butter, turmeric and Aleppo pepper or chili powder and stir with the pestle until well amalgamated. Transfer to a large pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the carrots from the oven when done and add to the pan with the spice butter and the mint. Toss together, taste and adjust salt and pepper. Serve from the pan or transfer to a platter."}]}