{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffing With Mushrooms, Leeks and Bacon", "description": "Discord swarms around the issue of stuffing. Should it be cooked in the bird or baked alongside, as dressing? White or corn bread? Firm enough to slice or soft as pudding? Call this recipe the peacemaker, because it’s adaptable enough to make everyone happy. You can use white or corn bread (and gluten-free corn bread works perfectly). The mushrooms allow vegetarians to nix the bacon without sacrificing all the flavor. We advocate baking it separately (which technically makes it dressing), but if you want to stuff the turkey, you can do that, too.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/11/12/dining/Stuffing/Stuffing-mediumThreeByTwo440.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, stuffing and dressing", "keywords": "bacon, bread, cornbread, mushroom, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 626}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 360, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "14 grams", "saturatedFatContent": "6 grams", "sodiumContent": "574 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons melted butter, more as needed for greasing pan", "1 1/2 pounds sliced white bread or corn bread", "1/2 pound thick-cut bacon", "2 large leeks, trimmed and sliced (3 cups)", "1 1/2 pounds mixed mushrooms, cut into bite-size pieces", "1 1/2 teaspoons kosher salt", "3/4 teaspoon black pepper", "2 tablespoons chopped sage", "1/2 cup dry white wine", "1 1/4 cups chicken stock, more as needed", "1/4 cup apple cider, if using white bread", "3 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. Butter a 9-by-13-inch baking pan. Trim the crusts from the white bread and cut into 1-inch cubes; if using corn bread, coarsely crumble it. Spread the bread pieces out on one or two large baking sheets. Toast in the oven, tossing occasionally, until very dry, about 30 minutes for white bread, 1 hour for corn bread. Transfer to a large bowl to cool. Increase oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium-high heat, cook the bacon strips until crisp. Transfer to a paper-towel-lined plate to drain, leaving the fat in the pan. Add the leeks to the bacon fat and cook, stirring occasionally, until soft, 5 to 10 minutes. Add the mushrooms, 1 teaspoon salt and 1/2 teaspoon black pepper. Cook, tossing frequently, until mushrooms are tender and most of their juices have evaporated, 10 to 15 minutes. Stir in the sage and cook 1 minute. Add the wine and cook until it evaporates, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the mushroom mixture over the dried bread. Stir in stock. If using white bread, stir in the cider. Add parsley, 1/2 teaspoon salt and 1/4 teaspoon pepper. The mixture should be moist and very soft. If you like your stuffing extremely moist, add enough stock to make it seem slightly soggy but not wet. (Think pudding.) Crumble bacon and stir it in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the bread mixture to the prepared baking pan. Drizzle 3 tablespoons melted butter over the stuffing. Bake until golden, 35 to 45 minutes."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Stuffing With Mushrooms and Bacon", "description": "Learn to make this fast and delicious stuffing recipe.", "thumbnailUrl": "https://static01.nyt.com/images/2013/11/12/dining/Stuffing/Stuffing-mediumThreeByTwo440.jpg", "uploadDate": "2013-11-12T23:11:11.000Z", "duration": "PT1M38S"}}