{"@context": "http://schema.org", "@type": "Recipe", "name": "Raclette", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "potato, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "recipeIngredient": ["1 pound (about 12) fingerling potatoes", "1 tablespoon kosher salt, or as needed", "10 ounces Raclette, or hard mountain cheeses like Emmenthaler or Gruyere, thinly sliced", "freshly ground black pepper", "2 scallions, trimmed, and sliced diagonally in 1/8 inch strips", "Cornichons, pickled onions or pickled cauliflower, optional."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot combine 8 cups water, potatoes and 1 tablespoon salt. Place over high heat to bring to a boil, then reduce heat to low and simmer until potatoes are tender when pierced with a fork, 15 to 25 minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have oven-proof plates, preheat a broiler. If you do not have oven-proof plates, preheat oven to 250 degrees. When cool enough to handle, cut the potatoes in half lengthwise. Divide the warm potatoes, cut-side up, evenly among four plates, arranging them in a pinwheel pattern."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange one quarter of the cheese slices in a single layer over each portion of potatoes, taking care to completely cover all potatoes. Broil or bake until cheese melts, about 3 minutes in a broiler or 10 minutes in an oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season with salt and pepper to taste. Serve hot, garnished with scallions sprinkled on top. Cornichons, pickled onions and pickled cauliflower are optional accompaniments. If desired, the dish may be served with a green salad."}]}