{"@context": "http://schema.org", "@type": "Recipe", "name": "Easter Barszcz", "description": "Most of these products are available at a Polish deli if you can&rsquo;t find them elsewhere.", "author": {"@type": "Person", "name": "Annemarie Conte"}, "image": null, "totalTime": "P1D", "recipeYield": "", "recipeCuisine": "eastern european, russian", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "kielbasa", "aggregateRating": null, "recipeIngredient": ["1 cup rye flour", "Filtered water (for the rye mixture)", "1 egg, plus more, hard-boiled, for soup bowl.", "1 to 2 tablespoons salt", "1/4 cup whole milk or cream", "Fresh grated horseradish root", "Kielbasa", "Ham", "Andrulis Farmers cheese", "Boiled and smoked bacon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take about 1 cup rye flour and place it in a 1-quart jar. Fill it with room-temperature filtered (non-chlorinated) water and leave it, lid slightly askew, for three days to a week. During this time, skim the crust off the top. (If you want to hurry the fermentation process, add a pinch of yeast and it should be ready in a day or two.) When the rye mixture is ready, strain it. If it&rsquo;s too thick, add a little water to it. It shouldn&rsquo;t be thicker than heavy cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring about 2 quarts of water to a boil. Ideally, use water from the Easter ham you boiled or some kielbasa you cooked, but plain water can do in a pinch. Pour the rye mixture in, whisking the whole time (or you&rsquo;ll get a big noodle in there) and bring it back up to a boil. Reduce the heat so it&rsquo;s no longer at a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk together one egg, 1 to 2 tablespoons salt and 1/4 cup whole milk or cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the egg mixture into the pot of water, making sure not to scramble the eggs (I'd probably temper the eggs by adding a bit of the hot liquid into them before adding them back into the pot of hot water, but who am I to mess with Andy's father's proven cooking methods?)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the mixture to a boil.  As soon as it hits a boil, turn it off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In individual soup bowls, place a lot of fresh grated horseradish root (none of the jarred stuff) and finely diced kielbasa, ham, firm Andrulis Farmers cheese, bacon that&rsquo;s been boiled and smoked at the deli (no need to fry it) and hard boiled egg (preferably eggs you&rsquo;ve had blessed&mdash;wait, actually, have all of this stuff blessed by a priest, for good measure). Pour soup on top."}]}