{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Broccoli With Tahini Garlic Sauce", "description": "One of my favorite Middle Eastern mezze is deep-fried cauliflower served with tahini garlic sauce. I decided to try the dish with broccoli, but instead of deep-frying the broccoli I roasted it, a method that requires a lot less oil. The buds on the broccoli florets toast to a crispy brown, and the texture of the stalk remains crisp. It goes wonderfully with the classic and irresistible tahini garlic sauce.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/22/science/23recipehealth/23recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch, quick", "keywords": "appetizer, side dish, dairy-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 743}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "310 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 garlic clove, cut in half, green shoots removed", "Salt to taste", "1/3 cup sesame tahini", "2 to 4 tablespoons fresh lemon juice (more to taste)", "1/3 cup water", "Aleppo pepper or red pepper flakes for sprinkling", "1 to 1 1/2 pounds broccoli crowns", "2 tablespoons extra virgin olive oil", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar and pestle mash the garlic clove to a purée with a generous pinch of salt. Transfer to a bowl and whisk in the sesame tahini. Whisk in the lemon juice, beginning with the smaller amount. The mixture will stiffen up. Gradually whisk in up to 1/3 cup water, until the sauce has the consistency of thick cream (or runny yogurt). Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Line a baking sheet with parchment paper. Slice the broccoli crowns 1/3 inch thick, letting the flower buds on the edges fall off. Peel any large pieces of stem by gently pulling away the thick skin, then toss the slices and the unattached buds with the olive oil, salt, and pepper. Place on the baking sheet in an even layer. Roast until the tops are nicely browned, stirring and flipping the large slices over (tongs are a good tool for this) after 8 minutes, roasting about 15 minutes total. Remove from the oven and transfer to a platter or to individual serving plates. Drizzle on the tahini sauce and serve, or serve the tahini sauce in small bowls for dipping."}]}