{"@context": "http://schema.org", "@type": "Recipe", "name": "Gérard’s Mustard Tart", "description": "Be sure to use strong mustard from Dijon. Dorie's friend Gérard Jeannin uses Dijon’s two most popular mustards in his tart: smooth, known around the world as Dijon, and grainy or old-fashioned, known in France as “à l’ancienne.” You can use either one or the other, or you can adjust the proportions to match your taste, but whatever you do, make sure your mustard is fresh, bright colored, and powerfully fragrant. Do what Gérard would do: smell it first. If it just about brings tears to your eyes, it’s fresh enough for this tart.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, side dish, mustard", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 200, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "411 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 carrots (not too fat), trimmed and peeled", "3 thin leeks, white and light green parts only, cut lengthwise in half and washed", "2 rosemary sprigs", "3 large eggs", "6 tablespoons crème fraîche or heavy cream", "2 tablespoons Dijon mustard, or to taste", "2 tablespoons grainy mustard, preferably French, or to taste", "Salt, preferably fleur de sel, and freshly ground white pepper", "1 9- to 9½-inch tart shell made from Tart Dough, partially baked and cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and preheat the oven to 425 degrees. Line a baking sheet with a silicone baking mat or parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the carrots and leeks into slender bâtons or sticks: First cut the carrots lengthwise in half, then place the halves cut side down on the cutting board and cut crosswise in half or cut into chunks about 3 inches long. Cut the pieces into 1/ 8- to 1/4-inch-thick matchsticks. If your carrots were fat and you think your matchsticks don’t look svelte enough, cut them lengthwise in half. Cut the leeks in the same way."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit a steamer basket into a saucepan. Pour in enough water to come almost up to the steamer, cover, and bring to a boil. Drop the carrots, leeks, and 1 rosemary sprig into the basket, cover, and steam until the vegetables are tender enough to be pierced easily with the tip of a knife, 10 to 15 minutes. Drain the vegetables and pat them dry; discard the rosemary sprig."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the eggs together with the crème fraîche or heavy cream. Add the mustards, season with salt and white pepper — mustard has a tendency to be salty, so proceed accordingly — and whisk to blend. Taste and see if you want to add a little more of one or the other mustards."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the tart pan on the lined baking sheet and pour the filling into the crust. Arrange the vegetables over the filling — they can go in any which way, but they’re attractive arranged in spokes coming out from the center of the tart. Top with the remaining rosemary sprig and give the vegetables a sprinkling of salt and a couple of turns of the pepper mill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the tart for about 30 minutes, or until it is uniformly puffed and lightly browned here and there and a knife inserted into the center of the custard comes out clean. Transfer the tart to a cooling rack and let it rest for 5 minutes before removing the sides of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, warm, or at room temperature (or lightly chilled)."}]}