{"@context": "http://schema.org", "@type": "Recipe", "name": "Root Vegetable Soup", "description": "Here's a simple, robust, cold-weather soup that you can make with almost any mixture of root vegetables you have to hand: carrots, parsnips, celery root, turnips, rutabaga, sweet or regular potato. Flavored with garlic, rosemary and bay leaves on top of a saute of onions and celery, it's an earthy, sweet, and warming meal for days where the air has some bite. Top with a drizzle of olive oil and lemon juice, some grated cheese, flaky salt and a shower of black pepper.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/03/11/dining/DJ-clark/DJ-clark-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "easy, soups and stews", "keywords": "root vegetables, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 699}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 263, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "9 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "581 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons unsalted butter", "1 large onion or 2 leeks (white and light green part only), chopped", "2 to 3 celery stalks, diced", "3 garlic cloves, finely chopped", "3 rosemary or thyme branches", "2 bay leaves", "3 1/2 pounds mixed root vegetables (carrot, parsnip, celery root, turnip, rutabaga, sweet or regular potato), peeled and cut into 1-inch chunks", "2 teaspoons fine sea salt, more as needed", "1/2 teaspoon black pepper, more as needed", "Juice of 1/2 lemon, more for serving ", "Extra-virgin olive oil", "Flaky sea salt", "Crushed Aleppo, Urfa or other chile flakes, optional", "Grated Parmesan or pecorino, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a large, heavy-bottomed pot. Stir in onion and celery. Cook, stirring occasionally, until vegetables are tender, about 10 minutes. Stir in garlic, rosemary and bay leaves; cook 1 minute more. Add root vegetables, 8 cups water, salt and pepper. Bring to a boil; reduce heat to medium and simmer, covered, until vegetables are tender, 30 to 40 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard rosemary branches and bay leaves. Using an immersion blender, pur&eacute;e soup until smooth. (Alternatively, you can pur&eacute;e the soup in batches in a blender or food processor.) If the soup is too thick, add a little water. Season with lemon juice and more salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle soup into bowls and top with a drizzle of olive oil, a few drops of lemon juice, flaky salt and crushed chile or grated cheese, if desired."}]}