{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Giant White Beans With Cabbage", "description": "This slow-baked bean and cabbage dish is luxurious in both taste and texture. The limas become soft and pillowy after their long, slow simmer, while releasing some of their starch into the bean broth; the cabbage sweetens over time and almost melts into the velvety broth. Baked beans with cabbage traditionally contain a ham bone or some salt pork for flavor, but I get that rich umami flavor with Parmesan rinds.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/03/20/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "6 servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 51}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large onion, chopped", "1 large carrot, finely chopped", "1 pound cabbage, cored and chopped or shredded", "4 garlic cloves, minced", "1 pound large white beans or dried lima beans", "7 cups water", "A bouquet garni consisting of 2 Parmesan rinds, 4 parsley sprigs, 2 thyme sprigs and a bay leaf", "Salt and a generous amount of freshly ground pepper", "1/4 cup chopped fresh parsley (more to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, ovenproof casserole and add the onion and carrots. Cook, stirring often, until the onion is tender, about 5 minutes, and stir in the cabbage and half the garlic. Cook, stirring, for another 5 minutes, until the cabbage has wilted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, water, bouquet garni and salt and pepper. Bring to a simmer, cover and place in the oven. Bake 1 hour and add the remaining garlic; taste and adjust salt. Return to the oven and bake for another 1 to 1 1/2 hours, until the beans are very tender and creamy. Taste and adjust salt. Remove the bouquet garni. Stir in the chopped parsley. Serve hot or warm."}]}