{"@context": "http://schema.org", "@type": "Recipe", "name": "Winter Squash, Onion and Pine Nut Pizza", "description": "This flavorful autumnal pie from “Real Food Has Curves: How to Get Off Processed Food, Lose Weight and Love What You Eat’’ by Bruce Weinstein and Mark Scarbrough, uses winter squash purée as the pizza topping; the purée is spread like a sauce on the crust. You can find puréed winter squash (sometimes labeled as “puréed acorn squash” or “puréed butternut squash”) in the freezer section of most markets — thaw according to the package instructions before using.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "pizza and calzones", "keywords": "appetizer, side dish, fall, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "563 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["Yellow cornmeal to dust the pizza stone (or nonstick spray to grease the baking sheet)", "1 pound fresh dough (from a pizza shop) or a frozen dough, thawed; or prebaked pizza crust", "2 tablespoons olive oil", "2 medium yellow onions, halved through the stem, then thinly sliced", "3/4 cup frozen winter squash purée, thawed", "2 teaspoons minced sage leaves or 1 teaspoon rubbed sage", "1/4 teaspoon grated or ground nutmeg", "1/4 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1 1/2 ounces Parmigiano-Reggiano or Grana Padano or pecorino, finely grated", "1 tablespoon pine nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat pizza stone or oven. If using a pizza stone, preheat it in the oven at 450 degrees Fahrenheit for 30 to 45 minutes; if using a pizza tray or a large baking sheet, preheat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust. If you’re using fresh dough on a pizza stone, dust a pizza peel lightly with cornmeal. Add the dough and form it into a large circle by dimpling it with your fingertips. Pick it up and shape it by slowly turning it by its edge, stretching that edge all the while, until the circle is about 14 inches in diameter. Set it cornmeal side down on the peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To use fresh dough on a pizza tray or a large baking sheet, grease the tray or baking sheet lightly with nonstick spray. Lay the dough on the baking sheet and dimple it with your fingertips — then pull and press it until it forms a circle about 14 inches in diameter on the pizza tray or a 12-by-7-inch, somewhat irregular rectangle on the baking sheet. If you’re using a prebaked crust, place it on a cornmeal-dusted pizza peel or on a greased pizza tray or a large baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium heat, then swirl in the oil. Add the onion slices, reduce the heat to very low, and cook, stirring often, until soft, golden and very sweet, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, stir the squash purée, sage, nutmeg, salt and pepper in a medium bowl until uniform. Spread this mixture evenly over the prepared crust, leaving a 1/2-inch border at its edge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with the caramelized onions, then sprinkle the finely grated cheese and pine nuts over the pie. Slide the pizza from the peel to the very hot stone, or place the pie on its tray or baking sheet with the pie either in the oven or on the section of the grill grate that’s not right over the heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake or grill with the lid closed until the crust is golden and somewhat firm to the touch, perhaps even a little darkened on its bottom, 16 to 18 minutes. Check fresh dough occasionally to prick any air bubbles that may arise so you’ll have an even crust on the pie. Slip the peel back under the pie to get it off the stone, or set the pie on its tray or baking sheet with its pie on a wire rack. Cool for 5 minutes before slicing. If you want to make sure the crust stays crunchy, consider transferring the pie directly to the wire rack after a minute or so."}]}