{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana Cream Pie", "description": "This recipe, from Dorie Greenspan's wonderful cookbook \"Baking: From My Home to Yours,\" is simple but decadent, and very forgiving for the beginner baker. It’s a glorious mess of fruit and cream — the pressure is off to make it look perfect.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2016/01/23/dining/23COOKING_BANANACREAMPIE1/23COOKING_BANANACREAMPIE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "banana, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 146}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "116 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups whole milk", "6 large egg yolks", "1/2 cup (packed) light brown sugar, pressed through a sieve", "1/3 cup cornstarch, sifted", "1/2 teaspoon ground cinnamon", "1/8 teaspoon freshly grated nutmeg", "Pinch of salt", "1 teaspoon pure vanilla extract", "3 tablespoons cold unsalted butter, cut into bits", "3 ripe but firm bananas", "1 9-inch single crust made with Good for Almost Everything Pie Dough, fully baked and cooled (<a href=\"http://cooking.nytimes.com/recipes/1015570-good-for-almost-everything-pie-dough\">see recipe</a>)", "1 cup cold heavy cream", "2 tablespoons confectioners’ sugar, sifted", "1 teaspoon pure vanilla extract", "2 tablespoons sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the custard: Bring the milk to the boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large heavy-bottomed saucepan, whisk the yolks together with the brown sugar, cornstarch, cinnamon, nutmeg and salt until well blended and thick. Whisking without stopping, drizzle in about 1/4 cup of the hot milk — this will temper, or warm, the yolks so they won’t curdle — then, still whisking, add the remainder of the milk in a steady stream. Put the pan over medium heat and, whisking constantly (make sure to get into the edges of the pan), bring the mixture to a boil. Boil, still whisking, for 1 to 2 minutes, or until the mixture has thickened to pudding consistency, before removing from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the vanilla extract. Let stand for 5 minutes, then whisk in the bits of butter, stirring until they are fully incorporated and the custard is smooth and silky. You can either press a piece of plastic wrap against the surface of the custard to create an airtight seal and refrigerate the custard until cold or, if you want to cool the custard quickly — as I always do — put the bowl into a larger bowl filled with ice cubes and cold water and stir occasionally until it is thoroughly chilled, about 20 minutes. (If it’s more convenient, you can refrigerate the custard, tightly covered, for up to 3 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to assemble the pie, peel the bananas and cut them on a shallow diagonal into 1/4-inch-thick slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the cold custard vigorously to loosen it, and spread about one quarter of it over the bottom of the pie crust — it will be a thin layer. Top with half of the banana slices. Repeat, adding a thin layer of pastry cream and the remaining bananas, then smooth the rest of the pastry cream over the last layer of bananas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the topping: Working with a stand mixer fitted with the whisk attachment or with a hand mixer in a large bowl, beat the cream until it just starts to thicken. Beat in the confectioners’ sugar and vanilla and continue to beat until the cream holds firm peaks. Switch to a rubber spatula and gently fold in the sour cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: Spoon the whipped cream over the filling and spread it evenly to the edges of the custard. Serve, or refrigerate until needed."}]}