{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Ratatouille With Crostini and Goat Cheese", "description": "Grilled ratatouille is a warm-weather recipe with many charms in both method and result. Grilling takes the whole process of cooking outside, and the grill also adds a lovely smoky nuance to the finished dish without overpowering the essential flavors of vegetables, olive oil and herbs. The dish is less stew-y and more saladlike than a typical ratatouille, but with its concentrated flavor and velvety texture, along with a garlicky kick, it may well become a favorite all the same.\n", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/Ratatouille/Ratatouille-mediumThreeByTwo440.jpg", "totalTime": "PT35M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, bread, goat cheese, vegetables, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 125}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 299, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "6 grams", "sodiumContent": "404 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 white onion (about 8 ounces), peeled and halved lengthwise through the root", "2 lemons, halved, seeds removed", "1 yellow or orange bell pepper (about 8 ounces), halved lengthwise, stem and seeds removed", "1 red bell pepper (about 8 ounces), halved lengthwise, stem and seeds removed", "2 medium zucchini (about 8 ounces each), sliced lengthwise 1/2-inch thick", "2 medium eggplant (about 10 ounces each), sliced lengthwise 1/2-inch thick", "8 slices crusty bread", "2 to 3 large garlic cloves, peeled ", "6 tablespoons extra-virgin olive oil, more as needed", "1/4 cup chopped fresh basil", "2 teaspoons fresh thyme leaves, more for garnish", "1/2 teaspoon kosher sea salt, more to taste", "Black pepper, to taste", "8 ounces soft, fresh goat cheese", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the grill. Place vegetables and lemon on grill, making sure onion and lemons are cut side down, and cover. Grill lemon halves until lightly caramelized, 3 to 5 minutes total. Grill onion until it is heavily charred, about 7 to 15 minutes total. Grill peppers, zucchini and eggplant until charred and very soft, about 3 to 8 minutes per side total. Transfer to a cutting board. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill bread until lightly charred and toasted, about 1 minute per side. Halve one or two of the garlic cloves and rub cut sides on the grilled bread. Mince remaining garlic clove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop vegetables into bite-size pieces and transfer to a large bowl; toss with the juice of 3 of the grilled lemon halves, the minced garlic, olive oil, basil, thyme leaves, 1/2 teaspoon salt and some black pepper to taste. Adjust seasonings as needed, adding more lemon juice (from remaining lemon half), salt or oil, or both, as needed. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange ratatouille, grilled bread and goat cheese on a large platter. Sprinkle thyme leaves, pepper and flaky salt over goat cheese. Or spread goat cheese on toasts, sprinkle with thyme, pepper and flaky sea salt, then top with some of the ratatouille to make crostini. "}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Grilled Ratatouille With Goat Cheese", "description": "Melissa Clark avoids heating up her kitchen by making ratatouille on the grill.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/09/dining/Ratatouille/Ratatouille-mediumThreeByTwo440.jpg", "uploadDate": "2013-09-20T17:35:52.000Z", "duration": "PT3M18S"}}