{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Blintzes with Wild Mushrooms", "description": "These are not your average blintzes. Elegant and savory, they are as good for a midnight supper as they are for brunch. Though the recipe is a bit complex, it can be parceled out into a series of small, manageable chores; both the pancakes and filling can be prepared up to 2 days ahead, and once the blintzes are assembled, they can wait in the fridge as well. The final step of browning and crisping the blintzes in butter is almost no work at all. ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2013/12/25/dining/25kitchen3/25kitchen3-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "eastern european", "recipeCategory": "dinner, lunch", "keywords": "chicken, mushroom, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 642, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "2 grams", "proteinContent": "33 grams", "saturatedFatContent": "13 grams", "sodiumContent": "809 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["130 grams all-purpose flour  (1 cup)", "1/2 teaspoon salt", "2 large eggs, lightly beaten", "1 cup whole milk, more if needed ", "2 tablespoons melted butter, for frying pancakes", "1 whole chicken, about 3 1/2 pounds, or use 2 pounds chicken thighs", "Salt and pepper", "1 small bunch thyme, plus 2 teaspoons chopped thyme leaves\n", "2 tablespoons olive oil\n", "8 ounces chanterelle mushrooms, roughly chopped\n", "3 small garlic cloves, minced\n", "1/2 ounce dried black trumpet mushrooms, soaked in warm water 10 minutes, rinsed, drained and patted dry\n", "4 tablespoons butter, more as needed\n", "1 medium onion, finely diced\n", "2 cups finely diced leeks\n", "2 tablespoons all-purpose flour\n", "1 cup hot chicken broth\n", "1/4 cup white wine\n", "1/2 cup crème fraîche, for garnish\n", "2 tablespoons finely slivered chives\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: Put flour and salt in medium mixing bowl. Whisk in eggs and milk and beat until smooth. Refrigerate for at least 30 minutes (overnight if you wish). Thin with a little more milk if necessary; mixture should have the consistency of heavy cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put an 8-inch skillet or crepe pan over medium high heat. Brush lightly with melted butter, then pour in a scant 1/4 cup batter. Tilt pan and swirl batter so it fills pan to maximum circumference. Fry pancake on one side only until lightly browned. Lay pancakes browned side down on a plate, stacking pancakes as you go. Continue until all batter is used. Pancakes can be made ahead and kept wrapped in refrigerator for up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Heat oven to 400 degrees. Season chicken inside and out with salt and pepper. Put thyme bunch in cavity. Place on a rack in a roasting pan and roast breast side down for about 1 hour, until juices run clear at thickest part of thigh when pierced with skewer. Let cool, then tear meat from carcass in large chunks. Remove skin and bones (you can reserve for making broth). Chop meat in rough 1/2-inch cubes. Set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a skillet over medium high heat. Add chanterelles and season with salt and pepper. Cook for about 2 minutes until lightly colored. Add garlic and chopped thyme leaves, stir and cook 1 minute more. Remove chanterelles from pan with a slotted spoon. Add black mushrooms to pan and season lightly with salt. Lower heat and cook gently for 2 minutes. Mix half the black mushrooms with all of the chanterelles; cut remaining black mushrooms into strips and reserve for garnish. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 2 tablespoons butter in wide skillet. Add onion and cook over medium high heat, until softened, about 2 minutes. Add leeks, season with salt and pepper and cook, stirring, for another 2 minutes. Add chicken and mushroom mixture and stir to combine. Sprinkle with flour and stir again. Add broth and wine and let simmer for 2 minutes. Taste and adjust seasoning, then let cool completely and refrigerate for 1 hour or up to 1 day ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble blintzes: Lay pancakes browned side up on a board. Fill each pancake with about 3 tablespoons chicken mixture. Fold pancake around filling to make a rectangular package. Place packages seam side down on a baking sheet. Packages can be covered and refrigerated for up to 1 day. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide skillet over medium heat, working in batches, gently fry blintzes on both sides with remaining 2 tablespoons butter for 2 minutes on each side, until crisp and golden. (You may need to add a bit more butter as you go.) Keep fried blintzes warm in a low oven. Serve 2 or 3 blintzes per person on warmed plates. Dab each blintz with a spoonful of crème fraîche and sprinkle with chives. Garnish with reserved black mushrooms, warmed through."}]}