{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Enchiladas", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "2 to 3 servings", "recipeCuisine": "mexican", "recipeCategory": "", "keywords": "tofu, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 782, "unsaturatedFatContent": "47 grams", "carbohydrateContent": "52 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "13 grams", "proteinContent": "32 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1232 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["For the sauce:", "1/4 cup safflower or other vegetable oil", "Half a medium onion, diced", "2 garlic cloves, minced", "1 jalapeño pepper, seeded and diced", "1 1/2 tablespoons ground cumin", "1 1/2 tablespoons chili powder", "3 tablespoons all-purpose flour", "8 ounces canned organic tomato sauce", "sea salt", "For the filling and assembly:", "1/4 cup safflower or other vegetable oil", "1 pound firm tofu, drained and loosely crumbled", "Six 7-inch corn tortillas", "Half a medium onion, finely diced", "Half a red bell pepper, finely diced", "2 cloves garlic, minced", "1 jalapeño pepper, seeded and diced", "1 cup coarsely chopped cilantro leaves", "1 1/2 tablespoons ground cumin, or more to taste", "1 1/2 tablespoons chili powder, or more to taste", "2 tablespoons soy sauce", "sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce: In a small saucepan over medium heat, heat oil until shimmering. Add onions, garlic, and jalapeño. Sauté until onions are translucent, about 5 minutes. Add cumin, chili powder, and flour, whisking until browned and thickened. Slowly stir in 3/4 cup of water and tomato sauce, mixing well. Reduce heat to low, and simmer for 15 minutes. Season with salt to taste. Remove from heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the filling and assembly: Preheat oven to 375 degrees. In a medium skillet over medium heat, heat oil until shimmering. Add tofu and cook until brown and somewhat crispy, and its liquid has evaporated, stirring from underneath to prevent sticking, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once tofu looks brown and cooked on all sides, add two-thirds of the onion and half of the red bell pepper. Stir, and add garlic, jalapeño, cilantro, cumin and chili powder; mix well. Add soy sauce, and mix well. Season with salt to taste. Sauté until the onions and red bell pepper begin to soften, 5 to 10 minutes. Add 1 to 2 tablespoons of water if mixture seems parched, but it should be dry, and the tofu should resemble crisped, browned bits of meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the tofu mixture is cooking, wrap the tortillas tightly in aluminum foil, and place them in the oven for 10 minutes. Remove, keeping them wrapped, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a shallow 9-by-7-inch casserole (or large enough to hold the enchiladas snugly in one layer), add 1/3 of the sauce to coat the bottom of the casserole. Unwrap the hot tortillas, and place one in the sauce to coat it, then turn it over so that it is coated on both sides. Add one-sixth of the filling, and roll the tortilla tightly. Place it seam side down on the sauce. Repeat to make six filled tortillas. Pour the remaining sauce on top of the tortillas, and sprinkle with remaining uncooked onion and red bell pepper. Bake until sauce is bubbling, about 15 minutes. Serve, if desired, with a green salad."}]}