{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Peppers With Red Rice, Chard and Feta", "description": "This filling of red rice, greens and feta, seasoned with fresh mint, is hearty and works very nicely with red peppers. Once your rice is cooked and greens are blanched it’s easily thrown together. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/15/science/17recipehealth/17recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch", "keywords": "bell pepper, chard, red rice, gluten-free, halal, healthy, kosher, low cholesterol, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "6 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "925 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["4 medium peppers, preferably red", "1 bunch Swiss chard, 12 ounces to 1 pound, stemmed and washed", "Salt to taste", "3 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "2 cups cooked red rice", "1/4 cup chopped mint", "2 ounces feta, crumbed", "1/2 cup water", "2 tablespoons fresh lemon juice", "1 tablespoon tomato paste (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tops away from the peppers and gently remove the seeds and membranes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, salt generously and add the chard leaves. Blanch 1 minute, until just tender, and transfer to a bowl of cold water. Drain, squeeze out water and chop medium-fine. You should have about 1 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large skillet or saucepan and add the garlic. Cook, stirring, until fragrant, about 30 seconds, and stir in the chard. Stir for about 30 seconds, until coated with oil and garlic, and season with salt and pepper. Stir in the rice, toss, together, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the rice mixture to a bowl and stir in the mint, feta and 1 tablespoon olive oil. Season to taste with salt and pepper.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the rice and chard mixture into the peppers and place the peppers upright in a lidded saucepan or skillet. Mix together the water, lemon juice, salt to taste, optional tomato paste and remaining olive oil and add to the pan. Bring to a simmer, reduce the heat, cover and simmer 40 minutes, until the peppers are tender. Remove the lid and allow to cool in the pan. Transfer to plates or a platter, spoon any liquid remaining in the pan over the peppers if desired, and serve."}]}