{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach With Garlic Yogurt and Walnut Dukkah", "description": "This is inspired by one of my favorite Middle Eastern spinach recipes. Use lush bunches of spinach from the farmers’ market. You will only need a small amount of dukkah for this dish, but since it keeps so well and makes a great snack, you might as well make a whole batch and keep what you don’t need on hand in a jar in the freezer or refrigerator.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/10/science/13recipehealth/13recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "mediterranean, middle eastern", "recipeCategory": "dinner, lunch", "keywords": "appetizer, side dish, fall, winter, gluten-free, halal, healthy, kosher, low cholesterol, low sugar, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 146, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "419 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup broken walnuts, very lightly toasted if desired", "1/4 cup lightly toasted sesame seeds", "2 tablespoons coriander seeds", "1 tablespoon cumin seeds", "2 teaspoons nigella seeds", "1 teaspoon ground sumac", "1/2 to 1 teaspoon mild chili powder or Aleppo pepper (optional)", "1/2 teaspoon kosher salt or coarse sea salt (or to taste)", "2 large bunches spinach (1 1/2 to 2 pounds), stemmed and washed in 2 rinses of water", "1 clove, ground", "2 allspice berries, lightly toasted and ground", "1/2 teaspoon cumin seeds, lightly toasted and ground", "1/8 teaspoon ground cinnamon", "1 garlic clove, cut in half, green shoots removed (more to taste)", "Salt to taste", "2/3 cup drained yogurt or Greek yogurt", "1 tablespoon extra virgin olive oil", "1/4 to 1/2 cup pomegranate seeds for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dukkah. Chop the walnuts very fine. Mix with the toasted sesame seeds in a bowl. In a dry skillet lightly toast the coriander seeds just until fragrant and immediately transfer to a spice mill. Allow to cool. In the same skillet toast the cumin seeds just until fragrant and transfer to the spice mill. Allow to cool. When the spices have cooled, grind and add to the nuts and sesame seeds. Add the nigella seeds, sumac, chili powder and salt and mix together. Measure out 2 tablespoons and store the remainder of the dukkah in a jar in the refrigerator or the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the spinach over 1 inch of boiling water until wilted, 1 to 2 minutes (or a little longer, depending on how much spinach you have in your steaming basket; you may have to do this in batches). Turn the leaves with tongs about halfway through the steaming. My pot of choice for this is a pasta pot with an insert. Remove from the heat, rinse briefly with cold water and squeeze out excess water. If desired, chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the ground clove, allspice, cumin and cinnamon for the spinach, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar and pestle, combine the garlic and a generous pinch of salt and mash to a paste. Stir into the yogurt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy skillet and add the ground clove, allspice, cumin and cinnamon mix. Cook until the mixture begins to sizzle, add the spinach and salt and pepper to taste. Cook, stirring, until the spinach is heated through and coated with the oil, 2 to 3 minutes. Transfer to a serving dish and spoon the yogurt over the top. Sprinkle the dukkah over the yogurt, garnish with pomegranate seeds, if desired, and serve."}]}