{"@context": "http://schema.org", "@type": "Recipe", "name": "Cucumber and Radish Salad With Yogurt and Cumin", "description": "This is based on a recipe from Mark Peel’s “New Classic Family Dinners.” Slice the cucumbers and radishes as thin as you can.  I use an inexpensive plastic Japanese mandolin for this. (Make sure to use the guard so you don’t cut your fingertips!) I eat this as a salad and also as a delicious bruschetta or crostini topping.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/08/31/science/02recipehealth/02recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "easy, quick, salads and dressings", "keywords": "cucumber, radish, yogurt, gluten-free, halal, healthy, kosher, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 46, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "348 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound cucumbers, peeled if the skin is thick, preferably seedless (Japanese, Persian or hothouse)", "Salt to taste\n", "1 medium-size bunch radishes (about 5 ounces), trimmed and sliced very thin\n", "1/2 to 3/4 teaspoon black sesame seeds or nigella seeds (to taste)\n", "1/2 teaspoon cumin seeds, lightly toasted and ground\n", "1/8 to 1/4 teaspoon freshly ground black pepper (to taste)\n", "1/8 teaspoon turmeric\n", "1/2 teaspoon curry powder\n", "1/3 cup thick Greek style yogurt\n", "1 small garlic clove, puréed\n", "1 tablespoon fresh lemon juice\n", "Chopped chives for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cucumbers in half and using a teaspoon, scoop out seeds if necessary. Slice paper-thin. Toss with a generous amount of salt and place in a colander over a bowl or in the sink for 10 minutes. Place in a bowl of cold water and swish them around, then salt again and let sit for another 10 minutes. Rinse and drain on a clean kitchen towel. Transfer to a salad bowl and add the radishes and sesame seeds or nigella seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl stir the cumin, pepper, turmeric and curry powder into the yogurt. Whisk in the garlic and lemon juice. Add salt to taste. Toss with the cucumbers and radishes, garnish with chopped chives and serve, or refrigerate until ready to serve.\n"}]}