{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Pumpkin Creme Brulee With Ginger-Dusted Churros", "description": "This recipe came to The Times from Bruno Davaillon, the executive chef of the celebrated Rosewood Mansion on Turtle Creek restaurant in Dallas. When this combination of cold crème brulee and hot churros (deep-fried pastries dusted with cinnamon sugar) appeared on the Mansion menu, it “took off right away,’’ says Mr. Davaillon. Use a star-shaped piping tool to make the churros about three to four inches long and up to a ½ inch in diameter. They can be piped out a day early and fried at the last minute before serving.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2010/11/18/health/18wellpumpkin/18wellpumpkin-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "candied ginger, pumpkin purée, dessert, fall, kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1156, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "112 grams", "cholesterolContent": null, "fatContent": "68 grams", "fiberContent": "4 grams", "proteinContent": "25 grams", "saturatedFatContent": "35 grams", "sodiumContent": "210 milligrams", "sugarContent": "43 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups heavy cream", "1 cup milk", "1 vanilla bean", "1/2 teaspoon cinnamon", "1/2 teaspoon allspice", "1/4 teaspoon dried ginger", "2/3 cup (5 ounces) sugar", "20 egg yolks", "1 cup pumpkin puree", "Oil for deep frying", "2 cups water", "2 cups milk", "1 pinch salt", "2 tablespoons sugar", "4 cups all-purpose flour", "4 egg whites, beaten", "1 ounce candied ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees Fahrenheit. In a saucepan, combine cream, milk, vanilla bean and spices and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk sugar into egg yolks until fully incorporated. Slowly whisk egg mixture into hot liquid until fully incorporated. Whisk in pumpkin puree."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into ramekins or a brulee mold. Place the ramekins in a cake or baking pan, and add enough hot water to the pan to come halfway up the sides of the ramekins. Bake in water bath until custard is set, about 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the churros. Preheat oil in a fryer to 375 degrees. In a saucepan, combine water, milk, salt and sugar and bring to a boil. Whisk flour into the mixture in small batches until fully incorporated. Remove from heat and add the egg whites, mixing until the texture is completely smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pastry bag fitted with a churro tip, pipe the batter into the hot oil in 2-inch strips and fry until golden brown. Drain on paper towel, and roll hot churros in chopped candied ginger and granulated ginger."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve the brulee: Sprinkle top with granulated sugar and caramelize with a torch. Serve with churros."}]}