{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Macaroni and Broccoli and Mushrooms and Cheese", "description": "This mac 'n' cheese, adapted from the book \"Real Food Has Curves\" by Bruce Weinstein and Mark Scarbrough, is quicker and easier to make than the classic casserole. It is hearty comfort food that easily functions as a main dish for vegetarians.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2010/11/02/health/02well_mac/02well_mac-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Makes six side-dish servings.", "recipeCuisine": "", "recipeCategory": "", "keywords": "broccoli, macaroni, mushroom, fall, kosher, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 375}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 353, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "19 grams", "saturatedFatContent": "7 grams", "sodiumContent": "482 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces grated Cheddar", "2 ounces finely grated Parmigiano-Reggiano or other hard cheese", "1 tablespoon unsalted butter", "1 small yellow onion, chopped", "6 ounces cremini or white button mushrooms, sliced", "3 tablespoons unbleached all-purpose flour", "3 cups low-fat or fat-free milk", "1 tablespoon Dijon mustard", "1 tablespoon minced tarragon leaves or 2 teaspoons dried tarragon", "1/2 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "8 ounces dried whole-wheat pasta shells (not the large ones for stuffing), cooked and drained according to the package instructions", "4 cups small broccoli florets, cooked in boiling water for 1 minute (broccoli can be added to the pasta during the last minute of cooking, then drained with the pasta in a colander)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the Cheddar and Parmigiano-Reggiano in a medium bowl. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a large, high-sided, oven-safe skillet. Add the onion and cook, stirring often, until softened, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mushrooms and cook until they release their liquid and it comes to a simmer, and then reduces by about two-thirds, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the flour over the vegetables in the skillet. Stir well to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the milk in a steady, thin stream until creamy. Then whisk in the mustard, tarragon, salt and pepper. Continue whisking until the mixture starts to bubble and the liquid thickens, about 3 minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the skillet from the heat. Stir in three-quarters of the mixed cheeses until smooth. Then stir in the cooked pasta and broccoli."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler after setting the rack 4 to 6 inches from the heat source. Meanwhile, sprinkle the remaining cheese over the ingredients in the skillet. Set the skillet on the rack and broil until light browned and bubbling, about 5 minutes. (If your skillet has a plastic or wooden handle, make sure it sticks outside the oven, out from under the broiler, so the handle doesn’t melt.) Cool for 5 to 10 minutes before dishing up."}]}