{"@context": "http://schema.org", "@type": "Recipe", "name": "Fennel and Orange Salad With Black Olives on a Bed of Couscous", "description": "A salad, modeled on a traditional North African one, that is great for buffets. \nThe salad is modeled on a traditional North African salad of oranges, onions and olives. I substitute thinly sliced fennel for the onions, and serve it over a bed of steamed couscous. You could serve it on its own, but it is a shame to leave so much juice behind in the bowl, and the couscous soaks it up in a delicious way. The dish is a great idea for buffets as it stands up well over the course of a few hours.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/12/24/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 6", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch, quick, salads and dressings", "keywords": "appetizer, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "7 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "547 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons fresh lemon juice", "Salt to taste", "1 1/2 teaspoons mild honey or sugar", "1 teaspoon crushed cumin seeds", "6 tablespoons extra virgin olive oil", "Pinch of cayenne (optional)", "1 cup couscous", "Salt to taste", "2 medium fennel bulbs (about 1 1/4 pounds), quartered and cored", "2 tablespoons chopped imported black olives (about 1/2 ounce), plus 12 imported black olives, pitted and halved", "4 navel oranges or 6 to 8 Valencia oranges (depending on the size)", "Chopped fresh parsley or fennel fronds for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Reconstitute the couscous. Place it in a bowl, add salt to taste and cover by 1/2 inch with hot water. Let sit until all of the water has been absorbed by the couscous, stirring every once in a while. Cover the bowl with a plate and place in the microwave. Microwave for 3 minutes. Carefully remove from the microwave (the bowl will be hot). Uncover and fluff with forks. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup, whisk together the ingredients for the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove tough outer layers of the fennel bulb and discard. Using a sharp knife or a mandolin, slice the fennel quarters as thin as you can. Place in a bowl and toss with half the dressing and the chopped olives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the couscous into a wide bowl or onto a platter and smooth to make an even layer. Arrange the fennel on top, making sure to tip out any dressing from the bottom of the bowl over the fennel and couscous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away the peel and pith from the oranges and slice into thin rounds. Tip any juice that runs out of the oranges as you are working with them over the fennel. Arrange the orange slices over the fennel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the remaining dressing over the oranges. Arrange the halved olives on top, sprinkle with chopped parsley or fennel fronds and serve, or refrigerate until ready to serve."}]}