{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Ma Po Tofu", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H", "recipeYield": "2 servings", "recipeCuisine": "chinese", "recipeCategory": "easy, weekday", "keywords": "main course, tofu, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 356, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "4 grams", "proteinContent": "22 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1286 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "1/2 teaspoon ground Szechwan pepper, plus additional as needed", "1 tablespoon garlic, finely chopped", "2 tablespoons vegetarian oyster sauce", "1 tablespoon hot bean paste (also known as spiced broad bean sauce), or as needed", "1 tablespoon soy sauce", "1 teaspoon sugar", "1 teaspoon chili (hot) sesame oil, plus additional for drizzling", "Half a Thai bird’s-eye chili, seeded and minced", "Freshly ground white pepper", "2 teaspoons black Chinese vinegar, or balsamic vinegar", "1 16-ounce package of silken tofu, drained and cut in 3/4 inch cubes", "1/4 cup minced Chinese preserved vegetable (mustard green root)", "2 teaspoons cornstarch", "1 tablespoon ginger, julienned and placed in a bowl of cold water", "12  coriander leaves, whole, plus stems, minced", "1 tablespoon minced red bell pepper."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok over medium heat, heat olive oil until shimmering. Add 1/2 teaspoon Szechwan pepper, and stir rapidly for 30 seconds. Add garlic, and stir rapidly for 30 seconds. Remove wok from heat, and add oyster sauce, 1 cup water, hot bean paste, soy sauce, sugar, 1 teaspoon chili sesame oil, Thai chili, a pinch of white pepper, vinegar and tofu."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place wok over high heat and cook until bubbling, about 3 to 5 minutes.Add the preserved vegetable.  As it begins to heat up, adjust hot bean paste as desired, a teaspoon at a time, up to 3 teaspoons. (This amount will make it tear-inducing hot, the fieriness that Susur Lee likes.) The sauce will begin to thicken, just slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix cornstarch with 1/4 cup cold water. Pour into the wok, stirring very gently,so as not to break up the tofu. Simmer until sauce is glossy, 30 seconds to 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a medium serving bowl, and garnish with drained julienned ginger, coriander leaves and stems, a drizzle of sesame oil, red bell pepper, and, if desired, a sprinkle of Szechwan pepper. If desired, serve with rice."}]}