{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Pumpkin Cheesecake", "description": "This vegan “cheesecake,” which is adapted from “Vegan Pie in the Sky” by Isa Chandra Moskowitz, may not fool everyone at the table, but it will definitely satisfy them. Silken tofu, cashews and banana make it extra creamy, while lemon juice and orange zest provide the tang you’d normally get from cream cheese. (Be sure to soak the cashews long enough; you want them to completely disappear into the batter upon blending.) This dessert can be made in a pie dish or a springform pan, but if you make it in a pie dish, keep an eye on the crust as it bakes; tent the cheesecake with foil if the edges are getting too brown.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2019/10/24/dining/vegan-pumpkin-cheesecake/merlin_163201941_ecf7a99b-6b14-4bd5-b06c-e009ed4224ef-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "custards and puddings, pies and tarts", "keywords": "banana, cashew, coconut oil, margarine, pecan, pumpkin purée, soy milk, tofu, dairy-free, kosher, vegan, vegetarian, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 243}, "recipeIngredient": ["1 3/4 cups graham cracker crumbs (made from 10 ounces of whole graham crackers)", "3 tablespoons sugar", "4 tablespoons melted nonhydrogenated margarine, melted coconut oil or canola oil", "1 tablespoon plain soy milk or almond milk", "1/2 cup whole unroasted cashews, soaked in water for 2 to 8 hours, or until very soft", "1/4 cup mashed banana (about 1 medium-size banana)", "1 (12- to 14-ounce) package silken tofu, drained", "1/2 cup sugar", "1/3 cup dark brown sugar", "3 tablespoons coconut oil, room temperature", "6 teaspoons cornstarch", "2 tablespoons lemon juice", "2 1/2 teaspoons pure vanilla extract", "1/4 teaspoon orange extract or 1 teaspoon grated orange zest", "1/4 teaspoon fine sea salt", "1 1/4 cups canned pumpkin purée", "3/4 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "1/4 teaspoon ground nutmeg", "1/3 cup brown sugar", "1 tablespoon nonhydrogenated margarine", "Pinch of salt", "1 cup pecan pieces, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the crust", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and lightly spray a 9-inch pie plate or springform pan with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine the graham cracker crumbs and sugar. Drizzle in the oil or melted margarine. Use a spoon to blend the mixture thoroughly to moisten the crumbs, then drizzle in the soy milk and stir again to form a crumbly dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the crumbs into the pie plate or springform pan. Using your fingers or a flat-bottom cup, press crumbs into the the bottom and up the sides of the pan. Bake for 8 to 10 minutes until firm. Let the crust cool before filling."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the pie", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: In a mixing bowl, use a fork to mash together brown sugar, margarine and salt until crumbly, then fold in the chopped nuts and stir to coat with the mixture. Set aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: Drain the cashews and blend with the banana, tofu, sugar, brown sugar, coconut oil, cornstarch, lemon juice, vanilla and orange extracts, and sea salt. Blend until completely smooth and no bits of cashew remain. Add the pumpkin purée, cinnamon, ginger and nutmeg and blend until smooth, then pour it onto the crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cheesecake for 45 to 50 minutes, removing the cheesecake halfway through the baking period to sprinkle on the topping. Return to oven to continue baking. Cheesecake will be done when the top is lightly puffed and the edges of the cake are golden. Remove it from the oven and let cool on a rack for 20 minutes, then transfer to the refrigerator to complete cooling, at least 3 hours or, even better, overnight. To serve, slice the cake using a thin, sharp knife dipped in cold water."}]}]}