{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Chops With Shiitake Mushrooms", "description": "In this simple dish, thick pork chops are pan-seared, then finished in the oven. Served with a pungent grainy mustard vinaigrette and crisp-edged shiitake mushrooms, it makes a tasty, hearty weeknight meal.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/09/04/dining/clark-pork-chops-horizontal/merlin_143203776_e4d66105-df7a-423e-9614-eaae17348ce4-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, mushroom, pork, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 241}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 695, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "2 grams", "proteinContent": "43 grams", "saturatedFatContent": "10 grams", "sodiumContent": "707 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon Dijon mustard", "2 teaspoons whole-grain mustard", "1/2 cup plus 3 tablespoons safflower or grapeseed oil", "1 tablespoon sherry vinegar", "4 bone-in pork chops (1 1/4-inch thick)", "Kosher salt and black pepper, to taste", "1/2 pound small shiitake mushrooms, stemmed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. In a medium bowl, whisk together the mustards, 1/2 cup of oil and sherry vinegar until thoroughly blended. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large cast-iron skillet over medium heat. Add 1 tablespoon remaining oil. Meanwhile, season pork chops on both sides with salt and pepper. Set aside to absorb the seasoning for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil begins to smoke, add the shiitake mushrooms to the pan, brown side down, in a single layer. Cook, undisturbed, for 3 to 5 minutes over medium heat until the caps are seared all over. Using kitchen tongs, turn mushrooms on their other side and cook for a few more minutes until golden. Transfer mushrooms to a plate and set aside. Wipe skillet of any excess oil with a wad of paper towels and set over medium heat once again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 2 tablespoons of oil to the skillet. When it begins to smoke, add the pork chops in a single layer (you may have to do this in two batches). Cook the pork chops over high heat until the first side is browned, 6 to 8 minutes, depending on thickness. Flip over the pork chops and place the skillet in the center of the oven. Cook for an additional 6 to 8 minutes or until done to taste. Remove the skillet from the oven and allow the pork chops to rest, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the pork chops on a serving platter. Top with mustard vinaigrette and mushrooms. Serve immediately."}]}