{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Pea Guacamole", "description": "Adding fresh English peas to what is an otherwise fairly traditional guacamole is one of those radical moves that is also completely obvious after you taste it. The peas add intense sweetness and a chunky texture to the dip, making it more substantial on the chip. They also intensify the color of the green avocado — and help the guacamole stay that way. Pea guacamole keeps its bright hue in the fridge for a few days without turning brown around the edges. A good dose of lime juice helps this cause. This dish, a collaboration between ABC Cocina’s chef-owner, Jean-Georges Vongerichten, and his chef de cuisine, Ian Coogan, is the best kind of greenmarket tweak upon a classic.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/09/14/dining/mc-green-pea-guacamole-horizontal/merlin_143416878_62a82be1-3e63-4da2-ba43-06ec39b38ce6-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dips and spreads", "keywords": "appetizer, avocado, peas, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 471}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 112, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "5 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "211 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1/2 pound fresh sweet peas, shucked (about 1/2 to 2/3 cup peas)", "2 small jalapeños", "2 tablespoons packed cilantro leaves, chopped, more for garnish", "3/4 teaspoon salt, more as needed", "3 small ripe avocados, mashed", "2 scallions, whites only, sliced as thin as possible (about 1/4 cup)", "Zest of 1 lime", "Juice of 1 lime, more as needed", "1 tablespoon toasted sunflower seeds", "Flaky sea salt, for serving", "Tortilla chips, for serving", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of salted water to a boil and prepare a bowl with water and ice. Plunge peas into the boiling water and cook until al dente, about 1 minute. Drain peas and immediately transfer to the ice bath. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler to high and broil one of the jalapeños on a heatproof pan. Cook, turning occasionally, until jalapeño is completely charred. Transfer to a small bowl, cover tightly in plastic wrap and let sit for 15 minutes. When cool enough to handle, use a towel to wipe off the charred skin. Halve, seed and devein the roasted jalapeño. Then halve, seed, and mince the remaining raw jalapeño."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender or the bowl of a food processor, purée peas (reserving 2 tablespoons for garnish) with roasted jalapeño, minced raw jalapeño, cilantro and 1/4 teaspoon salt. Process until almost smooth but still a little chunky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine mashed avocado, scallions, lime zest, lime juice, remaining 1/2 teaspoon salt and the pea purée. Adjust salt and lime juice as needed and garnish with fresh peas, sunflower seeds and flaky sea salt. Serve with tortilla chips and lime wedges."}]}