{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Bread With Maple Butter", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/06/18/dining/20130618BREAD/20130618BREAD-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Makes one 8-inch loaf", "recipeCuisine": "", "recipeCategory": "", "keywords": "butter, maple syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "recipeIngredient": ["2 tablespoons wood chips for smoking, such as Cameron’s", "165 grams all-purpose flour (about 1 1/4 cups), more as needed", "160 grams whole-wheat flour (about 1 1/4 cups)", "1 3/4 teaspoons active dry yeast", "7 tablespoons extra-virgin olive oil, plus more as needed", "5 grams kosher salt (1 1/2 teaspoons)", "5 grams sugar (1 teaspoon)", "Flaky sea salt", "1/2 cup (1 stick) unsalted butter, at room temperature", "1 tablespoon maple syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To rig up a stovetop smoker, take a large stockpot with a tightfitting cover and line the bottom with foil. Pour in wood chips. Place a steamer basket in the pot, removing the center shaft if necessary (it unscrews). Put all-purpose and whole wheat flours in a round 9-inch cake pan. Place the cake pan in the pot. Cover the pot with the lid and then cover the seal around the pot with more foil to ensure that no smoke escapes. Turn heat to high under the pot for about 5 minutes to start the smoke (you should smell it), then turn off heat and let sit for 30 minutes. Remove the cake pan of flour and let flour cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 3/4 cup lukewarm water (105 to 115 degrees) in a large bowl or in the bowl of a stand mixer. Sprinkle yeast over it. Let stand until foamy, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir 5 tablespoons of oil, salt and sugar into yeast mixture. Stir in smoked flour until a soft dough forms (you may need to add more all-purpose flour or some water, depending on the consistency of your dough, you want it soft but not sticky)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a floured surface. Knead until smooth and elastic, about 10 minutes, or knead in a stand mixer with a dough hook attached for about 5 minutes. If using a stand mixer, finish dough by hand, on a floured surface, for 1 minute. Add more all-purpose flour if dough feels very sticky (you want damp but not unworkable dough)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a large bowl. Place dough in bowl and turn to coat it lightly with oil. Cover bowl with a dish towel. Leave in a warm place until dough has doubled in size, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an 8- or 9-inch loaf pan add remaining 2 tablespoons of oil. Transfer the dough to the loaf pan, cover with a dish towel and let rest for 20 to 30 more; the dough should rise somewhat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, mix together the softened butter and maple syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Brush the top of the dough with olive oil and sprinkle lightly with flaky sea salt. Bake for 30 to 35 minutes or until the top is golden brown and the bottom of the loaf sounds hollow when tapped. Transfer pan to a wire cooling rack and let cool 10 minutes before removing bread from loaf pan to finish cooling on the rack. Serve warm or at room temperature, slathered with maple butter."}]}