{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Porcini Risotto", "description": "This recipe, adapted from the slow-cooking maven Lorna Sass, proves that pressure cookers shouldn’t be associated with overcooked food. The rice turns out perfectly in the end, and you save a lot of time and effort. It’s finished off with peas for a bit of color, and the usual cheese, salt and pepper. It’s a meal that will justify buying that pressurized pot.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/08/09/dining/09COOKING-PADTHAI3/09COOKING-PADTHAI3-mediumThreeByTwo440.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, weekday", "keywords": "main course, side dish, parmesan, porcini, risotto", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 712}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 436, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "5 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "853 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon olive oil or butter", "1/2 cup finely chopped onions", "1 1/2 cups arborio rice", "1/2 cup dry white wine or dry vermouth", "3 to 3 1/2 cups chicken or vegetable broth", "1 ounce dried porcini, broken into bits", "1 cup frozen peas", "1/2 cup grated Parmesan, plus more to pass at the table", "Salt and freshly ground pepper to taste", "2 tablespoons chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over high heat in a 2 1/2-quart or larger stovetop pressure cooker, or in an electric pressure cooker using the sauté function. Add the onions, and cook for 1 minute, stirring frequently. Stir in the rice, taking care to coat it with the oil. Cook for 30 seconds, stirring constantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine. Cook over high heat until the rice has absorbed the wine, about 30 seconds. Stir in 3 cups of the broth and the porcini, taking care to scrape up any rice that might be sticking to the bottom of the cooker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lock the lid in place. Over high heat, bring to high pressure. Reduce the heat just enough to maintain high pressure, and cook for 4 minutes. Turn off the heat. Quick-release the pressure by setting the cooker under cold running water. Remove the lid, tilting it away from you to allow the steam to escape. If using an electric cooker, cook at high pressure for 4 minutes. Manually release the pressure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the cooker over medium-high heat or turn on the sauté function, and stir vigorously. The risotto will look fairly soupy at this point. Boil while stirring every minute or so, until the mixture thickens and the rice is tender but still chewy, 1 to 4 minutes. Stir in the peas when the rice is almost done. (if the mixture becomes dry before the rice is done, stir in the extra 1/2 cup of broth. The finished risotto should be slightly runny; it will continue to thicken as it sits on the plate.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat. Stir in the Parmesan, and salt and pepper to taste. Serve immediately, garnished with a little parsley. Pass extra Parmesan\nat the table."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Under pressure: Porcini Risotto", "description": "Mark Bittman makes Porcini Risotto with Lorna Sass, a cookbook author and pressure-cooking expert. ", "thumbnailUrl": "https://static01.nyt.com/images/2017/08/09/dining/09COOKING-PADTHAI3/09COOKING-PADTHAI3-mediumThreeByTwo440.jpg", "uploadDate": "2013-12-19T15:49:23.000Z", "duration": "PT1M51S"}}