{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken in a Pot", "description": "Serve this as a stew, with everything in the bowl, or as a plain broth, followed by the chicken and vegetables on a platter. Canned stock is a decent option here, as is water, because the cooking liquid gains flavor from the chicken and vegetables during simmering. Of course, real stock is the best option.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "recipeIngredient": ["1 whole chicken", "8 cups chicken stock", "3 onions, quartered", "2 large or 4 small to medium carrots, cut into chunks", "2 leeks, split, trimmed, cleaned, and cut into 2-inch lengths", "1 bay leaf", "4 allspice berries", "10 whole black peppercorns", "4 sprigs fresh thyme or 1 teaspoon dried thyme", "Salt and freshly ground black pepper", "Minced fresh parsley or dill for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken in a large pot with the stock, onions, carrots and leeks. Bring to a boil over medium-high heat, then immediately reduce the heat to medium-low. Skim any foam that rises to the surface. Add the bay leaf, allspice, peppercorns and thyme to the pot along with some salt and pepper. Simmer until the chicken and vegetables are nearly tender and the chicken is cooked through, about 45 minutes; the bird is done when a thermometer inserted into the thickest part of the thigh reads 155 to 165 degrees. With 15 minutes of cooking time remaining, heat the oven to 200 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chicken is done, use a slotted spoon to transfer it and the vegetables to an ovenproof platter in the oven. Raise the heat to high and boil the stock until it reduces by about 25 percent, 10 or 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the stock into a large bowl or another large pot; taste and adjust the seasoning. Serve the soup as a first course, garnished with parsley or dill, followed by the chicken and vegetables, or cut the chicken up and serve everything in deep bowls, garnished with parsley or dill."}]}