{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Soufflé", "description": "This soufflé, adapted from Mark Bittman's famous tome, \"How to Cook Everything,\" is rich, fluffy and very easy. You can also make orange or Grand Marnier variations. If you want to make individual soufflés, use a little more butter and grease four 1 1/2- to 2-cup ramekins.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/05/03/dining/03COOKING-LEMONSOUFFLE2/03COOKING-LEMONSOUFFLE2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, custards and puddings", "keywords": "dessert, grand marnier, lemon, orange juice", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 193}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 236, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "111 milligrams", "sugarContent": "38 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["About 1 teaspoon unsalted butter for the dish", "1 cup sugar, plus some for the dish", "6 eggs, separated", "1 tablespoon minced or grated lemon or orange zest", "1/4 cup freshly squeezed lemon or orange juice or Grand Marnier or other orange-flavored liqueur", "Pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a 2-quart soufflé or other deep baking dish. Sprinkle the dish with sugar, invert it, and tap to remove excess sugar. Set aside and heat the oven to 350 degrees. Whisk the egg yolks with 3/4 cup of the sugar until light and very thick; the mixture will fall in a ribbon from the ends of the beaters when it is ready. Beat in the flavorings and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites with the salt until they hold soft peaks; continue to beat, gradually adding the remaining 1/4 cup sugar, until they are very stiff but still glossy. Stir a good spoonful of them thoroughly into the egg yolk mixture to lighten it, then fold in the remaining whites, using a rubber spatula or your hand. Transfer to the prepared soufflé dish(es) and bake until the center is nearly set, 25 to 35 minutes (15 to 25 minutes for individual soufflés). Serve immediately."}]}