{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Small Peppers Filled With Feta and Quinoa", "description": "The starting off point for this recipe is a classic Balkan cheese-stuffed pepper dish that I enjoyed frequently over the course of a long ago summer spent in Croatia. The peppers that are traditionally used for this are small, thin-skinned green peppers that taper to a single tip. These aren’t easy to find locally, but I have recently found “baby bell peppers” that are the perfect size for this. I also make these stuffed peppers with Anaheims, which are spicy. The authentic filling is made with feta, herbs and egg only, but I decided to introduce some quinoa or bulgur to stretch the filling and make the peppers more substantial.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2013/10/15/science/15recipehealth/15recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "8 servings as an hors d’oeuvre or 4 as a side dish", "recipeCuisine": "eastern european", "recipeCategory": "", "keywords": "appetizer, side dish, feta, quinoa, sweet pepper, halal, healthy, high fiber, kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 126, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "135 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["8 small sweet peppers, either baby bell or Italian peppers, about 1 pound", "1 egg yolk", "3 ounces feta, crumbled (about 3/4 cup)", "1/2 cup cooked quinoa or bulgur", "2 tablespoons finely chopped fresh parsley or mint", "Freshly ground pepper", "2 tablespoons unbleached all-purpose flour", "2 to 3 tablespoons sunflower or grapeseed oil, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the peppers over a flame or under the broiler until charred. Place in a bowl, cover tightly and allow to cool. Remove the skins and wipe the surface with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the tip of a paring knife, make a lengthwise slit down the middle of each pepper and carefully pull out the seeds and membranes and remove the stems and seed pods at the top. Open the peppers up on your work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl beat together the egg yolk and the feta until amalgamated. Add the quinoa or the bulgur and the chopped herbs and stir together. Season with pepper (there’s plenty of salt in the feta). Place a spoonful of filling down the middle of each pepper and fold the sides in over the filling, overlapping the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a wide skillet. Place the flour on a plate. Lightly dredge the peppers in the flour. Fry the peppers gently until nicely browned, 3 to 4 minutes on each side. Use tongs to turn them. Drain on paper towels. Serve hot, warm or room temperature."}]}