{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Flanken With Pomegranate", "description": "I’d always thought that flanken was specific to boiled beef or soup. But a little research divulged that the brawny cut is hugely popular in braises (and pot-roasting is arguably the same as braising), especially in Germany, Austria and Hungary. It also shines in Asian cuisines, particularly Korean, in which it’s seared and served rare.\n\nArthur Schwartz, in his book “Jewish Home Cooking” (Ten Speed Press, 2008), extols the virtues of flanken. He points out that it’s from the same part of the animal as short ribs, cut across rather than along the bones. But while short ribs have achieved culinary stardom and high prices, flanken remains cheap and obscure. And just as tasty.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/flanken-still/flanken-still-articleLarge.jpg", "totalTime": "PT2H40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "flanken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 982, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "77 grams", "fiberContent": "3 grams", "proteinContent": "50 grams", "saturatedFatContent": "24 grams", "sodiumContent": "601 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 pounds flanken ribs", "1/2 teaspoon salt, more to taste", "1/2 teaspoon freshly ground black pepper, more to taste", "2 tablespoons extra-virgin olive oil", "3 medium carrots, peeled and diced", "3 medium celery stalks, diced", "2 leeks, white and light green parts, cleaned, quartered lengthwise and chopped", "2 garlic cloves, finely chopped", "1 shallot, chopped", "1/2 cup pomegranate juice", "1/3 cup dry red wine", "2 cups chicken stock, or as needed", "3 thyme branches (see note)", "1 rosemary branch", "1 bay leaf", "3 whole cloves", "1 1/2 tablespoons pomegranate molasses (optional)", "1/3 cup pomegranate seeds", "2 tablespoons chopped fresh cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Season meat generously all over with salt and pepper. Heat a large ovenproof Dutch oven over medium-high heat. Sear meat in batches until dark golden, 3 to 4 minutes a side. Transfer meat to a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add oil to pan and sauté carrots, celery, leeks, garlic and shallot until vegetables are softened and slightly caramelized, about 5 minutes; season lightly with salt and pepper. Add pomegranate juice and wine, and cook, scraping browned bits from bottom of pan, until most of the liquid is evaporated, about 2 minutes. Stir in the stock, thyme, rosemary, bay leaf, cloves, 1/2 teaspoon salt and 1/2 teaspoon pepper. Return meat to pot. Liquid should reach halfway up sides of meat. If not, add a little more stock or water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover pot and transfer to oven. Cook, turning meat every 30 minutes until fork tender, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have time, let meat cool and chill overnight. The next day, remove fat from surface, then reheat over low heat. Stir in the pomegranate molasses if using, and sprinkle with pomegranate seeds and cilantro just before serving."}]}