{"@context": "http://schema.org", "@type": "Recipe", "name": "Trahana With Mushrooms", "description": "When trahana is cooked in broth, the broth thickens slightly, as it does when you make risotto with Arborio rice. I make this savory, comforting mixture of mushrooms and trahana the same way I make risotto, adding the broth gradually and stirring vigorously from time to time. You may not need to use all of the broth but it is good to have this much just in case. If you make it ahead and reheat, you will want to add some broth, so don’t throw out what you don’t use.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/21/science/24recipehealthmushrooms/24recipehealthmushrooms-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, spring, summer, winter, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 289, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "9 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "828 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce (about 1 heaped cup) dried mushrooms, preferably porcinis", "1 quart vegetable or chicken stock", "Salt to taste", "2 tablespoons extra virgin olive oil", "1/2 cup finely diced red or yellow onion", "1 1/2 pounds fresh cultivated or wild mushrooms (or a mix), cleaned, trimmed and cut in thick slices", "2 large garlic cloves, minced", "1/2 to 1 teaspoon fresh thyme leaves, or 1/4 to 1/2 teaspoon dried thyme, to taste", "<a href=\"http://cooking.nytimes.com/recipes/1016876-homemade-sour-bulgur-trahana-from-ikaria\">1 1/2 cups sour bulgur trahana</a>", "1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "Freshly ground pepper", "1/4 cup chopped fresh parsley", "1 ounce Parmesan cheese, grated (1/4 cup; more to taste) (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dried mushrooms in a bowl or in a pyrex measuring cup and pour on 3 cups boiling water. Let sit for 30 minutes. Line a strainer with cheesecloth or with a double thickness of paper towels, place it over a bowl and drain mushrooms. Squeeze mushrooms over the strainer to extract all the liquid, then rinse them in several changes of water to remove sand. Chop coarsely and set aside. Combine mushroom soaking liquid with additional vegetable or chicken stock to make 7 cups. Add salt to taste if stock is not already seasoned. Transfer to a saucepan and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of oil over medium heat in a large heavy skillet or wide saucepan and add onion. Cook, stirring, until just tender, about 5 minutes, and add dried and fresh mushrooms. Cook, stirring, until mushrooms begin to release liquid, about 3 minutes. Add garlic, thyme and a generous pinch of salt. Cook, stirring, until mushroom liquid has just about evaporated, and add the remaining oil and the trahana. Cook, stirring, until trahana is coated with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in wine and cook over medium heat, stirring, until wine is no longer visible in the pan. Stir in a ladleful or two of simmering stock, enough to just cover trahana. The stock should bubble slowly. Cook, stirring often, until it is just about absorbed. Add another ladleful of stock and continue to cook in this fashion, not too fast and not too slowly, adding more stock when trahana is almost dry, for 15 to 20 minutes, or until trahana is tender. Taste and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another small ladleful of stock to the trahana. Stir in parsley and Parmesan if using. The trahana should be creamy. Serve at once in wide bowls."}]}