{"@context": "http://schema.org", "@type": "Recipe", "name": "Crepes-Style Manicotti", "description": "For many Italian-American families, in New Jersey and elsewhere, the Thanksgiving smorgasbord doesn’t feel quite right without a little touch of red sauce. So you say: “Manicotti? That doesn’t really go with turkey and stuffing and cranberries.” What, you want to argue about it? Besides, Thanksgiving also represents an American expression of abbondanza, the Italian concept of too-muchness that makes a meal feel epic. \n\nHere, courtesy of Reservoir Tavern, which has been serving customers in the Boonton area since 1936, comes a recipe for baked manicotti that uses crepes in place of pasta. Nicola Bevacqua, a member of the family that owns the place, said that his own family digs into this melted-cheese masterwork each holiday, as do the New Jersey locals who drop by to pick it up. The crepes, he assured us, “are light and airy and will leave you plenty of room for the turkey.”", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19NEWJERSEY/19NEWJERSEY-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "10 to 12 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "crepes, marinara sauce, ricotta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 160}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "4 grams", "proteinContent": "28 grams", "saturatedFatContent": "14 grams", "sodiumContent": "874 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 large white onion, finely chopped", "5 garlic cloves, minced", "2 (28-ounce) cans crushed tomatoes", "1 (6-ounce) can tomato paste", "1/2 teaspoon kosher salt, plus more as needed", "1/2 teaspoon black pepper, plus more as needed", "1/8 teaspoon sugar", "4 fresh basil leaves, minced", "8 large eggs", "1 1/2 cups all-purpose flour", "1  1/8 teaspoon kosher salt", "2 tablespoons vegetable oil", "2 pounds ricotta", "2 cups shredded mozzarella (from about 10 ounces)", "1 cup grated Parmesan (from about 2 ounces)", "1 tablespoon minced fresh flat-leaf parsley", "1/8 teaspoon grated nutmeg", "1 cup grated pecorino Romano (from about 2 ounces), plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the marinara sauce:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large saucepan over medium heat. Add onion and garlic; sauté, stirring occasionally, until onion is translucent, 8 to 10 minutes. Add tomatoes, tomato paste, salt, pepper and sugar and bring to a gentle boil. Reduce heat to low and simmer, stirring occasionally, for 1 1/2 hours. Add basil, season to taste with salt and pepper, and let cool."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the crepes and filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the crepe batter: In a large bowl, whisk six eggs with 1 1/2 cups of water. Gradually add flour and 1/8 teaspoon salt, whisking gently until smooth. Cover and refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While batter chills, make the filling: In a large bowl, combine ricotta, mozzarella, Parmesan, the remaining two eggs, the parsley, 1 teaspoon salt, the pepper and the nutmeg. Cover and refrigerate until ready to assemble the manicotti."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees and lightly brush two 9-by 13-inch baking dishes with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crepes: Remove batter from fridge and whisk it briefly. Heat about 1/2 teaspoon vegetable oil in an 8-inch nonstick pan over medium heat. Add about 3 tablespoons of batter, lifting and swirling the pan to spread a thin, even layer of batter on the bottom of the pan. Cook until batter starts to appear dry, about 30 seconds, then carefully flip crepe over and continue cooking for another 30 seconds. Transfer to a wire rack to cool. Repeat with remaining crepe batter, adding oil every few crepes and adjusting heat as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the manicotti: Spread 3 to 4 tablespoons filling down the center of a crepe. Roll it up and place it, seam-side-down, in one of the baking dishes. Repeat with remaining crepes and filling. Divide marinara sauce between two baking dishes, spreading it evenly over the manicotti, then bake for 30 minutes. Sprinkle each baking dish with about 1/2 cup pecorino Romano and continue baking until the sauce is bubbling and the cheese is just starting to brown, about 10 minutes more."}]}]}