{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilean Cabbage and Avocado Slaw", "description": "Coleslaw meets guacamole here in this utterly simple mix of shredded cabbage, salt, lemon, and puréed avocado. The chef Iliana de la Vega, who was born in Oaxaca, Mexico, served it at a delicious Latin-themed lunch she prepared at the “Healthy Kitchens, Healthy Lives” conference this year at the Culinary Institute of America in Napa Valley. I couldn’t get enough of it. I sat with Iliana at the lunch and asked her about the salad. “Just salt the cabbage, let it sit for a while, then add lots of lemon juice and the mashed avocado,”  she said.  That really is all there is to it. Shred the cabbage thin and for best results let it sit, after salting generously, for an hour or more, to tenderize it and draw out strong-tasting juices.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/15/science/15recipehealth/15recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4", "recipeCuisine": "latin american", "recipeCategory": "dinner, lunch", "keywords": "appetizer, fall, spring, summer, winter, gluten-free, halal, kosher, low cholesterol, low-fat, low-sodium, low sugar, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 89}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 85, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "163 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1/2 large cabbage, cored and finely shredded (about 1 pound cabbage, which produces 5 cups shredded cabbage)", "Salt to taste", "4 to 5 tablespoons fresh lemon juice (more to taste)", "1 large or 1 1/2 medium-size ripe avocados", "Freshly ground pepper (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place shredded cabbage in a large bowl or colander and salt generously. Tossand rub the salt into cabbage with  your hands. Let sit for 1 hour or longer (refrigerate if longer than 1 hour). If cabbage tastes too salty, rinse,  then squeeze out excess moisture and transfer to a dry bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss cabbage with half the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Mash avocados in a mortar and pestle, or in a bowl using a fork, potato masher or a whisk. Add salt to taste and remaining lemon juice and mix until smooth. Scrape into the bowl with cabbage and stir together until shredded cabbage is thoroughly coated with mashed avocado. Taste and adjust salt. Add pepper if desired. If mixture isn’t creamy, add more avocado."}]}