{"@context": "http://schema.org", "@type": "Recipe", "name": "Screaming Eagle Cheese-Steak Sub", "description": "Every college has one: some kind of nasty-fantastic amalgam of cheese and meat and grease and bread and salt and melting awesomeness. From freshman year to graduation, you can eat these things twice a week and it will hurt you, but not badly — that is the magic of youth and appetite and America combined. After that, such a sandwich must be counted a special treat, and adapted to adult use. For this cheese steak sandwich, a version of the Screaming Eagle served in the dining halls of Boston College, the Jesuit university in Chestnut Hill, Mass., I made two essential changes: I used Cheddar in place of the usual white American the college uses; and I replaced the thin-shaved steak that is a hallmark of cheese steaks the world over with skirt steak. Doing so recalled Corinthians. When you are a child, American cheese and shaved steak can count as ambrosia. As an adult, it's kind of nasty. But skirt steak? Melting Cheddar? That is actually ambrosial. The fiery mayonnaise does the rest.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2011/03/27/magazine/mag-27Eat-t-000_CA0/mag-27Eat-t-000_CA0-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "sandwiches", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 412}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 975, "unsaturatedFatContent": "41 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "68 grams", "fiberContent": "4 grams", "proteinContent": "55 grams", "saturatedFatContent": "22 grams", "sodiumContent": "1316 milligrams", "sugarContent": "5 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["3/4 cup mayonnaise", "3 chipotle peppers in adobo sauce, minced, or more to taste", "2 tablespoons neutral cooking oil, like canola", "1 large white onion, peeled and sliced thin", "2 red bell peppers, seeded and sliced thin", "1 green bell pepper, seeded and sliced thin", "Kosher salt and freshly ground black pepper to taste", "1 tablespoon unsalted butter", "1 pound button mushrooms, cleaned and sliced thin", "2 1/2 pounds skirt steak, cut into 6 equal-size sections", "6 large sub rolls or Italian bread cut into 6 submarine-shaped pieces of 8 to 10 inches, sliced down the center", "1/2 pound sharp Cheddar cheese, sliced thin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make chipotle mayonnaise: Combine mayonnaise and minced peppers in a small bowl and stir well. (Leftover sauce may be covered and stored safely in the refrigerator for weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make toppings for sandwich: Heat a griddle or a large, heavy frying pan, ideally cast iron, over medium heat. Add oil to pan and, when it begins to shimmer, add the onion and peppers and stir to combine. Cook, stirring every so often, until they begin to soften and brown, approximately 15 to 20 minutes. Season to taste with salt and pepper, remove and set aside. Wipe pan, add butter and repeat process with mushrooms. Cook until they have released their juices and are soft and glazed, about 6 minutes. Remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make steaks: Heat griddle or frying pan over high heat until nearly smoking. Season meat aggressively with salt and pepper. Place steaks on griddle, working in batches if necessary, and cook for 3 minutes each side, until well browned but very rare. Remove to a serving platter and allow to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make sandwiches: Preheat oven to 200 degrees. When steaks are complete, slice them against the grain as thinly as possible. Place sub rolls in oven to warm. Return sliced steaks to griddle or frying pan, over medium heat, and add onions, peppers and mushrooms. Stir to combine, turn heat to low and cover with sliced cheese. Using tongs and a wide spatula, stir and pull to combine as cheese melts, approximately 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Remove rolls from oven and spread chipotle mayonnaise on the interior of each serving. Fill each sub with a mixture of meat, vegetables and cheese. Serve immediately."}]}