{"@context": "http://schema.org", "@type": "Recipe", "name": "Tuna Risotto from the Pantry", "description": "It’s amazing how close you can get to the flavor of a Venetian seafood risotto using ingredients in your pantry.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/01/health/nutrition/02recipehealth.risotto/02recipehealth.risotto-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 176}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 463, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "4 grams", "proteinContent": "25 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1181 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 5-ounce cans, water-packed light (not albacore) tuna", "7 cups chicken or vegetable stock", "2 to 4 garlic cloves (to taste), minced", "2 tablespoons olive oil", "3 tablespoons minced flat-leaf parsley", "1/2 cup minced onion", "2 to 3 anchovy fillets, soaked for 15 minutes in water to cover, rinsed and finely chopped (optional)", "1 (14-ounce) can tomatoes, drained and finely chopped", "1 1/2 cups Arborio rice", "Salt and freshly ground pepper to taste", "1/2 cup dry white wine, such as Pinot Grigio or Sauvignon Blanc", "Generous pinch of saffron", "1 cup thawed frozen peas"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the tuna over a bowl. Stir the tuna water into the chicken or vegetable stock. Taste and add more salt as needed for a well-seasoned stock. Break up the tuna in a bowl, and add to it 1 of the garlic cloves, 1 tablespoon of the olive oil, and the parsley. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the stock to a simmer in a saucepan and turn the heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining tablespoon of oil over medium heat in a large nonstick frying pan or wide saucepan and add the onion. Cook, stirring, until tender, about 5 minutes, and add the remaining garlic. Cook, stirring, for about a minute, until the garlic is fragrant, and stir in the anchovies and tomatoes. Cook, stirring, until the tomatoes have cooked down and the mixture is fragrant, 5 to 10 minutes. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice and cook, stirring, until the grains of rice are separate and well coated with the tomato mixture, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine and cook over medium heat, stirring constantly. The wine should bubble, but not too quickly. You want some of the flavor to cook into the rice before it evaporates. When the wine has just about evaporated, rub the saffron between your fingertips and stir in, along with a ladleful or two of the simmering stock, enough to just cover the rice. The stock should bubble slowly. Cook, stirring often and vigorously, until it is just about absorbed. Add another ladleful of the stock and continue to cook in this fashion, not too fast and not too slowly, adding more stock when the rice is almost dry, for 20 to 25 minutes. Taste a bit of the rice. It should taste chewy but not hard in the middle. Definitely not soft like steamed rice. If it is still hard in the middle, you need to keep adding stock and cook for another 5 minutes or so. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rice is cooked al dente, stir in the tuna mixture and peas and add another ladleful or two of stock and several twists of the peppermill. Stir for a couple of minutes, taste and adjust seasonings. The mixture should be creamy. Add a little more stock if it is not.  Spoon onto plates or wide soup bowls and serve."}]}