{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon Scallion Cream Sauce", "description": "Here we have a re-education — or an education, if you're a first-timer — in the virtues of an old-fashioned cream gravy. A few tablespoons of this elixir can uplift plainly cooked meat like a lamb chop or steak, layering on the richness of cream but also the freshness of scallion and black pepper. Use plenty of each.<br /><br />These days, home cooks are not likely to keep meat drippings around in the kitchen to make a fat-and-flour roux, but there's nothing wrong with hacking a substitute from a lump of butter and a slab of bacon. Then cook them together with flour to make a golden, toasty-smelling roux. After adding the broth and cream, the sauce will seem thin, but stay the course: don't even think of adding more flour. It takes a few minutes for the flour's starch to absorb the liquid. Take the gravy off the heat when it still seems a little too thin: it will thicken further at the table.  ", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/21/dining/Bacon-Scallion-Cream-Sauce/Bacon-Scallion-Cream-Sauce-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 1 1/2 cups", "recipeCuisine": "", "recipeCategory": "quick, condiments, dips and spreads, sauces and gravies", "keywords": "bacon, cream, scallion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 105}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 425, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "23 grams", "sodiumContent": "496 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons butter", "1 thick slice bacon, chopped", "3 tablespoons flour", "1 1/2 cups chicken stock", "3/4 cup heavy cream", "1 tablespoon cracked black peppercorns", "6 scallions, white and green parts, thinly sliced, plus extra for garnish", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy saucepan, melt butter over medium heat. Add bacon and cook for 3 to 5 minutes, until fat has rendered. Add flour, then stir together and cook over low heat, stirring often, until golden and toasty-smelling, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chicken stock and cream, and simmer over low heat until reduced to a thick, pourable gravy, about 10 minutes. Remove from heat. Stir in peppercorns and scallions, and taste for salt, adding more as needed. Serve hot.\n"}]}