{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Potatoes With Kale (Colcannon)", "description": "Colcannon is one of the great signature dishes of Ireland. The most common version pairs cabbage with potatoes, but the dish is also made with kale, and that’s the one I usually make. You can substitute extra virgin olive oil for the butter (in which case it will be more Mediterranean than Irish).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/10/21/health/nutrition/21recipe.health.ready/21recipe.health.ready-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 198}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 215, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "663 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds russet potatoes, scrubbed and peeled", "Salt", "1 pound (1 large bunch) kale, either curly or cavolo nero, ribs removed, leaves washed", "1-1/4 cups low-fat milk", "2 heaped tablespoons chopped scallions (about 3 scallions)", "freshly ground pepper", "2 tablespoons unsalted butter or extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the potatoes with water in a saucepan, add about 1/2 teaspoon of salt and bring to a boil. Reduce the heat to medium, cover partially and cook until tender all the way through when pierced with a knife, about 30 to 45 minutes. Drain off the water, return the potatoes to the pan, cover tightly and let steam over very low heat for another 2 to 3 minutes. Remove from the heat and mash with a potato masher or a fork, through a food mill or in a standing mixer fitted with the paddle, while still hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes are cooking bring a large pot of generously salted water to a boil and add the kale. Fill a bowl with ice and water. Cook the kale for 4 to 6 minutes (after the water returns to the boil), until the leaves are tender but still bright green. Transfer to the ice water, allow to cool for a couple of minutes, then drain and squeeze out excess water. Chop fine (you can use a food processor)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Towards the end of the potato cooking time, combine the milk and the scallions in a saucepan and bring to a simmer. Remove from the heat and let steep for a few minutes. Stir the chopped kale into the hot mashed potatoes and beat in the milk and butter or olive oil. The mixture should be fluffy (you can do this in an electric mixer fitted with the paddle). Add salt to taste and freshly ground pepper. Serve hot, right away, or keep warm in a double boiler: set the bowl in a saucepan filled one third of the way with water. Make sure the water doesn’t touch the bottom of the bowl. Bring the water to a simmer. Stir the potato and kale mixture from time to time."}]}