{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Corn and Edamame Salad", "description": "A late-summer side with lots of crunch, spice and herbs, this is great with anything grilled. Hugh Mangum, the New York chef of Texas lineage who started the Mighty Quinn’s Barbeque chain, has brightened up the traditional Texas plate of meat, meat, meat and white bread with fresh sides like this one.  It holds up well overnight, too.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/08/20/dining/20JPBRISKET5/20JPBRISKET5-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack, salads and dressings", "keywords": "corn, edamame, scallion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 103, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "275 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Freshly cut kernels from 6 to 8 ears fresh corn", "6 cloves garlic, not peeled", "1 tablespoon vegetable oil, such as grapeseed, corn or olive", "2 teaspoons mild chile powder, such as ancho, pasilla or Hatch", "1 teaspoon ground cumin", "Kosher salt", "1 pound shelled soybeans (edamame, available frozen) or lima beans", "2 red bell peppers, seeded and diced, or 4 plum tomatoes, seeded and diced", "1 medium-size jicama or 2 cucumbers, peeled and diced (about 1 cup)", "6 scallions, white and pale green parts, thinly sliced", "1/4 cup crumbled Cotija or mild goat or feta cheese", "1/4 cup roughly chopped cilantro leaves, for garnish", "1 tablespoon honey", "Freshly squeezed juice and zest of 6 limes (about 1/2 cup)", "1/2 cup vegetable oil, such as grapeseed or corn, more to taste", "1/4 cup roughly chopped cilantro, preferably both white roots and green leaves", "2 teaspoons kosher salt, more to taste", "2 teaspoons freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. In a bowl, toss corn kernels and garlic cloves with the tablespoon of oil, chile powder, cumin and 2 teaspoons of salt. Spread in a sheet pan and roast 10 to 12 minutes, until fragrant and golden. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot of salted boiling water, cook the beans just until crisp-tender. Drain and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: Squeeze the roasted garlic flesh out of the papery skins into a blender. Add the honey, lime juice and zest, 1/2 cup oil, the cilantro roots and leaves, and salt and pepper. Blend until smooth. Taste and add more oil if the dressing is too tart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a serving bowl, combine the corn, beans, bell peppers, jicama or cucumbers, scallions and cheese. Pour most of the dressing over this and toss well. Taste and add more dressing, and salt and pepper to taste. Sprinkle 1/4 cup cilantro leaves on top and serve."}]}