{"@context": "http://schema.org", "@type": "Recipe", "name": "Cabbage Pirozhki", "description": "A rich-tasting Eastern European pastry that isn’t rich at all.\nOf all the different fillings for the small oval Russian pies called pirozhki, cabbage has always been my favorite. The filling is a simple mixture of onions and cabbage, cooked in butter  (traditionally in much more than I use here), until soft and sweet but not browned, then seasoned with dill, salt and pepper, and enriched with chopped hard-boiled eggs. I sometimes add a little ricotta to the mix. Traditional pirozhki dough is a rich pastry made with butter and sour cream. I tried my <a href='http://www.nytimes.com/2014/04/21/health/whole-wheat-pie-dough.html?_r=0'>yeasted whole-wheat olive oil pastry</a> and it worked beautifully.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/01/30/health/30recipehealth/30recipehealth-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "24 about 3-1/2-inch long pirozhki", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch", "keywords": "appetizer, main course, cabbage, pie pastry, whole wheat, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 33, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "75 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 recipe Yeasted Olive Oil Pastry (see <a href='http://www.nytimes.com/2014/04/21/health/whole-wheat-pie-dough.html?_r=0'>recipe</a>) ", "2 tablespoons unsalted butter", "1 medium onion, finely chopped", "1 small cabbage, about 1 pound, cored and finely shredded", "Salt to taste", "2 tablespoons chopped fresh dill", "2 hard-boiled eggs, chopped", "Freshly ground pepper", "1/2 cup ricotta (optional)", "1 egg, beaten, for egg wash"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix up the pastry dough and while it is rising, make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat butter over medium heat in a large, heavy skillet and add onion. Cook, stirring often, until tender, about 5 minutes. Add cabbage and salt to taste and cook, stirring often, until cabbage is tender but not browned, about 15 minutes. Stir in dill, chopped hard-boiled eggs, and pepper. Taste and adjust salt. Remove from heat and allow to cool slightly. If using ricotta you can either stir it into the cabbage or place a teaspoon on each round of dough before topping with the cabbage mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough is ready, pinch off 24 equal pieces, approximately 20 grams each, and roll each one into a small ball by cupping your hand over it and gently rolling it against your work surface. Cover with plastic wrap and allow the dough to rest for 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with parchment. One by one, roll each ball of dough to a thin round, about 3 1/2 inches in diameter. If you are using ricotta and have not mixed it into the cabbage, place a teaspoon on each round and top with a tablespoon (heaped) of the cabbage. Otherwise just top each round with a heaped tablespoon of the cabbage mixture. Fold over the round and pinch the edges of the dough together, then tuck in the ends and gently shape each pirozhok into an oval (rather than a half-moon). Place on the parchment-covered baking sheet, seam side down. You should get 12 on each sheet. After you have finished shaping the first 12, cover lightly with plastic and place in a warm place to rise for 40 to 45 minutes. Meanwhile, preheat the oven to 350 degrees and continue shaping the pirozhki. Cover the second batch with plastic and let rise for 40 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush pirozhki with egg wash. Bake 1 tray at a time in the middle of the oven for 25 minutes, until light brown and shiny. Remove from heat and allow to cool for at least 10 minutes before eating."}]}