{"@context": "http://schema.org", "@type": "Recipe", "name": "Yogurt With Mixed Seeds, Toasted Oatmeal and Ginger Syrup", "description": "The inspiration for this breakfast yogurt comes mainly from an amazing breakfast yogurt and fruit bowl I had at the Elizabeth Street Café, a Vietnamese-French bakery and restaurant   in Austin, Tex. Its  baker, Jennifer Tucker, is exceptionally talented: Anyone who can pull off croissants that incorporate  whole-wheat flour and seeds while remaining flaky, light, and small has my immediate attention. \n\nThe cafe’s  morning yogurt bowl includes an unusual   granola made with steel-cut oats, macadamia nuts, and ginger; fresh fruit; and a delicious ginger-palm sugar syrup. Jennifer was kind enough to share her recipes for the granola and the ginger palm sugar syrup (I’m   using only the syrup recipe here, but I’m sure you’ll see the granola in a   future Recipes for Health). The seed mix   you should make in quantity and keep on hand for adding not just to your morning yogurt, but to salads, baked goods, just about anything. I soak the seeds, then dry them for a day in a very low oven. The ginger syrup keeps well and it too is great to have on hand.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/03/science/06recipehealth/06recipehealth-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "1 serving", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch", "keywords": "fall, spring, summer, winter, gluten-free, halal, kosher, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1192, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "208 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "12 grams", "proteinContent": "23 grams", "saturatedFatContent": "8 grams", "sodiumContent": "145 milligrams", "sugarContent": "165 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons sunflower seeds (20 grams)", "2 tablespoons pumpkin seeds (20 grams)", "1 teaspoon poppy seeds (5 grams)", "1 tablespoon toasted or black sesame seeds (12 grams)", "1 teaspoon chia seeds (5 grams)", "1 cup water (240 g)", "180 grams palm sugar (about 1 cup)", "90 grams fresh ginger, peeled and sliced", "1 tablespoon toasted pinhead oatmeal (see note)", "2/3 cup plain low-fat or whole-milk yogurt", "Fruit in season, such as berries, sliced peaches, pears, banana"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make seed mix, combine seeds in a bowl. Soaking is optional but I prefer the texture of the seeds when they’ve been soaked, and soaking makes their nutrients more readily available. Cover with water and refrigerate for 7 hours or overnight. Drain. (The mixture will be gelatinous because of the chia seeds.) Line a small baking sheet with parchment and spread the mixture in an even layer on the sheet. Place in an oven set at the lowest setting; if your oven has a pilot light you needn’t turn it on at all. Leave for 6 hours or overnight, until the mixture is completely dry. Break it up (some seeds will stick together because of the chia) and keep in a jar in the refrigerator or freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the syrup, combine ingredients in a small saucepan and bring to a boil. Reduce heat and simmer for 20 minutes, until slightly thickened and infused with the ginger flavor. Strain and reserve ginger (you can use it in granola or other desserts)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine yogurt and 1 tablespoon of the toasted oatmeal. Cover and refrigerate overnight. In the morning, stir in 1 to 2 teaspoons ginger syrup, 1 tablespoon of the seed mix, and the fruit of your choice."}]}