{"@context": "http://schema.org", "@type": "Recipe", "name": "Shaved Brussels Sprouts With Pecorino and Walnuts", "description": "Those who have eaten at Buvette, the West Village restaurant from which the recipe for this dish is adapted, will understand that if the home-cooked version tastes even 1/8th as good as the original, then you could pair it with a roast chicken and dinner will be awesome, beyond compare. And it does! Shave the sprouts with a mandoline or a food processor or a sharp, sharp knife. Then combine with raw walnut halves, pecorino crumbled off the cheese with a fork, olive oil, and salt. Mix aggressively, so that the sprouts begin to wilt a little. And that’s it. You'll see.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/07/16/dining/16COOKBOOK/16COOKBOOK-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "brussels sprouts, raw nuts, healthy, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 619}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 164, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "308 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["24 brussels sprouts", "1/2 cup raw walnut halves", "1/4 cup fork-crumbled pecorino Romano", "2 tablespoons extra-virgin olive oil, plus more as needed", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim bottoms of brussels sprouts and discard any discolored or loose outer leaves. Using a mandoline, the slicing attachment on a food processor or a very sharp knife, shave sprouts into the thinnest of slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine shaved sprouts with the other ingredients, mixing roughly by hand so that the greens begin to wilt a little. Season to taste with salt and add a little more olive oil if necessary, either for your taste or because the sprouts were large."}]}