{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Veal Steaks With Green Peppercorns", "description": "Green peppercorns grow on the same vine as the black peppercorns you use in your pepper mill. The difference is the green ones are picked young, while the black have been allowed to mature and dry. Though they are occasionally available still fresh on the branch, flown in directly from Southeast Asia, green peppercorns are always available preserved in brine or freeze-dried. This classic French recipe employs them in a deliciously pungent sauce for veal steaks, though boneless pork loin chops or chicken breasts can stand in nicely.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/02/05/dining/05KITCH_SPAN/05KITCH_SPAN-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings ", "recipeCuisine": "french", "recipeCategory": "dinner, steaks and chops", "keywords": "main course, veal", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 426, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "1 gram", "proteinContent": "27 grams", "saturatedFatContent": "11 grams", "sodiumContent": "728 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 boneless veal steaks, about 6 ounces each, cut 1/2-inch thick\n", "Salt \n", "Zest of 1 lemon, in large curls\n", "4 garlic cloves, thickly sliced \n", "A few thyme sprigs\n", "All-purpose flour\n", "3 tablespoons olive oil (or shallot oil from crispy shallots; see recipe)\n", "2 tablespoons butter\n", "1 large shallot, finely diced\n", "2 to 3 tablespoons green peppercorns, rinsed if in brine or rehydrated if freeze-dried\n", "1 cup rich veal or chicken stock\n", "4 tablespoons crème fraîche\n", "1 tablespoon brandy\n", "2 tablespoons chopped parsley\n", "Crispy shallots for garnish, see recipe (optional)\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put veal steaks on a platter and season on both sides with salt. Sprinkle with lemon zest, garlic and thyme sprigs and set aside for an hour (or refrigerate for up to 3 hours, then bring to room temperature). Just before cooking, scrape aromatics from steaks and dust lightly on both sides with flour.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a wide skillet over medium-high heat. Add veal steaks and cook until lightly browned, 3 to 4 minutes, then turn and cook for 2 minutes more. Remove and keep warm. Wipe skillet clean, then add butter and diced shallot. Season lightly with salt and cook, stirring, until shallot is soft and beginning to color, about 3 minutes.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to high, add peppercorns and cook for 1 minute. Add stock and simmer until reduced by nearly half, 2 to 3 minutes. Add crème fraîche and brandy and stir to incorporate. Return veal to pan and continue simmering until sauce thickens a bit, about 2 minutes more. \n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Distribute steaks among 4 warmed plates. Spoon sauce over steaks, sprinkle with parsley and crispy shallot, if using, and serve immediately.\n"}]}