{"@context": "http://schema.org", "@type": "Recipe", "name": "Fava Bean Soup with Mint", "description": "Although this looks like a Mediterranean soup, I came across it in Veracruz, where the cuisine still has Spanish overtones. I have eaten a similar fava bean dish in Spain. You can find skinned, split fava beans in Middle Eastern markets.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/12/29/health/recipehealth_fava_600/recipehealth_fava_600-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 125, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "7 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1063 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dried, skinned fava beans, washed, picked over, and soaked in water to cover for 6 hours or overnight", "2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "4 garlic cloves, minced", "1/2 pound tomatoes, peeled, seeded, and chopped, or 1 cup canned chopped tomatoes", "10 sprigs fresh spearmint, tied in a bunch with kitchen string", "2 quarts water", "Salt to taste", "Slivered fresh mint leaves, extra virgin olive oil, and dried red pepper flakes for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the favas. Heat 1 tablespoon olive oil in a large, heavy soup pot or Dutch oven over medium heat and add the onion. Cook, stirring, until tender, about 5 minutes, and add the garlic. Stir together for a minute, until fragrant, and add the tomatoes and 1/2 teaspoon salt. Cook, stirring often, until the tomatoes have cooked down slightly, about 5 minutes, and add the beans, 2 quarts water, another 2 teaspoons salt, and the mint. Bring to a boil, reduce the heat, cover and simmer 2 hours, or until the beans have begun to fall apart and thicken the soup. Stir from time to time to make sure the beans are not settling at the bottom of the pot and sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans are soft and falling apart, remove the bundle of mint, and using tongs, any stray mint leaves. Using an immersion blender, puree the soup. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve, garnishing each bowl with a drizzle of olive oil, a sprinkling of slivered mint leaves, and a pinch of red pepper flakes."}]}