{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Sour Bulgur Trahana From Ikaria", "description": "Trahana is a wheat product that is eaten throughout Greece and the Eastern Mediterranean. There are many versions, some made with milk, usually from goats or sheep that is called sweet trahana, some with a combination of milk and yogurt, called sour trahana, and even a lenten version made with vegetable pulp. The liquid is combined with wheat – bulgur, semolina, or a mix of semolina and flour – and made into a dry dough (if using flour) or simmered until it is a thick porridge. Then it is spread out on netting and dried in the sun. Once thoroughly dry it is broken up into granules that can range in size from bulgurlike morsels to small pellets. You can find imported Greek trahana in Greek markets. I found five different types in my local Greek market in Los Angeles and each one behaves a little bit differently when you cook it. It is easy to make yourself, as I found when I made this recipe from Diane Kochilas’s wonderful new cookbook “Ikaria: Lessons on Food, Life, and Longevity From the Greek Island Where People Forget to Die.” This is the trahana that I used for all of this week’s Recipes for Health. I am happy to have this new staple on hand in my pantry.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/21/science/20recipeforhealthtrahana/20recipeforhealthtrahana-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "1 1/4 pounds trahana, about 18 servings", "recipeCuisine": "greek, mediterranean, middle eastern", "recipeCategory": "breakfast, dinner, lunch", "keywords": "fall, spring, summer, winter, halal, kosher, low cholesterol, low-fat, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 124, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "163 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["3 cups / 18 ounces coarse bulgur", "1 cup plain Greek whole-milk yogurt", "1 cup whole cow’s milk", "1 cup whole goat’s milk", "1 tablespoon fresh lemon juice", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all of the ingredients in a medium-size saucepan over medium heat and bring to a simmer, stirring to prevent bulgur from sticking to the bottom of pan. Simmer, stirring, until mixture is a dense, just-about-solid mass and very hard to stir, 15 to 20 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 250 degrees and line a sheet pan with parchment. Spread bulgur mixture on parchment in an even layer. It should fill the baking sheet and should be about 1/4 inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in oven and bake until completely dry and brittle, 3 to 4 hours. It should only color slightly. If trahana on the edges of pan begins to brown, remove that portion and return pan to the oven until all of the trahana is completely dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and allow to cool, then break up into chunks or granules (in my experience the trahana falls apart into granules rather than chunks). Store in jars in a cool, dry place."}]}