{"@context": "http://schema.org", "@type": "Recipe", "name": "Fruit-Filled Scuffins", "description": "The scuffin is a frankenpastry — part scone, part muffin and, like a doughnut, filled with jam — but despite its complex genetics, it is very easy to make. It is even somewhat healthy (for a pastry, that is), using whole grain flour and flaxseeds, and keeping the butter minimal. If you are more of a butter maximalist, feel free to indulge by making a crumb topping for the scuffins: Measure 3 ounces cool butter (instead of 2 ounces melted butter) and use your fingers to rub it into the dry ingredients until coarse crumbs form. The spices can be varied (swap in nutmeg, ginger or allspice for the cinnamon or cardamom), and so can the jams. Do not use jelly, though — only jams, conserves, preserves or fruit butter will do. ", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/02SCUFFIN/02SCUFFIN-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 scuffins", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, easy, lunch, quick, weekday", "keywords": "dessert, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 334}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 189, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "139 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons unsalted butter (2 ounces), plus 2 tablespoons for buttering muffin cups", "1 cup whole-wheat flour (4 1/2 ounces)", "3/4 cup all-purpose flour (3 ounces)", "1/4 cup plus 1 tablespoon flaxseed meal or wheat germ (1 ounce)", "3 tablespoons light brown or raw sugar (2 ounces), plus extra for sprinkling ", "1 1/2 teaspoons baking powder", "1 teaspoon cinnamon", "1 teaspoon ground cardamom", "1/2 teaspoon sea salt or kosher salt", "1 egg", "1/3 cup whole milk", "1/3 cup heavy cream", "3/4 cup fruit jam, conserves, preserves or fruit butter (do not use jelly or marmalade)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Melt 2 tablespoons butter in a microwave or over very gentle heat. Using a pastry brush, butter the cups of a standard-size (3 1/2-ounce-capacity) 12-cup muffin tin. Let each coat of butter cool, then apply another coat; continue until the 2 tablespoons are all used."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine dry ingredients. Meanwhile, melt remaining 4 tablespoons butter, add to dry ingredients and mix with a fork until just combined. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, whisk together egg, milk and cream. Add to dry ingredients and mix to combine (the dough will be quite sticky). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserving about a quarter of the dough for topping, scoop 2 tablespoons dough into each cup. Using the back of a spoon, press dough gently down into the cups. The dough will move up the sides, and there should be a shallow well in each dough cup. Don’t worry if the dough doesn’t come all the way up to the top; there should be about 1/2 inch of space between the top of the dough and the rim of the cup. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about 1 tablespoon jam into each well. Using your fingers, pinch remaining dough into small clumps and scatter evenly over the jam in each cup, making a bumpy topping. Sprinkle sugar over the tops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 20 to 25 minutes, or until browned. Let cool in the pan on a rack; run a blade around the sides of each scuffin before turning out. "}]}