{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange-Currant Scones", "description": "The orange zest and currants in these tender scones are an homage to the chef Judy Rodgers of the Zuni Cafe in San Francisco, who made her storied scones until 1997. The dough and method here, though, are adapted from Heather Bertinetti, the pastry chef at the Four Seasons restaurant in New York. The genius of this particular scone recipe is in the geometry. Slicing a rolled-out slab of dough into squares or rectangles is infinitely simpler than cutting out rounds — and there's less chance of toughening the dough by re-rolling it and adding more flour. You can use any kind of chopped dried fruit in place of the currants.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/02/22/multimedia/recipelab-scones/recipelab-scones-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "8 to 12 scones", "recipeCuisine": "", "recipeCategory": "breakfast, quick", "keywords": "currants, orange, scones, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 335}, "recipeIngredient": ["3 cups all-purpose flour", "2 tablespoons sugar", "1 tablespoon baking powder", "Freshly grated zest of 1 orange or tangerine", "1/4 pound (1 stick) cold unsalted butter, cubed", "1 large egg, lightly beaten", "1 cup heavy cream", "1 cup currants, or use raisins, dried cranberries or small chunks of other dried fruit", "Egg wash (2 large eggs beaten with 1 tablespoon water)", "2 tablespoons brown sugar, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a sheet pan with parchment paper or baking mat, or use a nonstick pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss dry ingredients and zest together in a large bowl. Using your fingertips or a pastry cutter, rub butter and flour mixture together just until butter pieces are the size of peas and covered with flour. Make a well in the center of the bowl and pour in egg and cream. Mix ingredients together by hand until a shaggy dough is formed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out onto a floured surface and gently mix in currants, kneading dough and currants together just until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat dough into a 3/4- to 1-inch-thick rectangle. Cut rectangle in half lengthwise, then cut across into 8 or 12 smaller rectangles. Place them on the baking sheet, spaced out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush tops with egg wash and sprinkle with brown sugar (if using). Bake until light golden brown, about 22 minutes; rotate the pan front to back halfway through. Let scones cool slightly on the baking sheet. Serve warm or at room temperature. Eat within 24 hours."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Orange-Currant Scones", "description": "Julia Moskin shows how to master the art of making sweet, tender scones with a firm crust and a soft, crumbly texture.", "thumbnailUrl": "https://static01.nyt.com/images/2014/02/22/multimedia/recipelab-scones/recipelab-scones-mediumThreeByTwo440.jpg", "uploadDate": "2014-02-25T18:43:58.000Z", "duration": "PT1M15S"}}