{"@context": "http://schema.org", "@type": "Recipe", "name": "Colcannon With Roasted Squash and Apple", "description": "This is the sweetest of the colcannons I experimented with this week. The apple is the secret ingredient. I roasted the squash with the apple, but pulled the apple out before the squash because it roasts more quickly at 425 degrees.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/07/health/07recipehealthcolcannon/07recipehealthcolcannon-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "Serves 6", "recipeCuisine": "irish", "recipeCategory": "dinner", "keywords": "fall, winter, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "6 grams", "proteinContent": "4 grams", "saturatedFatContent": "5 grams", "sodiumContent": "705 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds butternut squash, peeled and cut in 3/4-inch dice", "2 tablespoons extra virgin olive oil", "Salt to taste", "1 slightly tart apple, such as a braeburn or gala, cored", "3 tablespoons butter", "10 ounces Yukon gold potatoes, cut in half if large", "1/2 to 3/4 cup milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line a baking sheet with parchment. Place squash on baking sheet and toss with olive oil and salt to taste until lightly coated. Place apple on baking sheet and rub with oil. Place about a teaspoon of butter in the cavity where the core was. Place in oven and roast for 20 to 30 minutes, stirring squash every 10 minutes, until squash is tender and lightly colored and the apple is soft and falling apart. If the apple is done before the squash, remove it from the oven and set aside on a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow apple to cool until you can handle it, then peel and scrape any pulp clinging to the peel into a bowl. Core and combine baked apple with roasted squash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place potatoes in a saucepan and cover by an inch with water. Bring to a boil, add salt to taste, reduce heat to medium-low and cover partially. Boil gently until tender, 25 to 30 minutes. Drain, return to pot and cover pot tightly. Let steam in the dry pot for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat milk and butter together until butter melts. Mash potatoes, squash and apple with a potato masher or in a standing mixer fitted with the paddle, or put through a food mill. Add milk and butter and mix until smooth. Season to taste with salt and pepper. Serve hot."}]}