{"@context": "http://schema.org", "@type": "Recipe", "name": "Mochi Rice Stuffing", "description": "Thanksgiving dinner in Hawaii may start with pineapple-Vienna-sausage skewers and litchis stuffed with cream cheese. Later there is turkey and ham, but also Spam fried rice and Filipino lumpia, maybe poke (sashimi salad), laulau (ti-leaf-wrapped meat or fish) and a Molokai sweet potato pie topped with haupia (coconut pudding). It is the crazy-quilt, all-embracing nature of the feast that makes it local-kine — that is, island-style. \nLara Mui Cowell of Honolulu offers this recipe from her popo (maternal grandmother), Jannie Luke Thom, a second-generation Chinese-American who was born in Hawaii before it became a state. The dish is a Chinese take on Western-style sage stuffing, swapping out bread crumbs for mochi rice and adding lap cheong (Chinese sausage) and char siu (Chinese barbecue pork). But in true Hawaiian style, you may substitute Portuguese sausage — or even Spam.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19HAWAII/19HAWAII-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "stuffing and dressing", "keywords": "bacon, chinese sausage, mochi rice, shiitake, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 444, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "15 grams", "saturatedFatContent": "6 grams", "sodiumContent": "695 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups mochi rice (also known as glutinous sweet rice or sticky rice), rinsed", "6 large dried shiitake mushrooms, soaked according to package instructions", "1 tablespoon freshly grated ginger", "1 tablespoon plus 2 teaspoons olive oil, divided", "3 slices bacon, chopped", "2 teaspoons oyster sauce, or soy sauce", "1/2 teaspoon sugar", "1 cup diced onion (from 1 onion)", "1/2 cup chopped green onion (from 3 to 4 onions)", "1/2 pound diced lap cheong (Chinese sausage), or use dried sweet sausage such as chorizo or salami", "1/4 pound diced char siu (Chinese barbecue pork), or use sugar-cured ham steak seared on both sides", "1 1/2 cups cooked chestnuts, roughly chopped (store-bought is fine)", "1 cup chopped water chestnuts", "Salt and pepper, to taste", "2 large eggs, beaten", "2 tablespoons roughly chopped cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Cook the rice:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a rice cooker, combine rice and 2 1/2 cups water in the rice cooker and soak for 1 hour, then cook until tender, about 20 minutes. If cooking on the stovetop, combine rice and 2 1/2 cups water in a large pot. Cover, bring to a boil, then reduce the heat to low and cook 20 minutes, or until water is almost completely absorbed. Remove from heat and let steam, covered, 15 minutes."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain shiitakes, then remove stems and slice caps; set aside. In a small saucepan, combine ginger and 1 tablespoon olive oil over medium-low heat and cook 2 minutes; set aside and let steep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, cook bacon over medium heat until crisp, about 8 minutes; drain fat. In a small bowl, stir together oyster sauce and sugar, then add to the skillet with the bacon. Stir in onion, green onions, lap cheong, char siu, chestnuts, water chestnuts, ginger oil and mushrooms. Cook over medium-high heat until onions are translucent, about 4 minutes. Toss mixture with the prepared rice; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 teaspoons oil in a small nonstick skillet over medium heat. Pour eggs into hot pan and cook until edges begin to set, about 10 seconds. Pull omelet in from the edges toward the center of the pan and let liquid eggs flow underneath. When eggs are mostly set, fold omelet in thirds like a letter and transfer to a cutting board. Slice into strips. Serve rice with slivered omelet and cilantro on top."}]}]}