{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Tomato Ketchup", "description": "This sauce is a tomato jam that tastes more like a richly spiced ketchup. A long simmer is important. This is inspired by a recipe for a delicious tomato jam in the chef Matthew Kenney’s cookbook, “Matthew Kenney’s Mediterranean Cooking.” My version is not as sweet as his; I decided to call it ketchup rather than jam because to me, it tastes like a richly spiced ketchup, with sweet and sour flavors and a little kick from the cayenne. A long simmer is important for cooking the sauce to the right consistency and for concentrating the flavors. After that, I put the ketchup through a food mill to achieve smoother texture, but that step is optional. I salt toward the end of cooking because the mix will reduce quite a lot and it’s too easy to oversalt if you salt before that happens. However, be sure to use enough salt to balance out the sweetness and bring out the spice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/22/science/24recipehealth/24recipehealth-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "Makes 1 2/3 cups", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "dairy-free, gluten-free, halal, kosher, low calorie, low cholesterol, low-fat, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 219, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "763 milligrams", "sugarContent": "29 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 tablespoon minced ginger", "2 large garlic cloves, minced", "1/4 cup cider vinegar", "1/4 cup packed brown sugar", "2 pounds tomatoes, peeled, seeded and diced or pulsed to a coarse purée in a food processor", "1 teaspoon cumin seeds, lightly toasted and ground", "1/2 teaspoon ground cinnamon", "8 allspice berries, ground (1/2 teaspoon)", "2 cloves, ground", "1/8 teaspoon cayenne", "Salt and freshly ground pepper to taste", "1 tablespoon mild honey, such as clover"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over low heat in a heavy-bottom saucepan. Add ginger and garlic cloves and cook, stirring, until fragrant but not browned, about 1 minute. Add vinegar, turn up the heat and reduce volume by half, about 2 to 3 minutes. Add sugar and stir until it has dissolved in the vinegar. Add tomatoes and spices (but not salt), bring to a simmer, reduce heat to very low, cover partly and simmer slowly until mix has reduced to a thick purée and there is little liquid in the pan, about 1 hour 45 minutes. Uncover and continue to simmer until all the liquid has cooked off, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season to taste with salt and pepper and stir in honey. Continue to simmer, stirring, until mix is shiny, about 5 minutes. Remove from heat and allow to cool. Taste and adjust salt. Transfer to a jar and refrigerate if not using right away. Serve at room temperature as an accompaniment to fish, chicken, meat or vegetables; spread it on bread; or use as a sandwich condiment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Optional step: Before or after the mix cools, put through the fine blade of a food mill."}]}