{"@context": "http://schema.org", "@type": "Recipe", "name": "Marinated Venison Steaks", "description": "“Thanksgiving here is about hunting rather than football,” said Errol Rice of the Montana Stockgrowers Association. The season for hunting big game comes to a close in the last, best place on the Thanksgiving weekend, and those who have not yet bagged a buck are known, said Dennis Konopatzke, the proprietor of Great Northern Brewing Company in Whitefish, to rush their holiday dinners in order to get out to the woods to hunt.\n\nYou’ll find huckleberries on Thanksgiving tables in Montana, Mr. Konopatzke added, or the Norwegian cured fish known as lutefisk, or pork pies and stuffed pasties, all nods to the state’s diverse history of settlers from afar. But game is the game. What follows is a recipe honed over the years by the members of the Rocky Mountain Elk Foundation for a marinade that works on wild venison perfectly and most other proteins as well. Broil some steaks and pair the result with traditional Thanksgiving side dishes.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19MONTANA/19MONTANA-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, roasts", "keywords": "fall, winter, main course, venison", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 294}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 870, "unsaturatedFatContent": "58 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "79 grams", "fiberContent": "1 gram", "proteinContent": "34 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1920 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups extra-virgin olive oil", "3/4 cup soy sauce", "1/2 cup red wine vinegar", "1/2 cup freshly squeezed lemon juice", "1/4 cup Worcestershire sauce", "2 garlic cloves, peeled and crushed", "1 1/2 teaspoons roughly chopped fresh parsley", "2 tablespoons dry mustard", "2 1/4 teaspoons kosher salt, plus more as needed", "1 teaspoon black pepper, plus more as needed", "2 pounds venison loin or leg, cut into 6 steaks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all ingredients except venison in a large bowl. Submerge venison in the marinade, cover with plastic wrap and refrigerate at least 8 hours and up to 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler, stovetop grill pan or grill. Remove venison from marinade and season with salt and pepper. Working in batches if necessary, place steaks under the broiler or on the grilling surface and cook, flipping once, until medium-rare, 4 to 5 minutes per side. Allow venison to rest for 5 minutes before serving."}]}