{"@context": "http://schema.org", "@type": "Recipe", "name": "Oatmeal and Teff With Cinnamon and Dried Fruit", "description": "I wanted to make a porridge with teff alone, but I just didn’t like the flavor enough. So I added some of those tiny high-protein, high-calcium, gluten-free seeds to oatmeal, along with chopped dried apricots, golden raisins and cinnamon. Chopped toasted hazelnuts are my first choice for topping.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/11/science/12recipehealth/12recipehealth-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "Serves 1", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, quick", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, vegetarian, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["1/3 cup rolled oats", "1 tablespoon teff", "Salt to taste (I use a generous pinch)", "1/8 teaspoon ground cinnamon", "1 tablespoon chopped dried apricots and/or golden raisins (more to taste)", "2/3 cup water", "1 teaspoon honey, plus additional to taste for drizzling", "1/2 tablespoon chopped toasted skinned hazelnuts or almonds", "Optional toppings: milk, grated apple or pear"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before, stir together rolled oats, teff, salt, cinnamon and chopped apricots or raisins in a medium microwave-safe bowl. Bring water to a boil and pour over mixture. Add honey and stir, then cover bowl with a plate. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the morning, microwave mixture for 2 minutes on 100 percent power. Remove bowl from microwave and carefully remove plate (bowl will be hot and steam will rise from cereal). Stir mixture, cover again and return to microwave. Heat for 1 to 2 minutes longer, until mixture is no longer watery."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a serving dish and sprinkle chopped nuts over the top. Add other toppings of your choice and serve.  "}]}