{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa and Rice Bowl With Kale, Kimchi and Egg", "description": "Easy, healthful and infinitely adaptable, grain bowls are equally ideal for feeding a family (picky eaters can build it to suit their own tastes) and using up leftovers in the fridge. You could also cook up the ingredients at the beginning of the week, and mix and match ingredients at will as the week progresses. Try rice, quinoa, kamut, farro, freekeh, wheat berries, barley and grits for the grain (this recipe calls for mixing brown rice and quinoa for a nice variety of textures, but feel free to use just one or the other). Put your grains in a large bowl, then arrange small piles of vegetables, protein and something pickled or spicy over the grains. Top with a sauce that brings together all the ingredients in the bowl. Crunch — here, sesame seed and dried seaweed — is a nice finishing touch.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/10/01/multimedia/clark-grain-bowls/clark-grain-bowls-mediumThreeByTwo440.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "avocado, brown rice, egg, kale, kimchi, quinoa, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 808}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 546, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "10 grams", "proteinContent": "17 grams", "saturatedFatContent": "6 grams", "sodiumContent": "658 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt, as needed", "2/3 cup brown rice", "2/3 cup uncooked red or white quinoa, well rinsed", "2 tablespoons soy sauce", "4 teaspoons finely chopped peeled ginger", "1 tablespoon rice wine vinegar", "1/4 cup peanut oil", "1 teaspoon sesame oil", "1 8-ounce bunch kale, thick ribs removed, leaves torn into large pieces", "4 large eggs", "1 avocado, peeled, pitted and sliced", "1 cup coarsely chopped kimchi, or to taste", "Sliced scallions, for serving", "Sesame seeds, for serving", "Crumbled dried seaweed snack sheets, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil and add rice. Let cook for 30 minutes, then drain. Return rice to the empty pot, cover with lid and let rice rest for 10 minutes. Meanwhile, bring 2 cups of salted water to a boil in a small pot and add the quinoa. Cover pot and let simmer over low heat for 15 minutes. Turn off the heat and let rest, covered, for 5 minutes longer. Fluff both grains with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together soy sauce, ginger, vinegar and salt to taste. Whisk in peanut and sesame oils."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a steamer basket in a large pot filled with an inch or two of water. Place kale in basket. Cover pot and cook over medium heat until kale is tender, about 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a medium pot filled with water to a boil. Using a slotted spoon, carefully lower eggs into water; boil 6 minutes. Transfer eggs immediately to a bowl of ice water to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 1/2 cup quinoa and 1/2 cup rice in each of four bowls. Divide the kale among the bowls, mounding it on top of the rice. Arrange avocado slices next to the kale. Peel eggs and cut in half; place two halves on top of each bowl. Sprinkle each bowl with kimchi, scallion, sesame and seaweed. Spoon soy-ginger dressing over bowls."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Making Quinoa and Rice Bowls", "description": "Melissa Clark assembles a hearty meal with quinoa, kale, kimchi, egg and a simple dressing.", "thumbnailUrl": "https://static01.nyt.com/images/2014/10/01/multimedia/clark-grain-bowls/clark-grain-bowls-mediumThreeByTwo440.jpg", "uploadDate": "2014-10-07T20:16:19.000Z", "duration": "PT1M52S"}}