{"@context": "http://schema.org", "@type": "Recipe", "name": "David Tanis's Onion Confit", "description": "The French word “confit” usually refers to food that is slowly cooked in some kind of fat. Originally, confit was a method used for preserving meat, typically duck, goose or pork. When stored and cooled in earthenware crocks, a layer of fat on top kept the food from spoiling by sealing out air. Onion confit, on the other hand, is a savory preparation of sliced onions, cooked to a soft, almost melting consistency, often seasoned with salt, herbs, sugar and vinegar for a somewhat sweet-and-sour effect. Sometimes called onion marmalade, a spoonful or two makes a perfect accompaniment to roasted meats. It may also be used to make onion tarts or pizzas, or as a “bed” for baked fish. The mixture will last for a week or so, refrigerated. To use, reheat gently over low heat.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/09/24/dining/24KNIFEREX/24KNIFEREX-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 cups", "recipeCuisine": "french", "recipeCategory": "condiments", "keywords": "appetizer, onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 218, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "7 grams", "sodiumContent": "623 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds medium onions", "6 tablespoons butter, duck fat or lard", "2 teaspoons sugar", "Salt and pepper", "2 bay leaves", "A few fresh thyme sprigs", "Pinch of cayenne", "2 tablespoons white wine vinegar or red wine vinegar", "1/2 cup dry white or red wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut onions in half from top to bottom (not crosswise). With a paring knife, peel each onion half. Lay each onion half flat side down. Holding the knife at a slight angle, cut away and discard the hard root end. Using a sharp knife, cut into 1/4-inch half-moons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large heavy-bottomed pot, preferably enameled cast iron, over medium-high heat. Melt butter, then add all the sliced onions and stir to coat. Sprinkle with sugar and season generously with salt and pepper. Continue stirring until onions begin to wilt and soften, without browning, about 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bay leaves, thyme, cayenne, vinegar and wine. Reduce heat to medium and continue to cook, stirring occasionally, until onion mixture is quite soft and most of the liquid has evaporated, about 30 minutes. Taste and adjust seasoning. Remove and discard bay leaves and thyme. Serve warm."}]}