{"@context": "http://schema.org", "@type": "Recipe", "name": "Soft Black Bean Tacos", "description": "These tacos are a beautiful way to serve black beans, which contain at least eight different flavonoids — phytonutrients with anti-oxidant properties. One caution, though: canned beans may contain high levels of sodium, which usually can be reduced by rinsing the beans in water. These black beans can't be rinsed, of course, and in fact will be reduced. Avoid the temptation to add salt to this recipe.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT20M", "recipeYield": "8 tacos", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "low-fat, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 200, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "10 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "455 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon canola oil", "1 teaspoon chile powder", "2 cans black beans, with liquid", "8 corn tortillas", "1 cup fresh or bottled salsa*", "2 ounces queso fresco or feta cheese, crumbled", "1 teaspoon ground cumin seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the canola oil in a large, heavy nonstick skillet over medium-high heat and add the chile powder and ground cumin. Allow the spices to sizzle for about half a minute, until very fragrant, and stir in the black beans and 1/2 cup water. Cook, stirring and mashing the beans with the back of your spoon, for  10 to15 minutes, until thick and fragrant. From time to time, as a crust develops on the bottom of the pan, stir the crust into the beans. If they seem too dry, add a little more water. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the tortillas, 2 or 3 at a time, in a dry skillet over medium-high heat, or in a microwave. Top with the black beans, about 2 rounded tablespoons for each tortilla. Spoon on some salsa and sprinkle on the cheese. Fold the filled tortillas in half, and serve."}]}