{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Gorgonzola and Beet Green Sandwich", "description": "This dish  is the one that inspired me to devote a week of Recipes for Health to toaster-oven vegetable and grilled cheese sandwiches. I made it one night after a day  preparing enough quiche to feed 80 for a book signing. When I got home I had still  more quiches to make in my own kitchen, and the last thing I wanted to do was cook dinner for myself. \n\nBut I was hungry. So I looked in the refrigerator and found a bowl of beet greens that I’d blanched a day or two earlier, and roasted beets that had once been attached to those greens. I pulled a couple of slices of bread from the freezer, looked in my cheese bin, and here  is what I slapped together. \n\nI loved it so much that I made it again the next night. It’s always a good idea to blanch greens as soon as you get them home from the market. You never know when you’ll want to use them in a pinch.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/27/science/26recipehealth/26recipehealth-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "Serves 1", "recipeCuisine": "american, french, italian", "recipeCategory": "dinner, lunch", "keywords": "fall, spring, summer, winter, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 274, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "561 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large slices whole-wheat country bread (3 ounces total)", "1/2 garlic clove (optional)", "About 3/4 ounce (3 tablespoons crumbled) Gorgonzola or creamy blue cheese", "1/3 cup chopped blanched beet greens", "Chopped fresh herbs such as parsley, thyme, rosemary, marjoram (optional)", "1/2 teaspoon extra-virgin olive oil", "1 small or 1/2 medium beet, sliced thin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub surface of one  slice of bread with the cut clove of garlic if desired. Spread blue cheese over the bread. If you wish, save a little cheese for the top slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss greens with herbs if desired. Spoon over cheese and press down onto the bread. Drizzle on 1/4 teaspoon olive oil. Arrange beet slices over the greens. If desired, add a little more cheese: either spread on the top slice of bread or sprinkle it over the beets.  If desired, rub second piece of bread with the cut garlic clove before spreading with cheese. Place over beets and press down firmly. Drizzle remaining olive oil over the top slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast in toaster oven for 3 to 4 minutes, until  cheese has melted. Remove from toaster, press down firmly, cut in half and serve."}]}