{"@context": "http://schema.org", "@type": "Recipe", "name": "Mollie Katzen-Inspired Potato and Broccoli Burgers", "description": "The famed vegetarian cookbook author Mollie Katzen has a whole chapter devoted to burgers and savory pancakes in her beautiful new cookbook, “The Heart of the Plate.” Before I’d looked carefully at the chapter I’d bought a bunch of broccoli with the idea that specks of broccoli would be beautiful in a burger. Mollie, with her delicious Walnut-Coated Broccoli-Speckled Mashed Potato Cakes, was way ahead of me on that idea. I loved her idea of coating the burgers with ground walnuts and barely cooking the finely chopped broccoli before incorporating it into the mix. I’ve made a variation on Mollie’s burgers, using red potatoes and sticking with the Indian seasonings I’ve been using in other burgers this week.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/05/13/science/13recipehealth/13recipehealth-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "9 patties", "recipeCuisine": "american, mediterranean", "recipeCategory": "dinner, lunch, burgers", "keywords": "fall, spring, winter, gluten-free, halal, kosher, low cholesterol, low-sodium, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 59}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 263, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "417 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 cups finely minced broccoli florets (about 6 1/2 ounces, or 2 good-size crowns; see note)", "Salt to taste", "1 1/2 pounds red potatoes, scrubbed and quartered", "1/2 cup chopped cilantro", "2 teaspoons toasted cumin seeds, lightly crushed in a mortar and pestle", "2 teaspoons fresh lemon juice", "1 teaspoon nigella seeds", "1 teaspoon garam masala", "1/2 teaspoon ground black pepper", "1/4 cup ricotta", "1 cup ground walnuts (about 3 ounces; pulse in a food processor until they resemble coarse bread crumbs, being careful not to grind to a paste; you will probably have some left over)", "1/4 cup grape seed oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of water to a boil and salt generously. Place broccoli in a strainer and dip into the boiling water for 1 minute, then remove. Rinse with cold water and shake out excess, then drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam potatoes over 1 inch of boiling water until tender, about 15 minutes. Transfer to a bowl and mash with a fork. The skins will break up in the mash. Stir in broccoli and remaining ingredients except the ground walnuts and oil. Season generously with salt, combine well, taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place ground walnuts in a wide bowl. Scoop out about 1/3 cup of burger \nmixture and form into a ball (you can moisten your hands to prevent sticking). Roll in the walnuts, then gently flatten into a patty. Place on a plate or sheet pan and continue to shape all of the patties. Refrigerate for 1 hour or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to cook, place a rack over a sheet pan. Heat 2 tablespoons of oil in a 12-inch, heavy nonstick frying pan over high heat. Swirl pan to coat with the hot oil. Lower heat to medium. Place 4 to 5 patties in the pan (do not crowd), and cook until well browned on one side, about 4 minutes. Turn and brown for about 4 more minutes. Remove to the rack. Heat remaining oil in the pan and cook remaining patties. Keep patties warm in a low oven until ready to serve. Serve with a salad and your choice of toppings, such as the usual (ketchup, mustard, relish), or yogurt raita, garlic yogurt, or chutney."}]}