{"@context": "http://schema.org", "@type": "Recipe", "name": "Preserved Lemons", "description": "This is Paula Wolfert’s original recipe from her 1973 book “Couscous and Other Good Food From Morocco,” but I leave out the warm spices like cinnamon and cardamom so that the flavors are adaptable. The brightness of this pickle has lately elbowed its way out of Morocco’s tagines. New York chefs add the minced peel to salads and garnish fried seafood with it; the cured-lemon flavor is particularly friendly to salmon, carrots, olives, parsley and potatoes. The lemony brine is great in a bloody mary.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/lemonspreserved/lemonspreserved-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 413}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 81, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "8 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "612 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["9 organic lemons ", "Kosher salt", "1 heaping teaspoon black peppercorns", "2 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrub 3 to 5 organic lemons, enough to fit snugly in a medium jar with a tight-fitting lid (have 2 to 4 more ready on the side). Slice each lemon from the top to within 1/2 inch of the bottom, almost cutting them into quarters but leaving them attached at one end. Rub kosher salt over the cut surfaces, then reshape the fruit. Cover the bottom of the jar with more kosher salt. Fit all the cut lemons in, breaking them apart if necessary. Sprinkle salt on each layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the lemons down to release their juices. Add to the jar the peppercorns and bay leaves, then squeeze the additional lemons into the jar until juice covers everything."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Close the jar and let ripen at cool room temperature, shaking the jar every day for 3 to 4 weeks, or until the rinds are tender to the bite. Then store it in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To use, remove a piece of lemon and rinse it. (Add more fresh lemons to the brine as you use them up.) The minced rind is added at the very end of cooking or used raw; the pulp can be added to a simmering pot."}]}