{"@context": "http://schema.org", "@type": "Recipe", "name": "Martha Rose Shulman's Romesco Sauce", "description": "Romesco is a rich Spanish sauce of charred tomatoes and roasted red peppers, puréed and thickened with toasted almonds and bread. The flavors are further sharpened with the addition of raw garlic, vinegar, chile powder or red pepper flakes (adjust the heat to your liking). The result is a smoky, pungent sauce, one usually served with mild-mannered vegetables and fish. (Some Spaniards say that a grilled vegetable feast is just an excuse for eating romesco.) But the sauce is just as good on a piece of toast that’s been brushed with olive oil and rubbed with yet more garlic. If you have the time, let the sauce stand for an hour at room temperature before serving, allowing the flavors to meld all the more.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/26/dining/recipes-romescosauce/recipes-romescosauce-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 2 cups", "recipeCuisine": "spanish", "recipeCategory": "brunch, dinner, lunch", "keywords": "appetizer, main course, side dish, healthy, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 175}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 416, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "4 grams", "sodiumContent": "485 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large red pepper, about 1/2 pound, roasted, peeled, seeds and membranes removed", "3 medium tomatoes or 4 Roma tomatoes (about 3/4 pound)", "2 thick slices (about 2 ounces) baguette or country-style bread, lightly toasted", "2 large garlic cloves, peeled", "1/2 cup toasted almonds, or a combination of almonds and skinned roasted hazelnuts", "1 to 2 teaspoons pure ground chile powder or red pepper flakes, to taste (pepper flakes are hotter)", "1 tablespoon chopped fresh Italian parsley", "1 teaspoon sweet paprika or Spanish smoked paprika (pimenton)", "Salt, preferably kosher salt, to taste", "Freshly ground pepper to taste", "2 tablespoon sherry vinegar", "1/4 to 1/2 cup extra virgin olive oil, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler and cover a baking sheet with foil. Place the tomatoes on the baking sheet, and place under the broiler at the highest setting. Broil for two to four minutes, until charred on one side. Turn over and broil on the other side for two to four minutes until charred. Remove from the heat, transfer to a bowl and allow to cool. Peel and core."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with the steel blade and drop in the garlic cloves. When the garlic is chopped and adheres to the sides of the bowl, stop the machine and scrape down the sides. Add the toasted almonds (or almonds and hazelnuts), bread and chile powder or flakes to the bowl and process to a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape down the sides of the bowl and add the pepper, tomatoes, parsley, paprika, salt and pepper. Process until smooth, and with the machine running, add the vinegar and olive oil in a slow stream, beginning with the smaller amount of olive oil and thinning out as desired. Process until well amalgamated, then scrape into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste and adjust seasoning, adding salt or chile as desired. If possible, allow the sauce to stand for an hour at room temperature before using. Serve with fish and/or grilled vegetables, or on crostini."}]}