{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Cornbread", "description": "North Carolina and sweet potatoes go way back. The relationship, according to the food writer Sheri Castle, hinges on a history of abundance. “Sweet potatoes were plentiful, even among the poorest folks of any ethnicity,” she said. “Enslaved Africans used sweet potatoes in place of yams and other West African root vegetables.” To this day, the state is a national leader in growing the crop. \n\nStephanie L. Tyson, the chef who oversees the kitchen at a Winston-Salem spot called (appropriately) Sweet Potatoes, likes to blend one Southern staple into another. The result is a cornbread laced with a holiday-friendly undercurrent of cinnamon and nutmeg. Ms.Tyson has said that the cornbread just clicks with a side of greens, but we have a feeling it will play well with cranberries and gravy, too.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19NORTHCAROLINA/19NORTHCAROLINA-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "12 muffins", "recipeCuisine": "american, southern", "recipeCategory": "breads", "keywords": "cornmeal, sweet potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 165}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 200, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "255 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons/30 milliliters vegetable oil, plus more for the muffin tin", "1 large sweet potato (about 1 pound), peeled and cut into large chunks", "2 large eggs, lightly beaten", "1 1/4 cups/300 milliliters milk", "3/4 cup/94 grams all-purpose flour", "1 1/4 cup/213 grams finely ground yellow cornmeal", "1 tablespoon/14 grams baking powder", "1 teaspoon/6 grams salt", "1/2 cup/100 grams sugar", "1/2 teaspoon/1 gram ground cinnamon", "1/2 teaspoon/1 gram ground nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees and lightly brush a 12-cup muffin tin with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potato in a small saucepan and cover with cold water. Bring to a boil, then reduce heat and simmer until potato is tender, about 10 minutes. Drain the potato, then return to the pot and mash until mostly smooth. Measure out 1/2 cup and transfer to a large bowl (discard any remaining potato in the pot). Add eggs, oil and milk to bowl and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour, cornmeal, baking powder, salt, sugar, cinnamon and nutmeg in separate large bowl. Add potato mixture and mix until just combined. (Do not overmix.) Pour batter into the prepared muffin cups and bake until the cornbread is puffed and golden, about 20 minutes. Let cool 5 minutes, then turn out onto a rack to cool completely."}]}