{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Baked Fish With Onions", "description": "For fish with a spicy North African flavor, marinate firm-fleshed fillets for at least an hour in this traditional mixture of chopped green cilantro, olive oil, garlic, green chiles, paprika and lime juice. Then roast the fish on a bed of savory sliced onions stained yellow with turmeric and seasoned with preserved lemon and olives. Serve with steamed rice or roasted potatoes, and slices of ripe tomato. ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/09KITCH_SPAN/09KITCH_SPAN-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "african, moroccan", "recipeCategory": "dinner", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 218}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "5 grams", "proteinContent": "25 grams", "saturatedFatContent": "6 grams", "sodiumContent": "770 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds grouper, halibut or snapper, cut in six 4-ounce portions of equal thickness", "Salt and pepper ", "2 bunches cilantro", "2 garlic cloves, smashed to a paste", "1 serrano chile, very finely chopped, or to taste", "1 teaspoon cumin seeds, toasted and coarsely ground", "1 teaspoon coriander seeds, toasted and ground, plus 1/2 teaspoon whole seeds", "2 tablespoons paprika", "1/2 cup plus 2 tablespoons olive oil", "3 tablespoons lime juice", "2 tablespoons butter", "3 large onions, sliced 1/4-inch thick (about 4 cups)", "1/2 teaspoon turmeric", "Pinch cayenne", "1 preserved lemon, finely diced", "1 cup green or black olives, with pits"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season fish fillets lightly with salt and pepper and set aside. Wash cilantro and pat dry. Reserve a few cilantro sprigs for garnish, then roughly chop leaves and tender stems and put in a medium bowl. Add 1/2 teaspoon salt, the garlic, the chile, 1/2 teaspoon ground cumin, 1/2 teaspoon ground coriander, the paprika, 1/2 cup olive oil and the lime juice. Stir mixture together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour cilantro sauce over fish fillets, reserving 4 tablespoons of the sauce for serving. Coat both sides of fish with the mixture. Cover and leave at room temperature for 1 hour, or refrigerate for up to several hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put butter and remaining 2 tablespoons olive oil in a wide skillet over high heat. Add sliced onions and season generously with salt and pepper. Add remaining ground cumin and ground coriander, 1/2 teaspoon whole coriander seeds, the turmeric and the cayenne. Stir to coat. When onions begin to soften, turn heat to medium. Continue cooking, stirring occasionally, for about 15 minutes, until onions are soft and begin to brown. Stir in preserved lemon and olives. Cool to room temperature. (The onions may be cooked in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Spread onions in a low baking dish. Arrange marinated fish fillets over onions in a single layer. Bake on top rack until fish is just done, 10 to 15 minutes. To serve, smear a little reserved cilantro sauce over each fillet, and give each guest a large spoonful of the onions. Garnish with cilantro sprigs."}]}