{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon and Tomatoes in Foil", "description": "Here is a dead-simple recipe for salmon prepared en papillote (a fancy name for “in paper,” though like most everyone else these days, you will use aluminum foil). Layer salmon, tomato and basil on lightly oiled foil and wrap it all up — you can even do it a night before cooking. When the time for dinner comes, you can steam, grill, roast or pan-grill the packages — though our testing shows roasting is easiest. You can substitute almost anything comparable for each of the ingredients: salmon can be replaced by any fish steak or fillet, or by boneless, skinless chicken breast. The herb and vegetable can also be varied at will, as long as the vegetable will finish cooking at the same time as the protein: if you were cooking broccoli, for example, you would have to cut it into small pieces; if carrots, you'd have to parboil them.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2019/04/16/dining/mb-salmon-and-tomatoes-in-foil/merlin_151791966_abb05c69-bdb1-46ee-9bf3-92205387ec0c-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, lunch, quick, weekday", "keywords": "healthy, high protein, low-fat, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1693}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 306, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "1 gram", "proteinContent": "18 grams", "saturatedFatContent": "4 grams", "sodiumContent": "339 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["4 tablespoons extra virgin olive oil", "1 1/2 to 2 pounds salmon fillet, cut crosswise (4 pieces)", "12 cherry tomatoes, sliced in half", "Salt and pepper", "16 basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For each of 4 packages, place one 12-inch-long sheet of aluminum foil on top of another. Smear top sheet with 1/2 tablespoon olive oil, and layer a fillet of salmon, 6 tomato halves, salt and pepper, 4 basil leaves and another half tablespoon oil. Seal package by folding foil onto itself and crimping edges tightly. Repeat to make other packages, and refrigerate until ready to cook, no more than 24 hours later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you are ready to cook, heat oven to 500 degrees. Place packages in a roasting pan. (Or they can be cooked on top of the stove in 2 skillets over medium-high heat.) Cook 5 minutes (for medium-rare) to 8 minutes from the time the mixture starts to sizzle, or roughly 10 to 12 minutes total."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let packages rest a minute, and cut a slit along the top with a knife. Use a knife and fork to open the package. Spoon the salmon, garnish and juices onto a plate, and serve."}]}