{"@context": "http://schema.org", "@type": "Recipe", "name": "Olive Oil-Poached Cod With Green Pepper Purée", "description": "Unlike many cooks, John Willoughby loves what he describes as the fresh, cool and slightly bitter taste of green peppers. This dish uses the liquor from the roasted peppers in addition to pepper purée.", "author": {"@type": "Person", "name": "John Willoughby"}, "image": "https://static01.nyt.com/images/2014/08/27/dining/27PEPPERS2/27PEPPERS2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "cod, green pepper, olive oil, poblano pepper, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1152, "unsaturatedFatContent": "68 grams", "carbohydrateContent": "106 grams", "cholesterolContent": null, "fatContent": "81 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "11 grams", "sodiumContent": "645 milligrams", "sugarContent": "94 grams", "transFatContent": null}, "recipeIngredient": ["2 green bell peppers", "1 poblano pepper", "Half a medium onion, sliced into wedges", "salt", "1 1/2 cups extra virgin olive oil", "4 4-ounce cod fillets of equal thickness"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Cover a baking sheet with aluminum foil and add the bell peppers and poblano pepper whole, and the onion wedges. Salt well and roast, turning every 10 minutes, until peppers collapse and are dark brown or black on at least half of their surfaces, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set onions aside. Put peppers in a bowl, cover with plastic wrap and let stand for at least 20 minutes. Reserve liquor that accumulates in bowl and slice peppers open over the bowl to catch any more. Remove skins, stems and seeds from peppers. (Avoid doing this under running water, because it removes some of the smoky flavor.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor or blender, purée peppers and onions to yield 1 cup, season to taste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt the cod generously and allow to stand for at least 5 or up to 20 minutes. In an enameled or nonstick pan, heat oil over medium heat until just warm. Reduce heat to medium low, slide cod into olive oil, cover the pan tightly and cook until cod just begins to flake, about 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush or dab a line of pepper purée on each of 4 plates, place a piece of cod over each line, drizzle first with olive oil from the cooking pan, then with pepper liquor."}]}