{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted or Grilled Peppers", "description": "Roasting or grilling sweet peppers makes them even sweeter, with another layer of flavor from the charred skin that is removed. You can grill them under a broiler, over a burner flame, or over coals, or you can roast them in the oven. Oven-roasting is the easiest method if you’re roasting more than one or two peppers. It yields more juice than grilling.  Keep these on hand, serve them as they are or add to salads, pasta, pizza and panini.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/11/science/recipehealthpepper/recipehealthpepper-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 113, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "455 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["4 medium red, green, or yellow bell peppers", "Sea salt (fine or coarse) or kosher salt and freshly ground pepper to taste", "2 tablespoons extra virgin olive oil", "1 or 2 garlic cloves, minced or pressed", "Slivered fresh basil leaves or chopped fresh tarragon, chervil or marjoram", "1 teaspoon balsamic or sherry vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Roasting in the oven", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425ºF. Line a baking sheet with foil. Place the peppers on the foil and bake in the oven for 30 to 40 minutes, using tongs to turn the peppers every 10 minutes. The peppers are done when their skin is brown and puffed. It won’t be black the way it is when you grill them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the peppers to a bowl. Cover the bowl with a plate or with plastic, and let sit for 30 minutes, until cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove the skins, then, holding the peppers over the bowl so no juice escapes, separate into halves or quarters and remove the stems, seeds and membranes Cut into strips if desired, and place in another bowl. Strain in the juice. If storing for more than a day, toss with 2 tablespoons extra virgin olive oil. Refrigerate until ready to use. If you wish, toss with the optional ingredients shortly before serving."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Grilled Peppers", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a Burner:\nLight a gas burner and place the pepper directly over the flame. As soon as one section has blackened, turn the pepper, using tongs, to expose another section to the flame. Continue to turn until the entire pepper is blackened. Place in a plastic bag and seal, or place in a bowl and cover tightly. Allow to sit until cool, then remove the charred skin. You may need to run the pepper briefly under the faucet to rinse off the final bits of charred skin. If so, pat dry with paper towels. Cut the pepper in half, holding it over a bowl, remove the seeds and membranes, and store as instructed above."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the broiler:\nPreheat the broiler. Cover a baking sheet with foil. Place the baking sheet under the broiler at the highest setting. Turn the peppers every 3 minutes or so, until uniformly charred. Proceed as above.\nUsing a grill: Place on a grill directly over hot coals and turn as each side becomes charred and blackened. When the entire pepper is charred, remove from the grill and proceed as above."}]}]}