{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Tomato Sauce", "description": "This is a quick, simple marinara sauce that will only be good if your tomatoes are ripe. If you have a food mill, you don’t have to peel and seed the tomatoes; you can just quarter them and put the sauce through the mill.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/07/23/health/nutrition/23health.recipe.ready/23health.recipe.ready-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "About 2 1/2 cups", "recipeCuisine": "mediterranean", "recipeCategory": "", "keywords": "low-fat, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 110}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 78, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "648 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "2 to 3 garlic cloves, minced or thinly sliced (to taste)", "3 pounds ripe tomatoes, quartered if you have a food mill, peeled, seeded, and diced if you don’t", "1/8 teaspoon sugar", "2 sprigs of fresh basil, or 2 teaspoons fresh thyme leaves", "Salt", "1 tablespoon slivered fresh basil", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, nonstick frying pan, or in a 3-quart saucepan, heat the oil over medium heat and add the garlic. Cook, stirring, just until fragrant, about 1 minute. Add the tomatoes, sugar, basil or thyme sprig, and salt (begin with 1/2 teaspoon and add more later), and bring to a simmer. Reduce the heat to medium low and simmer, stirring often, until thick. Pulpy tomatoes like romas will usually take 20 to 30 minutes. However, if the tomatoes are very juicy, it will take longer for them to cook down. The longer you cook the sauce, the sweeter it will be. You can speed up the process by turning up the heat, but stir often so the sauce doesn’t scorch. Towards the end of cooking, stir in the slivered fresh basil and some freshly ground pepper. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using quartered tomatoes, put through the medium blade of a food mill. If you used peeled seeded tomatoes but want a sauce with a smooth, even texture, remove the basil sprigs and discard. Pulse the sauce in a food processor fitted with the steel blade."}]}