{"@context": "http://schema.org", "@type": "Recipe", "name": "Fruit, Poached and Marinated", "description": "Fruit compotes make great compromise desserts; they’re sweet, but not as sweet as sorbets, and like sorbets they don’t require flour, butter or pastry skills. I didn’t develop any kind of knack for pastry until I began collaborating with pastry chefs on their cookbooks, but for years I managed to round out my dinner parties with fruit-based desserts(though the children of my friend Clifford Wright used to roll their eyes when I brought dessert – “She doesn’t bring dessert, she brings fruit,” they’d say). \nI revisited some of those desserts this week, particularly various fruits poached in wine, and I still find them delightful. I find that I’m sometimes negligent about eating fruit in the colder months, but not when I have some wine-poached pears, bananas or prunes in the refrigerator. I am as likely to stir the fruit, with its luscious syrup, into my morning yogurt as to eat it for dessert, andthe compotes are good keepers.\nEarly spring is an in-between time for fruit. Stone fruits aren’t ready yet and it’s not really apple, pear or citrus season either, though all of those fall-winter fruits are still available. I poached pears in red wine and bananas in white wine, and used dried fruits for two of my compotes, prunes poached in red wine and a dried-fruit compote to which I also added a fresh apple and pear. For the last compote of the week I combined blood oranges and pink grapefruit in arefreshing citrus-caramel syrup, and topped the fruit with pomegranate seeds. Even if my friend’s kids wouldn’t agree, this was definitely dessert.\nBananas Poached in Vanilla-Scented Chardonnay\nSummary:Don’t overcook the bananas in this easy dish, and you’ll be rewarded with a fragrant, delicious dessert.\n\nI am usually not one forbananas in desserts, but this, if you’re careful not to overcook the bananas, is heavenly. Years ago, in the early days of my career as a vegetarian caterer, I made it often; it was one of my most requested desserts. These days I’m as likely to spoon some of the bananas with their fragrant syrup into a bowl of morning yogurt as I am to serve it after a meal.\n", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT15M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "dairy-free, gluten-free, kosher, low cholesterol, low-fat, low-sodium, vegetarian, dessert, fall, spring, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 196, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "5 milligrams", "sugarContent": "24 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups chardonnay", "1 vanilla bean, split in half lengthwise", "1/3 cup mild honey, such as clover", "1 cinnamon stick", "1/2 cup golden raisins or currants", "1/2 cup dried apples (optional)", "Juice of 1 lemon", "3 to 4 firm but ripe bananas", "1/2 teaspoon freshly grated nutmeg", "1/4 cup lightly toasted slivered almonds", " Plain yogurt or whipped cream for topping, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour chardonnay into a medium saucepan. Using the tip of a paring knife, scrape seeds from vanilla bean halves into wine and add pods. Add honey, cinnamon stick, raisins or currants, and dried apples and bring to a boil. Reduce heat, cover and simmer 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fill a bowl with water and add lemon juice. Peel bananas; cut them in half lengthwise and then in 2-inch pieces, and immediately place in the acidulated water. (This prevents bananas from discoloring.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain bananas and add to simmering wine. Add nutmeg. Returnmixture to a simmer, cover and simmer 5 more minutes. Remove from heat. Add almonds. Remove cinnamon stick and if you wish, add a little more nutmeg. Serve warm, topped with whipped cream or plain yogurt if desired."}]}