{"@context": "http://schema.org", "@type": "Recipe", "name": "Gluten-Free Spaghetti With Baby Broccoli, Mushrooms and Walnuts", "description": "This week I was really into adding nuts to many of my pasta dishes. They contribute substantial “meaty” texture and wonderful flavor. Baby broccoli is more elegant than regular broccoli, with long wispy florets and thin stems.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/02/25/science/25recipehealth/25recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, quick", "keywords": "fall, winter, gluten-free, halal, healthy, high fiber, low cholesterol, low-sodium, low sugar, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 43}, "recipeIngredient": ["2 garlic cloves, minced\n", "1/4 to 1/2 teaspoon red pepper flakes (to taste)\n", "1 teaspoon fresh thyme or 1/2 teaspoon dried\n", "1/4 cup chopped walnuts\n", "1/4 cup chopped flat-leaf parsley\n", "3/4 pound gluten-free spaghetti, such as quinoa or quinoa, amaranth and rice\n", "Freshly grated Parmesan\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water. Trim the very bottoms away from baby broccoli and slice stalks. Keep sliced stalks and florets separate. Fill a bowl with cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil add salt to taste, drop in broccoli stalks and set the timer for 4 minutes. After 2 minutes add florets and blanch for 2 minutes. Using a Chinese skimmer, a strainer or a slotted spoon, transfer all of the baby broccoli to the cold water, then drain. Set aside in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium-high heat in a large, heavy skillet or a wide, heavy saucepan and add mushrooms. Don’t stir for 30 seconds to a minute so that mushrooms sear, then stir and cook, stirring often, until they have begun to soften and sweat, about 3 minutes. Add garlic and red pepper flakes. Cook, stirring, until fragrant, 30 seconds to a minute, until garlic is fragrant, and add thyme, walnuts and salt and pepper to taste. Continue to cook until mushrooms are tender, fragrant and juicy, another 3 to 5 minutes. Stir in broccoli and parsley, add salt and pepper to taste, and cook, stirring, for another minute. Remove from heat, taste and adjust seasoning. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water in pot back to a boil and add pasta. Cook al dente, using timing instructions on the package as a guide but checking pasta a minute before the time indicated is up. When pasta is ready, use a ladle to transfer 1/4 to 1/2 cup of the pasta cooking water to pan with the broccoli and mushrooms. Drain pasta and toss at once with broccoli and mushroom mixture and the remaining tablespoon of olive oil. Serve hot, passing Parmesan at the table."}]}