{"@context": "http://schema.org", "@type": "Recipe", "name": "Brussels Sprouts With Pomegranate-Tahini Sauce", "description": "This recipe is a mashup from Rawia Bishara, who has gradually adapted the home cooking of her childhood in Nazareth to the tastes of Brooklynites at her restaurant, Tanoreen. She'd never cooked Brussels sprouts before she arrived forty years ago, and she said that at first, deep-fried was the only way her children would eat them. We modern cooks may prefer roasting for a weeknight dinner, but the golden, crisp fried version should be experienced at least once. <br/><br/>\nSesame is one of the most universal flavors of the Middle East, and the base for many of its staples: tahini (sesame paste), hummus, halvah, and the spice mix called za'atar. But straight tahini sauce, with sesame, garlic, and lemon juice, comes on a little strong. The sweet sharpness of pomegranate molasses provides a counterpoint to the rich sesame, and yogurt lightens the mixture.  ", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/24/multimedia/me-culinary-tanoreen/me-culinary-tanoreen-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner", "keywords": "brussels sprouts, pomegranate molasses, tahini, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 217}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 551, "unsaturatedFatContent": "38 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "8 grams", "proteinContent": "10 grams", "saturatedFatContent": "6 grams", "sodiumContent": "165 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["3/4 cup tahini (Middle Eastern sesame paste)", "2 garlic cloves, crushed or coarsely chopped", "1/3 to 1/2 cup freshly squeezed lemon juice (from about 3 lemons)", "1/3 teaspoon salt, more to taste", "1 cup low-fat plain yogurt", "2 tablespoons pomegranate molasses", "Corn oil for frying or roasting", "3 to 4 pounds brussels sprouts, trimmed and halved", "2 tablespoons extra-virgin olive oil", "1/2 teaspoon minced garlic", "1 cup panko (Japanese bread crumbs)", "Lemon wedges and chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a food processor or blender, combine the tahini, garlic, 1/3 cup lemon juice and 1/3 teaspoon salt. Blend until smooth. Add the yogurt and pomegranate molasses and blend again. Add more salt or lemon juice to taste, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sprouts: If frying, pour 1/2 inch corn oil in a deep skillet. Heat until very hot but not smoking. (Test by gently dropping a half sprout into the oil; when oil is ready, sprout will pop loudly and sizzle immediately.) Working in batches to avoid crowding the pan, fry sprouts until browned and crisp but still bright green, 2 to 3 minutes. Remove to paper towels to drain. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If roasting, heat oven to 375 degrees and place a pan of water on the bottom shelf to prevent sprouts from drying out. Toss sprout halves in about 3 tablespoons corn oil until slick, but not dripping. Spread them out on 2 sheet pans and bake until tender and browned, about 30 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the bread crumbs: in a small skillet, heat olive oil over gentle heat until medium-hot. Add garlic and stir; it will sizzle. Immediately add bread crumbs and stir until toasted and golden brown, about 2 minutes. Stir in salt, then remove to paper towels to drain. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, spread cooked sprouts on a platter. Drizzle with about 1/2 cup sauce and top with bread crumbs. Tuck in lemon wedges around the edges and sprinkle parsley over the top. Serve immediately, passing any extra sauce at the table. "}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Middle Eastern Ingredients | Tahini", "description": "Rawia Bishara, the chef and owner of Tanoreen, discusses tahini made from sesame, one of the most universal flavors of the Middle East and the base for many of its staples.", "thumbnailUrl": "https://static01.nyt.com/images/2014/04/24/multimedia/me-culinary-tanoreen/me-culinary-tanoreen-mediumThreeByTwo440.jpg", "uploadDate": "2014-04-29T18:23:27.000Z", "duration": "PT1M21S"}}