{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilaquiles a la Lydia Child", "description": "These <em>chilaquiles</em> are better made with old tortillas than with young ones — though the latter will work, as long as you let them get stale in a 200-degree-or-so oven for an hour. The other important ingredient is bacon fat, which can be old or new, but must be the result of cooked bacon past. Together, with garlic, pepper, onion, chile and tomato, the two become the very rich and appealing base of this dish that is somewhere between a solid and a stew. At the very end, there is an egg, which is filling and enlivening at once.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2014/11/02/magazine/02eat2/02eat2-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 208}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 280, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "8 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "947 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons bacon fat", "1 tablespoon vegetable oil (or you can use all bacon fat)", "4 to 6 dry tortillas, of the kind described as having ‘‘seen better days,’’ quartered", "3 cloves garlic, smashed and chopped", "1/2 medium red onion, chopped small", "1/2 red or yellow pepper, chopped small", "1 to 2 teaspoons coarse salt, to taste", "4 to 4 1/2 cups large chopped fresh or canned tomatoes (no juice if from can)", "1/2 tablespoon pickled spicy chiles, or a few dashes Tabasco or other hot sauce", "4 eggs", "1 full cup cilantro or mint, stems removed, left as leaves", "2 limes", "Grated or crumbled Cheddar or queso blanco (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400. In a heavy low-sided casserole, heat the bacon fat and vegetable oil (or just bacon fat) over medium-high heat, until a speck of salt just sizzles if dropped in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry tortilla pieces in 2 batches until just lightly browned, removing to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat to low, and add the garlic, onion, chopped pepper and salt. Cook about 3 minutes, until onion has started to become translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes. Cook 5 minutes, stirring often, for fresh tomatoes. If you’re using canned, add a drizzle of water, and cook 8 minutes, until they have become lightly stewy. Add pickled chiles. Add fried tortillas, and stir. Add a drizzle of water now, to keep them from sticking. Lower heat, and partly cover the pot for about 20 minutes, opening to stir every few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the stew has been cooking about 15 minutes, remove a tortilla, and taste a sliver. Cook until the tortillas are completely tender. Make 4 little wells in the stew."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack eggs, one by one, into a teacup or ramekin, then tip each into a well. Salt yolks and white lightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put egg-topped stew into oven for 5 to 8 minutes, until whites are set and yolks still very slightly runny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove, top with fresh herbs and serve in a casserole or pot, with wedges of lime for each person to squeeze. Serve cheese alongside, if you want."}]}