{"@context": "http://schema.org", "@type": "Recipe", "name": "Prunes Poached in Red Wine", "description": "I know what you're thinking: stewed prunes? But this is not that. This is prunes poached in wine, a classic French dessert that you still see on dessert trolleys in bistros all over Paris. Some recipes for it have you soak the prunes in water for up to 12 hours to plump them before poaching, others have you soak them in black tea. Here you let them steep for only five minutes in just-boiled water, which means you don't lose the essence of the prunes to the liquid. Then you poach them in sweetened wine spiced up with a cinnamon stick and vanilla bean, and let them steep again for two hours. The prunes retain their intense flavor, and the wine is both spicy and just sweet enough. Serve the prunes cold or warm; you can also keep them in wine in the refrigerator for a week or two, dipping into them to spoon over ice cream or into yogurt, or just enjoying them on their own.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/01/science/02recipehealth/02recipehealth-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dairy-free, gluten-free, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegetarian, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 151, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "20 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound pitted prunes", "2 cups red wine, not too tannic (see note)", "1/4 cup mild honey, such as clover", "1 vanilla bean, cut in half lengthwise", "1 cinnamon stick", "2 strips orange or lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place prunes in a bowl and cover with boiling water. Let sit for 5 minutes, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine wine and honey in a medium saucepan. Using the tip of a paring knife, scrape seeds from the vanilla bean halves into wine and add pods. Add cinnamon stick and bring to a boil. Reduce heat, cover and simmer 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add prunes to wine and bring back to a simmer. Cover and simmer 10 minutes. Remove from heat and add zest. Remove cinnamon stick. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and let sit for at least 2 hours before serving. Serve warm, room temperature or chilled. Prunes will keep for 1 to 2 weeks in the refrigerator. "}]}