{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Green Garlic Chicken Soup", "description": "This rustic soup features green garlic, a delicious seasonal specialty that comes to the market in early spring. The tender shoots are as small as scallions or tiny leeks. Left in the ground, they will grow to be full-sized heads of garlic by mid-summer, but these young specimens are wonderful, with a mild but distinct garlic flavor. If you can’t find them, wild ramps make a good substitute. Otherwise, make this soup with 6 to 8 sliced cloves of regular garlic. The raw tomatillo salsa adds a welcome note of acidity and crunch. You can make it as spicy as you like by varying the amount of jalapeño.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/05/14/dining/14KITCH2/14KITCH2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "chicken, green garlic, tomatillo, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 125}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 820, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "6 grams", "proteinContent": "54 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1571 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large chicken legs (thigh and drumstick), about 3 pounds\n", "Kosher salt and black pepper\n", "2 tablespoons olive oil\n", "1 large yellow onion, diced, about 3 cups\n", "4 medium carrots, peeled, cut in 2-inch chunks\n", "1 celery stalk, diced\n", "1 bay leaf \n", "1 clove\n", "2 bunches green garlic shoots, about 12 shoots (may substitute wild ramps)\n", "1 small white onion, finely diced, soaked in cold water for 1 hour, about 1/2 cup\n", "3 or 4 large tomatillos, husked and finely diced, about 1/2 cup\n", "1 or 2 jalapeño peppers, seeds removed, finely chopped\n", "3 tablespoons lime juice\n", "Lime wedges, for serving\n"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken legs generously with salt and pepper. Pour olive oil into a Dutch oven or similar pot over medium-high heat. Add chicken legs and brown well, about 3 minutes per side. Remove and set aside. Add diced yellow onion and cook, stirring frequently, until browned and softened, about 5 minutes. Add carrots, celery, bay leaf and clove and return chicken to pot.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 10 cups water and 1 tablespoon kosher salt. Bring to a boil. Reduce heat to a simmer and cook until chicken is tender, but not falling off the bone, about 1 hour. Turn off heat and skim fat from surface of broth. (May be prepared up to this point several hours ahead, or up to a day in advance, and refrigerated.)\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While chicken is cooking, prepare the green garlic shoots: peel tough outer layers and roots, then rinse well. Split shoots lengthwise and chop both white and tender green parts. Set aside.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tomatillo salsa: drain diced white onion and transfer to a small bowl. Add tomatillo, jalapeño, lime juice and a little salt and stir together.\n"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, reheat soup, add chopped green garlic to pot and simmer 5 minutes. To serve, put one chicken leg in each bowl (alternatively, remove meat from bone and shred) and ladle soup over it. Pass tomatillo salsa and lime wedges at the table.\n"}]}