{"@context": "http://schema.org", "@type": "Recipe", "name": "Indian Pudding", "description": "Indian pudding was a compromise. A mass of cornmeal, milk and molasses, baked for hours, it was born of the Puritans’ nostalgia for British hasty pudding and their adaptation to the ground-corn porridges of their Native American neighbors. Originally served as a first course, it grew sweeter (but not too sweet; Puritanism runs deep) and migrated to the end of supper.\nFor a proper historical re-enactment of the dish, you need meal stone-ground from Rhode Island whitecap flint corn, a hard, tough-to-crack corn, less sweet but more buttery than hybrid strains. One of the oldest incarnations of the plant, it was cultivated by the local Narragansett and saved from extinction by a few equally flinty Rhode Island farmers. This recipe comes from George Crowther, owner and chef of the Yankee diner Commons Lunch, which has stood on the town square of Little Compton, R.I., since 1966.", "author": {"@type": "Person", "name": "Ligaya Mishan"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19RHODEISLAND/19RHODEISLAND-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "cornmeal, molasses, raisin, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 329, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "94 milligrams", "sugarContent": "41 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Butter, for the baking dish", "4 cups/ 960 milliliters whole milk", "1 cup/130 grams fine-ground yellow cornmeal", "1/2 cup/ 120 milliliters molasses", "4 eggs", "1/2 cup/ 100 grams sugar", "1/2 cup/ 80 grams raisins", "1 teaspoon/ 5 milliliters vanilla extract", "1/2 teaspoon/ 1 gram ground ginger", "Whipped cream or ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and butter a 2-quart baking dish. In a large pot, warm milk over medium-high heat until hot but not boiling. Whisk in cornmeal and molasses and cook, whisking, 2 minutes. Reduce heat to medium-low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack eggs into a medium bowl and lightly beat. Very slowly add 1/2 cup of the hot cornmeal mixture to the eggs, whisking constantly. Pour tempered egg mixture into the pot, whisking constantly to keep eggs from scrambling, and cook 3 minutes. Remove pot from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in sugar, raisins, vanilla and ginger. Pour mixture into prepared pan, then place in a larger baking dish or roasting pan. Transfer to oven and carefully pour water into the larger dish until it comes about halfway up the sides of the smaller baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until pudding is set, but still jiggles slightly in the center, 45 minutes to 1 hour. Serve warm, topped with whipped cream or ice cream."}]}