{"@context": "http://schema.org", "@type": "Recipe", "name": "Pecan Pie", "description": "Pecan pie is to the Southern Thanksgiving table what pumpkin, mince and apple pies are to the Northern version of the meal. Pecan trees can be found in back and front yards in Georgia, Texas and states in between, and pecan pie is a year-round dessert. The classic rendition is cloyingly sweet, because of the cup or cup and a half of corn syrup that most recipes call for. But you can dispense with the corn syrup and use a combination of mild honey (like clover or acacia) and Lyle’s Golden Syrup, which has a wonderful flavor that is almost like light molasses. It’s not the standard corn syrup, but you’ll end up with a pie that’s lighter but still sweet, true to Southern style.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19GEORGIA/19GEORGIA-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "9-inch pie, 8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pies and tarts", "keywords": "dessert, pecans", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 281}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 597, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "17 grams", "sodiumContent": "306 milligrams", "sugarContent": "21 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 ounces/222 grams French-style butter (82 percent fat), at room temperature", "3/4 teaspoon/6 grams salt", "2 tablespoons/30 grams sugar", "3 cups/375 grams flour, sifted", "4 tablespoons/2 ounces/60 grams unsalted butter, at room temperature", "1/2 cup/118 milliliters mild honey, such as clover or acacia", "1/4 cup/59 milliliters Lyle’s Golden Syrup", "1 teaspoon/5 milliliters vanilla extract", "1 tablespoon/15 milliliters dark rum", "1/4 teaspoon freshly grated nutmeg", "Pinch of salt", "4 extra-large eggs", "2 cups/235 grams shelled pecans", "Whipped cream or vanilla ice cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix butter, salt and sugar in a standing mixer on low speed for 1 minute. Add flour and mix on low speed just until ingredients come together. Add 6 tablespoons water and mix only until dough comes together; if it doesn’t come together right away, add another tablespoon water. Do not overmix. Scrape mixture out onto a sheet of plastic wrap and flatten into a square. Wrap well and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Very lightly butter a 9-inch pie dish. Divide dough into two equal pieces. Refrigerate one piece while you roll out the other. Ease the dough into the bottom edges of the pan and crimp the top edge. Pierce the bottom in several places with a fork. Refrigerate uncovered for several hours or overnight. (Other dough half may be rolled out and frozen for up to 3 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Line crust with parchment and fill with pie weights. Place on a baking sheet and bake for 15 minutes. Remove from oven and carefully remove pie weights and parchment. Return crust to oven and bake 15 to 20 minutes, until lightly browned. Let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 350 degrees. Cream butter in a standing mixer fitted with the paddle, or in a food processor. Add honey and golden syrup and cream together until smooth. Scrape down bowl and beater. Add vanilla, rum, nutmeg and salt and mix. Add eggs, one at a time, beating each one until incorporated before adding next."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill pie shell with pecans and smooth them out to make an even layer. Scrape in butter and egg mixture, using a rubber spatula to scrape the bowl clean. Place on a baking sheet and bake 30 to 35 minutes, until nuts are lightly browned and filling is just about set. The filling will puff up and may be bubbling, but it will settle as it cools. Do not overbake; if you leave it in too long, it will crack. Remove from oven and cool on a rack. Serve with whipped cream or vanilla ice cream."}]}