{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Wheat Yeasted Olive Oil Pastry", "description": "Yeasted crusts are more rustic than French-style short crusts. They’re also easier to manipulate — they don’t crack and tear. Remember to roll this out thinly so that it doesn’t become too bready.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/04/dining/oliveoilpastry/oliveoilpastry-articleLarge.jpg", "recipeYield": "Two 10-inch tarts", "recipeCuisine": "", "recipeCategory": "", "keywords": "olive oil, pastry, whole wheat flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 238}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 721, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "93 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "9 grams", "proteinContent": "19 grams", "saturatedFatContent": "5 grams", "sodiumContent": "416 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 teaspoons active dry yeast", "1/4 teaspoon sugar", "1 large egg, at room temperature, beaten", "1/4 cup olive oil", "1 cup whole-wheat flour", "1 cup unbleached flour (more as needed)", "3/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the yeast in 1/2 cup lukewarm water, add the sugar, and allow to sit until the mixture is creamy, about 5 minutes. Beat in the egg and the olive oil. Combine the flours and salt, and stir into the yeast mixture. You can use a bowl and wooden spoon for this, or a mixer — combine the ingredients using the paddle. Work the dough until it comes together in a coherent mass, adding flour as necessary. Turn out onto a lightly floured surface, and knead gently for a few minutes, adding flour as necessary, just until the dough is smooth — do not overwork it. Shape into a ball. Place in a lightly oiled bowl, cover the dough tightly with plastic wrap, and allow to rise in a draft-free spot until doubled in size, about one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough out onto a lightly floured surface, gently knead a couple of times, and cut into two equal pieces (or as directed in each of this week’s recipes). Shape each piece into a ball without kneading it. Cover the dough loosely with plastic wrap, and let rest for five minutes. Then roll out into thin rounds, as directed in each recipe, and line pans. If not using right away, freeze the dough to prevent it from rising and becoming too bready. The dough can be transferred directly from the freezer to the oven."}]}