{"@context": "http://schema.org", "@type": "Recipe", "name": "Clam and Chouriço Dressing", "description": "Massachusetts is the birthplace of the iconic Thanksgiving tableau, the home to Norman Rockwell, whose 1943 painting “Freedom From Want” gives Americans its most enduring vision of the holiday table. It is also home to one of the largest Portuguese-American communities in the United States and the source of one of the nation’s most flavorful hyphenated cuisines. Matthew Jennings, the chef and an owner of the forthcoming Townsman restaurant in Boston, pays homage to that cooking with a New Bedford-style Thanksgiving dressing made with local Massachusetts quahog clams and the Portuguese sausage known as chouriço. Fresh chorizo is an acceptable substitution, but canned clams are not.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19MASSACHUSETTES/19MASSACHUSETTES-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "10 servings", "recipeCuisine": "portuguese", "recipeCategory": "dinner, stuffing and dressing", "keywords": "clams, country bread, sausage, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 317, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "10 grams", "sodiumContent": "613 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 cups stale country bread, cut into 1 1/2-inch cubes (1 1/4 pounds)", "1 pound fresh chouriço sausage (or use fresh chorizo), casing removed", "1 tablespoon minced garlic", "1 large white onion, diced (2 cups)", "4 stalks celery, diced (1 1/2 cups)", "2 tablespoons minced fresh thyme", "1 tablespoon minced fresh sage", "8 tablespoons unsalted butter", "2 tablespoons whole grain mustard", "1/2 bunch fresh parsley, chopped (2/3 cup)", "1 dozen shucked and chopped quahog clams, liquor reserved (see note)", "Kosher salt and ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Spread bread cubes on a baking sheet in a single layer and bake 10 to 15 minutes, or until lightly toasted; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 375 degrees. Heat a large skillet over medium heat and add sausage. Sauté, breaking up meat with a wooden spoon, until fat has rendered and sausage is cooked through, 8 to 10 minutes. Remove to a large bowl with a slotted spoon and set aside. Discard all but 2 tablespoons of the fat left in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, onion, celery, thyme and sage to pan and cook over medium-low heat, stirring, until vegetables start to soften, about 5 minutes. Remove vegetables to bowl with sausage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a small saucepan over medium heat. Cook, swirling pan, until foam subsides and butter just begins to brown and smell nutty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bread cubes, mustard, parsley, brown butter, clams and clam liquor to bowl with sausage and vegetables and mix well. Season with salt and pepper to taste. Transfer dressing to a baking dish and bake until golden brown and crisp on top, about 15 minutes."}]}