{"@context": "http://schema.org", "@type": "Recipe", "name": "Bread Pudding Frittata", "description": "At El Rey Coffee Bar and Luncheonette, you can get this rich, silky egg terrine all day long, but it’s particularly wonderful at breakfast or brunch. Although it does take time to put together, you can do all of it well ahead – up to 24 hours. And the last minute work is minimal (slice an avocado, chop up some fresh herbs). Don’t be tempted to skip the frequent stirring while the dish bakes. It may seem fussy, but in fact is the key to the luscious texture, which is somewhere between custard and bread pudding.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/28BRUNCH2/28BRUNCH2-articleLarge-v3.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch", "keywords": "avocado, bread, eggs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 221, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "1 gram", "proteinContent": "16 grams", "saturatedFatContent": "4 grams", "sodiumContent": "323 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces soft white bread (Pullman, pain de mie or brioche all work well), cut into 1 1/2-inch chunks (3 1/2 cups)", "1 tablespoon olive oil", "18 large eggs, lightly beaten", "1/3 cup whole milk", "2 1/2 teaspoons kosher salt", "1/2 teaspoon sugar", "Sliced avocado, for serving", "Mixed soft herbs, such as parsley, mint or tarragon, coarsely chopped, for serving", "Lemon juice, for serving", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Toss bread with oil and spread on a large rimmed baking sheet. Toast bread until golden and dry to touch, about 25 minutes. Cool and place in a large container with a lid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain eggs through a fine mesh sieve into a large bowl (straining gives you the smoothest texture). Whisk in milk, salt and sugar. Pour egg mixture over bread in container and cover tightly. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, let bread-egg mixture come to room temperature for 30 minutes. Heat oven to 300 degrees. Grease an 8- or 9-inch loaf pan, preferably nonstick. Using a slotted spoon or your hands, lift bread and place into loaf pan. Pour egg mixture over it. Place pan inside a larger roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to oven and fill roasting pan with enough boiling water to come 3/4 up the sides of the loaf pan. Cover both pans with one large sheet of aluminum foil. Cook, gently stirring frittata every 10 to 15 minutes for even cooking, until just set, about 1 hour 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a knife along the sides of the loaf pan to loosen the frittata, then unmold it and flip onto a plate to cool to room temperature. Slice into eight pieces. Top each serving with avocado and herbs. Sprinkle with lemon juice and sea salt."}]}