{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Zucchini-Yogurt Soup with Fresh Mint", "description": "This refreshing summer soup is unbelievably easy. You can chill it down quickly in an ice bath (place the bowl with the soup in it into a larger bowl and fill the larger bowl with ice and water). Make sure to strain it for the best texture.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/08/20/health/nutrition/20recipehealth.ready/20recipehealth.ready-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 78}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 111, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "782 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds zucchini, sliced", "2 cups water", "Salt (1 1/2 to 2 teaspoons)", "3 cups plain low-fat yogurt", "3 tablespoons finely chopped mint", "Freshly ground pepper", "2 tablespoons fresh lemon juice", "1 garlic clove, mashed to a paste in a mortar and pestle, or put through a press (optional)", "1 small zucchini, sliced paper-thin", "4 mint leaves, cut in thin slivers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the water in the bottom of a saucepan fitted with a steamer and bring to a boil. Place the zucchini in the steamer, set over the boiling water, cover and steam 15 minutes. Remove from the heat and allow to cool for about 5 minutes. Do not drain the steaming water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place half the zucchini in a food processor fitted with the steel blade, add 3/4 teaspoons salt, and puree until smooth. Add half the steaming water and pulse until smooth. Scrape into a bowl, and repeat with the remaining zucchini and steaming water, and another 3/4 teaspoon salt. Scrape into the bowl with the first batch. Whisk in the yogurt, the chopped mint, pepper, lemon juice, and optional garlic. Taste and adjust salt. Chill, either in the refrigerator or in an ice bath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the cold soup through a medium strainer into a bowl. Use a rubber spatula to press the soup against the strainer and to scrape the soup off the outside of the strainer, to extract maximum flavor and to get as much soup through as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the thinly sliced zucchini garnish with a generous pinch of salt and place in a strainer set over a bowl, or in the sink. Let sit for 15 minutes. The zucchini will soften. Rinse and pat dry. Ladle the soup into bowls and garnish with several slices of zucchini and a sprinkle of slivered mint leaves."}]}