{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Ham With Maple-Balsamic Glaze", "description": "Think beyond pink. Here is a recipe for a fresh ham — uncured, unsmoked, straight from the butcher — roasted slowly in the oven beneath a shower of salt and pepper, glazed with maple syrup and balsamic vinegar, and finished with a mixture of toasted pecans and candied ginger. It makes for a holiday centerpiece of some distinction, and marvelous sandwiches afterward. Those with access to good pork, free-ranging and fed well, with lots of fat, do not have to brine the meat before cooking. But if you’re picking up a supermarket ham, it is a good bet to do so.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/16/dining/16EASTER_SPAN-recipe/16EASTER_SPAN-recipe-articleLarge-v3.jpg", "totalTime": "PT3H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "ham, maple syrup, pecans, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 347}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1157, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "81 grams", "fiberContent": "1 gram", "proteinContent": "73 grams", "saturatedFatContent": "27 grams", "sodiumContent": "838 milligrams", "sugarContent": "25 grams", "transFatContent": null}, "recipeIngredient": ["1 10- to 12-pound butt or shank portion fresh ham, skin on", "4 teaspoons kosher salt", "4 teaspoons ground black pepper", "1 cup maple syrup", "1/2 cup balsamic vinegar", "1 teaspoon ground cinnamon", "1/2 cup pecans, toasted", "1/2 cup candied ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Using a sharp knife, score entire surface of ham in a diamond pattern, cutting down just through the skin to the flesh underneath. (If you are cutting to the right depth, the skin will spread apart a bit as you cut.) Rub outside of ham all over with salt and pepper, pressing it into crosshatch spaces between the skin. Put roast on a rack in a large roasting pan and place in oven. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 20 minutes, reduce oven to 300 degrees. In a small bowl, whisk together maple syrup, balsamic vinegar and cinnamon. Baste ham hourly with mixture, as well as with fat from the bottom of the pan, roasting until the very center of the ham reaches an internal temperature of 145 degrees, 2 1/2 to 3 hours total cooking time. (Begin checking at 2 hours, inserting a meat thermometer into the absolute center of the roast.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the toasted pecans and candied ginger into a food processor and pulse lightly until crumbled and well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ham is done, remove it from roasting pan, shower with pecan-ginger mixture and cover it loosely with foil. Allow the meat to rest for 20 to 30 minutes. (Its internal temperature will rise to 150 or more as it rests.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tip roasting pan to the side so you can spoon off all the fat from the pan juices, then place pan on stove over medium-high heat. Scrape the bottom of pan to free any browned bits, skim any film off surface and season liquid as needed with salt and pepper. Pour into a gravy boat. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve ham into thick slices, drizzle with pan sauce and serve, passing remaining sauce on the side."}]}