{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli Crown, Leek and Potato Colcannon", "description": "As a last minute deferral to the need to have a green vegetable on the menu at Thanksgiving, we often choose broccoli. Broccoli on its own can be boring, but not in this dish, where it is cooked just until bright green and soft enough to easily chop fine and mix with mashed potatoes. The broccoli remains bright and tints the mashed potatoes pale green, with pretty green specks throughout.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/03/health/recipehealthcolcannon/recipehealthcolcannon-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 cups, about 8 servings", "recipeCuisine": "irish", "recipeCategory": "", "keywords": "gluten-free, halal, kosher, low cholesterol, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 152, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "384 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 broccoli crowns (about 1 pound total)", "1 1/4 pounds potatoes, scrubbed, cut in half if large", "Salt to taste", "1 tablespoon extra virgin olive oil", "2 medium leeks, white and light green parts only, cleaned and chopped", "3 tablespoons unsalted butter", "3/4 to 1 cup milk", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt generously. Meanwhile, cut away thick stems of broccoli crowns as close to the crown as possible, but leave crowns intact. Set aside stems for another purpose (such as pickled broccoli stems). When water comes to a boil drop in the broccoli crowns. Boil 5 minutes, flipping them over from time to time so they cook evenly. Using tongs, carefully transfer to a bowl of cold water, then drain thoroughly, place on a dish towel to drain more, then chop fine and set aside in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes to the pot, turn down heat to medium-low and boil gently, partially covered, until potatoes are tender, 25 to 30 minutes. Drain, return to pot and cover tightly. Let potatoes steam in the dry pot for 5 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over medium heat in a heavy skillet and add leeks. Cook, stirring often, until they begin to wilt, about 3 minutes. Add salt to taste and continue to cook, stirring, until very tender, about 3 to 5 more minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash potatoes with a potato masher or in a standing mixer fitted with the paddle, or put through a food mill. Season generously with salt and pepper. Add finely chopped broccoli and beat together. Heat butter with 3/4 cup of the milk until butter melts and beat into mashed potatoes. Stir in leeks and mix until well blended. If desired, add the last 1/4 cup milk. Taste and adjust salt and pepper. Serve hot."}]}