{"@context": "http://schema.org", "@type": "Recipe", "name": "Scallion and Celery Quiche", "description": "I’ve written before that I consider  celery an underrated vegetable, capable of contributing nuance and texture to a dish. But it would have never occurred to me to have it as one of the main vegetables in a  quiche if I hadn’t heard the restaurant critic Jonathan Gold discussing a tarte au céleri that he’d had at Church & State in downtown Los Angeles, a sort of tarte flambée in which celery, celery root and apples stood in for the traditional onions and bacon. I figured if it worked so well in that dish, it could also  in a quiche. It does.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/21/dining/Scallion-and-Celery-Quiche/Scallion-and-Celery-Quiche-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 6 generously", "recipeCuisine": "french, mediterranean", "recipeCategory": "dinner, lunch", "keywords": "halal, kosher, nut-free, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 128}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 334, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "8 grams", "sodiumContent": "374 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt to taste", "1 to 2 tablespoons extra-virgin olive oil, to taste", "2 bunches good-size scallions (the kind you get in the farmers market) or 3 bunches thin scallions (the kind you get in the supermarket) (about 10 ounces), trimmed, quartered lengthwise and sliced thin", "1 cup finely diced celery", "Salt to taste", "1 to 2 garlic cloves, to taste, minced", "Freshly ground pepper", "1 teaspoon fresh thyme leaves", "2 tablespoons minced flat-leaf parsley", "2 egg yolks", "2 whole eggs", "1 (9-inch) <a href=\"http://well.blogs.nytimes.com/projects/healthy-recipes/recipes/whole-wheat-pie-dough\">whole wheat pâte brisée pie crust,</a> fully baked and cooled", "Freshly ground pepper", "2/3 cup milk", "2 ounces Gruyère, grated (1/2 cup)", "1 ounce Parmesan, grated (1/4 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a medium skillet over medium heat and add scallions and celery. Cook, stirring, until celery is just tender, about 5 minutes. Add a generous pinch of salt, the garlic and thyme, and cook, stirring, until fragrant, about 30 seconds. Stir in the parsley. Season to taste with salt and pepper. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat together egg yolks and eggs in a medium bowl. Set tart pan on a baking sheet to allow for easy handling. Using a pastry brush, lightly brush bottom of the crust with some of the beaten egg and place in oven for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt (I use 1/2 teaspoon), pepper, and milk to remaining eggs and whisk together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread scallion and celery mixture in an even layer in the crust. Stir together cheeses and sprinkle evenly  on top. Very slowly pour  the egg custard over the filling. If your tart pan has low edges, you may not need all of it to fill the shell, and you want to avoid the custard spilling over. Place quiche, on baking sheet, in the oven and bake for 30 to 35 minutes, until set and just beginning to color on the top. Remove from oven and allow to sit for at least 10 minutes before serving. Serve hot, warm or at room temperature."}]}