{"@context": "http://schema.org", "@type": "Recipe", "name": "Rigatoni and Cauliflower al Forno", "description": "Cauliflower is perhaps the least appreciated member of the large family of cruciferous vegetables, no doubt due to memories of encountering it boiled, flabby and timidly seasoned, if seasoned at all. When cooked properly, it is a delight. Cauliflower can stand up to rather bold seasoning, in fact. In this recipe, it gets garlic, sage, red pepper and capers. And it is browned in olive oil, which further enhances the flavor. If you want a terrific side vegetable, just serve the sautéed cauliflower and skip the rigatoni. But combining the cauliflower with large-format pasta, pecorino cheese and bread crumbs, then baking it until crisply golden, makes for a splendid meal.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/10/01/dining/01KITCHEN3/01KITCHEN3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pastas", "keywords": "cauliflower, fontina, mozzarella, rigatoni, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2416}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 521, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "6 grams", "proteinContent": "23 grams", "saturatedFatContent": "8 grams", "sodiumContent": "575 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound rigatoni or other large pasta shape", "1 medium cauliflower, about 1 1/2 pounds", "Extra-virgin olive oil", "Salt and pepper", "1 tablespoon capers, roughly chopped", "3 garlic cloves, minced", "1/4 teaspoon crushed red pepper flakes, or more to taste", "3 tablespoons roughly chopped sage, plus a few sage leaves left whole", "1/2 teaspoon lemon zest", "6 ounces coarsely grated fontina or mozzarella", "2 ounces finely grated Romano cheese or other hard pecorino", "1/2 cup coarse dry bread crumbs", "2 tablespoons chopped flat-leaf parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the rigatoni in well-salted water according to package directions, but drain while still quite al dente. (If directions call for 12 minutes cooking, cook for 10 instead.) Rinse pasta with cool water, then drain again and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Cut cauliflower in half from top to bottom. Cut out tough core and stem any extraneous leaves. Lay cauliflower flat side down and cut crosswise into rough 1/4-inch slices. Break into smaller pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 3 tablespoons olive oil in a wide skillet over high heat. Add cauliflower slices, along with any crumbly pieces, in one layer. (Work in batches if necessary.) Let cauliflower brown and caramelize for about 2 minutes, then turn pieces over to brown the other side. Cook for another 2 minutes, or until the cauliflower is easily pierced with a fork. It’s fine if some pieces don’t brown evenly. Season generously with salt and pepper. Add capers, garlic, red pepper flakes, chopped sage, sage leaves and lemon zest and stir to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cooked cauliflower mixture in a large mixing bowl. Add cooked rigatoni and fontina and toss. Transfer mixture to a lightly oiled baking dish. Top with Romano cheese, then with bread crumbs and drizzle with about 1 tablespoon olive oil. (Dish may be completed to this point up to several hours in advance and kept at room temperature, covered.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, uncovered, for about 20 minutes, until top is crisp and golden. Sprinkle with freshly chopped parsley before serving."}]}