{"@context": "http://schema.org", "@type": "Recipe", "name": "Cast-Iron Steak", "description": "This isn't steakhouse steak; it's your-house steak, ideal for home cooks who want fast weeknight meals. The rules are simple: buy boneless cuts (they cook evenly), thinner steaks (they cook through on top of the stove), dry them well (to maximize crust), then salt and sear them in an insanely hot, preferably cast-iron pan. The recipe here is a radical departure from the conventional wisdom on steak, which commands you to salt the meat beforehand, put it on the heat and then leave it alone. Instead, you should salt the pan (not the meat) and flip the steak early and often. This combination of meat, salt, heat and cast-iron produces super-crusty and juicy steak — no grilling, rubbing, or aging required.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/05/12/multimedia/recipelab-steak/recipelab-steak-mediumThreeByTwo440-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings, with leftovers", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday, steaks and chops", "keywords": "steak", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 88, "unsaturatedFatContent": "3 grams", "carbohydrateContent": null, "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": null, "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "134 milligrams", "sugarContent": null, "transFatContent": "0 grams"}, "recipeIngredient": ["Coarse salt, such as kosher salt or Maldon sea salt", "1 or 2 boneless beef steaks, 1 inch thick (about 2 pounds total), such as strip, rib-eye, flat iron, chuck-eye, hanger or skirt (preferably “outside” skirt)", "Black pepper (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove packaging and pat meat dry with paper towels. Line a plate with paper towels, place meat on top and set aside to dry further and come to cool room temperature (30 to 60 minutes, depending on the weather). Turn occasionally; replace paper towels as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a heavy skillet, preferably cast-iron, on the stove and sprinkle lightly but evenly with about 1/4 to 1/2 teaspoon salt. Turn heat to high under pan. Pat both sides of steak dry again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pan is smoking hot, 5 to 8 minutes, pat steak dry again and place in pan. (If using two steaks, cook in two batches.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let steak sizzle for 1 minute, then use tongs to flip it over, moving raw side of steak around in pan so both sides are salted. Press down gently to ensure even contact between steak and pan. Keep cooking over very high heat, flipping steak every 30 seconds. After it’s been turned a few times, sprinkle in two pinches salt. If using pepper, add it now."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When steak has contracted in size and developed a dark-brown crust, about 4 minutes total, check for doneness. To the touch, meat should feel softly springy but not squishy. If using an instant-read thermometer, insert into side of steak. For medium-rare meat, 120 to 125 degrees is ideal: Steak will continue cooking after being removed from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove steak to a cutting board and tent lightly with foil. Let rest 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in pieces or thickly slice on the diagonal, cutting away from your body and with the top edge of the knife leaning toward your body. If cooking skirt or hanger steak, make sure to slice across the grain of the meat."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Cast-Iron Steak", "description": "To cook a fantastic steak on the stovetop, all you need is a cast-iron pan, a sprinkle of salt and a one-inch-thick cut of meat.", "thumbnailUrl": "https://static01.nyt.com/images/2014/05/12/multimedia/recipelab-steak/recipelab-steak-mediumThreeByTwo440-v2.jpg", "uploadDate": "2014-05-13T19:51:01.000Z", "duration": "PT1M15S"}}