{"@context": "http://schema.org", "@type": "Recipe", "name": "Big Bowl With Spicy Brown Bean, Squash and Corn Succotash", "description": "This version of succotash is lima-bean-free, with a kick that is a lively contrast to the sweet corn. If you have a problem liking succotash, it’s probably because of the lima beans, which have a mealy consistency that is not to everybody’s taste. What’s not to like, though, if you use another bean? Pintos or borlottis are great, and Good Mother Stallards \nfrom Rancho Gordo are luxurious. This succotash has some spice to it, a nice contrast to the sweet corn. Make sure to hold onto the bean broth. I like bulgur with this, but any grain will work.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/07/01/science/01recipehealth/01recipehealth-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 6", "recipeCuisine": "american, southwestern", "recipeCategory": "dinner", "keywords": "gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "860 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 small red or yellow onion, chopped", "1 1/4 pounds summer squash, diced (about 4 cups)", "Salt to taste", "2 garlic cloves, minced", "Kernels from 2 ears corn", "2 serrano or jalapeño chiles, minced", "Freshly ground pepper", "3 cups cooked brown beans, such as Good Mother Stallards, pintos or borlottis, with broth", "1/4 cup chopped cilantro (more to taste), plus cilantro sprigs for garnish", "4 to 5 cups cooked quinoa, brown rice, wild rice, or bulgur (to taste)", "1/2 cup crumbled queso fresco or feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a strainer or colander over a bowl and drain beans. Set broth aside to use for moistening the succotash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a large, heavy skillet over medium heat and add onion. Cook, stirring, until it begins to soften, about 3 minutes, and add squash and salt to taste. Cook, stirring, until squash begins to soften and look translucent, 3 or 4 minutes. Add garlic and corn. Cook for about 4 minutes, stirring often. Add minced chile pepper and season with salt and pepper. Add beans and about 1/2 cup bean broth and continue to cook, stirring, for another minute or two. Taste and adjust seasonings. If you want this to be a little more moist, stir in more bean broth, or just hold the bean broth and spoon directly over the bowls. Stir in cilantro and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon grain of your choice into 6 wide or deep bowls. Top with the succotash. Moisten with more bean broth. Sprinkle queso fresco or feta on top, garnish with cilantro, and serve."}]}