{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Rice and Barley Salad with Sprouted Red Lentils and Green Beans", "description": "This hearty salad, dressed with a creamy, spicy dressing, can be made with a number of different grains.\n\nI’ve been making iterations of this hearty whole grain salad tossed with a creamy, curry-spiced dressing since my earliest days of vegetarian cooking. My choice of grains for this version was a function of what I found in my pantry and my refrigerator:  -- enough brown rice and barley to combine for a salad but not enough for a more substantial dish. Farro or spelt would also work. The split red lentils, soaked just long enough to soften and begin to sprout, contribute color and texture along with their grassy flavor. Tossing the grains with lemon juice while they’re still warm intensifies the flavors in the salad.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/09/02/science/05recipehealth/05recipehealth-articleLarge.jpg", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings, vegetables", "keywords": "appetizer, main course, side dish, fall, summer, halal, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "266 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1/3 cup barley", "Salt to taste", "1/2 cup brown rice (short or long -grain)", "2 tablespoons fresh lemon juice", "1 tablespoon mayonnaise", "1/4 cup plain yogurt", "1 teaspoon curry powder", "1/2 teaspoon lightly toasted cumin seeds, ground", "1/4 teaspoon mild chili powder", "2 tablespoons lemon juice", "Salt to taste", "1/4 cup grapeseed oil", "2 tablespoons split red lentils, soaked for 2 hours or longer in water to cover and drained (1/4 cup soaked)", "1 cup diced European or Japanese cucumber", "3 ounces green beans, blanched for 4 minutes and cut in 1-inch lengths (about 1/2 cup)", "1 small green pepper, either sweet or hot, cut in small dice", "1/4 cup raisins or finely diced plums or pluots", "2 tablespoons chopped chives", "1/4 cup chopped cilantro", "2 teaspoons nigella seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook barley, bring 1 quart water to a boil in a medium-size saucepan, add salt to taste and barley. Boil like pasta for 40 to 50 minutes, until tender (some stores now sell par-boiled barley, which takes 15 to 20 minutes – not the 10 minutes that the package says to cook it). Turn off heat, drain, return barley to the pot, cover pot with a towel and return lid. Let sit for 10 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While barley is cooking, cook rice in another saucepan. Combine with 1 cup and plus 2 tablespoons water and salt to taste and bring to a boil. Reduce heat, cover and simmer over low heat for 30 to 40 minutes, until water has been absorbed by the rice. Turn off heat, cover pot with a dish towel and return lid. Let sit for 10 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cooked barley and rice to a bowl (you should have 2 1/2 to 3 cups cooked grains) and toss with 2 tablespoons fresh lemon juice. Allow to cool if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make dressing. In a bowl or jar, whisk or shake together mayonnaise, yogurt, curry powder, ground cumin, chili powder, lemon juice, salt, and grapeseed oil. The mixture should be creamy. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all of the salad ingredients except the nigella seeds and toss with dressing. Transfer to a platter, a salad bowl or individual plates. Sprinkle nigella seeds over each serving."}]}