{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Fried Broccoli Stems", "description": "This was an experiment and now it is a keeper. Peel broccoli stems, slice them thin, and pan-fry in hot oil just until the slices are charred on the edges, then flip over and brown for just a little bit of time on the other side. If you do this just right, the medallions will have edges that are slightly crispy with that wonderful fried flavor, and tender interiors. With a little salt (or even without) they are irresistible. One stem’s worth of medallions will disappear quickly, so count on 1 per person (at least!). Although you will use a fair amount of oil for frying, it doesn’t all get absorbed by the broccoli stems.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/17/science/17recipehealth/17recipehealth-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "Serves 4", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 167}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 143, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "185 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["4 to 8 thick broccoli stems", "About 4 tablespoons grape seed oil or olive oil", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel broccoli stems and slice crosswise, very thin, about 1/8 inch. (Don’t slice paper-thin because then it’s too easy to burn them.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy skillet over high heat and add enough oil to coat well (about 1/8 inch of oil in the pan). When oil is hot add broccoli stems in a single layer. (Don’t add too many at a time because they will cook quickly and you need to turn them all over before they burn.) Turn heat down to medium-high and cook broccoli stems until edges are lightly brown, then flip over with tongs. Cook for 30 seconds to a minute more and remove from oil. Drain on paper towels, sprinkle with salt, and let cool for about a minute before eating."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue with all of the broccoli stems, adding oil as needed."}]}