{"@context": "http://schema.org", "@type": "Recipe", "name": "Pernil", "description": "This classic Puerto Rican recipe for roast pork makes a festive centerpiece for a Memorial Day feast, a delicious welcome to summer. If you buy a big pork shoulder and take your time, as you should, the classic Puerto Rican pork roast called pernil can take you nearly all day. Yet there are times I feel almost guilty about this dish because the process is beyond easy and incredibly impressive, it feeds as many people as a medium-size ham, and the flavor is unbelievable. When I first learned how to make a classic pernil, about 30 years ago, the only seasonings I used were oregano, garlic and vinegar. But I’ve taken some liberties by adding a little cumin and some chiles. The onion is my addition, too. After all, pork is less flavorful than it used to be.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2020/03/02/dining/bittman-pernil/merlin_162118548_d1d912f3-4814-44f8-9520-776e92c55ccf-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "At least 6 servings", "recipeCuisine": "caribbean", "recipeCategory": "dinner, roasts", "keywords": "main course, oregano, pork", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 685}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 816, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "63 grams", "fiberContent": "2 grams", "proteinContent": "54 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1060 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 pork shoulder, 4 to 7 pounds (or use fresh ham)", "4 or more cloves garlic, peeled", "1 large onion, quartered", "2 tablespoons fresh oregano leaves or 1 tablespoon dried oregano", "1 tablespoon ground cumin", "1 teaspoon ancho or other mild chili powder", "1 tablespoon salt", "2 teaspoons freshly ground black pepper", "Olive oil as needed", "1 tablespoon wine or cider vinegar", "Lime wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Score meat’s skin with a sharp knife, making a cross-hatch pattern. Pulse garlic, onion, oregano, cumin, chili, salt and pepper together in a food processor, adding oil in a drizzle and scraping down sides as necessary, until mixture is pasty. (Alternatively, mash ingredients in a mortar and pestle.) Blend in the vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub this mixture well into pork, getting it into every nook and cranny. Put pork in a roasting pan and film bottom with water. Roast pork for several hours (a 4-pound shoulder may be done in 3 hours), turning every hour or so and adding more water as necessary, until meat is very tender. Finish roasting with the skin side up until crisp, raising heat at end of cooking if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let meat rest for 10 to 15 minutes before cutting it up; meat should be so tender that cutting it into uniform slices is almost impossible; rather, whack it up into chunks. Serve with lime."}]}