{"@context": "http://schema.org", "@type": "Recipe", "name": "Catalan Stew With Lobster and Clams", "description": "Romesco, the delicious rust-colored sauce from the Catalan region of Spain, is justly popular, served alongside grilled fish or as dip for vegetables. It is typically made with fresh and dried red peppers, roasted almonds and hazelnuts, a fair amount of garlic, and day-old bread fried in olive oil. Sometimes, however, instead of being used as a sauce, it is added to a fish stew. Known as romesco de peix or simply romescada, it may contain several kinds of fish and shellfish. In this version, which features lobster and clams, rather than stirring in the romesco at the end, the ingredients are added in stages from the beginning, for depth of flavor.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/09/17/dining/17KITCHEN1/KITCHEN1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "clams, hazelnut, lobster, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 311}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 396, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "46 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1191 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 lobsters, about 1 1/2 pounds each", "1/4 cup whole almonds", "1/4 cup hazelnuts", "Extra-virgin olive oil", "2 slices day-old bread from a large French or Italian loaf, crusts removed", "1 medium onion, finely chopped", "Salt and pepper", "2 dried ñora chiles or 1 dried ancho chile, stems and seeds removed", "1 fresh red Fresno chile, seeds removed and finely chopped", "3 canned piquillo peppers, chopped (optional)", "1 teaspoon pimentón dulce (sweet Spanish paprika)", "4 garlic cloves, minced", "1 cup fresh or canned tomato purée", "1/2 cup dry white wine", "12 littleneck clams or 24 manila clams, rinsed", "3 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil or steam lobsters for 10 minutes, then rinse with cool water. Crack shells, remove meat and cut into large chunks. Put shells in a large pot, cover with 10 cups water and simmer for 20 to 30 minutes. Strain, reserve broth and discard shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Place almonds and hazelnuts on a baking sheet and roast until fairly dark, about 12 to 15 minutes. Rub skins from hazelnuts; discard skins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, wide heavy-bottomed pot over medium heat and add olive oil to depth of 1/4 inch. When oil is hot, fry bread slices slowly on both sides until crisp and golden, 5 to 6 minutes, adjusting heat if bread is browning too quickly. Remove bread, drain on paper towel and cut into rough 1/2-inch cubes; set aside. Pour off all but about 4 tablespoons oil (Save excess oil for another purpose.) Add onion to pot, season with salt and pepper and cook until onion is softened and lightly colored, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put dried ñora or ancho chiles in a small pot of water and simmer for about 15 minutes, until softened, then drain, discarding water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put almonds, hazelnuts, fried bread, garlic, dried chiles, Fresno chiles, piquillo peppers and pimentón in a large mortar and pound to a rough paste. (You may use a food processor instead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chile mixture to softened onions and cook over medium-high heat for 5 minutes, stirring occasionally. Add tomato purée and wine and simmer until mixture has dried out a bit. Add 8 cups lobster broth and simmer until slightly thickened, about 10 minutes. Taste for salt and adjust seasoning. If too thick, add a little more broth. (May be prepared up to this point several hours ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, bring to a brisk simmer and add clams. When clams begin to open, add lobster meat and cook 5 minutes more. Stir in parsley and ladle the stew into 4 to 6 large soup bowls."}]}