{"@context": "http://schema.org", "@type": "Recipe", "name": "Cornmeal Plum Scones", "description": "Scones with jam is classic. But in most cases the jam is served alongside; here, we’ve baked it right into the pastry. This recipe calls for a whipping up a quickly made plum and honey jam scented with bay leaf (you can substitute a rosemary sprig or cinnamon stick if you’d rather). If that seems like one step too many, use any prepared jam you like, though something on the less sweet side works best. Or bake the cornmeal scones unfilled. They are moist, lightly sweet and perfectly satisfying all on their own.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/09/23/multimedia/clark-cornmeal-scones/clark-cornmeal-scones-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "8 scones", "recipeCuisine": "", "recipeCategory": "breakfast, snack, pastries", "keywords": "cornmeal, plum, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 169}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 376, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "11 grams", "sodiumContent": "186 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons/45 milliliters honey", "1 bay leaf", "3/4 pound plums/1/3 kilogram, halved, pitted and then cut into 1-inch cubes", "3/4 cup/175 milliliters heavy cream, more as needed", "1 large egg, at room temperature", "1 2/3 cups/275 grams all-purpose flour", "1/3 cup/60 grams fine cornmeal", "3 tablespoons/35 grams sugar", "2 teaspoons/7 grams baking powder", "1/2 teaspoon/2 grams kosher salt", "6 tablespoons/85 grams unsalted butter at room temperature, cubed, plus more for serving if you like"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put honey and bay leaf in a medium skillet over medium heat. Simmer until honey is bubbling and turns a shade darker, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place plums in honey. Cook, without moving, until undersides are golden brown, about 5 minutes. Stir plums and cook 1 to 2 minutes longer, until tender but not falling completely apart. If the caramel starts to get too brown, stir in a teaspoon or two of water and lower the heat. Scrape plums and syrup into a bowl and chill for at least 1 hour. (Plum compote can be made up to a week ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Line a baking sheet with parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup, mix together the cream and egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flour, cornmeal, sugar, baking powder and salt (or you can do this in a food processor). Using a fork, pastry cutter or your fingertips, cut butter into flour until the mixture forms coarse crumbs (or pulse in a food processor). Drizzle in as much of the cream mixture as you need to make a smooth, moist but not wet dough. Save remaining cream-egg mixture for brushing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto prepared baking sheet. Pat into a 1 1/4-inch thick round. Using a paring knife, cut 8 wedge-shaped scones (as though you were cutting slices of pie) and push them apart on the baking sheet to separate them 1/2 inch apart. Brush dough with remaining cream-egg mixture, or use more cream if you’ve run out of the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your fingertips, make a deep indentation about 1 inch in diameter in the center of each scone. Tuck some plum into the hole. Transfer pan to oven and bake until uniformly golden brown, 15 to 17 minutes. Cool 5 minutes on the pan, then transfer to a wire rack to cool completely. Serve scones with extra plum compote and butter on the side if you like."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Cornmeal Plum Scones", "description": "Melissa Clark makes rich cornmeal scones with honey-plum jam baked on top.", "thumbnailUrl": "https://static01.nyt.com/images/2014/09/23/multimedia/clark-cornmeal-scones/clark-cornmeal-scones-mediumThreeByTwo440.jpg", "uploadDate": "2014-09-26T20:13:28.000Z", "duration": "PT3M15S"}}