{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Brussels Sprouts and Mushrooms With Gremolata and Quinoa", "description": "When I discovered how delicious Brussels sprouts are when the edges are lightly browned, whether by pan-roasting or oven-roasting, they became a top winter vegetable in my house. Both the Brussels sprouts and the mushrooms roast quickly in a hot oven. I roast them separately so that the juice from the mushrooms doesn’t prevent the Brussels sprouts from browning properly. You can serve the roasted vegetables with quinoa but I also love them with polenta, pasta and other grains.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/04/science/06recipehealth/06recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 277}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 214, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "557 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 pound Brussels sprouts, trimmed and cut in half if small, quartered if large", "1 pound mushrooms or oyster mushrooms, halved if small, quartered if large", "Salt and freshly ground pepper", "3 tablespoons extra virgin olive oil", "1 to 2 garlic cloves, finely minced", "1/4 cup finely minced flat-leaf parsley", "2 teaspoons finely chopped lemon zest", "2 to 3 cups cooked quinoa (to taste)", "Crumbled feta or goat cheese for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line 2 baking sheets or baking dishes with parchment or foil and brush with olive oil. Place  the Brussels sprouts on one and mushrooms on the other and toss each with salt and pepper to taste and 1 1/2 tablespoons olive oil. Roast together in the oven, or 1 sheet at a time, for 20 minutes, stirring halfway through. The Brussels sprouts should be browned on the edges and tender. The mushrooms should be soft and there should be juice on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, mix together garlic, parsley and lemon zest (this is the gremolata)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tip mushrooms, with the juice in the baking dish, into a large bowl. Add Brussels sprouts and gremolata and toss together. Spoon quinoa onto plates or into wide bowls, top with the Brussels sprouts and mushrooms, spoon on any juice remaining in the bowl, top with crumbled feta or goat cheese if desired and serve."}]}