{"@context": "http://schema.org", "@type": "Recipe", "name": "Plum Tart", "description": "This tart, adapted from the pastry chef Jacquy Pfeiffer, with whom I wrote a cookbook, is a very simple way to show off the last of the season’s plums. Use the same formula for peaches, apricots and figs when those fruits are in season. The important thing to remember when making fresh fruit tarts with cut stone fruit is that you need to pack the fruit into the pastry tightly. If you don’t, the fruit will collapse in the shell as it bakes, and it will lose a lot of liquid, which could make the pastry shell soggy. Another way to prevent the shell from becoming soggy is to line it with crumbs of one kind or another — they can be cookie crumbs or breadcrumbs, crumble topping or streusel, that will absorb the juice from the fruit.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/09/24/dining/24DESSERT/24DESSERT-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "1 9-inch tart (8 servings)", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, plum, tart shell", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 229, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "153 milligrams", "sugarContent": "17 grams", "transFatContent": null}, "recipeIngredient": ["1 9-inch sweet pastry tart shell, fully baked <a href=\"http://cooking.nytimes.com/recipes/1016816-sweet-tart-dough\">(see recipe)</a>", "2 pounds/900 grams plums, pitted and cut in half if small Italian plums, cut into quarters if larger", "1 cup/120 grams crumbled vanilla cookies, bread crumbs or crumble topping", "3 tablespoons/45 grams sugar", "1/2 teaspoon/1 gram cinnamon", "1/4 to 1/2 cup apricot jam (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. If using smaller, halved plums, use a paring knife to cut a 3/4-inch slit through the top of each half, from the tip of the plum to just above where the pit should be. (This will allow the liquid from the plums to evaporate during baking instead of settling into the pit cavity.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pastry shell on a sheet pan or baking sheet. Spread crumbs or crumble topping over bottom of pastry shell in an even layer. Arrange plums in tight concentric circles in pastry shell, skin-side down, beginning with rim of the pan and standing plums up slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together sugar and cinnamon and sprinkle 2 tablespoons over plums. Place in oven and bake 45 minutes, or until tips of plums have colored; plums should retain their shape. Remove from heat, on baking sheet, and allow to cool on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once plums have cooled, sprinkle remaining cinnamon-sugar mixture over the fruit. Alternatively, heat jam in a small saucepan until runny and, instead of sprinkling fruit with sugar, gently brush cooled plums with jam to glaze."}]}