{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Tamales", "description": "Tamales are a holiday staple for Mexican-American families from the Rio Grande Valley up to North Texas, and not just at Christmas. “We have a big market for Thanksgiving tamales,” said Cyndi Hall of Tamale Place of Texas, in Leander, near Austin.\n \nAlthough Ms. Hall said she’s seen more families buy tamales than ever before, many still keep the tradition of coming together to make them. You can cook up a turkey breast or extra legs for tamales to have with the Thanksgiving meal, or make the tamales with leftover turkey for the long weekend.\n\nThey aren’t difficult, but they do take time, so the more hands you have for your assembly line, the quicker it goes. Corn husks and masa mix for tamales can be found in markets that sell Mexican ingredients; make sure you get the masa for tamales (Maseca is the most widely available brand), not the finer, drier tortilla masa harina.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19TEXAS/19TEXAS-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "16 medium-size tamales", "recipeCuisine": "southwestern", "recipeCategory": "dinner, lunch, project", "keywords": "corn husk, masa, tomatillo, turkey, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 230, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "231 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (8-ounce) bag dried corn husks", "2 cups dried masa mix for tamales (do not use masa harina)", "5 ounces/ 2/3 cup chilled lard", "1 teaspoon baking powder", "Salt", "1 cup cool chicken or turkey broth", "1/2 pound fresh tomatillos, husked", "2 jalapeño or serrano chiles, stemmed (and seeded if desired)", "2 tablespoons chopped white onion, soaked for 5 minutes in cold water, drained and rinsed", "1 large garlic clove, peeled", "6 to 12 cilantro sprigs, plus chopped cilantro for garnish", "1 tablespoon grapeseed or canola oil", "1 cup chicken or turkey broth", "Salt to taste", "1/2 teaspoon crushed dried chipotle chiles or chipotle powder", "2 cups/ 1/2 pound shredded cooked turkey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the corn husks: Place in a large saucepan, cover with water and bring to a boil. Turn off heat and use a plate to submerge husks. Soak 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the masa: In a medium bowl, mix masa with 11/4 cups hot water. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine lard and baking powder in a stand mixer and beat for 1 minute, until light. Add salt and masa in 3 additions, beating at medium-low speed. Gradually add 3/4 cup broth while beating on low speed; beat for another minute or two. Taste for salt. Test to see if masa is aerated enough by dropping 1/2 teaspoon into a cup of water; it should float to the top. Batter should be soft but not runny, holding together on a spoon if you tilt the spoon. Cover and refrigerate for 1 hour. Beat masa again for a couple of minutes, adding remaining broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the filling: Place tomatillos in a saucepan, cover with water and bring to a boil. Lower heat and simmer 8 to 10 minutes, flipping them over halfway through, until softened and olive green. Drain and place in a blender. Add green chiles, onion, garlic and cilantro sprigs. Blend until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large, heavy saucepan or skillet over medium-high heat. Add tomatillo purée and stir constantly until it thickens and begins to stick to pan, about 5 minutes. Stir in broth, add salt to taste and bring to a simmer; let simmer 10 to 15 minutes, stirring often. Stir in chipotles. Sauce should be creamy and coat the front and back of  a spoon. Taste and adjust seasoning. Remove from heat. Stir in shredded turkey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tamales: Select 16 corn husks; look for large ones that have no tears. Take a few more and tear into 16 1/4-inch-wide strips for tying tamales. Use some of the remaining husks to line a steamer that is at least 6 inches deep (or a pasta pot with an insert); reserve a few husks in case you need to double-wrap tamales. Add just enough water to the pot to miss hitting the bottom of the basket."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a corn husk in front of you and pat dry. Spread a scant 1/4 cup of the masa into a 4-inch square, leaving a 1 1/2-inch border at pointy tapered end of the husk and a roughly 3/4-inch border on the other sides. Spoon a heaped tablespoon of turkey mixture down the middle of the masa. Pull long edges of husk toward each other and join them so that batter is now wrapped around the filling. Fold the two pinched-together edges over in the same direction and wrap the tamale. If it does not seem well wrapped, wrap in a second husk. Fold pointy end up to enclose the bottom and tie with a strip of husk. The wide top end will be open. Stand tamale up, closed end down, in steamer. Repeat with remaining masa and filling. The tamales should be crowded into the steamer so they remain upright. If they don’t, fill spaces with crinkled foil. If tops stick out from top of steamer, trim with scissors."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay unused soaked husks over open tops of tamales. Bring water to a boil, cover pot, reduce heat to medium and steam tamales for 11/2 hours. Meanwhile, bring a kettle of water to a boil to replenish water in bottom of the pot, should it run out (check periodically). Tamales are done when husk comes away easily from the masa; when done, let them sit at least 15 minutes in the pot, uncovered, to firm up. Serve hot."}]}