{"@context": "http://schema.org", "@type": "Recipe", "name": "Strozzapreti With Rabbit and Green Olives", "description": "", "author": {"@type": "Person", "name": "Barbara Lynch"}, "image": "https://static01.nyt.com/images/2014/04/24/dining/Strozzapreti/Strozzapreti-articleLarge.jpg", "totalTime": "PT2H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "main course", "aggregateRating": null, "recipeIngredient": ["2 cups strained stock (recipe below)", "1 cup chopped green olives", "3 sprigs fresh rosemary", "1 whole rabbit, broken down (forearms, thighs, loins) and carcass reserved for stock", "Fresh strozzapreti (recipe below)", "Salt and pepper", "Grated Parmesan cheese", "2 tablespoons extra-virgin olive oil", "1 rabbit carcass, chopped", "1 small onion, peeled and diced", "2 ribs celery, diced", "1 carrot, peeled and diced", "2 cloves garlic, peeled and diced", "1 cup white wine", "2 cups semolina flour, divided", "Pinch of salt", "1 cup warm water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place strained stock in a sauce pot, bring to a simmer and reduce over medium-low heat for about 10 minutes. Add chopped olives, rosemary and rabbit meat and cook for another 20 minutes. Pierce meat with a fork — meat should pull away from the bone easily. Remove meat, chop into smaller pieces and add back to sauce, continuing to reduce for 10 minutes. Toss with cooked strozzapreti and season with salt and pepper to taste and a bit of grated Parmesan to pull it all together."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Rabbit Stock", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size braiser, heat oil over medium heat. Add rabbit bones, and brown. Remove bones and set aside, then add forearms, thighs and loins and sauté until browned. Remove and set aside. Add onion, celery, carrot and garlic and sauté until softened and fragrant, about 7 minutes. Add wine, scraping up any browned bits then add the bones and enough water to cover. Bring to a boil and cook for 1 hour. Reduce to a simmer and cook for an additional hour. Cool, strain, and reserve."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Strozzapreti", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1½ cups semolina with salt in a mixer with hook attachment (save the remaining half cup for the sheet trays). Add water slowly, and mix until a nice smooth ball of dough is formed, about 7 minutes. Remove and rest under a damp cloth.\n\nDivide the dough into thirds, and shape one portion at a time, keeping the remaining dough covered. On a wooden board, form large pea-size pieces of dough. Using you index and middle fingers, roll a piece toward you, back and forth a few times until about 2 inches long and thicker in the middle. If the board is too dry, wet it with a damp cloth (You will know if you need damp cloth if the pasta isn’t rolling easily!).\n\nAfter rolling, place shaped pasta on a sheet tray or flat plate sprinkled with semolina and freeze or refrigerate until you are ready to cook it."}]}]}