{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Sea Scallops With Pistachio Dressing", "description": "If you're looking for something to pair wonderfully with a few glasses of amber-hued amontillado, you can't do much better than these tender, burnished sea scallops, inspired by a memorable midcourse of scallops with pistachios and licorice at Restaurant Daniel. Though you're less likely to overcook larger sea scallops, remember that quality is more critical than sheer size. In the market, look for scallops that appear fairly dry; waterlogged scallops will never achieve that ideal caramelized crust. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/02/26/dining/26PAIR_SPAN/26PAIR_SPAN-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "appetizer, main course, pistachio, scallops", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 73}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 280, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "19 grams", "saturatedFatContent": "2 grams", "sodiumContent": "344 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon anise seeds", "1 clove garlic", "1/4 teaspoon salt, more for seasoning", "3/4 cup roasted shelled unsalted pistachios", "3 tablespoons fresh tarragon, plus sprigs for garnish", "2  tablespoons extra-virgin olive oil, plus more for pan", "2 tablespoons amontillado sherry", "2 tablespoons lemon juice", "1/3 cup fish or seafood stock, or water", "12 ounces sea scallops (12 to 16 jumbo)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar, crush the anise seeds with 1/4 teaspoon salt and the garlic. Place pistachios and tarragon in a food processor and process until finely ground. Add anise mixture, oil, sherry and lemon juice. Process to a thick paste. Transfer to a small saucepan. Whisk in stock or water. Heat on low until tepid. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast iron skillet or a griddle to very hot. Dry scallops. Brush a slick of oil on the pan, lower heat a bit and place scallops in the pan. Sear on medium-high until handsomely browned, 2 to 3 minutes. You’ll know when the scallops have browned enough when they can be lifted with your spatula without ruinous sticking. Lightly dust scallops with salt, then turn them. Reduce heat to medium-low and continue cooking until scallops are browned on the bottom and just cooked through, another 6 to 8 minutes. Meanwhile, gently warm the sauce. Whisk and add a smidgen of salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon some of the sauce in the center of each of 4 warm dinner plates. Poise 3 to 4 of the scallops around the edges of the sauce pool and garnish with tarragon."}]}