{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Eggplant Panini", "description": "Grilling eggplant slices on a panini grill is worth the price of the grill. They’re ready in 2 or 3 minutes, and if you don’t use them for this sandwich you can top them with tomato sauce, chop them up and toss them with pasta or rice, or drizzle them with vinaigrette and sprinkle with feta and fresh herbs, such as mint, parsley, basil, or marjoram.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/09/03/health/nutrition/03recipe.health.ready/03recipe.health.ready-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 1", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 28}, "recipeIngredient": ["2 to 4 1/2-inch thick slices eggplant (depending on the size of the eggplant)", "Salt", "Extra virgin olive oil", "1 tablespoon pesto (optional)", "1/2 grilled red pepper or 2 to 3 slices tomato", "Freshly ground pepper", "2 tablespoons grated cheese, such as mozzarella, fontina, Gruyère, Parmesan, or a combination", "2 thick slices country bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the eggplant slices with salt and let sit for 15 minutes. Pat dry and brush lightly with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a panini grill and place the eggplant slices in it in an even layer. Grill 3 minutes, until cooked through and nicely marked by the grill. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a little pesto on the bottom slice of bread. Top with a layer of eggplant slices, then a layer of pepper or tomato slices. Sprinkle with freshly ground pepper. Top with the grated cheese and the other slice of bread. Brush the outside of both the bottom and the top pieces of bread with olive oil. Grill 5 minutes, or until nicely toasted and the cheese has melted. Remove from the panini grill and cut into halves or thirds, depending on the size of the bread. Serve hot."}]}