{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Soup", "description": "This sweet potato soup, given a hint of yeastiness with the addition of Belgian-style beer, could take on several roles at Thanksgiving. It may be your first course, one that’s deeply flavored but not dense and heavy. Or you could ladle it into small cups for guests to sip as an hors d’oeuvre before they are seated. And it provides a reason to skip the sweet potato casserole topped with marshmallows. (Though it is a tradition in many households, it’s not a favorite of mine — but I did give it a shout-out by garnishing the soup with lightly toasted mini-marshmallows.) Regardless of how you serve this silken soup, be assured that it’s light enough to welcome a white wine, yet rich enough to pair with red.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/11/12/dining/12PAIRING/12PAIRING-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, editors' pick, soups and stews", "keywords": "appetizer, apple, beer, heavy cream, sweet potato, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 248}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "11 grams", "sodiumContent": "581 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ounces (1/2 stick) unsalted butter", "1 large clove garlic, minced", "1 medium-size onion, diced", "1 medium-size carrot, peeled and diced", "1 rib celery, peeled and diced", "1 sprig fresh thyme, leaves only", "1 1/4 pounds sweet potatoes, peeled and diced", "1 1/4 pounds tart apples, peeled and diced", "12 ounces Belgian style white beer", "1 cinnamon stick", "Salt and ground black pepper", "1/2 teaspoon ground nutmeg", "1 cup heavy cream", "40 mini-marshmallows"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a 4-quart saucepan. Add the garlic, onion, carrot and celery and cook on low until tender and translucent. Add the thyme. Add the sweet potatoes, increase the heat a little and cook, stirring from time to time, until the sweet potatoes are tender and start to caramelize, about 12 minutes. Add the apples and cook another 5 minutes or so, until they are tender. Pour in the beer and deglaze the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 5 cups water and the cinnamon stick and simmer for 30 minutes. Season with salt and pepper. Allow soup to cool slightly, then purée it in a blender. You may have to do this in two batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the soup to the pot, stir in the nutmeg and cream and simmer for 15 minutes. Check seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thread the marshmallows on several bamboo skewers, leaving a little space between them. Ignite them over a flame, just a few seconds, so they’re lightly toasted. Blow out the flame and gently remove the marshmallows to a cutting board. Pour the soup into bowls, top each with a few toasted marshmallows and serve."}]}