{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed or Roasted Beets and Beet Greens With Tahini Sauce", "description": "I usually roast beets, but I decided to steam them for this dish. I then added some water to the steamer and blanched the greens – though you could also steam them. Beets take about the same time to steam as they do to roast, and it’s a good option if you don’t want to heat up your kitchen with the oven. But I find that roasted beets have a richer flavor. Here, the flavor of the tahini sauce is so pungent that it doesn’t matter if the beets are muted.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/09/23/science/22recipeforhealthtahini/22recipeforhealthtahini-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "Serves 4 generously", "recipeCuisine": "mediterranean, middle eastern", "recipeCategory": "dinner, lunch", "keywords": "appetizer, side dish, dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 173, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "9 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "595 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 bunch medium or large beets (3 to 4)", "1 large bunch or 2 smaller bunches beet greens (about 3/4 pound)", "Salt to taste", "1 plump garlic clove, cut in half, green shoot removed", "1/4 cup sesame tahini", "2 to 4 tablespoons fresh lemon juice, to taste", "2 to 4 tablespoons chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut greens away from beets, leaving about 1/4 inch of stems. Scrub beets with vegetable brush. To steam beets, place in a steamer above 2 inches water. Bring to a boil over high heat and cover. Turn down heat to medium. Steam small and medium  beets for 30 minutes and large beets for 40 minutes,  until you can pierce the beet  to the middle with a knife or skewer. Remove from heat and allow to cool.\n\nTo roast, preheat oven to 425ºF and place beets in a baking dish (or lidded ovenproof casserole). Add 1/4 inch water to the dish. Cover tightly. Place in the oven and roast small beets (3 ounces or less) for 30 to 40 minutes, medium beets (4 to 6 ounces) 40 to 45 minutes, and large beets (8 ounces) 50 to 60 minutes, until they are easily penetrated with the tip of a knife. Remove from the oven and allow to cool in the covered baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When beets have cooled, cut away ends and slip off skins. Slice in rounds or cut into wedges or half-moons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch greens in salted boiling water for about 1 minute,  just until they wilt. Transfer to a bowl of cold water, then drain and squeeze out excess moisture, taking up the greens by the handful. Alternatively, steam for 2 minutes, using tongs to flip the greens over top to bottom halfway through, for 2 minutes, or until wilted. Rinse with cold water, squeeze out excess water and chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make sauce, purée garlic cloves with a generous pinch of salt in a mortar and pestle, or put through a garlic press. Transfer to a bowl or measuring cup and whisk in sesame tahini. Whisk in lemon juice, beginning with smaller amount. The mix will stiffen up. Gradually whisk in up to 1/4 cup water, until sauce has consistency of thick cream or runny yogurt. Taste and adjust salt and lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a platter with the beet greens and arrange beets on top and around greens. Drizzle on tahini sauce, sprinkle with parsley and serve."}]}