{"@context": "http://schema.org", "@type": "Recipe", "name": "Lefse", "description": "Lefse, thin potato-dough flatbreads like Scandinavian tortillas, or Oslo injera, can be found on holiday tables throughout the upper Midwest, wherever Norwegian families settled to farm. The recipe is adapted from Ethel Ramstad, 90, who learned it from one Ollie Amundson in North Dakota decades ago. We picked it up when she was teaching it to Molly Yeh, 25, a Chicago-raised food blogger marrying Ms. Ramstad's great-nephew, on a farm in the Red River Valley, right before Thanksgiving. \n\nThe riced potato mixture that forms the basis of the dough should be very, very cold when it is rolled out, to prevent stickiness. And although you do not need a lefse griddle to make great lefse, a lefse stick — essentially a long, thin, wooden spatula — is an admirable investment in success.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19NORTHDAKOTA/19NORTHDAKOTA-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "About 18 large or 36 small lefse", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 270, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "225 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 pounds/2 1/4 kilograms red-skinned potatoes, peeled and cut into uniform size", "2/3 cup/158 milliliters neutral oil, such as canola", "1 (5-ounce) can/148 milliliters evaporated milk", "1/2 cup/100 grams sugar", "2 teaspoons kosher salt", "2 1/2 to 3 cups/312 to 375 grams all-purpose flour, more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil over high heat. Cook potatoes until tender, 15 to 20 minutes. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rice potatoes into a large bowl, continuing until you have 8 cups. Add oil, evaporated milk, sugar and salt, and mix well. Let cool, then cover and refrigerate for a few hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to make lefse, add 2 1/2 cups flour and mix well. Divide dough into two logs if you have a lefse grill, and four if you do not. Dough should be sticky and hold together, but not so sticky it’s impossible to work with; if necessary, add remaining 1/2 cup flour. Cut each log into 9 or 10 pieces, shape into small balls and place on plates in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have a lefse grill, heat it to 400 degrees. If you don’t have a lefse grill, set a wide, low-lipped nonstick pan over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Generously dust work space with flour and flour a rolling pin. Roll one dough ball in flour, then use the heel of your hand to press it into a thick disk. If you have a lefse grill, gently roll dough into a large, thin circle (if you are using a regular pan, roll into a thin circle just smaller than the size of your pan), lifting and flipping frequently so it doesn’t stick; use more flour as needed. Brush excess flour from dough. Use a lefse stick to carefully transfer to grill (use a thin spatula if cooking in a pan). Cook for 1 minute, or until lefse is steaming and small bubbles appear on uncooked side. Using lefse stick or spatula, flip lefse and cook for 45 seconds or so. Place lefse on a clean dish towel and cover with another. Repeat, stacking lefse atop one another between the dish towels."}]}