{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Tofu and Escarole", "description": "This stir-fry has hot (red pepper flakes), sour (vinegar), sweet (honey) and bitter (escarole) elements. Escarole goes by a few names, including broad-leafed endive and Batavia endive. (In France it is just called Batavia). It tastes a lot like curly endive, though not quite as bitter. It looks a bit like a ruffled leaf lettuce, with tougher leaves. The inner leaves are lighter and more tender than the outer leaves, and they are great in salads. I add them later than the outer leaves to this stir-fry.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/20/health/20bitterstofu/20bitterstofu-articleLarge.jpg", "totalTime": "PT6M", "recipeYield": "Serves 4", "recipeCuisine": "chinese", "recipeCategory": "dinner, vegetables", "keywords": "dairy-free, halal, high fiber, kosher, low cholesterol, vegetarian, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 226, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "8 grams", "proteinContent": "19 grams", "saturatedFatContent": "2 grams", "sodiumContent": "683 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["One 14-ounce box firm tofu, drained and cut in 1/4-inch thick, 2-inch by 3/4-inch dominoes", "2 tablespoons soy sauce", "1 tablespoon cider vinegar or rice vinegar", "1 tablespoon honey, agave nectar, or raw brown sugar", "1/4 cup vegetable stock, chicken stock or water", "1/4 to 1/2 teaspoon salt (to taste)", "1 teaspoon cornstarch or arrowroot dissolved in 2 tablespoons vegetable stock or water", "2 tablespoons peanut, canola, rice bran, sunflower or grape seed oil", "2 to 3 teaspoons minced garlic", "2 to 3 teaspoons minced ginger", "1/2 teaspoon red pepper flakes or 1 minced serrano", "1 generous bunch escarole (1 to 1 1/4 pounds), leaves separated, washed and dried", "1 bunch scallions, white and green parts separated, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and dry tofu slices on paper towels. In a small bowl or measuring cup combine soy sauce, vinegar, sweetener and stock or water. In another bowl or ramekin, dissolve cornstarch or arrowroot in stock or water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate dark outer escarole leaves from lighter inner leaves. Cut all of the leaves crosswise into 1-inch pieces and keep in separate containers. Have all ingredients within arm’s length of your pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to wok. Swirl in 1 tablespoon of oil by adding it to the sides of the wok and swirling the wok, then add tofu and stir-fry until lightly colored, about 2 minutes. Remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in remaining oil, add garlic, ginger and chile flakes or minced chile, and stir-fry for no more than 10 seconds. Add dark escarole leaves and stir-fry for 1 minute, until wilted. Add salt, toss together and return tofu to the wok. Add inner escarole leaves, white part of the scallions, and soy sauce mixture.  Stir-fry for 1 minute, until the inner leaves are crisp-tender, and add scallion greens and the cornstarch mixture. Stir just until lightly glazed and remove from heat. Serve with hot grains or noodles."}]}