{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Eggplant", "description": "This is the first step in most of my eggplant recipes. Large globe eggplants take from 20 to 25 minutes, depending on how plump they are. Small narrow eggplants like Japanese eggplants take about 15. The roasted eggplant is fragrant and delicate; if you need it to hold its shape in the recipe, roast for a shorter time, just until you see the skin beginning to wrinkle.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/09/01/health/eggplant_600/eggplant_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "eggplant, extra virgin olive oil, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 169}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 101, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "8 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "6 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 eggplant", "Extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450ºF. Cut the stem and calyx off the eggplant, and cut in half lengthwise. Score large eggplants down the middle with the tip of a knife, being careful not to cut through the skin. (Japanese eggplants and other small eggplants needn’t be scored.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover a baking sheet with foil and brush the foil with extra virgin olive oil. Place the eggplant on the foil, cut side down. Place in the oven and roast large, fat eggplants for 20 to 25 minutes (depending on the size). Roast small narrow Japanese eggplants (and other varieties) for 15 minutes, or until the skin has begun to shrivel, the edges and cut surface are browned, and the eggplant has softened but it hasn’t collapsed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and use a spatula to detach from the foil if the eggplant is sticking (if a thin surface of browned eggplant stays behind, don’t worry). Place the eggplant halves cut side down on a rack set over a baking sheet, or in a colander. Allow to cool and drain for 15 to 30 minutes."}]}