{"@context": "http://schema.org", "@type": "Recipe", "name": "Piperade", "description": "Green peppers are featured in many traditional Basque dishes. This piperade can be served as a main dish, usually with the addition of ham; a side dish, or a condiment.", "author": {"@type": "Person", "name": "John Willoughby"}, "image": "https://static01.nyt.com/images/2014/08/27/dining/27PEPPERS1/27PEPPERS1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 2 1/2 to 3 cups", "recipeCuisine": "french, spanish", "recipeCategory": "dinner, easy, lunch, soups and stews, vegetables", "keywords": "bell pepper, garlic, onion, plum tomato, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 178, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "4 grams", "sodiumContent": "221 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 plum tomatoes, peeled and roughly chopped, about 2 cups", "3 tablespoons extra-virgin olive oil", "1 medium onion, thinly sliced", "2 medium green bell peppers, stem, seeds and ribs removed, roughly chopped", "1/2 teaspoon salt", "4 cloves garlic, minced", "1 teaspoon sugar", "1/2 teaspoon piment d’Espelette (or substitute hot paprika)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut a small X into bottom of each tomato. Bring a pot of water to a boil, add tomatoes and cook until skin begins to wrinkle and peel at the edges of the cuts, about 30 seconds. Drain, rinse with cool water and peel off skin with your fingers. Roughly chop tomatoes and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 12-inch skillet over medium high heat, heat oil until hot but not smoking. Add onions, peppers and salt and sauté, stirring frequently, until onions are translucent and peppers have started to lighten in spots, about 10 minutes. Add garlic and continue to sauté for 1 more minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in tomatoes, sugar and piment d’Espelette, reduce heat to medium, cover and cook until tomatoes are starting to fall apart and peppers are soft but still hold their shape, about 15 minutes. Remove cover and continue to cook, stirring frequently, until mixture thickens like a slightly runny relish, about 5 minutes more. Adjust salt."}]}