{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Hor Mok", "description": "Red-curry paste lends earthy flavor and mellow heat to this savory baked coconut-milk custard studded with meaty sautéed mushrooms.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 8-ounce jars.", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 283, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "19 grams", "sodiumContent": "444 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons vegetable oil", "12 ounces mushrooms, roughly chopped", "Salt", "2 tablespoons Thai red-curry paste", "2 1/2 cups coconut milk", "3 large eggs", "1 tablespoon light soy sauce", "2 teaspoons agar agar", "Handful of Thai basil leaves", "Julienned kaffir lime leaves for garnish", "Slivers of sweet red pepper for garnish."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325. Put the oil in a medium skillet over medium-high heat. When it’s hot, add the mushrooms and a sprinkle of salt. Cook, stirring occasionally, until the mushrooms are lightly browned and all of their liquid has evaporated, 10 to 12 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the curry paste in a large bowl. Spoon 6 tablespoons of the thickest, creamiest part of the coconut milk into a separate small bowl, and reserve for later; add the remaining coconut milk to the bowl with the curry paste, and whisk to combine. Add the eggs, soy sauce, 1 teaspoon salt and the agar agar, and whisk until everything is mixed together. Stir in the sautéed mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the bottoms of 6 8-ounce jars (the short, wide ones) or ramekins with a few Thai basil leaves, then spoon in the custard, filling each jar a little more than halfway. Tap the jars gently on the counter to get rid of any air pockets, then put the jars in a roasting pan. Fill a pitcher with the hottest tap water your faucet can manage, and pour the water into the pan so it reaches about two thirds of the way up the sides of the jars; be careful not to splash any water into the jars."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the roasting pan tightly with aluminum foil, and bake until the custard is nearly set, about 30 minutes. Remove the pan from the oven, uncover it and spoon 1 tablespoon of the thick coconut milk on top of each jar. Cover again, return to the oven and bake until the custard is just set (if you shake the jar or tap on the side, the custard should still jiggle slightly), another 5 to 10 minutes. Carefully (with tongs or a kitchen towel) remove the jars from the water bath, and let them cool a bit (you want to serve them warm). Garnish each custard with some of the kaffir lime and a few slices of pepper, and serve."}]}