{"@context": "http://schema.org", "@type": "Recipe", "name": "Home-Cured Pork Belly", "description": "Tesa, cold-cured pork belly with a delicious spice coating, is the easiest home-curing project, according to Paul Bertolli, the charcuterie guru, who provides the technique in his book “Cooking by Hand.” No special ingredients are needed except for pink curing salt, a mix of sodium nitrite and regular salt. I bought mine (marketed as Insta Cure No. 1) on Amazon.com. You supply space in the refrigerator and the ability to keep it quite cold, below 40 degrees. (If your refrigerator does not have a digital thermostat, you’ll need a good thermometer.) After two weeks my tesa had lost about 15 percent of its weight, indicating that it was ready to eat cooked. A 10-pound piece of pork belly is about as large as a sheet pan, but the recipe can easily be halved. Just take care to use exactly 1/8 teaspoon of curing salt for each pound of meat.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/tesa/tesa-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "", "recipeCuisine": "italian", "recipeCategory": "breakfast, brunch, dinner, lunch, project", "keywords": "appetizer, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 443, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "0 grams", "proteinContent": "8 grams", "saturatedFatContent": "16 grams", "sodiumContent": "207 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup black peppercorns", " 1 dozen cloves", "1 dozen allspice berries", "1 dozen juniper berries", "1 1/2 tablespoons hot red pepper flakes", "1 teaspoon nutmeg, freshly grated", "3/4 cup kosher salt", "1 1/4 teaspoons pink curing salt", "10-pound piece of pork belly, with the skin", "1 head of garlic, coarsely chopped", "1/2 cup red wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a spice grinder or mortar and pestle, peppercorns, cloves, allspice berries,  juniper berries and hot red pepper flakes. Grind until coarse."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the spices with nutmeg, kosher salt and curing salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the spice and salt mixture all over a 10-pound piece of pork belly, with the skin. Peel and coarsely chop 1 head of garlic, combine it with 1/2 cup red wine, and rub this on the meat, too. The wine helps the salt find its way into the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange a metal rack on a sheet pan with sides and place the meat on the rack, to allow airflow. Leave it in the refrigerator for a week. Turn it over daily and pour off any liquid. The tesa is ready when the salts have penetrated to the center, one to two weeks depending on how thick the belly is. Test after one week by tasting a thin slice from near an edge, crisped in a pan. Once cured, the tesa can be refrigerated, tightly wrapped, for a month, or frozen. Cook it as you would bacon or pancetta; it’s especially good as crisp lardons in a salad."}]}