{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pepper Omelet", "description": "Roasted peppers, chopped herbs and a little bit of Parmesan make for a quick omelet in the spirit of a pipérade.\nI often make the classic Basque pipérade, eggs scrambled with stewed peppers and tomatoes. This time, I kept it a little simpler and used my roasted peppers to fill an omelet. I added chopped, fresh herbs and a little bit of Parmesan to the mix. If your peppers are already roasted (I had plenty on hand as I’d been working with roasted peppers all week) this is a 2- to 5-minute dinner. As always, the better the eggs (farm-fresh, pastured), the better the omelet.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/05/science/07recipehealth/07recipehealth-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "1 serving", "recipeCuisine": "french, mediterranean", "recipeCategory": "breakfast, brunch, dinner, lunch", "keywords": "appetizer, main course, fall, summer, gluten-free, halal, kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 303, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "18 grams", "saturatedFatContent": "6 grams", "sodiumContent": "504 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["About 1/3 cup chopped or sliced roasted peppers (about 3 ounces)", "Salt and freshly ground pepper", "2 to 3 teaspoons chopped fresh parsley, thyme, marjoram or basil (optional)", "2 large or extra-large eggs", "Salt and freshly ground pepper", "2 teaspoons milk (optional)", "2 teaspoons extra virgin olive oil", "2 teaspoons freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make sure peppers are nicely seasoned. Stir in chopped herbs if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break eggs into a bowl and beat with a fork or a whisk until frothy. Whisk in salt and pepper to taste and  milk if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an 8-inch nonstick omelet pan over medium-high heat. Add  olive oil. When oil feels hot when you hold your hand above it, pour eggs into the middle of the pan, scraping every last bit into the pan with a rubber spatula. Swirl pan to distribute eggs evenly over the surface. Shake pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with the spatula in your other, to let eggs run underneath during the first minute of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as a few layers of egg are set on the bottom, spoon peppers down the middle of the egg “pancake” and sprinkle on  Parmesan. Jerk pan quickly away from you then back toward you so  the omelet folds over on itself. If you don’t like your omelet runny in the middle,  jerk pan again so  omelet folds over once more. Cook for up to a minute longer. Tilt pan and roll out onto a plate."}]}