{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Steamed Petrale Sole with Uncooked Tomato Sauce", "description": "", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/08/13/science/12recipehealth/12recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "french, mediterranean", "recipeCategory": "dinner, vegetables", "keywords": "dairy-free, gluten-free, halal, high protein, kosher, nut-free, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 182, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "18 grams", "saturatedFatContent": "2 grams", "sodiumContent": "608 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds ripe tomatoes", "1 to 2 garlic cloves (to taste), peeled, green shoots removed", "Salt and freshly ground pepper to taste", "2 teaspoons balsamic vinegar", "3 tablespoons extra-virgin olive oil", "1 tablespoon chopped fresh tarragon", "1 tablespoon chopped fresh basil (more to taste)", "Thin strips zest from 1/2 orange", "1 1/2 to 2 pounds petrale sole fillets", "Salt and freshly ground pepper to taste", "2 basil sprigs", "Thin strips zest from 1/2 orange"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tomatoes in half along the equator. Place a strainer over a bowl and\nsqueeze out seedpods. Rub seedpods against strainer to extract juicy pulp. Discard seeds. Place a box grater in a wide bowl, and using the large holes of the grater, grate tomatoes by rubbing the cut side against the grater, with the skin side cupped in your hand. When you feel the holes of the grater against the inside of the tomato skin, you are done. Add juice from seedpods."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a food processor fitted with a steel blade and drop in the garlic. When it is chopped and adhering to the sides of the bowl, stop the machine and scrape down the sides with a spatula. Add tomatoes, salt, pepper and balsamic vinegar. Process in machine for 1-2 minutes, until sauce is frothy. With machine running, slowly add olive oil. Alternatively, purée at high speed in a blender for 1 minute, until frothy. Transfer \nto a bowl, taste and adjust seasonings. Stir in tarragon. Taste and adjust salt and pepper. Cover and set aside at room temperature if serving in an hour or two, or refrigerate for up to a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the fish. Prepare the fillets by slapping them – not too hard – with the flat side of a knife, just to break down fibers so they don’t curl too much when you steam them. Season with salt and pepper. You will probably have to steam the fish in batches. Brush your steamer rack with olive oil and place as many fish fillets on top as will fit in one layer. If the fish fillets are too long to lie on the rack, fold them over at the middle. \nCombine about 1 inch of water and a couple of basil sprigs in the bottom of your steamer and bring to a boil. Place steaming rack in pot and steam fish for 5 minutes, until opaque and fish pulls apart when you insert a fork into it. Remove from heat, transfer to a lightly oiled platter and allow to cool. Sprinkle with orange zest, cover and refrigerate for 30 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 30 minutes before you wish to serve, whisk basil and remaining orange zest into the tomato sauce. Taste and adjust seasonings. Remove fish from refrigerator and pour on half the sauce. When ready to serve, spoon some sauce onto each place, top with the fish and more sauce, and serve."}]}