{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Chip Cookies", "description": "At WD-50 on Manhattan’s Lower East Side, the pastry chef Malcolm Livingston II specializes in building delicious and visually arresting desserts out of ingredients that seem to have been thrown together like strangers at a cocktail party. (A recent example: “verbena mousse, plum, buckwheat, camelina oil.”) But when it comes to the family meal, when members of the kitchen team meet up for a mass nosh, Mr. Livingston is known for baking something more traditional: chocolate chip cookies. “I think they stand out because of the texture,” he said, citing his blend of all-purpose flour, bread flour and melted butter. Pay attention to the process, though. “When making them at home, set aside enough time for your dough to be chilled,” he advised. “The cookies bake better when they are going straight from freezer or fridge directly into the oven.”", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/11/05/dining/20151105-NOMA-slide-6G5B/20151105-NOMA-slide-6G5B-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "3 dozen cookies", "recipeCuisine": "american", "recipeCategory": "easy, snack, cookies and bars", "keywords": "chocolate chips, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 304}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 89, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "46 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["11 tablespoons/150 grams unsalted butter, melted", "1/2 cup/100 grams packed dark brown sugar", "1/2 cup/88 grams granulated sugar", "1 egg plus 1 yolk", "1 cup/150 grams bread flour", "1/3 cup/50 grams all-purpose flour", "1 teaspoon/4 grams salt", "1/4 teaspoon baking soda", "1/4 teaspoon baking powder", "3/4 cup/125 grams chocolate chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer fitted with the whisk attachment, whip the butter, brown sugar and granulated sugar for 3 minutes. Add the egg and yolk and whip for another 6 minutes or until light in color and fluffy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together the flours, salt, baking soda and baking powder. Switch to the paddle attachment on the mixer and add the dry ingredients and chocolate chips. Mix on low speed until all ingredients are incorporated and mixture looks homogeneous. Dough will be slightly wet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chill the dough until set enough to scoop with an ice cream scoop. Or transfer the dough to a sheet of parchment paper and roll into a log. Wrap it in the paper and twist the ends tightly to secure, and chill until firm enough to cut into 1-inch slices, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, heat oven to 375 degrees. Line a baking sheet with parchment paper, scoop the dough or slice, and space cookies at least 2 inches apart on the baking sheet. Cook for 12 to 15 minutes or until golden brown on the edges but still soft in the middle."}]}