{"@context": "http://schema.org", "@type": "Recipe", "name": "Date and Walnut Cookies", "description": "This recipe comes from “Treasured Recipes Old and New 1975,” a community cookbook by the Schuyler-Brown Homemakers Extension in Iowa Falls. It was contributed by Wilma Miller, who credits the recipe to her great-aunt. Ms. Miller wrote that the original recipe called for two pounds of walnuts, but that she prefers it with pecans “and not that many.” That makes sense. Mixing in even a pound of nuts requires the arms of a sturdy farm wife. The recipe yields enough for an entire church supper.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/11/19/dining/19IOWA/19IOWA-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 7 dozen cookies", "recipeCuisine": "", "recipeCategory": "snack, cookies and bars", "keywords": "all-purpose flour, dates, pecans, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 331}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 110, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "59 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups/350 grams all-purpose flour", "1 teaspoon/5 grams salt", "1 teaspoon/3 grams cinnamon", "1/2 teaspoon/1 1/2 grams ground cloves", "8 ounces/2 sticks/227 grams soft unsalted butter", "1 1/2 cups/300 grams light brown sugar", "3 large eggs, lightly beaten", "1 tablespoon/13 grams baking soda", "1 pound/450 grams chopped pitted dates", "1 pound/450 grams chopped walnuts or pecans", "Confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line one or more baking sheets with parchment. Place flour in a bowl and whisk in  the salt, cinnamon and cloves. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cream butter and brown sugar together by hand or in an electric mixer. Beat in eggs. The mixture will not be smooth. Dissolve the baking soda in 1 tablespoon hot water and stir it in. Stir in the dates and nuts. The batter will be heavy and not easy to mix. Work in the flour mixture, about a third at a time. If your electric mixer has a dough hook, use it for working in the flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop heaping teaspoons of batter onto prepared baking sheet or sheets, making craggy mounds about 1 1/2 inches in diameter. Space them about 1 1/2 inches apart; the cookies will not spread very much. (Alternatively, for neater cookies, you can roll the batter into balls between your palms, then lightly press them down with the back of a spoon or the tines of a fork.) Allow to sit at room temperature 30 minutes to 1 hour before baking. Depending on the size of your oven and your baking sheets, you can form the cookies ready to bake on sheets of parchment paper on your countertop, then transfer them to baking sheets in shifts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 15 to 20 minutes, until nicely browned. Let cool, then dust with sifted confectioners’ sugar. If you plan to freeze some of the cookies, do not dust them with confectioners’ sugar; wait until after they thaw."}]}