{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Mushrooms and Broccoli", "description": "Broccoli stems and flowers can be prepared and cooked separately, like two different vegetables. For this pasta I used a vegetable peeler to shred the broccoli stems into thin ribbons, which I cooked briefly with the mushrooms. I sliced the crowns very thin and blanched them briefly with the pasta. The result is a dish with different textures and shades of green: the stems should be crisp-tender, their color faded. The crowns will be bright green, and 2 to 2 1/2 minutes cooking will render them tender but not mushy.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/06/17/science/18recipehealth/18recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner", "keywords": "fall, spring, summer, winter, halal, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 107}, "recipeIngredient": ["2 large stalks broccoli (stems and crowns)", "2 tablespoons extra-virgin olive oil", "1/2 pound mushrooms, sliced 1/3 to 1/2 inch thick", "2 garlic cloves, minced", "Salt and freshly ground pepper", "1 teaspoon fresh thyme leaves (optional)", "8 ounces spaghetti", "Freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut broccoli stalks away from crowns and peel stalks. Use a vegetable peeler to shave stalks into thin ribbons. Set aside. Cut crowns into thin slices (about 1/4 inch). Combine with the little flower buds that fall off onto your cutting surface in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water for the pasta. Heat 1 tablespoon of the oil over medium-high heat in a large, heavy skillet. Add sliced mushrooms and sauté until lightly colored and beginning to sweat, 3 to 5 minutes. Reduce heat to medium, add salt to taste, another tablespoon of oil, and shaved broccoli stems. Continue to sauté until the broccoli stem ribbons are crisp-tender, 3 to 5 minutes. Add garlic and thyme, season to taste with salt and pepper, and cook, stirring, until garlic smells fragrant, 30 seconds to a minute. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water in the pasta pot comes to a boil, add salt to taste and spaghetti. Set timer for 2 minutes less than the cooking time suggested on the package. When it goes off, add thinly sliced broccoli crowns and flower buds, and cook 2 minutes more, or until the pasta is al dente. Using a ladle, transfer 1/2 cup of the pasta cooking water to the pan with the mushrooms and shaved broccoli stems. Drain the pasta and broccoli and toss with the mushroom and stem mixture, either in a large bowl or right in the pan. Serve with Parmesan cheese."}]}