{"@context": "http://schema.org", "@type": "Recipe", "name": "Tricolor Salad alla Splendido", "description": "An Italian restaurant standard is kicked up a few notches in this recipe from Mario Carbone, the chef at Carbone restaurant in New York. If you find it hard to track down Italian frisée or various types of radicchio, you can substitute the usual trio of arugula, endive and radicchio. A helping of poached tuna adds richness and a hint of a salade niçiose.  ", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2014/03/19/dining/20140319-TORRISI-slide-LJU9/20140319-TORRISI-slide-LJU9-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "main course, side dish, olives, radicchio, tuna", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "recipeIngredient": ["8 ounces raw tuna steak", "Salt and freshly ground pepper", "1 lemon", "2 bay leaves", "2 cups plus 1/2 cup extra-virgin olive oil", "8 ounces various types of radicchio, like Castelfranco, Tardivo, Treviso or Rosa di Gorizia", "4 ounces frisée, Italian if possible", "1/4 cup large capers (packed in salt, rinsed and soaked a half-hour)", "1/3 cup small pitted olives, preferably taggiasca", "1/2 cup golden raisins, rehydrated in 1 cup boiling water", "2 tablespoons lime juice", "1/4 cup chopped parsley", "1 bunch chives, minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tuna into 4 even portions; season both sides with salt and pepper. With a peeler, cut 4 long strips from skin of lemon; place in a small pot with the bay leaves and tuna. Add about 2 cups oil, or enough to just cover the tuna. Over medium heat, bring oil to about 140 degrees and gently poach for 10 minutes, adjusting or turning off heat to maintain temperature, until tuna is cooked through. Turn off heat and allow tuna to cool in the oil for 10 minutes. Cut into 1/4-inch slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and dry all greens well. Keep leaves whole and place in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 1/2 cup oil in a small saucepan with the capers, olives and raisins. Once they begin to fry lightly and become aromatic, add tuna slices and pour mixture over the greens. Juice the lemon and add 2 tablespoons juice, along with lime juice, parsley and chives. Toss well and season with salt and pepper to taste. Divide among 4 plates and serve immediately."}]}