{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Trahana Soup With Lemon and Olive Oil", "description": "This is just about the simplest dish to make with trahana, yet I find it incredibly satisfying and refreshing. I like it both hot and cold; it is cooling on a hot summer day and comforting on a cool one (we were in the middle of a bad heat wave when I was testing this week’s recipes). The soup is adapted from a recipe in Diane Kochilas’s new cookbook: “Ikaria: Lessons on Food, Life, and Longevity From the Greek Island Where People Forget to Die.” My favorite herb to use with the soup is fresh dill. If you want to add more ingredients, simmer vegetables of your choice in the broth, or add blanched or steamed vegetables to the soup when you serve it. Broccoli would be great, as would peas, beans, or sugar snap peas.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/21/science/21recipehealthlemon/21recipehealthlemon-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "Serves 6", "recipeCuisine": "greek, mediterranean, middle eastern", "recipeCategory": "", "keywords": "appetizer, main course, fall, spring, summer, winter, halal, kosher, low cholesterol, low sugar, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 224, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "887 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["3 tablespoons extra virgin olive oil", "<a href=\"http://cooking.nytimes.com/recipes/1016876-homemade-sour-bulgur-trahana-from-ikaria\">1 1/2 cups sour bulgur trahana</a>", "8 cups water, vegetable stock, or chicken stock", "Salt and freshly ground pepper", "3 tablespoons lemon juice, strained", "6 tablespoons crumbled feta", "Plain Greek yogurt for garnish (optional)", "Chopped fresh herbs for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium soup pot heat 2 tablespoons of olive oil over medium heat and add  trahana. Stir until coated with oil, about 1 minute. Add  water or stock and bring to a boil. Add salt and pepper to taste, reduce the heat and simmer, stirring often, until trahana is tender and nutty tasting and the broth slightly thickened, 15 to 20 minutes if using home-made bulgur trahana (if you use semolina or flour trahana the time will only be 8 to 12 minutes and the mixture will be more like a porridge)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from  heat and stir in  lemon juice. Spoon into bowls and top with a drizzle of olive oil and a tablespoon of crumbled feta. Garnish with plain yogurt if desired and chopped fresh herbs such as mint, parsley or dill."}]}