{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Milk", "description": "This intensely creamy Italian rice dish, called riso al latte, falls somewhere between rice pudding and risotto. The rice is cooked in vanilla- and lemon-infused milk, but barely sweetened, making it more appropriate for brunch than dessert. Crunchy bread crumbs and flaky sea salt add texture, while the optional drizzle of sweetened cappuccino (or regular milky coffee) lends bittersweet complexity. If you like, you can serve this with a juicy salad made from halved cherry tomatoes mixed with berries and pomegranate seeds, and seasoned with a few drops of balsamic vinegar. Or increase the sugar and serve it for dessert.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/10/22/dining/20141022-ITALIAN-slide-WMO5/20141022-ITALIAN-slide-WMO5-articleLarge.jpg", "totalTime": "PT1H40M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "brunch, lunch", "keywords": "main course, side dish, milk, risotto", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 53}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 432, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "13 grams", "saturatedFatContent": "7 grams", "sodiumContent": "214 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 cups whole milk", "1 vanilla bean, sliced lengthwise", "1 lemon", "3 slices crusty white bread, preferably stale", "1 1/2 cups (300 grams) vialone nano or arborio rice", "1 tablespoon extra-virgin olive oil", "1 tablespoon granulated sugar, more to taste", "1/4 cup mascarpone", "Hot cappuccino or milky coffee, sweetened to taste, for serving (optional)", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, combine milk and vanilla bean. Using a vegetable peeler, remove half the lemon peel in strips; add to pot. (Reserve the half-peeled lemon.) Heat liquid over medium heat until steaming but not yet simmering. Remove from heat, cover pot and let stand 1 hour. Uncover pot and rewarm liquid over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While milk steeps, heat oven to 350 degrees. Place bread on a baking sheet and toast in the oven until dry and golden, 10 to 25 minutes depending on how dry it was to start with and how thick the slices are. Use a rolling pin to break the bread into large, irregular crumbs, with some the size of peas and the rest finer (you want texture)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large dry skillet over medium-high heat, toast rice until fragrant, 3 to 4 minutes. Stir in oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in several ladles of warm milk (leave behind the vanilla beans and zest). Cook, stirring frequently, until rice has soaked up most of the liquid. Continue cooking, adding a few ladles at a time, until rice is al dente, 18 to 22 minutes. If rice mixture is too thick, or if you have used up all the milk before the rice softens, stir in hot water until the texture is pleasing to you. Stir in sugar and mascarpone. Finely zest the rest of the lemon, grating directly into the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon into bowls and top with bread crumbs. Drizzle a little coffee over the top if you like, sprinkle with salt and serve."}]}