{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic Soup with Potatoes and Broccoli", "description": "Garlic soup is a dish that you can turn to when you think the cupboards are bare. It makes a soothing, satisfying meal. The classic Provençal version of this soup is made with little more than water, whole crushed garlic cloves, salt, and olive oil; this version is more substantial and has a bit more flavor because I mince the garlic.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/12/02/health/nutrition/02recipe.health.span.ready/02recipe.health.span.ready-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 65}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 156, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1380 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["7 cups water, chicken stock, or vegetable stock", "4 plump garlic cloves, minced or put through a press", "A bouquet garni made with a bay leaf and a few sprigs each parsley and thyme, tied together", "Salt and freshly ground pepper to taste", "3/4 pound Yukon gold or white rose potatoes, peeled if desired and cut in 1/2-inch dice", "1/2 pound broccoli florets, broken up into small flowers", "2 eggs, beaten", "2 tablespoons chopped flat-leaf parsley", "2 to 3 tablespoons freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water or stock to a simmer in a large saucepan or soup pot. Add the minced garlic, the bouquet garni, salt and pepper, and the potatoes, cover and simmer for 15 minutes, until the potatoes are tender and the broth fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the broccoli and simmer uncovered for another 5 to 8 minutes, until the broccoli is tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the soup and adjust seasonings, making sure that you have added enough salt (the flavors should be vivid). Beat the eggs in a bowl. Remove a ladleful of the soup and whisk it into the eggs to temper them. Turn the heat off under the soup, and stir in the egg mixture. The eggs should cloud the soup but they shouldn’t scramble. Stir in the parsley and serve, topping each bowl with grated Parmesan."}]}