{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach Almond Smoothie", "description": "Peaches and almonds are closely related and make a great match in this not-too-sweet smoothie.\n\nPeaches and almonds are closely related botanically, one reason why they have always made a good match in desserts and baked goods. I combined ripe summer peaches with almond milk and soaked almonds here, and also added some almond extract for additional flavor. The smoothie is further enriched with oatmeal, and only slightly sweet. You can add more agave syrup, or honey if you eat honey, if you wish. If delicious fresh peaches are no longer available, use frozen peaches.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/10/01/science/03recipehealthpeach/03recipehealthpeach-articleLarge.jpg", "recipeYield": "1 generous serving", "recipeCuisine": "american", "recipeCategory": "breakfast, snack", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, vegan, vegetarian, fall, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 81}, "recipeIngredient": ["2 tablespoons rolled oats", "2 to 3 tablespoons hot or boiling water (enough to just cover the oats)", "1 1/2 large ripe peaches, pitted and sliced, or 8 ounces frozen peaches", "1 cup unsweetened almond milk", "10 untoasted almonds, soaked overnight in water to cover, skinned if desired", "1/4 to 1/2 teaspoon almond extract (to taste)", "1/4 to 1/2 teaspoon vanilla extract (to taste)", "1 1/2 to 2 teaspoons agave nectar (to taste)", "3 or 4 ice cubes if using fresh peaches"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the rolled oats and hot or boiling water in a small bowl or ramekin and leave until the oatmeal is soft, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all of the ingredients (including the soaked oatmeal) in a blender and blend at high speed for 1 minute. Serve at once."}]}