{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Linzer Torte", "description": "This version of Linzer torte, a classic Viennese pastry, has a dough with a high proportion of ground hazelnuts and almonds. It is usually filled with a raspberry or apricot jam, but cranberries make it a perfect Thanksgiving dessert. The secret to rolling a dough made with nuts is to keep chilling it if it becomes difficult to handle. Linzer torte keeps up to a week if well-wrapped, and also freezes well, before or after baking.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/11/12/dining/12KITCHEN1/12KITCHEN1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "almonds, cranberry, hazelnuts, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 140}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 559, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "10 grams", "sodiumContent": "99 milligrams", "sugarContent": "56 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 ounces/340 grams cranberries", "2 cups/450 grams sugar", "Zest of 1 orange", "Juice of 1 orange, plus water to equal 3/4 cup/220 milliliters", "Pinch of salt", "3/4 cup/120 grams whole hazelnuts", "3/4 cup/120 grams whole almonds", "1 3/4 cups/270 grams unbleached all-purpose flour, plus more for dusting", "14 tablespoons/198 grams unsalted butter, plus more for greasing the pan", "3/4 cup/160 grams sugar", "Zest of 1 lemon", "Zest of 1 orange", "1 large egg, plus 1 egg yolk", "1 teaspoon vanilla extract", "1/8 teaspoon ground cloves", "1 1/4 teaspoons ground cinnamon", "1/2 teaspoon baking powder", "1/4 teaspoon salt", "Powdered sugar, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the filling:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all ingredients in a saucepan over medium-high heat, stirring to dissolve sugar. Lower heat to a brisk simmer and stir frequently, until cranberries burst. Continue cooking, mashing fruit a bit with the back of a spoon, until thick as jam, about 30 minutes. Set aside. (Filling may be prepared in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Place hazelnuts and almonds on a baking sheet and bake about 10 minutes, until well browned. Rub skins off hazelnuts while still warm, discarding skins. Cool nuts, then grind finely in a food processor, adding 3 tablespoons of flour to keep them from becoming oily. (Nuts should have the texture of coarse cornmeal.) Set aside."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the dough:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer with whisk attachment, combine butter, sugar, and lemon and orange zest. Beat until sugar is dissolved and mixture is pale and fluffy, about 3 minutes. Beat in egg, egg yolk and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, mix together ground nuts, the rest of the flour, cloves, cinnamon, baking powder and salt. Add to butter mixture in three parts, mixing each time until it forms a slightly sticky dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into two pieces, one slightly bigger. Form larger piece into a ball, wrap and flatten to a 1-inch thickness. Form smaller piece into a rough rectangle, wrap and flatten to a 1-inch thickness about 4 by 5 inches. Chill 3 to 4 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350. Butter and flour an 11-inch fluted French tart pan. Remove dough from refrigerator and let stand for 10 minutes. On floured parchment paper, roll the larger piece of dough into a 12-inch circle, dusting the top with flour as necessary. If dough is difficult to handle, chill again. Pat evenly into pan until sides and bottom are completely lined with dough about 1/8-inch thick. Refrigerate or freeze tart shell until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out smaller piece of dough on floured parchment paper to rectangle about 10 by 12 inches and 1/8-inch thick. Cut into strips about 3/4 inch by 12 inches. Transfer parchment to a tray and refrigerate or freeze until firm."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make the torte:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread cranberry jam evenly into shell. Lay strips across top in a lattice pattern. Form remaining dough scraps into a rope 1/2 inch in diameter and use it to encircle outer edge of tart.  Score diagonally with the handle of a spoon or flute with fingers to make a border."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 to 35 minutes, until jam is bubbling and pastry is lightly browned. Let cool, and dust with powdered sugar if desired. Serve in small wedges."}]}]}