{"@context": "http://schema.org", "@type": "Recipe", "name": "Kimchi", "description": "You don’t need stoneware crocks or special jars to make kimchi. You do need a large bowl and multiple containers. When you become confident, you can add radishes and turnips, but this is the basic formula, from a book on preserving, “Tart and Sweet” by Kelly Geary and Jessie Knadler. The carrots are not strictly traditional, but I particularly like their crunch. Some people like their kimchi “new,” and some let it get really funky. Refrigerated and covered, it lasts indefinitely. I eat it many ways: finely chopped with steamed rice, fried eggs and Japanese sesame salt; stirred into chicken noodle soup; on steak, mixed with fresh watercress. In Korean food, it’s ketchup, mustard and relish, all in one.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/3019/03/22/dining/jm-kimchi/merlin_150934050_507fb4e7-4773-4be3-96eb-9eae98f7b9e6-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, lunch, condiments, dips and spreads, project, sauces and gravies", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 298}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 138, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "14 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "2191 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 Napa cabbages, weighing 3 to 4 pounds total", "1/3 cup salt", "2 tablespoons soy sauce", "1/4 cup fish sauce", "1 1/2 cups Korean chili powder, also called gochugaru", "2 bunches of scallions, thinly sliced", "1/4 cup garlic, minced", "1/4 cup ginger, minced", "4 cups thin carrot sticks (optional), about 3 inches long"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cabbages lengthwise into quarters, then across into thick ribbons. Put the cabbage in a big bowl and use your hands to toss it with the salt. Pour in cold water to cover the cabbage. It will float, so invert a plate on top, or a zipper-lock plastic bag of water, or whatever is handy, to keep it submerged. Cover the bowl with a towel and leave it out overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, use your hands to lift the cabbage out of the brine and put it in a big bowl. (Keep the brine, too.) In a small bowl, make a chili paste of  the soy sauce, fish sauce and Korean chili powder. (Check the ingredients list to make sure you get pure chili powder, not the kind that has salt mixed in.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chili paste to the cabbage along with the scallions, garlic, ginger and, if you like, the carrot sticks. Mix the kimchi well and pack it into hard plastic or glass containers. Pour in enough of the brine to cover the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the containers and leave out at room temperature (but not more than 75 degrees, or it ferments too fast). Taste it after three or four days, and every day after. As the vegetables shrink, the kimchi can be combined in ever-smaller containers; just keep it covered with brine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When it tastes good to you, it’s done."}]}