{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Winter Vegetable Medley", "description": "This is a sweet mixture of comforting winter vegetables that you can serve on its own as a side dish, or use as the component of a polenta, big bowl, frittata or omelet, or pasta. I roast the squash in one pan and the other vegetables together in another. If you have a small oven, roast the squash first, then the other vegetables. Or you can use two shelves and switch the trays top to bottom halfway through the roasting.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/04/science/03recipehealth/03recipehealth-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low calorie, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 186}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "6 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "545 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 medium butternut squash (about 1 1/2 pounds), peeled, seeds and membranes scraped away, and cut into 3/4 to 1-inch dice", "2 large carrots, peeled and cut into 3/4-inch pieces (quarter at the fat ends, cut in half at the thin ends, then cut in thick slices)", "1 large parsnip, quartered, cored, and cut in 3/4-inch pieces", "1 medium-size fennel bulb, quartered, cored and cut in 3/4 inch pieces", "1 medium or large red onion, cut in large dice", "3 tablespoons extra virgin olive oil", "Salt and freshly ground pepper to taste", "Optional:  Chopped fresh rosemary, thyme or sage, about 2 teaspoons"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line 2 baking sheets or roasting pans with parchment or foil. Place squash on one and remaining vegetables on the other, and toss each batch with 1 tablespoon olive oil and salt and pepper to taste. If desired, add fresh herbs such as rosemary, thyme or sage, and toss together. Spread vegetables in an even layer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven, on the same shelf if both pans will fit, or on the middle and lower shelves, and roast for 20 minutes, stirring halfway through. Switch pans top to bottom halfway through if on separate shelves Turn heat down to 400 degrees and continue to roast for another 10 to 20 minutes (the squash may be ready sooner than the root vegetables), stirring halfway through, until tender and caramelized."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven, combine squash and other vegetables and stir together."}]}