{"@context": "http://schema.org", "@type": "Recipe", "name": "Twice-baked Bread with Tomato Topping", "description": "This is based on a number of Greek dishes that are made with barley rusks, rock- hard twice-baked barley bread slices that are sold in bakeries and reconstituted for delicious salads and soups. You can make the rusks with any hearty country bread, just by drying out thick slices in a low oven. The authentic Greek version of this recipe has a lot more olive oil and garlic. You can be more liberal too, if you wish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2008/09/10/health/10recipehealth/10recipehealth-articleLarge.jpg", "totalTime": "PT10H15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "470 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 thick slices stale country bread", "1/2 cup finely chopped red onion", "1 pound firm, ripe tomatoes, grated (see below) or peeled, seeded and finely chopped", "1 tablespoon red wine vinegar or sherry vinegar", "3 tablespoons extra virgin olive oil", "1 tablespoon capers, rinsed", "1 garlic clove, cut in half, green shoot removed, minced or pureed in a mortar and pestle", "1/4 cup chopped kalamata olives", "1 tablespoon chopped dill", "Salt", "2 ounces feta, crumbled", "2 teaspoons dried oregano", ""], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Do this step the night before if your bread isn’t hard all the way through. Preheat the oven to its lowest setting. If your oven has a pilot light, you needn’t turn it on. Place the bread slices on a baking sheet and place in the oven for 8 to 10 hours, until the bread is hard all the way through. Allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the rusks with cold water until softened but not soggy. Tap off the water and set on a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chopped onions in a bowl and cover with cold water. Let sit for a few minutes, then drain and rinse. Drain on paper towels. Toss with the tomatoes, vinegar, 2 tablespoons of the olive oil, capers, garlic, onion, chopped olives, dill, and salt to taste. Spoon onto the rusks. Sprinkle on the feta and oregano, and drizzle on the remaining olive oil. Arrange on a platter or plates and serve."}]}