{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Cheese", "description": "Technically, this formula produces fromage blanc. But to me it is the cream cheese of dreams: delicious, without the stiffeners in packaged cheese. To ensure good results, use real rennet for cheesemaking: not the rennet sold at the health-food store, and not the tablets sold online for making junket desserts. (Who are you, junket makers?) If your cheese does not set, no worries: you have just made a large quantity of delicious crème fraîche.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/freshcheese/freshcheese-articleLarge.jpg", "totalTime": "PT20H15M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "condiments, project", "keywords": "appetizer", "aggregateRating": null, "recipeIngredient": ["1 gallon whole milk (as fresh as possible)", "1/4 cup cultured buttermilk", "1 tablespoon rennet solution", "1 1/2 teaspoons salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide pot set over low heat, warm the milk, or a combination of half cream and half milk, to 80 degrees. The milk or cream should be as fresh as possible, and preferably not ultra-pasteurized. Remove from the heat and stir in the buttermilk and the rennet solution (diluted according to the package directions). Cover loosely and set aside at warm room temperature (about 75 degrees) for 8 to 12 hours. The mixture is set when there is a layer of thick curds, like Greek yogurt, on top of clear whey. Pull the curd away from the edge of the pot to check."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a colander with a large square of cotton cloth, at least 2 feet per side. Don't use cheesecloth, as the weave is too loose. A large tea towel or bandanna (even an old pillowcase, cut open) is better. With a slotted spoon, transfer the curds into the lined colander. Gather up three corners of the cloth and use the fourth corner to wrap around the others, tucking in the end to make a knot. Hang over a floor drain, bathtub or sink in a cool place and let it drip for 6 to 8 hours. When the dripping stops, untie and check the consistency. It should be like soft cream cheese. If it is still wet, mix it with a rubber spatula, retie it, and let it drip a little longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cheese is ready, scrape it into a bowl and mix the salt. Taste and add more salt if you like. Chill until firm. The cheese may be shaped into logs and rolled in fresh herbs or coarsely ground pepper (I like a combination of pink, black and red). Or it may be mixed with minced chives and a little grated garlic. The cheese will keep, wrapped or in a container, for 2 weeks, and will become more tangy. Or it can be shaped into 4-ounce logs, wrapped well, and frozen for up to 6 months. Thaw in the refrigerator overnight."}]}