{"@context": "http://schema.org", "@type": "Recipe", "name": "Bobby Flay’s Pan-Roasted Chicken With Mint Sauce", "description": "Bobby Flay served a version of this chicken at Bolo, the elegant little jewel box of a restaurant he had on 22nd Street until 2007, when the building that housed it was sold. It came pan-roasted beneath a blanket of what Flay called Spanish spices, with a vibrant green mint sauce rich with chiles, honey, salt and mustard. The dish was one of the restaurant’s best sellers. I ate it about 3,000 times there before getting the recipe and adapting it for those of us who cook at home. Of course you can make the exact same dish with chicken thighs if you want. But some will prefer the breast meat. Some always have.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/06/29/magazine/29eat/29eat-articleLarge-v5.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 559}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 687, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "4 grams", "proteinContent": "39 grams", "saturatedFatContent": "10 grams", "sodiumContent": "609 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 bone-in, skin-on chicken breasts", "Kosher salt to taste", "2 tablespoons Spanish paprika", "2 teaspoons ground cumin", "2 teaspoons ground mustard", "2 teaspoons ground fennel seed", "1 teaspoon freshly ground black pepper", "3 tablespoons extra-virgin olive oil", "1 cup fresh mint leaves", "½ cup fresh parsley leaves", "4 cloves garlic, peeled and roughlychopped", "1 serrano chile, seeds removed androughly chopped", "1 tablespoon honey", "1 tablespoon Dijon mustard", "½ cup extra-virgin olive oil", "Kosher salt and freshly groundblack pepper."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425. Rinse the chicken well, then dry it with paper towel. Season the chicken aggressively with salt. Combine the remaining dry ingredients in a small bowl, and rub the mixture all over the skin of the\nchicken breasts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, oven-safe sauté pan or skillet set over medium heat. When it is shimmering, put the breasts into the pan skin side down, and cook, unattended, until the skin is golden brown, approximately 6 to 8 minutes. Using tongs, turn the chicken breasts over, and place the pan in the oven. Roast until the chicken is golden brown all over and the meat cooked entirely through, approximately 12 to 15 minutes. Remove the chicken to a warmed\nplatter, and allow to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the mint, parsley, garlic and serrano into a food processor, and pulse into a paste. Add the honey and mustard, and pulse again, until combined. With the motor running, slowly add the olive oil until the mixture has become emulsified. Transfer the mixture to a bowl, and if necessary, whisk in a few tablespoons of water to thin the sauce. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon some of the sauce over each chicken breast, and serve, with the remaining sauce on the side. Roasted potatoes with some thinly sliced lemons makes a fine accompaniment, along with sautéed greens."}]}