{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken “Piccata” With Chard or Beet Greens", "description": "These pungent, lemony chicken breasts that are among the top 10 dinners in my house. I pound chicken breasts thin, – to about 1/4 inch. This way, you can get a good two servings, if not more, out of each boneless, skinless breast. They take minutes to cook, and you can pound the chicken breasts ahead of time and keep them between sheets of plastic in the refrigerator until you’re ready to make dinner.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/22/science/24recipehealth/24recipehealth-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, quick", "keywords": "fall, spring, summer, winter, healthy, low sugar, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 410}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 299, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "3 grams", "sodiumContent": "505 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bunch chard or beet greens, stemmed and washed well in 2 changes of water", "Salt to taste", "2 boneless skinless chicken breasts (most weigh 8 to 10 ounces)", "Juice of 1 large lemon", "Freshly ground pepper", "2 to 3 tablespoons all-purpose flour or a gluten- free flour such as rice flour or corn flour", "2 tablespoons grapeseed, sunflower or canola oil", "1/4 cup dry white wine", "1 tablespoon unsalted butter, softened", "1 tablespoon capers, rinsed and coarsely chopped", "1 tablespoon chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut each chicken breast into 2 equal pieces (if they are – 12 ounces or more, cut them into 3 pieces). Place two sheets of plastic wrap (1 large sheet if you have extra-wide wrap) on your work surface, overlapping slightly, to make 1 wide sheet, and brush lightly with olive oil. Place a piece of chicken in the middle of plastic sheet and brush lightly with oil. Cover the chicken with another wide layer of plastic wrap. Working from the center to the outside, pound chicken breast with the flat side of a meat tenderizer until about 1/4 inch thick. Don’t pound too hard or you’ll tear the meat. If that happens it won’t be the end of the world, you’ll just have a few pieces to cook.) Repeat with the remaining chicken breast pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, add salt to taste and blanch greens for 1 to 2 minutes. Using a skimmer or a slotted spoon, transfer greens to a bowl of cold water, then drain and squeeze out excess water. Alternatively, steam greens for 2 to 3 minutes, until wilted. Chop medium-fine and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season pounded chicken breasts with salt and pepper on one side only. Dredge lightly in the flour and tap the breasts to remove excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn oven on low and get out a platter or a sheet pan. Heat a wide, heavy skillet over high heat and add oil. When oil is hot, place one or two pieces of chicken in the pan – however many will fit without crowding. Cook for 1 1/2 minutes, until bottom is browned in spots. Turn over and brown on other side, about 1 1/2 minutes. (Do not overcook or chicken will be dry.) Transfer to platter or sheet pan and keep warm in the oven. Repeat with rest of chicken, if any."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If there is more than a tablespoon of fat in the pan, pour some of it off into a jar or bowl. To deglaze the pan, add wine and lemon juice to pan and scrape. Whisk in softened butter and capers, and stir until sauce is velvety. Pour over chicken. Sprinkle on parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer greens to pan and heat through, stirring. Season to taste with salt and pepper. Arrange on plates with the chicken on top or on the side."}]}