{"@context": "http://schema.org", "@type": "Recipe", "name": "Panzanella of Plenty", "description": "Panzanella is a Tuscan summer bread salad, often made to use up stale bread. The typical panzanella consists of chunks of stale bread and tomatoes, cucumbers, onion and basil, dressed with olive oil and vinegar.\n\nSo why are we talking about a summer salad for Thanksgiving? Reader Jessica Benoit offers this fall version of panzanella, inspired by her first Thanksgiving abroad and thoughts of the traditional stuffing her family ate during holidays in New England with extended family.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2014/11/05/science/05VEGTHANKSGIVING5/05VEGTHANKSGIVING5-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 8-10", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 102}, "recipeIngredient": ["1 large loaf whole grain bakery bread, cubed into bite-sized pieces", "1 cup extra virgin olive oil, divided in half", "2 cups Brussels sprouts, stems removed and halved lengthwise", "1 large butternut squash, peeled and cubed into bite-sized pieces", "1 large red beet, peeled and cubed into bite-sized pieces", "2-3 tablespoons fresh thyme, chopped", "2/3 cup dried cranberries", "20 roasted chestnuts, peeled and chopped", "1 1/2 cups spinach or dino kale, julienned", "1 1/2 teaspoon sea salt", "Black pepper to taste", "3/4 cup extra virgin olive oil", "1/3 cup balsamic vinegar", "1/4 cup lemon juice", "1/2 cup natural apple cider", "1/3 cup honey (maple syrup for vegan)", "3 cloves roasted garlic, minced", "1 tablespoon sea salt, or to taste", "crispy shallots (vegan)", "creamy chèvre or ricotta salata, crumbled (vegetarian", "crispy pancetta or lardons (omnivorous)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all dressing ingredients, whisking well, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss brussels sprout halves, butternut squash cubes, and beet cubes with 1/2 cup extra virgin olive oil, sea salt and black pepper. Spread veggies in a single layer on a baking sheet or two. Sprinkle with chopped thyme and bake for 25 minutes, stirring once. Remove and place into a large salad bowl for later mixing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss cubed bread with remaining 1/2 cup olive oil. Spread out on a sheet pan and toast for no longer than 10 minutes. They should be crispy on the outside, but still slightly soft inside. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the salad bowl with the roasted vegetables, add the cranberries, chestnuts and leafy greens. Add the croutons and mix all ingredients evenly. Pour the dressing over the salad, tossing again, and let it all marinate for about 10 minutes. Add any optional toppings and serve at room temperature."}]}