{"@context": "http://schema.org", "@type": "Recipe", "name": "Catalan Fideuà", "description": "In Catalunya, the northeastern part of Spain, there is a traditional dish called fideuà, made with short lengths of dry pasta called fideus. Instead of boiling the noodles Italian-style, the Catalan way is to cook them with only a small amount of liquid in a wide earthenware cazuela or paella pan. Here, the noodles are first browned in olive oil, then simmered in a rich fish and shellfish broth. It’s a sort of cross between risotto and paella, and it’s a dish for all lovers of Mediterranean fish soups in the bouillabaisse family. Broth is added at intervals as it is absorbed, but not much stirring is involved. A dab of garlicky allioli, the Spanish version of aïoli, is added to each soup plate before serving.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/26/dining/26KITCH1/26KITCH1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner", "keywords": "clams, fideus, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 371, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "41 grams", "saturatedFatContent": "2 grams", "sodiumContent": "921 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Extra-virgin olive oil", "2 onions, chopped (about 2 cups)", "1/2 pound small shrimp, shell on", "4 large garlic cloves, roughly chopped", "3 small dried hot red peppers, or use 1 pinch cayenne ", "1/2 teaspoon fennel seed", "1/2 teaspoon coriander seed", "1 large bay leaf", "A few thyme sprigs", "Salt and pepper", "2 tablespoons tomato paste", "1 1/2 pounds meaty bones from cod, snapper or halibut, rinsed (or use boneless fish chunks)", "12 clams", "1 pound mussels, cleaned", "1 pound fideus noodles (dry), or use Italian fedelini or spaghettini ", "Extra-virgin olive oil", "Pinch of saffron crumbled into 1/4 cup water", "1 pound mussels, cleaned, for garnish", "1/2 pound large shrimp, shell on, for garnish (optional)", "3 tablespoons chopped parsley", "1 teaspoon orange zest", "Allioli, for garnish (see recipe)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the broth: Put 3 tablespoons olive oil in a heavy soup pot over medium-high heat. Add onions and sauté until softened and lightly browned, about 10 minutes. Add small shrimp, garlic, hot pepper, fennel, coriander, bay leaf and thyme. Season generously with salt and pepper, stir to coat and cook 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in tomato paste and cook 5 minutes, until mixture begins to look dry. Add fish bones, clams, 1 pound mussels and 8 cups water; cover and bring to a boil. Uncover, reduce heat to a simmer and cook for 45 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain through a sturdy mesh sieve into another pot, pushing on solids with a wooden spoon. Discard solids and keep strained broth hot. Taste for salt. Broth should be well seasoned. (Can be made ahead, though eat it within 24 hours, or you can freeze it.) "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the fideuà: Heat oven to 375 degrees. Put fideus noodles in a large roasting pan or baking sheet. (If using Italian pasta, break it into 2-inch lengths first.) Pour 2 tablespoons olive oil over noodles and toss with hands to coat. Bake for 8 to 10 minutes, turning with tongs if necessary, until noodles are golden brown. (May be done in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a cazuela or wide heavy pot on the stove. Add toasted noodles, pressing down a bit. Ladle 3 cups hot broth over noodles and bring to a boil. Push down on the noodles with a wooden spoon as they soften into the broth. Add saffron-infused water and cook for a minute, then stir to mix. Add enough hot broth to cover pasta by 1 inch. Lower heat and cook at a simmer for about 8 minutes, stirring occasionally. Add more broth (and adjust heat) if mixture dries out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter remaining 1 pound mussels over the top, then push them down until barely submerged. Cook 3 to 4 minutes, until shells open. Turn off heat. The noodles should be cooked but firm, and the mixture a little soupy. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using the large shell-on shrimp, season them and sauté in 1 tablespoon olive oil over medium heat for 2 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle into individual soup plates. Mix the parsley with the orange zest. Garnish fideus with shrimp, if using, the parsley mixture and a spoonful of allioli."}]}