{"@context": "http://schema.org", "@type": "Recipe", "name": "Greens and Chayote Enchiladas With Salsa Verde", "description": "Lightness is not an attribute usually associated with enchiladas, the most comforting of Mexican tortilla foods. But these enchiladas, filled with a mix of blanched seasoned chard and succulent diced chayote and covered with a classic cooked tomatillo salsa, are both light and incredibly satisfying.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/04/29/dining/29MARTHA/29MARTHA-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, burritos and nachos", "keywords": "chayote squash, queso fresco, serrano chili, swiss chard, tomatillo, gluten-free, halal, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 211}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 341, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "762 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound Swiss or rainbow chard, or a combination", "2 medium-size chayote or summer squash (about 1 1/4 pounds), cut in small dice (4 cups diced)", "1 pound fresh tomatillos, husked and rinsed", "2 jalapeño or 2 to 3 serrano chiles, stemmed", "1/2 white onion, coarsely chopped", "Salt to taste", "4 large peeled garlic cloves; 2 whole and 2 minced", "12 cilantro sprigs, plus chopped cilantro for garnish", "1 tablespoon canola or grapeseed oil, plus 1/3 cup for frying", "2 1/2 cups chicken or vegetable stock", "2 tablespoons extra-virgin olive oil", "1 teaspoon Mexican oregano", "Black pepper", "18 corn tortillas", "About 1/2 cup crumbled queso fresco or feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Strip chard leaves from stems and wash in 2 changes of water. Rinse stems and cut in small dice if wide, or, if thin, slice crosswise 1/4 inch thick. Set aside stems with chayote in one bowl and leaves in another."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa verde: Combine tomatillos, jalapeños and onion in a medium saucepan; cover with water and bring to a boil. Reduce heat and simmer 10 minutes, until tomatillos have gone from pale green to olive and have softened. Using a slotted spoon, transfer tomatillos, onion and one of the jalapeños to a blender. Do not drain water from pot. Let vegetables cool in blender while you blanch greens and chayote."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add more water to the pot so it is about 2/3 full. Return to a boil, salt generously, and add leaves. Blanch until tender, 1 to 2 minutes. Transfer leaves to a bowl of cold water to quickly shock, then drain and dry. Chop coarsely and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return water to a simmer and add chayote and chard stems. Simmer 5 minutes, or until just tender. Drain through a colander and again on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add whole garlic cloves and cilantro sprigs to ingredients in blender and blend until smooth. Taste for heat and add remaining jalapeño if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon canola oil in a large, heavy saucepan over medium-high heat. When hot, add tomatillo purée and partly cover to protect from splattering. Cook, stirring often, until it thickens and begins to stick to the pan, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in stock, add salt to taste, and bring to a simmer. Cook uncovered for 20 minutes, stirring often, until sauce is thick and coats the front and back of a spoon. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in medium skillet over medium heat and add minced garlic. When fragrant, after about 30 seconds, stir in oregano, blanched leaves, stems and chayote. Cook, stirring for about 3 minutes, until tender, fragrant and coated with oil. Season with salt and pepper. Stir in 1 cup salsa verde and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tortillas: Heat 1/3 cup canola oil in a medium skillet over medium heat, until oil bubbles around the edges of a tortilla when you dip it into the pan. Place a platter covered with paper towels next to pan. Using tongs, slide tortillas, one at a time, into hot oil. As soon as tortilla begins to puff, about 10 to 15 seconds, flip over and leave another 10 to 15 seconds. Immediately remove from pan and drain on paper towels. Cover with foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One by one, quickly dip tortillas into the remaining warm salsa verde, lay on serving platter, and top with about 1/4 cup filling. Roll up tortilla and place seam side down on platter. When all tortillas have been filled, pour remaining salsa verde on top, sprinkle with cilantro and queso fresco and serve."}]}