{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Green Beans, Scallions and Brussels Sprouts With Buttermilk-Cornmeal Coating", "description": "This buttermilk batter fries up to a fluffy/crispy coating. When I was deciding what vegetables I wanted to coat and fry with this batter I knew that I would use scallions and green beans. (I used green beans with almost all of my recipe tests this week)  Then I found a half-pound of brussels sprouts that had seen better days in my crisper. I trimmed off the yellowing outer leaves, quartered them, gave them a dunk in the batter and eased them into the hot oil. Now I will never throw out old brussels sprouts again. Okra would also be a good choice for this recipe. You can serve these plain or with any number of dips, either spicy (think Sriracha or chipotle aioli) or Japanese.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/03/10/science/10recipehealthbeans/10recipehealthbeans-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "dinner, lunch, snack, vegetables", "keywords": "appetizer, side dish, fall, spring, summer, winter, gluten-free, halal, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 207, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "41 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup cornstarch", "2 tablespoons fine polenta or cornmeal", "1/2 teaspoon salt, plus additional for sprinkling", "1/2 teaspoon baking powder", "1 cup less 2 tablespoons buttermilk or yogurt thinned with milk", "3 tablespoons cold sparkling water", "1/2 pound green beans", "1/2 pound brussels sprouts", "2 bunches scallions", "Canola or grapeseed oil for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine cornstarch, polenta or cornmeal, salt and baking powder in a bowl and whisk together. Add buttermilk and sparkling water and whisk together until mixture is blended and has the consistency of thick cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top and tail beans. Trim brussels sprouts and quarter. Trim root end off the scallions and cut away dark green ends."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour oil into a wok or wide saucepan to a depth of 3 inches and heat over medium-high heat to 360 to 375 degrees. Set up a sheet pan with a rack on it next to the pan. Cover rack with a few layers of paper towels. Have a spider or deep fry skimmer handy for removing vegetables from the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, dip vegetables into batter a few at a time, making sure to coat thoroughly. Transfer to hot oil and fry until golden brown, which should not take more than a couple of minutes. Flip over halfway through with the spider to make sure the coating is evenly fried. It is important not to crowd pan and to let oil come back up to temperature between batches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the spider, remove vegetables from oil, allowing excess oil to drip back into pan, and drain on towel-covered rack. Sprinkle with salt right away if desired. Allow to cool slightly and serve."}]}