{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Cooker Cassoulet", "description": "Many look down their noses at the slow cooker, but it's perfect for some dishes. Stews, for one. This sausage, duck and white bean stew is rich and hearty, and you can leave the dish wholly unattended for five to seven hours as it cooks. Brown the meat before you put it in the pot or not.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/10/15/dining/15COOKING-CASSOULET/15COOKING-CASSOULET-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "At least 4 servings", "recipeCuisine": "french", "recipeCategory": "dinner, soups and stews", "keywords": "carrot, garlic, italian sausage, thyme, white beans, dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 873}, "recipeIngredient": ["1/2 pound dried small white beans, like pea or navy", "4 cloves garlic, peeled and crushed, plus 1 tablespoon minced garlic", "1 medium-large onion, chopped", "2 carrots, peeled and cut into chunks", "2 cups cored and chopped tomatoes, with their juice (canned are fine)", "3 or 4 sprigs fresh thyme or 1/2 teaspoon dried thyme", "2 bay leaves", "1/4 pound slab bacon or salt pork, in 1 piece", "4 sweet Italian sausages, about 3/4 pound", "1 pound boneless pork shoulder", "2 duck legs", "Chicken, beef or vegetable stock, or water, or a mixture, as needed", "Salt and freshly ground black pepper to taste", "1 cup plain bread crumbs, optional", "Chopped fresh parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine beans, crushed garlic, onion, carrots, tomatoes, thyme, bay leaves and meats in a slow cooker, and turn heat to high. (If you like, brown sausage and duck legs in a skillet before adding.) Add stock or water to cover by 2 inches. Cover and cook until beans and meats are tender, 5 to 6 hours on high heat, 7 hours or more on low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When done, add salt and pepper to taste, along with minced garlic. If you like, remove cassoulet from slow cooker, and place in a deep casserole; cover with bread crumbs and roast at 400 degrees until bread crumbs brown, about 15 minutes. Garnish and serve."}]}