{"@context": "http://schema.org", "@type": "Recipe", "name": "Grits Rancheras", "description": "Anson Mills pencil cob grits make a great stand-in here for the corn tortillas that traditionally constitute the base for huevos rancheras. The salsa and the egg yolk ooze into the creamy grits, an unforgettable match made in heaven. Since you are working with the highest quality grits here it would be a shame to pair them with ordinary battery eggs; go out and get the best farm-raised eggs you can afford and just see what a difference that ultra-yellow yolk makes. You can make the salsa while the grits are cooking or you can make it before you begin cooking them and keep it warm. You can also use a commercial salsa ranchera, as long as it is a good one. Note that the grits need an overnight soak before cooking.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/24/science/recipehealthranchero/recipehealthranchero-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "american, mexican", "recipeCategory": "breakfast, brunch, dinner, vegetables", "keywords": "fall, spring, summer, winter, gluten-free, halal, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 90}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "9 grams", "saturatedFatContent": "6 grams", "sodiumContent": "374 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup Anson Mills Colonial Coarse Pencil Cob Grits", "Filtered or spring water", "1 large can (28-ounce) chopped tomatoes with juice, or in season, 1 1/2 pounds fresh ripe tomatoes", "2 to 3 serrano or jalapeño chiles, seeded for a milder sauce, and chopped", "2 garlic cloves, peeled, halved, green shoots removed", "1/2 small onion, chopped", "1 to 2 tablespoons grapeseed oil", "Salt to taste", "2 tablespoons butter", "4 eggs", "Chopped cilantro for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place grits in a heavy, medium saucepan. Add 2 cups spring or filtered water and stir once. Allow grits to settle a full minute, then tilt pan and, using a fine tea strainer or fine skimmer, skim off and discard chaff and hulls. Cover and allow grits to soak overnight at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using fresh tomatoes, preheat broiler and line a baking sheet with foil. Place tomatoes on foil and roast under broiler for 4 to 5 minutes, until blackened and soft. Turn over and roast on other side until blackened and soft, 3 to 4 more minutes. Remove from heat and when you can handle them, core and skin. Place tomatoes (fresh or canned), chiles, garlic, and onion in a blender and purée, retaining a bit of texture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon grapeseed oil over high heat in a large, heavy skillet or saucepan until a drop of purée sizzles when it hits the pan. Add tomato purée and cook, stirring, for about10 minutes, until sauce thickens, darkens, and leaves a canal when you run a spoon down the middle of the pan. Season to taste with salt and remove from heat. Keep warm while you cook grits and fry eggs (you can also make the salsa while the grits are cooking, but I like to focus my attention on the grits)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 cups water in a small saucepan to a bare simmer and keep hot. Set saucepan with grits over medium heat. Bring to a simmer, stirring constantly with a wooden spoon, until the first starch takes hold (the mixture will begin to thicken and you will no longer have to stir constantly). Reduce heat to lowest possible setting. The grits should not be bubbling, they should be sighing, or breathing like somebody in a deep, comfortable sleep, rising up lazily in one big bubble, then falling as the bubble bursts. Watch carefully and each time they are thick enough to hold a spoon upright, stir in about 1/4 cup of the hot water. Stir in the salt after the first 10 minutes of gentle cooking. It should take about 25 minutes for the grits to be tender and creamy and by this time you should have added 3/4 to 1 cup water (perhaps a little more) in 3 or 4 additions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before grits are done, fry eggs over medium-high heat, preferably in a nonstick skillet that is lightly coated with oil (use as much of the remaining tablespoon of grapeseed oil as you need to). The yolks should still be runny and the whites set; this takes about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When grits are done – tender, creamy but not mushy, and able to hold their shape on a spoon – stir in butter vigorously, add pepper, taste (carefully – don’t burn your tongue after all that care) and adjust salt. If they have stiffened up stir in some more hot water. Spoon onto plates and make a depression in the center with the back of a spoon. Spoon salsa ranchera into the depression and top with an egg. Season egg with salt and pepper if desired, garnish with cilantro, and serve. You may have some ranchera sauce left over but if you only use a small can of tomatoes you might not have enough."}]}