{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Mapo Tofu", "description": "Mapo tofu is a justly popular menu item in many Chinese restaurants. It is a quickly cooked dish of braised tofu with minced pork (sometimes beef) in a bracing spicy sauce made with fermented black beans and fermented broad bean paste, along with hot red pepper and Sichuan pepper. This meatless version with fresh shiitake mushrooms is completely satisfying, and surprisingly easy to make. For the best texture, use soft tofu rather than firm, taking care to cook it gently to keep it from crumbling.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/02/24/dining/dt-vegetarian-mapo-tofu/dt-vegetarian-mapo-tofu-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, lunch, quick", "keywords": "fermented bean paste, fermented black beans, shiitake, sichuan pepper, soft tofu, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1421}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 166, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "638 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces shiitake mushrooms", "2 cups water", "15 ounce block of soft tofu (do not use silken)", "Salt", "3 tablespoons vegetable oil", "3 small dried hot red peppers", "1 tablespoon fermented black beans, rinsed", "1 tablespoon fermented spicy broad bean paste (doubanjiang)", "2 teaspoons minced garlic", "1 tablespoon grated ginger", "2 teaspoons soy sauce", "1 teaspoon toasted sesame oil", "1 teaspoon finely ground Sichuan pepper", "1 tablespoon corn- or potato starch, dissolved in 3 tablespoons cold water", "1/2 cup slivered scallions, both white and green parts", "Cilantro sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove stems from mushrooms. Make a light mushroom broth by simmering stems in 2 cups water for 15 minutes, then strain and reserve broth (discard stems). Dice mushroom caps and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tofu into 1-inch cubes. Cover with boiling salted water, let steep for 15 minutes, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a wok or wide skillet over medium heat. Add red peppers, black beans and bean paste and cook, stirring until fragrant, about 1 minute. Add garlic and ginger and let sizzle, then add mushrooms, soy sauce, sesame oil and Sichuan pepper. Add 1 1/2 cups mushroom broth and cook mixture gently for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully add tofu cubes. Shake pan to distribute sauce, using a wooden spoon to help. Try to avoid smashing tofu. Drizzle in cornstarch mixture, gently swirling pan to incorporate (sauce will thicken) and simmer tofu in sauce for 2 minutes more. Thin with a little mushroom broth if necessary. Transfer to a low bowl or platter. Sprinkle with scallions and cilantro sprigs."}]}