{"@context": "http://schema.org", "@type": "Recipe", "name": "Chard Stalk, Celeriac and Leek Soup", "description": "Hold onto your chard stalks! Recently I came upon a recipe in a Provençal cookbook for a gratin made with chard stalks and celeriac. I used the combination for a purée, which I served at Thanksgiving dinner to great acclaim. I took the same idea and made it into a blended soup, this time adding a potato and a bunch of leeks for added flavor and body. The soup is incredibly satisfying, but quite light.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/10/science/recipehealthchard/recipehealthchard-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "french", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 164, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1262 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "3/4 pound leeks (2 large), white and light green parts only, cleaned and chopped (about 2 cups)", "Salt to taste", "3/4 pound Swiss chard stems, diced (about 2 1/2 cups)", "3/4 pound celeriac, peeled and diced (about 2 cups", "1 large yellow or russet potato (10 to 12 ounces), peeled and diced (about 1 1/2 cups)", "5 to 6 cups water or stock (chicken or vegetable)", "Freshly ground pepper", "Chopped fresh parsley or celery leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over medium heat in a soup pot or Dutch oven and add leeks. Cook, stirring, until tender but not colored, about 5 minutes. Add a generous pinch of salt and add chard stems, celeriac, potato and water or stock. Stir together and bring to a boil. Add salt to taste (I use about 1 teaspoon per quart of water to start when making soup)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to low, cover and simmer 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, or in batches in a regular blender, purée the soup. If using a regular blender, cover top of jar with a towel pulled down tight, rather than airtight with the lid. Return to pot and heat through, stirring. Season with salt and pepper. If desired, thin out with a little more water or stock. Garnish each serving with chopped parsley or celery leaves."}]}