{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry Rose Rugelach", "description": "With its garnet-hued raspberry jam filling and fragrant rose sugar topping, this rugelach is a vivid departure from more traditional incarnations. It also uses two different kinds of salt, which provide forthright seasoning and a bare hint of crunch. You can make them up to 5 days ahead, if stored in an airtight container.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/12/02/dining/02COOKBOOKS-slide-WBA2/02COOKBOOKS-slide-WBA2-mediumThreeByTwo440.jpg", "totalTime": "PT4H", "recipeYield": "4 dozen rugelach", "recipeCuisine": "jewish", "recipeCategory": "cookies and bars, pastries", "keywords": "dessert, raspberry jam, rose water", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 169}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 131, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "80 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup plus 1 tablespoon/213 grams granulated sugar", "1 1/2 teaspoons/7 milliliters rose water", "2 cups/250 grams all-purpose flour, plus more for rolling", "1 teaspoon/5 grams kosher salt", "1 teaspoon/5 grams flaky sea salt", "8 ounces/225 grams unsalted butter (2 sticks), at room temperature", "8 ounces/226 grams cream cheese, at room temperature", "1 teaspoon/5 milliliters vanilla extract", "Nonstick spray", "1 1/2 cups/360 milliliters raspberry jam", "1 large egg white, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine 1/2 cup/100 grams sugar and the rose water. Rub together, then leave uncovered to dry, at least 2 hours. When dry, rub between fingers or use a mortar and pestle to break up any large chunks. (Rose sugar can be made up to 3 days ahead and stored airtight at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, whisk together flour, kosher salt and sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer, beat butter on medium speed for 5 to 10 seconds. Beat in cream cheese. Beat in remaining 1/2 cup plus 1 tablespoon/113 grams sugar until light and fluffy, about 3 minutes. Scrape down sides of bowl, then beat in vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With mixer on low speed, beat in flour mixture until dough comes together but still looks shaggy, about 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump dough and crumbs onto the counter and use your hands or a plastic bench scraper to bring dough together into a mass. Divide dough in half, wrap in plastic wrap and pat into rectangles. Chill at least 2 hours and up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly dust an 11-by-17-inch piece of parchment paper with flour. Place 1 dough rectangle onto the parchment, dust with flour, cover with another piece of parchment, and roll dough out into a rectangle, leaving a 1-inch border between edge of parchment and dough. If dough sticks, peel back parchment, dust with more flour, replace parchment. Repeat with second dough half, then chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line 3 baking sheets with parchment paper and lightly coat with nonstick spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one sheet at a time, move rolled-out dough to work surface. Peel one layer of parchment off to unstick it from the dough, replace it lightly on top of the dough, then flip and peel other side off. Spread 3/4 cup/180 milliliters jam in a thin, even layer on dough. Using a fluted dough cutter (or a sharp paring knife), trim edges and divide dough in half lengthwise into two long strips. Working with one strip at a time and moving crosswise, cut diagonal lines to form triangles with flat tips, with each base about 2 inches wide and each tip about 1/4 inch wide. There should be about 12 triangles per strip."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an offset spatula, separate a triangle away from rest of dough. Starting from the wide base, roll dough up and place tip-side down on prepared baking sheet. Repeat with remaining triangles, spacing them 1 inch apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush tops of rugelach with egg white and sprinkle with rose sugar. Bake, rotating pans halfway through, until golden, 22 to 28 minutes. Cool on sheet pans for 2 minutes, then transfer to wire rack to cool completely."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Rugelach", "description": "With its garnet-hued raspberry jam filling and fragrant rose sugar topping, this rugelach is a vivid departure from more traditional incarnations.", "thumbnailUrl": "https://static01.nyt.com/images/2015/12/02/dining/02COOKBOOKS-slide-WBA2/02COOKBOOKS-slide-WBA2-mediumThreeByTwo440.jpg", "uploadDate": "2016-11-17T16:31:57.000Z", "duration": "PT2M29S"}}