{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Wheat Pappardelle With Fava Purée", "description": "This is adapted from a recipe by the food writer Clifford A. Wright. If you forget to soak the dried favas, or if you don't have the time, simply cover them with boiling water and soak 1 hour, then drain and proceed.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/02/17/dining/17MARTHA/17MARTHA-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "arugula, fava beans, pappardelle, whole wheat pappardelle, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 508, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "72 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "6 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "384 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["3/4 cup/5 1/2 ounces dried yellow fava beans, soaked in water to cover for 4 to 6 hours and drained", "Salt", "1 to 2 garlic cloves, to taste, mashed in a mortar with 1/2 teaspoon salt", "4 to 6 tablespoons extra-virgin olive oil, to taste", "Ground black pepper", "3/4 pound whole wheat pappardelle", "3 ounces baby arugula (about 3 cups, tightly packed)", "2 tablespoons snipped chives", "2 to 3 tablespoons ground roasted blanched almonds, for serving", "Grated Parmesan, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the fava beans in a pot and add 1 quart water. Bring to a boil, reduce heat, cover and simmer 30 minutes. Add salt to taste (1 rounded teaspoon or more) and continue to simmer, covered, for 30 minutes or until favas are tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a strainer over a bowl and drain favas. Set aside 1 cup broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer beans to a food processor along with the mashed garlic. Run the processor until the beans are crushed, then add 4 tablespoons olive oil and run until incorporated and the mixture is smooth. Add some of the reserved cooking water to thin the purée so it has the consistency of runny hummus. (You will need to add more broth later because the purée will stiffen as it cools.) Taste, adjust salt and season with pepper. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer puréed favas to a metal bowl using a rubber spatula. Place remaining reserved broth in a small saucepan and heat. Place metal bowl over saucepan to keep fava purée warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a vigorous boil over high heat, salt generously and add pasta. Cook, stirring occasionally, until al dente (usually 6 to 8 minutes depending on the brand)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the warm broth to thin out the fava purée. Draw a small amount of pasta water from the pot and use it to warm a large serving bowl, then drain it from the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A few seconds before draining pappardelle, add arugula to pot, then drain arugula and pasta together. Immediately toss with the fava purée, chives and additional olive oil if desired. If purée seems too thick, add more of the broth and toss again. Serve at once, topping each serving with ground almonds. Pass Parmesan at the table."}]}