{"@context": "http://schema.org", "@type": "Recipe", "name": "Fritto Misto di Mare", "description": "Every culture does fried food, but Italian cooks do it especially well. The concept of fritto misto (mixed fried things) can apply to vegetables, fish or meat. Here, with a beautiful assortment of shellfish, the only requirement is that everything be spanking fresh. In Italy, fritto misto is nearly always served as a first course. It is especially nice in bite-size pieces, to precede a meal as a stand-up antipasto.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/01/14/dining/14KITCH1/14KITCH1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, finger foods, project", "keywords": "appetizer, seafood, white wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "recipeIngredient": ["1 cup all-purpose flour", "1/2 teaspoon salt", "1 cup white wine", "1/4 cup seltzer or club soda", "1 cup all-purpose flour", "1/2 teaspoon salt", "1/2 teaspoon black pepper", "4 cups vegetable oil, or a mixture of olive oil and vegetable oil", "1/2 pound medium shrimp, peeled", "1 pound cleaned squid, cut in 1/2-inch pieces", "1/2 pound bay scallops", "1 pound mussels, steamed and shucked", "1 pound white bait or smelt", "1 lemon, sliced very thin", "1 bunch scallions, trimmed to thin, 4-inch lengths", "Sea salt", "Pinch of crushed red pepper for garnish, optional", "Parsley sprigs or chopped parsley for garnish, optional", "Lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: Put flour and salt in a small bowl and gradually whisk in wine to obtain a smooth, lump-free mixture. Rest 30 minutes. Add seltzer just before frying."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Near the stove, put the seasoned dredging flour in a shallow bowl. Place finished batter next to it and an empty plate next to that. Put fish and other ingredients for frying nearby."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a large wok or a wide, deep pot and fasten a candy thermometer to the side. Heat oil to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in small batches, dip a few pieces of shrimp, squid, scallop, mussels, white bait, sliced lemon and scallion first into the seasoned flour to coat lightly, then into the batter. Put battered pieces on the empty plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slip a few pieces into the hot oil and fry 3 to 4 minutes, until golden. Remove with tongs or wire spider and drain on a paper-towel-lined baking sheet. Hold fried food in a warm oven while continuing to fry. Make sure to regulate heat below wok to keep oil at correct temperature (adding too many pieces to the oil will cause it to cool.) Rid oil of debris between batches with a fine meshed skimmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as you have enough to serve, pile it onto a warmed platter. Sprinkle with sea salt (and crushed red pepper if desired). Garnish with parsley and lemon wedges. Continue to fry in small batches."}]}