{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Chilaquiles With Eggs", "description": "This comforting Mexican dish is made with fried tortillas and salsa. Frying tortillas is easy, but you can use store-bought chips if you’d like; just be sure that they are thick, the type sold in bags at Mexican groceries or tortillerías.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/12/30/dining/1230MARTHA/1230MARTHA-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "mexican", "recipeCategory": "breakfast, brunch", "keywords": "cilantro, corn tortillas, eggs, jalapeño, queso fresco, tomatillo, gluten-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 278}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 233, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "690 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds fresh tomatillos, husked and rinsed", "2 to 4 jalapeño or serrano chiles, stemmed, to taste (seeded for a milder salsa)", "12 cilantro sprigs, plus 1/3 cup chopped cilantro", "2 tablespoons olive oil or grapeseed oil", "1 small white onion, quartered and thinly sliced (about 1 cup sliced onion)", "Salt", "2 large garlic cloves, minced", "2 cups chicken or vegetable broth", "6 large eggs", "12 thick corn tortillas, cut into wedges and deep-fried or microwaved until crisp (see note), or 1/2-pound thick tortilla chips from a Mexican grocery", "1/2 cup crumbled queso fresco or feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler. Place tomatillos and chiles on a baking sheet and set about 4 inches below broiler. Roast until dark and blackened in spots, about 5 minutes. Flip over and roast on other side until tomatillos are soft and charred in spots and chiles are soft all the way through, 4 to 5 minutes. Remove from heat and allow to cool for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer tomatillos and chiles to a blender along with juices on baking sheet. Add cilantro sprigs, then blend to a coarse purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large, wide casserole or saucepan and add onion. Cook, stirring often, until tender, 5 to 8 minutes. Add a little salt, stir in garlic and cook, stirring, until fragrant, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to medium-high and add tomatillo purée. Cook, stirring often, until salsa thickens and leaves a canal when you run a wooden spoon down the middle. Add broth, bring to a simmer, and simmer 10 minutes or until salsa coats the back of a spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs in a bowl and season with a little salt. Turn heat to low and stir eggs into salsa. Add chopped cilantro and stir until eggs are set. Mixture should be creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in tortilla chips, making sure they are completely submerged, and remove from heat. Sprinkle with crumbled cheese and serve at once."}]}