{"@context": "http://schema.org", "@type": "Recipe", "name": "Yorkshire Pudding", "description": "This recipe is from the British-born chef April Bloomfield, who says it dates back to an era when an English pub might cook a hunk of meat by dangling it from a hook above a roaring fire. The “pudding” emerged from a pan full of runny batter that would have been placed beneath the meat to soak up the juices. “The heat of the fire would make the Yorkshire pudding rise up, and all the fat would seep in,” she said. (Life back then was “nasty, brutish, and short,” as Thomas Hobbes once griped, but apparently there were upsides.) Of course, making Yorkshire pudding these days is a more domesticated undertaking. “Now what happens is you kind of recreate that,” said Ms. Bloomfield, who serves it as part of an order-ahead prime-rib feast at the Breslin Bar & Dining Room in the Ace Hotel in Manhattan. “It’s very soulful,” she said. “Give me 10 Yorkshire puddings and a thin sliver of beef, and I’ll be very happy.”", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2015/01/14/dining/14PRIMEREX/14PRIMEREX-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "12 puddings", "recipeCuisine": "british", "recipeCategory": "easy, snack, breads", "keywords": "beef fat, egg, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 732}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 65, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "90 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large eggs", "3/4 cup/165 grams whole milk", "3/4 cup/115 grams all-purpose flour", "3/4 teaspoon/5 grams kosher salt", "About 1/4 cup rendered beef or pork fat, olive oil or melted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. In a medium bowl, whisk together eggs, milk, flour and salt. Do not overmix. Allow the batter to rest 30 minutes at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a teaspoon of fat to each cup of a 12-cup muffin tin and transfer to the oven to heat, about 5 to 7 minutes. Once hot, divide batter equally to fill the cups about halfway, and return the muffin tin for 10 to 12 minutes, or until the puddings are golden brown and crisp. Serve immediately."}]}