{"@context": "http://schema.org", "@type": "Recipe", "name": "Lasagna With Roasted Brussels Sprouts and Carrots", "description": "A crowd-pleasing dish with endless varieties. If you are ever in doubt about what sort of casserole to make ahead for a crowd, make lasagna. There are so many versions that will please children and grown-ups, lacto-vegetarians and meat eaters. I like to tuck roasted vegetables into the layers of pasta, marinara sauce, Parmesan and ricotta. In this rendition I used brussels sprouts and carrots; the sprouts are slightly bitter and the carrots sweet. I sliced the brussels sprouts about the same width as the carrots and roasted the two together. Before you begin to assemble your lasagna it helps to be organized about the quantities of each element that you will need for the layers. It is very frustrating to get to the last layer of your casserole and not have enough sauce for the top.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/23/science/22recipeforhealth/22recipeforhealth-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "6 servings", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, pastas", "keywords": "fall, spring, summer, winter, halal, high fiber, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 275}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 438, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "7 grams", "proteinContent": "20 grams", "saturatedFatContent": "8 grams", "sodiumContent": "791 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound brussels sprouts, trimmed at base and sliced (not much thicker than 1/4 inch; I get about 3 slices out of a small brussels sprout, 4 out of a larger one)", "1/2 pound carrots, peeled and sliced on the diagonal", "Salt and freshly ground pepper", "3 tablespoons extra virgin olive oil, plus additional for oiling baking dish", "8 ounces ricotta cheese", "1 egg", "1 tablespoon water", "Very small pinch of cinnamon", "Salt and freshly ground pepper", "2 1/3 to 2 1/2 cups <a href=\"http://cooking.nytimes.com/recipes/1016147-simple-marinara-sauce\">marinara sauce</a> (more to taste)", "7 to 8 ounces no-boil lasagna (depends on the size and shape of your dish)", "4 ounces (1 cup) freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line a sheet pan with parchment. Place brussels sprouts and carrots on the parchment and season with salt and pepper. Toss with 2 tablespoons olive oil until evenly coated. Place in oven and roast 15 to 20 minutes, stirring every 5 to 10 minutes, until tender and lightly colored. Remove from oven and turn heat down to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a rectangular baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend ricotta cheese with egg, water, cinnamon, and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a small spoonful of tomato sauce in a thin layer over the bottom of the baking dish.  Top with a layer of lasagna noodles. Top the noodles with a thin layer of ricotta. Spoon on a few dollops then spread with an offset or a rubber spatula. Top ricotta with half the brussels sprouts and carrots, and top vegetables with a layer of tomato sauce and a layer of Parmesan. Repeat layers, then add a final layer of lasagna noodles topped with tomato sauce and Parmesan. Drizzle remaining tablespoon of oil over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover baking dish tightly with foil and place in the oven. Bake 40 minutes, until the noodles are tender and the mixture is bubbling. Remove from the heat and allow to sit for 5 to 10 minutes before serving."}]}