{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb With Herb Paste and Spinach", "description": "This spring lamb offering is coated with an oil-based paste. The oil serves to give the lamb’s crust a beautiful glossy appearance and helps infuse it with an herbal scent. You first make a pesto-like purée with a little oil, a lot of dill and parsley, a couple of cloves of garlic and a few anchovies. (The anchovies are optional but I believe invaluable.) Rub this herb paste all over the lamb and roast. When the lamb is done, and its flavorful fat has combined with the herbed oil that has run into the bottom of the pan, you use some of this fat to brown some bread crumbs, which become insanely delicious, and then to sauté a pile of fresh spinach. Voilà: a main dish, a side dish and a crunchy garnish, all in one. It’s a meal fit for a celebration, whether religious or secular. \n\nDon't know <a href=\"http://www.nytimes.com/video/magazine/100000000773719/carving-lamb.html\">how to carve a lamb</a>? Mark Bittman shows you how in <a href=\"http://www.nytimes.com/video/magazine/100000000773719/carving-lamb.html\">this video</a>.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2011/04/17/magazine/17Lamb1/17Lamb1-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "anchovies, leg of lamb, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 746, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "3 grams", "proteinContent": "55 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1022 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 5-to-7-pound leg of lamb, preferably at room temperature, shank removed if necessary", "1/2 cup chopped fresh parsley", "1/2 cup chopped fresh dill", "3 tablespoons extra virgin olive oil", "4 anchovies, optional", "2 cloves garlic, peeled", "Salt", "2 cups coarse bread crumbs, preferably fresh", "Freshly ground black pepper", "2 tablespoons pine nuts", "2 tablespoons raisins or currants", "1 pound spinach, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425º. Remove as much of the surface fat as is practical from the lamb. Combine the parsley, dill, oil, anchovies and garlic in a food processor (if you’re not using the anchovies, add some salt). Purée, adding a little water if necessary. Rub the lamb with this mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the lamb on a rack in a roasting pan with about 1/2 cup of water. Roast for 30 minutes, then check; if the lamb threatens to burn, turn the heat down to 350º; otherwise leave it at 425º. If the bottom dries out (the rendering lamb fat should keep it moist), add a little more water. After about 1 hour (total), check the internal temperature with an instant-read thermometer. When it reaches 130 for medium rare (125 for very rare) in its thickest part (check it in several places), it’s done. Total cooking time will be less than 1 1/2 hours. Remove and let it rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off and reserve all but 2 tablespoons of the fat and put the pan over a burner (or two, if it fits better). Toast the bread crumbs over low heat, stirring and seasoning with salt and pepper until they’re lightly browned. Remove; add another couple of tablespoons of the fat to the pan. Add the pine nuts, raisins and spinach and cook over high heat, stirring frequently, until the spinach is very tender and most of the liquid has evaporated. Carve the lamb and serve it on a bed of spinach, sprinkled with the bread crumbs."}]}