{"@context": "http://schema.org", "@type": "Recipe", "name": "Ina Garten’s Make-Ahead Coquilles St.-Jacques", "description": "Here is an easy version of coquilles St.-Jacques, the classic French preparation of scallops in a creamy sauce, under a crust of bread crumbs and cheese. It comes from Ina Garten, the celebrated cookbook author and television star, who has been cooking it for dinner parties, she told The Times, practically since the start of her marriage to Jeffrey Garten in 1968. It makes for a beautiful entree that matches well with a green salad, flinty white wine and good conversation. It can be made the day before serving and heated through in an oven while guests gather. “A lot of dishes taste better after they sit for a while,” Garten said. With its whisper of curry powder in the rich, unctuous sauce, this is one of them. You can make it in a casserole, but little gratin dishes are better and come in handy far more often than you might think. One per guest.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/01/04/magazine/04eat1-copy/04eat1-articleLarge-v5.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "cremini, gruyère, scallops, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1022}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 768, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "3 grams", "proteinContent": "35 grams", "saturatedFatContent": "25 grams", "sodiumContent": "1072 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 tablespoons unsalted butter, divided", "1/4 cup all-purpose flour", "1 1/2 cups seafood stock, clam juice or low-sodium chicken stock", "1 cup heavy cream", "1/4 teaspoon curry powder", "Kosher salt and freshly ground black pepper, to taste", "3 large shallots, peeled and diced, approximately 1 cup", "12 ounces cremini mushrooms, cleaned, stems discarded, sliced", "1/4 cup brandy or Cognac", "1 1/2 cups fresh bread crumbs (approximately 6 slices white bread, crusts removed, finely chopped or pulsed in a food processor)", "1/4 cup minced flat-leaf parsley", "5 ounces Gruyère cheese, grated", "1/4 cup extra-virgin olive oil", "2 pounds bay scallops, or quartered sea scallops, abductor muscles removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a saucepan over medium heat, and melt 4 tablespoons of the butter in it. When it foams, add the flour, and cook for approximately 4 minutes, whisking constantly. Add the stock, and whisk again, until it is smooth and thick. Add the cream, curry powder, 1 1/2 teaspoons salt and 1/2 teaspoon pepper. Bring the sauce just to a boil, then lower heat and simmer for approximately 10 minutes, stirring occasionally. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 3 tablespoons butter in a large sauté pan set over medium heat. When it melts and foams, add the shallots, and cook, stirring occasionally, until they are clear and tender, approximately 5 minutes. Add the sliced mushroom caps, and cook for 8 to 10 minutes, until they have released their liquid and are just starting to brown. Add the brandy or Cognac, and cook for 1 to 2 minutes, until the alcohol has mostly evaporated. Add a teaspoon of salt to the mixture and 1/2 teaspoon of pepper, and stir again to combine. Add mushroom mixture to the cream sauce, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the bread crumbs, parsley and Gruyère in a large bowl, stir to combine, then moisten the mixture with the olive oil, stirring again to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use last tablespoon of butter to grease 6 1 1/2-cup gratin dishes. Divide the scallops evenly among them and top with equal amounts of the cream and mushroom sauce. Top each gratin dish with a handful or two of the bread-crumb mixture. Place dishes on a sheet tray, cover gently with foil or plastic wrap and store in the refrigerator for up to a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, preheat the oven to 400. Remove cover from sheet tray, and place in the oven for approximately 20 minutes, or until the tops are lightly browned and bubbling and the scallops are cooked through."}]}