{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta or Grits With Beans and Chard", "description": "Anson Mills creamy polenta or grits is very inviting for a savory, brothy bean stew with lots of greens stirred in at the end of cooking. I like to use a reddish bean for this – I have used a number of heirloom varieties from Rancho Gordo, but also regular supermarket pintos and red beans.  The recipe makes twice as much bean stew as you will need for 4 portions of polenta or grits. So make the polenta (or grits) again the next day and polish them off!", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/01/24/science/recipehealthbeans/recipehealthbeans-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 4", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, vegetables", "keywords": "dairy-free, gluten-free, halal, high fiber, kosher, low cholesterol, low sugar, nut-free, vegetarian, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 153}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 229, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "6 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1214 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound (about 1 1/8 cups) dried pintos, red beans, borlottis or other similar heirloom beans, rinsed and picked over for stones", "5 cups water", "1 small onion, halved", "1 medium or large carrot, diced", "3 garlic cloves, 2 crushed, 1 minced", "A bouquet garni made with a couple of sprigs each parsley and thyme, a bay leaf and a Parmesan rind", "Salt to taste", "1 tablespoon extra virgin olive oil", "1/2 teaspoon red pepper flakes (more to taste)", "1 generous bunch Swiss chard (about 3/4 pound), stemmed, leaves washed in 2 changes water, and chopped (7 to 8 cups chopped greens)", "1 tablespoon tomato paste", "1 cup <a href=\"http://www.ansonmills.com/products\">Anson Mills polenta or Pencil Cob grits, cooked</a>", "Freshly grated Parmesan or feta for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop 1/2 of the onion and set aside. To cook dried beans, transfer with their soaking water to a heavy pot. If beans are not covered by 1 1/2 to 2 inches of water, add more water as necessary. Over medium-high heat, bring to a gentle boil and skim away foam. Add unchopped halved onion, crushed garlic cloves and bouquet garni, cover, reduce heat to low and simmer 1 hour. Using tongs, removed halved onion and whole garlic cloves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat olive oil over medium heat in a medium skillet and add chopped onion and carrot. Cook, stirring, until beginning to soften, about 3 minutes, and add chard stems, garlic and pepper flakes. Continue to cook for another couple of minutes, until onion and chard stems are soft. Stir vegetable mixture into beans. Add tomato paste and salt to taste (I use at least 1 1/2 teaspoons), cover and continue to simmer very gently for 1 hour or until beans are tender all the way through and their texture is plush and velvety. Remove and discard bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chard greens (depending on the size of your pot you may have to add a portion at a time, cover for a minute until the first portion wilts, then add the next portion and so on until all of the greens have been added) and continue to simmer for 5 to 10 minutes, until greens are tender but still have some color and life in them. Taste bean broth; it should taste rich, delicious, a little spicy. Add salt as necessary. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toward the end of the cooking time for the beans, cook polenta; or wait until beans are done and start polenta or grits. When done, spoon into wide soup bowls and press down in the middle with the back of a spoon. Spoon beans and greens with broth over polenta or grits. Top with a little Parmesan or feta and serve."}]}