{"@context": "http://schema.org", "@type": "Recipe", "name": "Three-Cup Chicken", "description": "Ask 30 people how to make this simple Taiwanese recipe, and you’ll receive 30 different responses. Some fry the chicken before braising it, use more oil, less wine, different blends of soy sauce. Debates rage over how thick the sauce should be, over which parts of the chicken to use. (Few follow the folk recipe that calls for making the sauce with a cup each of sesame oil, soy sauce and rice wine. “If you actually cook it that way,” says Eddie Huang, the Taiwanese-American chef who inspired the television program “Fresh Off the Boat,” “you’ll be in trouble.”) Our reporting and testing led us to the recipe below. Use it as a starting point, and then make it your own.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/06/06/dining/06COOKING-THREECUPCHICKEN1/06COOKING-THREECUPCHICKEN1-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, lunch, quick", "keywords": "chicken, garlic, ginger, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 3484}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 673, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "1 gram", "proteinContent": "40 grams", "saturatedFatContent": "12 grams", "sodiumContent": "764 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons sesame oil", "1 2-to-3-inch piece of ginger, peeled and sliced into coins, approximately 12", "12 cloves of garlic, peeled", "4 whole scallions, trimmed and cut into 1-inch pieces", "3 dried red peppers or 1 teaspoon red-pepper flakes", "2 pounds chicken thighs, boneless or bone-in, cut into bite-size pieces", "1 tablespoon unrefined or light brown sugar", "1/2 cup rice wine", "1/4 cup light soy sauce", "2 cups fresh Thai basil leaves or regular basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok over high heat and add 2 tablespoons sesame oil. When the oil shimmers, add the ginger, garlic, scallions and peppers, and cook until fragrant, approximately 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the aromatics to the sides of the wok, add remaining oil and allow to heat through. Add the chicken, and cook, stirring occasionally, until it is browned and crisping at the edges, approximately 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sugar and stir to combine, then add the rice wine and soy sauce, and bring just to a boil. Lower the heat, then simmer until the sauce has reduced and started to thicken, approximately 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat, add the basil and stir to combine. Serve with white rice."}]}