{"@context": "http://schema.org", "@type": "Recipe", "name": "Winter Squash, Leek and Farro Gratin With Feta and Mint", "description": "A delicious, and simple, winter squash gratin. This tastes like the filling of many Greek winter squash pies I have made, but it is a simpler dish. The squash is roasted, which gives it great depth of flavor. I love the sweetness of the squash against the salty feta, and the chewy farro against the tender squash. Most of the elements for this gratin can be prepared ahead if you want to go about this piecemeal – farro freezes well and keeps for a few days in the refrigerator; roasted squash keeps well in the refrigerator for a few days as well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/25/science/26recipehealth/26recipehealth-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves 6", "recipeCuisine": "italian, mediterranean", "recipeCategory": "dinner, pastas", "keywords": "fall, spring, summer, winter, halal, high fiber, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 188}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 325, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "688 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds winter squash, peeled and cut in small dice (about 1/2 inch)", "Salt and freshly ground pepper", "4 tablespoons extra virgin olive oil", "1 pound leeks (2 large), white and light green parts only, cleaned and chopped", "2 garlic cloves, minced", "3 to 4 tablespoons chopped fresh mint, or 1 to 2 tablespoons dried mint (to taste)", "3 eggs", "3 ounces feta, crumbled", "3/4 cup cooked faro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Oil a 2-quart baking dish or gratin. Line a sheet pan with parchment. Place squash on baking sheet, season with salt and pepper, and add 2 tablespoons olive oil. Toss squash until evenly coated with oil. Place in oven and roast until tender and lightly colored, about 25 to 30 minutes, stirring every 10 minutes. Remove from oven and set aside. Turn heat down to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat another tablespoon of olive oil over medium heat in a large, heavy skillet and add leeks. Cook, stirring, until they begin to soften, about 2 minutes. Add a generous pinch of salt and continue to cook, stirring often, until tender, another 3 to 4 minutes. Stir in garlic and cook, stirring, until fragrant, 30 seconds to a minute. Add squash and mint to pan and toss together. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl beat eggs. Add salt to taste (remembering that feta is very salty) and feta, and beat together until feta has broken up into eggs. Stir in squash and leek mixture and farro. Scrape into oiled baking dish. Drizzle remaining oil over top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 35 minutes, or until lightly browned. Remove from heat. Serve hot, warm or room temperature."}]}