{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetables à la Grecque", "description": "Despite its name, vegetables à la grecque is a French dish. The vegetables are slightly pickled in a broth of vegetable stock and wine. Serve this as a first course or with an assortment of hors d'oeuvres.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/04/08/dining/08MARTHA/08MARTHA-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "pickles", "keywords": "appetizer, artichoke, carrot, cauliflower, cremini, dairy-free, gluten-free, high fiber, kosher, low-sodium, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 28}, "recipeIngredient": ["6 tablespoons white wine vinegar, champagne vinegar or sherry vinegar", "1/2 cup dry white wine", "1/2 cup extra-virgin olive oil", "4 or 5 plump garlic cloves, smashed and peeled", "1 good-size shallot, coarsely chopped", "Bouquet garni made with 4 sprigs parsley, 2 bay leaves and large sprig of thyme", "4 teaspoons coriander seeds, lightly crushed", "1 teaspoon fennel seeds", "12 black peppercorns", "1/2 to 1 teaspoon kosher or fine sea salt, to taste", "3/4 pound carrots, peeled, quartered at fat ends, halved at narrow ends, and cut in 2-inch lengths", "1 small cauliflower, cut into florets", "1/2 pound cremini or white mushrooms, trimmed and quartered if large, or halved if small", "Trimmed hearts from 4 medium-size artichokes, halved or quartered (plus leaves for garnish, optional)", "Juice of 1 large lemon", "Coarse sea salt or fleur de sel", "1/4 cup finely chopped fresh parsley, or use a mix of herbs such as chervil, tarragon, parsley, marjoram, thyme and chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 3- or 4-quart saucepan combine vinegar, wine, olive oil, garlic cloves, shallot, bouquet garni, coriander seeds, fennel seeds, peppercorns, kosher salt and 3 cups water. Bring to a simmer over medium heat and cook 15 to 30 minutes while you prepare vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add carrots to the broth and simmer 5 minutes. Add cauliflower, bring back to a simmer, and cook another 15 minutes, until carrots and cauliflower are tender but not mushy. Using a slotted spoon, remove vegetables to a bowl. Some of the broth and seeds can come along with them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add mushrooms to broth and simmer 5 minutes. Remove to bowl with carrots and cauliflower."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir broth and ladle 11/2 cups plus some of the coriander seeds into a small saucepan. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add artichoke hearts to the pot in which you cooked the other vegetables and simmer 25 to 30 minutes, until tender. Transfer to bowl with other cooked vegetables. If using artichoke leaves, steam them now. When finished, discard this broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring reserved broth in the small saucepan to a boil and cook until liquid reduces to 1/2 cup. Pour over the vegetables, add lemon juice and fleur de sel and toss. Taste and adjust seasoning. Leave at room temperature until ready to serve (for best flavor, let vegetables marinate for a few hours), or refrigerate for up to 3 days. Just before serving, garnish with herbs and, if you wish, with steamed artichoke leaves, which can be dipped into the marinade. Serve on small plates with the reduced marinade spooned on top."}]}