{"@context": "http://schema.org", "@type": "Recipe", "name": "Kasha", "description": "For years I have had uneven results with buckwheat groats, or kasha, as the dry-roasted grains are called. I have tried different methods, both stovetop and oven, and usually mixed the grains with an egg before cooking. Sometimes my grains cooked up to a mush, other times they held their shape but still seemed rather soft and indistinct. I sort of gave up on kasha for a while, opting for more predictable grains and pseudo-grains like quinoa and spelt. But I love the flavor of buckwheat, so this week I took another stab at buckwheat groats with a box of medium-grain kasha I bought at the supermarket – and everything changed. These grains were cracked, like bulgur, something I hadn’t seen before. I followed the directions on the box, and they turned out perfect -- dry and fluffy, with the wonderful nutty/earthy buckwheat flavor I find so appealing. \nTo see if it was the cut of the grain only or the combination of the cut of the grain and the cooking method that gave me such good results, I used the exact same cooking method using whole toasted buckwheat groats. The whole groats turned out better than any I had made before, but they took three times as long to cook than the cracked groats, yielded a little less, and because all of the egg is not absorbed by the whole grains the way it is by the cracked grains, which have more cut surfaces to absorb the egg, you get some egg flakes floating on the top of the cooked kasha, which is not very attractive (though it’s easy to remove them).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/02/07/science/recipehealthkasha/recipehealthkasha-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, dinner, lunch, vegetables", "keywords": "fall, spring, summer, winter, gluten-free, halal, high fiber, kosher, low sugar, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 183, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "404 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups water", "Salt to taste (I used 3/4 teaspoon)", "1 tablespoon unsalted butter", "1 cup toasted buckwheat groats (kasha), preferably medium-cut (cracked)", "1 egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine water, salt, and butter in a small saucepan and bring to a boil. Once it reaches the boil turn off heat and cover."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, beat egg in a medium bowl and add kasha. Mix together until grains are thoroughly and evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a medium-size, wide, heavy saucepan (I use Analon nonstick), place over high heat and stir egg-coated kasha constantly until grains are dry, smell toasty, and no egg is visible, 2 to 3 minutes. Add just-boiled water, turn heat to very low, cover and simmer 10 to 12 minutes for cracked kasha, 30 minutes for whole kasha, or until all of the liquid is absorbed. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lid from pan, place clean dish towel over pan (not touching the grains), and cover tightly. Let sit undisturbed for 10 to 15 minutes. Fluff and serve."}]}