{"@context": "http://schema.org", "@type": "Recipe", "name": "Granola With Popped Quinoa", "description": "Quinoa that is toasted until the seeds begin to pop is crunchy, but not hard, with a flavor both grassy and nutty. They enrich this granola in the nicest way, adding texture and flavor, as well as a bit of “stealth health” — the popped quinoa bumps up the protein content.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/12/09/dining/09MARTHA/09MARTHA-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 9 cups", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, project", "keywords": "coconut flakes, nuts, oat bran, pumpkin seeds, quinoa, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 103}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 278, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "5 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "77 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup quinoa (do not use red or black quinoa)", "4 cups flaked or rolled oats", "1 cup oat bran", "1 cup coconut chips", "1 to 1 1/2 cups coarsely chopped nuts (preferably a mix of almonds, pecans and cashews), to taste", "1/4 cup pumpkin seeds or sunflower seeds", "1/2 to 1 teaspoon freshly grated nutmeg, to taste", "1 tablespoon ground cinnamon", "1/2 teaspoon salt", "3 tablespoons coconut oil", "3 tablespoons grapeseed or canola oil", "1/2 cup agave syrup", "1 tablespoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place quinoa in a wide skillet and heat over medium heat. Stir or shake the pan and toast until the quinoa begins to pop and smell like popcorn, 5 to 7 minutes. As soon as the quinoa is popping, pour into a very large bowl and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Line 2 sheet pans with parchment. Add all of the remaining dry ingredients to the bowl with the quinoa and toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, combine the oils, agave syrup and vanilla. Warm over low heat, stirring, just until the mixture is fluid. You can also heat in a microwave at 50 percent power for 30 to 60 seconds. Do not let it come to a simmer. Remove from the heat, stir to blend, and stir into the dry ingredients. Mix until evenly coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the granola mixture between the two sheet pans and spread evenly to cover the parchment in a thin layer. Bake, without stirring, for 30 to 35 minutes or until golden, rotating the baking pans front to back and top to bottom halfway through. Remove from the heat and allow to cool before storing. Break it up into clumps if you'd like. Store in well-sealed jars, bags or containers."}]}