{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Stripe-Steamed Mussels", "description": "Before Adam Schop became the chef of the two Miss Lily’s restaurants in Manhattan, he had little experience with the Caribbean culinary traditions he’s since grown fascinated by. The intense floral notes of the chiles of the region were a particular inspiration, and are used with Jamaican Red Stripe and other Caribbean flavors like allspice to boost what is at heart a simple beer-steamed mussel dish.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2015/10/28/dining/28CARIBBEAN2/28CARIBBEAN2-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "caribbean", "recipeCategory": "", "keywords": "beer, mussels, scotch bonnet, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 789, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "7 grams", "proteinContent": "45 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1841 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 Scotch bonnet pepper (or use habanero)", "1/2 cup unsalted butter (1 stick), at room temperature", "2 garlic cloves, minced", "1 teaspoon thyme leaves", "1 pinch ground allspice", "1 cup red bell pepper, stemmed, seeded and julienned (about 1 small pepper)", "1 cup green bell pepper, stemmed, seeded and julienned (about 1 small pepper)", "1 cup chayote, julienned (or use English cucumbers with the seeds removed)", "1 cup Spanish onion, julienned (about 1/2 medium onion)", "1 cup carrots, julienned (about 2 large carrots)", "2 cups rice wine vinegar", "4 fresh or dried bay leaves", "3 tablespoons kosher salt", "1 tablespoon whole allspice berries", "1 tablespoon sugar", "5 tablespoons grapeseed oil", "3 tablespoons thinly sliced garlic (about 3 cloves)", "2 bunches scallions (about 18 scallions), chopped (about 4 cups)", "3 pounds mussels", "3/4 cup Red Stripe beer (6 ounces)", "Salt and pepper", "1 tablespoon coarsely chopped cilantro leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the Scotch bonnet butter: Wearing protective gloves, mince 1/4 of the pepper to yield 1 teaspoon. Thinly slice the remaining pepper and set aside. In a large bowl, combine minced pepper, butter, garlic, thyme and ground allspice. Use a rubber spatula or fork to mix together until well incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the escovitch: In a large bowl, combine bell peppers, chayote, onion, carrots, reserved sliced Scotch bonnet pepper, rice wine vinegar, bay leaves, salt, allspice berries, sugar and 1½ cups water, and toss to combine. Cover with plastic wrap and store in refrigerator for as long as possible, at least 2 days. The mix will hold for 2 months and the flavors will become more concentrated the longer it sits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the steamed mussels: Put a large heavy pot (at least 8 quarts) over high heat and add oil, garlic and scallions. Cook, stirring frequently, until the vegetables are fragrant and soften slightly, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add mussels and shake pan to mix with the vegetables, then add beer and bring to a simmer. Cover the pot and cook until mussels open, about 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lid, add Scotch bonnet butter and stir well to melt the butter. Season with salt and pepper. Discard any unopened mussels. Serve straight out of the pot, with the escovitch spread over the mussels in a thin layer and cilantro sprinkled on top."}]}