{"@context": "http://schema.org", "@type": "Recipe", "name": "Peter Reinhart’s Whole Wheat Bagels", "description": "When I order a whole wheat bagel in a coffee shop what I get is a white bagel with a little bit of whole wheat flour thrown in. These bagels are different; they are truly whole grain. I’ve been enthralled lately with Peter Reinhart’s new cookbook, Bread Revolution. Reinhart, a baking teacher and cookbook author whom I have long admired, has discovered the magic of sprouted whole grain flours, which he uses in the recipes in this book (you can get sprouted whole wheat flour in whole foods stores and from several online sources). He also illuminates many of the mysteries of baking with whole grain flours in general. The recipes that I have tried work with regular whole wheat flour as well; I have Community Grains whole wheat flour on hand but did not have sprouted whole wheat flour when I was developing this week’s Recipes for Health, so that is what I used. One of the important things I learned – relearned really – from Peter is that when you make dough with whole wheat flour, which absorbs liquid more readily than white flour, it is important to give the dough a little time to absorb the water so that it will be workable. So there is a rest after you add the liquid to the flour; you’ll think the dough is going to be way too wet, then it miraculously firms up, in very little time. Reinhart has two methods for bagels in his cookbook; one requires an overnight rest in the refrigerator after shaping (that is the method I have used in the past), the other, made with sprouted wheat flour, can be boiled and baked after rising and shaping. If you use sprouted whole wheat flour Reinhart says the overnight rise isn’t required because the sprouted wheat allows the bagels to develop optimum flavor in a shorter time. I couldn’t discern much of a difference between the flavor of my overnight regular whole wheat bagels and those I made with the shorter rise; and the ones I made with the shorter rise were prettier. Barley malt is the traditional sweetener used in bagel dough and in the water bath, but either honey or agave syrup can be substituted.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/30/science/recipehealthbagels/recipehealthbagels-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "8 bagels", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, lunch, snack, breads", "keywords": "high fiber, low cholesterol, low-fat, low sugar, nut-free, vegan, vegetarian, spring, summer, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 105}, "recipeIngredient": ["510 grams  / about 4 1/4 cups sprouted whole wheat flour or whole wheat flour", "1 1/4 teaspoons fine sea salt", "1 1/4 teaspoons instant yeast", "1 2/3 cups plus 1 1/2 teaspoons / 408 milliliters lukewarm water", "1 tablespoon barley malt, agave syrup, or honey", "2 tablespoons baking soda, malt syrup or honey for boiling water bath", "Cornmeal or semolina flour for baking sheets", "2 to 4 tablespoons topping of your choice: sesame seeds, poppy seeds, caraway seeds, nigella seeds, onion flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle or in a large bowl combine flour, salt and yeast. Stir together or mix at low speed for about 30 seconds. In a small bowl or measuring cup combine lukewarm water and 1 tablespoon barley malt, honey or agave syrup and whisk together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add liquid mixture to flour mixture and mix on low speed or stir for 1 minute. Mixture will be shaggy and sticky. Remove paddle and let dough stand, uncovered, for 5 minutes. Switch to dough hook or turn dough onto lightly oiled work surface and mix on low speed or knead for 2 minutes, until smooth and slightly tacky. Add more flour if necessary (a few tablespoons) if dough is very sticky or wet, and mix or knead for another minute. Finished dough should be firm but supple and smooth to the touch. If it is tacky wait 5 minutes, then add a little more flour as necessary and beat or knead until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape dough into a ball. Clean and oil bowl. Place dough in bowl rounded side down first (to oil the dough), then rounded side up. Cover bowl tightly with plastic and allow dough to proof at room temperature for 1 1/2 to 2 hours, until it has swelled and increased in size by about 1 1/2 times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with parchment and lightly oil parchment. Turn out the dough and divide into 8 equal pieces. Shape each piece into a ball by placing on an unfloured work surface under a cupped hand and rolling it around and around. Lightly oil work surface if dough sticks. To shape bagels, using both hands roll each ball into an 8-inch long rope, tapering from the middle of the dough to the ends. Moisten the last inch of each end, place one end on the palm of your hand and wrap the rope around your hand, bringing the other end between your thumb and forefinger. Overlap the ends by about 2 inches and stick the ends together. Press onto the work surface and roll back and forth to seal, then lay the ring down and even out the thickness with your fingers. The hole should be about 2 inches in diameter. Place on the prepared baking sheets. (Another way to shape the bagels is to press your thumbs through the center of the balls, then gradually pull apart and shape the bagel with your hands by rotating the dough around your thumbs, until the hole is 2 inches in diameter; I find that, although this method is a bit quicker, the bagels tend to close up, so I prefer the rope method). Place on prepared baking sheet(s), at least 1 inch apart. Lightly oil tops and cover loosely with plastic wrap."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow bagels to proof for 30 to 60 minutes, until just beginning to swell and rise. Meanwhile, heat oven to 425 degrees with a rack positioned in the middle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove parchment paper with bagels from baking sheet and replace parchment with clean sheets. Lightly oil parchment and sprinkle with cornmeal or semolina (if you have lots of baking sheets, just line two more baking sheets). To see if bagels are ready, drop one into a bowl of water. It should float to the surface within 15 seconds. If it does not, wait 20 minutes and do another float test."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 to 6 inches water to a boil in a large saucepan and add baking soda, malt syrup or honey.  Adjust heat so water is at a gentle boil. Two at a time, drop bagels into water. After 30 seconds flip over and simmer for another 30 seconds. Using a slotted spoon or a skimmer, remove from water and place on prepared baking sheet, rounded side up. Sprinkle topping over bagel right away. Place in oven and bake 12 minutes. Rotate baking sheet and bake another 8 to 12 minutes, until golden brown. If bottoms are getting too brown slide a second baking pan underneath the first one for insulation after first 12 minutes. Remove from heat and allow to cool."}]}