{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Roasted Cauliflower With Almond-Herb Sauce", "description": "This striking dish has become a modern classic, as chefs around the world are working out new ways to push vegetables into the center of the plate. It makes a lovely vegetarian main course after a pasta intro, or a gorgeous side dish for lamb or fish. Omit the anchovies in the sauce, and it becomes entirely vegetarian; replace the butter with more olive oil, and it turns vegan. Try using pale orange, green or purple cauliflower, or a head of spiky, psychedelic Romanesco. Carve it at the table, just like a roast, for maximum impact.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/10/24/dining/whole-roasted-cauliflower/whole-roasted-cauliflower-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "2 main course servings, or 4 to 6 side dish servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "almond, anchovy, cauliflower, parsley, gluten-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1297}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 900, "unsaturatedFatContent": "66 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "87 grams", "fiberContent": "11 grams", "proteinContent": "14 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1240 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large cauliflower", "Olive oil", "Salt", "1/3 cup blanched almonds", "6 to 10 anchovy fillets (optional)", "2 garlic cloves, peeled", "2 tablespoons unsalted butter, at room temperature", "1/2 cup extra-virgin olive oil, plus extra for basting", "2 teaspoons wine vinegar (white or red), more to taste", "1/2 cup coarsely chopped parsley, mint, tarragon, cilantro or a combination", "1/2 to 1 teaspoon red pepper flakes (optional)", "Salt and ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven while you prepare the cauliflower: Place a heavy oven-proof skillet (a cast-iron skillet looks very nice) or a baking sheet in the oven and turn the heat to 375 degrees. Place a small pan of hot water on the floor of the oven, to create steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break off and discard the outer leaves from the cauliflower. Cut off the bottom of the stem, and then use the tip of a small, sharp knife to cut off the leaves close to the stem. Carefully cut out the hard core of the cauliflower, near the bottom. Leave the main stem intact and make sure not to cut through any of the florets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the cauliflower (leave the water clinging to the outside) and place on a work surface, core side up. Drizzle with olive oil and use your hands to rub over the cauliflower until evenly coated. Sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cauliflower on the hot pan in the oven, core side down, and cook until very tender all the way through when pierced with a knife, at least 1 hour or up to 2 hours. During the cooking, baste 2 or 3 times with more olive oil. It should brown nicely. If you have a convection feature, use it toward the end of baking to brown the crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a small frying pan, toast nuts over low heat, shaking often, just until golden and fragrant. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak anchovies, if using, for 5 minutes in cool water. Rinse and set aside on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, combine almonds, anchovies, garlic and butter and pulse until smooth. Mix in oil, then vinegar. Mix in herbs and red pepper flakes, if using. Season to taste with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cauliflower is tender, remove from the oven. (If desired, run it briefly under the broiler first to brown the surface; there is no need to do this if you used convection.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve cauliflower in the skillet or from a serving plate. Cut into wedges and spoon sauce around each wedge."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Roasted Cauliflower", "description": "A whole roasted cauliflower behaves very much like a roast of meat, in the oven and on the table.", "thumbnailUrl": "https://static01.nyt.com/images/2018/10/24/dining/whole-roasted-cauliflower/whole-roasted-cauliflower-mediumThreeByTwo440.jpg", "uploadDate": "2016-01-05T20:36:54.000Z", "duration": "PT1M24S"}}