{"@context": "http://schema.org", "@type": "Recipe", "name": "Ghanaian Spinach Stew With Sweet Plantains", "description": "This recipe is an adaptation of the smoky spinach stew served at Papaye, Samuel Obeng's restaurant in the Bronx. Built on a base of onions and ginger sauteed in palm oil, made fiery with habanero, and thickened with ground pumpkin seeds and tomatoes, the stew calls for African smoked, dried shrimp powder; its flavor is amazing. (Asian versions are typically unsmoked and chewier.) But smoked paprika and fish sauce make a serviceable substitute.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/03/01/magazine/01eat2/01mag-01eat.t_CA0-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "african", "recipeCategory": "dinner, lunch", "keywords": "dried shrimp powder, plantains, egusi, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 88}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 431, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "8 grams", "proteinContent": "11 grams", "saturatedFatContent": "11 grams", "sodiumContent": "994 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup palm oil or vegetable oil", "1 medium red onion, chopped", "4 cloves garlic, minced", "3 tablespoons minced ginger (1 ounce)", "1 habanero chile, seeds and ribs removed, minced (include seeds if you love heat)", "Kosher salt", "1 tablespoon tomato paste", "2 1/2 pounds plum tomatoes, chopped", "3/4 cup egusi or raw shelled pumpkin seeds", "4 teaspoons African smoked dried shrimp powder (or 2 1/2 teaspoons smoked paprika plus some fish sauce)", "1 pound spinach, washed, dried and roughly chopped", "3 large sweet (yellow) plantains, peeled and boiled in salted water until just tender"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven, warm the palm oil over medium heat, and add the onions, garlic, ginger, chile and a couple pinches of salt. Cook, stirring frequently, until the onions are golden brown and sweet, about 15 minutes. Stir in the tomato paste, and cook for 3 minutes. Add the tomatoes and a few generous pinches of salt. Bring to a boil, lower heat to a simmer and partly cover the pan. Simmer, stirring occasionally, until the sauce has cooked to a rich tomato-soup consistency, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pulse the egusi or pumpkin seeds in a food processor or blender to a fine powder, until it just starts to get clumpy. (Do not overprocess into a butter.) Remove to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the tomatoes have reduced, add the shrimp powder (or smoked paprika and fish sauce to taste), and simmer 2 minutes. Stir in water, a tablespoon at a time, to the bowl of egusi powder until it is a loose paste. Add the egusi paste on top of the tomato sauce, and spread it out. Cover the pan, and cook 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the sauce all together; it will look like a thick porridge. Add a few splashes of water, and increase heat to a boil. Stir in the spinach, until wilted and tender. Taste, season with salt (or more fish sauce, if using) and serve with boiled sweet plantains."}]}