{"@context": "http://schema.org", "@type": "Recipe", "name": "Edna Lewis’s Spiced Pears", "description": "These sweet, sour and aromatic pears are terrific served with ice cream or yogurt, or they can be canned for preserving after cooking. Edna Lewis calls for Seckel pears, but this recipe works for Bosc or other varieties that will keep their shape when cooked. If you have to substitute, try to find smaller fruit, and halve them lengthwise if needed to fit in the pan. The leftover syrup is delicious in drinks.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/11/01/magazine/01spicedpears/01spicedpears-articleLarge.jpg", "totalTime": "PT7H", "recipeYield": "2 1/2 pounds pears, plus about 2 cups syrup", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "dessert, pear", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 413, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "105 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "4 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "63 milligrams", "sugarContent": "96 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon cloves", "1 1/2 pounds dark brown sugar", "1 1/2 cups vinegar", "Pinch of salt", "2 1/2 pounds pears"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan over medium heat, toast the cloves, shaking the pan, until they’re very aromatic. Add the sugar, vinegar and salt, and bring up to a simmer. Simmer for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel the pears, and halve them lengthwise, if needed, to fit the pan. (You can pick out the seeds if you like.) Carefully place the pears in the syrup, and simmer gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the pears every few minutes, to make sure they cook evenly, especially if the hot syrup doesn’t completely submerge them. Cook them until they are just tender at their thickest parts; check with a toothpick after 15 minutes of cooking. When the pears are ready, remove the pan from the heat and place a clean plate on top of the pears to keep them submerged in the vinegar syrup. Allow to cool for six hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve right away, store in the refrigerator or can. If you store them in the fridge, you can separate the pears and syrup and use them independently. If you plan on canning, Lewis instructs you to strain the syrup and boil it for 5 minutes. Pack the pears in jars, cover with the hot syrup and process according to your jar manufacturer’s directions."}]}