{"@context": "http://schema.org", "@type": "Recipe", "name": "Spelt and Lamb Meatballs", "description": "Fragrant with cinnamon and allspice and imbued with parsley and dill, these meatballs are like a cross between a falafel and lamb kibbe, with a crunchy crust. Starchy spelt helps the balls hold their shape and adds a pleasing chewy texture, while a small amount of lamb contributes its brawny, mineral flavor. Feel free to try these meatballs with other ground meats —turkey, chicken, beef or pork should all work nicely. Other whole grain berries (wheat, rye, barley) can be substituted for the spelt. Just make sure to cook the grains until they are quite tender and the bran splits.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/03/18/dining/18APPETITE2/18APPETITE2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick, meatballs", "keywords": "ground lamb, spelt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 199, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "5 grams", "sodiumContent": "311 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["4 scallions", "1/4 cup parsley leaves", "1/4 cup dill sprigs, more for garnish", "2 fat or 3 smaller garlic cloves, grated", "2 1/4 teaspoons coarse kosher salt, or to taste", "1 red chile or jalapeño pepper, seeded and roughly chopped", "1 1/2 teaspoons ground cinnamon", "1 teaspoon ground allspice", "1 teaspoon black pepper", "1/2 teaspoon sweet paprika", "3 cups cooked spelt or other whole grain berries", "1/2 pound ground lamb", "2 tablespoons extra-virgin olive oil, more for frying", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice scallions, keeping the light green and white parts separate from the dark green. Put scallion whites and light green slices into a food processor along with parsley, dill, garlic, salt, chile, cinnamon, allspice, black pepper, and paprika; process until everything is well minced. Add the spelt and process until the spelt breaks down into a rough, chunky paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer spelt mixture to a bowl and add lamb and olive oil. Knead mixture with your hands until well mixed. It should hold together nicely. Form into 11/4-inch balls and either cook immediately, or cover and refrigerate for up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat a large skillet, then add just enough oil to coat the bottom. When oil is hot, add just enough meatballs to fit in one layer with space between each piece; they should not touch, or they won’t brown as nicely. Fry meatballs until well browned on all sides, then remove to a plate. Add more oil to the pan and fry another batch or two, as needed. (Alternatively, to broil meatballs, lay them out in a single layer, not touching, on a rimmed baking sheet or two. Drizzle with oil and broil until browned, 4 to 10 minutes, checking often and shaking the pan occasionally to help them brown all over.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with lemon wedges and the reserved scallion greens and dill sprigs."}]}