{"@context": "http://schema.org", "@type": "Recipe", "name": "Espresso Fizz", "description": "Like any conscientious bartender, Ryan Clur, who created this drink at the restaurant Maialino in New York, is particular about the ingredients he uses: Hologram espresso from Counter Culture Coffee, Fever-Tree tonic water and Regan’s Orange Bitters No. 6. For the best results, use these same brands. If you use other brands, you will change the flavor of the drink (though not necessarily in a bad way). Mr. Clur pulls the shot of espresso into a stainless steel steam pitcher so that the coffee is easier to pour over the back of the bar spoon in a classic bartender’s float, and because the metal will absorb some of the heat of the espresso and drop the temperature of the drink. The result: a drink that feels like an iced coffee even though there is no ice.", "author": {"@type": "Person", "name": "Oliver Strand"}, "image": "https://static01.nyt.com/images/2015/06/17/dining/17COFFEE/17COFFEE-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "breakfast, lunch, quick, non-alcoholic drinks", "keywords": "espresso, orange bitters, tonic water", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 40, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "16 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 shot medium-light espresso, preferably Hologram espresso from Counter Culture Coffee", "3 1/2 ounces Fever-Tree tonic water, chilled", "Dash of orange bitters, preferably Regan’s Orange Bitters No. 6", "1 piece orange peel, pith removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chilled tonic water, a dash of orange bitters and an orange twist to a 5-ounce lowball glass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a shot of espresso: grind, dose and tamp, and lock portafilter into espresso machine. Pull a ristretto shot — 18 grams to 20 grams of grounds will yield 1 1/3 ounces to 1 1/2 ounces of liquid — into a small stainless-steel steam pitcher."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently pour the espresso over the back of a bar spoon into the lowball glass so that the coffee floats on top of the tonic water. Serve immediately."}]}