{"@context": "http://schema.org", "@type": "Recipe", "name": "Flavorful Fish Stock", "description": "Here’s the problem with homemade stock: It’s so good that it doesn’t last long. What’s needed is something you can produce more or less on the spot. \n\nAlthough water is a suitable proxy in small quantities, when it comes to making the bubbling, chest-warming soups that we rely on in winter, water needs some help. Fortunately, there are almost certainly flavorful ingredients sitting in your fridge or pantry that can transform water into a good stock in a matter of minutes.\n\nThese recipes are meant to be fast, so by ‘‘simmer,’’ I mean as little as five minutes and no more than 15. You can season these stocks at the end with salt and pepper to taste, or wait until you’re ready to turn them into full-fledged soups.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/01/18/magazine/18eat_stockmarket-slide-FQ6I/18eat_stockmarket-slide-FQ6I-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "About 6 cups of stock", "recipeCuisine": "", "recipeCategory": "easy, quick, soups and stews", "keywords": "fish bones, white wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "recipeIngredient": ["1 1/2 pounds white fish bones or cleaned heads", "Some roughly chopped carrot, celery and onion", "1 bay leaf", "A crushed garlic clove", "A few slices of lemon", "4 or 5 black peppercorns", "1/2 cup white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 1 1/2 pounds white fish bones or cleaned heads, some roughly chopped carrot, celery and onion, 1 bay leaf, a crushed garlic clove, a few slices of lemon, 4 or 5 black peppercorns, 1/2 cup white wine and 5 1/2 cups water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring almost to a boil, simmer and strain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you like, substitute crushed tomatoes or cream for some of the water."}]}