{"@context": "http://schema.org", "@type": "Recipe", "name": "Italian-Style Tuna Sandwich", "description": "Though an American cook (or even a French one) usually adds mayonnaise to the bowl when dressing canned tuna for a sandwich, Italian cooks invariably anoint theirs with olive oil instead. Capers, olives and anchovy often join the festivities; here they are combined with garlic and parsley to make a zesty salsa verde. Choose the best quality Italian or Spanish canned tuna—the extra cost is well worth it. The other essential ingredient is freshly baked bread, like a good crisp baguette or crusty ciabatta roll.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/04/15/dining/15KITCHEN/15KITCHEN-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, quick, sandwiches", "keywords": "anchovy fillets, canned tuna, capers, eggs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 546}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 530, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "3 grams", "proteinContent": "26 grams", "saturatedFatContent": "6 grams", "sodiumContent": "725 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 cup Italian parsley leaves, washed and dried", "1/2 cup extra-virgin olive oil, plus more as needed", "2 garlic cloves, minced", "1/4 cup roughly chopped green olives, such as Castelvetrano", "3 or 4 anchovy fillets, chopped", "1 tablespoon chopped capers", "Zest of 1 lemon", "Pinch of crushed red pepper", "Salt and pepper", "1 baguette or 4 ciabatta rolls", "Handful of lettuce leaves, arugula or watercress", "8 ounces best quality oil packed tuna, drained, in large chunks", "4 hard-boiled eggs", "Salt and pepper", "1 serrano chile, thinly sliced, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa verde: Whiz parsley leaves and 1/2 cup oil in a food processor or blender to a pesto-like consistency, then transfer to a small bowl. (Alternatively, chop parsley by hand and combine with oil.) Add garlic, chopped olives, anchovies, capers, lemon zest and red pepper to parsley mixture and stir well. Season with salt if necessary and freshly ground black pepper to taste. Thin with more oil as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut baguette crosswise into 4 equal pieces, then split each lengthwise with a serrated knife. (If using rolls, split each lengthwise.) For each sandwich, lay bread flat, crust side down. Spread cut sides with 2 tablespoons salsa verde. Put a few lettuce leaves on 1 piece of bread and arrange 2 ounces of tuna over lettuce. Top tuna with 1 egg, quartered. Season egg lightly with salt and pepper. Add sliced serrano chile, if using. Drizzle with a little more salsa verde, then press sandwich closed."}]}