{"@context": "http://schema.org", "@type": "Recipe", "name": "Baby Greens With Balsamic-Roasted Turnips and Walnuts", "description": "In spring I welcome tender raw turnips into my salads, but I use another approach in the winter. I took some medium-size turnips that had been lingering in my crisper for some weeks, tossed them with balsamic vinegar and olive oil and roasted them. They would make a fine side dish, but I had a salad in mind. I paired the roasted turnips with tender baby greens, walnuts and blue cheese. I have served the turnips warm with the salad and also after they cooled; I liked them best warm.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/02/14/science/recipehealthbabygreens/recipehealthbabygreens-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 5 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings, vegetables", "keywords": "appetizer, side dish, dairy-free, gluten-free, kosher, low cholesterol, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 283, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "4 grams", "sodiumContent": "373 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound turnips (3 medium), peeled and cut in wedges (about 1/2 inch wide at widest part)", "2 tablespoons balsamic vinegar", "1/2 teaspoon sugar", "5 tablespoons extra virgin olive oil", "Salt and freshly ground black pepper", "1 tablespoon sherry vinegar", "1/2 teaspoon Dijon mustard", "1 very small garlic clove, puréed", "1 tablespoon walnut oil", "5 cups baby salad greens (about 4 ounces)", "1/2 cup coarsely chopped walnuts", "1 ounce blue cheese, crumbled (1/4 cup)", "1 to 2 tablespoons chopped fresh herbs such as tarragon, parsley, chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Line a baking sheet with parchment. In a large bowl whisk together balsamic vinegar with sugar and 2 tablespoons olive oil. Toss with turnips until turnips are thoroughly coated. Season to taste with salt and pepper. Transfer to parchment-covered baking sheet, dousing turnips with any liquid left in bowl. Spread turnips in an even layer and place in oven. Roast 10 minutes, then use tongs to flip wedges over and roast for another 10 to 15 minutes, until tender and nicely colored. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl or measuring cup whisk together sherry vinegar, mustard, garlic and salt to taste. Whisk in remaining olive oil and walnut oil. If any liquid remains on baking sheet, tip into dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine greens, walnuts, blue cheese and fresh herbs in a salad bowl. Turnips can be tossed with greens or spooned on top or on the side. Toss greens mixture with dressing and turnips if tossing turnips with salad, and serve."}]}