{"@context": "http://schema.org", "@type": "Recipe", "name": "Excellent White Bread", "description": "This straightforward loaf is the white bread of your dreams, and its fluffy slices make for evenly browned toast. The 1/3-cup of sugar makes this mildly sweet and perfect for peanut butter and jelly sandwiches, but you can cut it down to 2 tablespoons if you’d rather have something more neutral in flavor. You do need some sugar, however, to feed the yeast and ensure a lofty rise. This recipe makes two loaves, one for now, and one for the freezer or to share with a lucky friend.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/04/30/dining/29BIGAPPETITE/29BIGAPPETITE-articleLarge.jpg", "totalTime": "PT4H15M", "recipeYield": "2 loaves", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, breads", "keywords": "active dry yeast, butter, egg, milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1179}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 275, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "237 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/4 teaspoons/7 grams active dry yeast (1 package)", "1 1/2 cups/355 milliliters lukewarm milk", "1/3 cup/67 grams granulated sugar", "1 tablespoon/15 grams kosher salt", "3 tablespoons/43 grams butter, melted, more for greasing bowl and pans and for brushing the tops of the loaves", "2 eggs", "5 to 6 cups/625 grams to 750 grams all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large electric mixer bowl, dissolve yeast in 1/4 cup warm milk. Add the remaining warm milk, the sugar, the salt, the butter and the eggs. Add 5 cups flour and mix with paddle attachment until smooth, about 2 minutes. Switch to hook attachment and knead on low speed, adding more flour if necessary until dough is stiff and slightly tacky, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a large bowl with butter and turn dough out into the bowl. Flip over dough so greased side is up, cover with plastic wrap or a kitchen towel and set in a warm, draft-free spot until doubled in size, about 1 1/2 to 2 hours. Generously butter two 9-x-5 loaf pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When dough has doubled in size, turn it out onto floured surface and knead for 3 minutes. Return to greased bowl, cover and let rise again for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press down dough with your hand to expel the air. Divide dough in half and place each half into a loaf pan. Brush tops of loaves with remaining melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and let rise until dough is just above the tops of pans, 45 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Bake bread for 10 minutes, then reduce heat to 350 degrees and bake for an additional 20 to 30 minutes, or until loaves sound hollow when tapped, the tops are brown and the internal temperatures are 200 degrees. Remove loaves from pans and let cool on wire racks."}]}