{"@context": "http://schema.org", "@type": "Recipe", "name": "White Bean and Roasted Potato Salad With Rosemary", "description": "Freshly cooked white beans hold their shape better than canned ones, so unless you’re really pinched for time, cook the beans yourself for this hearty, lively winter salad. Serve it as a side dish for roasted meats or chicken. If you omit the anchovies in the dressing (use capers instead), it would be an excellent meatless main course. If you have time, it's best to give the beans a proper soak (4 to 12 hours); if not, just tack 30 to 60 minutes onto the cooking time, adding more water as needed to keep them entirely covered.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/01/13/dining/13APPE2/13APPE2-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "appetizer, side dish, beans, greens, yukon gold potato, gluten-free, vegan, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 156}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 359, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "474 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups dried cannellini or Great Northern beans", "1 1/2 tablespoons plus 1 teaspoon coarse kosher salt, more to taste", "2 bay leaves, torn", "1 garlic clove, smashed", "6 tablespoons extra-virgin olive oil", "1 3/4 pounds Yukon Gold potatoes, scrubbed and cut into 1/2-inch chunks", "1/4 teaspoon black pepper", "8 cups hearty winter greens, kale, collard greens, cabbage or mustard greens", "2 teaspoons lemon juice, more to taste", "4 anchovy fillets (see note)", "2 garlic cloves", "2 tablespoons red wine vinegar, more to taste", "Large pinch kosher salt, more to taste", "1/2 cup extra-virgin olive oil", "Finely grated zest of 1 lemon", "1 tablespoon chopped rosemary", "Large pinch red chile flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the beans in a bowl or pot, cover with water by 2 inches and add 1 1/2 tablespoons salt. Let soak 4 to 12 hours. Drain before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the soaked beans in a pot, cover with water by 2 inches and add 1/2 teaspoon salt, 1 bay leaf, the smashed garlic clove and 2 tablespoons oil. Bring to a boil, then simmer until tender, about 40 to 75 minutes, stirring occasionally. Season with more salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the potatoes: Heat oven to 425 degrees. On a rimmed baking sheet, toss potatoes with 2 tablespoons oil, the remaining 1/2 teaspoon salt and the pepper and arrange in a single layer. Top with remaining bay leaf. Roast for 15 minutes, flip potatoes, then roast until golden and very tender, another 15 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potatoes roast, make the dressing: In a blender, combine anchovies, garlic, vinegar and a large pinch of salt; blend until smooth, then blend in oil. Taste and add more salt or vinegar, or both, if needed. Transfer to a large bowl, stir in lemon zest, rosemary and chile flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate large bowl, toss greens with remaining 2 tablespoons oil, the lemon juice and a large pinch of salt. Arrange on a large serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the warm potatoes and beans into the bowl with the dressing and mix well. Taste and add more salt if necessary, and vinegar. Arrange on top of greens and serve."}]}