{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Cauliflower, Raisins and Anchovy Vinaigrette", "description": "Roasting toughens cauliflower and dries it out a bit. With many foods, this description may not sound that appealing, but because cauliflower is often mushy and watery, roasting is beneficial. Here, a (rather strong) vinaigrette is tossed with the cauliflower immediately after roasting, along with the raisins, whose sweetness counters the anchovies beautifully.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/11/16/dining/16COOKING-ROAST-CAULIFLOWER-ANCHOVY1/16COOKING-ROAST-CAULIFLOWER-ANCHOVY1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch", "keywords": "anchovy fillets, cauliflower, raisins, sherry vinegar, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 183, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "320 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 large cauliflower, cored, trimmed and separated into florets", "1/2 cup extra virgin olive oil", "Salt and freshly ground black pepper", "2 tablespoons sherry or balsamic vinegar, or to taste", "4 minced anchovy fillets, with a little of their oil, or to taste", "1/2 cup raisins, preferably golden", "1/2 cup chopped fresh parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Put cauliflower in roasting pan, drizzle with 3 tablespoons oil and some salt and pepper; toss. Roast, turning once or twice, for 15 minutes or so, until cauliflower just starts to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make vinaigrette by combining remaining oil with vinegar, anchovies and a little salt and pepper; taste and adjust seasoning. Remove pan, drizzle cauliflower with 2 tablespoons of vinaigrette, and toss. Roast, turning once, until a thin-bladed knife pierces a piece with little resistance, for 15 minutes. (Recipe may be cooled at this point, covered tightly and refrigerated for 2 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the last minute, put cauliflower in a salad bowl and add raisins, parsley and remaining vinaigrette and toss. Taste and sprinkle with salt, if needed, and lots of pepper, then serve."}]}