{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown Rice Bowls With Stewed Peppers", "description": "I always include at least three elements in my grain bowls: the grains, the topping and something to garnish the topping, usually a protein, often a poached egg. I wanted some contrasting crunch as well as some cheese, so I made Parmesan crisps, also known as frico, one of the easiest, best-kept secrets in the Italian repertoire.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/09/02/dining/02MARTHA/02MARTHA-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "brown rice, sweet pepper, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 111}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 378, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "8 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "918 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds sweet peppers, preferably a combination of red, yellow and orange (about 3 large)", "2 tablespoons extra-virgin olive oil", "1 small red onion, chopped", "2 plump garlic cloves, minced", "1 Anaheim chile pepper, seeded and cut in 1-inch strips, or 1 or 2 serrano or jalapeño peppers, minced (optional)", "Salt and black pepper", "3/4 pound tomatoes, grated, or peeled, seeded and chopped (1 cup)", "Pinch of sugar", "1 basil sprig, plus 1 tablespoon slivered basil, and additional leaves for garnish", "2 ounces Parmesan, finely grated (about 1/2 cup)", "3 cups cooked brown rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut tops off peppers, then cut lengthwise into sections along creases. Remove seeds and membranes. Slice sections crosswise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large heavy skillet over medium heat and add onion. Cook, stirring, until tender, about 5 minutes. Add garlic and stir until fragrant, about 30 seconds. Add sweet peppers and, if using, chiles. Cook, stirring often, until peppers have softened slightly, about 5 minutes. Add salt to taste and continue to cook for another 5 minutes, until peppers are tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes, sugar, basil sprig and black pepper. Bring to a simmer and cook, stirring from time to time, until tomatoes have softened and cooked down, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover skillet, reduce heat and simmer for another 10 minutes, stirring occasionally, until mixture is thick and fragrant. Stir in slivered basil. Taste and adjust seasonings. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make Parmesan crisps: Heat oven to 350 degrees. Line 1 or 2 baking sheets with silicon mats or parchment. Spoon heaped tablespoons (about 1/2 ounce) grated Parmesan onto silicon mat or parchment, then use a spoon to flatten rounds until they are about 4 to 4 1/2 inches in diameter and very thin. They should be about 2 inches apart. Bake 9 to 10 minutes, switching pans front to back, until the cheese is brown and lacy. Remove from heat and allow the rounds to cool. Once cooled, they should be crisp all the way through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon rice into bowls. Top with peppers. Garnish with torn leaves of fresh basil and a Parmesan crisp."}]}