{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange Beef", "description": "This recipe for takeout-style orange beef is a variation on one the Brooklyn chef Dale Talde included in his new cookbook, \"Asian-American: Proudly Inauthentic Recipes From the Philippines to Brooklyn,\" with a slightly more intensely flavored orange-flavored sauce. Mr. Talde's key insight is protected, however: Use very good steak, and cook it fast, so that below the lovely crust of its egg-white-and-cornstarch batter, the meat remains rare and luscious. Serve with steamed broccoli and white rice. And make it a few times. What appears difficult the first time through — the coating of the beef, the making of the sauce, the stir-frying of the aromatics, the stir-frying of the beef — is in fact fast and easy work, and much, much better than takeout.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/09/23/dining/23PANTRY3/23PANTRY3-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian, chinese", "recipeCategory": "", "keywords": "beef, orange, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1324}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 450, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "1 gram", "proteinContent": "19 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1294 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 tablespoon neutral oil", "1 1 1/2-inch piece fresh ginger, peeled and minced", "1 jalapeño pepper, seeded and minced", "2 tablespoons orange zest, plus the juice of one orange", "3 garlic cloves, peeled and minced", "1/4 cup light brown sugar", "1/4 cup rice vinegar (do not use seasoned rice vinegar)", "1/4 cup soy sauce", "1 tablespoon fish sauce", "1 large egg white", "1 tablespoon cornstarch", "1 pinch kosher salt", "1 boneless rib-eye steak, approximately 1 to 1 1/2 pounds, cut into 1-inch pieces", "1/4 cup neutral oil", "6 scallions, white and green parts cut into inchlong pieces and separated", "2 to 4 dried red chiles, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Heat oil in a small sauce pan set over medium-high heat. When it begins to shimmer, add ginger, jalapeño and orange zest and stir to combine. Sauté mixture until ingredients soften, approximately 2 to 3 minutes, then add garlic and continue cooking until it softens, approximately 1 to 2 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add orange juice, brown sugar, rice vinegar, soy sauce and fish sauce to pan and stir to combine. Allow mixture to come to a boil, then lower the heat and cook, stirring occasionally, until it thickens and reduces by half, approximately 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the meat: Combine egg white, cornstarch and salt in a bowl. Add steak, tossing to coat the meat with the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet or wok set over high heat, heat oil until it shimmers and is about to smoke. Add beef to the pan or wok in a single layer and cook without stirring until the bottoms of the pieces are crisp and golden, approximately 60 to 90 seconds. Add white pieces of scallion and chiles to the pan, then turn the beef pieces over and cook the other sides, stirring occasionally, about 3 minutes more for medium-rare. Transfer to a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour orange sauce into the hot pan or wok, let it boil and stir it as it thickens. Add meat and white scallions and stir to coat with the sauce. Return meat and sauce to the platter and scatter green scallions over the top. Serve with steamed broccoli and white rice."}]}