{"@context": "http://schema.org", "@type": "Recipe", "name": "Monkfish à la Provençale", "description": "Gigot de Mer à la Provençale is roasted monkfish seasoned with rosemary, thyme, bay leaf and garlic that is served on a bed of ratatouille. What could be more Provençale?", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/07/08/dining/08MARTHA/MARTHA-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "eggplant, monkfish, zucchini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 84}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 503, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "10 grams", "proteinContent": "39 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1862 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 very large eggplant (about 1 1/2 pounds), diced", "Salt", "5 tablespoons extra-virgin olive oil, plus more for oiling dish", "2 medium onions, finely chopped", "1 red bell pepper, seeded and cut in thin 2-inch lengths", "1 green bell pepper, seeded and cut in thin 2-inch lengths", "3 large garlic cloves, minced, plus 1 clove, sliced", "2 large zucchini (about 1 1/4 pounds), diced", "Black pepper", "1 bay leaf, broken in half", "1 teaspoon chopped fresh rosemary", "1 teaspoon fresh thyme leaves", "1 large tomato, peeled, seeded and finely chopped", "1 2-pound monkfish tail, skin off", "2 shallots, minced", "1 cup dry white wine", "Slivered fresh basil leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Cover a baking sheet with parchment and place eggplant on top. Season with salt to taste and toss with 2 tablespoons olive oil. Place in oven on middle rack and roast for 15 minutes, stirring halfway through. Remove from oven and reduce heat to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a heavy lidded skillet or casserole and add onions and pepper. Cook, stirring often, until just about tender, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add minced garlic and cook, stirring, until fragrant, 30 seconds to a minute. Add zucchini and roasted eggplant, and stir together. Season generously with salt and pepper and add 1/2 bay leaf, 1/2 teaspoon rosemary and 1/2 teaspoon thyme. When vegetables are sizzling, cover pan, reduce heat to low, and simmer 20 minutes, stirring occasionally. Stir in the tomato. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, oil a large baking dish or gratin (large enough to accommodate ratatouille and fish). Season monkfish on both sides with salt and pepper. Make a few slits in the top and insert garlic slices. Place fish in baking dish, rounded side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle shallots around fish. Drizzle 1 tablespoon olive oil over fish and sprinkle with remaining rosemary and thyme. Break up remaining bay leaf into a few pieces and scatter over fish. Pour wine into baking dish and place in oven for 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove baking dish from oven and carefully transfer fish to the baking sheet you used for the eggplant. Pour off liquid in baking dish and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer ratatouille to baking dish and place fish on top. Return to oven and bake 10 to 15 minutes, or until fish is completely opaque and can be pulled from the bone. Monkfish won’t flake apart like other white-fleshed fish; the texture is similar to cooked lobster. Remove from oven. Remove pieces of bay leaf, then garnish with basil and serve."}]}