{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Cheese Sandwich", "description": "The trick to great grilled cheese sandwiches isn't in the ingredients, but on the stove. Achieving a golden, crusty outside and oozy inside takes a little patience: if the heat is too high, the outside will scorch before the cheese melts. Cooking the slices separately at first gives the cheese a good head start. There's no need to search out artisanal loaves or local cheese (though they won't hurt), but definitely do not use homemade mayonnaise.  Mustard, chutney or even strawberry jam (believe it) can be dabbed on the cheese as it melts, or add ham, prosciutto or slices of apple or tomato (drain on paper towels first). You can use any melting cheese, such as American, Muenster or Swiss, but not too much: part of the perfection here is in the proportion of bread to cheese.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/04/12/dining/grilledcheese/grilledcheese-mediumThreeByTwo440.jpg", "totalTime": "PT15M", "recipeYield": "1 sandwich", "recipeCuisine": "", "recipeCategory": "easy, lunch, quick, sandwiches", "keywords": "bread, cheese, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1508}, "recipeIngredient": ["2 slices bread, either soft sandwich squares or large peasant-style slices, not more than 1/2 inch thick", "Butter", "Mayonnaise", "1 to 2 ounces grated cheddar (or other cheese), depending on size of bread"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy pan over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly spread one side of each bread slice with butter. Spread the other side of each slice with mayonnaise and place the bread, mayonnaise-side-down, in the pan. Divide the cheese evenly on top of the buttered slices. Adjust the heat so the bread sizzles gently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cheese is about halfway melted, use a spatula to flip one slice over on top of the other, and press lightly to melt. Keep turning the sandwich, pressing gently, until the sandwich is compact, both sides are crusty, and the cheese is melted."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Grilled Cheese", "description": "You can use any melting cheese, such as American, Muenster or Swiss, but not too much: part of the perfection here is in the proportion of bread to cheese.", "thumbnailUrl": "https://static01.nyt.com/images/2016/04/12/dining/grilledcheese/grilledcheese-mediumThreeByTwo440.jpg", "uploadDate": "2017-08-01T16:06:08.000Z", "duration": "PT1M10S"}}