{"@context": "http://schema.org", "@type": "Recipe", "name": "Clementine Clafoutis", "description": "Clafoutis is a classic French dessert most often made with cherries. But since clafoutis is little more than a rich, sweet pancake batter poured over fruit and baked, substitutions are easy. If you're using tiny North African clementines for this version, you'll need a dozen or so for this recipe; if they're the large ones from California, five or six will probably do. In any case, it's worth spending a little time removing any thick white strands from the sections, and any of the fine webbing that comes off easily.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/08/26/dining/clementine-clafoutis/clementine-clafoutis-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "At least 6 servings", "recipeCuisine": "french", "recipeCategory": "cakes", "keywords": "clementines, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 346, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "10 grams", "sodiumContent": "105 milligrams", "sugarContent": "33 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Butter as needed", "1/2 cup flour, more for dusting pan", "3 eggs", "1/2 cup granulated sugar", "Pinch salt", "3/4 cup heavy cream", "3/4 cup milk", "5 to 15 clementines, peeled and sectioned, about 3 cups", "Powdered sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Prepare a gratin dish, about 9 by 5 by 2 inches, or a 10-inch round deep pie plate or porcelain dish, by smearing it with butter, just a teaspoon or so. Dust it with flour, rotating pan so flour sticks to all the butter; invert dish to get rid of excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk eggs until frothy. Add granulated sugar and salt and whisk until combined. Add cream and milk and whisk until smooth. Add 1/2 cup flour and stir just to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer clementine sections in dish; they should come just about to the top. Pour batter over fruit to as close to top of dish as you dare; you may have a little leftover batter, depending on size of your dish. Bake for about 40 minutes, or until clafoutis is nicely browned on top and a knife inserted into it comes out clean. Sift some powdered sugar over it and serve warm or at room temperature. Clafoutis does not keep; serve within a couple of hours of making it."}]}