{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken-Skin Canapés", "description": "The irresistibility quotient of crisp chicken skin “crackers” is right up there with potato chips. When I first tasted them during a charity event at the stall run by Ken Oringer, a chef and owner of Toro on the edge of SoHo, I kept coming back for more. He said they were easy to make at home. And they are, requiring about an hour of unattended time. Mr. Oringer served his as little sandwiches – he calls them bocadillas – filled with a kind of Spanish pimento cheese. I made mine open-faced, with the cheese as a topping. I also used them to channel Buffalo wings by spreading a little hot sauce, then a blue cheese mixture on top and using a slice of celery as a garnish. The skin shrinks as it cooks. Kept in a container or a plastic bag, the unadorned crackers can hold for several days.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/02/03/dining/03BURNER4/03BURNER4-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "32 pieces", "recipeCuisine": "", "recipeCategory": "crackers and chips", "keywords": "appetizer, chicken skin", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 8}, "recipeIngredient": ["Skin from 8 chicken thighs", "Salt and ground black pepper", "1 cup <a href=\"http://cooking.nytimes.com/recipes/1017965-spanish-pimento-cheese-spread\">Spanish pimento</a> or <a href=\"http://cooking.nytimes.com/recipes/1017966-blue-cheese-spread\">blue cheese spread</a>", "32 slices celery, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Carefully remove the skin from the chicken thighs without tearing. Set skinned thighs aside for another use or freeze them. Line a 9-by-13-inch rimmed sheet pan with parchment paper. Spread half the skin pieces on the paper. Season with salt and pepper. Top with another piece of parchment, and then place a second sheet pan on top to weigh down the skin. If you have enough pans, repeat to make one more tray of skins. Otherwise wait until the first batch is done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place layered pans with skin in the oven and bake about 50 minutes. Skin should be golden brown. If not, return pans to the oven for another 10 minutes. If using two pans, rotate halfway through baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cooked chicken skins on a sheet of paper towel, blot and set aside until cool. If needed, cook second batch. Once cool, use a sharp knife to cut each piece of skin in four, trimming any ragged edges. Set aside in a covered container until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread cheese onto crisp chicken skin squares and serve. If using blue cheese spread, garnish each with a piece of celery before serving."}]}