{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Roasted Chicken Shawarma", "description": "Here is a recipe for an oven-roasted version of the classic street-side flavor bomb usually cooked on a rotisserie. It is perfect for an evening with family and friends. Serve with pita and tahini, chopped cucumbers and tomatoes, some olives, chopped parsley, some feta, fried eggplant, hummus swirled with harissa, rice or rice pilaf. You can make the white sauce that traditionally accompanies it by cutting plain yogurt with mayonnaise and lemon juice, and flecking it with garlic. For a red to offset it, simmer ketchup with red pepper flakes and a hit of red-wine vinegar until it goes syrupy and thick, or just use your favorite hot sauce instead.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/06/06/dining/06COOKING-ROASTCHICKSHAWARM2/06COOKING-ROASTCHICKSHAWARM2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "turkish", "recipeCategory": "dinner, lunch", "keywords": "chicken thighs, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7413}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 390, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "2 grams", "proteinContent": "31 grams", "saturatedFatContent": "5 grams", "sodiumContent": "462 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 lemons, juiced", "1/2 cup plus 1 tablespoon olive oil", "6 cloves garlic, peeled, smashed and minced", "1 teaspoon kosher salt", "2 teaspoons freshly ground black pepper", "2 teaspoons ground cumin", "2 teaspoons paprika", "1/2 teaspoon turmeric", "A pinch ground cinnamon", "Red pepper flakes, to taste", "2 pounds boneless, skinless chicken thighs", "1 large red onion, peeled and quartered", "2 tablespoons chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a marinade for the chicken. Combine the lemon juice, 1/2 cup \nolive oil, garlic, salt, pepper, cumin, paprika, turmeric, cinnamon and \nred pepper flakes in a large bowl, then whisk to combine. Add the chicken and toss well to coat. Cover and store in refrigerator for at least 1 hour and \nup to 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat oven to 425 degrees. Use the remaining \ntablespoon of olive oil to grease a rimmed sheet pan. Add the quartered \nonion to the chicken and marinade, and toss once to combine. Remove \nthe chicken and onion from the marinade, and place on the pan, spreading \neverything evenly across it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken in the oven and roast until it is browned, crisp at the \nedges and cooked through, about 30 to 40 minutes. Remove from the \noven, allow to rest 2 minutes, then slice into bits. (To make the chicken even more crisp, set a large pan over high heat, add a tablespoon of olive oil to the pan, then the sliced chicken, and sauté until everything curls tight in the heat.) Scatter the parsley over the top and serve with tomatoes, cucumbers, pita, white sauce, hot sauce, olives, fried eggplant, feta, rice — really anything you desire."}]}