{"@context": "http://schema.org", "@type": "Recipe", "name": "Ash-Roasted Potatoes", "description": "You don’t need a real recipe for these potatoes, but you do need a charcoal grill because these ash-baked tubers won’t work with gas. The recipe is a throwback to when clans of kids roamed New York City streets in the early 20th century, building fires in abandoned lots and baking potatoes into the ashes for a hot snack. The potatoes turn so sooty black that it can be hard to tell them apart from the coals, especially in the twilight. The timing of when they will be done will vary depending upon the size of your potatoes and the heat of your fire. Stab them with a skewer to see when they are tender within. To eat, carefully break a potato open and scoop out the smoky, fluffy flesh with a spoon, seasoning it with salt and butter to taste. Or go old-school and wrap the potatoes in a newspaper to protect your fingers before breaking them open and biting the flesh directly from the burned shells.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/07/01/dining/01APPE_INLINE/01APPE_INLINE-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 164, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "5 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "13 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["6 potatoes, any kind (or use as many as you like)", "Butter, for serving", "Salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a large and very hot charcoal fire. Put the potatoes in the fire, burying them completely (you can cook something else on top of the grill as the same time). The potatoes will be done after anywhere from 45 to 90 minutes, so keep checking them by piercing them with a skewer. When they feel soft on the inside, they are done. Let cool slightly before eating."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To eat, slice them open and serve with butter and salt on the side for each person to season the potatoes to taste. A spoon is the easiest way to get to the tender potato flesh. Don’t eat the burned shells."}]}