{"@context": "http://schema.org", "@type": "Recipe", "name": "Citrus Rice Salad With Parmesan", "description": "In all of American cooking there is probably no term less meaningful than “salad.” I’m racking my brain for a way to narrow the definition, but the best I can do is a dictionary-like “mixture of food, usually cold or at room temperature, with some kind of dressing.” That’s not saying much, but it opens a world of opportunities, especially when the base ingredient is rice, which offers a far wider variety of flavors and textures than any other grain.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/08/20/dining/citrus-salad/citrus-salad-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "citrus, parmesan, rice, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 147}, "recipeIngredient": ["1 1/2 to 2 cups any rice", "Salt and freshly ground black pepper", "1/2 cup extra-virgin olive oil", "3 tablespoons freshly squeezed citrus juice, or more to taste (lemon, lime, orange, tangerine, grapefruit, or a combination)", "2 tablespoons grated citrus zest", "1 tablespoon sugar or honey", "1 cup chopped citrus flesh (or whole segments, if small)", "1/2 large red or mild white onion, minced", "1/2 cup chopped fresh mint", "1/2 cup or more grated Parmesan", "Chopped almonds or pecans, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook rice in abundant salted water, as you would pasta, until it’s just done; white rice will take 10 to 15 minutes, brown 30 or a little longer. Drain, rinse in cold water, drain again, then put in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine olive oil, citrus juice, zest, sugar or honey, salt and pepper in a blender and turn the machine on; a creamy emulsion will form within 30 seconds. Taste and add more citrus juice a teaspoon or two at a time until the balance tastes right to you."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle vinaigrette over rice. Use 2 big forks to combine, fluffing rice and tossing gently to separate grains. Stir in citrus flesh, onion and mint; taste, and adjust the seasoning or moisten with a little more dressing. Serve, sprinkled with Parmesan and chopped nuts, at room temperature, or refrigerate for up to a day, bringing salad back to room temperature before serving."}]}