{"@context": "http://schema.org", "@type": "Recipe", "name": "Boeuf à la Mode", "description": "At the apogee of cooking in vino is this dish, which involves a whole beef roast. As befits a thing that humans have been eating since before computers, before cars, before guns — perhaps before science itself — boeuf à la mode tastes less invented than it does discovered. The best strategy is to cook it a day before you plan to serve it; it tastes better reheated than immediately, and the seasoning is most even and best distributed when it has time to spend in its rich broth.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2016/01/17/magazine/17eat/17mag-17eat-t_CA1-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "roasts", "keywords": "cognac, pig's foot, red wine, roast beef, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 682, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "2 grams", "proteinContent": "55 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1234 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Kosher salt to taste", "1 4-pound chuck eye roast, in a single tied piece if possible", "1/2 to 1 teaspoon freshly grated nutmeg", "1 allspice berry, freshly grated", "Olive oil for the pan", "1/2 cup onion, chopped or sliced", "1/2 cup carrot, chopped", "1/2 cup celery, chopped", "1 tablespoon tomato paste", "A few garlic cloves, peeled", "1 bottle good, light-bodied red wine", "1/3 cup cognac or brandy", "1 pig's foot or beef or veal knuckle", "1 bouquet garni of a few sprigs of thyme and a small handful of parsley stems", "2 bay leaves", "1/2 to 1 cup dried porcini mushrooms", "2 to 4 cups beef stock", "Optional: a cup of parsley, finely chopped; the peel of one lemon, finely chopped; 1 clove of garlic, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "A day before cooking, salt the roast very well with kosher salt, at least twice as well as you feel comfortable doing. Season with the other spices, trying to distribute them more or less evenly. Use the full teaspoon of nutmeg if you like the flavor of nutmeg, the half if you are skeptical. Cover with plastic wrap, and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the roast to room temperature before cooking. Heat oven to 300 degrees. In a heavy casserole, brown the roast on all sides in hot olive oil over medium heat. It should take about 10 to 12 minutes. Remove roast to a plate. Deglaze the pan with the onion, carrot, celery and tomato paste, and stir well, scraping the bottom with a wooden spoon. Add the garlic and the wine and cognac. Cook over high heat, boiling until reduced by half. Add the roast, pig’s foot, bouquet garni, bay leaves, mushrooms and enough beef stock to cover roast about halfway up. Cook in oven, covered, 3 to 4 hours, until totally tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are serving the following day, allow to cool overnight in its broth in the refrigerator. Then remove the fat that has settled on top, remove the roast, warm all the braising juices, the pig’s foot and the vegetables, and then strain it through a fine sieve, so that only the glossy broth remains. If you are serving it the day you cook it, remove the finished roast, strain the broth and then skim the fat the best you can from its surface with a ladle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the broth. If it tastes too acidic — as it may or may not, depending on your taste and on the wine used — add up to another cup or 2 of beef broth. The foot will have given it enough body to withstand being thinned. Do any other adjusting of seasoning you like. Remove the twine from the roast, and return it to its broth until ready to reheat and serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Then reheat the boeuf in its flavorful sauce, remove to a cutting board and cut into thick slices, pouring sauce over all of them, and serving more at the table. Serves 6, heartily."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "I like this best with a big handful of gremolata, the Italian condiment, on top. It is not at all French, and not at all how this is traditionally served. But it is very delicious. To make it, combine the chopped parsley, finely chopped lemon zest and finely chopped garlic in a bowl, and add a very small pinch of coarse salt."}]}