{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash and Bacon Risotto", "description": "The classic risotto technique applies here, though with a frugal twist. I blended the cooking liquid for the butternut squash and about half of the diced cooked squash itself to produce my vegetable broth. The rest of the diced squash is folded in near the end of cooking. A generous helping of smoked bacon gives the result main-dish heft. This risotto does not need a final dollop of butter or a dusting of cheese.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/01/13/dining/06PARING/06PARING-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "bacon, butternut squash, dry white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 237}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 416, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "821 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large butternut squash, about 3 pounds, peeled, cored and diced in 1/2-inch pieces", "Salt", "6 ounces thick-sliced smoked bacon", "1 cup finely chopped onion", "1 teaspoon ground sage", "1 1/2 cups arborio rice", "1/2 cup dry white wine", "Ground black pepper", "1 tablespoon fresh sage leaves, slivered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place squash in a saucepan with 4 cups salted water. Bring to a boil and simmer until tender, about 10 minutes. Drain, reserving the cooking liquid. Set aside half the diced squash. Place the rest, with 2 cups of the cooking liquid, in a blender or food processor and process until smooth. Return this thin squash purée and the rest of the cooking liquid to the saucepan in which the squash was cooked. You should have about 5 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry half the bacon. Set aside. Chop the rest. Place chopped bacon in a 3-quart sauté pan over medium-low heat. Cook, stirring, until bacon barely starts to color. Add the onion, continue cooking until onion is translucent. Stir in half the ground sage, then the rice. Cook, stirring on medium heat, a few minutes until the grains of rice start to look chalky. Stir in the wine and cook until most has evaporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the saucepan of squash liquid to a simmer and start to add it to the rice, about half a cup at a time, stirring and adding more as it is absorbed. After about 15 minutes, the rice should almost be al dente. Before adding the final portion of liquid, fold in the reserved diced squash, the remaining ground sage and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide risotto among 4 to 6 plates, crumble the reserved fried bacon and top each portion with some bacon and slivered sage."}]}