{"@context": "http://schema.org", "@type": "Recipe", "name": "Japanese Chicken and Root Vegetable Stew", "description": "This vegetable-rich stew is based on a Japanese nimono, a simmered dish flavored with kombu, soy sauce and dried shiitake mushroom caps. Although the ingredients may take some searching (check Japanese or Asian markets, or online), the cooking  itself is no harder than the usual chicken soup, and the results are just as comforting. You can substitute other root vegetables for the ones called for here. Just make sure to add the sturdier chunks first (taro, celery root, burdock, kohlrabi, turnip, beets) so they have enough time to cook before adding the quicker-cooking ones (turnips, sweet potatoes, winter squash). If you want to make this vegetarian, you can leave out the chicken. It works equally well. Adding cubes of tofu or pieces of fish or seafood during the last few minutes of cooking is also a nice way to go.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/01/21/multimedia/clark-japanese-stew/clark-japanese-stew-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "japanese", "recipeCategory": "soups and stews", "keywords": "carrot, chicken, daikon, kombu, sake, sansho pepper, sweet potato, taro root, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 138}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 322, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "4 grams", "proteinContent": "28 grams", "saturatedFatContent": "2 grams", "sodiumContent": "722 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 to 12 dried Japanese or Chinese shiitake mushrooms (about 1 1/2 ounces)", "1 piece kombu, about 7 by 3 1/2 inches", "1 pound bone-in chicken thighs (2 to 3), skins removed if you prefer (or substitute bone-in breast meat)", "4 ounces taro root, celery root or potato, peeled and cut into 1-inch pieces", "4 ounces daikon or other radishes, peeled and cut into 1-inch pieces (or use kohlrabi)", "4 ounces carrots, yellow beets or lotus root, peeled and cut into 1-inch pieces", "1 cup sake", "2 1/2 tablespoons Japanese soy sauce or tamari, more to taste", "1 teaspoon sugar", "1/2 teaspoon kosher salt", "4 ounces sweet potato, white turnip or winter squash, peeled and cut into 1-inch pieces", "Rice wine vinegar, to taste", "Ground sansho pepper, shichimi togarashi or good smoky chile powder, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, soak dried mushrooms in water overnight at room temperature. (Alternatively, you can cover mushrooms with hot water and let soak for 2 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove mushrooms, reserving the soaking liquid. Slice off stems and discard them. Cut the caps into 1/4-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place kombu in a large pot, add mushrooms and their soaking liquid, and bring to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make a drop lid (called an otoshibuta in Japanese) by folding foil into a round just smaller than the pot. Poke a few holes in the drop lid with a chopstick or knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as liquid boils, remove kombu and discard or save to reuse. Add chicken, taro, radish, carrot, sake, soy sauce, sugar and salt to the pot, and bring to a boil. Reduce heat to low, place drop lid directly on top of cooking vegetables and simmer until the chicken is cooked through, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from the pot and set aside. Add sweet potato to the pot, cover pot again with drop lid, and simmer for another 15 to 20 minutes, until vegetables are cooked through but not mushy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, shred cooled chicken and divide among four bowls. Stir rice wine vinegar into stew, along with salt to taste, then ladle it into the bowls with the chicken. Garnish with sansho powder or shichimi togarashi and serve."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Japanese Chicken and Root Vegetable Stew", "description": "This nimono, or braised root vegetable stew, is the perfect way to use up the last of your winter C.S.A. box.", "thumbnailUrl": "https://static01.nyt.com/images/2016/01/21/multimedia/clark-japanese-stew/clark-japanese-stew-mediumThreeByTwo440.jpg", "uploadDate": "2016-01-22T17:49:41.000Z", "duration": "PT3M3S"}}