{"@context": "http://schema.org", "@type": "Recipe", "name": "Pikliz", "description": "In Haiti, this spicy cabbage, carrot and chile-laced pickle, which is pronounced pick-lees, is traditionally served with rich meats and fried foods, like <a href=\"http://cooking.nytimes.com/recipes/1017276-haitian-pork-griot\">the pork dish griot</a>. Its bright, fiery tang mitigates the heaviness and balances out the flavors. It’s also a wonderful condiment to serve with rice and beans, noodles, roast chicken, or other gently flavored dishes that need a little zipping up. Like most pickles, it will keep for weeks in the refrigerator. Make sure to take care when handling the chiles; gloves are recommended here.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/03/11/dining/11APPE2/11APPE2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "1 quart", "recipeCuisine": "caribbean", "recipeCategory": "dinner, lunch, pickles", "keywords": "bell pepper, cane vinegar, carrot, green cabbage, scallion, scotch bonnet, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 147}, "recipeIngredient": ["2 cups thinly sliced green cabbage", "1 medium onion, halved and thinly sliced", "1 large carrot, peeled and coarsely grated (1 cup)", "1/2 medium green, red or yellow bell pepper, seeded and thinly sliced (1 cup)", "2 scallions, thinly sliced", "4 Scotch bonnet or habanero chiles, seeded and very thinly sliced", "4 garlic cloves, finely chopped", "1 1/4 teaspoons kosher salt", "12 black peppercorns", "4 whole cloves", "1 1/2 cups cane vinegar, cider vinegar or white vinegar", "Juice of 1/2 lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine cabbage, onion, carrot, bell pepper, scallions, chiles, garlic, salt, peppercorns and cloves in a large bowl. Toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pack vegetables into a large (1 quart) jar with a tightfitting lid. Pour vinegar and lime juice over vegetables. Press down on vegetables if needed until they are completely submerged in liquid. Cover with lid and refrigerate for at least 3 days before opening. Stored covered in refrigerator, pikliz will last for at least 3 weeks, if not longer."}]}