{"@context": "http://schema.org", "@type": "Recipe", "name": "Olive Oil Béchamel", "description": "Here, a classic French sauce, revisited. Make sure the milk is cold or at room temperature. If the liquid is too hot, the roux won’t have time to properly disperse in the liquid before the mixture comes to a boil; this is what causes sauces to lump.\n\nThe main thing to watch for here is scorching. Stir often with a rubber spatula, especially at the bottom and edges of the pan, so that the mixture doesn’t stick and begin to burn. If it does, immediately pour the sauce into another pot and continue to cook over very low heat.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT20M", "recipeYield": "Makes 1 1/2 cups", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "extra virgin olive oil, flour, milk, shallot", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 84}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 168, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "0 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "413 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "2 tablespoons finely chopped shallot or onion (optional)", "2 tablespoons flour", "2 cups low-fat (1 percent) milk", "Salt to taste", "Freshly ground white or black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a heavy medium saucepan. Add the shallot or onion, and cook, stirring, until softened, about three minutes. Stir in flour, and cook, stirring, for about three minutes until smooth and bubbling but not browned. The paste should have the texture of wet sand. Whisk in the milk all at once, and bring to a simmer, whisking all the while, until the mixture begins to thicken. Turn the heat to very low, and simmer, stirring often with a whisk and scraping the bottom and edges of the pan with a rubber spatula, for 10 minutes, until the sauce has thickened and lost its raw flour taste. Season with salt and pepper. Strain while hot into a heatproof bowl or a Pyrex measuring cup."}]}