{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed and Seared Duck Breasts", "description": "Porchetta, a classic Italian pork dish, relies on a huge piece of meat (often the entire torso of a pig) and an incredibly aromatic combination of flavors — traditionally garlic, rosemary and fennel. It is fantastic, but it’s not simple, and it’s not fast. Indeed, one could argue that it’s easier to get to Siena, where I last ate it, than to make it oneself. This dish addresses two challenges beautifully. First, it has some of the beauty of porchetta in a neat, manageable little package. Second, it converts the often-boring duck breast into a convenient, delicious piece of meat simply by stuffing it with garlic, rosemary, fennel and in this case, Parmesan. The result is delicious and, when sliced, quite impressive looking. Not porchetta, but not bad for a weeknight, either. And cheaper than going to Siena.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/02/07/dining/07COOKING-STUFFEDDUCKBREASTS1/07COOKING-STUFFEDDUCKBREASTS1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, for two, lunch, roasts", "keywords": "duck breast, fennel seeds, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 113}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 149, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "19 grams", "saturatedFatContent": "2 grams", "sodiumContent": "221 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 boneless duck breast halves", "2 to 4 garlic cloves, finely chopped", "2 teaspoons fennel seeds, crushed", "2 teaspoons chopped fresh rosemary", "1/4 cup freshly grated Parmesan", "Extra virgin olive oil, as needed", "Salt and black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Use a sharp knife to slice into each duck breast half at thickest part to create a pocket the entire length of breast, being sure not to poke through the other end (If you'd like, score the skin as shown in the photo. Scoring renders the fat more thoroughly and keeps the skin from warping and sticking in the pan). In a bowl, mix together the garlic, fennel seeds, rosemary, Parmesan and olive oil until paste-like. Use your fingers to push herb mixture into each duck breast, filling pocket as much as possible. Sprinkle breasts with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat heavy, large, ovenproof skillet over medium-high heat. Add duck breasts skin side down and cook until nicely browned, about 10 minutes. Turn meat and transfer skillet to oven; roast 10 to 15 minutes for medium-rare. (An instant-read thermometer inserted into meat should read about 125 degrees.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove duck to a cutting board and let rest for 10 minutes. Carve on the bias into 1/2-inch pieces; serve with pan juices."}]}