{"@context": "http://schema.org", "@type": "Recipe", "name": "Coronation Chicken Salad", "description": "Back in 1953, long before the Los Angeles chef Roy Choi started making Korean tacos, a different kind of cross-cultural mash-up was minted in England as a way to celebrate the crowning of Queen Elizabeth II. Coronation Chicken, a dish with Indian flavors, has since “become a staple in the U.K.,” said Nicky Perry, whose almost-a-quarter-century-old West Village shrine to British food, Tea & Sympathy, serves it as the filling for one of the restaurant’s signature sandwiches. “There is such a huge Indian population in the U.K. that the two cuisines have become somewhat intertwined.” By now it is a mainstay of the American picnic basket, too, and its undercurrents of sweetness (from apricots and mango chutney) and spice (from curry powder) are easy to achieve. Use soft bread, so that the chicken salad doesn’t go squirting out the sides with each bite. And cutting off the crusts? Go right ahead. There is no shame in that.", "author": {"@type": "Person", "name": "Jeff Gordinier"}, "image": "https://static01.nyt.com/images/2015/04/15/dining/15CHEFRECIPE/15CHEFRECIPE-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "british", "recipeCategory": "brunch, dinner, lunch, salads and dressings, sandwiches", "keywords": "apricot, chicken breast, mango chutney, red wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 281}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 683, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "46 grams", "fiberContent": "3 grams", "proteinContent": "43 grams", "saturatedFatContent": "11 grams", "sodiumContent": "716 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 to 4 pounds bone-in, skin-on chicken breasts", "1 tablespoon olive oil", "Kosher salt, as needed", "Fresh black pepper, as needed", "2 tablespoons unsalted butter", "1 large yellow onion, diced", "1/2 cup red wine", "6 tablespoons mango chutney", "1/4 cup tomato purée", "3 tablespoons curry powder", "Juice of 1/2 lemon", "1 fresh or dried bay leaf", "1 cup mayonnaise", "3 ounces dried apricots, finely chopped (about 15 apricots)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Rub chicken on all sides with olive oil, season generously with salt and pepper and arrange on a rimmed baking sheet. Bake until skin is golden and meat is cooked through, about 45 minutes. Let chicken cool slightly, then remove skin and bones and chop meat into bite-size pieces. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the butter in a large saucepan over medium heat. Add the onion and sauté until translucent, 5 to 7 minutes. Add the red wine, mango chutney, tomato purée, curry powder, lemon juice and bay leaf and bring to a simmer. Continue simmering, stirring occasionally and adjusting heat as necessary, until sauce is quite thick, 8 to 10 minutes. Season to taste with salt and pepper; remove and discard bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer sauce to a large bowl and let cool to room temperature, then add the mayonnaise and stir to combine. Add the cooled chicken and the apricots and stir to coat them  in the sauce. Season to taste with salt and pepper. For sandwiches, spread the chicken salad on thick slices of English white bread or seven-grain bread. Cut off crusts if making finger sandwiches for tea."}]}