{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Roasted Stuffed Delicata Squash", "description": "Here is a vegetarian dinner course of impressive size and heft, to rival any stuffed chicken, turkey or loin of pork. The interior is a riff on a kale salad run through with croutons, dried cranberries, blue cheese and a spray of maple-scented pecans that complement the sweet flesh of the squash. You could use small sugar pumpkins for the main event, or really any sweet-fleshed winter squash, but delicata squash is our favorite option for reasons of taste and beauty. Unless you are serving it as a side dish, avoid the temptation to cut the squash vertically, to create boats for the stuffing. Boats are for side dishes. They are halves of a whole. For a main course, serve a squash per person, standing tall on each plate.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/11/03/dining/03COOKING_DELICATASQUASH/03COOKING_DELICATASQUASH-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 12 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "blue cheese, bread, kale, squash, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 371}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 339, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "8 grams", "proteinContent": "8 grams", "saturatedFatContent": "6 grams", "sodiumContent": "909 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 small delicata squash, about 1 pound each", "Kosher salt and ground black pepper, to taste", "Olive oil, for the baking sheet", "4 tablespoons unsalted butter", "2 medium onions, diced", "1 bunch red kale (about 1 pound), trimmed and chopped", "6 ounces whole-grain bread, cut into 3/4-inch cubes (about 3 cups), from a good-quality loaf", "1/2 cup crumbled blue cheese", "1/2 cup dried cranberries", "1/2 cup pecans, roughly chopped", "2 tablespoons maple syrup", "2 tablespoons chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 1 inch off the top and bottom of each squash. Use a melon baller or small spoon to scrape out the seeds. Sprinkle the inside of the squash with salt and pepper, then stand them upright on an oiled baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. In a large saucepan set over medium-high heat, melt 2 tablespoons of the butter. When it foams, add onions to pan and sauté, stirring frequently, until they begin to soften and turn translucent, approximately 6 to 8 minutes. Add kale to pan and continue to cook, tossing, until kale begins to wilt, about 5 minutes. Remove pan from heat and put vegetables into a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place bread cubes on a sheet pan and toast in the oven until they begin to crisp on the outside, approximately 7 to 9 minutes. Add bread cubes to the bowl with the vegetables, and then add blue cheese and cranberries. Stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pecans in a dry sauté pan set over medium heat and toast the nuts until they begin to darken and turn fragrant, approximately 4 to 6 minutes. Stir in maple syrup and allow to cook for 1 minute, then scrape into the bowl with the rest of the stuffing and toss to combine. Taste and season the mixture with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower oven temperature to 400 degrees. Divide the stuffing between the squash. Cut the remaining 2 tablespoons of butter into 6 pieces, and top each squash with a dot of butter. Roast squash until the flesh has softened and you can easily pierce it with a fork, approximately 45 minutes. If the squash is browning too quickly, lay a sheet of aluminum foil over the top to prevent burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle parsley over the squash. Serve 1 whole squash per person as a main course, or 1/2 squash or less as a side dish."}]}