{"@context": "http://schema.org", "@type": "Recipe", "name": "Meera Sodha’s Chicken Curry", "description": "This simple curry serves as a fine introduction to the Indian home cooking of Meera Sodha, a British cookbook author whose “Made in India: Recipes From an Indian Family Kitchen” was released in 2015. The recipe for this curry, her \"ultimate comfort food,'' derives from the one her Indian-born mother cooked for Sodha when she was growing up in Lincolnshire and for which she pined for during her college years in London. It provides a thick, gingery, garlic-flecked tomato sauce with deep notes of cinnamon and cumin, and a low flame of chile heat, surrounding small chunks of skinless chicken thigh, with slivered almonds scattered over the top at the end. If you’ve ever cooked a ragù for spaghetti, or made a beef stew, you’ll have no problem making it at all. Only the spices are different.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/10/18/magazine/18eat1/18mag-18eat-t_CA1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "weeknight", "keywords": "chicken, curry, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1952}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 694, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "4 grams", "proteinContent": "41 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1008 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons unsalted butter or ghee", "1 tablespoon neutral oil, like canola", "1 teaspoon cumin seeds", "2 cinnamon sticks, approximately 2 inches long", "2 large white or yellow onions, peeled and finely chopped", "1 2 1/2-inch piece of ginger, peeled and grated or minced", "6 cloves of garlic, peeled and crushed", "2 green cayenne or jalapeño peppers, stemmed, seeded and cut into half-moons", "Kosher salt, to taste", "3/4 cup plus 2 tablespoons puréed tomatoes", "2 tablespoons tomato paste", "1 1/2 teaspoons ground cumin", "1/2 teaspoon ground turmeric", "3 tablespoons whole-milk yogurt, plus 1 cup to serve with the meal", "1 3/4 to 2 pounds skinless, boneless chicken thighs, cut into 1-inch chunks", "3 tablespoons slivered almonds", "1 teaspoon garam masala", "Pinch ground cayenne pepper, or to taste."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter or ghee in the oil in a large Dutch oven set over medium heat, and when it is hot and shimmering, add the cumin seeds and cinnamon sticks. Cook for a minute or two, stirring often, to intensify their flavors, then add the onions. Cook, stirring occasionally, until they are golden, approximately 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the ginger, garlic and peppers into a mortar and pestle with a pinch of salt, and smash them together into a coarse paste. (You can also do this on a cutting board, with a knife.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the paste to the onions, and cook for 2 minutes or so, then pour in the tomatoes, and stir. Allow to cook for an additional 2 to 3 minutes, then add the tomato paste, ground cumin, ground turmeric and another pinch of salt, and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the yogurt slowly to the mixture, using a wooden spoon to whisk it into the sauce. It may be quite thick. When it begins to bubble, add the chicken. Lower the heat, put the lid on the Dutch oven and allow the curry to cook gently for 30 minutes or so, or until the chicken is cooked through. Add the almonds and the garam masala, along with a pinch of cayenne, and cook for 5 minutes more or so. Serve with basmati rice or naan, and the additional yogurt."}]}