{"@context": "http://schema.org", "@type": "Recipe", "name": "Collard Greens Tagine With Flageolets", "description": "I call the dish a tagine because it tastes like a Tunisian stew; its warm triumvirate of spices — coriander, cumin and caraway — are always present in the classic Tunisian spice mix called tabil. It is inspired by the Tunisian tagines I make to serve with couscous, but I served this instead with whole grain flatbread. Since my version is vegetarian, I cooked the onions and fennel in olive oil before adding them to the beans so the dish would have a bit of fat and the vegetables would have more flavor.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/04/01/dining/01MARTHA/01MARTHA-articleLarge.jpg", "totalTime": "PT8H", "recipeYield": "6 servings", "recipeCuisine": "african", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "collard greens, fennel, flageolet beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 120}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 90, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "362 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound (about 1 1/8 cups) dried flageolets, soaked at least 6 hours in 1 quart water, then drained (use small white beans if you cannot get flageolets)", "1 large onion", "4 large garlic cloves; 2 crushed, 2 minced", "1 teaspoon coriander seeds", "1 teaspoon caraway seeds", "2 teaspoons cumin seeds", "2 tablespoons extra-virgin olive oil", "1 pound (about 1 large) fennel bulb, cored and diced, fronds chopped and reserved for garnish", "Salt to taste", "1 teaspoon paprika or Aleppo pepper", "1 large jalapeño, minced (about 2 tablespoons)", "2 tablespoons tomato paste", "1 pound (about 1 generous bunch) collard greens", "1 large bunch cilantro, chopped (about 1 cup), plus additional for garnish", "2 tablespoons minced preserved lemon (optional)", "Cooked grains or couscous, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer drained beans to a large, heavy flameproof casserole or Dutch oven. Cut onion in half; cut one of the halves in half and chop the rest. Set aside chopped onion and add quarters to pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 5 cups water (6 if serving over grains or couscous), and crushed garlic cloves to casserole, and bring to a gentle boil over medium-high heat. Skim off foam, cover and reduce heat to low. Simmer 45 minutes. Using tongs, remove onion and garlic cloves and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small skillet or saucepan over medium-high heat, toast coriander, caraway and cumin seeds together just until they begin to release their aroma, 2 to 3 minutes. Transfer immediately to a spice mill and allow to cool for a few minutes, then grind."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil over medium heat in a large heavy skillet and add remaining onion. Cook, stirring, until tender, about 5 minutes. Add minced garlic, diced fennel and a generous pinch of salt and cook, stirring often, another 5 minutes, until fennel has softened slightly. Stir into beans. Add ground spices, paprika, additional salt (I use about 11/2 teaspoons), jalapeño and tomato paste and return to a simmer. Cover and simmer 30 minutes. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, stem and wash collard greens. Cut leaves in half down the middle. Stack and roll up several leaves, and cut crosswise into 1/2-inch strips. You should have about 5 cups of greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add collard greens to beans and vegetables. Bring back to a simmer, cover and simmer 15 to 30 minutes, until greens and beans are tender. Stir in cilantro and chopped fennel fronds and simmer another 5 minutes. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle into wide soup bowls. If using preserved lemons, place a teaspoonful on each serving, for guests to stir in. Garnish with chopped cilantro or a combination of chopped cilantro and fennel, and serve."}]}