{"@context": "http://schema.org", "@type": "Recipe", "name": "Tofu Mushroom Soup", "description": "For a full meal in a bowl, serve this deeply flavorful soup with warm brown rice or noodles.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/02/10/dining/10MARTHA/10MARTHA-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, button mushrooms, cremini, garlic, ginger, porcini, shiitake, tofu, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 212}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 134, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "1 gram", "sodiumContent": "591 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce dried mushrooms (about 1 cup), preferably porcinis", "1/2 pound fresh shiitake mushrooms", "1/2 pound fresh button or cremini mushrooms, quartered", "1 head of garlic, cut in half crosswise", "2 teaspoons salt, or to taste", "6 slices fresh ginger, from the widest part of the root", "2 tablespoons soy sauce", "14 to 16 ounces tofu (1 box), either firm or soft, cut in 1-inch dice", "1/2 cup chopped cilantro", "2 tablespoons chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dried mushrooms in a bowl or large heatproof measuring cup and cover with 2 cups boiling water. Let sit for 30 minutes. If mushrooms are sandy, agitate from time to time. Line a strainer with cheesecloth and place over a 1-quart measuring cup. Drain through the strainer, then twist mushrooms in the cheesecloth, holding them over the strainer, to squeeze out the last of the flavorful liquid. Discard reconstituted mushrooms or set aside for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While porcinis are soaking, pull tough stems away from shiitake mushroom caps. Slice caps thin and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the mushroom broth with enough water to make 9 cups liquid and place in a saucepan or soup pot. Add shiitake stems, quartered button or cremini mushrooms, halved head of garlic, salt and ginger slices, and bring to a boil. Reduce heat, cover and simmer 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a slotted spoon or skimmer to remove mushrooms, stems, garlic and ginger from broth. Add soy sauce to broth. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring broth back to a boil and add tofu. Reduce heat to a simmer or a gentle boil, cover partly and simmer for 30 minutes. Tofu will puff a little, and texture will become more porous and spongy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add thinly sliced shiitake mushroom caps, cover and simmer 5 minutes. Stir in cilantro and chives. Taste, adjust seasoning and serve."}]}