{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Sweet Potatoes With Horseradish Butter", "description": "This recipe plays velvety, honeyed roasted sweet potatoes against the sharp bite of a fresh horseradish and herb compound butter.  It’s a great dish for feeding a crowd at Thanksgiving or another gathering. You can roast the potatoes and make the horseradish butter ahead, then pop them into the oven just 15 minutes before serving, while the turkey rests. If you can’t find fresh horseradish, substitute another aromatic ingredient like garlic, fresh ginger or scallions, adjusting the quantities to taste. You'll need less ginger and garlic than you would horseradish, and probably the same amount of scallions. Taste as you go.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/11/12/multimedia/clark-sweet-potato/clark-sweet-potato-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 170}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 164, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "6 grams", "sodiumContent": "147 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 tablespoons unsalted butter, at room temperature", "1/4 cup finely grated fresh horseradish, plus coarsely grated horseradish for garnish if desired", "3 tablespoons chopped fresh parsley, more for garnish", "3 tablespoons chopped fresh dill, more for garnish", "3 tablespoons panko bread crumbs", "Finely grated zest and juice of 1/2 lemon", "1/2 teaspoon kosher salt", "1/4 teaspoon black pepper", "2 pounds sweet potatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy-duty resealable plastic bag, combine butter, horseradish, parsley, dill, panko, lemon zest and juice, salt and pepper. Close the bag, pressing out most of the air. Mash everything together until well combined and smooth, then use a ruler or the back edge of a knife to scrape and work the butter to the bottom of the bag so it forms a log, rolling it as you go. Refrigerate for at least 2 hours to firm up, or up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Prick sweet potatoes several times with a fork and wrap tightly in aluminum foil. Transfer to a baking sheet and roast until potatoes are tender, 45 minutes to 1 1/2 hours, depending on the size of the potatoes. Once cool enough to handle, unwrap and slice into 1/2-inch-thick rounds (there is no need to peel unless you dislike the skins). Potatoes can be roasted up to 2 days ahead; wrap and chill, then slice them just before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange rounds on a large rimmed baking sheet and count how many you have. Slice enough thin slabs of butter from the log so that you have one per potato slice, and place butter on top of potato slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the oven rack so that it's 4 inches away from the broiler. Bake potatoes at 350 degrees until they are heated through and the butter is softened, 5 to 15 minutes depending upon how cold the potatoes were. Adjust oven temperature to broil, and broil until the butter is golden brown at the edges, 2 to 4 minutes. Serve garnished with herbs and fresh horseradish if you like."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Roasted Sweet Potatoes", "description": "Melissa Clark makes a savory sweet potato dish with horseradish compound butter.", "thumbnailUrl": "https://static01.nyt.com/images/2015/11/12/multimedia/clark-sweet-potato/clark-sweet-potato-mediumThreeByTwo440.jpg", "uploadDate": "2015-11-13T21:12:17.000Z", "duration": "PT2M34S"}}