{"@context": "http://schema.org", "@type": "Recipe", "name": "Sausage Rolls", "description": "Though the concept of sausage wrapped in pastry exists in every cuisine in one way or another, the British have claimed sausage rolls as their own. They are always welcome, especially at holiday time. Boxing Day, a national holiday in Britain, celebrates the traditional post-Christmas servants’ day off, when upper-class families were forced to fend for themselves and subsist for a day on a lavish buffet of leftover feasts from the week. Sausage rolls are often part of the spread.\n\nA pleasantly spiced homemade sausage mixture is easy to make up with a pound or two of ground pork shoulder, not too lean. They are usually made with all-butter puff pastry (often frozen store-bought, a good option); these are wrapped in a very flaky lard and butter pastry. Both the pastry and the sausage filling can be made a day ahead.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/12/24/dining/24KITCHEN1/24KITCHEN1-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "24 sausage rolls", "recipeCuisine": "", "recipeCategory": "dinner, lunch, sausages", "keywords": "main course, pork lard, pork shoulder, puff pastry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 357}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 147, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "0 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "122 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups/250 grams all-purpose flour, more for dusting", "1/2 teaspoon salt", "4 tablespoons/50 grams pork lard", "4 ounces/113 grams cold unsalted butter (1 stick), cut in 1/4-inch cubes", "1/2 cup /118 milliliters ice water", "2 pounds/900 grams pork shoulder, not too lean, ground coarse", "2 teaspoons kosher salt", "1/2 teaspoon black pepper", "Pinch of cayenne", "1/2 teaspoon ground coriander", "1/4 teaspoon nutmeg", "1/4 teaspoon mace", "2 teaspoons chopped thyme", "2 tablespoons chopped sage", "2 tablespoons chopped parsley", "1 egg, beaten, for egg wash"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: Put flour and salt in a mixing bowl. Work in lard with fingertips until completely absorbed. Add butter cubes and ice water and mix with a wooden spoon to form a sticky dough. Dust dough with flour and pat into a rough square about 1 inch thick. Wrap and refrigerate for at least 1 hour, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sausage filling: Put pork in a mixing bowl. Add salt, pepper, cayenne, coriander, nutmeg, mace, thyme, sage and parsley. Working quickly with wet hands, incorporate seasoning evenly. Divide mixture into 4 equal pieces (1/2 pound each) and roll each piece into a 9-inch sausage length. Cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Roll pastry into a rectangle 9 inches by 24 inches. Cut rectangle in half lengthwise and crosswise to form four rectangles 4 1/2 inches by 12 inches. Lay 1 sausage in the center of each rectangle and moisten 1 of the long edges with a bit of water. Wrap dough around sausage and press edges together to make a log. With the seam side down, cut each log into 6 pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two baking sheets with parchment paper. Arrange 12 pieces on each sheet and brush each piece well with egg wash. Bake for 20 to 25 minutes, until pastry is crisp and golden and sausage is cooked. Cool for 5 minutes before serving, or serve at room temperature."}]}