{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Chicken Thighs with Oranges, Fennel and Green Olives", "description": "It's important to use smaller chicken thighs; if all you can get are the larger ones, it's best to cut them in half. If you don't have Maras pepper, it's worth buying, since its distinctive flavor will add depth and a sly heat to all kinds of dishes.", "author": {"@type": "Person", "name": "John Willoughby and Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2015/10/21/dining/21BROIL1/21BROIL-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken thighs, green olives, Maras pepper, orange, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 444}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "465 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 bulb fennel, cored and thinly sliced", "1 small red onion, thinly sliced", "2/3 cup pitted green olives, halved", "1 tablespoon minced garlic", "1 tablespoon Maras pepper (or substitute 2 teaspoons paprika plus 1 teaspoon hot pepper flakes)", "3 tablespoons extra-virgin olive oil", "Kosher salt", "Cracked black pepper", "1 orange, cut into eighths, but not peeled", "8 smallish (about 5 ounces each) bone-in chicken thighs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler (to high if you have the option)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the fennel, onion, olives, garlic, Maras pepper and 2 tablespoons oil in a large bowl, sprinkle with salt and pepper and toss gently. Spread this mixture in a 9-by-12-inch baking dish or disposable foil pan and scatter orange sections on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken and remaining tablespoon of oil to the now-empty bowl, sprinkle with salt and pepper, and toss to coat. Place thighs on top of fennel mixture, skin side down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place under broiler with pan about 4 inches from the flame and broil for 10 minutes, turning pan front to back after 4 minutes. Turn chicken skin side up and continue to broil, switching pan back to front after about 3 minutes and broiling until the skin is crisp and dark brown and the chicken is opaque throughout (or until center of flesh registers 165 degrees on instant-read thermometer), 5 to 7 minutes more. Serve with crusty bread or couscous to soak up the juices."}]}