{"@context": "http://schema.org", "@type": "Recipe", "name": "Halvah", "description": "Wheels of halvah — a soft, fudgelike candy made out of sesame paste — is an iconic sight in Middle Eastern markets. But it’s also extremely easy to make at home, as long as you have access to a good brand of tahini (the only ingredient should be sesame seeds) and a candy thermometer. This recipe is adapted from the cookbook “Zahav: A World of Israeli Cooking,” by the chef Michael Solomonov. Eat it on its own cut into little pieces with a cup of tea, or dip cubes of it in chocolate and top with sesame seeds to serve as an elegant confection at the end of a fancy dinner party.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/10/07/dining/07COOKBOOK2/07COOKBOOK2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "24 servings", "recipeCuisine": "middle eastern", "recipeCategory": "candies", "keywords": "dessert, tahini, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 191}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "22 milligrams", "sugarContent": "17 grams", "transFatContent": null}, "recipeIngredient": ["2 cups granulated sugar", "1/2 vanilla bean, scraped", "Zest of 1 lemon", "1 1/2 cups tahini", "Pinch kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 8- x 8-inch baking pan with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine sugar, vanilla seeds and lemon zest with 1/2 cup water in a saucepan over medium heat, stirring to dissolve sugar. Allow mixture to simmer into a syrup, without stirring, until temperature registers 245 degrees on candy thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While syrup is cooking, place tahini and salt in bowl of a stand mixer fitted with paddle. Beat on medium speed. Carefully stream syrup into tahini with mixer running. Mix until syrup is incorporated and mixture begins to pull away from sides of bowl, about 30 seconds to 1 minute. Be careful not to overmix. The halvah texture should be fudgelike, not sandy. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly with a heatproof spatula, transfer mixture to the prepared pan. Place another piece of parchment on top and use your hands on top of the parchment to smooth out halvah. Cool completely to room temperature and cut into squares. Store at room temperature, well wrapped in plastic, for a week."}]}