{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Oysters and Tomato Butter", "description": "These oysters are a good way to start a festive meal. One reason is that oysters seem to have built-in festivity — even when they were abundant to the point of local glut, they were eaten happily in bars that served only them, festively. The part of this recipe that requires any skill or focus is the shucking. This is a good skill to have anyway, and can't be gotten other than by practicing, meaning an hors d'oeuvre that is both nice for your guests and an exercise in self-edification. Once they’ve been opened, the oysters need little other attention.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2014/12/21/magazine/21eat/21eat-articleLarge-v2.jpg", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "finger foods", "keywords": "appetizer, oyster, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 57}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 229, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "0 grams", "proteinContent": "15 grams", "saturatedFatContent": "8 grams", "sodiumContent": "437 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup whole peeled tomatoes, juices drained and saved for soup", "Rock salt", "12 small to medium oysters, like Island Creeks or Montauk Pearls", "1/4 cup (1/2 stick) unsalted butter, warmed to room temperature", "2 tablespoons finely chopped shallot or red onion"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to high. In a small roasting dish or toaster pan, roast the tomatoes for 10 to 12 minutes on the highest rack, until they’re blackened in places."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread enough rock salt onto a baking sheet to make a layer into which oysters will firmly sit. While the tomatoes are roasting, shuck the oysters by holding a dish towel in your nondominant hand, and holding the oyster around its rounded tip, with its cup side down, on a counter, then inserting an oyster knife into its hinge, wiggling it in entirely until the hinge gives, and then moving it around. (Even better,  <a href=\"http://www.nytimes.com/video/dining/100000003068236/cooking-techniques-shucking-an-oyster.html?playlistId=100000003066037&region=video-grid&version=video-grid-headline&contentCollection=&contentPlacement=21&module=recent-videos&action=click&pgType=Multimedia&eventName=video-grid-click\">watch our video</a> on how to shuck, several times, and then approach the task confidently.) Detach each oyster from its bottom shell. As each is done, secure it in a little well in the rock salt, so that it retains its oyster liquor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving the broiler on high, combine the roasted tomatoes with the butter in a blender or food processor or with an immersion blender or with a lot of elbow grease. The resulting mixture will be mottled and ugly but will melt to glossy perfection. Stir in the shallot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 1/2 teaspoon dollop of tomato butter into each oyster. Place the tray into the oven, and broil until the tomato butter is melted and the oyster is beginning to darken and curl around its edges, around 8 to 12 minutes. Serve very hot, immediately."}]}