{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Mussels in Tomato Sauce", "description": "Semolina linguine is a traditional and wonderful pasta to use. But you can make the dish with whole-wheat or gluten-free pasta; both are getting better and better. Look for a flat noodle like tagliatelle, fettuccine or linguine.\n\nIf you use whole-wheat or gluten-free pasta, make sure not to overcook it. My rule of thumb is to check for doneness a minute before the suggested cooking time on the package; noodles should be cooked al dente.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/03/25/dining/25MARTHA/25MARTHA-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pastas", "keywords": "linguine, mussels, tomatoes, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 312}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 626, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "5 grams", "proteinContent": "40 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1095 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 can chopped or whole tomatoes (14.5 ounces)", "3 fat garlic cloves; 1 crushed, 2 minced", "1 shallot, chopped", "1/2 cup dry white wine", "2 pounds mussels, rinsed, scrubbed and beards removed", "2 tablespoons extra-virgin olive oil", "1/4 teaspoon red pepper flakes", "2 teaspoons chopped fresh thyme or marjoram, or both", "Pinch sugar", "Salt to taste", "3/4 pound linguine or other pasta", "1/4 cup chopped flat leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse tomatoes with juices in food processor just a few times to break down into a coarse purée; set aside. Bring large pot of water to boil for pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a wide skillet or saucepan with lid, combine crushed garlic clove and shallot with white wine. Bring to a boil and add mussels. Cover and cook, shaking pan from time to time, 2 to 4 minutes, or until mussels open up. Check mussels after 2 minutes; transfer open mussels to a bowl using tongs. Cover pan again, wait another minute, and repeat until all mussels have opened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leave mussels to cool in bowl until easily removed from shells. Remove half from shells and leave other half intact. Taste a mussel; if it is sandy, give them all a very quick rinse and drain in a colander. Transfer to a bowl and keep covered while you make tomato sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a strainer over another bowl, line with cheesecloth and strain the liquid in the pan into bowl. Reserve 1/2 cup. Rinse and dry pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil over medium heat in pan and add minced garlic and red pepper flakes. Cook, stirring, just until fragrant, about 30 seconds to 1 minute. Add tomatoes, thyme or marjoram (or both), and sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat up to medium-high and cook, stirring often,  5 to 10 minutes, until tomatoes have cooked down slightly. Add 1/2 cup broth from mussels, stir together and bring to a simmer. Taste and add salt as needed (you may not need to add any). Tip all mussels, shelled and unshelled, into sauce, cover and turn heat to very low or remove from heat if not serving right away. Keep warm while you cook pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm a large bowl for the pasta. When water for pasta comes to a rolling boil, salt generously and add pasta. Cook al dente, following the directions on the package. Drain and toss in the warm bowl with tomato sauce, mussels and parsley. Serve right away."}]}