{"@context": "http://schema.org", "@type": "Recipe", "name": "Springtime Spaghetti Carbonara", "description": "This lighter, brighter version of the classic Italian pasta dish is adapted from one found in “Almost Meatless: Recipes That Are Better for Your Health and the Planet” by Joy Manning and Tara Mataraza Desmond. It is incredibly simple – if you can chop vegetables, boil water and whisk eggs, you can make this dish – but it's also indubitably luxurious. Everyone will think you slaved for hours when, really, you slaved for about 20 minutes. Timing is everything in this recipe, so be sure to bring your eggs to room temperature before you start, and have all of the ingredients ready before you toss the pasta in the water.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2016/03/21/dining/21COOKING_SPAGHETTICARB2/21COOKING_SPAGHETTICARB2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, weekday, pastas", "keywords": "main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1788}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "19 grams", "saturatedFatContent": "3 grams", "sodiumContent": "447 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 slices bacon, cut into 1/4-inch pieces", "1/2 pound English peas, shelled (about 1 cup), or 1/2 cup frozen peas", "1 pound spaghetti", "4 ounces asparagus, sliced diagonally 1/8-inch thick (1 cup)", "10 fresh basil leaves, sliced thin", "5 eggs, whisked, at room temperature", "2 tablespoons whole milk", "1/2 cup freshly grated Parmesan cheese, plus extra for garnish (2 ounces)", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a sauté pan over medium heat and add the bacon, cooking for about 5 minutes, until crispy. Transfer the cooked bacon with a slotted spoon to a paper towel and set aside. Return the pan with the rendered fat to the stove top for future use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to a boil. Drop the peas into the water and cook them for 5 minutes. Transfer them to a strainer with a slotted spoon or a spider basket. Add the pasta to the boiling water and cook for 10 minutes, or until al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, heat the bacon fat in the sauté pan over medium heat. Add the peas and asparagus, and sauté for about 5 minutes. Remove from the heat, stir in the basil, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the eggs and milk. Have the egg mixture, vegetables and bacon ready to toss with very hot pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly drain the pasta and transfer immediately to a large serving bowl. Pour the eggs and cheese on top of the pasta, and toss vigorously to coat the strands and gently cook the eggs, forming a creamy sauce. Add the vegetables and bacon, and continue tossing to incorporate them. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion the spaghetti on plates and ladle any sauce left in the bowl over each serving. Grate additional cheese on top if you like."}]}