{"@context": "http://schema.org", "@type": "Recipe", "name": "Feijoada", "description": "The mix of meats is personal to each cook. Have your butcher cut the feet and tails for you; they’re highly recommended for their rich gelatin and ‘‘piggy’’ flavor, but if you prefer, you can use more sausage, fresh pork belly or other cuts instead. Don’t be tempted to use too many smoked meats, though; the feijoada’s flavor should be beany and porky, not smoky.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2015/05/31/magazine/31eat6/31eat6-articleLarge-v2.jpg", "totalTime": "PT3H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "brazilian", "recipeCategory": "dinner", "keywords": "black beans, pork, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "recipeIngredient": ["2 pounds dry black beans (unsoaked)", "1 3/4 pounds skin-on unsmoked pigs' feet, split, cut into 2-inch pieces", "3/4 pound pigs' tails, cut into 2-inch pieces", "1/2 pound skin-on pork tongue, cut into 1 1/2-inch pieces", "3/4 pound skin-on slab bacon, cut into 1/4-inch slices", "2 bay leaves", "1 pound smoked pork sausage (andouille or kielbasa), cut into 1/4-inch slices", "3 tablespoons vegetable oil", "1 large onion, medium dice", "10 cloves garlic, minced", "Salt", "Cooked white rice, for serving", "Orange slices, for serving", "Farofa (optional, <a href=\"http://cooking.nytimes.com/recipes/1017434-farofa\">see recipe</a>)", "Brazilian collard greens (optional, <a href=\"http://cooking.nytimes.com/recipes/1017435-brazilian-collard-greens\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beans, feet, tails, tongue, bacon and bay leaves in a heavy pot. Cover with water by 1 inch, about 10 cups. Bring to a boil over high heat, stirring occasionally. Skim any foam that comes up. When the mixture boils, turn heat down to a gentle simmer. Skim foam for the first 40 minutes. Turn heat down to a low simmer, and cover with a lid. Occasionally add water to keep it covered by 1/2 inch, and give it a stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Two to 2 1/2 hours later, the beans and meats should be quite tender but not falling apart. Add the sausage, and simmer for another 30 to 40 minutes, until meats are very tender and the stew is rich but not stiff (thin with water if necessary). During this final cooking time, stir to break up some of the beans; their starch will make the stew creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of vegetable oil in a large skillet over medium-low heat until shimmering. Cook onion, stirring, for 15 minutes, until evenly browned and very sweet. Turn heat up to medium-high, and add remaining oil and garlic. Cook, stirring, until the garlic is golden, about 3 minutes. Bring beans back to a boil over high heat, stir in the onion mixture, season to taste with salt and serve with white rice, orange slices, farofa (<a href=\"http://cooking.nytimes.com/recipes/1017434-farofa\">see recipe</a>) and Brazilian collard greens (<a href=\"http://cooking.nytimes.com/recipes/1017435-brazilian-collard-greens\">see recipe</a>)."}]}