{"@context": "http://schema.org", "@type": "Recipe", "name": "Zucchini Parmesan", "description": "This is a simple layered casserole with three elements: roasted zucchini, a really good homemade tomato sauce and Parmesan. Roasting, rather than frying the zucchini, allows you to cut down on olive oil and time.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/07/15/dining/15MARTHA/15MARTHA-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, casseroles", "keywords": "main course, tomato, zucchini", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1642}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 206, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "862 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["2 to 2½ pounds fresh ripe tomatoes", "1 tablespoon extra-virgin olive oil", "1 small onion, chopped", "2 to 4 garlic cloves (to taste)", "Salt and pepper", "1/8 teaspoon sugar", "2 sprigs fresh basil", "1 tablespoon chopped fresh basil", "2 to 2¼ pounds zucchini", "Salt and pepper", "3 tablespoons extra-virgin olive oil", "1/2 to 1 teaspoon red pepper flakes (pepperoncini), to taste", "3/4 cup freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have a food mill, quarter tomatoes. If not, peel, seed and chop them. (See step 5.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make tomato sauce, heat 1 tablespoon olive oil in a large, heavy skillet over medium heat and add onion. Cook, stirring often, until tender, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic. Cook, stirring, until fragrant, 30 seconds to a minute, and add tomatoes, salt, pepper, sugar and basil sprigs. Increase heat to medium-high. When tomatoes are bubbling briskly, stir and reduce heat to medium. Cook, stirring often, until tomatoes have cooked down and are beginning to stick to pan, 15 to 25 minutes, depending on consistency. Remove basil sprigs; taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Line 2 sheet pans with parchment. Trim ends off zucchini and cut in half crosswise, then into lengthwise slices, about 1/4 to 1/3 inch thick. Season on both sides with salt and pepper and toss with 2 tablespoons olive oil. Arrange zucchini slices on baking sheets in one layer and sprinkle with red pepper flakes. Roast for 12 minutes, until lightly browned and easily pierced with a knife. Remove from oven and reduce heat to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a food mill, put sauce through medium blade. If not, pulse sauce in a food processor fitted with steel blade until just coarsely puréed. Stir in chopped basil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the dish, oil a 2-quart gratin with olive oil. Spread 1/4 cup tomato sauce over bottom of dish. Arrange a third of the zucchini in an even layer over tomato sauce. Spoon a third of remaining sauce over zucchini and sprinkle with 1/4 cup Parmesan. Repeat with 2 more layers, ending with 1/4 cup Parmesan. Drizzle on remaining tablespoon olive oil. Bake 30 to 35 minutes, until bubbling and browned on the top and edges. Remove from heat and allow to sit for 5 to 10 minutes before serving."}]}