{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Risotto with Summer Squash", "description": "Lemon risottos of any kind always delight guests. The lemon juice and zest are added to this comforting mixture at the end of cooking.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/08/26/health/nutrition/26recipehealth/26recipehealth-articleLarge-v3.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "arborio or carnaroli rice, chicken stock, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 276}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 403, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "16 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1116 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["7 to 8 cups well seasoned chicken or vegetable stock, as needed", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "Salt to taste", "1 pound summer squash (mixed varieties), diced", "1 1/2 cups arborio or carnaroli rice", "1 to 2 garlic cloves (to taste), green shoots removed, minced", "Freshly ground pepper to taste", "1/2 cup dry white wine, like pinot grigio or sauvignon blanc", "2 teaspoons finely chopped lemon zest", "1 to 2 tablespoon freshly squeezed lemon juice (to taste)", "2 tablespoons finely chopped flat-leaf parsley", "1/2 cup freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan, and bring it to a simmer over low heat with a ladle nearby or in the pot. Make sure that the stock or broth is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy nonstick skillet. Add the onion. Cook, stirring, until tender, about five minutes. Add the squash and a generous pinch of salt. Turn the heat up to medium high, and cook, stirring often, until the squash is translucent but not too soft, about five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the rice and the garlic, and stir until the grains separate and begin to crackle. Add the wine, and stir until it has been absorbed. Turn the heat back down to medium, and begin adding the simmering stock a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until the rice is just about absorbed. Add another ladleful or two of the stock, and continue to cook in this fashion, stirring in more stock when the rice is almost dry. You do not have to stir constantly, but stir often."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rice is tender all the way through but still chewy, in about 25 minutes, it is done. Taste now and adjust seasoning, adding salt and pepper to taste. Add another ladleful of stock to the rice. Stir in the lemon zest, lemon juice, parsley and Parmesan. Remove from the heat. The mixture should be creamy (add more stock if it isn’t). Serve right away in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}]}