{"@context": "http://schema.org", "@type": "Recipe", "name": "Pork Belly Tea Sandwiches", "description": "These sandwiches are not dainty pinkie-in-the-air nibbles, but hefty pork belly tea sandwiches that cater to hearty appetites and cold beer. Zak Pelaccio, the chef and an owner of Fatty Crab, a Malaysian street food cafe on the edge of the meatpacking district, got the idea for them from the afternoon English tea services he enjoyed when he lived in Malaysia. \n\nWith each bite the sandwiches offer richness, salt and spice, the components that make game day food so satisfying. Southeast Asian chili sauce, two kinds of soy sauce and streaky pork fat heighten the taste.\n\nAnd they are a cinch to make. Just marinate, braise then pile the meat onto big slices of dense supermarket white bread that have been slathered with spicy mayonnaise. They can be made in advance and wrapped and refrigerated for a couple of hours before serving.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/03/24/dining/pork-belly-tea-sandwiches/pork-belly-tea-sandwiches-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "12 sandwiches, 36 pieces", "recipeCuisine": "malaysian", "recipeCategory": "dinner, lunch, sandwiches", "keywords": "chinese black vinegar, pork belly, scallion, sweet soy sauce, thai chili paste, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 333, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1041 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/3 cup sweet soy sauce (kecap manis)", "4 tablespoons Chinese black vinegar", "2 tablespoons dark soy sauce", "2 tablespoons Asian fish sauce", "Juice of 1 lime", "1 2-pound piece fresh pork belly, with skin", "2 bunches scallions", "Salt", "½ cup rice vinegar", "1 ½ cups mayonnaise", "1 clove garlic, put through a press", "2 teaspoons Thai chili paste (sambal oelek) or sriracha (chili sauce)", "24 slices thick white bread", "24 large sprigs cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine kecap manis, black vinegar, soy sauce, fish sauce and lime juice. Place pork belly in a heavy 1-gallon freezer bag with zip closure. Pour soy sauce mixture in, close bag, place in another freezer bag to prevent leaking, and refrigerate at least 24 hours, turning from time to time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, heat oven to 225 degrees. Place pork skin side up in a roasting pan with a close fit, pour in marinade, add about 1/3 cup water so liquid comes halfway up sides of pork. Cover with a sheet of parchment, then tightly cover with foil. Place in oven and roast about 3 hours, until a skewer inserted in pork meets little or no resistance. Allow to cool in pan about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pork cooks, trim scallions, discarding all but about an inch of green, and slice very thin at an angle. Place in a bowl, toss with a little salt, and pour rice vinegar over. Cover and allow to marinate at least 2 hours. In a separate bowl mix mayonnaise with garlic and sambal oelek."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pork has cooled, remove skin. Cut pork in 4-inch-long chunks and cut each into very thin slices. You should be able to make at least 36 4-inch slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bread on a work surface and spread each piece with mayonnaise mixture. Drain scallions and scatter them over half the bread slices. Top each of these with 3 slices pork lined side by side in a single layer. Place 2 cilantro sprigs on pork, then cover with remaining bread, mayonnaise side down. Trim crusts from each sandwich. Leave sandwiches whole or cut each into thirds, between the slices of pork, and serve."}]}