{"@context": "http://schema.org", "@type": "Recipe", "name": "Gjelina’s Roasted Yams", "description": "These roasted yams are adapted from a recipe that Travis Lett, the chef and an owner of Gjelina in Venice, Calif., published in a 2015 cookbook devoted to the restaurant’s food. They are a marvelous accompaniment to a roast chicken, but they are maybe even better as a platter to accompany a salad of hearty greens, cheese and nuts. What makes them memorable is a technique Lett calls for during the cooking: tossing the tubers in honey before roasting them, which intensifies their caramelizing. The crisp, near-burned sweetness works beautifully against the heat of the pepper and the acidic creaminess of the yogurt you dab onto the dish at the end. It is a simple dish, but it results in fantastic eating.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/02/21/magazine/21eat/21mag-21eat-t_CA1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 3-6", "recipeCuisine": "", "recipeCategory": "", "keywords": "greek yogurt, yams, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 936}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 204, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "301 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["3 large yams", "2 tablespoons honey", "1 tablespoon Espelette pepper, or crushed red-pepper flakes", "3 tablespoons extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "1/2 cup Greek-style yogurt", "4 tablespoons fresh lime juice, approximately 2 limes", "2 scallions, both green and white parts, trimmed and thinly sliced, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425. Cut the yams lengthwise into 4 wedges per yam. Put them in a large bowl, and toss them with the honey, ½ tablespoon of the Espelette pepper or crushed red-pepper flakes and 2 tablespoons of the olive oil. Let it sit for 10 minutes or so, tossing once or twice to coat, as the oven heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the yams to a foil-lined, rimmed baking sheet, season with salt and pepper and then bake until they are deeply caramelized around the edges and soft when pierced with a fork at their thickest part, approximately 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the yams roast, combine the yogurt, lime juice and remaining tablespoon of olive oil in a small bowl, and whisk to combine, then season with salt and pepper to taste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the yams are done, transfer them to a serving platter, drizzle the yogurt over them and garnish with the remaining Espelette pepper or red-pepper flakes, the scallions and some flaky sea salt if you have any."}]}