{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Clams and Mussels with Garlic, Almonds and Mint", "description": "Grilling clams and mussels gives them a smokiness you can’t get inside on your stove. Use hardwood charcoal if you can; it gives the best, smokiest flavor. The cooking time may vary depending upon your grill and the temperature of the shellfish when you put it in the pan. (Very cold seafood may take a few minutes longer.) Keep checking, pulling out the open clams and mussels with tongs as you go. And don’t forget to pour the heady pan juices on top of the shellfish; dunking grilled bread into that garlicky pool may be the best part of the dish.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/08/02/dining/02APPE/02APPE-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, barbecues", "keywords": "clams, mussels, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 97}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 340, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "42 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1179 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds mussels", "2 dozen littleneck clams", "1/2 cup dry white wine", "1/4 cup extra-virgin olive oil, more for drizzling", "5 garlic cloves (4 thinly sliced, 1 finely chopped)", "1/4 teaspoon red chile flakes, more to taste", "3/4 cup chopped mint leaves", "3 tablespoons sliced almonds", "Finely grated zest of 1 lemon", "Grilled bread slices, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a very hot charcoal fire, mounding coals in the center of the grill, or heat a gas grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrub mussels and clams under running water to remove any clinging grit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put clams, wine, oil, sliced garlic and chile in a large disposable aluminum roasting pan and stir. Cover pan tightly with heavy-duty foil. Place pan on the grill and cover. Let cook undisturbed for 10 minutes, then use mitts to open foil and stir in mussels. Replace foil and continue cooking, with grill covered, 10 minutes more. By this time, most or all of the shellfish should be open. Use tongs to transfer opened shellfish to a serving bowl and return any unopened in the pan to continue cooking, covered, for another few minutes. Any that remain unopened should be discarded. Combine all shellfish and pan juices in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss shellfish with mint, almonds, chopped garlic and lemon zest. Drizzle with additional oil. Brush grilled bread slices with oil and serve alongside for soaking up juices."}]}