{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Ice Cream Profiteroles", "description": "Profiteroles are among the most irresistible desserts. They are essentially dolled-up cream puffs, usually drizzled with chocolate sauce and sprinkled with chopped nuts. Adding dark chocolate ice cream catapults them heavenward, to everyone’s delight.\n\nMore romantic recipes, from dinner for two to chocolate for all, can be found <a href=\"http://cooking.nytimes.com/topics/valentines-day\">here.</a>", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/02/11/dining/11KITCHEN1/11KITCHEN1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "24 profiteroles", "recipeCuisine": "", "recipeCategory": "snack, ice creams and sorbets", "keywords": "dessert, egg, hazelnut, heavy cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 142, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "6 grams", "sodiumContent": "62 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ounces/60 grams raw shelled hazelnuts (optional)", "1/4 pound/113 grams unsalted butter (1 stick)", "1/4 teaspoon salt", "1 cup/150 grams all-purpose flour", "4 eggs, plus 1 egg lightly beaten for glaze", "1 cup/120 milliliters heavy cream, chilled", "1 tablespoon granulated sugar", "1 quart/1 liter chocolate hazelnut ice cream (<a href=\"http://cooking.nytimes.com/recipes/1017202-chocolate-hazelnut-ice-cream\">see recipe</a>), or other ice cream", "1 cup/240 milliliters warm bittersweet chocolate sauce (<a href=\"http://cooking.nytimes.com/recipes/1017203-bittersweet-chocolate-sauce\">see recipe</a>), or other chocolate sauce", "Confectioners’ sugar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. If using hazelnuts, place on a baking sheet and roast until quite dark, about 10 minutes. Let cool slightly, then use a clean kitchen towel to rub off skins, discarding the skins. Crush nuts coarsely with a rolling pin or meat mallet and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the puffs, put 1 cup/240 milliliters water, the butter and the salt in a saucepan over high heat and bring to a boil. Add flour and stir with a wooden spoon until mixture comes together and forms a sticky ball. Lower heat to medium and continue to cook, stirring, for a minute or 2 more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to the bowl of a stand mixer fitted with paddle attachment. Mix at medium speed to cool dough slightly, then increase speed and begin to add 4 eggs, 1 at a time. Make sure each egg is fully incorporated into dough before adding the next. When all eggs have been added, scrape down sides of bowl and beat again until dough is smooth and glossy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a pair of  12-by-18-inch baking sheets with parchment. Put dough in a pastry bag (or use two soup spoons) and form mounds that are 21/2 inches in diameter, 12 mounds per sheet, spaced evenly. Brush each mound with beaten egg, smoothing pointy tops with a finger. Bake for 10 minutes at 425 degrees, then reduce heat to 375 degrees and continue baking until puffs are well browned and crisp, about 25 minutes more. Cool to room temperature. (If desired, puffs may be baked in advance, frozen and recrisped at 400 degrees for 10 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cream and sugar in a small mixing bowl and whip to a soft, light consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble profiteroles, cut puffs in half horizontally. Place 2 tablespoons softly whipped cream on the bottom half of each puff, then a scoop of ice cream. Replace the tops. Transfer filled profiteroles to dessert plates or bowls, 2 per serving. Drizzle with warm chocolate sauce and sprinkle with reserved crushed hazelnuts, if using. Dust with confectioners’ sugar and serve immediately."}]}