{"@context": "http://schema.org", "@type": "Recipe", "name": "Royal Fans", "description": "", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2015/11/20/dining/royal-fan/royal-fan-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 dozen cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "almond extract, cake flour, light brown sugar, dessert", "aggregateRating": null, "recipeIngredient": ["2 cups sifted cake flour", "1/2 cup light brown sugar", "3/4 cup (1 1/2 sticks) butter", "1/2 teaspoon almond extract", "All-purpose flour, as needed for rolling dough", "2 egg yolks", "Food coloring", "Silver or gold dragées, for decorating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, stir together cake flour and sugar. Add butter and almond extract, working it into mixture with your fingertips until it resembles coarse bread crumbs. Compress dough into a ball, kneading it slightly if necessary until it is cohesive."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. On a lightly floured surface, roll out dough to 1/3-inch thickness. Use a fluted 4-inch round cookie cutter to cut into disks. Cut each piece into quarters. Using a small spatula or knife, lightly press five or six angled indentations into each quarter to resemble folds of a fan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cookies on an ungreased baking sheet about 1 inch apart. Whisk each egg yolk separately with 1 teaspoon water and a drop or two of food coloring, then brush it lightly over folds of fans with a small paintbrush. Decorate cookies with silver dragées, placing a dragée at end of each fold of fan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until very light brown, 15 to 20 minutes. Allow to cool completely, and store at room temperature in an airtight container."}]}