{"@context": "http://schema.org", "@type": "Recipe", "name": "Herbed Tomatoes", "description": "Tomatoes grow so many places that all herbs seem to have some sort of agreement worked out with them. And the polyamorous tomato seems, among a lucky few ingredients, to carry on genuine and stirring and entirely unique relationships with each herb. \n\nHere is a recipe for herbed tomatoes inspired by something my friend Emma made years ago, which she called, enigmatically, Tomatoes Provençal. In any case, mine are neither Provençal nor provincial, but à l’Americaine, using herbs that I usually eat in food from Vietnam and Thailand but that grow happily beside tomatoes in each of those countries — as well as in ours — in what may or may not be a French provincial preparation.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2015/07/05/magazine/05eat1/05mag-05eat-t_CA0-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "appetizer, summer, thai basil, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 178}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 107, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "320 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["6 medium-size summer tomatoes — somewhere between the size of a golf ball and a tennis ball", "4 tablespoons olive oil (best possible), plus more for the pan", "Salt", "2 tablespoons chopped green or summer garlic, or 1 tablespoon chopped regular garlic", "4 tablespoons very finely chopped fresh cilantro, stems included", "2 tablespoons very finely chopped fresh Thai basil, leaves only"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tomatoes across their horizontal equators, and over the sink, scoop out some of their seeds and juice without completely disemboweling them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron pan or grill pan or grill big enough to fit all the tomatoes in one or two rounds. Lightly brush or drizzle your pan with olive oil. Cook the tomatoes in a single layer, cut sides down, for 3 to 4 minutes, until they just start to collapse or buckle when they are plucked at with tongs and their cut sides are browned or even a touch blackened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat, and turn the tomatoes over, leaving them for 3 minutes on the second side and then removing them, cut sides up, to a plate. Lightly salt the cut sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar and pestle or on a cutting board, pound the garlic to a paste with a large pinch of salt — about 1/2 teaspoon. When you have a fairly smooth paste, mix in the chopped herbs and olive oil. Taste. Adjust salt until the paste is very well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the herb paste among the cut sides of the tomatoes, using it all. There should be a thick, herby blanket on each. Eat warm or at room temperature or cool."}]}