{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Bundt Cake With Poppy Seeds", "description": "Because this is made with whole wheat flour and honey it doesn’t look like most white fluffy poppy seed cakes; it’s dark and golden, with a wonderful moist texture plus the slight crunch of the poppy seeds (which are another good luck food, at least in Poland). The formula is much the same as the one I used for my walnut apricot Bundt cake modeled on Peter Reinhart’s formulas for quick breads and muffins, with ricotta standing in for some of the buttermilk.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/12/30/science/recipehealthricotta/recipehealthricotta-articleLarge.jpg", "totalTime": "PT1H35M", "recipeYield": "1 generous ring, 20 to 24 slices", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, snack, cakes", "keywords": "dessert, fall, spring, summer, winter, halal, kosher, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 107}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 164, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "4 grams", "sodiumContent": "164 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["383 grams / about 3 cups whole wheat flour", "3/4 teaspoon fine sea salt", "1 tablespoon baking powder", "1 1/4 teaspoons baking soda", "145 grams / 5 ounces / 1 1/4 sticks unsalted butter, melted", "1/2 cup mild honey, such as clover", "3 eggs, at room temperature", "1 1/4 cups / 296 milliliters buttermilk", "6 ounces / 3/4 cup / 170 grams ricotta", "1 1/2 tablespoons lemon extract", "1 teaspoon vanilla extract", "Grated zest of 1 to 2 lemons (to taste)", "2 tablespoons poppy seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Brush a Bundt pan with melted butter and lightly dust with flour. Sift together flour, salt, baking powder and baking soda into a large bowl or the bowl of a stand mixer. In another large bowl beat together eggs, buttermilk, ricotta, melted butter, honey, lemon extract and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a stand mixer, fit with paddle and beat at low speed for about 30 seconds, then add liquids and beat for about 1 minute, or until thoroughly combined. Stop machine, scrape bottom of the bowl with a spatula to bring up any unmixed flour, and beat for another minute on low speed. If using a bowl and whisk, whisk together dry ingredients then whisk in wet ingredients until smooth. The mixture should be thick and, in the perfect words of Peter Reinhart, “soupy.” Stir in lemon zest and poppy seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape batter into prepared Bundt pan and place in oven. Set timer for 45 minutes. Rotate pan 180 degrees and bake for another 25 to 35 minutes, until cake is nicely browned and a toothpick comes out clean when inserted. Remove from oven and allow to rest in pan for 10 to 15 minutes, then invert onto a rack and allow to cool completely."}]}