{"@context": "http://schema.org", "@type": "Recipe", "name": "‘Barbecued’ Brisket", "description": "Brisket simply cannot be grilled over direct heat no matter how careful you are; it absolutely requires long, slow cooking. In fact, it’s difficult to grill (or broil) without some form of precooking, whether in aluminum foil (a venerable trick that makes sense) or in a barbecue pit.\n\nThe slow braising phase of cooking the beef, in a ketchup-and-chile-based sauce, may take a while — it doesn’t surprise me when brisket takes three hours or even longer to become really tender — but the final browning can take as little as 10 minutes and produces fork-tender brisket.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT3H", "recipeYield": "8 or more servings", "recipeCuisine": "barbecue", "recipeCategory": "barbecues", "keywords": "beef brisket, dry red wine, ketchup, onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 905, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "67 grams", "fiberContent": "1 gram", "proteinContent": "52 grams", "saturatedFatContent": "26 grams", "sodiumContent": "934 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil or vegetable oil, more as needed", "1 whole beef brisket, about 5 pounds", "Salt and freshly ground black pepper", "1 or 2 large onions, chopped", "2 cups ketchup", "1/2 cup dry red wine or water", "1/4 cup wine or rice vinegar", "1 tablespoon Worcestershire or soy sauce", "1 tablespoon chile powder, or to taste", "2 cloves garlic, minced or crushed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 300 degrees. Heat a large pot or Dutch oven that can later be covered over medium-high heat for 2 or 3 minutes. When it is hot, add oil, swirl it around, then add beef. Sear meat for about 5 minutes on each side, seasoning with salt and pepper; when nicely browned, remove from pot. Turn off heat under pot for a minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion to pot and cook, stirring, over medium-low heat until softened, 5 to 10 minutes (if meat is very lean you might need to add a little oil). Add all remaining ingredients, stir, and cook for about a minute. Return meat to pot, nestling it in sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover pan, put it in oven, and cook until meat is tender, at least 2 hours and probably closer to 3. When it is done, you can refrigerate it in its liquid for 1 to 2 days before proceeding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a charcoal or gas grill or heat broiler; rack should be about 4 inches away from heat source. Drain meat and sprinkle with salt and pepper. Grill or broil on both sides until brown and crisp, just a few minutes. Meanwhile, skim cooking liquid of fat, warm gently, and use as sauce."}]}