{"@context": "http://schema.org", "@type": "Recipe", "name": "Spanish Tortilla with Mushrooms and Kale", "description": "This is my take on a traditional Spanish tortilla, a filled omelet often served in wedges as a tapa. Flawlessly executing the tortilla, seeing that nothing sticks and flipping it over, can be tricky. A nonstick pan will improve the chance for success.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/04/22/dining/22PAIR/22PAIR-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "spanish", "recipeCategory": "brunch, dinner, lunch", "keywords": "egg, kale, shiitake, yukon gold potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "recipeIngredient": ["7 tablespoons extra-virgin olive oil", "1 medium-large Yukon Gold potato, about 6 ounces, peeled and diced", "Salt and ground black pepper", "2/3 cup diced onion", "4 ounces shiitake mushrooms, stemmed and diced", "Leaves from 5 branches fresh thyme", "1/2 cup finely chopped kale", "6 large eggs, beaten", "Large pinch ground espelette pepper or cayenne, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 1/2 tablespoons of the olive oil at medium low in a heavy 8- to 9-inch skillet, preferably nonstick. Add potatoes, spreading them in the pan, and cook 10 minutes, stirring from time to time to prevent sticking. Do not let them brown. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions, mushrooms, thyme and another tablespoon of oil and continue cooking, stirring from time to time, another 10 minutes or so, until mushrooms and onions have softened and potatoes are tender. Add the kale and cook 5 minutes more. Check seasoning. Turn off heat and remove the vegetables to a bowl. Fold in the eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pan, removing any clinging bits. To flip the tortilla, have ready a plate that’s larger than the pan, the lid of the pan or a plastic cutting board wrapped in foil. Alternatively, you can finish the tortilla under the broiler; if so, heat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to the stove on medium-high heat. Add 2 tablespoons oil. When oil is hot, add the eggs and vegetables. Reduce heat to medium low. Slide the pan back and forth to prevent the tortilla from sticking and run a spatula around the edges to loosen the eggs. When the eggs are nearly set on top, finish under the broiler for a minute or two, until very lightly browned, or flip the tortilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To flip, place the plate, lid or cutting board over the pan. Using towels or mitts, grasp the plate, lid or board and the skillet together and turn them over so the tortilla comes out. Return the skillet to the stove on medium heat, add the remaining half-tablespoon of oil, slide the tortilla back into the pan to cook the second side for 1 to 2  minutes. Transfer to a platter, dust with espelette or cayenne and serve at once or set aside to serve warm."}]}