{"@context": "http://schema.org", "@type": "Recipe", "name": "Texas-Style Chili", "description": "Calling a dish \"Texas Chili,” especially if you’re not a native of that state, is clearly asking for trouble. But this recipe, refined over years of potlucks and Super Bowl parties, is too good to keep under wraps. Its depth of flavor, from different chile types, makes this recipe stand out. It also has whole spices, unsweetened chocolate and dark beer that meld seamlessly into a brick-red sauce that naps the succulent meat. The meat can be cut into large chunks, or, more traditionally, thin slices, especially if you are using a tougher cut than chuck. Sirloin also makes good chili. If you have masa harina, the corn flour used to make tortillas, that will make the gravy even thicker, but it is not necessary. Like many vigorously spiced dishes, this one tastes even better a day or two after it is made and will hold its flavor well for at least a week.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/01/11/dining/31CHILI1/31CHILI1-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "12 servings", "recipeCuisine": "southwestern", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "beef chuck, beer, red chile, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1869}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 286, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "34 grams", "saturatedFatContent": "4 grams", "sodiumContent": "341 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon whole cumin seeds", "1 1/2 teaspoons whole coriander seeds", "4 pounds beef chuck roast or steak", "1 teaspoon salt, more to taste", "3 tablespoons vegetable oil, plus extra as needed", "1 large yellow or white onion, chopped, plus extra chopped onion for serving", "6 large garlic cloves, minced", "4 to 7 large fresh green jalapeños (depending on how much heat you like), stemmed, seeded and chopped", "3 tablespoons masa harina or 1 corn tortilla, torn into pieces (optional)", "2 tablespoons ground pure chile powder, such as pasilla, Chimayo or ancho", "1 tablespoon dried oregano", "1 (12-ounce) bottle Negra Modelo beer", "1 28-ounce can diced tomatoes, or 3 10-ounce cans Ro-Tel canned tomatoes with green chiles", "1 ounce unsweetened chocolate", "3 whole dried large red chiles, such as New Mexico or guajillo", "Chopped fresh cilantro, for serving", "Fritos or warmed flour tortillas, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small heavy skillet, toast cumin and coriander seeds until fragrant. In a mortar and pestle, or in a coffee grinder, grind to a powder and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roughly cut beef into 2-inch cubes, or slice it against the grain into pieces about 1/4-inch thick by 1 1/2 inches square. Sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy pot over high heat, heat oil until shimmering. Working in batches to avoid crowding the pan, brown the meat, turning occasionally until crusty. Adjust heat to prevent scorching. As it is cooked, remove the meat to drain on paper towels. Add more oil as needed for browning, but do not clean out the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the empty but crusty pot, add onion, garlic, jalapeños, masa harina or tortilla (if using), chile powder, cumin-coriander powder and oregano. Cook, stirring, until onion has softened, 5 to 10 minutes. Add meat, beer, tomatoes, chocolate, whole dried chiles and 1 quart water. Bring to a gentle simmer and simmer about 1 1/2 hours, or until meat is fork-tender. Remove the dried chiles. Taste and add salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately or let cool and refrigerate. The chili tastes best one or two days after it is made."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat over low heat if necessary and serve in bowls, sprinkled with chopped onion and cilantro. Add Fritos for crunch, or dip tortillas into the spicy gravy."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Texas-Style Chili", "description": "A beef chili infused with red chiles, chocolate and beer for bold flavor.", "thumbnailUrl": "https://static01.nyt.com/images/2019/01/11/dining/31CHILI1/31CHILI1-mediumThreeByTwo440.jpg", "uploadDate": "2015-01-26T17:10:38.000Z", "duration": "PT1M34S"}}