{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Oven Roasted Pumpkin Wedges With Cranberry, Pecan and Chile Pesto", "description": "This sweet and savory pumpkin dish came to The Times from Tara Deshpande Tennebaum in 2015 when the Well blog invited readers to share their favorite vegetarian Thanksgiving recipes. Ms. Deshpande Tennebaum, who is from Mumbai, married a Minnesotan, and has come to love the holiday. She developed this recipe when they were in India for Thanksgiving one year, using red pumpkin, a native vegetable that is similar to American pumpkin.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2015/11/20/science/wellpumpkin/wellpumpkin-articleLarge.jpg", "totalTime": "PT2H25M", "recipeYield": "Serves 10 with about 2 wedges each", "recipeCuisine": "", "recipeCategory": "", "keywords": "vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 401, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "3 grams", "sodiumContent": "673 milligrams", "sugarContent": "17 grams", "transFatContent": null}, "recipeIngredient": ["1 cup sweetened dried cranberries", "1 cup natural orange juice", "1 cup grapeseed oil, divided", "1.5 cups whole unsalted pecans", "2 teaspoons red chile flakes (or to taste)", "1/2 teaspoons fresh thyme leaves", "kosher salt", "4 1/2 to 5 pound pumpkin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pesto: Combine cranberries, orange juice and 1/2 cup grapeseed oil in a bowl to soak while you prepare the other components. In a medium skillet, dry roast the pecans over a medium flame until fragrant, about 3 to 4 minutes. Remove to a tray and allow to cool. Gently toast the red chile flakes about 1 minute in the same skillet and remove to a small plate or bowl. Blitz the cranberries and orange juice in a small food processor. Add chile flakes, thyme and three-fourths of the pecans and process until smooth. Add the remaining pecans and pulse one or two times for a chunky consistency. Season with kosher salt to taste, and more red chile flakes if desired. Set the pesto aside or refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees Fahrenheit. Slice open the pumpkin and remove seeds and fibers. Slice pumpkin into 1¼-inch-thick wedges. Brush all over with 1/2 cup grapeseed oil. Sprinkle with sea salt. Place on a rimmed baking sheet and cover with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast covered for 90 minutes. Remove foil and increase heat to 375 degrees and cook another 20 to 30 minutes, until the edges begin to caramelize. Allow to cool slightly before serving wedges with the pesto."}]}