{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Eggplant With Chickpeas and Mint Chutney", "description": "In this gently spiced vegetable dish, baby eggplant slices are first fried until golden, then braised with chickpeas, tomatoes and garam masala until soft, velvety and richly flavored. A quickly made fresh mint chutney adds a complex, herbal, spicy note thanks to the jalapeño in the mix. Serve this over rice or with flatbread as a main course, or on the side of grilled meats or fish.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/01/09/dining/00FRIEDEGGPLANT-CHICKPEAS/00FRIEDEGGPLANT-CHICKPEAS-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "2 to 3 servings as a main course, 4 to 6 as a side dish", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "chickpea, eggplant, garam masala, mint, tomato, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1048}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 512, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "25 grams", "proteinContent": "19 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1541 milligrams", "sugarContent": "23 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds baby or small Italian eggplant, sliced into 1/4-inch-thick rounds", "Fine sea salt, as needed", "3 to 4 tablespoons extra-virgin olive oil, more as needed", "1 large white onion, halved and thinly sliced", "2 garlic cloves, minced", "1 1/2 teaspoons garam masala", "1/2 teaspoon sweet paprika", "1/4 teaspoon black pepper", "1/8 teaspoon cayenne", "1 pound ripe tomatoes, chopped (about 2 cups)", "1 3/4 cups (one 15-ounce can) cooked chickpeas, drained and rinsed if canned", "1 cup mint leaves", "1 cup cilantro leaves and tender stems", "1 serrano or jalapeño pepper, seeded and roughly chopped", "1 scallion, cut into 1-inch lengths", "1 garlic clove, roughly chopped", "2 teaspoons lemon juice, more to taste", "1/4 teaspoon fine sea salt, more to taste", "Plain yogurt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season eggplant slices all over with salt. Heat a large skillet over medium-high heat, then add 1 tablespoon olive oil and heat until it thins out in the pan. Add enough eggplant slices to fit in one layer without overlapping. Cook until the bottoms are browned, then flip and continue to cook until well browned and soft, 3 to 5 minutes per side. Add more oil if needed. Transfer cooked eggplant to a plate lined with paper towels, and repeat with more oil and eggplant until all the eggplant is cooked. Taste eggplant and add more salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat another tablespoon of oil in pan, then add the onions. Cook until softened and golden, about 4 minutes. Add garlic and cook until fragrant, 1 to 2 minutes longer. Add spices and cook for 1 minute, then add tomatoes, chickpeas and 2 tablespoons water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partly cover the pan and let the mixture simmer until tomatoes start to break down, 10 to 15 minutes. Add eggplant to the pan and cook for another 5 to 10 minutes, until sauce thickens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the eggplant cooks, combine all the ingredients for the chutney in a blender with 2 tablespoons water. Blend until puréed, about 1 minute. Taste and add more lemon juice or salt, or both, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the eggplant topped with the chutney and yogurt if you like."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Fried Eggplant With Chickpeas", "description": "In this gently spiced vegetable dish, baby eggplant slices are first fried until golden, then braised with chickpeas, tomatoes and garam masala until soft, velvety and richly flavored.", "thumbnailUrl": "https://static01.nyt.com/images/2019/01/09/dining/00FRIEDEGGPLANT-CHICKPEAS/00FRIEDEGGPLANT-CHICKPEAS-mediumThreeByTwo440.jpg", "uploadDate": "2015-08-07T16:33:22.000Z", "duration": "PT2M16S"}}