{"@context": "http://schema.org", "@type": "Recipe", "name": "Five-Spice Duck Breast With Blackberries", "description": "Once you know the technique, cooking a large Muscovy duck breast is no more difficult than cooking a steak. Fragrant five-spice powder — a heady mix of Sichuan pepper, fennel, clove, star anise and cinnamon — is the perfect duck seasoning, and juicy blackberries make this a brilliant summertime dish. Muscovy duck is found at better butchers, from online sources or even at some farmers' markets. Grill the duck if you prefer, but make sure to keep dripping fat from igniting and scorching the meat. The breast meat is quite lean despite its fatty skin, so it is best cooked to a rosy medium rare or it will be dry. Serve it warm, at room temperature or cold.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/08/12/dining/12KITCHEN1/0812Kitchen1-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "blackberries, duck breast, five-spice powder, ginger, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 260}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 143, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "17 grams", "saturatedFatContent": "1 gram", "sodiumContent": "512 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 Muscovy duck breasts, about 1 pound each", "Salt", "2 teaspoons Chinese five-spice powder", "1 tablespoon fresh ginger, grated", "2 garlic cloves, smashed or diced", "1 shallot, finely diced", "2 tablespoons good sherry vinegar", "2 tablespoons brown sugar", "6 ounces blackberries", "1/2 cup rich chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim duck breasts as necessary, removing extraneous fat or gristle. Score the skin side of the breast diagonally with a sharp knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season both sides of the duck breasts with salt, then sprinkle both sides evenly with five-spice powder. Mix together ginger and garlic and use it to slather the breasts. Cover and let marinate for 30 minutes at room temperature. (Alternatively, wrap and refrigerate for several hours, or even overnight; bring back to room temperature before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a cast-iron pan over medium-high heat. When pan is hot, lay duck breast in it skin-side down. Let sizzle gently for 7 minutes, until skin is crisp and golden, adjusting heat as necessary to keep from getting too dark too quickly. Turn breast over and cook 3 to 5 minutes more. An instant-read thermometer should register 125 degrees for medium rare. Remove from pan and let rest for 10 minutes on a warm plate. Drain fat from pan (reserve for another use if you wish)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Over medium heat, add shallots to same pan and cook until softened, about 2 to 3 minutes. Add sherry vinegar, brown sugar and half the blackberries, stirring until sugar is dissolved and berries have released their juice. Add chicken broth, raise heat and simmer rapidly until liquid is reduced by half and a bit syrupy. Strain the contents of the skillet into a small saucepan and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice duck breast thinly across the grain on a diagonal and arrange on a platter. Spoon the sauce over the meat and garnish with the rest of the blackberries."}]}