{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Pot-Roasted Cauliflower With Tomatoes and Anchovies", "description": "The English chef April Bloomfield is known for her love of meat, but her vegetable-centric cookbook “A Girl and Her Greens” is stuffed with the produce she discovered while cooking in Mediterranean-influenced kitchens like Chez Panisse and London’s River Cafe. Often, she simply treats a vegetable as if it were meat, like this whole head of cauliflower. Braising it in tomato and anchovies, as if making an Italian pot roast, produces a richly satisfying entree.\n\nMs. Bloomfield is unabashedly fussy about every component of her dishes, and inspires us to be equally careful. She gives a $2 can of plum tomatoes the same treatment she’d give an $80 whole lobe of foie gras: Each one must be closely examined, its tough bits trimmed off, and any substandard specimens discarded.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2015/04/29/dining/29COOKBOOK4/29COOKBOOK4-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings as a side dish, 4 as an entree", "recipeCuisine": "", "recipeCategory": "dinner, lunch, roasts", "keywords": "anchovies, cauliflower, tomatoes, white wine, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 815}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 161, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "424 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 head cauliflower (about 2 pounds), white, green or Romanesco", "5 tablespoons olive oil, plus extra for drizzling", "3 medium garlic cloves, thinly sliced", "3 whole salt-packed anchovies, rinsed and filleted, or 5 to 6 anchovy fillets", "3/4 teaspoon finely chopped rosemary leaves", "1 1/2 cups drained whole canned tomatoes, trimmed of hard and unripe bits, diced", "1/4 cup dry white wine, plus extra for cooking", "3 dried pequin chiles, or 3 large pinches red pepper flakes", "1 teaspoon flaky salt, like Maldon, or kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position a rack in the center of the oven and heat to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim any wilted leaves and brown bits off the cauliflower, but leave healthy leaves. Put the cauliflower on its side on a cutting board. As if coring a tomato, core the base of the cauliflower: insert a small sharp knife about 1 inch into the base of the stem, make a circular cut to loosen the cone-shaped core, then pry it out and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep, heavy ovenproof pot (with a lid), large enough to hold the whole cauliflower, heat the oil over medium-high heat. Add the cauliflower cored side up; it should sizzle. Brown the exterior, turning it occasionally with tongs for even browning. This should take about 5 minutes; reduce the heat as needed to prevent scorching. Carefully turn over and brown the other side lightly, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cauliflower to a plate and add garlic, anchovies and rosemary to the pot. Stir until garlic is golden, about 30 seconds. Add tomatoes, white wine, chiles and salt. Stir well and bring to a simmer. Return cauliflower to pot, cored side down. Baste with the tomato liquid and pile some of the solids on top. Simmer, uncovered, 5 minutes to thicken the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pot, place in the oven and roast until tender, 30 to 45 minutes; a knife will go into the thick stems with almost no resistance. Check on the tomato sauce every 10 minutes or so; it should be punchy and intense but not too thick, so add a glug of wine if it seems to be getting too dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cauliflower head to a serving plate or shallow bowl and cut in half, quarters or thick slices. Spoon on all the tasty stuff left in the pot. Add a drizzle of olive oil and a sprinkle of herbs. Serve immediately or at room temperature, passing salt and red pepper flakes at the table."}]}