{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Roasted New York Strip Loin", "description": "Roast beef for a holiday dinner or festive occasion is easy and impressive. There are many cuts to consider, from the pricey tenderloin and standing rib to the more affordable rump roast. A whole strip loin, also know variously as New York strip or Kansas City strip — usually cut into steaks — also makes a great centerpiece. Served with roasted potatoes and parsnips and horseradish sauce, it is the quintessential Anglophone meal.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2015/12/16/dining/16KITCH2/16KITCH2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "roasts", "keywords": "beef, horseradish, mustard, parsnip, potato, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 278}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 887, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "11 grams", "proteinContent": "49 grams", "saturatedFatContent": "24 grams", "sodiumContent": "1271 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon black peppercorns", "6 allspice berries", "2 tablespoons kosher salt", "5 pound New York strip loin roast, tied at 2-inch intervals (ask your butcher to do this)", "4 cloves garlic, grated", "2 bunches rosemary, thyme or savory", "3 pounds medium Yukon Gold potatoes, peeled", "3 pounds medium parsnips, peeled, cut in 3-inch lengths", "1/4 pound unsalted butter, melted", "1 large bunch watercress, for garnish (optional)", "1 cup (8 ounces) crème fraîche", "1 tablespoon Dijon mustard", "3 tablespoons grated horseradish, preferably freshly grated", "Small pinch cayenne", "Salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely grind peppercorns and allspice together in a spice mill. Combine with salt in a small bowl. Sprinkle mixture evenly over exterior of roast. Add the grated garlic and rub in all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a roasting pan with herb branches and set roast on top. Leave to absorb seasonings for at least 1 hour at room temperature, or refrigerate overnight (bring back to room temperature before proceeding). Heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot of well-salted boiling water, cook potatoes until just done, about 15 minutes. Remove with a spider or slotted spoon and place in an earthenware baking dish. In the same water, simmer parsnips until just done, about 8 minutes. Remove and add them to potatoes in baking dish. Pour melted butter over the potatoes and parsnips and use a brush to make sure they are well coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the horseradish sauce: Whisk together crème fraîche, Dijon mustard, horseradish and cayenne in a small bowl. Season with salt and pepper and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the beef, uncovered, for about 1 hour. Check with an instant-read thermometer after 45 minutes. For medium-rare, take the roast out of the oven when thermometer registers 120 degrees (residual heat will cause roast to continue cooking as it rests). Remove the roast, tent it with foil, and let it rest for 15 minutes; the temperature should rise to 125 degrees. About 15 minutes after the roast goes into the oven, put in the baking dish of potatoes and parsnips, uncovered, and roast until beautifully golden brown, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the beef into 1/4-inch-thick pieces and arrange on a warmed platter, garnished with a big bunch of watercress. Pass the roasted vegetables and horseradish sauce separately."}]}