{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Winter Tomatoes", "description": "This recipe is designed to be used with the watery, mealy tomatoes you find at the market in the depths of winter. I like to use cherry tomatoes for this recipe, but anything will do. The method couldn't be easier: cover those sad tomatoes in oil, add ginger, garlic and basil, and pop them in the oven for about 2 hours. With that, your tomatoes are suddenly juicy and flavorful and exciting again. Refrigerate or freeze them for later use; you can serve them with pasta, on toast with whipped feta, on bagels with cream cheese. Or you can make a delicious tomato soup with them, or turn them into a coconut curry sauce that can go over fish, tofu or rice, and is guaranteed to blast your seasonal affective disorder to bits. And save that cooking oil too, which you can store in the fridge for up to 2 weeks. Use it as you would any normal olive oil, except it’s so much more delicious. Taste it and try to avoid guzzling the entire bowl.", "author": {"@type": "Person", "name": "Amanda Cohen"}, "image": "https://static01.nyt.com/images/2016/02/10/dining/10JPTOMATOES3/10JPTOMATOES3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "2 to 3 quarts (about 10 cups)", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "ginger, olive oil, tomatoes, gluten-free, vegan, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 261}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 447, "unsaturatedFatContent": "41 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "50 grams", "fiberContent": "1 gram", "proteinContent": "0 grams", "saturatedFatContent": "7 grams", "sodiumContent": "3 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 1/2 pounds tomatoes (any kind)", "5 garlic cloves, peeled", "2 slices peeled ginger, about 1/8-inch thick", "2 to 3 sprigs fresh basil", "5 to 6 cups extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. If using larger tomatoes, such as beefsteak or plum tomatoes, slice them in half; if using cherry tomatoes, leave them whole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine tomatoes, garlic, ginger and basil in a 9- by 13-inch baking dish. Add enough olive oil to cover. Transfer to oven and bake for 2 hours; the tomatoes should have started to collapse and have a few brown spots. Return them to the oven if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove baking dish from oven and let tomatoes cool. Drain the oil and reserve. (You can use it as you would any normal olive oil.) Refrigerate or freeze your tomatoes for later use; they will last in the fridge up to 1 week. The oil will keep for 2 weeks in the refrigerator."}]}