{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Beet-and-Sauerkraut Soup With Horseradish and Crème Fraîche", "description": "This recipe — invented by Camino’s Russell Moore because he couldn’t bring himself to discard the salty, pickly liquid left over from sauerkraut — is often on Camino’s menu in the winter. He tells me it is an especially good one to make at home, because so many of us have old jars of sauerkraut cowering in the backs of our refrigerators. If my own refrigerator is any gauge, he is correct.", "author": {"@type": "Person", "name": "Tamar Adler"}, "image": "https://static01.nyt.com/images/2015/11/15/magazine/15eat2/15mag-15eat-t_CA1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "beet, horseradish, sauerkraut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "recipeIngredient": ["4 or 5 large beets (about 1 3/4 pounds)", "Salt to taste", "1 large fennel bulb, or 2 or 3 smaller bulbs", "1 large yellow onion", "8 or 9 cloves garlic", "1/2 pound green or savoy cabbage", "Olive oil", "1 1/2 cups sauerkraut, preferably red sauerkraut, because it looks better", "1 cup sauerkraut liquid", "Red-wine vinegar", "A handful of mushroom butts, tied in cheesecloth or a coffee filter (optional)", "Crème fraîche", "1 small piece fresh horseradish, peeled", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375. Wash the beets, and trim only their stem ends, leaving a little of the stems attached. Crowd beets in a single layer in a roasting pan, season lightly with salt and pour in about an inch of water (less if the beets are small, more if they’re large). Cover tightly with aluminum foil, and roast until a skewer slides easily through the beets, about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beets are cool enough to handle, peel. Trim away any fibrous root ends, and cut into ½-inch cubes. Clean the fennel, keeping tough outers for another purpose. Dice the fennel and onion into pieces slightly smaller than the beet cubes. Slice the garlic. Slice the cabbage to about the size of the sauerkraut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large pot over medium heat, pour in enough oil to cover its bottom and cook the fennel and onion with a small pinch of salt until they soften. Add the sliced cabbage and garlic, and cook for 2-3 minutes. Add the beets, sauerkraut and ½ cup of the sauerkraut liquid, then enough water to barely cover. Add a small splash of vinegar and the mushroom butts (if you’re using them). Bring the soup to a boil, then lower the heat and simmer for 5 minutes. Chill the soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the soup, and add remaining sauerkraut juice to season instead of salt. Serve with a spoonful of crème fraîche, a little grated horseradish and a few grinds of black pepper."}]}