{"@context": "http://schema.org", "@type": "Recipe", "name": "Cutout Sugar Cookies", "description": "This recipe is adapted from a 1981 Mimi Sheraton recipe for <a href=\"http://cooking.nytimes.com/recipes/5632-murbeteig-or-sugar-cookie-dough\" target=\"_blank\">Murbeteig</a>, a pie and sugar-cookie dough from Germany. This buttery cookie isn’t too sweet, which makes it an excellent canvas for sugary holiday adornments, like <a href=\"http://cooking.nytimes.com/recipes/1434-royal-icing\" target=\"_blank\">Royal Icing</a>. The dough warms quickly because of the high butter content, so work fast to roll, cut out and transfer the dough to the baking sheets to get the best results.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2014/11/26/dining/26SUGARCOOKIE/26SUGARCOOKIE-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "2 1/2 dozen 3-inch cutout cookies", "recipeCuisine": "", "recipeCategory": "snack, cookies and bars", "keywords": "cake flour, unsalted butter, vanilla extract, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 209}, "recipeIngredient": ["1/3 cup granulated sugar", "2/3 cup unsalted butter, at room temperature", "Pinch of salt", "1 large egg", "1/4 teaspoon vanilla extract", "2 cups cake flour", "Icing, sprinkles and dusting sugar, for decorating"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine sugar and butter in a mixing bowl or in the bowl of a stand mixer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the paddle attachment of the mixer, or a wooden spoon if you are doing this by hand, blend butter and sugar until no granules of sugar show. Lightly stir in salt, egg and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in flour in thirds. Add just enough to make a dough that forms a mass and that is very soft but not sticky. It should be pale yellow in color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather dough in a ball, wrap in wax paper or plastic wrap and chill for at least 1 hour, and preferably 3 or 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. On a floured surface, roll chilled dough to a thickness of about 1/8 inch. Dust rolling pin and dough with cake flour as needed. Using cookie cutters, make shapes and transfer to baking sheets lined with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 7 to 9 minutes, depending on the size of the cookie. The bottoms should be just beginning to turn golden. If they’re brown, you’ve cooked the batch too long."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cookies to cooling rack. Let cool completely, then decorate with icing, sprinkles and dusting sugars."}]}