{"@context": "http://schema.org", "@type": "Recipe", "name": "The Real Burger", "description": "“Grinding” may sound ominous, conjuring visions of a big old hand-cranked piece of steel clamped to the kitchen counter, but in fact it’s not that difficult. As the grinder was an innovation in its day, the food processor has taken over. It does nearly as good a job — not perfect, I’ll admit — in a couple of minutes or less.\n\nTake a nice-looking chuck roast, or well-marbled sirloin steaks or some pork or lamb shoulder. Cut the meat into one- to two-inch cubes, and pulse it with the regular steel blade until it’s chopped.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/12/30/dining/bittman-real-burger/bittman-real-burger-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, burgers", "keywords": "main course, onion, sirloin, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 188}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 426, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "0 grams", "proteinContent": "40 grams", "saturatedFatContent": "11 grams", "sodiumContent": "463 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 to 2 pounds not-too-lean sirloin, in chunks", "1/2 white onion, peeled and in chunks, optional", "Salt and pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Start a charcoal or wood fire or preheat a gas grill. Or, on stove top, heat a large, heavy skillet over medium-high heat for 3 or 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put meat and onion in a food processor, in batches if necessary, and pulse until coarsely ground: finer than chopped, but not much. Put it in a bowl and sprinkle with salt and pepper. Taste, then add more seasoning if necessary. (If desired, cook a teaspoon of meat in a pan before tasting.) Handling meat as little as possible to avoid compressing it, shape it lightly into 4 or more burgers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fire is hot enough when you can barely stand to hold your hand 3 or 4 inches over rack for a few seconds. Grill burgers about 3 minutes a side for very rare, and another minute a side for each increasing stage of doneness, but no more than 10 minutes total unless you like hockey pucks. (Timing on stove top is the same.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve on buns, toast or hard rolls, garnished as you like."}]}