{"@context": "http://schema.org", "@type": "Recipe", "name": "Crepes With Raspberry-Cassis Sauce", "description": "These sophisticated crepes can be made ahead of time and reheated in a low-temperature oven. The sauce, made by simmering raspberries in a rose-scented, cassis-spiked syrup, is what makes them special. While most of it is poured over the folded crepes, a bit is added to the yogurt, honey and lime filling, making it just sweet enough.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2015/05/06/dining/06MARTHA/06MARTHA-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, pancakes", "keywords": "crème de cassis liqueur, raspberries, rose water, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 130}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 378, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "6 grams", "proteinContent": "13 grams", "saturatedFatContent": "8 grams", "sodiumContent": "175 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cups/300 milliliters low-fat milk, such as skim or 1 percent", "2 large eggs", "1/4 teaspoon salt", "1 tablespoon/15 grams sugar", "1/3 cup plus 1 tablespoon/55 grams unbleached all-purpose flour, sifted", "1/3 cup plus 1 tablespoon/55 grams whole wheat flour or whole wheat pastry flour, sifted", "3 tablespoons unsalted butter, melted, plus butter for the pan", "1 teaspoon finely grated lime zest (from about 1/2 lime)", "1/4 cup sugar", "1/2 teaspoon rose water", "1 6-ounce box raspberries (about 1 1/4 cups)", "1 tablespoon crème de cassis liqueur", "1 1/4 cups/300 milliliters plain Greek yogurt (2 percent fat)", "1 tablespoon plus 1 teaspoon mild honey, such as clover or acacia (more to taste)", "1 1/4 teaspoons finely grated lime zest (from about 1/2 lime)", "1 to 1 1/2 teaspoons fresh lime juice (to taste)", "1 6-ounce box raspberries (about 1 1/4 cups)", "Powdered sugar for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make crepe batter, place milk, eggs, salt and sugar in blender. Turn on and, with the motor running, add flours, then melted butter and blend at high speed for 1 minute, until well mixed and smooth. Transfer to a bowl, stir in lime zest, cover and let rest for at least 30 minutes. If resting batter longer, refrigerate. (Whisk again before making crepes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While batter is resting, make raspberry sauce. Combine 1/3 cup water and sugar in small saucepan and bring to a boil. Reduce heat to medium low and simmer until sugar has dissolved. Remove from heat. Stir in rose water, raspberries and cassis liqueur. Return to heat, bring to a simmer, cover and simmer 10 minutes. Remove from heat and strain the mixture into a bowl. Press the raspberry pulp through strainer with a spatula and discard seeds. Whisk or stir to blend pulp and syrup and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the yogurt filling: In a separate bowl, whisk together yogurt, honey, lime zest and juice. Taste and adjust sweetness. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make crepes, heat 8-inch nonstick crepe pan or skillet over medium-high heat and brush lightly with butter. Pan must be hot when you add crepe batter. Lift pan off heat and pour or ladle in a scant 1/4 cup batter, enough to thinly coat bottom of pan. Tilt and swirl pan to distribute batter in an even layer. Return pan to heat and cook crepe for about 1 minute, until edges color and bottom of crepe is lightly browned. Crepe should not stick to pan. Flip crepe over and cook for 30 seconds on the other side, until speckled. Turn out onto a plate. Continue with remaining batter, brushing pan occasionally with butter if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you want to serve crepes at their hottest, assemble them as they come out of the pan. Spread a rounded tablespoon of the yogurt mixture over each crepe, drizzle on 1/2 teaspoon raspberry sauce, fold crepe in half and then in half again. Place on plate or platter. When all crepes are made and filled, spoon or pour sauce over, garnish with raspberries, and, if desired, dust with powdered sugar. Serve."}]}