{"@context": "http://schema.org", "@type": "Recipe", "name": "Rosemary and Citrus Turkey for a Crowd", "description": "This recipe makes things easier on you if you’re feeding a crowd at Thanksgiving. Instead of roasting two birds, or a giant, hard-to-maneuver 22-pounder, borrow a trick that caterers use at large weddings. There’s the official wedding cake for show, while in the kitchen there are sheet pans full of the same cake recipe, baked into flat, easily sliceable pieces.\n\nUsing the same logic, here you’ll find a recipe for one whole turkey roasted for that Norman Rockwell moment. Then, pans of easy-to-carve turkey parts are cooked in the same oven at the same time. Monitor everything carefully: The whole bird takes the longest to roast, while the parts roast in about half the time, the white meat often finishing before the dark. You will need a large roasting pan with a rack, and two 9-by-13-inch baking pans.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/10/27/dining/27COOKING-WEDDINGCOMBOalt/27COOKING-WEDDINGCOMBOalt-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "20 to 24 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "main course, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 216}, "recipeIngredient": ["1 (10- to 12-pound) whole turkey", "8 pounds bone-in turkey parts (see notes)", "4 1/2 tablespoons kosher salt", "2 tablespoons black pepper", "1/2 teaspoon allspice", "6 garlic cloves, grated on a microplane or minced", "Finely grated zest of 2 lemons", "Finely grated zest of 2 oranges (save the oranges for juicing)", "2 bunches rosemary", "1 bunch thyme", "3 white onions, peeled, halved and sliced", "4 large carrots, peeled and sliced into 1/2-inch coins", "3 celery stalks, sliced 1/2-inch thick", "2 apples, cored and sliced", "Dry white wine, as needed", "3/4 cup melted butter or olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove giblets from inside the turkey; reserve for stock or gravy. Pat meat dry with paper towels. In a small bowl, stir together salt, pepper, allspice, garlic and citrus zests. Pat mixture all over turkey and turkey parts (including inside the whole turkey cavity). Stuff one bunch of rosemary in cavity of whole turkey. Strew remaining rosemary and the thyme all over turkey and turkey parts. Refrigerate, uncovered, overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove whole turkey from the refrigerator 1 hour before you plan to cook it so it can come to room temperature. Heat oven to 350 degrees. Arrange oven racks so the pan with the whole turkey will fit on top rack, and the two pans with parts will fit underneath."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place whole turkey (with herb branches clinging to it) on a rack in a roasting pan. Take parts out of the fridge and place the breasts in a 9-by-13-inch roasting pan. Place the legs and wings in a separate 9-by-13 roasting pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Distribute onions, carrots, celery and apples into all three pans, scattering them on the bottom of the large roasting pan under the whole turkey, and tucking them in among turkey pieces. Sprinkle 2 tablespoons wine over each pan of turkey parts and pour 1/2 cup wine in the bottom of the whole turkey pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer whole turkey to the oven and roast for 1 hour (let the parts come to room temperature while the turkey starts roasting)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add parts to the oven underneath the rack with the whole turkey on it, and roast for an additional 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the juice from the 2 zested oranges. Increase oven temperature to 450 degrees and sprinkle about a third of the orange juice into the bottom of each of the three pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the butter or oil all over the whole turkey and the pieces. Continue roasting until an instant-read thermometer inserted into the meat registers 165 degrees, about 20 to 30 minutes more for the whole turkey, and 15 to 45 minutes longer for the parts. (Note: The turkey breasts may cook faster than the dark meat, so keep your eye on them.) If the breast of the whole turkey starts to look too brown before the bird is cooked through, cover it loosely with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the whole turkey is cooked through, remove from oven, cover with foil and let rest for 20 minutes while the parts finish cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the turkey parts are cooked through, adjust oven temperature to broil. Broil turkey parts until skin turns golden brown and crisp, 3 to 5 minutes. Let parts rest for 5 minutes before carving and serving. If you want to use the drippings for gravy or stock, strain or use a slotted spoon to remove vegetables first."}]}