{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Cream Cake With Peaches", "description": "In this trifle-like dessert, a tender coconut macaroon cake is layered with whipped cream and juicy ripe peaches. It’s allowed to rest in the refrigerator so the cake can absorb the cream and peach juices, and the whole thing turns into an almost puddinglike confection. If you’d rather serve it trifle-style from a large glass bowl, feel free. This is best after 24 to 48 hours in the fridge, when the cake has absorbed the maximum amount of cream. You can garnish the top with strawberries or more peach slices if you like, or leave it plain.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/07/08/dining/08APPE1/08APPE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "coconut, peach, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 397, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "18 grams", "sodiumContent": "79 milligrams", "sugarContent": "32 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Nonstick cooking spray, as needed", "4 large eggs", "1 1/2 cups/300 grams granulated sugar", "1/8 teaspoon/1 gram fine sea salt", "1 teaspoon/5 milliliters vanilla extract", "4 2/3 cups/280 grams dried unsweetened finely grated coconut", "2 1/4 cups/530 milliliters heavy cream", "2 to 3 tablespoons/15 to 25 grams confectioners' sugar, to taste", "1 teaspoon/5 milliliters vanilla extract", "3 large to 4 small ripe peaches or nectarines, diced", "Sliced peaches or strawberries, or both, for decoration (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat oven to 350 degrees. Line a rimmed 11-by-17-inch baking sheet with parchment paper and spray with cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a medium pot with one inch of water and bring to a simmer over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine eggs, sugar and salt in the heatproof bowl of an electric mixer. Whisk until blended. Place bowl over (but not touching) simmering water and continue whisking until warm to the touch. Remove from heat and whip until mixture has tripled in volume, about 5 minutes. Fold in vanilla extract and coconut. Pour into the prepared pan and smooth the top with a spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until cake is firm to the touch and golden brown, about 25 to 35 minutes. Cool on a wire rack for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 10-inch springform cake pan with plastic wrap, leaving overhang. (You’ll need 2 long pieces of plastic.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling and topping: Whip 1 1/2 cups/355 milliliters of the cream with the confectioners’ sugar and vanilla. (Reserve the remaining 3/4 cup cream/175 milliliters for serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a knife or offset spatula around the edges of the cake; invert onto a clean work surface and peel off the parchment. Cut a 9 3/4-inch round out from the sheet cake and fit it into the bottom of your springform pan (trim the cake round if necessary). Spread half the cream over the cake round, then top with half the peaches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the remaining cake scraps to make another layer of cake on top of the peaches, then top with more peaches and more whipped cream. Wrap the pan tightly in the plastic, using more plastic if needed. Refrigerate for at least 24 hours and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Release the sides of the pan and unwrap the cake to the point at which the top is exposed. Carefully flip the cake over onto a serving platter. Remove the pan bottom and the plastic wrap. Whip the remaining cream and spread over the cake before serving. Decorate with peaches, strawberries or both, if you like."}]}