{"@context": "http://schema.org", "@type": "Recipe", "name": "Festive Thanksgiving Torte", "description": "As a transplanted American living in Paris, Ann Schreifels had the task of hosting Thanksgiving, a holiday the locals didn't celebrate, in a city that is arguably the culinary capital of the world, to a guest list that included meat eaters and vegans.\n\nHer solution: Try to please everyone.\n\n\"The result was accolades from around the table,\" says Ms. Schreifels. \"And every time I serve it (and I mean every) someone asks for the recipe and says, 'I'm going to serve this to my family and see if they can tell it doesn't have meat in it.'\"", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2015/11/11/science/wellthanksgivingtorte/wellthanksgivingtorte-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "16 wedges or 8 large wedges", "recipeCuisine": "", "recipeCategory": "", "keywords": "main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 222}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 228, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "7 grams", "proteinContent": "11 grams", "saturatedFatContent": "0 grams", "sodiumContent": "280 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large sweet potatoes", "2 cups cooked green lentils", "1 cup oats", "1 cup walnuts", "1 cup cooked brown rice", "1 15-ounce can of chickpeas", "2 teaspoon poultry seasoning", "1 teaspoon garlic powder", "2 tablespoon soy sauce", "1 tablespoon Dijon mustard", "1 tablespoon peanut or almond butter (I use peanut butter)", "1 6-ounce can of tomato paste", "1/3 cup vegetable broth (or water)", "salt and pepper (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Lightly grease a 10-inch springform pan and line the bottom with a circle of parchment paper, and then lightly grease the parchment. Peel the sweet potatoes and slice lengthwise on a Japanese mandoline into ¼-inch slices. Arrange the sweet potato slices in the pan, fanning from the center and overlapping the pieces. Spread the lentils into an even layer over the sweet potatoes and gently press to pack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, pulse the oats and walnuts until a coarse meal is formed. Pour into a large bowl and set aside. Combine the cooked brown rice, chickpeas, poultry seasoning, garlic powder, soy sauce, Dijon mustard, nut butter, and tomato paste in the food processor and purée into a smooth mixture. Add to the large bowl with the oat and walnut meal, and fold together until completely incorporated. Add the vegetable broth or water gradually, and stir. Add just enough to create a spreadable consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently drop dollops of the mixture over the lentils, and spread into an even layer. Cover the springform pan with foil and bake for 40 minutes, until the edges appear cooked and slightly dry. Uncover and bake for 15 minutes, until the top is dry to the touch. Remove from oven and allow to cool slightly. When the springform pan is cool enough to handle, flip the torte out onto an ovenproof serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil the torte until the sweet potatoes begin to caramelize. Remove from oven and allow to cool slightly before serving. Can be served warm or at room temperature, garnished with fresh herbs."}]}