{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Tomato Terrine", "description": "Some people might call my tomato terrine a tomato pudding, but it is more a salad, with very thin layers of highly seasoned tomato slices and bread. It's the perfect first course in summer. For this salad, the tomatoes have to be skinned. You can do this with a blowtorch, charring the skin until it can be slipped off, as we sometimes do, or you can blanch them in boiling water until the skins loosen and will easily slide off. Just don't put in more than two at a time, or the tomatoes will remain in the water so long that they will cook and turn mushy.", "author": {"@type": "Person", "name": "Michel Richard"}, "image": null, "totalTime": "PT8H45M", "recipeYield": "6 to 10 servings", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "appetizer, side dish, brioche, tomato, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 303, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "6 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "866 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 1/2 pounds ripe field tomatoes (about 10 large ones)", "7 tablespoons extra virgin olive oil", "5 cloves garlic, finely chopped", "1 1/2 cups finely diced red onion", "7 tablespoons red wine vinegar", "Salt and freshly ground black pepper", "1 unsliced loaf brioche, pain de mie or other fine-textured white bread", "1 1/2 cups minced Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring large pot of water to boil. Using slotted spoon, dip tomato in for a few seconds and remove. Repeat until skin cracks, and set aside to cool. Repeat with remaining tomatoes. Slip skins off, and cut tomatoes in half. Remove cores and seeds. Cut flesh into 1/4-inch dice, and place in large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small sauté pan over low heat, heat 1 tablespoon oil and sauté garlic just until softened, not browned. Add to tomatoes with onion, vinegar and remaining oil. Season with salt and pepper. Toss to mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 11 1/2-by-4-by-3-inch terrine with plastic wrap. Remove crust from bread, and cut loaf lengthwise to make a slice 1/4 inch thick to fit bottom of mold. (If necessary, use more than one slice, fitting them together in an even layer.) Spoon a third of the tomatoes evenly across bread, and sprinkle with a third of the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with another 1/4-inch layer of bread. Add a third of the tomatoes and a third of the parsley. Repeat with last layers of bread, tomato and parsley, and top with bread. Spread any juices over bread. Cover with plastic, and place brick or similar weight on top. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, lift terrine from mold and remove plastic wrap. Using a serrated knife, cut terrine into slices 1/2-inch thick. Serve 2 as side dish, or 3 as first course."}]}