{"@context": "http://schema.org", "@type": "Recipe", "name": "Butterflied Leg of Lamb With Lemon Salsa Verde", "description": "One of the joys of a butterflied leg of lamb is that it satisfies lovers of rare and medium-well meat  at the same time. This is because of its uneven thickness. When you spread the meat out and roast or grill it at high heat, the thicker parts stay pinker than the thinner bits. Everyone ends up happy. Here, the meat is seasoned with cumin, lemon, chiles and plenty of fresh herbs, and is served with a mixed-herb salsa verde perked up with preserved lemon. It makes a particularly zesty main course for any large gathering. If you would rather grill the lamb, go right ahead. It will take about 12 to 17 minutes per side when grilled directly over the coals or flames.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/12/09/dining/clark-leg-of-lamb-still/clark-leg-of-lamb-still-mediumThreeByTwo440.jpg", "totalTime": "PT1H45M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "lamb, parsley, preserved lemon, red pepper, Turkish chile, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 200}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 410, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "2 grams", "proteinContent": "31 grams", "saturatedFatContent": "11 grams", "sodiumContent": "490 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 boneless butterflied leg of lamb, 5 to 6 pounds, well trimmed", "2 1/2 teaspoons coarse kosher salt, more as needed", "1 1/2 teaspoons black pepper", "7 garlic cloves, grated on a Microplane or minced", "1/4 cup chopped fresh thyme leaves", "1/4 cup chopped fresh oregano or marjoram leaves", "2 teaspoons ground cumin", "1 teaspoon Turkish chile such as Marash or Urfa (or use crushed red pepper flakes)", "Finely grated zest of 2 lemons", "2 1/2 tablespoons fresh lemon juice, more as needed", "5 tablespoons extra-virgin olive oil", "3 to 4 tablespoons minced preserved lemon, to taste", "3/4 cup chopped parsley", "1/2 cup chopped cilantro", "1/2 cup chopped mint", "2 scallions, white and green parts, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat lamb dry with paper towels and place on a rimmed baking sheet. Season all over with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 1 teaspoon of the garlic. In a bowl, combine remaining garlic with thyme, oregano or marjoram, cumin, chile, lemon zest and 2 tablespoons lemon juice. Drizzle in about 1 tablespoon oil, just enough to create a sandy paste. Rub mixture all over lamb. Cover with plastic wrap and let marinate for at least 1 hour or, even better, overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salsa verde: In a small bowl, combine a pinch of salt, the remaining teaspoon garlic, remaining 1/2 tablespoon lemon juice, 3 tablespoons preserved lemon, parsley, cilantro, mint and scallion and stir well. Drizzle in remaining oil. Season with more preserved lemon, lemon juice, salt and pepper to taste. Let the mixture sit for at least 30 minutes before serving to allow the flavors to meld and mellow."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Roast lamb without turning for 22 to 35 minutes, until a thermometer inserted into the thickest part reads 120 degrees for rare and 130 for medium. Let rest for 10 minutes before slicing and serving with the salsa verde."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Roasted Butterflied Leg of Lamb", "description": "Roasting a boneless leg of lamb cuts the cooking time in half for this classic dinner-party dish.", "thumbnailUrl": "https://static01.nyt.com/images/2016/12/09/dining/clark-leg-of-lamb-still/clark-leg-of-lamb-still-mediumThreeByTwo440.jpg", "uploadDate": "2016-12-09T16:54:01.000Z", "duration": "PT2M37S"}}