{"@context": "http://schema.org", "@type": "Recipe", "name": "Jim Harrison’s Caribbean Stew", "description": "Jim Harrison, the poet and epicure, hunter and fisherman, novelist, essayist and enthusiastic cook, published a version of this recipe in the literary magazine Smoke Signals in 1981. I adapted it more than three decades later, after Harrison's death in 2016. The key ingredients: a lot of tomato paste and a good, floral hot sauce, ideally made with Scotch bonnet peppers, which combine in marvelous ways. Parboiling the ribs allows the recipe to come together relatively quickly, and the cooking otherwise is totally serial: one step after another until you slide the pot into the oven and allow the heat to do its work. Substitute different meats, or fewer, if you like, depending on availability.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/04/02/magazine/02eat/02mag-02eat-t_CA0-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "caribbean", "recipeCategory": "soups and stews", "keywords": "chicken thigh, italian sausage, spare ribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 579}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 882, "unsaturatedFatContent": "43 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "72 grams", "fiberContent": "2 grams", "proteinContent": "47 grams", "saturatedFatContent": "22 grams", "sodiumContent": "894 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds pork spareribs, cut into single ribs", "2 tablespoons neutral oil, like canola or grapeseed", "4 chicken thighs, bone-in and skin-on", "Kosher salt and freshly ground black pepper, to taste", "4 Italian sausages, hot or sweet", "1 large yellow onion, peeled and sliced", "4 cloves of garlic, peeled and minced", "1/4 cup tomato paste", "1 tablespoon plus 1 teaspoon red-wine vinegar", "1 tablespoon plus 1 teaspoon lemon juice", "3 tablespoons hot-pepper sauce, ideally one made with Scotch bonnet peppers, or to taste", "1 cup chicken stock, homemade or low-sodium", "1/2 teaspoon white sugar", "4 dashes Worcestershire sauce", "1 1/2 teaspoons chile powder", "1 1/2 teaspoons paprika"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place spareribs in a pot, and cover with water. Place pot over high heat, and bring to a boil. Lower heat slightly, and cook, covered, for 15 or 20 minutes, then remove ribs to a large bowl and discard the water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the ribs cook, pour the oil into a Dutch oven set over high heat, and swirl it around. Season the chicken thighs with salt and pepper, and when the oil begins to shimmer and is about to smoke, add them to the pan, skin-side down. Brown the chicken aggressively, about 5 to 7 minutes per side, then add the chicken to the bowl with the ribs. Repeat with the sausages, browning them on all sides for approximately 5 to 7 minutes, then add to the bowl with the chicken and the ribs. Cook the onions and garlic in the fat remaining in the Dutch oven, stirring occasionally until they soften and begin to brown, approximately 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300. Add the tomato paste, vinegar, lemon juice, hot-pepper sauce, chicken stock, sugar, Worcestershire sauce, chile powder and paprika to the onions and garlic in the Dutch oven, then stir to combine, and allow to cook for 1 to 2 minutes. Add the meats to the Dutch oven, stirring and tossing them so that they are well covered with the sauce, then cover the pot, and place in the oven to cook, undisturbed, for approximately 90 minutes, or until the meats are tender and, in the case of the chicken and the ribs, pulling from the bone."}]}