{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Sugar Cookies", "description": "Everyone needs a good sugar cookie recipe. If you can master the very simple technique behind this one dough, you have several variations at your disposal, most likely without a trip to the grocery store.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/11/29/dining/ar-sugar-cookies/merlin_113902339_ca909e6c-c1ed-41d4-8782-b5fcda0af2a7-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "4 1/2 dozen cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "butter, eggs, flour, sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 960}, "recipeIngredient": ["3 1/2 cups/510 grams all-purpose flour", "1 teaspoon baking powder", "1 teaspoon kosher salt", "1 1/2 cups/340 grams unsalted butter (3 sticks), at room temperature", "1 1/4 cups/250 grams granulated sugar", "2 large eggs", "1 teaspoon vanilla extract", "Frosting, glaze or royal icing", "Edible glitter or food-grade luster dust"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, using an electric mixer, beat together butter and sugar on medium-high until the mixture is light, fluffy and pale, 2 to 3 minutes. Scrape down sides of the bowl, and add eggs, one at a time, beating well after each addition. Add vanilla, and beat until everything is well combined, stopping to scrape down the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add dry ingredients all at once, and mix on low speed just until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape dough out of bowl and divide it in half. Wrap each piece in plastic wrap, patting into a 1-inch-thick disk. Chill at least 2 hours and up to 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Roll out dough, one disk at a time, on lightly floured parchment paper or work surface until it's about 1/8 inch thick. Create shapes, using a lightly floured cookie cutter. (Alternatively, using a knife, cut the dough into squares, rectangles or diamonds.) If at any point the dough becomes too soft to cut and cleanly remove from parchment paper, slide it onto a cookie sheet and chill for a few minutes in the freezer or refrigerator. Gather any dough scraps and combine them into a disk. Roll and repeat the cookie-cutting process, chilling as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place shapes onto parchment-lined baking sheets 1 inch apart and bake until cookie edges are lightly browned with sandy, pale centers, 12 to 15 minutes, rotating the sheets halfway through. Cool the cookies on a rack, if you have one. Otherwise, let them cool on the pan. Decorate with a glaze, royal icing, frosting, glitter, food-grade luster dust or whatever you'd like. Don’t forget the sprinkles."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Basic Sugar Cookies", "description": "How to make classic sugar cookies.", "thumbnailUrl": "https://static01.nyt.com/images/2018/11/29/dining/ar-sugar-cookies/merlin_113902339_ca909e6c-c1ed-41d4-8782-b5fcda0af2a7-mediumThreeByTwo440.jpg", "uploadDate": "2016-11-29T18:42:42.000Z", "duration": "PT2M20S"}}