{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pork Loin With Herbs, Cumin and Garlic", "description": "Pork loin is an excellent cut to grill for a crowd. The cut is larger and more marbled with fat than a lean tenderloin, which is entirely different and should not be used as a substitute in this recipe. The pork loin has a richer flavor and meatier texture. Butterflying a loin helps it cook quickly and relatively evenly over direct heat, which is the easiest way to go on the grill. If you’d rather cook this in the oven, you can broil the meat: Place the pork, opened and flat, on a rimmed baking sheet, and broil it on low for 7 to 12 minutes per side, until done to taste.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/08/30/dining/30APPE1/30APPE1-articleLarge.jpg", "totalTime": "PT8H40M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat", "keywords": "basil, cumin, garlic, parsley, pork loin, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 205}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 314, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "0 grams", "proteinContent": "37 grams", "saturatedFatContent": "3 grams", "sodiumContent": "417 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 to 4 pounds boneless pork loin, trimmed of some but not all fat", "Grated zest and juice of 2 lemons, plus more lemon wedges for serving", "8 garlic cloves, finely grated or minced", "1/3 cup packed fresh basil leaves and tender stems, plus more for garnish", "1/3 cup packed parsley leaves and tender stems", "3 tablespoons fresh marjoram or oregano leaves", "3 tablespoons cilantro leaves and tender stems", "2 tablespoons thyme leaves, plus more for garnish", "2 tablespoons extra-virgin olive oil", "1 1/2 tablespoons kosher salt", "2 teaspoons ground cumin", "1 teaspoon black pepper", "Large pinch red pepper flakes, plus more for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Butterfly the pork by slicing through it horizontally until you almost cut through, but leaving it attached on one side. Open the meat like a book. Depending upon the cut, it should be about 1 to 2 inches in thickness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a blender, purée all of the remaining ingredients, scraping down the sides of the bowl as needed to get a smooth paste. (Add a little water if needed to make the mixture move.) Spread herb paste all over the pork, making sure to cover it thoroughly and evenly. Place the meat in a large resealable plastic bag (folding it back together like a closed book if necessary to fit it in the bag) and let marinate in the refrigerator for at least 8 hours, or up to 48 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light the grill or heat to medium. Lay the pork out on the grill so it lies flat (like an open book). Cover grill and let cook until char marks appear on one side, 7 to 12 minutes. Use tongs and a large spatula to flip the meat. Continue to cook on the other side until the center of the meat registers 135 degrees on an instant-read thermometer for medium doneness, about 5 to 8 minutes longer. (The pork will continue to cook as it rests.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer meat to a cutting board, cover loosely with foil and let rest for at least 10 minutes before slicing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the pork slices garnished with red pepper flakes, lemon wedges, and basil and thyme leaves."}]}