{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Fritters With Orange Blossom Custard", "description": "This is my take on the Tuscan dessert frittelle di riso. The custard makes these a very special dessert, but you can also just make the fritters, if you like, which makes them more of a snack. They go really well with coffee, either served as they are or with  whipped cream.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/03/08/dining/08BAKING-TUSCANFRITTER/08BAKING-TUSCANFRITTER-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "16 fritters", "recipeCuisine": "italian", "recipeCategory": "custards and puddings, finger foods", "keywords": "arborio rice, heavy cream, lemon zest, milk, orange blossom water, orange zest, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["1/2 cup/100 grams arborio rice", "2 cups/500 milliliters whole milk", "3 tablespoons/40 grams granulated or superfine sugar (caster sugar)", "1 star anise", "Finely grated zest of 1 lemon", "Finely grated zest of 1 orange", "Salt", "1 vanilla bean (vanilla pod), slit open lengthwise, seeds scraped out and reserved", "About 3 1/2 cups/800 milliliters vegetable oil, for frying, more as needed", "2 tablespoons rum", "2 large eggs, whites and yolks separated", "1/2 cup/50 grams currants", "1/2 cup plus 1 tablespoon/70 grams all-purpose flour (plain flour)", "3/4 cup/170 milliliters whole milk", "2/3 cup/150 milliliters heavy cream (double cream)", "3 tablespoons/40 grams granulated or superfine sugar (caster sugar)", "Zest of 1 orange, shaved in thin strips", "1 vanilla bean (vanilla pod), slit open lengthwise, seeds scraped out and reserved", "2 large egg yolks", "2 tablespoons/20 grams cornstarch (corn flour)", "1/2 teaspoon orange blossom water", "1 teaspoon lemon juice", "3 tablespoons/40 grams granulated or superfine sugar (caster sugar)", "1 tablespoon plus 1 teaspoon ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rice for the fritters: In a medium saucepan over medium heat, stir to combine the rice, milk, sugar, star anise, lemon and orange zest, a pinch of salt and the vanilla bean and scraped seeds. Once milk begins to simmer, reduce heat to low and cook rice for 25 to 30 minutes, until the liquid is almost all absorbed, stirring occasionally to make sure it doesn’t stick to the bottom of the pot. Transfer cooked rice to a medium container, let cool for about 15 minutes, then cover and refrigerate for about 2 hours, or overnight. (If you chill the mixture overnight, let it come to room temperature before forming the fritters.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the custard: Heat the milk, heavy cream, sugar, orange zest and vanilla bean and seeds in a small saucepan over medium-high heat. Remove from heat when bubbles begin to form around the edges, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate small bowl, whisk egg yolks with the cornstarch, orange blossom water and lemon juice to make a smooth paste. Slowly pour the warm milk and cream into the paste, whisking continuously to make sure there are no lumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the mixture to the pan over medium heat and cook for about 3 minutes, until you get a thick custard, whisking constantly. Remove the orange zest and vanilla bean, scraping off any custard that clings. Transfer to a small bowl, let cool for about 15 minutes, then cover the surface directly with plastic wrap and refrigerate for at least 1 hour or overnight, until completely cool and set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, fry the fritters: Fill a deep saucepan with about 2 inches/5 centimeters vegetable oil and bring to 350 degrees Fahrenheit/180 degrees Celsius over medium heat. (You may need more than 3 1/2 cups/800 milliliters oil; getting the proper depth is important to make sure the fritters fry properly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, mix cinnamon and sugar together and set aside on a large plate. Remove the rice mixture from the fridge and discard the star anise and vanilla bean. Using your hands, break up the rice mixture, then stir in the rum and the two egg yolks until the mixture is uniform, using your hands if necessary. Add currants and flour and mix well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the two egg whites with a pinch of salt in a stand mixer on high speed until stiff peaks form. Gently fold egg whites into rice mixture until no streaks of white remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the oil is up to temperature, use two tablespoons to drop spoonfuls of the rice mixture into the oil; each fritter should be a 1-inch/3-centimeter sphere. (An old-fashioned ice cream scoop also works well.) Fry five or six fritters at a time, for 1 to 2 minutes on each side, until crisp, golden brown and puffy. Using a slotted spoon, transfer fritters to a paper towel-lined plate to remove excess oil, and then immediately roll in the cinnamon sugar. Serve warm by themselves, or with the cold custard if you’ve made it, or with some whipped cream."}]}