{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Stuffed With Herbs, Walnuts and Pomegranate", "description": "During Nowruz, the Persian New Year, it's traditional to eat fish, a symbol of life. This version, adapted from the chef Hanif Sadr, is stuffed with bij, a mixture of chopped herbs, walnuts and pomegranate molasses that forms the base of many northern Iranian dishes. After a short turn in a hot oven, the fish emerges with crisp, brown skin. The sweet and sour herb filling contrasts with the delicate, flaky fish without overwhelming it. You can use a food processor to chop the herbs if you’d like. It's key to do the herbs in batches (don't overfill the bowl of the processor), to pulse rather than run and to stop and scrape a few times for even chopping. Work until the pieces are nice and small, about an eighth of an inch or the size of a small sunflower seed, but not so far that they begin to break down and form a paste.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/03/15/dining/15NOWRUZ7/15NOWRUZ7-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, seafood", "keywords": "branzino, chives, cilantro, dill, parsley, pomegranate molasses, rainbow trout, walnut, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 152}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 583, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "2 grams", "proteinContent": "62 grams", "saturatedFatContent": "6 grams", "sodiumContent": "933 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons olive oil, more as needed", "2 large shallots, minced", "Salt", "1/2 cup very finely chopped parsley leaves and tender stems (about 1 small bunch)", "1/2 cup very finely chopped cilantro leaves and tender stems (about 1 bunch)", "1/4 cup very finely chopped dill leaves and tender stems (about 1 small bunch)", "1/3 cup very finely chopped chives (about 1 bunch)", "2 sprigs tarragon, leaves stripped and very finely chopped", "1/4 cup very finely chopped scallions (about 3 scallions)", "4 cloves garlic, minced", "1/2 cup walnuts, finely ground in a food processor", "1/2 teaspoon finely grated orange zest", "1/2 cup freshly squeezed orange juice (about 1 orange)", "1/4 cup freshly squeezed lime juice (about 2 limes)", "2 tablespoons pomegranate molasses", "2 tablespoons tobiko (flying fish roe), optional", "4 whole branzino or rainbow trout, 1 pound each, butterflied"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 475 degrees. Set a large frying pan over medium heat and add 2 tablespoons olive oil. When oil shimmers, add shallots and a pinch of salt. Cook, stirring occasionally, for 10 to 12 minutes until the shallots are tender and golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place herbs, scallions, garlic and walnuts in a large bowl. Stir well with a wooden spoon to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 2 tablespoons oil to the pan, then add the herb mixture. Add a generous pinch of salt and continue to cook, stirring occasionally, until herbs begin to soften, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine zest, orange juice and lime juice in a small bowl or glass. Add 6 tablespoons of the juice mixture to the herbs and cook another 4 minutes, until the taste of raw garlic subsides and the liquid simmers away. Add pomegranate molasses and tobiko, if using. Cook, stirring, for another 2 minutes, until molasses is absorbed. Remove from heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fish with salt, inside and out. Lay the fish open on a cutting board and drizzle 1 tablespoon juice mixture onto the flesh of each fish. Spoon about 1/4 cup stuffing inside each fish and tie closed with kitchen twine spaced 2 inches apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly drizzle a baking sheet with olive oil and lay fish on the sheet. Drizzle remaining juice over fish. Roast until flesh is opaque, flaky and firm to the touch, 18 to 20 minutes. Serve hot or at room temperature."}]}