{"@context": "http://schema.org", "@type": "Recipe", "name": "Portuguese Egg Custard Tarts", "description": "These diminutive egg tarts — pasteis de nata — a specialty all over Portugal, have a cinnamon flavored custard nestled in a flaky puff pastry crust. The trick here is to bake them in a very hot oven, which causes the custard to puff and the pastry to turn brown and crunchy. You can make the crust and filling ahead, but don’t bake them more than an hour or two before serving. They’re at their best still warm.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/03/16/dining/16APPY3/16APPY3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "48 tarts", "recipeCuisine": "portuguese", "recipeCategory": "pies and tarts", "keywords": "dessert, egg, milk, puff pastry", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 264}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 486, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "7 grams", "sodiumContent": "162 milligrams", "sugarContent": "29 grams", "transFatContent": null}, "recipeIngredient": ["14 ounces all-butter puff pastry, thawed if frozen", "1 cup/200 grams granulated sugar", "1 cinnamon stick", "1 cup plus 6 tablespoons/330 milliliters whole milk", "1/2 cup/65 grams all-purpose flour", "6 large egg yolks", "Ground cinnamon, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll puff pastry into an 18-inch/46-centimeter square. Starting with the edge closest to you, tightly roll the dough into a log. Wrap in plastic wrap and refrigerate until very firm, at least 30 minutes and preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 500 degrees and arrange the oven racks in the top third and lower third of the oven. Place 2 cookie sheets on the oven racks while the oven heats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine sugar, cinnamon stick and 2/3 cup/165 milliliters water. Bring to a boil and cook 1 minute. Turn off heat and let stand until you’re ready to use it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll the firm log of pastry on a lightly floured surface until 1 inch/2 1/2 centimeters in diameter. Trim the ends, then cut the log into 1/2-inch/12-millimeter slices. (You should have 48.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rolling pin, roll one of the pastry rounds into a 2 1/2-inch/63-millimeter circle. Place pastry into the cavity of a mini-muffin tin, and press to evenly flatten the dough against the bottom and sides of the cavity, extending about 1/16 inch/3 millimeters above the rim of the pan. The dough should be about 1/16 inch/3 millimeters thick, with the bottom a bit thicker than the sides. Repeat with the remaining dough, chilling the cut rounds if dough becomes difficult to roll. Refrigerate crusts until firm, at least 10 minutes.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the dough chills, finish the filling: In a small saucepan, heat 1 cup plus 1 tablespoon/255 milliliters milk over medium-low heat until bubbles begin to form around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk flour with the remaining 5 tablespoons/75 milliliters milk. Continue whisking while adding the hot milk in a slow, steady stream. Discard the cinnamon stick from the sugar syrup and whisk the syrup into the milk mixture in a steady stream. Return to the saucepan and cook over medium-low heat, whisking constantly, until thickened, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the yolks in a large bowl. Whisking constantly, add hot milk mixture to eggs in a slow stream until fully incorporated. Strain through a fine-mesh sieve. Pour warm filling into pastry shells until they’re three-quarters full."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer tarts to the cookie sheets in oven and bake until the shells are golden brown and crisp, and the custards are golden brown and darkened in spots, 15 to 19 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool in the pans on a wire rack for 5 minutes, then pop out tarts to continue cooling on the racks for another 5 minutes. Sprinkle with cinnamon and serve warm."}]}