{"@context": "http://schema.org", "@type": "Recipe", "name": "Umbrian-Style Chicken alla Cacciatora", "description": "Chicken alla cacciatora, or hunter’s style, is found all over Italy — but for a long time, tomatoes were not. Most Americans know the southern Italian version, with tomatoes, but this one is from Umbria, in the country's center, and it’s made savory with lemon, vinegar, olives and rosemary instead of tomatoes. It’s lovely served with steamed greens dressed with a fruity olive oil, over homemade mashed potatoes or polenta.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/09/14/dining/14UMBRIA-RECIPES1/14UMBRIA-RECIPES1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "capers, chicken, olives, rosemary, sage leaves, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1005}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 590, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "3 grams", "proteinContent": "53 grams", "saturatedFatContent": "8 grams", "sodiumContent": "942 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon plus 1 teaspoon olive oil", "1 small chicken (about 2 1/2 pounds), cut into serving pieces, or use bone-in, skin-on thighs and drumsticks", "1 onion, sliced", "2 to 3 cloves garlic, very finely minced", "1 tablespoon capers", "1/4 cup good-quality brine-cured olives, black or green, with pits", "1 sprig rosemary", "1 handful sage leaves", "Salt and black pepper", "1 cup dry white wine", "Zest and juice of 1/2 lemon", "1 tablespoon balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon olive oil in a large non-stick pan. Add chicken pieces and sear over medium heat until golden on all sides, about 15 minutes. Transfer to a plate and wipe the pan clean before proceeding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat to low, add remaining 1 teaspoon oil, and return the chicken to the pan. Add onions and stir frequently until caramelized, about 18 minutes. Add minced garlic, capers, olives, rosemary sprig and sage leaves. Season with just a sprinkle of salt and black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After a couple of minutes, when everything smells fragrant, add wine. Cover and simmer very slowly until the chicken is tender and cooked through (165 degrees). Start checking the temperature of the chicken after 15 minutes to avoid overcooking. Add some water if the sauce gets too dry while simmering."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, reheat if necessary, then add lemon juice and zest and balsamic vinegar. Taste and add more lemon if desired. Remove the rosemary sprig and serve."}]}