{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Green Tomatillo Salsa", "description": "I make this tangy, versatile tomatillo salsa to accompany a range of Mexican and Tex-Mex dishes. It’s always great with shrimp and fish, and it’s my go-to salsa for tacos with chicken in the filling, and with vegetables like potatoes and greens, summer squash and corn. I roast the tomatillos under the broiler before blending them to get a deep, toasty flavor. You can also roast the chiles if you want a deeper roasted-spicy flavor, as opposed to grassy-spicy flavor. If you wish to roast the chiles alongside the tomatillos, place the whole chiles on the baking sheet, too; they will be done faster than the tomatillos, only a minute or two on each side. Once they're cool enough to handle, peel and stem them, and coarsely chop, then proceed with the recipe.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/05/11/dining/11FAJITAS7/11FAJITAS7-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 cups", "recipeCuisine": "mexican, southwestern", "recipeCategory": "dips and spreads", "keywords": "gluten-free, vegan, vegetarian, jalapeño, onion, tomatillo", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 95}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 42, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "3 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "302 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound tomatillos, husked and rinsed", "2 to 4 jalapeño or serrano chiles, to taste, coarsely chopped (and seeded, if you would like a milder salsa)", "1/4 cup chopped white or yellow onion, soaked for 5 minutes in cold water, drained and rinsed", "1 garlic clove, peeled and halved (optional)", "1/2 cup coarsely chopped cilantro", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler, positioning a rack at the highest setting under the heat. Cover a baking sheet with foil and place tomatillos on top, stem side down. Broil 2 to 5 minutes, until charred on one side. Turn tomatillos over and broil 2 to 5 minutes longer, until charred. Transfer tomatillos to a blender, tipping in any juice that may have accumulated on the foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chiles, onions, garlic (if using), cilantro and 1/4 cup water to blender and blend to a coarse purée. Transfer to a bowl and thin out as desired with water. Taste and adjust salt. Set aside for at least 30 minutes before serving, to allow the flavors to develop."}]}