{"@context": "http://schema.org", "@type": "Recipe", "name": "San Hua Kao Ji, Three-Flower Roast Chicken", "description": "This dish is similar to the classic Sichuan tea-smoked duck, which uses Sichuan peppercorn in a gentler way than that usually associated with the cuisine. With very lightly dressed greens, it makes a light summer meal. As a Chinese meal, it is served as a warm or room temperature starter and would pair well with stir-fried greens and plain steamed rice. The chicken has a wonderful delicate texture, thanks to the Chinese poaching technique, which keeps the meat silky and moist.", "author": {"@type": "Person", "name": "Chris Buckley"}, "image": "https://static01.nyt.com/images/2016/06/15/dining/15JPSICHUAN4/15JPSICHUAN4-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "chicken, Chinese rice wine, ginger, jasmine tea, sichuan peppercorns, star anise, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 330, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "25 grams", "saturatedFatContent": "6 grams", "sodiumContent": "669 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons kosher salt", "2 tablespoons Chinese rice wine, like liao jiu or Shaoxing", "1 tablespoon plus 1 teaspoon red Sichuan peppercorns", "1 tablespoon good-quality jasmine tea leaves", "1 teaspoon black pepper", "1/2 cup coarsely chopped scallion", "1 tablespoon coarsely chopped peeled fresh ginger", "1 3- to 3 1/2-pound whole chicken", "1/2 cup kosher salt", "5 dried whole red chile peppers, about 3 inches long", "3 tablespoons good-quality jasmine tea leaves", "3 whole scallions, coarsely chopped", "3 1/4-inch-thick slices ginger", "2 whole star anise", "6 bay leaves", "1/4 cup good-quality jasmine tea leaves", "2 whole scallions", "2 1/4-inch-thick slices ginger", "1 whole star anise", "2 bay leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the chicken: Combine all marinade ingredients in a blender or food processor and pulse into a coarse paste. Wash chicken and pat dry, then prick the thick part of the breast, legs and thighs with a sharp fork. Rub cavity and skin with paste; put chicken in a resealable bag and let rest about 10 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach the chicken: Combine all the poaching seasonings with 3 quarts water and bring to a boil in a 5-quart heavy pot. Add chicken, breast side down, and reduce heat to a simmer. Cook, covered, 15 minutes. Turn off heat and let chicken stand, covered, for 30 minutes. Turn chicken over, cover it again and let stand another 15 minutes. Remove chicken from pot and let it drain. Allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Steep tea leaves in hot, but not boiling water (about 180 degrees) about 3 minutes. Drain, reserving wet leaves. Stuff chicken with half the leaves and the remaining ingredients. Coat chicken with remaining leaves. Discard tea. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Loosely wrap chicken with a large piece of foil and set it on a baking sheet. Poke 4 to 5 small holes in foil to allow steam to escape and liquid to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake chicken 30 minutes on the middle rack, then remove from oven, discard foil and drain any liquid. Return chicken to baking pan, breast side up, and bake until dark brown, 45 minutes to an hour. Cool slightly, then gently pull chicken meat in coarse strips. Discard skin, bones and stuffing. Serve chicken warm or cool with some of tea leaves."}]}