{"@context": "http://schema.org", "@type": "Recipe", "name": "Southern Cornbread Dressing", "description": "Cornbread dressing is an intensely personal thing. In the American South, at least, everybody’s grandmother had a recipe, and everyone knows just how it should be made. This is a base model with a few variations. It’s nice to let it chill overnight before baking so the flavors meld. But you don’t have to. The key is really good stock, though plenty of cooks over the years have made it with whatever was on hand — even water in a pinch. This is food for sustenance. But it pays to use the best ingredients possible. Be sure to leave enough time — the cornbread needs to sit out overnight to harden slightly before you make the dressing.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/11/09/dining/09SUBCORNBREAD1/09SUBCORNBREAD1-articleLarge.jpg", "totalTime": "PT9H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american, southern", "recipeCategory": "stuffing and dressing", "keywords": "buttermilk, cornmeal, white bread, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 163}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 379, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "10 grams", "sodiumContent": "672 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 tablespoons/56 grams butter", "2 cups/340 grams yellow cornmeal, fine grind (use the freshest, best quality you can find)", "1 1/2 teaspoons kosher salt", "1 teaspoon baking powder", "2 eggs", "2 cups/473 milliliters buttermilk, preferably full fat", "3 cups soft white bread, crust removed and torn or cut into 1-inch pieces (do not pack)", "1/2 cup butter (1 stick), plus more for the pan", "2 cups chopped sweet onions", "1 1/2 cups chopped celery (4 or 5 stalks)", "1 1/2 teaspoons kosher salt", "2 eggs", "1 1/4 tablespoons finely chopped fresh sage", "1 teaspoon chopped fresh thyme", "3/4 teaspoon ground black pepper", "4 to 5 cups rich chicken or turkey stock, preferably homemade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cornbread: Heat oven to 450 degrees. Put butter in an 11-inch skillet. Cast-iron is best here, but any ovenproof skillet will do. Heat butter in oven for about 5 to 7 minutes, or until butter has melted and is just starting to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While butter melts, whisk together cornmeal, salt and baking powder. In another small bowl, lightly beat eggs, then add buttermilk and stir until mixture is combined. Pour egg mixture into dry ingredients and stir well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove hot pan from oven, pour butter into batter and stir until batter looks uniform. Pour batter back into the pan and bake for 20 minutes or until the top has begun to just brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cornbread and let it cool on a rack. Tear or cut it into large pieces and place in a large bowl. Let it sit out overnight to dry out slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dressing: Heat oven to 350 degrees. Combine cornbread and white bread in a large bowl, tossing to mix, and breaking cornbread into smaller pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a large skillet, and add onions, celery and 1/2 teaspoon salt. Sauté until vegetables have softened, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add vegetables to bread mixture and combine. Lightly beat eggs and add to bowl. Sprinkle in herbs, remaining 1 teaspoon salt and the pepper and toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 cups broth and stir well. Using your hands, work the mixture to get a very lumpy, thick, batterlike consistency. Add another cup of stock if needed. The mixture should be very wet and pourable but without standing liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter an 8-by-11-inch baking dish. (Any other ovenproof dish that can hold about 2 quarts will work. A deeper vessel could take longer to bake; a more shallow dish less time.) Pour the mixture into the baking dish and bake until dressing puffs slightly and has browned well around the edges, about 45 minutes to 1 hour. If you have drippings from a roasted turkey, spoon some over the top about 30 minutes into the baking time."}]}