{"@context": "http://schema.org", "@type": "Recipe", "name": "Nordic Whole-Grain Rye Bread", "description": "Scandinavian rye breads look nothing like the slices that clamp together the sandwiches at your neighborhood deli in New York. Made from whole grains and naturally risen, they are chewy, fragrant and deliciously dark. With butter and cheese, or as the base for avocado toast, they are amazingly satisfying. The taste and texture are addictive, and many enthusiasts also appreciate that rye bread contains more fiber and less gluten than wheat. This recipe, with a small amount of yeast, is quicker than the truly ancient version, which takes at least three days. Don't worry if the dough seems runny and sticky: That is typical of rye bread, which needs lots of water to soften the grain.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/01/11/dining/11RYE-slide-9T8W/11RYE-slide-9T8W-articleLarge.jpg", "recipeYield": "2 large or 3 medium loaves", "recipeCuisine": "", "recipeCategory": "breads", "keywords": "Nordic, rye", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 205}, "recipeIngredient": ["1/3 cup/85 grams buttermilk, skyr or yogurt, at room temperature", "2 cups/250 grams medium rye flour", "½ teaspoon/2 grams active dry yeast", "2 cups/340 grams cracked rye berries or coarse rye meal", "1 cup/170 grams sunflower seeds", "4 cups/400 grams medium rye flour", "4 teaspoons/20 grams kosher or coarse sea salt", "3 tablespoons/40 grams malt syrup or molasses (not blackstrap)", "½ teaspoon/2 grams active dry yeast"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On Day 1, make the starter: In a medium-size bowl, mix 3/4 cup warm water with the buttermilk or yogurt. Whisk flour and yeast together, add to the buttermilk mixture and use your hands to mix together until sticky and moist; add more warm water as needed. Cover tightly and set aside at cool room temperature overnight, or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Also on Day 1, soak the grains: Mix 4 cups cold water with the rye berries (or meal) and sunflower seeds. Cover and set aside at cool room temperature overnight, or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On Day 2, make the bread: Drain the soaked grains in a colander. Measure 35 ounces/1,000 grams of the grains and place in a deep bowl. Add 14 ounces/400 grams of the starter and mix well. (Any remaining starter can be saved to use with other bread recipes.) Add the flour, salt, malt (or molasses), yeast and 2 cups water. Mix dough firmly by hand to combine. The dough should be grainy, but quite runny and wet, almost like a thick batter. To achieve that texture, add cold water, 1/4 cup at a time, mixing after each addition. To test: When a walnut-size piece of dough smeared on the rim of the bowl slides slowly and smoothly down the inside, like a snail leaving a trail, the dough it is wet enough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thickly butter 3 medium or 2 standard-size loaf pans. Divide the dough evenly among the pans, filling them about half full. Cover and let rise at room temperature until dough almost fills pans, about 2 hours. (Dough will not rise more during baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees.  Bake loaves for 10 minutes, then reduce heat to 360 and bake until firm and glossy brown, 80 minutes to 2 hours more depending on size and moisture content of loaves. Let cool completely in the pans before turning out. Bread freezes well, and lasts for at least a week at room temperature, wrapped in paper."}]}