{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Duck Legs With Plums and Red Wine", "description": "This is a deep, dark, flavorful braise, perfect for cool weather. The plums and red wine add body, sweetness and a touch of acidity to the rich sauce. Look for small Pekin (sometimes called Long Island) duck legs, about 8 ounces each; they cook more quickly and are more tender than the larger Muscovy duck legs some butchers carry. If small duck legs are unavailable, chicken legs may be substituted. You may be tempted to brown the legs in the Dutch oven rather than the skillet called for in Step 2, but a roomy skillet (cast iron if possible) does the job better and saves time in the long run — you can brown more legs at a time.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/10/19/dining/19KITCHEN-DUCKLEGS1/19KITCHEN-DUCKLEGS1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "duck leg, pistachio, plum, red wine, star anise, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 97}, "recipeIngredient": ["8 duck legs, about 4 pounds", "2 tablespoons kosher salt", "1/2 teaspoon black pepper", "1/4 teaspoon ground clove", "1/4 teaspoon ground allspice", "Pinch of cayenne", "2 cups diced red onion", "1 tablespoon tomato paste", "1 cup dry red wine", "4 cups chicken broth", "1 (1-inch) piece of cinnamon stick", "2 pieces star anise", "1 bay leaf", "2 pounds small purple free-stone plums, halved, pits removed", "1 tablespoon butter", "1/2 cup chopped parsley", "3 tablespoons finely sliced chives", "1/4 cup roughly chopped pistachios", "1 teaspoon grated lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the duck legs on a baking sheet in one layer. In a small bowl, mix together salt, pepper, clove, allspice and cayenne. Sprinkle salt mixture evenly over duck legs on both sides. Set aside for 20 minutes. (Alternatively, wrap and refrigerate seasoned legs for several hours or overnight.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a wide, heavy skillet (preferably cast iron) over medium-high heat. When the pan is hot, add duck legs skin side down. Legs will begin to exude fat and sizzle. Let them cook, without moving them, until nicely browned, about 10 minutes. Turn legs and cook on other side for 10 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove browned legs from pan and set aside. Pour off all but 2 tablespoons duck fat (save remaining fat for future use). Add diced onion to pan and cook over medium-high heat, stirring occasionally, until softened and lightly browned, 8 to 10 minutes. Add tomato paste, stirring to incorporate, then add wine and broth and bring to a simmer. Add cinnamon stick, star anise and bay leaf. Chop half the plums into 1/2-inch pieces and add to the simmering broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Transfer duck legs to a Dutch oven or large heavy-bottomed pot. Pour the hot broth mixture over legs, then cover and bake for 20 minutes. Lower heat to 350 degrees and bake for 30 to 40 minutes more, until legs are quite tender when pierced with a skewer. Remove pot from oven and skim fat from surface. (You may prepare the dish to this point 1 to 2 days in advance, if desired.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat butter in a wide skillet over medium-high heat. Add reserved plums cut side down and sauté for a minute or so, until lightly browned, then turn and cook on skin side for a minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer duck legs to a warm platter and spoon the hot sauce over them. Garnish with sautéed plums. Mix together parsley, chives, pistachios and lemon zest. Sprinkle parsley mixture over the top and serve."}]}