{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Tomato Salad With Sumac and Herbs", "description": "Layered flavors are the secret behind this chicken salad, from the chef Sara Kramer of Kismet in Los Angeles. After grilling the chicken and letting it rest, reserve the chicken juice to whisk into a vinaigrette of olive oil and lemon juice. Then add chile crisp, that chile-flake-in-oil condiment some Chinese restaurants have on the table, and augment it with toasted and crushed coriander, fennel seed and cardamom. Kismet makes its own shallot powder with dehydrated shallots, but you could use onion powder instead, or fry up some shallots, garlic or onion, mince them with a chef's knife, and add them to the dressing. Finally, the vinaigrette gets a generous spoonful of sumac for an elegantly tart note. You should use the best-looking herbs and greens at your local greenmarket. If there are several kinds of basil or mint, grab them. This recipe is less a precise formulation than a structure for a dish that you will make your own. If you're tight on time, grill the chicken ahead, even the day before (and, if you can’t grill, poach the chicken in chicken stock with aromatic herbs). When it’s time, assemble the ingredients and serve with grilled bread or a bowl of rice.", "author": {"@type": "Person", "name": "Oliver Strand"}, "image": "https://static01.nyt.com/images/2017/07/12/dining/12CHEF2/12CHEF2-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "arugula, basil, chicken, chile crisp, cilantro, mint, sumac, main course, side dish, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 64}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 638, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "3 grams", "proteinContent": "40 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1039 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (4-pound) whole chicken, spatchcocked, or cut into 8 pieces", "Olive oil", "Salt and pepper", "1 white onion", "1 small bunch mint, leaves only", "1 small bunch cilantro, leaves only", "1 small bunch basil, leaves only", "1 small bunch arugula (about a cup), or other flavorful leafy greens, woody stems trimmed", "2 to 3 large ripe tomatoes, cut into 1-inch pieces", "3/4 teaspoon coriander seeds", "3/4 teaspoon fennel seeds", "Juice and zest of 2 lemons, plus more to taste", "1/4 cup extra-virgin olive oil, plus more to taste", "1 tablespoon spicy chile crisp, or other chile oil (see note)", "1/2 teaspoon ground cardamom", "1/2 teaspoon shallot or onion powder", "1 tablespoon sumac, plus more to taste", "Salt and black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly rub the chicken with olive oil, and season with salt and fresh-ground pepper. Heat a grill to roughly 350 degrees (low heat) and be sure your grates are brushed clean. Add chicken skin-side down and cover the grill. Cook over a low flame until just cooked through, about 35 to 45 minutes, depending on whether your chicken is spatchcocked or cut in pieces, turning the chicken over halfway through cooking and moving it to the side if the flame flares up. Let rest on a platter or in a steel mixing bowl until cool. Using your fingers, pull off the meat into large shreds and set aside, discarding (or eating) the skin. Reserve the chicken juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and halve onion, and cut into thin slices. Immediately put onion in an ice bath and let sit for 1 minute, then remove and let drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: Combine the coriander and fennel seeds in a small skillet and toast over low heat until tan and fragrant. Immediately pour seeds onto a cutting board and let cool, then crush. Transfer to a large bowl, and add chicken juices and remaining dressing ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salad: Add chicken to dressing and toss to coat. Add herbs and leafy greens and toss again, then add onions and tomatoes and toss once more. Taste and adjust seasoning, adding salt, pepper, lemon juice, olive oil or sumac as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange salad on a large platter so the chicken, tomatoes and onions are distributed throughout the greens (and not sitting at the bottom)."}]}