{"@context": "http://schema.org", "@type": "Recipe", "name": "Blackout Cake", "description": "This absurdly rich chocolate cake came to The Times in a 1991 article by Molly O'Neill about Ebinger’s, the legendary chain of Brooklyn bakeries that closed its doors in 1972 after 74 years in business. Their wildly popular blackout cake, a three layer devil's food cake filled with dark chocolate pudding, slathered with chocolate frosting and covered with chocolate cake crumbs, had a cult-like following in its day. This recipe isn't authentic (the Ebinger family never shared the original recipe with the public), but Ms. O'Neill claims in her book, “The New York Cookbook: From Pelham Bay to Park Avenue, Firehouses to Four-Star Restaurants,” that this version got the thumbs-up from “a panel of twelve Ebingerites.” That's enough for us.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2017/06/14/dining/14COOKING_BLACKOUTCAKE2/14COOKING_BLACKOUTCAKE2-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "1 cake", "recipeCuisine": "american, german", "recipeCategory": "cakes", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 390}, "recipeIngredient": ["1/2 cup unsweetened Dutch-process cocoa", "1/4 cup boiling water", "2 ounces unsweetened chocolate, chopped", "3/4 cup milk", "2 cups sugar", "2 sticks unsalted butter, slightly softened, plus 2 tablespoons for the cake pans", "4 eggs, separated", "2 teaspoons vanilla", "2 cups flour, plus 1 tablespoon for the cake pans", "1 teaspoon baking powder", "1 teaspoon salt", "1 teaspoon baking soda", "2 tablespoons unsweetened Dutch-process cocoa", "2 cups boiling water", "3/4 cup plus 1 tablespoon sugar", "1 ounce bittersweet chocolate, chopped", "1/4 cup cornstarch", "1 tablespoon cold water", "1/4 teaspoon salt", "1 teaspoon vanilla", "2 tablespoons butter", "12 ounces semisweet chocolate, chopped", "3/4 cup unsalted butter", "1/2 cup hot water", "1 tablespoon corn syrup", "1 tablespoon vanilla"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake, place the cocoa in a small bowl and whisk in the boiling water to form a paste. Combine the chocolate and milk in a saucepan over medium heat. Stir frequently as the mixture warms and the chocolate melts, about 3 minutes. Remove from heat. Whisk a small amount of the heated chocolate milk into the cocoa paste and then whisk the cocoa mixture into the milk mixture. Return to heat, stir for one minute, remove and cool until tepid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a mixer, cream the sugar and butter together. Beat in the egg yolks one at a time and add the vanilla. Slowly stir in the chocolate mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour, baking powder, salt and baking soda. Using a spatula or a wooden spoon, slowly add the flour mixture to the chocolate mixture. In another bowl, whip the egg whites to form soft peaks and, using a rubber spatula, gently fold the egg whites into the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter and lightly flour two 8-inch round cake pans and divide the batter between the two pans. Bake for 45 minutes and cool on a rack for 15 minutes. Gently remove the cakes from the pans and continue to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake is baking, make the filling. Put the cocoa into a saucepan and pour in the boiling water and place over low heat. Add the sugar and chocolate. Dissolve the cornstarch in the cold water to make a smooth paste. Whisk the cornstarch into the water and chocolate, add the salt and bring it to a boil, stirring constantly. Boil for one minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the heat, whisk in the vanilla and the butter, and transfer the mixture to a bowl and refrigerate until cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting. In a double boiler, melt the chocolate. Remove from heat and whisk in the butter, one tablespoon at a time, returning to heat if necessary to melt the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the hot water all at once and stir until smooth. Whisk in the corn syrup and the vanilla. Refrigerate for 20 to 30 minutes before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cake. Use a sharp knife to slice each cake into two disks to form four layers. Set one layer aside. Place one layer on a cake round or plate. Generously swath the layer with filling. Add the second layer and repeat. Add the third layer. Quickly apply a layer of frosting to the top and the sides of the cake and refrigerate for 10 minutes. Meanwhile, crumble the remaining cake layer. Apply a second layer of frosting to the cake, press cake crumbs into the top and sides of the cake, and serve within 24 hours. Store in a cool place."}]}