{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Roast Chicken With Spinach-Ricotta Crostini", "description": "This whole chicken cooked on the grill is truly a best-of-both-worlds recipe: You get the incredibly succulent meat and brittle-crisp, burnished skin of a roast chicken, combined with the deep smoky flavor of the grill. To make it, you essentially use your grill like an outdoor oven, cooking a whole splayed chicken in a skillet instead of directly on the grill grate. Splaying the bird first — that is, flattening the legs so they lay flat in the skillet — helps the dark meat cook quickly and evenly. The skillet helps to distribute the heat and captures the juices, which would otherwise incinerate in the fire. Those juices are then put to good use as a cooking medium for dill-flecked, garlicky spinach. The greens absorb all of the chicken drippings before being heaped upon ricotta-smeared crostini. Added bonus: You don’t have to worry about setting off your smoke detector. Here, the smoke stays in the grill with the bird, which is exactly where you want it.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/05/19/multimedia/clark-grilled-chicken/clark-grilled-chicken-mediumThreeByTwo440.jpg", "totalTime": "PT5H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "ancho chili powder, chicken, dill, ricotta, spinach, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 237}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 797, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "4 grams", "proteinContent": "60 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1327 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 teaspoons kosher salt, more as needed", "1/2 teaspoon black pepper", "1/4 teaspoon high-quality chile powder (ancho or New Mexican are nice)", "Finely grated zest of 1 lemon (save the zested lemon to juice over the crostini)", "1 whole chicken (3 1/2 to 4 pounds), patted dry", "Extra-virgin olive oil, as needed", "2 garlic cloves, thinly sliced", "2 anchovies (optional)", "Pinch red pepper flakes", "1 pound mature spinach leaves, cleaned (12 cups)", "1 cup chopped dill", "4 slices crusty country-style bread, 1/2-inch thick", "Fresh ricotta, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine salt, pepper, chile powder and lemon zest. Rub the chicken inside and out with salt mixture. Place chicken on a rack set over a baking pan to catch any drips, and refrigerate for at least 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a gas grill, or light a charcoal grill for indirect heat (meaning pile the coals on one side of the gill, leaving the other side empty)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a cast-iron skillet on the grate directly over the coals. Cover the grill, and let the pan heat up for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from the refrigerator. Use a sharp knife to cut the skin connecting the legs to the rest of the body. Use your hands to splay the thighs open until you feel the joint pop. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub chicken with oil and place it breast side down in the hot skillet. Cover grill and cook 5 to 7 minutes, until the breast is seared and golden and easily releases from the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs and a spatula for balance, carefully flip chicken and cover the grill again. Continue cooking until the underside of the chicken is starting to brown, 10 to 20 minutes. Make sure the skin doesn’t get too dark; it will continue to brown even as it cooks over indirect heat. You’re looking for a medium golden color here, a shade or two lighter than what you ultimately want it to look like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the skillet over to the unlit side of the charcoal grill, or turn off the burners on your gas grill that are underneath the pan. Cover grill and continue to cook until the bird is cooked through, 10 to 25 minutes longer. An instant-read thermometer should register 155 degrees in the breast. You’ll need to keep your eye on the grill heat as you cook. If you’ve got a thermometer on your grill cover, you’re looking for it to be at about 450 degrees. If it falls below 400 degrees or seems as if it’s not hot enough (i.e., your chicken is cooking too slowly), add more coals or turn up your burners. Use your intuition here."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken from the skillet to a cutting board, and tent with foil to rest. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Throw garlic, anchovies (if desired) and red pepper flakes into the skillet and cook, uncovered, until the garlic starts to sizzle and turn golden, about 20 seconds. Toss in spinach and dill and cook, stirring with your tongs, until just wilted, 2 minutes longer. If the spinach isn't wilting quickly, push the pan back over the flame to direct heat. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bread slices on grill and cook until lightly charred, about 1 minute per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, drizzle toasts with oil and slather with ricotta. Top with spinach mix and a little lemon juice. Serve alongside sliced chicken.  "}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Grilled Roast Chicken", "description": "In the summer, roast chicken on the grill and use the remaining juices to sauté spinach.", "thumbnailUrl": "https://static01.nyt.com/images/2016/05/19/multimedia/clark-grilled-chicken/clark-grilled-chicken-mediumThreeByTwo440.jpg", "uploadDate": "2016-05-20T19:33:18.000Z", "duration": "PT3M3S"}}