{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Rabbit With Green Garlic Sauce", "description": "This recipe came to The Times in a 2007 article by Marian Burros about the then newly burgeoning locavore scene. This dish, adapted from Melissa Kelly, the chef at Primo Restaurant in Rockland, Me., makes the most of spring onions and green garlic, two verdant savories that are abundant before summer.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat", "keywords": "main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 555, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "2 grams", "proteinContent": "53 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1132 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 slices bacon", "8 spring onions including 2 inches of green tops", "1 3- to 3 1/2-pound rabbit, quartered", "Salt and ground dried hot pepper", "2 cups white wine", "2 cloves garlic, peeled and chopped", "2 tablespoons butter", "2 spring onions, peeled and sliced", "1 bunch green garlic, bulbs and green tops separated and sliced", "1 medium Yukon Gold potato, peeled and thinly sliced", "1 clove garlic, peeled and chopped", "2 cups vegetable stock", "Sea salt and ground dried hot pepper."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For rabbit: Heat oven to 375 degrees. Brown bacon in large pan over medium heat until it releases all of its fat. Remove bacon and reserve for other use. Add onions, brown well, and transfer to a plate. Season rabbit with salt and pepper and brown well on all sides. Add wine, garlic, and water to barely cover. Cover and bake until rabbit is tender, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For sauce: Melt butter in saucepan over medium-low heat and add onions and green garlic bulbs. Sauté until tender. Add potato, garlic and stock. Simmer until potato is tender. Add green garlic tops. Let cool. Purée in blender until smooth. Season with salt and pepper to taste, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer rabbit and onions to a platter. Return pan to high heat and reduce broth to about 1 cup. Add butter and green garlic sauce, and adjust salt and pepper to taste. Return rabbit to sauce, turning to coat and allowing to reheat. To serve, place a portion of rabbit on each of four plates. Top with a spoonful or two of sauce."}]}