{"@context": "http://schema.org", "@type": "Recipe", "name": "Roman Egg Drop Soup (Stracciatella alla Romana)", "description": "Tendrils of quickly cooked eggs, seasoned with cheese, nutmeg and pepper, float in a meaty stock in this traditional Italian soup. To avoid clumps that make the dish seem more like failed scrambled eggs than a delicate broth, pour the egg mixture into the hot stock in a thin stream, whisking as you go and promptly pulling it off the heat when done. In the dead of winter, when warmth is elusive and colds seem to be overtaking everyone, there's nothing better.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/01/11/dining/11SOUPS19/11SOUPS19-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, chicken stock, eggs, onions, parmesan, parsley, fall, spring, winter, gluten-free, low calorie, low-carb", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 607}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 322, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "18 grams", "saturatedFatContent": "5 grams", "sodiumContent": "994 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup extra-virgin olive oil", "2 medium yellow onions, diced", "Kosher salt", "6 large eggs", "1/2 cup finely grated fresh Parmesan, rind reserved, plus more for serving", "Pinch of freshly grated nutmeg", "Freshly ground black pepper", "8 cups chicken stock, preferably homemade", "2 tablespoons finely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large Dutch oven or soup pot over medium-high heat. Add oil. When it shimmers, add the onions and a generous pinch of salt. Reduce heat to medium. Stirring occasionally, cook onions for 10 to 15 minutes until tender. It’s fine if they start to take on a little color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large measuring cup or medium bowl with a spout, thoroughly whisk together the eggs, ½ cup grated Parmesan, nutmeg, black pepper, and a generous pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When onions are tender, add Parmesan rind and stock to pot. Increase heat to high and bring to a boil. Reduce to a strong simmer. While gently whisking soup with one hand, pour egg mixture into pot in a thin stream with the other. Once all of the egg mixture has been added, turn off the heat. Remove Parmesan rind. Taste and adjust for salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle soup into bowls and serve immediately, garnished with Parmesan, black pepper, and parsley."}]}