{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Blood Oranges", "description": "These caramelized oranges take a little planning: You'll need to leave time for the crystallized mint leaves to dry and harden, and for the orange slices to chill and then cool after they have been caramelized. The result is a dessert that can be made a few hours in advance. The recipe can also be doubled. You can substitute plain mint leaves for the sugared ones. The best way to caramelize the oranges is with a torch. If you plan to run them under the broiler, use a baking sheet with sides because the oranges will give up some sweet juices, which you will want to capture to drizzle around the slices for serving.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2017/02/15/dining/15BLOOD/15BLOOD-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "blood orange, mint leaves, mint oil, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 261, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "6 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "10 milligrams", "sugarContent": "60 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["10 fresh mint leaves", "1 egg white, lightly beaten, optional", "1/4 cup granulated sugar, optional", "4 blood oranges", "1/2 cup Demerara (granulated light brown) sugar", "A few drops of mint oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If crystallizing the mint leaves, place them on a sheet of parchment paper. Brush lightly with egg white on both sides. Place sugar in a small mound and dip each coated leaf in the sugar, to cover both sides. Shake off excess. Place leaves on a plate to dry for about 4 hours or in a turned-off oven with a pilot light, until dry and crisp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel oranges, removing all pith. Cut each in 4 slices horizontally, removing any seeds. Refrigerate at least 2 hours. Place Demerara sugar on a plate and dip each orange slice in the sugar on one side. Use a butane or propane torch, or light a broiler with the rack as close as possible to the heat element. On a baking sheet lined with foil, place oranges, sugared side up. Use the torch to caramelize the sugar, or place slices under the broiler until the edges are seared. Allow to cool briefly, then coat with sugar and sear again. Place slices on a cooling rack and allow to sit at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange slices on individual plates. Dot with a few drops of mint oil, garnish with the plain or sugared mint leaves and serve."}]}