{"@context": "http://schema.org", "@type": "Recipe", "name": "Kubaneh (Yemeni Pull-Apart Rolls)", "description": "The Jewish-Yemeni bread kubaneh was traditionally cooked in the residual heat of the hearth on Friday night, low and slow, ready to be eaten on Shabbat morning. At his restaurant, Nur, the chef Meir Adoni adapted a recipe that requires less than 30 minutes. You'll need a stand mixer to aggressively knead the basic yeasted dough, but afterward the fun of this bread is shaping it by hand, one bun at a time. With generously buttered hands, spread each piece of dough into a big, sheer sheet, then roll it up like a log and swirl it into a bun. Don't worry about a few rips and creases here and there in the dough as you spread it. Keep laminating, creating fine layers of fat as you roll and swirl, and those will give the baked kubaneh additional volume, texture and a rich, buttery flavor that make it one of the world's great breads. ", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/06/25/magazine/25eat1/25eat1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "jewish, middle eastern", "recipeCategory": "breads", "keywords": "butter, egg, tomato, yeast", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 272}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 435, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "13 grams", "saturatedFatContent": "4 grams", "sodiumContent": "412 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons (30 grams) soft butter, plus 1/2 pound (226 grams) soft butter for greasing pan and shaping buns", "1 cup (225 grams) water, room temperature", "3 tablespoons (45 grams) fresh yeast, or 1 tablespoon (15 grams) instant yeast", "3 1/3 cups (450 grams) all-purpose flour", "1/2 cup (90 grams) sugar", "1 tablespoon (15 grams) kosher salt", "2 eggs", "2 tablespoons nigella seeds (optional)", "1 ripe tomato, coarsely grated", "1 tablespoon extra-virgin olive oil", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a 9-inch springform cake pan by buttering it and placing it on a sheet tray. In a stand mixer fitted with the hook attachment, mix water, yeast, flour, sugar, salt and 1 egg (reserve the other egg for egg wash) on low speed. Once they’re combined, turn up to medium-high, and knead for 10 minutes. With the machine running, add the 2 tablespoons of butter a bit at a time, waiting until it’s fully incorporated before adding more. Continue to knead until the dough balls together and becomes very elastic, or 5 more minutes. Remove the hook, cover the bowl loosely with plastic wrap and rest for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use lightly floured hands to turn dough out onto a lightly floured cutting board. Cut in half, and again, and again, until you have 16 even-size pieces. Cover with plastic wrap, and set aside. Spread 2 tablespoons of soft butter across your work surface, and place a piece of dough in the center. Cover the palms of your hands with another tablespoon of soft butter, and without lifting the dough off the counter, use your fingers and palms to flatten and smear the dough out, until it is smooth and thin and sheer in places, or approximately 12 inches in diameter. The exact shape doesn’t matter much, and neither do some small rips here and there in the dough. Sprinkle some nigella seeds over the dough, then roll the dough into a long, skinny log: starting from the end farthest away from you, push the dough toward you with 8 fingertips until it gathers up into a thick enough piece to begin rolling it, then roll it all the way toward you. Wind the log up into a snail shape, and place it in the center of the prepared pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the process for the remaining 15 pieces, buttering your work surface and hands each time as needed, and continue arranging the finished buns loosely around the first. Cover the pan with a towel or plastic wrap, and allow to rise in a warm spot for 1 hour, or until the buns have almost doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350. Whisk remaining egg with a tablespoon of water, then gently brush the egg on top of the buns. Bake for 30 minutes, or until the top is golden brown and the buns at the center are as puffed asthe buns on the edges. In the meantime, grate the tomato, then season it with olive oil and salt. Allow the kubaneh to cool for a few minutes, then serve with the tomato on the side."}]}