{"@context": "http://schema.org", "@type": "Recipe", "name": "Fettuccine With Merguez and Mint Pesto", "description": "For a pasta dish with sausage that’s bold and rustic, easy to whip up for dinner but intriguing enough for entertaining (the recipe can be doubled), I opted for merguez, the North African lamb sausage. The trick is having a market that sells merguez, or order it in bulk online to keep a supply in the freezer. To the merguez, I added the flavors of Morocco: mint, garlic, lemon, sun-dried tomatoes, olives and a dusting of ground cumin. Thanks to some pasta water, these components all came together admirably to dress the pasta and suit the Bordeaux.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/10/26/dining/26PAIRING-BORDEAUX-WEB/26PAIRING-WEB-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "fettuccine, kalamata olives, merguez sausage, mint, pine nuts, sun-dried tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 135}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 491, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "46 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "9 grams", "sodiumContent": "668 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["2 large cloves garlic", "1/4 cup pine nuts", "2/3 cup, packed, fresh mint leaves (about 2 small bunches)", "1/3 cup extra-virgin olive oil", "Salt", "1 tablespoon extra-virgin olive oil", "1 large onion, finely chopped", "1 teaspoon ground cumin", "1/2 pound fresh merguez sausage, casing removed", "6 sun-dried tomatoes in oil, drained and finely slivered", "15 Kalamata olives, pitted", "8 ounces dried fettuccine, preferably spinach", "2 tablespoons lemon juice", "Salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pesto: Turn on food processor, and drop garlic through feed tube to mince. Add pine nuts through the tube and grind. Add mint leaves and process until mixture is combined. Scrape down bowl, and with machine running, slowly drizzle in the 1/3 cup olive oil. Process until blended. Transfer to a small bowl and season to taste with salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pasta: Heat 3 quarts water in a large pot. As water comes to boil, heat oil in a large sauté pan, and sauté onion on medium-low until soft. Stir in cumin. Add merguez, increase heat to medium and cook, using two forks to break up the sausage and stirring all the while, until the meat is nubbly and no longer looks raw. Stir in sun-dried tomatoes, olives and 2 tablespoons of the pesto. Reduce heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add fettuccine to boiling water and cook about 5 minutes, until nearly al dente. Drain, reserving 3/4 cup of the pasta water, and set pasta aside. Add pasta water to the merguez mixture and let cook until liquid in the pan just coats the ingredients. Stir in lemon juice. Add fettuccine to sauté pan, tossing with other ingredients over low heat. Add salt to taste. Transfer to individual bowls or a serving dish and serve with remaining pesto alongside."}]}