{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Asparagus and Scallion Salad", "description": "In this hearty, many-textured salad, soft, roasted asparagus is tossed with chewy whole grains and crisp, sweet caramelized scallions. You can use freekeh or farro here for the grains. Both are whole-wheat kernels, but the freekeh has a slightly smoky note from being toasted, while the farro is nuttier-tasting. You can prepare the freekeh or farro ahead and let it marinate in the dressing for up to six hours, but it’s best to roast the asparagus and scallions within an hour of serving. Don’t use pecorino Romano here, it’s too sharp. If you can’t find a young pecorino, use a young manchego or even a nice Cheddar, and serve this as a light main course or a salad course to a more substantial meal.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/05/10/dining/10APPE1/10APPE1-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, salads and dressings", "keywords": "asparagus, farro, freekeh, Pecorino Rossellino, scallion, main course, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 386}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "456 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["Kosher salt, as needed", "1/4 cup freekeh or farro", "2 1/2 teaspoons soy sauce", "2 teaspoons lime juice", "1 small garlic clove, grated on a Microplane or minced", "Fine sea salt and black pepper, to taste", "3 tablespoons extra-virgin olive oil, more as needed", "1 bunch asparagus (1 pound), woody ends trimmed", "1 bunch scallions (about 5 ounces), halved lengthwise and crosswise to form 2-inch-long ribbons", "3 ounces (3 cups) salad greens, such as baby arugula", "Pecorino Rossellino or other young sheep’s milk cheese, as needed (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a small pot of heavily salted water to a boil, stir in freekeh or farro, cover, and simmer until al dente, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl, whisk together 2 teaspoons soy sauce, lime juice, garlic, and pinch salt and pepper. Drizzle in 3 tablespoons oil, whisking constantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain freekeh and stir immediately into dressing while still warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Spread asparagus and scallions over a rimmed baking sheet and drizzle liberally with oil, 1/2 teaspoon soy sauce and a pinch of salt and pepper. Toss to combine, then arrange in a single layer. Roast until they start to char in spots, about 20 minutes. Let cool slightly: The asparagus are best while still a little warm but not hot enough to wilt the greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss salad greens in the bowl with freekeh and dressing until leaves are coated, and transfer to serving platter. Top with roasted asparagus and scallions, shave cheese over salad if you like, and serve."}]}