{"@context": "http://schema.org", "@type": "Recipe", "name": "Oyster Pie With Leeks, Bacon and Mashed Potatoes", "description": "Baked with a topping of mashed potatoes and buttered bread crumbs, this hearty oyster dish is reminiscent of oyster chowder or stew. It is a perfect use for larger oysters. Ask your fishmonger to shuck them for you. (It’s possible to buy pre-shucked oysters in a jar, but freshly shucked oysters are obviously fresher tasting.) Figure three or four oysters per person.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/11/02/dining/02KITCHEN1/02KITCHEN1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts, seafood", "keywords": "bacon, heavy cream, leek, oyster, potato, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 123}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 650, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "4 grams", "proteinContent": "22 grams", "saturatedFatContent": "22 grams", "sodiumContent": "927 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds yellow-fleshed potatoes, such as Yukon Gold, peeled and cut in 2-inch cubes", "4 tablespoons unsalted butter, more as needed", "Salt and pepper", "1/4 pound smoky bacon, cut crosswise into 1/4-inch lardons", "2 medium leeks, pale and tender parts only, chopped in 1/2-inch pieces", "1 teaspoon chopped thyme", "1 cup crème fraîche", "1 cup heavy cream or milk", "1 tablespoon whole grain French mustard", "Pinch of cayenne", "12 large oysters, or more if desired, shucked, with juices", "1 cup coarse dry bread crumbs", "Handful of grated Parmesan", "2 tablespoons chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of well-salted water to a boil. Add potatoes and simmer for 10 to 15 minutes, until completely tender. Drain potatoes, reserving 1 cup of cooking liquid. Return potatoes to pot, add 2 tablespoons butter and season generously with salt and pepper. Mash well, adding cooking liquid as necessary to thin. Cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, render the bacon: Put a medium skillet over medium-high heat and add lardons. After a minute or so, when they begin to sizzle, turn heat to medium and stir them in pan to distribute evenly. Cook for a minute or two, letting bacon soften without browning. When it is just beginning to crisp, tip everything into a fine mesh sieve over a bowl to drain. (Reserve the fat for another purpose.) Set bacon aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large, deep skillet over medium-high heat and add 2 tablespoons butter. Add leeks, season with salt and pepper, and cook, stirring, until wilted but still bright green, about 1 minute. Add reserved bacon, thyme, crème fraîche, heavy cream, mustard and cayenne; bring to a simmer. Add oysters and oyster juices, cook 1 minute, then remove from heat. The mixture will be rather soupy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Transfer oyster mixture to a low-sided casserole dish approximately 9 inches across. Carefully cover the surface with spoonfuls of mashed potatoes in an even layer. Sprinkle with bread crumbs and Parmesan and dot with butter. Set pan on a baking sheet in case there's overflow while cooking. Bake for about 40 minutes, until you can see the stew simmering at the edges and the top is beautifully browned. Let stand for 5 minutes before serving. Sprinkle with parsley."}]}