{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Baby Pumpkins", "description": "Sarah Frey, who sells more pumpkins than anyone else in America, often entertains retailers and produce executives at her farmhouse in southern Illinois. She likes to serve white baby pumpkins stuffed with spinach and cheese. Along with their orange counterparts, mini-pumpkins are often considered more decorative than culinary. But they make a dramatic side dish that can be stuffed with any manner of fillings that complement the layer of soft, cooked pumpkin that clings to the skin. This recipe uses Gruyère and kale, with pine nuts for texture and red pepper flakes for heat. The hardest part is carving off the pumpkin tops and cleaning out the tiny seeds. Bake for an hour, then test; it is hard to predict how much time each pumpkin takes to become tender when pierced with a fork.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/10/12/dining/12PUMPKIN5-WEB/12PUMPKIN5-WEB-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "stuffing and dressing", "keywords": "bread crumbs, gruyère, heavy cream, kale, pumpkin, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 105}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 224, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "8 grams", "sodiumContent": "164 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 mini-pumpkins, preferably the white variety", "1/4 teaspoon salt and 1/8 teaspoon ground black pepper, plus more to prepare the shells", "2 tablespoons butter", "2 scallions (about 1/3 cup), chopped", "1 large garlic clove, finely chopped", "4 cups baby kale or stemmed and roughly chopped lacinato kale (about 4 ounces)", "1 teaspoon fresh lemon juice", "1/2 cup white bread crumbs, lightly toasted", "2/3 cups shredded Gruyère cheese", "1/4 cup pine nuts, toasted", "1/4 teaspoon ground nutmeg", "1/4 teaspoon red pepper flakes", "1/4 cup heavy cream", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Wash the pumpkins. With a small, sharp knife, remove the tops as if for a jack-o'-lantern. Scoop out the seeds and stringy insides with a spoon, leaving the flesh intact. Rinse, then rub with a pinch of salt and a few grinds of pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a sauté pan over medium heat, then add the scallions and cook for a few minutes. Add the garlic and sauté for another minute or so, until fragrant. Add the kale and cook until it just wilts, about 3 or 4 minutes. Remove from heat, stir in the lemon juice and transfer to a bowl. Add the bread crumbs, cheese, pine nuts, nutmeg, red pepper flakes, 1/4 teaspoon salt and 1/8 teaspoon black peppers. Mix well, then stir in the cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the filling into the pumpkins and replace the tops. Rub a baking dish with olive oil and arrange the filled pumpkins in the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 1 hour, watching to make sure the tops don’t brown too much. Test the pumpkins by piercing with a fork. If the skin doesn’t pierce easily, remove the tops and bake for another 15 to 20 minutes. Replace the tops and serve hot."}]}