{"@context": "http://schema.org", "@type": "Recipe", "name": "Pizza al Formaggio", "description": "This is a kind of rich, eggy cheese bread that is sometimes served with scrambled eggs seasoned with mint for Easter breakfast, and with salami for lunch, in central Italy.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "breads, pizza and calzones", "keywords": "gruyère, parmigiano-reggiano, pecorino romano, provolone, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 405, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "21 grams", "saturatedFatContent": "8 grams", "sodiumContent": "429 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon active dry yeast (1 1/2 packages)", "3 cups all-purpose flour, more for kneading and dusting", "2 large eggs plus 1 egg yolk", "6 tablespoons freshly grated Parmigiano-Reggiano", "4 tablespoons pecorino Romano", "1 teaspoon crushed black pepper", "1/2 teaspoon kosher salt", "2 to 3 tablespoons extra virgin olive oil", "4 ounces provolone, in 1/2-inch dice", "3 ounces Gruyère, in 1/2-inch dice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place yeast in a small bowl, add 1/2 cup warm water, mix well and add 1 cup flour. Mix briefly to make a rough dough. Cover with plastic wrap and set in a warm place to rise 1 hour, until doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat 2 eggs in a small bowl. Mix in 4 tablespoons Parmigiano-Reggiano, all the pecorino and the pepper. Place remaining 2 cups flour in a large bowl, whisk in salt and make a well in the center. Add 2 tablespoons oil and work oil into flour with your fingertips until mixture is crumbly. Add risen yeast mixture, the egg mixture and 1/2 cup warm water. Knead briefly to make a sticky dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto floured work surface and knead about 2 minutes, adding flour sparingly as needed to make a soft dough. Cover with an inverted bowl for 15 minutes. Knead another 2 to 3 minutes until dough is soft and elastic. Stretch dough into a rectangle about 10 by 15 inches. Scatter diced cheeses evenly over surface. Fold one-third of dough, from the long side, over the cheese, then fold again to make a long, narrow envelope. Fold short ends over in thirds to make a square. Shape gently into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a 7-inch-deep panettone mold, a 9-inch baking pan or an oven-proof paper panettone mold. Grease metal pan, but not paper mold, if using, with remaining oil. Fit ball of dough into pan, lightly pressing it to fill pan. Cover loosely with paper towel and set aside to rise until doubled and somewhat above edge of pan, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Beat egg yolk with 1 tablespoon water and brush on dough. Sprinkle with remaining grated cheese, placing it in a cross shape if desired. Bake 20 minutes (paper mold should be placed on a baking sheet). Lower heat to 350 degrees and bake 30 to 35 minutes more, until golden. Remove from pan, but not from paper mold, and let cool on a rack at least 30 minutes before cutting. Cheese flavor will become more pronounced if bread is kept wrapped for 6 or more hours or overnight."}]}