{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto Nero with Squid", "description": "Squid ink is an extraordinarily delicious ingredient; it adds indescribable complexity, even when it's used in small quantities. You can buy it online or from Italian, Spanish and Japanese shops, and in some upscale grocers. Most fishmongers carry it in 1-ounce packets. (If you are up for it, collect your own ink from whole fresh squid.) To make this black risotto, first simmer the squid with tomato, wine and squid ink until tender. Fold the flavorful stew into plain risotto just toward the end of cooking.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/04/06/dining/06KITCHEN1/06KITCHEN1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "arborio rice, saffron, squid, squid ink, tomatoes, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 116}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 342, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "21 grams", "saturatedFatContent": "3 grams", "sodiumContent": "953 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil, plus more for drizzling", "1 large onion, finely diced (about 2 cups)", "Salt and black pepper", "3 garlic cloves, minced", "Pinch of saffron", "Pinch of crushed red pepper or cayenne", "1 pound squid, bodies cleaned and cut into 1/8-inch slices, tentacles halved", "1/2 cup chopped tomato, canned or fresh", "1 bay leaf", "1/2 cup dry white wine", "2 teaspoons squid ink (sometimes sold as cuttlefish ink)", "2 tablespoons unsalted butter", "1 cup Carnaroli or Arborio rice", "4 cups unsalted fish, chicken or vegetable broth, plus more as needed", "1 teaspoon lemon zest", "2 tablespoons roughly chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a saucepan over medium-high heat. Add half the diced onion and cook, stirring, until softened and barely colored, about 5 minutes. Season generously with salt and pepper, then add garlic, saffron and red pepper and cook for 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add squid bodies and tentacles, stir well to coat and season with salt. Add tomato, bay leaf and 1/4 cup white wine. Add 1 cup water and reduce heat to a simmer. Cook for 10 minutes, then stir in squid ink. Simmer for 10 minutes more, until squid is tender. Taste and adjust seasoning. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a heavy-bottomed saucepan over medium heat. Add remaining onion, season with salt and cook until softened, about 5 minutes. Add rice, stir to coat, and cook for 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keeping heat brisk, add remaining 1/4 cup wine and 2 cups of the broth and simmer, stirring, until most of the liquid has been absorbed. Add another cup broth and cook for 5 minutes, stirring. Add the last cup of broth and all of the squid mixture. Cook, stirring, for 5 to 7 minutes more, until rice is just done. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add a little more broth, as necessary, to keep rice moist and loose, but not too soupy. Stir in lemon zest and parsley, then spoon into warm shallow soup bowls. Drizzle with a little olive oil and serve immediately."}]}