{"@context": "http://schema.org", "@type": "Recipe", "name": "Lobster With Peach Coleslaw", "description": "Although we do not have sweet salads in France, when I came to the United States I fell in love with coleslaw. Unripe peaches are not dripping with juice, but they do have a little peachy flavor and good, firm texture. Cut into julienne strips, they are a perfect replacement for cabbage. The soft texture of the lobster and the crispness of the peaches make a very good balance in a very elegant dish. You could also use sautéed scallops because scallops, like lobster, are sweet and tender.", "author": {"@type": "Person", "name": "Michel Richard"}, "image": null, "totalTime": "PT2H40M", "recipeYield": "4 servings", "recipeCuisine": "american, french", "recipeCategory": "seafood", "keywords": "ginger, lobster, maple syrup, peach, yogurt, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 352, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "3 grams", "proteinContent": "50 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1216 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup plain whole-milk yogurt", "2 teaspoons sugar", "Juice of 1/2 small lemon", "1/2 teaspoon finely grated fresh ginger", "4 unripe peaches (1 1/4 pounds), peeled and cut into 1/8-inch julienne strips", "Salt and freshly ground black pepper", "1 hard-cooked egg yolk", "2 teaspoons chopped chives", "2 lobsters, 1 to 1 1/2 pounds each", "1 tablespoon maple syrup", "1 tablespoon lemon juice", "2 teaspoons extra virgin olive oil", "Salt and freshly ground black pepper", "Chervil and curly parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare coleslaw: In a medium bowl, combine yogurt, sugar, lemon juice and ginger. Add peaches, and season to taste with salt and pepper. Cover and refrigerate for at least two hours, preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare lobster: Preheat oven to 300 degrees. Place a rack in a large steamer (or a roasting pan filled with an inch of water) and bring water to a boil. Steam lobsters for 4 minutes. When lobsters are cool enough to handle, carefully remove meat from knuckles and claws so that meat remains intact. Break tails from bodies. Leaving tails in shells, cut tails in half lengthwise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix maple syrup with lemon juice, and set aside. Massage meat with olive oil, and season with salt and pepper to taste. Place in a glass baking dish with tail meat facing up. Bake for 4 minutes, or until meat has turned white and is no longer transparent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, put egg yolk through a sieve, and dry it for 10 seconds in a microwave oven on high. In center of each of four plates, place a portion of peach coleslaw. Sprinkle coleslaw with egg yolk and chives. Remove lobster tails from their shells, and rub lobster with a little more olive oil. Arrange a lobster claw, knuckle and half a tail around coleslaw. Drizzle with maple syrup mixture, and garnish with chervil and curly parsley."}]}