{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Breast Milanese With Green Olive-Celery Relish", "description": "A breaded chicken breast, gently fried in olive oil, can be sublime accompanied by a bright citrusy relish of green olives and celery. I like to marinate the chicken in buttermilk for an hour or longer, which adds sweetness and helps keep the meat moist. But if you are pressed for time, it’s fine to skip this step.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/03/30/dining/30KITCHEN1/30KITCHEN1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "bread crumbs, buttermilk, celery, chicken breast, green olives, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 241}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 689, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "5 grams", "proteinContent": "42 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1001 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 skinless, boneless chicken breasts, about 6 ounces each", "Salt and pepper", "2 cups buttermilk (optional)", "1 cup all-purpose flour", "Pinch of cayenne", "2 eggs", "2 cups fresh bread crumbs, from a French or Italian loaf", "1 cup roughly chopped pitted green olives (use a food processor if you have one)", "1 cup diced celery", "2 small garlic cloves, minced", "1 teaspoon orange zest", "1 teaspoon lemon zest", "1/4 teaspoon crushed red pepper", "Pinch of oregano", "2 tablespoons lemon juice", "1 tablespoon chopped fresh parsley", "1 tablespoon chopped fresh mint", "1 tablespoon chopped fresh basil", "Extra-virgin olive oil", "Watercress or arugula, for garnish", "Lemon wedges, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put each chicken breast between 2 sheets of heavy plastic and pound them to a thickness of about 1/4 inch. Trim any ragged edges. Season each breast on both sides with salt and pepper. If desired, place breasts in a bowl and cover with buttermilk and refrigerate for 1 hour (or up to 6 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the breading: Arrange 3 shallow bowls. Add flour to one bowl, then season it with salt and pepper and a little cayenne. In another bowl, beat the eggs. Fill the third bowl with bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the chicken. Dip each breast lightly into the seasoned flour, then into beaten egg and finally into the crumbs. Put breaded chicken on a baking sheet and sprinkle with more crumbs on both sides. Refrigerate, uncovered, until ready to fry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the olive-celery relish: In a mixing bowl, combine olives, celery, garlic, orange zest, lemon zest, red pepper, oregano, lemon juice, parsley, mint and basil. Season with salt and pepper and stir in 2 tablespoons olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a cast-iron pan over medium-high heat and add olive oil to a depth of 1 inch. Heat oil to 365 degrees. Test the temperature by throwing a bread crumb into the oil — it should brown gently. Add breaded chicken breasts in one layer without crowding. Do not disturb them until they become golden and crisp on one side, about 3 minutes. Carefully turn with tongs and cook on the other side for 3 minutes more. Remove and drain breasts on absorbent paper. Give them a light sprinkling of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, put 1 breast on each of 4 dinner plates. Top with 2 tablespoons green olive-celery relish and garnish with watercress and lemon wedges."}]}