{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Chicken With Shallots, Thyme, Bacon and Garlic Confit Sauce", "description": "This recipe was designed for new parents, who must cook stealthily to keep from waking an infant. The silent chef must follow a few simple, yet unforgiving rules: any busy, attention-demanding work has to happen before baby's bedtime; recipes must easily tolerate a lengthy span between prep and finish, ideally resting at room temperature to lessen the mess and effort involved in refrigerating and reheating; and the final steps, after baby's bedtime, have to be both quiet and fairly routine.", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT1H5M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "for two, poultry", "keywords": "bacon, chicken thigh, dry white wine, shallot, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["4 chicken thighs, bone in and skin on", "Salt and black pepper", "4 tablespoons extra-virgin olive oil", "2 tablespoons butter", "10 shallots, peeled", "5 garlic cloves, unpeeled", "2 sprigs thyme", "1 slice bacon, cut into 1/2-inch squares", "1 cup dry white wine", "1/2 cup chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stage 1, pre-bedtime. Pat chicken dry and season to taste with salt and pepper. Place a medium Dutch oven over high heat, and add 2 tablespoons olive oil and 1 tablespoon butter. When oil and butter barely begin to smoke, lay thighs skin side down in pan. Brown well on all sides until a rich amber color, 10 to 12 minutes. Remove chicken from pan, and discard fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return unwashed pan to medium heat, and add 2 remaining tablespoons olive oil and 1 tablespoon butter. Add shallots, garlic, thyme and bacon. Stir gently (so garlic cloves don’t lose their peels), until bacon is crisp and shallots and garlic are lightly browned. Raise heat, add wine and boil until reduced by half, about 3 minutes. Add chicken stock, bring to a boil and season to taste with salt and pepper. Remove pan from heat, and set aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stage 2, post-bedtime. Preheat oven to 350 degrees. Return Dutch oven to high heat. When liquid begins to simmer, rest chicken thighs skin side up on vegetables. Baste quickly with stock and wine, and transfer, uncovered, to oven. Bake 15 minutes, baste again, and bake 15 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven, and transfer garlic cloves to a small plate. Separate cloves from their skins, and discard skins. Mash cloves with a fork, and return to sauce, stirring to mix. To serve, discard thyme sprigs, and place equal portions of chicken and shallots on two plates. Top with sauce. If desired, serve with rice."}]}