{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio, Rose and Strawberry Buns", "description": "Meant for breakfast or as an accompaniment to a mug of hot tea, these Danish-like yeast buns are filled with pistachio cream and strawberry jam, then soaked in a rose water-scented sugar syrup. Adapted from \"Golden,\" a cookbook from Honey & Co. cafe in London, the buns sweet but not at all cloying, with the rose water and pistachio adding a heady perfume. Feel free to substitute apricot or raspberry preserves, or orange marmalade, for the strawberry jam. And if you’re not a fan of rose water, try orange blossom water or even brandy instead. These are best served within eight hours of baking, but leftovers can be refreshed the next day by heating them in a 300-degree oven for 10 to 15 minutes, until just warmed through.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/12/09/dining/09COOKBOOKS1/09COOKBOOKS1-mediumThreeByTwo440.jpg", "totalTime": "PT3H30M", "recipeYield": "8 buns", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, snack, pastries", "keywords": "dessert, jam, pistachio, rose water", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 103}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 516, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "11 grams", "sodiumContent": "43 milligrams", "sugarContent": "41 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["5 tablespoons/70 grams unsalted butter, cubed and at room temperature, more for greasing pan", "1 1/2 teaspoons/5 grams active dry yeast", "1 large egg", "2 1/2 tablespoons/30 grams granulated sugar", "1/3 cup/80 milliliters whole milk, more if needed", "2 1/3 cups/300 grams bread flour", "Pinch of kosher salt", "2/3 cup/80 grams pistachios", "6 tablespoons/80 grams unsalted butter, at room temperature", "1/3 cup plus 1 tablespoon/80 grams granulated sugar", "1 large egg", "1 tablespoon all-purpose flour", "8 teaspoons strawberry jam", "1/2 cups/100 grams granulated sugar", "1 tablespoon honey", "1 tablespoon rose water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: Place butter, yeast, egg, sugar and milk in bowl of a stand mixer fitted with a dough hook, or a large bowl if working by hand. Mixing on low speed or stirring with a wooden spoon, add flour and salt. If mixture looks dry, drizzle in another tablespoon or so of milk. Beat for 2 to 3 minutes in mixer, or 5 to 6 minutes by hand, until you get a soft but not sticky dough. Don’t worry if you still have some whole flecks of butter running through the dough; they will make your final bun quite light. Cover bowl in plastic wrap and chill for at least 2 hours and up to 12."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pistachio cream: Put pistachios in a food processor and blitz until they resemble bread crumbs, then add butter, sugar, egg and flour and pulse until they are well combined to form a paste. Set aside. Cream can be made up to 2 days ahead and stored in refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter 8 cups of a muffin tin. Remove dough from refrigerator. On a lightly floured surface, roll dough into a 16- by 8-inch rectangle. Work with as little flour as possible so as not to dry out dough. Use a sharp knife or pizza slicer to cut eight 4- by 4-inch squares. Lift each square into a cup in the muffin tin and push all the way down. Allow excess dough to hang over sides. Divide pistachio cream among cups, then top each with a teaspoon of strawberry jam. Fold corners over lightly to cover filling, but don’t push them down. Set aside in a warm place and let them rise for 40 minutes to 1 hour; the buns' folds should rise considerably."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a clean, empty baking sheet in the center of the oven, and heat it to 400 degrees. When buns are done rising, place muffin tin on baking sheet and bake for 10 minutes. Turn sheet front to back, reduce oven temperature to 350 degrees and bake for another 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the buns bake, make the syrup: In a small pot, bring 1/3 cup plus 1 tablespoon water, the sugar and the honey to a boil. Remove from heat and stir in rose water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove buns from oven and brush generously with syrup; you don’t have to use it all. Let cool slightly in the tin before removing and serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pistachio Buns", "description": "These breakfast buns with pistachio paste, strawberry jam and rose-water syrup are the perfect accompaniment to a mug of tea.", "thumbnailUrl": "https://static01.nyt.com/images/2016/12/09/dining/09COOKBOOKS1/09COOKBOOKS1-mediumThreeByTwo440.jpg", "uploadDate": "2016-12-06T21:13:54.000Z", "duration": "PT3M"}}