{"@context": "http://schema.org", "@type": "Recipe", "name": "Halvah Semifreddo With Hazelnuts", "description": "Aglaia Kremezi, a historian of Greek food who eschewed sesame desserts as a child, is now an enthusiast. In her own kitchen, she has rethought the traditional tahini filling for a Lenten cinnamon roll called tahinopita, and developed a super-easy recipe for halvah semifreddo, a frozen emulsion of fresh whipped cream and crystalline halvah. It is a spectacular dessert to serve at a dinner party, and the sesame undertones will surprise and delight guests.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/04/14/dining/14SESAME7/14SESAME7-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "greek, middle eastern", "recipeCategory": "snack", "keywords": "dark chocolate, halvah, hazelnuts, heavy cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 137, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "0 grams", "proteinContent": "0 grams", "saturatedFatContent": "2 grams", "sodiumContent": "5 milligrams", "sugarContent": "27 grams", "transFatContent": null}, "recipeIngredient": ["14 ounces/400 grams plain or vanilla halvah, preferably made with sugar, not honey (available online or in Middle Eastern specialty shops or groceries)", "1 cup/140 grams hazelnuts or pistachios, toasted and coarsely ground, plus whole hazelnuts for decorating, optional", "1/2 cup/125 milliliters heavy cream, cold", "For serving, dark chocolate sauce for serving, optional,  or orange marmalade or chunky apricot or peach preserves, thinned with orange liqueur, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a small loaf pan with plastic wrap. In a bowl, mash the halva with a strong fork until crumbled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the nuts (reserve some for topping), while continuing to mash, mixing the nuts and halvah together until almost smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the cream to soft peaks and fold into the halvah mixture. Pour into the loaf pan and bang the pan on the counter several times to distribute the mixture evenly. Transfer to the freezer and freeze until firm, at least 4 hours.  (To keep longer, wrap semifreddo in plastic wrap and keep for up to 1 month.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve whole,  place the frozen loaf in a serving dish. Drizzle chocolate sauce or spoon fruit preserves on top, if desired. Arrange hazelnuts on top and slice at the table.  Alternatively, serve as individual slices and pass toppings at the table."}]}