{"@context": "http://schema.org", "@type": "Recipe", "name": "Best Chicken Salad", "description": "The secret here isn’t in the seasonings (though the tarragon and sour cream make it pretty wonderful) but in the texture of the chicken, described as “plush” by the chef Barbara Tropp in her “China Moon” cookbook. She incorporated Chinese methods and flavors to her cooking, including this foolproof method for poaching chicken breasts without overcooking. It makes a chicken salad that’s perfect for sandwiches (especially on dark rye or sourdough breads) or scooped onto a lettuce-lined plate with sliced radishes, tomatoes, crackers, grapes or all of the above.\n\nThe chicken breasts used here must be bone-in, but you can remove the skin if you prefer. The skin and bones flavor the cooking liquid, providing a bonus of several pints of chicken stock.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2016/07/13/dining/13RECIPE-LAB1-WEB/13RECIPE-LAB1-WEB-articleLarge-v3.jpg", "totalTime": "PT6H20M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, lunch, salads and dressings", "keywords": "chicken breast, mayonnaise, sour cream, tarragon, walnut, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1383}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1112, "unsaturatedFatContent": "54 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "77 grams", "fiberContent": "2 grams", "proteinContent": "96 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1300 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["About 4 pounds bone-in, skin-on chicken breasts", "2 scallions, cut into thirds", "1/4 teaspoon black peppercorns", "1 lemon, halved", "2/3 cup mayonnaise, preferably Hellmann’s, Best Foods or homemade", "1/4 cup sour cream or crème fraîche, more to taste", "1/2 teaspoon Dijon mustard or 1 teaspoon brine from a jar of pickles, optional", "2 or 3 pale green celery ribs, cut into medium (1/4-inch) dice", "1/2 cup minced onion or finely sliced scallion, optional", "1/2 cup walnut or pecan halves, broken into bite-size pieces", "3 tablespoons chopped fresh tarragon, parsley, or chives, plus extra for garnish", "Salt and ground black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Choose a heavy pot or Dutch oven with a tightfitting lid. It should be large enough to hold the chicken snugly, but not much bigger. Fill pot about 2/3 full with cold water, but don’t put the chicken in yet. Boil some extra water in a teakettle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add scallions and peppercorns to water, cover and bring to a rolling boil. Turn off heat and slip chicken pieces into the hot water. If needed, add boiling water from the kettle to cover chicken with water by 2 inches. Replace the lid and let chicken rest in the hot water for about 2 hours. Do not turn the flame back on: The pot will retain enough heat to cook chicken thoroughly and safely. (To test, cut into 1 piece of chicken and check the meat near the bone. If it is still pink, return the pot to low heat, bring the water to a simmer and simmer 10 minutes more.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift chicken out of the pot. Remove and discard bones, skin and fat. Pat the meat dry with paper towels, then cut or shred into small bite-size pieces and transfer to a bowl. (Meanwhile, simmer cooking liquid until tasty, strain and refrigerate or freeze to use as chicken stock.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, whisk together juice of 1/2 lemon, mayonnaise and sour cream. If using, whisk in mustard or brine. Taste and adjust the seasonings and thickness to your liking. Pour over chicken, scraping the bowl clean with a rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add celery, onion if using, nuts, herbs and salt and pepper. Toss gently but thoroughly. Refrigerate, covered, at least 4 hours. Taste and add salt and pepper as needed. Sprinkle with herbs before serving."}]}