{"@context": "http://schema.org", "@type": "Recipe", "name": "Whatever You Want Soup", "description": "This basic recipe can serve as a canvas for any kind of chunky soup. Mix and match ingredients to suit your cravings, using an aromatic base of onions and garlic, seasonings, flavorful stock (or water), and whatever main ingredients you choose. This recipe, like a similar one in Julia Turshen's cookbook \"Small Victories,\" highlights soup's basic transformative qualities. With just a bit of time, ordinary ingredients can become an extraordinary winter meal for tonight, and for days to come. Covered in the refrigerator, it will last for up to five days, but it also freezes exceptionally well for up to two months. Just return it to a boil before using.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/01/11/dining/11SOUPS21/11SOUPS21-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, broth, chicken, vegetables, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 400}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 218, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "826 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons butter, olive oil or neutral-tasting oil", "2 medium onions, diced", "3 cloves garlic, sliced", "Kosher salt", "6 to 8 cups meat, vegetables or other add-ins (see notes)", "About 1 1/2 pounds raw, boneless chicken (optional)", "About 8 cups water or chicken stock, preferably homemade (see notes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large Dutch oven or stockpot over medium-high heat and add 4 tablespoons butter or oil. When the butter melts or the oil shimmers, add onions and garlic, and a generous pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium and cook, stirring occasionally, until the onions are tender, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the meat, vegetables and other add-ins in the pot, along with the raw chicken (if using), and add enough liquid to cover.  Season with salt. Increase heat to high and bring to a boil, then reduce to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until the flavors have come together and the vegetables and greens are tender, about 20 minutes more. If you added raw chicken, remove it from the soup when cooked, allow to cool, shred and return to the soup. Taste and adjust for salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add more hot liquid if needed to thin the soup to desired consistency. Taste and adjust for salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, and garnish as desired."}]}