{"@context": "http://schema.org", "@type": "Recipe", "name": "Zucchini and Tomato Tartlets With a Cheddar Crust", "description": "These individual tartlets have a Cheddar-spiked, buttery crust holding a filling of honey-drizzled roasted vegetables and creamy ricotta. You can use any roasted vegetables here, changing up the mix to suit the seasons. Late summer is perfect for some combination of zucchini, eggplant, peppers, tomatoes and even corn. Then try the likes of winter squash, brussels sprouts and mushrooms in fall; cabbage, onions and other root vegetables in winter, and sautéed greens and asparagus in spring.\nIf you’re planning ahead, you can make the dough up to five days in advance and roast the vegetables the day before (store them in the refrigerator). But do try to bake these on the same day as serving. They are at their best still warm.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/09/20/dining/20appetite1/20appetite1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "appetizer, cheddar, cherry tomatoes, zucchini", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 189}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "12 grams", "sodiumContent": "357 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups/170 grams all-purpose flour", "1/2 cup/65 grams whole wheat flour", "1/2 teaspoon fine sea salt", "1 1/2 sticks/12 tablespoons/170 grams cold unsalted butter, cubed", "3/4 cup/55 grams sharp Cheddar, grated", "1 large egg, whisked", "3 medium zucchini, about 2 pounds, trimmed and cut into 1/2-inch cubes", "2 cups halved cherry tomatoes", "2 1/2 tablespoons finely chopped fresh rosemary", "3/4 teaspoon fine sea salt, more as needed", "1/8 teaspoon crushed red pepper flakes", "2 tablespoons extra-virgin olive oil", "1 1/2 tablespoons hot honey (see note), more for drizzling if you like", "1 tablespoon tarragon vinegar or white wine vinegar", "3/4 cup fresh ricotta", "1 large egg", "3 tablespoons chopped chives", "1 small garlic clove, grated", "1/8 teaspoon black pepper", "2 to 3 tablespoons heavy cream or milk, for brushing the tops", "6 tablespoons finely grated Cheddar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crust: In the bowl of a food processor, pulse together flours and salt. Pulse in butter and Cheddar until mixture resembles chickpeas. Drizzle in whisked egg and ice water 1 tablespoon at a time, up to 6 tablespoons, pulsing occasionally until mixture is just moist enough to hold together. Form dough into a ball, wrap with plastic and flatten into a disk. Refrigerate at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While dough chills, prepare the filling. Heat oven to 425 degrees. On a rimmed baking sheet, toss zucchini and tomatoes with rosemary, salt, red pepper and olive oil; spread mixture out into one layer. Roast, tossing occasionally, until vegetables are tender and golden, 40 to 50 minutes. Stir honey and vinegar into the hot vegetables, then let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spray a muffin tin with nonstick spray or use a nonstick muffin pan. Roll out dough to a 12-by-16-inch rectangle, trimming any rough edges. Cut into a dozen 4-by-4-inch pieces and gently press each piece into the holes of the muffin tin, leaving the 4 corners hanging over the edges. Chill dough for at least another 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together ricotta, egg, chives and garlic. Season with a large pinch each of salt and black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide ricotta mixture into the bottom of each tart, using about 1 tablespoon each. Top with the roasted vegetables. Fold edges of crust over filling. Brush tops of tarts with cream or milk and sprinkle with cheese. Place muffin tin on a baking sheet and bake at 425 degrees until bubbling and golden, 20 to 25 minutes. Drizzle tarts with a little honey (about 1/2 teaspoon per tartlet) if you like. Cool slightly before serving."}]}