{"@context": "http://schema.org", "@type": "Recipe", "name": "Angel Food Cake With Nectarines and Plums", "description": "The key to success with angel food cake is not overbeating the egg whites, which means you should never go above medium speed, and the peaks should fold over when you lift them with a spatula or beaters. If the meringue is too stiff, the cake will not maintain its height once baked. You should be able to pour the batter into the pan. Make sure that the egg whites are at room temperature before you begin. Use an ungreased 10-inch tube pan, preferably one with a removable bottom (even better if it has feet, for air circulation when you cool it upside down). Once baked, let it cool completely in the reversed pan.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/07/27/dining/27MARTHA-WEB/27MARTHA-WEB-articleLarge.jpg", "totalTime": "PT2H45M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "almond extract, cake flour, egg whites, honey, nectarine, plum, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 202, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "98 milligrams", "sugarContent": "37 grams", "transFatContent": null}, "recipeIngredient": ["1 cup/100 grams sifted cake or pastry flour", "1 1/4 cups/250 grams superfine sugar", "1/4 teaspoon salt", "1 1/2 cups/350 grams/11 large egg whites, at room temperature", "1 tablespoon fresh lemon juice", "1 teaspoon cream of tartar", "1 teaspoon vanilla extract", "1/4 teaspoon almond extract", "1 tablespoon finely grated lemon zest (optional)", "2 pounds nectarines, pitted and sliced", "1 to 1 1/2 pounds red-fleshed plums (or plums and pluots), pitted and sliced", "3 tablespoons mild honey, such as clover or acacia", "2 to 3 tablespoons fresh lemon juice", "1 1/2 teaspoons granulated sugar", "3/4 teaspoon fresh thyme or lemon thyme leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Preheat oven to 350 degrees. Adjust rack to lower third of oven. Line a 10-inch tube pan with parchment; to fit the parchment over the center tube, trace the hole, fold the paper in half and cut out a semi-circle. Do not grease pan or parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flour, 1/2 cup/100 grams sugar and the salt. Sift 3 times. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg whites in the bowl of a stand mixer fitted with whisk attachment, or in a large bowl if using a hand mixer. Beat at low speed until egg whites begin to foam. Add 1 tablespoon water, the lemon juice, the cream of tartar and the vanilla and almond extracts, and beat to a soft, moist foam at medium speed, 3 to 5 minutes. Mixture should increase in volume 4- to 5-fold. Stop machine and lift beaters. The foam should hold a soft, moist shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn beater on at medium speed and gradually add remaining 3/4 cup/150 grams sugar, one tablespoon at a time. Beat 2 to 3 minutes until mixture forms medium, moist peaks that bend over when lifted. Foam should not be stiff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer foam to a wide, 6-quart bowl. Sprinkle or sift 1/4 cup of the flour mixture over the foam. Using a wide rubber spatula, gently fold in flour until just incorporated. In 1/4-cup additions, continue to sprinkle on flour mixture and gently fold it into the foam, along with lemon zest if using. When you are done you should not see any traces of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the pan, scraping the last of it out of the bowl, and spread evenly, either with a spatula or by tipping or swirling pan. Run a table knife through the batter a few times to remove large bubbles. Place in oven and bake 40 minutes, until a tester inserted in the center comes out clean. There may be some crumbs on the tester but they should not be moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven and invert pan immediately with tube set on a rack. Cake will not slide out of the pan. If cake has risen to edges of the pan and the pan does not have legs, balance the pan on a jar so that air can circulate underneath. Cool in the reversed pan for 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the fruit: Toss together fruit, honey, lemon juice and sugar in a large bowl and let macerate for 1 to 2 hours at room temperature. (May be prepared up to 4 hours in advance and stored in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove cake from pan by running a thin knife between the cake and the sides and tube of the pan. Pull tube up from pan to remove cake, then remove from detachable bottom and peel off parchment. Place on serving plate to cool completely before serving or wrapping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice cake with a sharp, thin serrated knife, sawing gently so you don’t flatten the cake. Add thyme to fruit, and then serve fruit and juices with the sliced cake. The cake alone will keep, well wrapped, for 3 days."}]}