{"@context": "http://schema.org", "@type": "Recipe", "name": "Celebration Cake", "description": "This cake, which was developed by the British-Israeli chef Yotam Ottolenghi, may not look perfect. You may end up with cracked layers, roughly cut edges and a white-chocolate ganache spread willy-nilly. “I think it’s best if it is superrustic,” Ottolenghi said. But it will be elegant anyway, the astonishingly good result of care and time spent in the kitchen for loved ones, and the flavors are terrific.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/05/22/magazine/22feastrecipes7-celebrationcake/22feastrecipes7-celebrationcake-articleLarge-v4.jpg", "totalTime": "P1D", "recipeYield": "Serves 10-20", "recipeCuisine": "middle eastern", "recipeCategory": "cakes", "keywords": "black berries, blueberries, brandy, chocolate, raspberries, white chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 518}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 594, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "23 grams", "sodiumContent": "88 milligrams", "sugarContent": "41 grams", "transFatContent": null}, "recipeIngredient": ["15 1/2 ounces, or 440 grams, dark baking chocolate (70 percent cocoa), chopped", "9 ounces, or 250 grams, egg yolks (the yolks from 14 or 15 large eggs)", "15 1/2 ounces, or 440 grams, superfine sugar", "14 ounces, or 400 grams, egg whites (the whites from about 10 large eggs)", "1 tablespoon brandy", "10 1/2 ounces, or 300 grams, white chocolate, chopped", "1 1/4 cups heavy cream", "1 1/2 cups heavy cream", "7 ounces, or 200 grams, blueberries, with 8 or so set aside for garnish", "7 ounces, or 200 grams, blackberries, with 12 or so set aside for garnish", "7 ounces, or 200 grams, strawberries, trimmed and thinly sliced, lengthwise", "7 ounces, or 200 grams, raspberries, with 8 or so set aside for garnish", "Powdered sugar, to dust (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the layers for the cake, heat oven to 350. Grease and line three 10-by-14-inch jellyroll pans with parchment paper. (If you only have one, you can make the layers separately.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a medium-size pot with a few inches of water in it over medium heat, and bring it to a simmer. Place a large, heatproof bowl on top of the pot, making sure that the base of the bowl is not touching the water. Put the chocolate in the bowl, and melt it over the simmering water, stirring occasionally. Remove the bowl from the heat, and set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the egg yolks and sugar into the bowl of an electric mixer with a whisk attachment. Mix for about 3 minutes, until thick and pale, and then gently fold the mixture into the melted chocolate. Stir until almost combined, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the egg whites in the clean bowl of an electric mixer with a clean whisk attachment. Beat at high speed until soft peaks form, and then gently fold them into the chocolate, followed by the brandy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the chocolate mixture between the 3 jellyroll pans (or pour a third of the mix into one, if you’re baking in 3 batches). Use a spatula to even out the tops or top, and place in the oven. Cook for approximately 15 minutes, until firm to touch and a skewer inserted in comes out clean. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cakes have cooled, place a sheet of parchment on a sheet pan, and set it over one of the finished spongecakes, then flip the whole thing over, so the sheet pan is now sitting under the cake. Remove the jellyroll pan and the used paper. Repeat with the remaining cakes, placing each on a clean sheet of parchment paper and stacking them. Wrap them well with plastic wrap and place in the freezer for at least 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the ganache, place white chocolate in a large bowl and set aside. Add the cream to a medium saucepan with a heavy base and place it on medium-low heat. Cook until just starting to simmer, and then pour it over the chocolate. Allow to sit for 3 minutes or so, until the chocolate has softened, and then gently stir until the chocolate is melted and fully combined with the cream. Cover with plastic wrap, and refrigerate overnight (or for up to 3 days)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the cake, put the ganache into the bowl of an electric mixer with a whisk attachment. Add the cream, and whip on medium-high until the mixture has achieved the consistency of soft whipped cream. (Keep a close eye on it so as not to overwhip.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the berries you are not holding back for garnish in a large bowl, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove one sponge layer from the freezer at a time, and place on a serving platter or cutting board. Do not remove them all at once; they need to be frozen. Trim about 1/2 inch off all the edges to make a clean rectangle, then spread roughly 1/3 of the ganache mixture across the top of the cake. Scatter 1/2 of the berries on top of the ganache mixture, making sure they are evenly spread right to the edges of the cake. Trim the second sponge layer, place it on top of the first and cover it with another 1/3 of the ganache mixture and the remainder of the fruit. Remove the final layer of cake from the freezer, trim it and place it on top of the second, then spread the remaining ganache across the top of the cake, smoothing it with a palette knife. Place the fruit reserved as garnish in each corner of the cake, and dust the whole thing lightly with powdered sugar, if you like. If you’re not serving the cake right away, store in the refrigerator for a few hours, bringing it out 30 minutes before serving."}]}