{"@context": "http://schema.org", "@type": "Recipe", "name": "Sichuan Chicken With Chiles", "description": "This recipe unites those who would become ecstatic when they see a dish of chicken skin on a restaurant menu and those who would flee into the street. The keys to dishes that feature handfuls of dried chiles are one, don't eat the chiles. And two, don't let any of them break open while cooking; each broken one will intensify the heat exponentially. But they're sturdy devils, so this is not that difficult. The browned chiles lend the dish a nearly fiery smokiness, rather than just plain fire.\n\nBrowning the skin renders its fat, which in turn is used to cook the other ingredients. It's best to stir-fry the ingredients in batches, to brown them nicely, then combine them and build the simple sauce.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/03/30/dining/30COOKING3/30COOKING3-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 175}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 588, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "2 grams", "proteinContent": "43 grams", "saturatedFatContent": "11 grams", "sodiumContent": "988 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 chicken leg quarters (legs and thighs)", "Salt", "20 to 40 whole dried red chiles", "1 red bell pepper, seeded and finely chopped", "1 tablespoon chopped garlic", "2 tablespoons dry sherry", "1/2 cup chicken stock", "2 tablespoons soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Skin chicken, and cut skin into 1/2-inch pieces; set aside. Bone chicken, and cut meat into 1/2-inch pieces; set aside separately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat under a wok or 10-inch skillet to medium-high and add chicken skin. Cook, stirring occasionally and adjusting heat so skin browns but does not burn, about 10 minutes. Sprinkle with salt, and remove to a bowl, using a slotted spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chiles and cook, stirring occasionally, until they puff and darken, 3 or 4 minutes. Remove with a slotted spoon to a separate bowl. Add bell pepper and a pinch of salt and cook, stirring occasionally, until it browns, about 5 minutes. Remove and combine with chiles. Add as much chicken meat as will fit in one layer, and cook until browned on one side; season with salt. Stir and cook until browned; remove and repeat with remaining chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, followed by chicken, peppers and skin. Stir to combine, then add sherry, stock and soy sauce. Cook until mixture is saucy, about 3 minutes, then serve with white rice. Chiles should not be eaten."}]}