{"@context": "http://schema.org", "@type": "Recipe", "name": "Meringue-Topped Blood-Orange Curd Cake", "description": "This is a layer cake in the loosest sense of the term. The cake looks like a giant toasted marshmallow, and beneath its swirled meringue are layers of orange spongecake and blood-orange curd. If your kitchen lacks a blowtorch for toasting, broil the finished cake until the meringue turns golden brown.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "cake flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "recipeIngredient": ["Butter and flour for preparing pans", "6 large eggs", "3/4 cup sugar", "Finely grated zest of 1 orange", "3/4 cup cake flour", "1/3 cup plus 1 tablespoon cornstarch", "Pinch of salt", "3 tablespoons unsalted butter, melted and cooled to room temperature", "Blood-orange curd (<a href=\"http://cooking.nytimes.com/recipes/1018170-blood-orange-curd\">see recipe</a>)", "Meringue (<a href=\"http://cooking.nytimes.com/recipes/1018169-meringue\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Bring a pot of water to a simmer. Line two 8-inch cake pans with wax or parchment paper. Grease paper and dust with flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stainless-steel bowl, whisk together eggs, sugar and zest. Set bowl over simmering water, and whisk constantly until mixture is warm to the touch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, and beat with an electric mixer until light colored and triple in volume, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift together flour, cornstarch and salt. Resift over the egg mixture in three additions, folding after each addition. Fold in melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour mixture into cake pans. Bake about 20 minutes, or until cake springs back to the touch. Remove pans to a wire rack, and let cool slightly. Run a knife around edges of pans, and invert layers onto racks to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread blood-orange curd between layers. Frost cake with meringue. Using a blowtorch, toast meringue until golden brown. (Or preheat broiler or oven to its highest setting, and broil or bake cake until meringue is golden brown. Watch carefully, it happens fast.)"}]}