{"@context": "http://schema.org", "@type": "Recipe", "name": "Weeknight Fancy Chicken and Rice", "description": "This is a truly glorious one-pot weeknight meal. Feel free to experiment with the garnish, adding dried cranberries, hazelnuts, pine nuts or your own favorites. Ghee adds a nuttiness to the dish, but if you cannot find it, you can make it with unsalted butter using the chef Asha Gomez's method. Simply melt the butter in a pot over low heat. Let it simmer until it foams and sputters. Once the sputtering stops and the milk solids in the pot turn a khaki color, remove it from the heat and skim off the foam with a spoon. Strain remaining butter into a container, leaving behind any solids in the pot. Ghee keeps for up to six months in the refrigerator.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/sb-weeknight-fancy-chicken/merlin_164331318_b2defe99-c033-4d56-b963-ffac99dd3371-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american, indian", "recipeCategory": "dinner, weekday, one pot", "keywords": "almond, cardamom pods, chicken, cilantro, dried apricots, ghee, rice, turmeric, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1768}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 405, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "24 grams", "saturatedFatContent": "6 grams", "sodiumContent": "458 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup ghee (or use unsalted butter)", "1 large yellow onion, peeled, halved and thinly sliced", "6 green cardamom pods, crushed", "3 whole star anise", "1 1/4 teaspoons kosher salt, divided", "6 garlic cloves, finely chopped", "1 1/2 teaspoons turmeric powder", "1 pound boneless, skinless chicken breasts, cut into 3/4-inch pieces", "2 1/4 cups low-sodium chicken stock", "1 1/2 cups basmati rice", "1/4 cup chopped dried apricots", "1/4 cup sliced raw almonds, toasted", "1/4 cup chopped cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan with a lid, melt ghee over medium-high heat. Add onions, cardamom, star anise and 1/4 teaspoon salt. Cook, stirring frequently, until onions are soft and a very deep golden brown, about 15 minutes, lowering heat if necessary to keep from burning them. Add garlic and turmeric; cook and stir for 1 to 2 minutes, or until very fragrant. Add chicken and cook for 4 minutes, stirring to coat chicken with the onion mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock and remaining salt, increase the heat and bring to a boil. Add rice, stir and cover. Reduce heat to low and simmer until the rice has absorbed liquid, about 12 minutes. Remove from heat and let stand, covered, for 12 minutes. Remove lid and fluff rice with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken and rice to a bowl, taking care to remove and discard cardamom pods and star anise. Garnish with apricots, almonds and cilantro. Serve at once."}]}