{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild King Salmon With Savory Whipped Cream", "description": "The wild king salmon season opens in May on the West Coast and continues through summer, from Alaska all the way to San Diego. The first wild salmon in spring has brilliant red flesh, a mild sweet flavor and a velvetlike texture. Farmed salmon doesn’t compare. In this recipe, the salmon is cut on the diagonal into thin slices that cook quickly. They are topped with softly whipped cream that's seasoned with mustard, cayenne and lemon zest.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/05/04/dining/04KITCH1_WEB/04KITCH1_WEB-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "crème fraîche, heavy cream, mustard, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 369}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 341, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "0 grams", "proteinContent": "24 grams", "saturatedFatContent": "10 grams", "sodiumContent": "327 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds king salmon fillet, skin off and pin bones removed", "Salt and pepper", "1/2 cup heavy cream", "2 teaspoons Dijon mustard", "Pinch of cayenne", "1/2 teaspoon lemon zest", "1 tablespoon snipped chives", "2 tablespoons butter", "Tarragon leaves, for garnish", "Watercress, for garnish", "Violets, nasturtiums or other edible flower petals for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice salmon diagonally into 6 four-ounce portions about 1/2  to 3/4 inch thick (or have your fishmonger slice it). Place on a cutting board or baking sheet. Season both sides generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put cream in a mixing bowl and beat with a whisk until just barely thickened. Add 1/4 teaspoon salt, some freshly ground pepper, the mustard, the cayenne and the lemon zest. Beat again until soft peaks form, but don’t let the cream get too stiff. Fold in chives. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put butter in a large cast-iron skillet over medium-high heat. When butter begins to foam, add salmon pieces and reduce heat slightly. Cook gently on one side for about 2 minutes, then flip and cook one minute more. Turn off heat and let rest for 2 minutes. Salmon should be cooked through but moist. Be careful not to overcook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer salmon to a platter or individual plates. Spoon some savory whipped cream over each serving. Garnish with tarragon, watercress and flowers, if desired."}]}