{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Fudge and Salted Chocolate Bits Sundae", "description": "Sundaes are the chamber music of the dessert world.  Their composition and construction follow the contours of grand works, but mostly they’re played out in miniature, their delights designed to be shared by a duet or an audience of one, long spoon in hand.  The composition of this sundae is classic.  There’s ice cream – the flavors of your choice in whatever quantities you want; sauce –homemade hot fudge sauce based on dark chocolate (not chips, please); fresh whipped cream; and two different add-ins, toasted slivered almonds and chopped chocolate bits.  It’s the bits that are the big surprise – they’re bittersweet chocolate and salt, melted together, frozen and then cut into morsels.  The salt is unexpected, but not dissonant – it’s what brings out the best in the sundae’s other players.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2017/09/10/magazine/10ondessert/10ondessert-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 sundaes.", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "almond, bittersweet chocolate, fleur de sel, heavy cream, ice cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1130, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "121 grams", "cholesterolContent": null, "fatContent": "74 grams", "fiberContent": "10 grams", "proteinContent": "15 grams", "saturatedFatContent": "38 grams", "sodiumContent": "497 milligrams", "sugarContent": "103 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces bittersweet chocolate (not chips), finely chopped", "3/4 teaspoon fleur de sel (or 1/2 teaspoon sea or kosher salt)", "6 ounces bittersweet chocolate (not chips), finely chopped", "3/4 cup heavy cream", "3 tablespoons light corn syrup", "2 tablespoons sugar", "About 3/4 cup toasted slivered almonds", "1 pint coffee (or favorite flavor) ice cream", "1 pint vanilla (or favorite flavor) ice cream", "Lightly sweetened whipped cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the bits: Line a pie plate with plastic wrap. Melt the chocolate in a double boiler or on low power in a microwave. Add the salt, stir to blend and then, using a spatula, spread the chocolate on the plastic, making a layer that’s 1/8-inch thick (shape doesn’t matter). Press a piece of plastic wrap against the surface and freeze for at least 45 minutes. When you’re ready to make the sundaes, chop the chocolate into bite-size bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce: Put the chocolate, cream, corn syrup and sugar in a medium pan over medium-low heat. Cook, stirring constantly, until the chocolate melts and comes to a light simmer, about 5 minutes. Still stirring, let it burble for a minute or two, then scrape it into a heatproof container. Use immediately, or cover and refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sundaes: If necessary, warm the fudge sauce in a double boiler, or microwave on low. For each sundae, sprinkle some salted chocolate bits and almonds in the bottom of a bowl, snifter or sundae glass. Top with a scoop or two of coffee ice cream, some hot fudge sauce, almonds and bits. Finish with a scoop or two of vanilla ice cream, fudge sauce, whipped cream, almonds and chocolate bits. Serve immediately with a long spoon."}]}