{"@context": "http://schema.org", "@type": "Recipe", "name": "Patra Ni Machhi", "description": "This recipe is adapted from a version found in \"My Bombay Kitchen,\" Niloufer Ichaporia King’s indispensable book on Parsi cooking. Ichaporia King, a culinary scholar, anthropologist and terrific home cook, recommends steaming the fish, but the soft lap of wood smoke is a natural complement to the sweet, floral flavor the banana leaf imparts. Look for fresh or frozen banana leaves and coconut at Mexican, Asian and Indian markets. As Ichaporia King says, “It does represent some effort to find the banana leaves, but it’s worth it.” If you can’t find banana leaves, you can use fig leaves (shiny side-up) or pieces of aluminum foil lined with parchment paper. And if you don’t have access to a grill, you can roast the fish parcels on a baking sheet in an oven preheated to 450 degrees for about 8 minutes until done.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/07/30/magazine/30eat1/30mag-30eat.t_CA0-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "banana leaf, fish, mint, serrano pepper", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "30 grams", "saturatedFatContent": "10 grams", "sodiumContent": "578 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["2 cups (185 grams) finely grated coconut (fresh or frozen and thawed)", "2-4 serrano peppers, stemmed and cut into ½-inch pieces", "1 1/2 packed cups roughly chopped cilantro leaves and tender stems (from about 1 large bunch)", "20 mint leaves", "1/2 teaspoon ground cumin", "2 tablespoons sugar", "Kosher salt", "1/3-1/2 cup freshly squeezed lime juice (from 3–4 limes)", "1/2 pound banana leaves (fresh or frozen and thawed)", "2 pounds flaky white fish, like rock cod, lingcod, snapper or sea bass"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a charcoal grill, fill a chimney starter with charcoal, and light."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place coconut, peppers, cilantro, mint, cumin, sugar, 3/4 teaspoon of salt and about half the lime juice in the bowl of a food processor, and process until very finely chopped, stopping occasionally to scrape down the sides of the bowl with a rubber spatula. Add more lime juice as needed to create a smooth paste. Taste, and adjust salt as needed; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unfold banana leaves, and carefully remove the center rib, if necessary. If using fresh banana leaves, pass them over a flame for a moment until they soften. Cut the leaves into 6 12-to-14-inch rectangles, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Portion the fish into 6 servings. (If using a thicker fillet like sea bass, slice the fish ½-to-¾-inch thick, and portion out multiple pieces as a serving.) Season the fish lightly with salt on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a piece of banana leaf on a cutting board with the dull side facing up and positioned with a short overhang at the top. Gently place a portion of fish about 4 inches down from the top of the leaf. Coat both sides of the fish with the chutney (2-3 tablespoons per serving). Fold the top edge of the banana leaf down over the fish, then fold in the sides. Continue folding the fish down to the bottom edge of the banana leaf to form a packet. Repeat with remaining fish and banana leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the coals are white-hot, pour them out of the chimney starter into the grill to form a hot bed of coals. Use tongs to move any flaming coals off to one side of the grill. Set the grill grates over the coals, and allow them to get hot. If using a gas grill, preheat to medium-high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the grill grates are very hot, arrange the packets on the grill in a single layer. Avoid cooking directly over a flame. Grill the packets 5 minutes, rotating 180 degrees halfway through. Flip the packets, and cook the fish 4 to 6 minutes more, again rotating to ensure even browning. When simmering juices drip from the parcels and the fish begins to feel firm to the touch, it’s done. To be sure, unwrap one piece of fish, and poke it with a knife or your finger. If it begins to flake, it’s done. If it’s still translucent or doesn’t flake, rewrap, and return it to the grill for another minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot, allowing each diner to experience the gush of aromatic steam upon unwrapping her own piece of fish at the table."}]}