{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Rice", "description": "This recipe, from the chef Yotam Ottolenghi, is richly spiced and flavorful, a dish that would pair with almost any grilled or roasted meat. Try it sometime with a Sunday roast chicken and a pile of greens, a comforting spread as the weekend slides away.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/05/22/magazine/22feastrecipes6-bakedrice/22feastrecipes6-bakedrice-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "middle eastern", "recipeCategory": "", "keywords": "basmati rice, curry leaves, saffron, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 726}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 340, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "402 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1/3 cup extra-virgin olive oil", "2 heads garlic, cloves peeled", "12-14 medium-size shallots, peeled and quartered lengthwise", "Zest of 1 lemon", "2 whole sprigs fresh curry leaves, left on stem, or substitute a handful of dry curry leaves", "2 cups basmati rice", "2 teaspoons kosher salt, or to taste", "1/2 teaspoon saffron threads, soaked in 2 tablespoons boiling water for 30 minutes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425. Put the oil into a sauté pan set over medium heat. When the oil shimmers, add the garlic cloves, shallots and lemon zest, and cook, tossing occasionally, for about 15 minutes, until the garlic is golden brown and soft. Add the sprigs of curry leaves, and cook for approximately 2 minutes more, or until the leaves are starting to crisp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the garlic and shallots into a large ovenproof baking dish, approximately 10 by 14 inches, and spread the rice over the vegetables in an even layer. Sprinkle 2 teaspoons of salt over the rice, and then pour 3 1/2 cups of boiling water over the rice. Cover the dish tightly with aluminum foil, and place in the oven for 30 minutes or so, until all the water has been absorbed and the rice is light, fluffy and starting to turn crisp around the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dish from the oven, uncover and drizzle the saffron and its soaking water over the dish. Re-cover the dish with aluminum foil, and allow it to sit on the stovetop for another 5 or 10 minutes, then serve."}]}