{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Fajitas With Peppers and Zucchini", "description": "Shrimp fajitas are quickly thrown together. The shrimp are tossed in a mix of lime juice and zest, adobo sauce from a can of chipotles, olive oil, cumin and garlic, and don’t need to be marinated for longer than 30 minutes. I use just enough adobo sauce in the marinade to obtain its spicy and slightly sweet essence without overpowering the shrimp.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2016/05/11/dining/11FAJITAS3/11FAJITAS3-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "southwestern", "recipeCategory": "tacos", "keywords": "adobo sauce, bell pepper, corn, jalapeño, shrimp, tortilla, zucchini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 220}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 495, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "7 grams", "proteinContent": "29 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1135 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Zest of 1 lime (2 teaspoons)", "1/4 cup fresh lime juice", "Salt and pepper", "2 teaspoons cumin seeds, lightly toasted and ground", "1 tablespoon adobo sauce from canned chipotles in adobo", "1/4 cup plus 3 tablespoons extra-virgin olive oil", "4 large garlic cloves, minced", "1 1/2 pounds medium or large shrimp, shelled and deveined", "1 large red or yellow onion, halved and sliced", "1 red bell pepper, seeded and sliced 1/4-inch thick", "1 jalapeño or 2 serrano chiles, minced", "1 large zucchini, halved lengthwise and sliced", "1 cup fresh or frozen corn kernels (from 1 large ear of corn)", "1/4 cup chopped cilantro", "1 romaine heart, sliced crosswise", "4 large flour or 8 corn tortillas", "Quick green salsa, for serving (see recipe) ", "Queso fresco, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine lime zest and juice, 1/2 teaspoon salt, 1 teaspoon ground cumin, the adobo sauce, 1/4 cup olive oil and half the garlic. Reserve 2 tablespoons marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season shrimp with salt and pepper and place in a resealable bag. Pour in marinade and seal bag. Move shrimp around to coat well, place bag in a bowl and refrigerate for 30 minutes. Flip bag over periodically to redistribute marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy skillet over medium-high heat and add 2 tablespoons oil. When oil is hot, add onions and cook, stirring often, until they soften and begin to color, 3 to 4 minutes. Stir in bell pepper and chile and cook, stirring often, until peppers begin to soften, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in zucchini and corn, and turn heat to medium. Add remaining garlic, cumin and salt to taste. Cook, stirring often, until the zucchini is tender and peppers are nicely seared, softened and beginning to caramelize, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in reserved 2 tablespoons marinade and scrape bottom of pan with wooden spoon to deglaze. Stir in half the cilantro. Taste and adjust seasoning. Remove from heat but keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap tortillas in foil and warm in the oven, or wrap in a towel and warm in a steamer or in the microwave."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer shrimp, with marinade, to a bowl. Remove shrimp from marinade and blot briefly on paper towels. Reserve marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange lettuce on a platter. Heat remaining 1 tablespoon oil over medium-high heat in a large, heavy skillet, preferably cast-iron, or a wok. Add shrimp and let sear; when they begin to turn pink, after about 1 minute, add drained marinade. Cook, stirring, until cooked through, 3 to 4 minutes. Using tongs, transfer shrimp from pan to platter. Turn up heat, reduce liquid in pan by half, and pour over shrimp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange vegetables on platter with shrimp, or serve separately. Sprinkle with remaining cilantro and serve, with warm tortillas, salsa and crumbled queso fresco."}]}