{"@context": "http://schema.org", "@type": "Recipe", "name": "Rutabaga-Potato Mash With Bacon", "description": "For the food historian Jessica B. Harris, humble rutabagas laced with rich, smoky bacon fat were the highlight of every childhood Thanksgiving. The ones her mother cooked were sharper than the ones we buy today, so she cut them with mild potatoes, but you can adjust the proportions to your liking. If bacon is off the menu for you, add butter or olive oil to the pot instead, and more to taste after mashing.", "author": {"@type": "Person", "name": "Jessica B. Harris"}, "image": "https://static01.nyt.com/images/2017/11/15/dining/15Harris-Rex/15Harris-Rex-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "bacon, potato, rutabaga, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 276, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "707 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 strips bacon", "2 pounds rutabagas, peeled and cut into 1-inch chunks", "2 large baking potatoes, peeled and cut into 1-inch chunks", "Pinch of sugar, plus more to taste", "Salt and freshly ground black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy pot over medium heat, cook bacon until fat is rendered, and bacon is beginning to brown. Add rutabagas and pour in water to cover. Bring to a boil, then lower to a fast simmer and cook 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes to the pot and cook until both vegetables are very tender, about 20 minutes more. Drain, reserving about 2 cups of cooking liquid. Set bacon aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mash the vegetables together until smooth or, for a finer texture, put through a food mill. Add reserved liquid as needed to loosen the mixture. Finely mince bacon and add to the vegetables. Add sugar, salt and pepper and stir well. Taste and adjust the seasonings. Transfer to a serving bowl and serve hot."}]}