{"@context": "http://schema.org", "@type": "Recipe", "name": "Gruyère and Chive Soufflé", "description": "This soufflé is as classic as they come, with beaten egg whites folded into a rich, cheese laden béchamel for flavor and stability. Gruyère is the traditional cheese used for soufflé, but a good aged Cheddar would also work nicely. This makes a great lunch or brunch dish. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/13/dining/13SOUFLE-1/13SOUFLE-1-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, custards and puddings", "keywords": "chives, eggs, gruyère, parmesan, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 245}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 237, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "0 grams", "proteinContent": "14 grams", "saturatedFatContent": "10 grams", "sodiumContent": "268 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons/42 grams unsalted butter, plus more for coating dish", "5 tablespoons/25 grams finely grated Parmesan cheese", "1 cup whole milk", "3 tablespoons all-purpose flour", "1/2 teaspoon paprika", "1/2 teaspoon fine sea salt", "Pinch ground nutmeg", "4 large egg yolks", "5 large egg whites", "1/2 teaspoon cream of tartar", "1 cup/115 grams coarsely grated Gruyère cheese", "2 tablespoons chopped chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove wire racks from oven and place a baking sheet directly on oven floor. Heat oven to 400 degrees. Generously butter a 1 1/2-quart soufflé dish. Coat bottom and sides with 3 tablespoons/15 grams Parmesan, tapping out any excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot, heat milk until steaming. Meanwhile, melt butter in a large skillet over medium heat. Whisk in flour and cook until the mixture foams, about 3 minutes. Remove from heat and whisk in warm milk. Return to heat and cook until thickened, whisking constantly, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and whisk in paprika, salt and nutmeg. Whisk in egg yolks one at a time, blending fully after each addition. Transfer flour and yolk mixture to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, beat egg whites and cream of tartar at medium speed until the mixture holds stiff peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk a quarter of the whites into the lukewarm yolk mixture to lighten. Gently fold in remaining whites in 2 additions while gradually sprinkling in Gruyère cheese, remaining 2 tablespoons Parmesan and the chives. Transfer batter to prepared dish. Rub your thumb around the inside edge of the dish to create a 1/4-inch or so space between the dish and the soufflé mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dish to baking sheet in the oven and reduce oven temperature to 375 degrees. Bake until soufflé is puffed and golden brown on top and center barely moves when dish is shaken gently, about 30 minutes. (Do not open oven door during first 20 minutes.) Bake it a little less for a runnier soufflé and a little more for a firmer soufflé. Serve immediately."}]}