{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn and Clam Chowder With Zucchini and Herbs", "description": "Summer corn and clam chowder is like a clambake in a bowl, emphasizing the sweetness of each ingredient. To give the chowder a somewhat Italian slant and to magnify the corn flavor, a handful of polenta is used to thicken the broth slightly, as is the case with certain Tuscan vegetable soups. Steam your own clams, if possible, or buy chopped clams from the fishmonger.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/09/06/dining/06KITCHEN1/06KITCHEN1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "clams, corn", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 81}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 697, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "6 grams", "proteinContent": "78 grams", "saturatedFatContent": "4 grams", "sodiumContent": "3106 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 pounds chowder clams in the shell, scrubbed, (about 30 pieces), or substitute 1 pound chopped fresh clams (about 3 cups)", "2 tablespoons extra-virgin olive oil", "2 cups diced onion", "1 cup diced celery", "Salt and pepper", "2 cloves garlic, minced", "Pinch of crushed red pepper", "1 teaspoon chopped thyme", "1/2 cup medium yellow polenta (not fine)", "4 cups water or chicken broth", "4 cups clam broth, more as necessary", "3 cups cubed potato, preferably yellow-fleshed, like Yukon Gold", "3 cups corn kernels, from about 4 ears", "4 cups cubed zucchini or other summer squash", "2 limes, halved", "6 to 8 tablespoons crème fraîche or sour cream", "3 tablespoons parsley", "1 tablespoon fresh oregano or marjoram"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a clam steamer, or put about 2 inches of water in a large pot with a lid, place over high heat and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam open clams over high heat, covered. Large clams will take about 12 minutes. When cool, shuck the clams. Strain and reserve all clam broth, leaving any sand or grit in the bottom of the pot. Chop meat roughly and set aside. To save time, do this step in advance. (If using chopped clams, skip Step 1 and 2.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a heavy-bottomed soup pot over medium-high heat. Add onions and celery, season generously with salt and pepper and cook until softened, 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add garlic, red pepper and thyme. Stir and let sizzle briefly, then add polenta and stir to coat. Gradually add the water, stirring constantly with a wire whisk as mixture begins to thicken, then add clam broth and bring to a boil. It should now look brothy and just barely thickened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to a simmer and cook for 30 minutes, until polenta grains have softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes to pot and simmer until just done, 12 to 15 minutes. Taste soup and adjust seasoning. Add more clam broth, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add corn and zucchini and simmer 5 minutes until zucchini is tender. Add chopped clams and cook 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle soup into individual bowls. Squeeze some lime juice into each portion and top with a dollop of crème fraîche. Sprinkle with parsley and oregano."}]}