{"@context": "http://schema.org", "@type": "Recipe", "name": "No-Churn Ice Cream", "description": "Made without an ice cream maker, this custard-base ice cream is frozen solid in a loaf pan, then churned until creamy in a food processor or blender. It's best scooped straight from the machine, when it has the satiny-chewy texture of soft serve. If you do want to make it ahead, you can return it to the freezer for up to a week, then let it sit at room temperature for 20 minutes before serving.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/06/12/dining/00Icecream17/100Icecream17-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "1 1/2 pints", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "cream cheese, heavy cream, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "recipeIngredient": ["6 large egg yolks", "1/2 cup/100 grams granulated sugar", "1/2 cup/79 milliliters light corn syrup (or substitute 1/3 cup agave or honey)", "1/4 teaspoon fine sea salt", "3 cups/710 milliliters heavy cream", "3 ounces/85 grams cream cheese, cubed, at room temperature", "1/3 cup/79 milliliters whole milk", "Your flavoring of choice (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together yolks, sugar, corn syrup, and salt until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan over medium heat, bring cream to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisking yolks constantly, slowly pour half the hot cream into the egg mixture. Scrape custard back into saucepan and cook over medium-low heat, stirring constantly, until custard is thicken enough to coat the back of a spoon (180 degrees on an instant-read or candy thermometer). Do not let mixture come to a simmer or it could curdle. Remove from heat, whisk in cream cheese, then strain into a heatproof bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Nestle bowl in a larger bowl filled with ice water. Using a hand mixer or immersion blender, whip custard until thick and cold, about 5 minutes. Spoon mixture into a loaf pan or a gallon-sized resealable plastic freezer bag. Freeze at least 3 hours or overnight (or up to 1 week)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you used a pan, fill your sink with hot water and set pan in the water to loosen the ice cream, or cut away the plastic bag from ice cream. Using a big knife, cut chunk of ice cream into 2-inch cubes and put them in a food processor or blender. Pulse cubes with milk until the ice cream is smooth and has the consistency of soft serve. Serve immediately, or return to container and freeze for up to 1 week."}]}