{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Crusty Bread", "description": "We thought we’d landed upon the simplest yeast bread recipe in 2007, when Mark Bittman wrote about <a href=\" https://cooking.nytimes.com/recipes/11376-no-knead-bread\">the no-knead approach</a> of Jim Lahey, owner of Sullivan Street Bakery. It quickly became (and remains) one of our most popular recipes because it made bakery-quality bread a real possibility for home cooks. But then we heard about Jeff Hertzberg, a physician from Minneapolis, who devised a streamlined technique for a crusty loaf of bread. Mix flour, salt, yeast and water. Let it sit a bit, refrigerate it, take some out and let it rise, then bake it. The crusty, full-flavored loaf that results may be the world’s easiest yeast bread.", "author": {"@type": "Person", "name": "Nick Fox"}, "image": "https://static01.nyt.com/images/2017/08/08/insider/simple-crusty-bread/simple-crusty-bread-articleLarge.jpg", "totalTime": "PT3H45M", "recipeYield": "4 loaves", "recipeCuisine": "american", "recipeCategory": "breads", "keywords": "side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2440}, "recipeIngredient": ["1 1/2 tablespoons yeast", "1 1/2 tablespoons kosher salt", "6 1/2 cups unbleached, all-purpose flour, more for dusting dough", "Cornmeal"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl or plastic container, mix yeast and salt into 3 cups lukewarm water (about 100 degrees). Stir in flour, mixing until there are no dry patches. Dough will be quite loose. Cover, but not with an airtight lid. Let dough rise at room temperature 2 hours (or up to 5 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake at this point or refrigerate, covered, for as long as two weeks. When ready to bake, sprinkle a little flour on dough and cut off a grapefruit-size piece with serrated knife. Turn dough in hands to lightly stretch surface, creating a rounded top and a lumpy bottom. Put dough on pizza peel sprinkled with cornmeal; let rest 40 minutes. Repeat with remaining dough or refrigerate it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place broiler pan on bottom of oven. Place baking stone on middle rack and turn oven to 450 degrees; heat stone at that temperature for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust dough with flour, slash top with serrated or very sharp knife three times. Slide onto stone. Pour one cup hot water into broiler pan and shut oven quickly to trap steam. Bake until well browned, about 30 minutes. Cool completely."}]}