{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Pepper Fettuccine With Roasted Butternut Squash", "description": "To contrast with the sweetness of butternut squash, look to something salty and something spicy. This dish features hand-cut homemade red pepper pasta, no more difficult than making ordinary egg pasta. The dough contains three kinds of dried red pepper — sweet paprika, cayenne and a bit of smoky pimentón — which give it its rusty red hue. You can prep most of the components in advance, so it’s easy to finish at the last minute.  ", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/03/02/dining/02KITCHEN4/02KITCHEN4-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "pastas", "keywords": "bacon, butternut squash, cayenne pepper, egg, pancetta, paprika, pimentón, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 108}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 375, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "14 grams", "saturatedFatContent": "6 grams", "sodiumContent": "518 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups/250 grams all-purpose flour, more as needed", "1/4 teaspoon salt", "2 tablespoons Hungarian paprika", "1/4 teaspoon cayenne", "2 teaspoons pimentón dulce", "2 eggs", "Extra-virgin olive oil", "Rice flour, for dusting", "4 cups butternut squash, peeled and cut into 1/2-inch cubes (1 pound)", "Salt and pepper", "Crushed red pepper", "2 ounces pancetta or bacon, cut into lardons", "1 sprig rosemary, plus 1/2 teaspoon finely chopped rosemary", "1 sprig sage, plus 1/2 teaspoon finely chopped sage", "1 small onion, diced", "3 garlic cloves, minced", "1 cup fresh ricotta", "1 1/2 teaspoons grated lemon zest", "Grated pecorino, for garnish", "2 tablespoons chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a mixing bowl, combine flour, salt, paprika, cayenne and pimentón. In a separate bowl, beat eggs with 3 tablespoons water and 1 tablespoon olive oil. Pour egg mixture into the flour mixture and stir with chopsticks or a wooden spoon to combine until a rough dough is formed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a work surface dusted with all-purpose flour and knead into a ball. Wrap dough in plastic and let rest at room temperature for at least 15 minutes. (It may appear dry or tough at first, but it will become hydrated and more relaxed after resting.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to 400 degrees. Put squash in a bowl, add 2 tablespoons oil, a generous amount of salt and pepper, a pinch of crushed red pepper, and the pancetta or bacon. Strip leaves from 1 sprig rosemary and 1 sprig sage, add to bowl, then toss well to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread squash mixture on a baking sheet in an even layer and roast for 20 minutes, or until cooked and lightly browned. Adjust seasoning to taste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the fettuccine: Roll out dough by hand or with a pasta machine into thin sheets (but not paper thin). Cut sheets into pieces approximately 6 by 9 inches. Dust each piece lightly with rice flour, stack them, and gently roll the stack into a loose cylinder, as if making a jelly roll. With a sharp knife, cut crosswise to make thin ribbons, about 1/8-inch wide. Dust a baking sheet with rice flour and arrange cut ribbons in a single layer to keep them from sticking together. Dust with more rice flour. Leave uncovered at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons olive oil in a large skillet over medium-high heat. Add onions, season generously with salt and pepper, and cook, stirring, until softened, 3 to 4 minutes. Add garlic, chopped rosemary and sage, and a pinch of crushed red pepper and cook for 1 minute. Add reserved squash, then fold in 1/2 cup ricotta and the lemon zest. Cook for 1 minute more and turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil over high heat. Boil the pasta for 1 to 2 minutes, until al dente. Drain, reserving 1 cup of pasta cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta to the skillet, and gently fold ingredients together. Add 3 to 4 tablespoons pasta cooking water. Transfer to a warm serving platter, dot with remaining 1/2 cup ricotta and sprinkle with pecorino and parsley."}]}