{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Meat Tortellini With Tomato Sauce", "description": "According to local legend in Emilia-Romagna, Italy, the birthplace of tortellini, the pasta's navel shape was inspired by the indescribable beauty of Venus's belly button. Keep that in mind as your roll, stuff and fold these little dumplings, whose recipe is adapted from the \"true and authentic\" version codified by the Confraternita del Tortellino and notarized by the Bologna Chamber of Commerce. While tortellini are traditionally served as a middle course in a light meat brodo, they'll make a fine main course when tossed with a simple tomato sauce and topped off with a light grating of Parmesan. This version yields enough for leftover pasta and sauce. Freeze them both separately when you're done for a comforting meal in the days and weeks to come. hen you're done for a comforting meal in the days and weeks to come. (And check out Cooking's <a href=\"https://cooking.nytimes.com/guides/42-how-to-make-pasta\">How to Make Pasta guide</a> for more tips and video.)", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/04/07/dining/07PASTAGUIDE4/07PASTAGUIDE4-mediumThreeByTwo440.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings, plus leftover pasta and sauce", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas", "keywords": "basil, ground beef, ground pork, mortadella, tomatoes, tortellini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 66}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 801, "unsaturatedFatContent": "50 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "71 grams", "fiberContent": "3 grams", "proteinContent": "29 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1000 milligrams", "sugarContent": "7 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 tablespoons extra-virgin olive oil", "1/2 pound ground beef", "1/2 pound ground pork", "2 cloves garlic, sliced", "2 ounces mortadella, finely diced", "1/4 cup (1/2 ounce) freshly ground Parmesan", "3 tablespoons very finely chopped parsley", "1/8 teaspoon freshly grated nutmeg", "Large pinch ground cloves", "Salt", "Freshly ground black pepper", "2 large eggs", "1 28-ounce can peeled Roma or San Marzano tomatoes in their juices", "1/2 cup extra-virgin olive oil", "1 medium yellow onion, diced", "Salt", "2 cloves garlic, sliced", "1 teaspoon dried oregano or 12 basil leaves, torn into large pieces", "Freshly grated Parmesan for serving", "Fine sea salt or kosher salt, preferably Diamond Crystal", "Basic egg pasta dough, cut into sheets <a href=\"https://cooking.nytimes.com/recipes/1018702-basic-fresh-pasta-dough\">(see recipe)</a>", "Semolina flour for dusting pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Add 3 tablespoons olive oil to a large cast-iron pan set over medium-high heat. Crumble in ground beef and pork and reduce heat to medium. Using the edge of a metal spoon, break up clumps of meat as they form, stirring regularly. Once the meat is evenly broken up, continue to cook, stirring only occasionally, until all of the water has evaporated and the cooking sounds change from steaming to sizzling, about 7 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the meat begins to brown, clear a spot in the center of the pan and add 1 tablespoon olive oil and the garlic. Cook the garlic until it starts to release an aroma, about 20 seconds, then stir it into the meat and cook another 30 seconds or so. Remove from heat and cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, combine meat mixture, mortadella, Parmesan, parsley, nutmeg, cloves, 1 teaspoon salt and pepper. Pulse to combine, then taste and adjust salt and pepper as needed. Add eggs and pulse, stopping to scrape the sides of the bowl with a rubber spatula, until the mixture is smooth and tacky. Cover and refrigerate until you’re ready to assemble ravioli."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the tomato sauce: Pour tomatoes and their juices into a medium bowl and use your hands to crush them. Pour 1/4 cup water into the can and swirl, then add to tomatoes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a small Dutch oven or similar pot over medium-high heat and add 3 tablespoons olive oil. When it shimmers, add onion and a generous pinch of salt. Reduce heat to medium, and cook, stirring occasionally, until onions are tender and golden brown, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Move onions to the edges of the pot and add 1 tablespoon olive oil. Add garlic and allow it to gently sizzle, about 20 seconds. Before the garlic has a chance to start browning, stir it into the onions and add tomatoes. Season with salt and oregano or basil and bring to a hard simmer. Stir, then reduce heat to low and cover pot (to prevent splattering). Cook, stirring occasionally, for 40 minutes or until raw tomato taste is gone. (Tomato sauce can be made up to 2 days in advance and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the tortellini: Place a sheet of pasta on your workspace and dust off any excess flour. One sheet at a time, cut the pasta into 2 1/2-inch squares, or use a 2 1/2-inch biscuit cutter to cut rounds from the pasta sheets. As you cut or punch, stack and store the pieces under a lightly dampened dish towel or in a plastic bag to keep them from drying out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a clean work counter, lay out about 15 pasta rounds or squares at a time, and spoon rounded teaspoonfuls of filling onto the pasta, just off center. Use a spray bottle or wet pastry brush to lightly dampen the edges of the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "One at a time, pick up a piece of pasta and fold in half over the filling, squeezing out air bubbles as you press the dough around the filling with dry fingers to seal the tortellino. If you’re working with circles, you’ll be left with a half-moon shape. If using squares, fold corner-to-corner to form a triangle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Holding a tortellino in one hand, use your other index finger to gently poke an indent into the center of its base (the bottom of the filling). Folding the tortellino around the indent, draw both of its bottom corners together as if forming a fortune cookie. Overlap the corners and press to seal them together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss lightly with semolina flour, then lay out in a single layer on the second prepared baking sheet. Continue with remaining pasta and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the tomato sauce and cook the pasta: Set a large pot filled with 5 quarts of water over high heat, cover, and bring to a boil. Add 6 tablespoons fine sea salt or 1/2 cup kosher salt. Drop 48 tortellini into the water and stir."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the sauce from heat and stir in 1/4 cup olive oil. Pass sauce through a food mill or use a stick blender to puree. Taste and adjust salt as needed. Set a large frying pan with curved edges on the stove over low heat. Add 1 1/2 cups tomato sauce and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the tortellini are cooked, about 3 to 4 minutes, use a spider or skimmer to lift them out, shake off excess water, and place directly into the pan of sauce. Toss and swirl tortellini in sauce until they are all evenly covered. If the sauce is too thick, add pasta water 1 teaspoon at a time to loosen. The sauce should cling to the pasta without appearing to seize. Serve immediately with grated Parmesan."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Meat Tortellini With Tomato Sauce", "description": "How to make classic meat tortellini with tomato sauce.", "thumbnailUrl": "https://static01.nyt.com/images/2017/04/07/dining/07PASTAGUIDE4/07PASTAGUIDE4-mediumThreeByTwo440.jpg", "uploadDate": "2017-04-05T15:14:14.000Z", "duration": "PT2M52S"}}