{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrikhand (Sweet Strained Yogurt)", "description": "Shrikhand is a creamy yogurt-based dessert from western India made simply by straining yogurt and sweetening it. The yogurt is traditionally strained by pressing it between newspaper (to soak up extra whey), but if you can find thick, full-fat Greek yogurt at the grocery store, then the process is even simpler: Hang it in a mesh strainer over a bowl for a day, and let the excess whey drip out. You can substitute slivered almonds for pistachios, if that's more your speed, or even skip the nuts altogether for a smooth shrikhand flavored only with sugar, cardamom and a celebratory sprinkle of saffron threads.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/07/31/magazine/31eat/31eat-articleLarge-v2.jpg", "totalTime": "P1DT10M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "indian", "recipeCategory": "custards and puddings", "keywords": "dessert, greek yogurt, pistachio, saffron", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 265}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 186, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "53 milligrams", "sugarContent": "26 grams", "transFatContent": null}, "recipeIngredient": ["32 ounces plain full-fat Greek yogurt", "1 1/2 cups loosely packed confectioners’ sugar", "1 cup roasted unsalted or lightly salted pistachios, roughly chopped, plus ⅓ cup for garnish, roughly chopped", "1 teaspoon saffron threads, finely chopped, plus a pinch for garnish, finely chopped", "1/4 teaspoon cardamom powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put yogurt in a fine-mesh strainer suspended over a large bowl, cover with plastic wrap and place in the fridge. Let excess whey strain for 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer yogurt to a large mixing bowl, and gently stir in sugar, pistachios, saffron and cardamom. When they are combined, transfer mixture into a serving dish, using an offset spatula to smooth out the top. Evenly sprinkle reserved pistachios and pinch of saffron over the top, and chill for an hour before serving. Shrikhand will keep covered in the fridge for a few days (though the pistachios will soften)."}]}