{"@context": "http://schema.org", "@type": "Recipe", "name": "Buckwheat Popovers", "description": "These airy, crisp popovers have a rich, nutty flavor, thanks to the combination of buckwheat flour and a little whole-wheat flour stirred into the batter. If you’ve never made popovers, they’re extremely easy to mix up with just a bowl and a whisk, no electric beaters required. Or you can use a blender if you like. The only thing to keep in mind is that you should not open the oven door during baking until the very end, or they might not puff. Use your oven light and window to check on their progress. You can make the batter a few hours or even the night before (store it in the refrigerator). Just give it a quick whisk before pouring it into the pans for baking. Then serve your popovers hot from the oven, with plenty of butter and jam. The recipe makes six popovers, using a popover pan, but you can stretch that to 12 popovers if you use a muffin tin instead. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/25/dining/25APPE1/25APPE1-mediumThreeByTwo440.jpg", "totalTime": "PT50M", "recipeYield": "6 popovers", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, snack, pastries, quick breads", "keywords": "buckwheat flour, eggs, milk, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 179}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 169, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "212 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup/236 milliliters whole milk, at room temperature", "3 large eggs, at room temperature", "2 tablespoons unsalted melted butter, plus more for pans (or use cooking spray)", "1 teaspoon granulated sugar", "1/2 teaspoon fine sea salt", "3/4 cup/90 grams all-purpose flour", "2 tablespoons buckwheat flour", "2 tablespoons whole-wheat flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Brush cups of a popover pan (or muffin tin) with butter or coat with cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large measuring pitcher with a spout (this makes pouring easier later), or in a bowl, whisk together milk, eggs, butter, sugar and salt until frothy. Add flours and whisk until mostly smooth, though a few clumps may remain in batter, which is fine. (If you prefer you can mix everything together in a blender instead of a bowl.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into prepared cups. Bake 20 minutes. Turn heat down to 350 degrees and bake another 20 minutes until popovers are golden brown and puffed. (Reduce baking time by 5 minutes if using a muffin tin.) Keep tabs on their progress by looking through the window in the oven door. Do not open the oven door until the last 5 minutes of baking or they won’t puff. Serve warm."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Buckwheat Popovers", "description": "In a twist on a morning classic, earthy buckwheat imparts new life to this soft, crispy pastry.", "thumbnailUrl": "https://static01.nyt.com/images/2017/01/25/dining/25APPE1/25APPE1-mediumThreeByTwo440.jpg", "uploadDate": "2017-01-20T20:06:31.000Z", "duration": "PT2M26S"}}