{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Carrot Salad With Arugula and Pomegranate", "description": "This composed, bright salad of roasted carrots, thinly sliced fennel and arugula gains a fruity depth from a splash of pomegranate molasses in the dressing. You can find pomegranate molasses in Middle Eastern groceries and specialty food shops, and it’s worth seeking out for its complex, sweet-tart acidity. Once opened, it will last for years in your pantry. This salad makes a delightful side dish or light main course, especially if you include the optional toasted walnuts or pita chips, which add a satisfying crunch. If you can find multicolored carrots, this already striking salad becomes even prettier.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/04/05/dining/05APPE1/05APPE1-mediumThreeByTwo440-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings, vegetables", "keywords": "appetizer, side dish, arugula, carrot, fennel, pomegranate molasses, pomegranate seeds, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 429}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "6 grams", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "239 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound carrots, peeled and cut into 2-inch lengths (halve them if carrots are large)", "1/4 teaspoon kosher salt, more to taste", "1/8 teaspoon ground black pepper, more to taste", "1/4 cup plus 2 tablespoons extra-virgin olive oil, more as needed", "1/2 teaspoon ground cumin", "1 tablespoon pomegranate molasses", "1/2 tablespoon fresh lemon juice, more to taste", "1 garlic clove, finely grated or minced", "1/2 teaspoon Dijon mustard", "3 ounces baby arugula (about 3 cups)", "1 fennel bulb, thinly sliced", "1/4 cup fresh dill fronds or mint leaves", "Pomegranate seeds, as needed", "Yogurt, for serving (optional)", "Toasted walnuts or crumbled pita chips, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Toss carrots with salt, pepper and 2 tablespoons oil on a rimmed baking sheet, and bake until edges are caramelized and carrots are tender, 28 to 33 minutes. Remove from oven and immediately toss with cumin. Let cool for a few minutes while you make the dressing. Carrots should be slightly warm but not hot when tossed with the greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together pomegranate molasses, lemon juice, garlic, mustard and large pinch of salt and pepper. Taste and adjust lemon juice and seasonings if necessary. Whisk in remaining 1/4 cup oil until emulsified."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir carrots into dressing, then gently toss with arugula, fennel and dill or mint. Serve immediately, drizzled with more olive oil and topped with pomegranate seeds, and yogurt and nuts or pita chips if using."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Roasted Carrot Salad", "description": "Pomegranate molasses adds a sweet and unexpected tang to this colorful carrot salad.", "thumbnailUrl": "https://static01.nyt.com/images/2017/04/05/dining/05APPE1/05APPE1-mediumThreeByTwo440-v2.jpg", "uploadDate": "2017-03-31T17:12:24.000Z", "duration": "PT2M21S"}}