{"@context": "http://schema.org", "@type": "Recipe", "name": "Dudhi Kofta Curry (Indian Squash Dumplings)", "description": "The Indian cookbook author Raghavan Iyer experienced his first Thanksgiving, in Minnesota, in the early 1980s. “Coming from a land of spice, I thought, ‘Man, how boring,’\" he recalled. He shared this recipe for squash dumplings in a creamy tomato sauce spotted with cashews and raisins, a bright and spicy dish welcome on any table, any time of the year. In a pinch? The sauce and dumplings can be prepared a day ahead and refrigerated separately.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/11/11/dining/COOKING-KOFTA2/COOKING-INDIAN2-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, curries", "keywords": "cashew, chickpea flour, ginger, raisin, serrano pepper, zucchini, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 111}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 138, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "2 grams", "sodiumContent": "422 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds zucchini, trimmed", "2 teaspoons coarse kosher or sea salt", "1 small red onion, peeled and coarsely chopped", "2 tablespoons raw cashews", "4 large cloves garlic, peeled", "4 lengthwise slices fresh ginger (each 2 inches long, 1 inch wide and 1/8-inch thick)", "4 fresh green Thai, cayenne or serrano chiles, stems removed", "1/4 cup chickpea flour", "2 tablespoons rice flour", "2 tablespoons finely chopped fresh cilantro leaves and tender stems", "Vegetable oil for deep-frying", "2 tablespoons ghee or vegetable oil", "1 teaspoon cumin seeds", "1 small red onion, peeled and coarsely chopped", "4 fresh green Thai, cayenne or serrano chiles, stems removed, coarsely chopped (do not remove seeds)", "2 tablespoons raw cashews", "2 tablespoons golden raisins", "1 (14.5-ounce) can diced tomatoes", "1 teaspoon coarse kosher or sea salt", "1/4 teaspoon ground turmeric", "1/2 cup half-and-half", "1 teaspoon garam masala", "2 tablespoons finely chopped fresh cilantro leaves and tender stems, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dumplings: Shred zucchini using a food processor or box grater. Collect shreds in a large bowl and mix in salt. Let stand for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place onion, cashews, garlic, ginger and chiles in a food processor. Pulse until mixture forms a spicy-smelling, slightly chunky paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap zucchini in a clean kitchen towel and squeeze out all the liquid. (Discard the liquid.) Transfer squash back to bowl and stir in onion paste mixture until combined. Add chickpea flour, rice flour and cilantro and stir to combine into a slightly wet batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, place a heaping tablespoon of batter in the palm of your hand and squeeze it to condense it into a ball; transfer dumpling to a baking sheet. Repeat with remaining batter to make about 25 dumplings. (The longer you let the batter stand without shaping it, the more liquid the squash will release, making it difficult to handle. Adding more flour will make it manageable, but will also make the dumplings too dense.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour oil into a wok, Dutch oven or medium saucepan to a depth of about 1 inch. Set over medium heat until a candy or oil thermometer registers 300 degrees. Meanwhile, line a plate or baking sheet with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once oil is hot, gently slide 8 dumplings into pan. Fry, turning occasionally, until they are honey brown and crisp, about 5 minutes. Remove dumplings with a slotted spoon and drain on the paper towels. Repeat with remaining dumplings. You may need to adjust heat to maintain the oil temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Heat ghee or oil in a large saucepan over medium-high heat. Add cumin seeds and cook until they sizzle and darken, 5 to 10 seconds. Immediately add onions, chiles, cashews and raisins. Stir-fry until onion is soft and golden, chiles are pungent, cashews have turned honey brown, and raisins have swelled and darkened, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes, salt and turmeric to the saucepan, stirring once or twice to combine. Transfer to a blender and purée, scraping the inside of the jar as needed, to make a smooth and spicy-sweet red sauce. Pour sauce back into saucepan. Pour 1/2 cup water into blender jar and swish it around; add this liquid to pan. Stir in half-and-half and garam masala."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently add dumplings to sauce, making sure they do not break apart. Heat curry over medium heat until sauce starts to bubble, then lower heat, cover the pan, and simmer until dumplings are warmed through and have absorbed some of the sauce, about 5 minutes; do not stir. Sprinkle with cilantro before serving."}]}