{"@context": "http://schema.org", "@type": "Recipe", "name": "Alfajores  ", "description": "Popular all over Latin America, dulce de leche confections called alfajores come in many varieties. In this popular version, delicate, crumbly butter cookies are sandwiched with a thick layer of dulce de leche before being rolled in coconut. They are petite yet decadent morsels that go particularly well with strong black coffee to cut their creamy richness. You can make the dulce de leche a week ahead (store it in the refrigerator) and the cookies 5 days ahead (store them in an airtight container at room temperature). Once sandwiched together, the cookies will keep in a sealed container in the refrigerator for 3 days, but are best eaten within 24 hours of filling.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/03/01/dining/01ALFAJORES/01ALFAJORES-mediumThreeByTwo440.jpg", "totalTime": "PT4H", "recipeYield": "About 50 cookies", "recipeCuisine": "latin american", "recipeCategory": "cookies and bars", "keywords": "coconut, cornstarch, sweetened condensed milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 229}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 125, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "35 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 (13.4-ounce) cans sweetened condensed milk, labels removed", "1 tablespoon/15 milliliters brandy", "1 teaspoon/2 grams finely grated lemon zest", "2 teaspoons/10 milliliters vanilla extract", "1 cup/125 grams all-purpose flour", "1 cup plus 1 tablespoon/165 grams cornstarch", "1 teaspoon/5 grams baking powder", "1/4 teaspoon/1 gram baking soda", "1/2 teaspoon/3 grams fine sea salt, plus a pinch for dulce de leche", "1/2 cup/100 grams granulated sugar", "10 tablespoons/141 grams unsalted butter, at room temperature", "2 large egg yolks", "1 cup/100 grams finely ground dried coconut"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dulce de leche: Bring a large pot of water to a boil, then carefully lower condensed milk cans on their sides into the water. Simmer for 3 hours 15 minutes, refilling with hot water as needed to keep cans submerged. Never let the water boil away, or the cans could burst. Using tongs, transfer cans to a rack to let cool completely before opening."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine brandy, lemon zest and 1 teaspoon vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flour, cornstarch, baking powder, baking soda and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer, beat sugar and butter until light and fluffy, about 3 minutes. Add yolks and beat to combine, then add brandy mixture and beat until just combined. Add flour mixture, and mix on low speed until the dough just comes together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough in half and roll each piece into a log about 1 1/2 inches thick. Wrap in plastic and chill until firm, at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line 3 baking sheets with parchment paper. Remove dough from plastic wrap and slice into 1/8-inch-thick rounds. Place on prepared sheet pans, then bake until edges start to turn golden, about 7 minutes. Transfer each pan to a rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine dulce de leche with remaining 1 teaspoon vanilla and a large pinch of salt. Spoon the mixture into a plastic zipper bag and cut a corner off. (Or you could scoop it into a pastry bag if you prefer, or just use a spoon.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flip half of the cookies upside down and pipe a thick layer of dulce de leche onto bottoms (or use a spoon to spoon the mixture on). Top with remaining cookies to sandwich the dulce de leche in the middle. Roll sides in coconut. Eat right away, or store in the refrigerator until serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Alfajores", "description": "Learn to make dulce de leche from a can of condensed milk for this Latin American dessert.", "thumbnailUrl": "https://static01.nyt.com/images/2016/03/01/dining/01ALFAJORES/01ALFAJORES-mediumThreeByTwo440.jpg", "uploadDate": "2016-02-26T18:13:27.000Z", "duration": "PT2M16S"}}