{"@context": "http://schema.org", "@type": "Recipe", "name": "Crab Croque-Madame", "description": "Every Francophile has eaten a croque-monsieur, which is essentially a hot ham and cheese sandwich, the top spread with a layer of béchamel sauce and grated cheese, then grilled until golden and bubbly. You can get one in any café, where it is eaten from a little plate, either at a small table or standing at the bar, using a knife and fork. A croque-madame is exactly the same, with a fried egg on top. Why is it madame when it has an egg? No one knows. I decided to make a version with crab meat, which I thought would be novel, until I discovered it had already been invented, many times over. It seems there already exists the crab toastie, an American open-face snack made with English muffins. And crab toasties are well known in the British Isles as well. I pushed mine in a slightly creole direction, adding cayenne, tarragon and chives.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/03/01/dining/01KITCH-SUB/01KITCH-SUB-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "breakfast, brunch, lunch, sandwiches", "keywords": "cheddar, crab meat, eggs, gruyère, ham, toast, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 106}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 403, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "10 grams", "sodiumContent": "968 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Unsalted butter", "6 slices rustic country bread, about 1/2 inch thick, or day-old white bread, sliced 3/4 inch thick", "2 tablespoons all-purpose flour", "2 cups whole milk, heated", "Salt and pepper", "Pinch of grated nutmeg", "1/4 cup crème fraîche", "1 pound cooked crab meat", "1 teaspoon paprika", "Pinch of cayenne", "Pinch of smoked Spanish pimentón dulce or chipotle powder", "1/2 teaspoon grated lemon zest", "2 teaspoons Dijon mustard", "2 tablespoons snipped chives, plus more for garnish", "1 teaspoon chopped tarragon", "6 thin slices ham or prosciutto cotto", "4 ounces grated white Cheddar or Gruyère cheese, about 1 1/2 cups", "6 small eggs", "1 tablespoon chopped parsley, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large cast-iron skillet over medium-high heat. Lightly butter both sides of each bread slice. Add slices to pan and let sizzle until crisp and golden on each side, working in batches if necessary. Place browned slices in one layer on a baking sheet and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the béchamel: Melt 2 tablespoons butter in a heavy saucepan over medium heat. Whisk in flour and let cook for 1 minute without coloring. Whisk in milk, then turn heat to low and continue cooking. Adjust heat to keep sauce at a bare simmer, whisking occasionally, for about 5 minutes, until smooth and medium-thick. Season with salt, pepper and nutmeg and stir in crème fraîche. Set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. In a medium bowl, combine crab meat, paprika, cayenne, pimentón, lemon zest and mustard. Add 1/2 cup warm béchamel sauce, the chives and the tarragon and stir well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put one thin slice of ham on each slice of grilled bread. Mound crab mixture onto each toast, dividing evenly among the 6 slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon remaining béchamel sauce evenly over crab mixture and sprinkle with cheese. Place baking sheet on top shelf in oven and bake for 10 minutes, until bubbling and well browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook eggs sunny side up in a small amount of melted butter. To serve, top each crab toast with an egg. Sprinkle with chives and parsley."}]}