{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Pepper Crab Croquetas With Garlic-Almond Sauce", "description": "In Spain, golden-fried croquetas are served in tapas bars to the delight of all. They may be made of any number of things, like salt, potatoes or cauliflower. Béchamel is used to bind the mixture, which gives these crab-meat croquetas a luscious center. The crisp and creamy bites are perfect for any gathering, eaten out of hand with drinks.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/06/15/dining/15KITCHEN1/15KITCHEN1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "24 croquetas", "recipeCuisine": "spanish", "recipeCategory": "snack, finger foods, project, seafood", "keywords": "appetizer, blanched almonds, crab meat, roasted red peppers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 230, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "188 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons butter", "4 tablespoons all-purpose flour, plus 1 cup more for dredging", "1 cup milk, heated", "Salt and pepper", "1 pound crab meat", "1/2 cup diced roasted red peppers", "1/8 teaspoon cayenne", "1/2 cup thinly sliced scallions", "3 tablespoons chopped cilantro", "1/2 teaspoon grated lemon zest", "3 large eggs, beaten", "2 cups fine bread crumbs, made from a French or Italian loaf", "Vegetable oil, for frying", "1 cup blanched almonds", "4 garlic cloves, finely grated", "1 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the béchamel: Melt butter in a small saucepan over medium heat. Whisk in flour and cook for 1 minute without browning. Gradually whisk in milk, 1/4 cup at a time, to obtain a smooth, thick sauce. Turn heat to low, add 1/2 teaspoon salt and a generous amount of freshly ground black pepper. Continue to cook, stirring, for 4 to 5 minutes. Thin if necessary with a tablespoon or so more milk, but keep it the consistency of whipped cream."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crab mixture: Put crab meat in a mixing bowl and add warm béchamel. Stir in roasted peppers, cayenne, scallions, cilantro, and lemon zest and mix gently until ingredients are well incorporated. Taste for salt and adjust seasoning. Spread mixture on a baking sheet in a layer about 1 inch thick, cover and refrigerate until firm, about 2 hours. (The crab mixture can be prepared up to a day in advance and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the croquetas: Arrange 3 small shallow bowls on a work counter. Add 1 cup of flour to one bowl, then season it with salt and pepper. In second, add the beaten eggs. Fill the third bowl with bread crumbs. Weigh 1-ounce portions of the crab mixture and place on wax paper. Roll each portion in seasoned flour, then dip into egg and finally roll in crumbs, forming each gently into a sphere. Put breaded croquetas on a clean baking sheet and sprinkle with more crumbs. Repeat until all are breaded. Refrigerate, uncovered, until ready to fry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the garlic-almond sauce: Put almonds in a food processor and blend thoroughly, until finely ground. Add garlic and pulse to combine. With the food processor running, add a faint drizzle of olive oil as sauce thickens. The oil must be added very slowly or the sauce will separate or break. Continue adding the oil until it is all incorporated. Season sauce with salt to taste. Transfer to a small bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fry croquetas, pour vegetable oil to depth of 2 inches in a wide, deep saucepan and place over medium-high heat. Bring oil to 375 degrees. Working in small batches, fry croquetas on each side until golden brown, about 4 minutes. (Too many in the pan risks significantly lowering the temperature of the oil.) Remove croquetas with a slotted spoon and transfer to a paper-towel-lined baking sheet. Season lightly with salt and keep warm in a low oven. Repeat until all croquetas are fried. Pile them on a serving platter and serve with garlic-almond sauce for dipping."}]}