{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Tongue", "description": "Beef tongue has none of the characteristic challenges of other ‘‘off-cuts’’ — its taste is clean and beefy and its texture is firm and fleshy. Once braised, be sure to peel it while still warm and return it to its braising liquid to remain moist. The cooked tongue will keep in the refrigerator for a week and can be used as a sandwich meat, a warm main dinner course, a cold meat salad for lunch — in almost all the ways you might use a beef tenderloin.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/07/16/magazine/16eat1/16mag-16eat.t_CA0-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "Serves 6", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, beef tongue", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 77}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 535, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "15 grams", "sodiumContent": "786 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons neutral oil, like grapeseed or vegetable", "2 Spanish onions, roughly chopped", "2 ribs celery, roughly chopped", "1 large carrot, peeled and roughly chopped", "1 3- to 3 1/2-pound beef tongue, rinsed", "12 parsley stems", "2 dried bay leaves", "1/2 tablespoon black peppercorns", "4 tablespoons red-wine vinegar", "1 tablespoon kosher salt", "Sauce gribiche (<a href=\"https://cooking.nytimes.com/recipes/1018844-sauce-gribiche\">see recipe</a>)", "Fresh parsley", "Extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the neutral oil into a large, heavy-bottomed Dutch oven set over medium heat. Sweat onion 5 minutes, stirring constantly so no color develops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the celery and carrot and 3 tablespoons of water. Cover with a tightfitting lid, and let the vegetables steam for a few minutes, being careful not to scorch. Add more water if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the tongue in the pot, and add the parsley stems, bay leaves, peppercorns, red-wine vinegar and salt. Pour in enough water to just barely cover the tongue. Cover with a lid, and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the tongue braise has come to a boil, remove the lid, and reduce to a simmer. Cut a round of parchment the diameter of the pot and set it directly on top of the braising liquid. Simmer the tongue 4 hours, adding more water if needed to keep the tongue just covered. The tongue tends to suck up a lot of water quite quickly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tongue from the braising liquid. Strain the braising liquid (discard the solids), and return liquid to the pot. Peel the thick outer skin off the tongue while it is still warm. Trim off any fat or gristle, then return the tongue to the braising liquid and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut the tongue crosswise into thin slices, and arrange on a platter in a single layer. Drizzle with a few drops of the braising liquid. Spoon the gribiche over the tongue, and top with some fresh-picked parsley leaves and a generous glug of olive oil."}]}