{"@context": "http://schema.org", "@type": "Recipe", "name": "Quiche Lorraine", "description": "The first quiche to come to the attention of the American public was the quiche Lorraine in the 1950s. Since then we have gone through what has amounted to the quiching of America. Like ice cream, the quiche appears in all flavors -- from asparagus to zucchini. This recipe makes enough filling for a pie dish. If you use a tart pan, expect to have extra custard.", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": "https://static01.nyt.com/images/2018/01/16/dining/16COOKING-QUICHELORRAINE2/16COOKING-QUICHELORRAINE2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 10 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, pies and tarts", "keywords": "bacon, eggs, gruyère, heavy cream, parmesan, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 860}, "recipeIngredient": ["Pastry for a one-crust nine-inch pie (see <a href=\"http://cooking.nytimes.com/recipes/11030-pie-pastry-for-a-nine-or-10-inch-shell\">pastry</a> recipe)", "4 strips bacon", "1 onion, thinly sliced", "1 cup Gruyère or Swiss cheese, cubed", "1/4 cup grated Parmesan cheese", "4 eggs, lightly beaten", "2 cups heavy cream or 1 cup each milk and cream", "1/4 teaspoon nutmeg", "1/2 teaspoon salt", "1/4 teaspoon freshly ground pepper", "Tabasco sauce to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a nine-inch pie plate with the pastry. By all means build a rim with the pastry and flute it. This is essential for the amount of custard indicated in this recipe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the bottom of the pastry with a round of parchment paper and add enough dried beans or peas to partly fill the shell. Bake 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the oven heat to 375 degrees. Remove and discard the beans and parchment paper and set the pastry-lined pie plate aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the bacon until crisp and remove it from skillet. Pour off all but one tablespoon of the fat remaining in the skillet. Cook the onion in the remaining fat until the onion is transparent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble the bacon and sprinkle the bacon, onion and cheeses over the inside of the partly baked pastry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the eggs, cream, nutmeg, salt, pepper and Tabasco sauce to taste. Strain the mixture over the onion-cheese mixture. Slide the pie onto a baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the pie until a knife inserted one inch from the pastry edge comes out clean, about 25 minutes. Remove to a wire rack. Let stand five or 10 minutes before serving."}]}