{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick Mango Kulfi", "description": "Traditional kulfi is made by boiling milk to reduce it, and to concentrate the milk solids, then freezing the base with flavorings such as fruit pulp, spices or nuts. Though kulfi is often compared to ice cream, it's nothing like it: Kulfi isn't churned. The protein and sugar create a rich, dense texture that is slightly crystalline and quick to melt. This recipe for instant mango kulfi takes short cuts, using canned sweetened condensed milk and heavy cream. It's a recipe that has no fixed season, that takes no time to mix up and that comes straight from my mother. She made it all year long when I was growing up, to hold us over in the lonely gaps between trips to see family in India. It's inauthentic — and delicious.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/09/17/magazine/17eat1/17eat1-articleLarge.jpg", "totalTime": "PT10H5M", "recipeYield": "Serves 12 (more with small-size molds)", "recipeCuisine": "indian", "recipeCategory": "ice dishes", "keywords": "cream, mango pulp, sweetened condensed milk, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 262}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "11 grams", "sodiumContent": "82 milligrams", "sugarContent": "29 grams", "transFatContent": null}, "recipeIngredient": ["1 pint heavy cream", "1 30-ounce can Alphonso mango pulp", "1 14-ounce can sweetened condensed milk", "Zest of 1 lime", "1/4 teaspoon cardamom powder", "1 pinch salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl mix all the ingredients until there are no streaks of color, then pour the mixture into a 9- or 10-inch loaf pan lined with plastic wrap (or individual freezer-safe ramekins). Place in the freezer, and allow to set for at least 10 hours, until frozen. Dip the outside of the pan in warm water, just long enough to release the kulfi. After you’ve used the plastic wrap to help you unmold neatly, throw it away. Slice and serve the kulfi immediately. If you’re using ramekins, allow to sit at room temperature for a few minutes, then serve directly in the bowls."}]}