{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Tofu and Fresh Soybeans Cooked in Salted French Butter and Celery-Seed Gastrique", "description": "There are three pretty joyful projects here that reward not only the pleasure-driven eater but the scientifically curious mind as well. Making soy milk, making soft tofu, and making a savory caramel sauce (not sweet like the one you're probably accustomed to, but vinegary and spicy) are all as easy as those beginner science projects we remember from grade school (growing marigolds or sprouting avocado pits) and equally as wondrous. As always, ingredients matter. The better the soy, the richer the milk, the richer the milk, the more compelling the tofu. The better the butter, the more expert the finished dish. Each component is quite easy but requires your full attention. Over-soaking the beans can give the curd a pitted texture; over-stirring the coagulant can break up the quickly setting curd and give you cottage cheese texture. And adding the vinegar to the burning sugar can be little hazardous – that step maybe closer resembles tenth grade chemistry than 1st grade marigold planting, I admit!", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/08/13/magazine/13eat1/13eat1-articleLarge-v2.png", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple cider vinegar, celery seeds, dried yellow soybeans, tofu coagulant, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "recipeIngredient": ["1 pound dried yellow soybeans, any debris removed", "9 1/4 cups filtered water", "2 teaspoons tofu coagulant (Powdered Nigari or Glucono Delta-Lactone)", "1/2 cup sugar", "2 tablespoons water", "1/2 teaspoon celery seed", "1/2 teaspoon crushed chile flakes", "1/2 cup apple-cider vinegar", "12 tablespoons salted French butter", "12 tablespoons water", "3 cups frozen fresh shelled soybeans", "Kosher salt to taste", "Tofu", "Gastrique", "Gray sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the dried yellow soybeans in tap water overnight at room temperature, making sure they are covered by 2 inches of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain water from soybeans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 3 cups of filtered water into a large heavy-duty blender, then add in the strained beans. Grind the mixture until thick and smooth as a milkshake, stirring if necessary to encourage the beans to move at first. (You may need to work in two batches, depending on the size of your blender.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, clean stainless-steel 8-quart pot, bring 6 cups of filtered water to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour soybean purée into the boiling water. Stirring gently and constantly with a rubber spatula, cook until a rich, slightly thick, silky-looking off-white soy milk develops (about 8 minutes), adjusting the temperature as necessary so that the milk does not boil over. Be sure to drag the spatula across the sides and bottom of the pan as you stir to prevent scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large fine-mesh strainer with 4 layers of cheesecloth, and place the strainer over a large bowl. Strain the milk through the cloth and strainer, carefully adding it a bit at a time with a ladle if you’re not comfortable pouring the hot liquid. As the cheesecloth fills with tofu solids, you may have to empty it — just fold the cheesecloth over the solids, squeeze the cheesecloth until you have extracted all the milk and replace the cheesecloth. (Discard soybean solids.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium clean stainless pot, heat 6 cups of the soy milk to 165 degrees, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, dissolve 2 teaspoons of coagulant in the remaining 1/4 cup of filtered water. Pour the dissolved coagulant into a clean casserole dish, ensuring first that it is large enough to fit all 6 cups of soy milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the hot soy milk over the coagulant, and stir quickly and briefly — only about 3 sturdy and confident Figure 8 strokes with a rubber spatula. Let it set up at room temperature undisturbed, 15 to 20 minutes, while you prepare the gastrique and fresh soybeans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sugar and water in a small stainless saucepot, and cook over high heat until it is a deep-amber caramel. Do not stir it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the caramel is cooking, add the celery seed and crushed chile flakes to the vinegar, and let steep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the caramel is at desired point of caramelization, carefully add the seasoned vinegar all at once. It will stop the sugar from cooking. Take care not to get burned from the hissing steam. Let the mixture bubble for a minute or 2, until any bits of hard caramel have melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepot, combine butter, water and soybeans over medium-high heat, and simmer until water almost evaporates and beans are cooked through and glossy, about 5 minutes. Season to taste with kosher salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Evenly divide the beans and their buttery liquid among 6 shallow bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In one motion, dip into the soft tofu with a large spoon, and slide tofu into the center of each bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle a spoonful of gastrique onto the beans, leaving the tofu pristine. Finish with a few flakes of gray salt on the beans. Serve at once."}]}