{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Braised With Grapes", "description": "This chicken casserole is simple to prepare, yet stunning and a trifle unusual to serve. The addition of whole clusters of seedless grapes elevates it from easy everyday to dinner-party material. I based it on two recipes: the memory of a chicken dish that I ate many years ago in Toulouse, France, and the classic poulet au vinaigre, or chicken in vinegar sauce. A mellow, aged sherry vinegar and a high-quality balsamic complement the grapes. I prefer a 15-year-old balsamic, which replaces the smidgen of tomato that is often included in poulet au vinaigre. One final tip: Be sure the grapes you select — and they can be black or green instead of red — are sweet and have green stems, an indication of freshness.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/09/28/dining/28PAIR-WEB/28PAIR-WEB-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "dinner, one pot", "keywords": "balsamic vinegar, chicken, grapes, sherry vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 213}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 660, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "2 grams", "proteinContent": "51 grams", "saturatedFatContent": "13 grams", "sodiumContent": "901 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 pound chicken, cut in 10 pieces (breasts halved, backbone and wingtips removed)", "1 tablespoon unsalted butter", "Salt and ground black pepper", "1 medium red onion, finely chopped", "2 cloves garlic, thinly sliced", "1/4 cup sherry vinegar, preferably Pedro Ximénez", "1/4 cup chicken stock", "1 teaspoon ground cardamom", "1 pound seedless red grapes, cut into small clusters leaving stems attached", "3 sprigs fresh thyme", "1 tablespoon high-quality syrupy balsamic vinegar or pomegranate molasses"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken parts dry. Melt butter in a 4-quart casserole. Brown chicken on both sides, a few pieces at a time, over medium-high heat, removing pieces to a platter as they finish. Season with salt and pepper. Reduce heat to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion and garlic and cook, stirring, a couple of minutes until soft. Stir in sherry vinegar, chicken stock and cardamom. Return chicken to the pot and baste with stock mixture. Place grape bunches in pot, add thyme, cover and reduce heat to very low. Let cook 30 minutes. Chicken juices should run clear when thigh or leg is pierced with the tip of a knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken to a warm serving platter and arrange grape clusters on top and around chicken. Tent with foil to keep warm. Heat pot on high, stir in balsamic vinegar and cook 2 to 3 minutes until sauce is somewhat reduced and thickened. Check seasoning. Discard thyme. Spoon sauce over chicken and grapes, and serve."}]}