{"@context": "http://schema.org", "@type": "Recipe", "name": "Soupe au Pistou (Vegetable Soup With Pesto)", "description": "The cookbook author and culinary historian Jessica B. Harris adapted this recipe from a meal she once had in the South of France at the home of James Baldwin, and it appears in her 2017 memoir, \"My Soul Looks Back.\" It's a simple Provençal soup — French country cooking at its best — made with whatever vegetables are in season and brightened with generous spoonfuls of green pesto. You could use a vegetable stock or a light chicken stock instead of water, if you happen to have one, but there's no need: A good dollop of pesto will deliver a bright, garlicky flavor that permeates every bite. ", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/04/30/magazine/30eat/30mag-30eat-t_CA0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 4-6", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "basil, carrot, kale, leek, parsley, pasta shells, tomato, zucchini, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 312}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 306, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "9 grams", "proteinContent": "15 grams", "saturatedFatContent": "4 grams", "sodiumContent": "720 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 tomato, cored", "1 cup basil leaves", "1 cup flat-leaf parsley leaves", "2 garlic cloves", "2 tablespoons extra-virgin olive oil", "3 ounces Parmesan or Gruyère, grated", "1 celery rib, diced", "1 carrot, peeled and diced", "1 leek, white and pale green parts only, thinly sliced", "1 sprig thyme", "2 tablespoons olive oil", "Salt and freshly ground black pepper, to taste", "1/2 pound potatoes, cut into bite-size pieces", "1/2 pound zucchini or summer squash, cut into bite-size pieces", "1/2 pound string beans, trimmed and cut into 1-inch pieces", "3/4 pound kale, roughly chopped", "1/2 pound fresh fava beans, shelled", "3/4 cup small pasta shells"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pistou: Purée the tomato, basil, parsley and garlic in a food processor. While the machine is running, drizzle in the oil. Add the cheese, and mix well, then transfer to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the soup: In a large, heavy pot over medium heat, add celery, carrot, leek, thyme and olive oil. Season with 1/2 teaspoon of salt and a few grinds of black pepper. Cook, stirring occasionally, until the leek is starting to brown, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the potatoes and 8 cups water, and bring to a boil, scraping up any bits stuck to the bottom of the pan. Simmer until the potatoes are tender, about 10 minutes, then stir in remaining vegetables and pasta. Cook uncovered until the pasta is al dente and the vegetables are tender, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pot from the heat, and stir in about half the pistou. Taste, and adjust the seasoning with salt and pepper. Serve with the rest of the pistou on the side, spooning it directly into the soup as needed."}]}