{"@context": "http://schema.org", "@type": "Recipe", "name": "Boston Cream Pie", "description": "An American classic, Boston cream pie isn't a pie at all. Its base is an old-fashioned hot milk cake, a downy-soft, buttery yellow cake. How you whip the eggs and the sugar is critical, as the tiny air bubbles they produce add lift to the finished product.\n\nThis traditional version is best the day it's made, but will hold up in the fridge for a couple of days. You may just notice a slight change in texture. Slathered with homemade vanilla custard and a chocolate glaze, it hits all the right notes, but it would be just as lovely served with in-season berries or layered with chocolate or coffee custard instead of vanilla. Make it as is, or go rogue. Either way, it’s sure to please.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2017/03/27/dining/27COOKING-BOSTON-CREAM-PIE1/27COOKING-BOSTON-CREAM-PIE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "10 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "dessert, heavy cream, semisweet chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 496}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 461, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "13 grams", "sodiumContent": "279 milligrams", "sugarContent": "39 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large egg yolks", "1/2 cup/100 grams granulated sugar", "2 tablespoons cornstarch", "Pinch kosher salt", "1 cup/240 milliliters whole milk", "1/4 cup/60 milliliters heavy cream", "1 tablespoon/14 grams unsalted butter", "1 teaspoon pure vanilla extract", "8 tablespoons/114 grams (1 stick) unsalted butter, cut into pieces, plus more for the pan", "1 3/4 cups/224 grams all-purpose flour", "1 3/4 teaspoons baking powder", "3/4 teaspoon kosher salt", "3/4 cup/180 milliliters whole milk", "3 large eggs, at room temperature", "1 cup/200 grams granulated sugar", "1 teaspoon pure vanilla extract", "1/4 cup/60 milliliters heavy cream", "4 ounces/113 grams semisweet chocolate chips", "1 teaspoon neutral oil, such as safflower", "Pinch kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the custard: In a medium saucepan, whisk together egg yolks and sugar until well combined. Whisk in cornstarch and salt. In a slow, steady stream, whisk in milk and then the cream. Add butter. Cook mixture over medium-low heat, stirring constantly with a wooden spoon, just until it starts to thicken. Immediately whisk mixture until smooth, then continue to cook and stir custard until it has come to a very low boil for 2 minutes, about 6 to 8 minutes total. Strain custard through a fine mesh sieve into a small bowl, pushing it through with a small spatula. Stir in vanilla. Cover with plastic wrap, pressing the plastic directly onto the surface. Chill for at least 3 hours and up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Heat oven to 325 degrees. Butter a 9-by-2-inch round baking pan, generously greasing the sides, and line it with parchment paper. Butter parchment paper. In a medium bowl, whisk together flour, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, bring the milk and butter to a simmer over medium heat. When the butter is melted, remove pan from heat. In a large bowl, beat eggs and sugar with an electric mixer until pale and thick, about 4 to 6 minutes. With the mixer running on low, add the milk mixture and beat until combined. Then add flour mixture and vanilla and beat until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer batter to the prepared pan and smooth the top. Bake until a toothpick inserted into the center comes out clean, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a rack and let cool 10 minutes. With a very thin knife, cut around the edge to release the cake from the side of the pan. Carefully flip the cake onto the rack, then turn it right-side-up to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cake: Using a serrated knife, carefully cut the cake into two layers and place the bottom layer on a serving plate. Stir custard, and spread it onto the cut side of the bottom half. Replace the top half of the cake, cut side down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: In a small saucepan over medium-low, heat the cream to a simmer. Remove the pot from the heat and pour cream over the chocolate chips, oil, salt and let stand for 3 minutes. Whisk until smooth. Spread the glaze evenly over the top of the cake."}]}