{"@context": "http://schema.org", "@type": "Recipe", "name": "Pistachio Poundcake With Strawberries", "description": "Ground pistachios give this loaf cake a lovely nutty flavor, green hue and tender crumb. It's adapted from the cookbook \"Sweeter Off the Vine,\" by Yossy Arefi, which often incorporates Middle Eastern ingredients in unexpected and appealing ways. Top slices of the cake with juicy macerated strawberries and a dollop of whipped cream. If you can't find lavender buds, use 1 tablespoon of finely chopped mint or basil leaves. But do not add the chopped herbs to the mortar with the sugar. Instead, toss them with the berries right before serving.", "author": {"@type": "Person", "name": "Emily Weinstein"}, "image": "https://static01.nyt.com/images/2016/04/13/dining/13COOKBOOK2/13COOKBOOK2-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dessert, lavender buds, pistachio, strawberries, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 548, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "13 grams", "sodiumContent": "278 milligrams", "sugarContent": "44 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 tablespoons/175 grams (1 1/2 sticks) unsalted butter, softened, more for greasing pan", "1 1/2 cups/195 grams all-purpose flour, more for flouring pan", "1 cup/130 grams shelled pistachios", "1/2 teaspoon baking powder", "3/4 teaspoon salt", "1 1/4 cups/250 grams granulated sugar", "3 large eggs, at room temperature", "1/2 teaspoon vanilla extract", "1/4 teaspoon almond extract", "1/2 cup/120 milliliters whole milk, at room temperature", "1/4 cup/50 grams granulated sugar (less if your berries are particularly sweet)", "1/2 teaspoon organic lavender buds (or use 1 tablespoon finely chopped mint or basil leaves)", "1/2 vanilla bean, split lengthwise and seeds scraped from the pod", "1 1/2 pounds/675 grams strawberries", "Lightly sweetened whipped cream, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Position a rack in the center of the oven and heat to 325 degrees. Grease and flour a 9-x-5-x-3-inch loaf pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind the pistachios in a food processor just until they resemble coarse meal. Be careful to not grind them into pistachio butter. Add the flour, baking powder and salt, and pulse until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, or in a large bowl with an electric mixer, beat the butter on medium-high speed until smooth, then, with the mixer still running, slowly stream in the sugar. Cream the butter and sugar together until very light and fluffy, about 5 minutes. Add the eggs one at a time, beating for 30 seconds after each addition. Occasionally stop the mixer and scrape down the sides of the bowl to ensure even mixing. Add the vanilla and almond extracts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low speed, add half the flour mixture, then the milk, and finally the remaining flour mixture, mixing until just combined. Finish mixing the batter by hand with a rubber spatula. Make sure to scrape the bottom and sides of the bowl to ensure even mixing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into the prepared pan, smooth the top, and bake until cake is golden brown and a toothpick inserted into the center comes out clean, 55 to 65 minutes. Cool 15 minutes in the pan, then remove the cake to a rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the strawberries: Combine sugar, lavender and vanilla seeds in a mortar and grind with a pestle until the lavender is broken up into fine bits and the sugar is fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hull the strawberries and slice in half if they are small, or in quarters if they are larger. Combine the sliced berries and sugar mixture in a bowl and stir gently. Let macerate for at least 15 minutes at room temperature before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, slice the cooled cake into thick pieces and top each slice with a generous spoonful of berries and their juices. Top with whipped cream. Extra cake keeps in an airtight container at room temperature for 3 days."}]}