{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli Rabe, Shakshuka Style", "description": "North African shakshuka, eggs baked on a vegetable stew, is popular throughout the Middle East and has become a brunch staple in New York. Traditionally, it’s a tomato-based mixture, reflecting the Mediterranean market. But there are no rules. Here’s an earthy green version made with broccoli rabe, potatoes and peppers. Tomato sauce alongside would not be a mistake, nor would slices of garlic sausage tucked throughout.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/08/24/dining/24PAIR-web/24PAIR-web-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, one pot", "keywords": "bell pepper, broccoli rabe, eggs, jalapeño, parmigiano-reggiano, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 304}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 253, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "5 grams", "proteinContent": "14 grams", "saturatedFatContent": "4 grams", "sodiumContent": "754 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "1 cup onion, in 1/2-inch dice", "2 medium-size green bell peppers, cored and seeded, in 1/2-inch dice", "2 medium-size jalapeño chiles, seeded and chopped fine", "3 cloves garlic, slivered", "12 ounces Yukon Gold potatoes, peeled, in 1/2-inch dice", "Salt and ground black pepper", "1 tablespoon fresh thyme leaves", "1 1/2 cups chicken or vegetable broth", "1 bunch broccoli rabe, heavy stems removed, finely chopped", "1/2 teaspoon crushed red chile flakes or to taste", "4 to 6 large eggs", "4 to 6 tablespoons grated Parmigiano-Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a heavy 12- to 14-inch skillet; cast iron is best. Add onions, bell peppers and jalapeños and sauté on medium about 10 minutes until vegetables are tender and starting to color. Stir in garlic, cook for a minute or two, then stir in potatoes. Reduce heat a bit and sauté another 5 minutes, stirring occasionally. Season with salt and pepper and add thyme."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add broth and cook on medium-low until much of it has evaporated and potatoes are tender, about 15 minutes. Add broccoli rabe. Cook, stirring occasionally until broccoli rabe has wilted, softened and reduced. Fold in chile flakes and season with more salt and pepper if needed. Turn off heat. Smooth top of vegetables and use the back of a soup spoon to make 4 or 6 evenly spaced shallow depressions in the mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light broiler and adjust a rack fairly close to the heat. Just before serving, break an egg into each of the depressions in the vegetables. Place skillet under the broiler until whites are set and yolks are still runny (they’ll wiggle if gently touched), 1 1/2 to 2 minutes. Dust each egg with cheese and serve."}]}