{"@context": "http://schema.org", "@type": "Recipe", "name": "Dandelion Salad With Beets, Bacon and Goat Cheese Toasts", "description": "Tender dandelion leaves make a sensational salad. This one is modeled after a classic Paris bistro salad, but the vinaigrette has fresh ginger and lime juice to stand up to dandelions' faintly bitter flavor. It still tastes very French, as do the goat cheese toasts.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2016/05/18/dining/18KITCH1-WEB/18KITCH1-WEB-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "appetizer, main course, side dish, bacon, beets, dandelion greens, goat cheese, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 387, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "10 grams", "sodiumContent": "544 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 garlic cloves, smashed to a paste with a little salt", "2 teaspoons grated ginger", "2 tablespoons lime juice", "1 tablespoon sherry vinegar", "2 tablespoons Dijon mustard", "Salt and ground black pepper", "4 tablespoons extra-virgin olive oil,  more for goat cheese toasts", "6 medium beets, cooked and peeled (see note)", "6 ounces bacon, cut into 1/4-inch-thick lardons", "6 baguette slices", "6 ounces fresh goat cheese, cut into 1/2-inch rounds", "6 ounces dandelion greens, trimmed, washed and dried", "3 8-minute hard-cooked eggs, peeled, quartered and lightly seasoned"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: In a small bowl, whisk together garlic, ginger, lime juice, sherry vinegar and mustard. Season with salt and pepper, then whisk in olive oil.  Taste and adjust seasoning. Heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the beets into ¾-inch wedges. Put them in a bowl and season with salt and pepper. Dress with 2 tablespoons of the vinaigrette and toss to coat well.  Set aside for at least 10 minutes at room temperature, or refrigerate for up to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a skillet over medium-high heat.  Add the lardons and let them begin to brown and sizzle, then reduce heat and cook gently, stirring occasionally, for 5 minutes or so, until lardons are barely crisp and lightly browned. Remove lardons from pan with a slotted spoon and keep warm.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Paint baguette slices lightly on both sides with olive oil and top each with a slice of goat cheese. Bake  for 10 minutes or so until bread is toasted and cheese has softened slightly. Put dandelion greens in a large shallow  bowl. Season lightly with salt and pepper and toss gently to coat.  Add up to 3 tablespoons of vinaigrette and toss to coat leaves well.  Divide dressed leaves among 6 plates.  "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish each plate with beets, bacon, hard-cooked eggs and goat cheese toast. Alternatively, serve family style with garnishes scattered over the top of the salad.      "}]}