{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Flank Steak (Matambre)", "description": "Matambre is a contraction of the Spanish words for \"kill\" and \"hunger\" -- it's the hunger killer. It's beef traditionally stuffed with vegetables, herbs, hard-cooked egg and seasonings. I cannot abide hard-boiled egg in cooked meat dishes, so I've substituted olives. It is often served as a kind of cold cut in Argentina, where it was created, but it can also be served hot.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2008/10/01/dining/matambre/matambre-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "At least 6 servings", "recipeCuisine": "latin american", "recipeCategory": "steaks and chops", "keywords": "carrot, flank steak, green olives, watercress, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 30}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 259, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "23 grams", "saturatedFatContent": "5 grams", "sodiumContent": "417 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 flank steak, 1 1/4 to 1 1/2 pounds", "Salt and pepper", "1 tablespoon fresh marjoram or oregano, or 1 teaspoon dried", "1 teaspoon ground cumin", "1 tablespoon minced fresh garlic", "1/2 bunch each chopped fresh parsley and cilantro leaves, or all of one or the other", "6 or 8 thin carrot sticks (1 medium carrot)", "1 cup pitted green olives", "1 medium red onion, sliced", "1 bunch watercress, trimmed", "2 tablespoons olive oil."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Use a boning knife to butterfly flank steak: Working across the grain, make a cut down the center, but only halfway through meat. At the top of that cut, make perpendicular cuts, one in each direction, this time with the grain. Again, cut only halfway into steak. Repeat perpendicular cuts at the other end of the center cut. Cuts should resemble the letter H."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the top of the original center cut, hold the knife parallel to the meat and insert knife. Slice toward you, making a pocket. This cut should almost reach the outer edge, halfway through the meat’s thickness. Repeat on other side. Open the flaps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season meat liberally on both sides with salt and pepper, then place it cut side up, wide side facing you. Season with marjoram, cumin and garlic and cover it with a fairly even layer of parsley-cilantro mix. Then arrange carrots, olives and onions horizontally over the full width of the meat. Scatter a relatively even layer of watercress over all."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll meat up from the bottom like a jellyroll; grain of steak should run length of roll. Tie in three or four places with butcher’s twine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a Dutch oven or roasting pan large enough to accommodate rolled steak. Deeply brown it on all sides, about 15 minutes total, then transfer pan to oven and roast for about 30 minutes, until meat is cooked through. Transfer to a cutting board and let rest for 30 minutes before serving. Or, put meat in a clean baking dish, weight it with a plate with something heavy on it and chill overnight. Take matambre from refrigerator and slice it into 1/2-inch to 1-inch pieces about an hour before serving at room temperature."}]}