{"@context": "http://schema.org", "@type": "Recipe", "name": "Pissaladière", "description": "Sweet, caramelized onions, briny anchovies and olives make the up the topping for this traditional Provençal tart. This version calls for a yeasted dough, which makes the tart somewhat like a pizza. But puff pastry, which Julia Child preferred, is also traditional, and quite a bit richer. If you’d rather use that, substitute a 12- to 16-ounce package for the yeast dough, and bake the tart at 375 degrees until the bottom and sides are golden brown, about 20 to 25 minutes. Pissaladière makes great picnic fare, in addition to being a terrific appetizer or lunch dish. This recipe is part of <a href=\"https://cooking.nytimes.com/new-essentials-french-cooking\">The New Essentials of French Cooking</a>, a guide to definitive dishes every modern cook should master. <a href=\"https://store.nytimes.com/products/new-essentials-of-french-cooking\">Buy the book.</a>", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/01/15/dining/DINING-ONIONTARTS-1/DINING-ONIONTARTS-1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, pies and tarts", "keywords": "anchovy, garlic, olives, onion, appetizer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 121}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 313, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "574 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["18 anchovy fillets, or to taste", "1/4 cup olive oil", "3 pounds/about 1.4 kilograms onions, thinly sliced", "1 clove garlic, grated on a Microplane or minced", "1 teaspoon thyme leaves, chopped", "1/2 teaspoon fine sea salt", "1/4 cup Niçoise olives, pitted or not, or to taste", "1 1/2 teaspoons active dry yeast", "2/3 cup warm water", "3 tablespoons olive oil", "2 cups/250 grams all-purpose flour", "1 1/2 teaspoons fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Finely chop 2 of the anchovy fillets. Heat oil in a large skillet over medium heat. Add onions, garlic, thyme and chopped anchovy, then cover pan and cook, stirring occasionally, for 20 minutes. Reduce heat to medium-low, stir in salt, and continue cooking for 25 minutes, stirring occasionally. The onions should be pale golden and very soft; lower the heat if they start to turn dark brown at the edges or stick to the skillet. Use your judgment on timing: Look to the color of the onions to tell you when they’re done. Remove from heat and cool completely before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the dough: In a medium bowl, sprinkle dry yeast over warm water. Let stand until foamy, about 5 minutes, then add oil. In a large bowl, whisk together flour and salt, then stir in yeast mixture with a wooden spoon until combined. Turn bowl's contents out onto a floured surface and knead until uniform and elastic, 3 to 5 minutes. (Flour your hands if necessary to keep dough from sticking.) Transfer dough to an oiled bowl, flip the dough over, cover bowl with a damp cloth and let rest in a draft-free place for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil an 11x17-inch rimmed baking sheet. Working on a floured surface, roll dough into an 11x16-inch rectangle, then transfer it to the oiled baking sheet and press the dough to the sides. Cover with a damp cloth and let rest for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Spread cooked onions evenly over dough, and top with remaining anchovies and olives. Bake until edges and underside are golden brown, 20 to 25 minutes. Serve warm or at room temperature."}]}