{"@context": "http://schema.org", "@type": "Recipe", "name": "Teff Carrot Cake", "description": "This deeply spiced carrot cake is studded with toasted walnuts and coconut, and sandwiched with a tangy mix of cream cheese and butter. It's also gluten-free, and festive enough to prepare for a special occasion. The cake comes from the San Francisco pastry chef Elisabeth Prueitt, whose interest in baking with alternative flours has led to many exceptional wheat-free creations. Made with teff flour and sweetened with a mix of coconut sugar and granulated sugar, it results in a tender, moist crumb and irresistible texture.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/11/09/dining/09TARTINE8/09TARTINE8-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "applesauce, carrot, coconut, cream cheese, sweet rice flour, teff flour, walnut, dessert, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 149}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 932, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "104 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "34 grams", "sodiumContent": "617 milligrams", "sugarContent": "75 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Unsalted butter, for greasing pans", "1 cup/200 grams granulated sugar", "1 cup/140 grams coconut sugar", "3 large eggs", "1/2 cup/125 grams applesauce", "1 pound/455 grams carrots, peeled and grated", "1 cup/236 milliliters coconut oil, warmed to liquid", "Juice of 1 lemon", "1 1/4 cups/170 grams teff flour", "1/2 cup/70 grams sweet rice flour", "1/2 cup/60 grams oat flour", "2 1/4 teaspoons cinnamon", "1/2 teaspoon ground nutmeg", "1/4 teaspoon ground cloves", "2 teaspoons baking soda", "3/4 teaspoon fine sea salt", "1/2 cup/45 grams unsweetened shredded coconut", "1 1/2 cups/180 grams toasted walnuts, chopped", "8 ounces/225 grams/1 cup cream cheese, at room temperature", "6 tablespoons/85 grams unsalted butter, at cool room temperature", "3 cups/360 grams confectioners’ sugar, sifted", "Juice of 1 lemon", "1/4 teaspoon fine sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Heat oven to 350 degrees. Use butter to grease two 9-inch cake pans, line each with a round of parchment paper, and grease paper as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using electric beaters or a stand mixer fitted with the whisk attachment, whip granulated sugar, coconut sugar and eggs until thick and light in color, about 4 minutes on medium speed. When you lift up the whisk, the beaten egg mixture should fall back into the bowl in a ribbon. Add applesauce, carrots, coconut oil and lemon juice, and mix well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk together teff flour, sweet rice flour, oat flour, cinnamon, nutmeg, cloves, baking soda and salt. Add to egg mixture, using a rubber spatula to fold just until combined. Gently fold coconut and walnuts into batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter evenly between the prepared pans. Bake until a toothpick inserted in the center comes out clean, 35 to 40 minutes. Let cool in the pans on a wire rack for about 10 minutes, then run a knife around the edges of each pan and invert cakes onto a wire rack. Let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting: In a stand mixer fitted with a paddle attachment, beat cream cheese and butter on medium-high speed until fluffy and light, about 3 minutes. Add confectioners’ sugar, lemon juice and salt and mix until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one cooled cake on a serving platter. Spread about half the frosting evenly across the cake, place the second cake layer on top and spread the remaining frosting. Decorate with clean, seasonal flowers, or leave plain and smooth with a palette knife. Cut into slices and serve."}]}