{"@context": "http://schema.org", "@type": "Recipe", "name": "Bigos", "description": "Bigos is usually translated as “hunter’s stew” and is sometimes referred to as the national dish of Poland. This version, adapted from Monika Woods, is rich with meat but heightened with caraway balanced by the tartness of sauerkraut, tomato and sweet fresh cabbage. Woods's mother makes it with the ends and scraps of meat saved and frozen over months’ worth of meals, so feel free to experiment with different cuts. Smoky kielbasa is the only necessary constant.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2016/03/06/magazine/06eat/06eat-articleLarge-v3.jpg", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "beef short ribs, cabbage, carrot, kielbasa, pork shoulder, sauerkraut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 76}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 461, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "7 grams", "proteinContent": "30 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1011 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound beef short-rib meat, boneless (see note), cut into 1 1/2-inch chunks", "Salt and pepper, to taste", "Vegetable oil, as needed", "1 pound boneless pork shoulder, cut into 1-inch chunks", "3/4 pound smoked kielbasa, cut into 1/2-inch coins", "4 cloves garlic, finely chopped", "1 1/2 tablespoons whole caraway seed", "1 teaspoon ground allspice", "1 large onion, sliced 1/4-inch thin", "3 medium carrots, grated", "32 ounces canned diced tomatoes, with juice", "1 pound cabbage, sliced 1/4-inch thin", "1 pound sauerkraut", "3 bay leaves", "Rye bread, for serving."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the beef very dry with paper towel. Season it with salt and pepper. Over medium-high heat, slick a large, heavy pot with oil. When the oil shimmers, sear the beef in one layer until golden brown, about 2 minutes per side. Remove to a large bowl. Pour off the fat from the pot, add 1/4 cup water and stir to dissolve the browned bits. Pour these juices into the seared meat. Rinse and wipe out the pot, and repeat this process with the pork shoulder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the clean pot over medium heat with a slick of oil. While it heats, add the kielbasa in 1 layer. Brown it until deep golden, about 2 minutes per side. Remove the kielbasa to the seared-meat bowl, but keep the fat in the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic and cook, stirring, until fragrant, then add the caraway seed and allspice, and stir for 20 seconds or until very fragrant. Add the onion and a few pinches of salt. Stir to pick up any browned bits; if the bottom of the pot looks dry, add a few splashes of water. Cook the onions, stirring frequently, until soft, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the carrots, tomatoes, seared meat and juices, and raise the heat to high. When it boils, add the cabbage and sauerkraut. Cook, stirring, until the cabbage is wilted and has released its juices. The liquid should nearly submerge the solids; add water if needed. Bring the pot to a simmer, add the bay leaves, then turn heat down to low to maintain a barely bubbling simmer, and cover the pot, leaving the lid slightly ajar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer the stew for 2 to 6 hours. At 2 hours, the meat should be tender and the flavor of the <em>bigos</em> will be bright and acidic. At 4 hours, the meat and cabbage will be very tender, with a balanced flavor. (This is my preference.) At 6 hours, which is more traditional, the meat will be falling apart into the cabbage. Adjust seasoning with salt or pepper to taste, and serve with rye bread."}]}