{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Wilted Greens, Bacon and Fried Egg", "description": "The success of this delectably simple weeknight pasta relies on two things: the quality of the bacon, and the sheer amount of freshly ground pepper. The bacon must have ample fat to render out (this is where the sauciness comes from) as well as a hearty, smoky flavor. As for the black pepper, more is more; getting enough of that subtle, floral spiciness will require more than a few turns from the grinder. And yes, there's an egg on top.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/01/17/dining/pasta-with-bacon-and-wilted-greens/pasta-with-bacon-and-wilted-greens-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pastas", "keywords": "bacon, kale, rigatoni, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 349}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 663, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "3 grams", "proteinContent": "28 grams", "saturatedFatContent": "11 grams", "sodiumContent": "551 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces rigatoni or mezzi rigatoni", "Kosher salt", "8 ounces high-quality bacon, coarsely chopped", "4 large eggs", "Freshly ground black pepper", "4 large garlic cloves, thinly sliced", "1 bunch kale or collard greens, thick stems removed, leaves torn into 1 1/2-inch pieces", "1/4 cup finely grated pecorino or Parmesan cheese, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook pasta in a large pot of salted boiling water until it's just al dente. (It should still have quite a bite to it; you’ll finish cooking it in the skillet.) Drain, reserving 1 cup pasta water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the bacon in a large skillet over medium heat until it has rendered all its fat and the pieces are crispy, 5 to 7 minutes. Using a slotted spoon, transfer bacon to a paper towel-lined plate or bowl, leaving the fat behind in the skillet; set bacon aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet with the bacon fat to medium-high heat. Crack the eggs into the skillet and season with salt and pepper. Fry the eggs, using a spoon to encourage the bacon fat to come up around the whites and cause them to puff slightly. Cook the eggs until the whites are just set and crisped around the edges and the yolk is still bright yellow and runny, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, transfer eggs to another paper towel-lined plate, leaving the bacon fat behind; set eggs aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet with the bacon fat to medium heat and add the garlic. Cook, stirring occasionally, until it's softened and lightly browned, about 2 minutes. Add kale by the handful, letting it wilt between additions, and season with salt and pepper. Cook until the kale is totally wilted and softened, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pasta and 1/2 cup pasta water to the skillet, using a wooden spoon to scrape up any browned bits on the bottom. Season with salt and plenty of fresh ground pepper. Continue to cook at medium heat, tossing the pasta occasionally, until the sauce has thickened and reduced by about half, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 1/2 cup pasta water and continue to cook, tossing to encourage the starches to release, until you’ve got a thick, glossy sauce, about 2 to 3 minutes. (The pasta should also be completely tender at this point.) Add 1/4 cup grated cheese and more freshly ground pepper; toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta among bowls and crumble crispy bacon over. Top with additional cheese and a fried egg. Make sure to break the yolk before eating."}]}