{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Custard Ice Cream Base", "description": "Rich, creamy and deeply satisfying, there is nothing better than a classic custard ice cream. Sometimes called French-style, this base incorporates eggs, which improve the texture and help prevent ice crystals from forming. This recipe for ice cream base may be churned on its own, but it is meant to have flavors added. See  <a href=\"http://www.nytimes.com/interactive/2014/07/01/dining/the-master-ice-cream-recipe.html\">the chart here</a> for flavor options and directions for incorporating them into the base recipe.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/06/13/dining/00Icecream29/00Icecream29-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "1 1/2 quarts", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, egg yolks, heavy cream, milk, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 92}, "recipeIngredient": ["2 cups heavy cream", "1 cup whole milk", "⅔ cup sugar", "⅛ teaspoon fine sea salt", "6 large egg yolks", "Your choice of flavoring <a href=\"http://www.nytimes.com/interactive/2014/07/01/dining/the-master-ice-cream-recipe.html\">(see chart)</a>"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot, simmer heavy cream, milk, sugar and salt until sugar completely dissolves, about 5 minutes. Remove pot from heat. In a separate bowl, whisk yolks. Stirring constantly, slowly whisk about a third of the hot cream into the yolks, then whisk the yolk mixture back into the pot with the cream. Return pot to medium-low heat and gently cook until mixture is thick enough to coat the back of a spoon (about 170 degrees on an instant-read thermometer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain through a fine-mesh sieve into a bowl. Cool mixture to room temperature. Cover and chill at least 4 hours or overnight. Churn in an ice cream machine according to manufacturers’ instructions. Serve directly from the machine for soft serve, or store in freezer until needed."}]}