{"@context": "http://schema.org", "@type": "Recipe", "name": "Neapolitan Easter Bread (Casatiello)", "description": "This recipe is steeped in Neapolitan tradition: It’s made the day after the big Easter feast, as a way to use up leftover cheese and meat. An Easter Monday picnic is also a custom, so the fact that all the goodies are already wrapped up in the bread makes it a very transportable option. The herby pesto and Gruyère, though, are my own nontraditional additions. This can be baked and presented in various ways, but the ring both looks great and has some nice symbolism — the circle of life and renewal associated with spring in general and Easter in particular. A very large (10-inch, or 24-centimeter) tube pan with a flat bottom is perfect, but you can improvise with a cake pan, creating a hole in the middle with an overturned bowl or ball of aluminum foil placed in the middle of the pan.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/04/05/dining/05BAKING1/05BAKING1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "lunch, breads", "keywords": "basil, gruyère, parmesan, parsley, salami, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 84}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 255, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "14 grams", "saturatedFatContent": "7 grams", "sodiumContent": "565 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/3 cup/70 milliliters extra-virgin olive oil, more as needed", "3 tablespoons/45 grams fine semolina flour", "1 lightly packed cup/15 grams basil leaves", "1 lightly packed cup/15 grams parsley leaves", "1/2 teaspoon kosher salt, more for seasoning", "4 cups/500 grams bread flour (strong flour), more for dusting", "3 teaspoons/10 grams instant yeast (fast-action dried yeast)", "1 1/2 cups/360 milliliters lukewarm water", "1 salami log (6 ounces/160 grams), rind removed and cut into 1/4-inch/1/2-centimeter cubes (1 heaping cup)", "4 1/2 ounces/130 grams Gruyère, cut into 1/4-inch/1/2-centimeter cubes (1 cup)", "2 ounces/70 grams Parmesan, coarsely grated (1 lightly packed cup)", "2 large eggs, hard-boiled, peeled and coarsely grated", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 10-inch or 24-centimeter tube pan with a flat bottom with 1 1/2 teaspoons oil. Sprinkle with 2 tablespoons/30 grams semolina, tapping out any extra once the interior is fully coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine herbs, 2 tablespoons oil and a good pinch of salt in the bowl of a food processor. Blitz to form a paste, scraping down sides as necessary, and then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine flour, yeast, 1 tablespoon oil, 1/2 teaspoon salt and the lukewarm water. Use a spatula to stir mixture until combined and turn out onto a floured work surface. Dust your hands with flour, then knead dough for 5 minutes, until it is smooth and elastic. You may need to add more flour if dough is too sticky, but do not add too much or it will become dry. Shape dough into a ball and set aside. Scrape down, clean and dry work surface, then dust with more flour. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll dough into a 12-by-16-inch/30-by-40-centimeter rectangle, with the longest side toward you. Spread evenly with herb paste, leaving a 1 1/2-inch/4-centimeter border at the top and bottom, and a 1/2-inch/1-centimeter border on the sides. Scatter salami, Gruyère, Parmesan and egg evenly over herb paste. Grind pepper generously over the surface and then gently push the cheese, egg and meat into the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting from the longest side, roll dough into a log (as you would a Swiss roll or the dough for cinnamon rolls), making sure to tuck dough in at the ends as you go so contents don’t fall out. Press edges to seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to pan, with the long sealed side facing down. The stuffed dough will be heavy, so make sure you have a good grip on both ends before you lift it. Use your hands to bring the ends together, pinching them into place so they form a continuous ring of dough. (It may be easier to shape it into a ring on the counter first and then transfer it to pan.) Using a pastry brush, coat dough with remaining oil and then sprinkle evenly with 1 tablespoon/15 grams semolina. Cover with a slightly damp cloth and let rest for 45 minutes to 1 hour, or until nearly doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oven to 450 degrees Fahrenheit/230 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake bread for 30 minutes, until golden and crisp; it will seem very hard but will soften once it cools. Remove from oven and set aside for 15 minutes to cool slightly. Turn bread out of pan onto a wooden board. (You may need to run a knife along edges of pan to release the bread.) Serve warm or cold."}]}