{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Brussels Sprouts", "description": "This is sort of a no-recipe recipe for brussels sprouts that will have you wanting to make them every day of the week. Once you memorize the proportions, you can vary the fat and seasonings any which way you like. One important tip: Having a large enough skillet is key, so the sprouts have a chance to brown on one side before steaming and turning to mush.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2016/11/09/dining/09BRUSSELS-GUIDE27/09BRUSSELS-GUIDE27-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday, vegetables", "keywords": "side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 250}, "recipeIngredient": ["1 pound brussels sprouts, trimmed and halved", "3 to 4 tablespoons fat (olive oil, schmaltz, duck fat or the fat rendered from 8 ounces of bacon, sausage or chorizo)", "A handful of aromatics, like chopped garlic, sliced onion, thyme sprigs or dried chiles", "Lemon juice, vinegar, pickled onions or shallots", "Salt and pepper to taste", "Chopped fresh herbs like parsley, cilantro or mint (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using something like bacon or sausage, start by browning the meat in a large skillet (10 to 12 inches) over medium-high heat to render the fat. Once the meat is cooked, remove it with a slotted spoon, leaving behind the drippings. (You can add the crispy meat bits back later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add halved brussels sprouts to the fat, shaking the skillet so that as many as possible land cut side down. Now, don’t touch! Disturbing the skillet at this point would prevent the sprouts from caramelizing. Cook until they have a nice sear on one side, 5 to 8 minutes. Using a wooden spoon or spatula, give them a stir and continue to cook until they’re nicely browned all over and just tender on the inside, another 5 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before removing from the heat, add in a handful of aromatics, like chopped garlic, sliced onion, thyme sprigs or dried chiles, tossing to coat and cooking only a minute or two. Stir in the reserved bacon or sausage bits, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish with either a squeeze of halved lemon, a splash of nice vinegar or a handful of pickled onions or shallots. Because of the sprouts’ meaty flavor profile, it’s also nice to hit them with a smattering of fresh herbs, especially parsley, cilantro or mint. Salt and pepper to taste."}]}