{"@context": "http://schema.org", "@type": "Recipe", "name": "Bouillabaisse With Orange Zest, Fennel and Saffron", "description": "This Mediterranean fish stew is more difficult to spell than to prepare, and it is traditionally neither an idée fixe nor the centerpiece of a grande bouffe, but a spur-of-the-moment combination of the day's catch. Trying to duplicate the real bouillabaisse is an exercise in frustration, as the traditional combination of fish is not found in American waters. But creating an admirable local version is no more difficult than making clam chowder. Though some will argue that bouillabaisse must contain fish stock, any time you add a few pounds of fish to a simmering stew there is enough fish essence to make stock superfluous. If additional liquid is needed, water will do just fine.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, seafood, soups and stews", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 382, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "61 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1593 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon olive oil ", "2 medium onions, roughly chopped ", "Zest of 2 navel or other oranges ", "2 teaspoons fennel seeds ", "Big pinch saffron, optional ", "1 dried chile, or cayenne to taste ", "1 28-ounce can of tomatoes, including juice ", "1 to 1 1/2 pounds monkfish, catfish, or blackfish, cut into 1-inch cubes ", "3 pounds hard-shell (littleneck) clams, cockles or mussels, well washed ", "1 to 1 1/2 pounds shrimp or scallops, cut into bite-size pieces if necessary ", "1 to 1 1/2 pounds cod or other delicate white-fleshed fish, cut into 6 large chunks ", "1 tablespoon minced garlic ", "1 cup roughly chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put olive oil in a casserole or large saucepan over medium heat. Add onions and cook, stirring occasionally, until softened, about 5 minutes. Add zest, fennel, saffron and chili, and cook for about a minute. Add tomatoes, and turn heat to medium-high. When mixture boils, reduce heat to medium, and cook 10 to 15 minutes, stirring occasionally, until it becomes sauce-like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add monkfish and raise heat to medium-high. When mixture boils, reduce heat to medium-low and cook, stirring occasionally, until the monkfish begins to lose its rubbery quality, 10 minutes or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add clams, raise heat to high, and stir; when mixture boils, reduce heat to low, cover, and cook until clams begin to open, 5 to 10 minutes. Add shrimp and white fish, stir, and cover. Cook, stirring gently once or twice, until white fish is just about done (a thin-bladed knife will pierce it with little resistance), about 5 minutes. (If mixture is very thick, add a cup or so of hot water.) Stir in garlic, and cook 1 minute more. Stir in parsley and serve, with crusty bread."}]}