{"@context": "http://schema.org", "@type": "Recipe", "name": "Pecan Squares", "description": "A cousin to the pecan pie, but much less fussy: Pecan squares are a kitchen classic. Here, we've updated a version that came to us in 1998 from William Grimes, scaling it down and moving away from the original pâte brisée. The pecans are mixed in an addictive caramel sauce, which — if you can stop eating it on its own — is spread over shortbread and baked until just set. The end result is sweet, but not cloying, balanced by the crust and sure to please.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2017/07/21/dining/21COOKING-PECAN-SQUARES1/21COOKING-PECAN-SQUARES1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "24 squares", "recipeCuisine": "american", "recipeCategory": "cookies and bars", "keywords": "dessert, fall, heavy cream, honey, pecan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 247}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 405, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "12 grams", "sodiumContent": "164 milligrams", "sugarContent": "19 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 sticks/227 grams cold unsalted butter, cut into pieces, plus more at room temperature for the pan", "2 1/2 cups/320 grams all-purpose flour", "1/3 cup/67 grams granulated sugar", "1/2 teaspoon kosher salt", "1 large egg yolk, lightly beaten", "1 to 2 tablespoons ice water, if necessary", "2 sticks/227 grams unsalted butter", "1/2 cup/100 grams granulated sugar", "1 cup/200 grams light brown sugar", "1/4 cup/85 grams mild honey", "1 1/2 teaspoons kosher salt", "1/2 cup/120 milliliters heavy cream", "2 teaspoons vanilla extract", "4 cups (1 pound/454 grams) pecans, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter a 13x9-inch pan, and line with parchment, leaving a 2-inch overhang on the two long sides. Butter the parchment. In the bowl of a food processor, combine the flour, sugar and salt, and pulse to combine. Add the butter, and pulse until the mixture resembles coarse sand. Add the egg yolk and pulse to evenly distribute its moisture. The mixture should just hold together when you squeeze it in your hand. Add up to 2 tablespoons ice water, if necessary, but don’t let the mixture get too wet: It should still be somewhat sandy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tip the crumbs out into the prepared pan. Use your fingers or the flat bottom of a measuring cup to press the crumbs up the sides about 1/4 inch to create a border. Press the remaining crumbs down to an even thickness. Bake the crust until light golden brown and set, about 40 minutes. Transfer the pan to a rack while assembling the topping. Reduce the oven temperature to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium, heavy-bottomed saucepan, combine the butter, granulated sugar, brown sugar, honey and salt and bring to a strong simmer over medium heat, whisking ingredients together once the butter has melted. Cook the mixture, stirring frequently, for 4 minutes. Remove from the heat and stir in the heavy cream and vanilla extract. Stir in the nuts and combine well. Transfer the mixture to the prepared pan and spread it evenly, keeping it within the border as best as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the bars until the caramel is thickened and just set, about 20 to 25 minutes (the caramel will continue to firm up when cooled). Transfer the pan to a rack to cool completely. Using the parchment paper, transfer to a cutting board to cut into equal pieces to serve."}]}