{"@context": "http://schema.org", "@type": "Recipe", "name": "Cantonese-Style Turkey", "description": "In this vaguely Cantonese turkey, the bird is roasted beneath a rich glaze of fermented soybean paste, garlic, ginger, soy sauce and alliums galore, then served with roasted potatoes basted in the sauce and drippings of the bird. It came to The Times from Dr. Carolyn Ling, a physician in Carmel, Ind., whose grandfather came to the United States in the late 19th century from southern China and set up an import-export firm in Manhattan. There were other investments as well. Her grandfather, Dr. Ling told me, had “interests in restaurants.” Those interests played a big role in the Ling family’s early Thanksgiving feasts: They ate takeout. Dr. Ling’s father, a doctor who fought at Anzio in Italy in 1944 and earned a Bronze Star, loved those meals. When Dr. Ling was young, she said, her father urged her mother, a passionate home cook and reader of Gourmet, to emulate them in her holiday cooking at home in Forest Hills, Queens. The result is remarkably easy to prepare, phenomenally juicy, and rich, Dr. Ling said, “with the umami of soy and turkey fat.”", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2016/11/11/dining/COOKING-TURKEY1/COOKING-CHINESE1-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "8 to 12 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, poultry", "keywords": "main course, potato, soybean sauce, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 223}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 829, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "5 grams", "proteinContent": "96 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1934 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 12- to 14-pound turkey", "4 tablespoons neutral oil (such as canola)", "6 garlic cloves, minced", "1 3-inch knob ginger, peeled and minced", "6 scallions, thinly sliced", "2 leeks, thinly sliced (white and light green parts only)", "4 stalks celery, thinly sliced", "1/3 cup soybean sauce (preferably Lee Kum Kee brand)", "1 2-inch strip dried orange or tangerine peel (or use 1 tablespoon freshly squeezed orange juice)", "1 tablespoon light brown sugar", "1/2 cup rice wine or sherry", "1/2 teaspoon ground white pepper", "3 tablespoons low-sodium soy sauce", "2 tablespoons oyster sauce", "3 1/2 pounds small Yukon Gold potatoes, halved", "Kosher salt and black pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove turkey from refrigerator and pat dry with paper towels. Place on a rack in a roasting pan and allow turkey to come to room temperature while you prepare the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl 3 tablespoons oil into a wok or large Dutch oven and set over medium-high heat until it begins to shimmer. Add garlic and ginger and cook, stirring, until golden, about 3 minutes. Add scallions, leeks and celery and cook, stirring often, until vegetables soften and cook down, 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add soybean sauce, orange peel, sugar, rice wine or sherry, white pepper, soy sauce and oyster sauce to the vegetable mixture, along with 2 cups water. Turn heat to high and bring to a boil, then lower the heat and allow mixture to simmer and thicken, 30 minutes. Remove from heat and let cool 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Spoon 1 cup of the sauce over turkey and spoon 2 tablespoons into its cavity. Tuck the tips of the wings under the bird and truss its legs together with kitchen string. Pour remaining sauce and 2 cups water into roasting pan and transfer to oven. Roast turkey, uncovered, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce oven to 325 degrees. Baste turkey with pan juices, and tent it with foil. Continue roasting another 1 1/2 to 2 1/2 hours, basting every 30 minutes with pan juices, until a thermometer inserted into the thigh registers 165 degrees. If pan starts to look dry, add hot water or turkey or chicken stock, if you have any, 1 cup at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer turkey to a cutting board or platter and let rest at least 30 minutes before carving. Pour pan drippings into a small pot, adding enough warm water or stock to equal 1 cup, and keep warm on the stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven temperature to 450 degrees. Grease a large sheet pan with 1 tablespoon oil, and arrange halved potatoes on the pan, cut side down. Season with salt and black pepper, and slide potatoes into the oven. Cook, undisturbed, until potatoes are tender and cut sides are nicely browned and crisped, 30 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from the oven, drizzle reserved drippings all over potatoes, toss and return to the oven to finish cooking, 5 minutes longer. Serve potatoes with turkey."}]}