{"@context": "http://schema.org", "@type": "Recipe", "name": "World’s Best Chocolate Cake", "description": "The recipe for this cake, adapted from \"Sweet\" by Yotam Ottolenghi and Helen Goh, first appeared in an article written about Ms. Goh when she ran her cafe, the Mortar & Pestle, in Melbourne, Australia. Rather intimidatingly for her, the headline for the article was \"World’s Best Chocolate Cake.\" It could actually be called lots of things: “world’s easiest cake,” possibly, requiring nothing more than one large bowl to make it all in. Or “most versatile cake,” given that it can be served without icing and just a light dusting of cocoa powder, or dressed up to the nines, as it is here, with a thin layer of chocolate ganache and served with espresso cinnamon mascarpone cream. In the Ottolenghi shops in London, it is smaller and goes by the name Take-Home Chocolate Cake, designed to be shared by four people after a meal. This larger version is no less delicious, and keeps well for  four to five days. As with any baking project, you should weigh your ingredients in grams for the best results.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/09/20/dining/20BAKE6/20BAKE6-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "cocoa powder, dark chocolate, espresso, instant coffee, mascarpone, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 2489}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 914, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "67 grams", "fiberContent": "5 grams", "proteinContent": "10 grams", "saturatedFatContent": "40 grams", "sodiumContent": "565 milligrams", "sugarContent": "35 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup plus 1 1/2 tablespoons/250 grams unsalted butter (2 sticks plus 1 1/2 tablespoons), at room temperature and cut into 3/4-inch/2-centimeter cubes, plus extra for greasing the pan", "7 ounces/200 grams dark chocolate (70 percent cocoa solids), chopped into 3/4-inch/2-centimeter pieces", "1 1/2 teaspoons instant coffee granules, dissolved in 1 1/2 cups/350 milliliters boiling water", "1 1/4 cups/250 grams granulated sugar", "2 large eggs, lightly beaten", "2 teaspoons vanilla extract", "1 3/4 cups plus 2 tablespoons/240 grams self-rising flour (see note)", "1/3 cup/30 grams Dutch-processed cocoa powder, plus 1 1/2 teaspoons, for dusting", "1/4 teaspoon salt", "7 ounces/200 grams dark chocolate (70 percent cocoa solids), broken or chopped roughly into 3/4-inch/2-centimeter pieces", "3/4 cup/180 milliliters heavy cream", "1 tablespoon light corn syrup", "1 tablespoon unsalted butter, at room temperature", "1 1/2 cups plus 1 tablespoon/375 milliliters heavy cream", "3/4 cup/190 grams mascarpone", "Scraped seeds of 1/2 vanilla pod", "2 1/2 teaspoons finely ground espresso", "3/4 teaspoon ground cinnamon", "2 1/2 tablespoons confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees Fahrenheit/170 degrees Celsius. Grease a 9-inch/23-centimeter round springform pan with butter and line with parchment paper, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Place butter, chocolate and hot coffee in a large heatproof bowl and mix well until everything is melted, combined and smooth. Whisk in sugar by hand until dissolved. Add eggs and vanilla extract and whisk again until thoroughly combined and smooth. Sift flour, cocoa powder and salt together into a bowl and then whisk this into the melted chocolate mixture. The batter here is liquid, but don’t think you have missed something; this is how it should be."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into the prepared pan and bake for 1 hour, or until the cake is cooked and a skewer inserted into the center comes out clean or with just a few dry crumbs attached. The top will form a crust and crack a little, but don’t worry, this is expected. Leave the cake to cool for 20 minutes before removing from the pan, then set aside until completely cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chocolate ganache, if desired: Place chocolate pieces in a food processor, process until fine and set aside. Combine cream and corn syrup in a small pan and place over medium-high heat. As soon as bubbles begin to appear (just before it comes to a boil), remove from the heat. Get the food processor running again, with the chocolate still inside, and pour in the hot cream in a steady stream. Process for 10 seconds, then add butter. Continue to process until mixture is shiny and smooth. (You can also make the ganache by hand; just make sure the chocolate is chopped fairly finely before adding the cream mixture. Stir with a wooden spoon until almost melted, then add the butter. Stir again until the ganache is smooth.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a rubber spatula to scrape the ganache into a bowl and cover with plastic wrap, with the plastic actually touching the top of the ganache. Set aside until it has set to the consistency you want. If you want a thin layer to spread over the cake, it can be poured over while liquid so that you get an even, light and shiny coating. For a thicker ganache with a spreading consistency, leave it for about 2 hours at room temperature. (The ganache can be stored at room temperature, providing it’s not too warm, for 3 days or kept in the fridge for up to 2 weeks. It can also be frozen, although it will lose a bit of its shine when defrosted.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the espresso cinnamon mascarpone cream, if desired: Place all the ingredients in the bowl of an electric mixer fitted with the whisk attachment. Beat for 1 to 2 minutes, until soft peaks form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the parchment from the cake and discard. Transfer to a serving platter and spread the ganache, if using, on top of the cake. Slice into wedges, divide the cake among plates and, if using, spoon the mascarpone cream alongside. With or without icing, the cake will keep well for 4 to 5 days in an airtight container."}]}