{"@context": "http://schema.org", "@type": "Recipe", "name": "Slab-Bacon Tacos With Burned-Scallion Crema", "description": "This is candied bacon, essentially, on corn tortillas with a creamy, smoke-flecked sauce that tastes of scallion and lime. I like it with <a href=\"https://cooking.nytimes.com/recipes/1018989-pineapple-salsa\">pineapple salsa</a> as well, and a <a href=\"https://cooking.nytimes.com/recipes/1018988-cilantro-and-mint-salad\">salad of cilantro, mint and soft lettuce</a>. You could make it with your standard sliced bacon from the market, but it’s far superior with the thick-cut variety or, best of all, with a chunk of uncut bacon that you can slice as thick as you like.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2017/10/26/dining/26cooking-tacos/26cooking-tacos-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "tacos", "keywords": "corn tortillas, slab bacon, sour cream, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 156}, "recipeIngredient": ["2 tablespoons chile powder", "1 tablespoon ground cumin", "1 tablespoon brown sugar", "2 teaspoons freshly ground black pepper", "2 pounds slab bacon, cut into 1/4-inch slices", "1 bunch green scallions, trimmed and cut into large pieces", "1 jalapeño", "1 to 2 limes", "1 cup sour cream", "1/2 cup mayonnaise", "1 teaspoon kosher salt, or to taste", "Corn tortillas", "Lime wedges", "Pineapple salsa (<a href=\"https://cooking.nytimes.com/recipes/1018989-pineapple-salsa\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Mix the chile powder, ground cumin, brown sugar and black pepper together in a large bowl, and then add the bacon slices, tossing to coat them with the spice mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the coated bacon slices on a sheet pan, ideally one fitted with a wire rack. Roast in the oven until they are caramelized and starting to crisp at the edges, approximately 10 to 15 minutes. Remove pan from oven, chop the bacon into large dice and keep warm. Reserve the bacon fat for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the bacon cooks, make the <em>crema</em>. Put the scallions and jalapeño in a large dry sauté pan and cook over high heat, tossing occasionally, until the scallions and jalapeño have blackened at the edges, approximately 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the scallions and jalapeño in the bowl of a food processor, and blitz them with the juice of 1 lime, then add the sour cream and mayonnaise, and blitz the mixture until it is smooth and flecked with blackened bits. Season to taste with the salt and, if you’d like the mixture thinner, the juice of the second lime. Scrape into a bowl, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, warm the tortillas in the dry pan, one or two at a time, and reserve them in a tortilla warmer or clean dish towel. Fill them with the diced bacon and a slash of the <em>crema,</em> along with quartered limes and, if you like, salsa, cilantro, mint and hot sauce."}]}