{"@context": "http://schema.org", "@type": "Recipe", "name": "Cochinita Pibil", "description": "The traditional way to make Yucatecan cochinita pibil is to bury a pig in a steaming, smouldering, stone-lined pit and cook it slowly for many hours. The pork has first been marinated with a bright red paste of achiote seeds, garlic, spices and bitter orange juice, and then wrapped in banana leaves. This tender meat is pulled and served simply in its own juices with hot tortillas and pickled onion. Diana Kennedy’s no-fuss method for home cooks involves baking a small piece of pork in the oven for just a few hours, inside a heavy lidded pot, with a little water at the bottom.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2016/09/11/magazine/11eat1/11mag-11eat-t_CA0-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "Serves 4", "recipeCuisine": "mexican", "recipeCategory": "", "keywords": "achiote, banana leaf, pork shoulder, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 167}, "recipeIngredient": ["1 pork shoulder, 3-4 pounds", "4 tablespoons salt", "4-6 garlic cloves, peeled", "1 tablespoon cumin seeds", "1 tablespoon black peppercorns", "1 teaspoon whole allspice", "1 tablespoon red-chile powder", "1/2 teaspoon whole cloves", "1/2 teaspoon cinnamon powder", "1 tablespoon Mexican oregano", "4 tablespoons achiote-seed paste", "1 orange, zested and juiced", "1 grapefruit, zested and juiced", "1 lime, juiced", "2 banana leaves, wiped clean", "1/2 white onion, thinly sliced", "1 red onion, chopped", "1 teaspoon salt", "1 habanero, seeded and finely chopped", "Corn tortillas", "Lime, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Score the fat of the pork, evenly salt the meat and set it aside while you make the marinade. In a dry saucepan over medium heat, toast the garlic cloves until they’re charred all over, then remove. In the same pan, add cumin, peppercorns, allspice, red-chile powder, cloves and cinnamon. Toast until you can really smell the cumin and pepper. Grind spices, and mix in a food processor until smooth with the oregano, charred garlic, achiote paste, all the citrus zest and about half the juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place two overlapping banana leaves on your work surface, and put the pork at the center. Rub the spice paste all over the meat, arrange the sliced white onion on top and roll the whole thing up, folding the sides like wrapping paper. (If it unravels, tie it closed with some kitchen twine.) Set the parcel in the fridge for a few hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300. Put the parcel on a rack, or a ring of scrunched-up aluminum foil, inside a heavy pot with a half cup of water at the bottom. Bake with the lid on until the meat is very tender and yields easily to a fork, about 4 hours. Meanwhile, mix the chopped red onion with remaining citrus juices, salt and habanero, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the meat is still warm, carefully transfer the parcel to a serving dish. Use a fork to shred the meat, spoon over the cooking juices and mix well. Serve with pickled onions, warmed tortillas and halved limes."}]}