{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Kale, Coconut and Tomato Salad", "description": "This stylish recipe for a warm kale salad comes from Anna Jones, a British food stylist who worked for Jamie Oliver before striking out on her own. It appears in her 2015 cookbook, “A Modern Way to Eat,” a collection of recipes that anyone who spends as much time as I do snooping around home kitchens can tell you is shaping up as a kind of new-era “Silver Palate Cookbook.” (This salad could be Jones’s <a href=\"http://cooking.nytimes.com/recipes/8752-the-silver-palates-chicken-marbella\">chicken Marbella</a>.) It calls for oven-roasted tomatoes slicked with olive oil and fragrant with lime, as well as kale cooked soft in parts and crunchy in others, the pure mineral intensity of the greens bracketed by soy sauce and shavings of coconut. The dressing – ginger, miso, tahini, honey, olive oil, lime juice and chopped hot pepper – is a far thicker mixture than vinaigrette, one that lends itself better to drizzling over the bowl.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/01/17/dining/ss-warm-kale-salad/merlin_148333509_26952b3d-69be-4e08-90a1-c22259291d94-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "coconut, kale, miso paste, serrano pepper, tahini, tomato, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 579}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 254, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "7 grams", "proteinContent": "7 grams", "saturatedFatContent": "4 grams", "sodiumContent": "595 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["12 ounces cherry tomatoes, approximately 1 pint basket", "3 to 4 tablespoons extra-virgin olive oil", "Kosher salt and freshly cracked black pepper to taste", "2 to 3 limes, well scrubbed if waxed", "12 ounces green or purple kale, approximately 2 heads, lower stalks removed and leaves torn into pieces", "1/4 cup unsweetened dehydrated shaved coconut", "1 tablespoon soy sauce", "1 inch fresh ginger root, peeled and grated, approximately 1 tablespoon", "1 tablespoon white miso paste", "1 tablespoon tahini", "1 tablespoon honey", "1 red serrano or jalapeño pepper, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425. Rinse the tomatoes well, dry with paper towels and cut them in half, then place on a sheet pan. Dress with 1 to 2 tablespoons of olive oil, salt, pepper, the zest of 2 limes and the juice of 1 of them. Roast the tomatoes until just blistered and beginning to take on color, approximately 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, mix together the kale, coconut shavings and soy sauce, and place on another sheet pan. Roast these in the oven next to or below the tomatoes for approximately 5 to 10 minutes, or until the kale has begun to crisp at its edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing in a small bowl, combining the grated ginger root, the miso, the tahini, the honey, the pepper, the juice of the second lime and the remaining olive oil. Adjust seasonings to your liking – you may wish to increase the amount of lime juice with a third lime, to thin the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the tomatoes and kale into a large serving bowl, and drizzle the dressing over the top, a few tablespoons at a time; you may not need all the dressing if the tomatoes are particularly juicy. Serve warm."}]}