{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Poppy Muffins", "description": "From supermarket aisles to those backlight bakery cases in every diner across the country, lemon poppy-seed muffins are ubiquitous, and easy to love. Buttery and soft, tart and sweet, they are soothing in their simplicity, while seeds add just a bit of crunch. This version gets a healthy dose of lemony tang thanks to an ample amount of grated zest and a zippy lemon-juice glaze. It’s important to spring for fresh fruit here, as opposed to anything that comes in a plastic bottle. The bright flavor of real lemon goes a long way.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2016/12/20/dining/20COOKING-LEMONPOPPYSEEDMUFFIN2/20COOKING-LEMONPOPPYSEEDMUFFIN2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, quick breads", "keywords": "lemon, poppy seeds", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 463}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "6 grams", "sodiumContent": "199 milligrams", "sugarContent": "23 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon kosher salt", "3/4 cup granulated sugar", "1/2 cup unsalted butter (1 stick), melted and cooled slightly", "1/2 cup whole milk", "1/2 cup sour cream", "2 large eggs", "2 tablespoons freshly grated lemon zest (from 2 large lemons)", "2 tablespoons fresh lemon juice", "4 teaspoons poppy seeds", "1 cup confectioners’ sugar", "2 to 3 tablespoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a 12-cup standard muffin tin with paper liners."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour, baking powder, baking soda and salt. In a large bowl, whisk together sugar, butter, milk, sour cream, eggs, lemon zest and juice, and poppy seeds until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a large rubber spatula, fold the dry ingredients into the wet ingredients until combined. Do not overmix. Divide the batter evenly between the prepared cups and bake until puffed and set, and a toothpick inserted into the center of a muffin comes out clean, about 20 minutes. Transfer the muffins, in the tin, to a rack to cool for 5 minutes. Then remove the muffins and let cool completely on the rack before glazing. (Alternatively, if you'd like, glaze the muffins while they are still warm. The glaze will run more, giving you an all-over glazed look.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: Whisk together confectioners’ sugar and 2 tablespoons lemon juice until smooth. Add a little more lemon juice if necessary to make a thin but pourable glaze. Drizzle some of the glaze over each muffin. Let stand at room temperature until the glaze is set."}]}