{"@context": "http://schema.org", "@type": "Recipe", "name": "Swiss Chard and Lamb Torte With Fennel-Pomegranate Relish", "description": "Festive dishes in Israel and throughout the Middle East often include rice and lamb. This magnificent recipe, topped with a bright pomegranate and fennel relish, is the Israeli chef Erez Komarovsky's twist on an ancient, labor-intensive classic of individual stuffed chard, cabbage or grape leaves, symbolizing the plenty of the fall harvest. It is perfect for Rosh Hashana or any seasonal holiday gathering. Make it with blanched Swiss chard, grape leaves or even cabbage or kale as the outer crust, and assemble it a day in advance. Then bake it and revel in the heightened flavors from the cardamom, cinnamon, fennel and mint; the crunch of pistachio; and the slight kick you get from the Mexican Serrano pepper now planted in Israel.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2017/09/13/dining/13ROSHRECIPE/13ROSHRECIPE-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "jewish, middle eastern", "recipeCategory": "dinner, grains and rice, meat, project", "keywords": "fennel, lamb, mint, pomegranate, rice, Serrano chile pepper, swiss chard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 88}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 539, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "6 grams", "proteinContent": "15 grams", "saturatedFatContent": "7 grams", "sodiumContent": "808 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["2 1/3 cups medium-grain or sushi rice (1 pound)", "About 10 to 12 large green Swiss chard leaves (from 1 to 2 bunches)", "1/2 cup plus 1 tablespoon olive oil", "2 medium onions, finely chopped", "1 pound ground lamb", "3/4 cup roasted shelled pistachios", "1 tablespoon kosher or coarse sea salt", "2 1/4 teaspoons ground black pepper", "1 teaspoon cinnamon", "1 teaspoon ground cardamom", "1 tablespoon fennel seeds", "1/2 cup chopped mint leaves", "4 cups chicken stock", "2 fennel bulbs, roughly chopped (reserve fronds for decorating torte)", "1 Serrano chile pepper", "Juice of 2 freshly squeezed lemons (about 6 tablespoons)", "4 tablespoons pomegranate syrup", "2 cups pomegranate seeds", "Kosher or coarse sea salt, to taste", "1/3 cup extra-virgin olive oil", "1 cup fresh mint leaves, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the torte: Place rice in a heat-proof bowl. Bring 3 cups water to a boil, pour over rice, and let stand uncovered for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of water to a boil, and prepare an ice bath in a large bowl with ice cubes and cold water. Separate the bottom stems from the leaves of the Swiss chard, dicing the stems and setting aside. Blanch the leaves, in batches if necessary, by placing them in the boiling water for 20 seconds, then use tongs to transfer them to the ice bath. Drain the leaves and spread them out to dry in a single layer on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large pan over medium-high heat, add 1/4 cup olive oil and sauté onions and chopped chard stems, about 10 minutes, until soft and starting to brown. Remove from heat and set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the rice and pour it into a large bowl. Add lamb, sautéed onion and chard stalks, pistachios, salt, pepper, cinnamon, cardamom, fennel seeds, mint leaves and 1/4 cup olive oil and mix thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Take a round Dutch oven or other heavy 10-inch round pot with a lid and coat it with the remaining tablespoon of olive oil. Line the pot with a layer of the Swiss chard leaves, with the bottom ends of the leaves protruding from the pot. (Ideally you'd have at least a 3-inch overhang.) Place the rice-meat stuffing in the pot and fold the overhanging leaves over the top of the filling. If necessary, layer additional leaves on top to completely enclose the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken stock in a small pan over high heat; when it's hot, pour it over the torte. Cover the pot and transfer to oven. Let torte bake for 30 minutes, then lower the oven temperature to 275 degrees and continue cooking for about 1 hour more, or until rice is cooked and most of the liquid has been absorbed. (You can carefully peel away a leaf to check the rice, replacing it after you’ve tasted.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the relish: Using a food processor, pulse fennel bulbs and Serrano pepper until finely chopped, being careful not to overprocess. Turn fennel and chile mixture out into a medium bowl and add lemon juice, pomegranate syrup, pomegranate seeds and salt and mix to combine. Stir in olive oil and adjust salt to taste. Just before serving, mix in the mint leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When torte is done baking, remove it from the oven and let it sit for a few minutes, covered. Run a sharp knife around the edge of the torte; cover with a flat, round serving platter; and invert the pot to remove the torte. Serve decorated with fennel fronds and garnished with fennel, pomegranate and mint relish."}]}