{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggs Benedict", "description": "Decadence is what makes eggs Benedict a star of the brunch table. To get there, order and timing are key. First, you'll want to make your hollandaise. While intimidating in theory, the process is a lot like making mayonnaise. If the emulsion is stable, it won't break, even when held at room temperature. Next, poach your eggs, and toast the English muffins while you crisp up the Canadian bacon. From there, it's as simple as stacking your ingredients and sprinkling them with herbs, salt and pepper. Once you’ve mastered this basic version, you can explore its variations: Add sliced avocado, or even swap in some smoked salmon (eggs Hemingway) or wilted greens for the Canadian bacon (eggs Florentine).", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/ar-eggs-benedict/ar-eggs-benedict-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch", "keywords": "bacon, canadian bacon, chives, dill, eggs, ham, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 699}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 766, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "4 grams", "proteinContent": "30 grams", "saturatedFatContent": "32 grams", "sodiumContent": "996 milligrams", "sugarContent": "1 gram", "transFatContent": "2 grams"}, "recipeIngredient": ["3/4 cup (1 1/2 sticks) unsalted butter", "3 large egg yolks", "1 1/2 teaspoons fresh lemon juice, plus more to taste", "1/4 teaspoon cayenne or hot paprika, plus more to taste", "Kosher salt and freshly ground pepper", "1 tablespoon white distilled vinegar", "Kosher salt", "8 large eggs", "4 English muffins, split", "8 slices Canadian bacon or thick-cut ham (or 8 slices regular, thick-cut bacon)", "2 tablespoons unsalted butter", "1/4 cup chopped chives", "2 tablespoons chopped dill, tarragon or parsley", "Flaky sea salt", "Coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the hollandaise: Melt butter in a small pot over medium heat until it’s foamy but not yet beginning to brown, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place egg yolks and 2 teaspoons water in a blender. Start blending, and, working very slowly, add the hot, melted butter until it’s all incorporated. (If it starts to get too thick to blend, add 1/2 teaspoon of water.) Add lemon juice and cayenne, though feel free to adjust the amounts to taste, and season with salt and pepper. Transfer the hollandaise to a small bowl, and place plastic wrap directly on the surface so it doesn’t form a skin. Set aside. (It will keep at room temperature while you work.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach the eggs: Fill a medium pot with 3 inches of water. Add vinegar, season with salt and bring to a simmer. (Look for just a few bubbles; it should never boil.) Using the handle of a spoon or spatula, stir the water with a clockwise motion. Gently crack an egg into the center of the pot, letting the water swirl around it and allowing the white to envelop the yolk. Repeat with remaining eggs — you could probably do up to four at a time. Check the eggs after 4 minutes: Use a slotted spoon to lift an egg out of the water, and feel the white for firmness. If it's not quite done, slide it back in for another minute or so. Let cook until the whites are just set, but the yolks are still completely runny, 4 to 5 minutes. Once eggs are perfectly poached, remove from the water, and let drain on a plate lined with paper towels or a clean kitchen towel. Set eggs aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a toaster, toaster oven or regular oven, toast the English muffins until crisp and golden brown. Don’t be afraid to toast them thoroughly: They'll be covered in hollandaise and poached eggs, and will need to be sturdy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook Canadian bacon or ham (or bacon) in a medium skillet over medium–high heat until golden brown and just crisp at the edges, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the Benedict: Place eight halves of English muffin on a plate and butter them generously. Top each with a slice of Canadian bacon, ham or bacon, then a poached egg. Spoon hollandaise sauce over and sprinkle with chives, dill, flaky sea salt and black pepper."}]}