{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Grapes With Caramelized Wine and Yogurt Ice Cream", "description": "In this recipe, grapes take on a floral, caramelized flavor from fresh thyme and honey. If your thyme is woody, discard the stems and just use the leaves. If you don’t have an ice cream machine, the ice cream mixture can be placed directly in the freezer without churning. It won’t be quite as creamy and smooth, but quite good enough. You will get more ice cream than you need for serving with the grapes, but eating the leftovers is no hardship. ", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2017/10/18/dining/18Baking1/18Baking1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "italian, mediterranean", "recipeCategory": "ice creams and sorbets", "keywords": "concord grapes, cream, greek yogurt, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 484, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "81 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "9 grams", "sodiumContent": "42 milligrams", "sugarContent": "76 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 cups/250 grams granulated or superfine sugar (caster sugar)", "3 strips orange zest, plus 1/3 cup/60 milliliters orange juice", "1 strip lemon zest, plus 2 tablespoons lemon juice", "1 1/2 cups/300 grams Greek yogurt", "1 cup /200 grams heavy cream (double cream)", "1 1/2 pounds/600 grams red seedless grapes, off the stem", "1/3 cup plus 1 tablespoon/90 milliliters muscat wine (or another sweet dessert wine such as port or Madeira)", "2 tablespoons honey", "1/4 cup/5 grams loosely packed lemon thyme (or regular thyme) sprigs, or use leaves if sprigs are woody", "2 tablespoons/30 grams soft dark brown sugar", "1 teaspoon finely grated lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 1 day before you plan to serve, make the ice cream: In a medium saucepan, combine sugar and 1 cup/200 milliliters of water over medium-high heat. Heat for 3 to 4 minutes, stirring until the sugar has dissolved. Add the orange and lemon zests, remove from the heat and set aside to cool down and infuse for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl or pitcher, combine the yogurt, cream, orange and lemon juices. Pour in the sugar syrup, discarding the strips of zest. Stir well to combine, pour through a fine sieve and refrigerate until very cold, at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour mixture into an ice cream machine and churn until the ice cream is set. Transfer to a container and freeze until solid. (Can be prepared up to this point up to 1 month in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the day of serving, prepare the grapes: Heat oven to 450 degrees Fahrenheit/240 degrees Celsius. In a medium bowl, combine grapes, muscat, honey, thyme, brown sugar and lemon zest, and stir well. Pour into a high-sided 9-by-13-inch/20-by-25-centimeter baking dish and bake for 30 to 45 minutes, stirring a few times, until the grapes have caramelized and the liquid is syrupy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the juices don’t thicken, pour them into a saucepan (reserve the cooked grapes separately) and reduce over medium heat until syrupy and beginning to caramelize. Turn off the heat and immediately stir the grapes back into the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Five minutes before serving, remove ice cream from the freezer and divide between serving bowls. Spoon grapes and sauce over the ice cream and serve at once."}]}