{"@context": "http://schema.org", "@type": "Recipe", "name": "Date-Stuffed Parathas With Yogurt Dip", "description": "This recipe plays fast and loose with the buttery, layered Indian flatbreads called parathas. Traditionally, a flour-and-water yeastless dough is brushed with clarified butter or oil, then folded over onto itself so that the breads puff in the pan when fried. If you’ve ever seen them stuffed, it’s generally with something savory — potatoes, onions or ground meat and the like, which give them heft and depth. In this version, sugary sliced dates are folded into the layers, then the breads are grilled rather than fried. (But they can be fried if you prefer.) They are sweeter and smokier than the usual parathas, but just as good for scooping up dips of all kinds. Here, they’re paired with a variation on raita, an Indian yogurt, cucumber and mint mixture that’s been garnished with crushed walnuts for crunch.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/07/07/multimedia/clark-grilled-parathas/clark-grilled-parathas-mediumThreeByTwo440.jpg", "totalTime": "PT1H", "recipeYield": "6 flatbreads", "recipeCuisine": "indian", "recipeCategory": "breads", "keywords": "appetizer, side dish, cucumber, dates, greek yogurt, whole wheat flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 453, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "23 grams", "sodiumContent": "284 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup/65 grams whole-wheat flour, more for dusting", "1/2 cup/60 grams all-purpose flour", "3/4 teaspoon fine sea salt", "1/2 cup plus 2 tablespoons/142 grams unsalted butter, melted, plus more as needed for the bowl and brushing", "1/2 cup/80 grams sliced pitted dates (4 to 5 large pitted)", "Olive oil, as needed", "1 cup/236 milliliters Greek yogurt, preferably whole milk", "2 Persian cucumbers, coarsely grated (1/2 cup)", "1 small garlic clove, grated on a Microplane or minced", "2 tablespoons finely chopped mint, plus torn whole leaves for garnish", "Fine sea salt, to taste", "1/4 cup/30 grams toasted walnuts, chopped", "1/4 teaspoon ground black pepper", "Crushed dried rose petals, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the parathas: In a large bowl, whisk together flours and salt. Pour 4 tablespoons melted butter over the flour mixture. Use your fingers to rub the butter into the flour until the mixture becomes moist and crumbly. Knead in 1/2 cup water, a little at a time, as needed, until a soft dough forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to a lightly floured surface and knead dough until it is smooth and slightly elastic, about 5 minutes. Roll dough into a ball and transfer it to a buttered bowl. Cover bowl with plastic wrap and let it rest at room temperature for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 6 equal-size balls. Transfer one ball to a lightly floured surface (keep other dough balls covered with a clean dish towel). Roll the dough into a 6-inch circle. Using a pastry brush, coat the surface of the dough with melted butter, and sprinkle half with 1 generous tablespoon sliced dates. Fold the dough in half, forming a semicircle over the dates. Brush the surface of the semicircle with butter; fold it in half again to form a triangle. Gently roll out dough to a thickness slightly less than 1/4 inch. (You can prepare the parathas up to this point the day before; store in an airtight container with a sheet of plastic wrap or parchment between each paratha, in the refrigerator.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dip: In a medium bowl, whisk together yogurt, cucumbers, garlic, mint and salt to taste. Garnish with walnuts, black pepper, torn mint leaves and rose petals if using. Cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a high-heat fire in a gas or charcoal grill. Brush parathas with oil and place on the grate. Cover and cook, turning once halfway through, until parathas are dark golden brown and crisp, 1 1/2 to 2 minutes per side. Serve hot, with yogurt dip alongside."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Date-Stuffed Parathas", "description": "For a summery twist on this buttery flatbread, stuff it with dates and grill it.", "thumbnailUrl": "https://static01.nyt.com/images/2016/07/07/multimedia/clark-grilled-parathas/clark-grilled-parathas-mediumThreeByTwo440.jpg", "uploadDate": "2016-07-08T17:16:55.000Z", "duration": "PT2M29S"}}