{"@context": "http://schema.org", "@type": "Recipe", "name": "Sugar Snap Pea Salad With Calabrian Pepper and Fennel", "description": "Whitney Otawka, whom you may remember from \"Top Chef\" or Hugh Acheson’s Five & Ten restaurant in Athens, Ga., cooks at the Greyfield Inn. It’s the only place to stay on Cumberland Island, the largest barrier island off Georgia’s coast. The farmers who live there grow sugar snap peas, which she welcomes as one of the early tastes of spring. She is also a fan of Calabrian peppers packed in oil, which she started eating at Antico Pizza in Atlanta. She uses them to make a dressing base that enlivens the peas. The fennel, which needs to be sliced very finely, adds crunch and depth. Buy baby fennel, if you can find it. This is a great salad on its own, or use it as a kind of relish on grilled meat or braised lamb. There will be extra chile dressing, which is a fine condiment for grilled chicken. It will also add character to a pasta dish or even a slice of takeout pizza.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2017/04/11/dining/12LAMB5/12LAMB5-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, salads and dressings", "keywords": "baby fennel, calabrian peppers, pecorino romano, sugar snap peas, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 240, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "4 grams", "sodiumContent": "281 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup grapeseed or other neutral oil", "1 teaspoon minced garlic", "2 teaspoons minced shallot", "1 teaspoon deseeded and minced Calabrian peppers packed in oil", "1/2 teaspoon lemon zest", "1/4 teaspoon minced fresh thyme", "1/4 cup extra-virgin olive oil", "1/4 cup fresh lemon juice", "Pinch salt and black pepper", "1 pound sugar snap peas", "1/2 cup thinly shaved fennel, preferably baby fennel", "1/4 teaspoon salt", "1 1/2 tablespoons chopped fresh mint", "1/2 cup shaved pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: Heat the grapeseed or other oil in a small sauté pan over low heat. When oil begins to shimmer add the garlic, shallot, Calabrian peppers, lemon zest and thyme. Gently cook for 1 minute, stirring. Remove from heat and transfer to a small mixing bowl. Add the olive oil, lemon juice, salt and pepper. Whisk thoroughly to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salad: Wash the snap peas and remove the tough string that runs along the interior curve of the pea. Julienne the peas lengthwise, about 1/4-inch thick. Put the peas, fennel, 2 tablespoons of the dressing and the salt in a bowl and mix to coat the peas. To serve, sprinkle the mint over the top, drizzle on 1 tablespoon of the dressing and sprinkle the shaved pecorino."}]}