{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Cooked Red Wine Beef Stew", "description": "Red wine and beef are such an elemental combination that it's worth mastering the technique for a great stew: Sauté the ingredients quickly to caramelize and reduce, then cook through very slowly (preferably in a low oven, but see our Notes on how to cook in the slow cooker or pressure cooker). You can use any wine you like, since it will be cooked for a long time: the alcohol, acidity and fruitiness that make wine lovely in the glass are not so nice in the bowl; they have to be tamed by simmering. But the tangy, syrupy taste they leave behind is an ideal counterpoint to red meat. Celery is optional because some don't like it, but note that it's not eaten: It just provides a green flavor note alongside the sweet carrots and earthy potatoes.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/04/04/dining/04recipelab/04recipelab-mediumThreeByTwo440.jpg", "totalTime": "PT5H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "beef stew meat, bouquet garni, red wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 691}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 447, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "3 grams", "proteinContent": "40 grams", "saturatedFatContent": "5 grams", "sodiumContent": "942 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 1/2 to 4 pounds well-marbled beef stew meat, preferably chuck, cut into large (2-by-2 1/2-inch) pieces", "2 large sprigs fresh thyme", "2 bay leaves", "About a dozen juniper berries", "1/2 bottle red wine (not sweet)", "Salt and freshly ground black pepper", "4 garlic cloves (1 smashed and peeled, 3 minced)", "4 tablespoons vegetable oil", "3 stalks celery (optional)", "3 large carrots", "2 onions", "1 large, starchy potato, such as Idaho", "3 ounces pancetta (or French ventrèche), diced small (optional)", "3 tablespoons olive oil", "3 tablespoons tomato paste", "Bouquet garni (2 sprigs fresh thyme, 2 sprigs fresh rosemary or parsley, 2 bay leaves, 6 juniper berries, 4 whole cloves, 1 teaspoon dried orange peel, wrapped in cheesecloth and tied)", "1/2 bottle red wine", "Chicken broth, as needed", "3 tablespoons chopped parsley", "1 tablespoon chopped fresh thyme leaves (or use additional parsley), for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the meat: In a large bowl, combine all the marinade ingredients. Mix well and refrigerate in the bowl or a thick sealable plastic bag for at least 2 hours or up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, strain off the marinade and reserve for cooking. Drain meat on paper towels and pat until very dry. Sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, heavy pot with a tight-fitting lid on the stove and rub the bottom with the smashed, peeled clove of garlic, until coated with the garlic’s oils. Discard garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons vegetable oil, and cook over medium heat until shimmering. Add half the meat and brown gently on both sides while preparing the vegetables. There’s no need for a hard crust to form; a little browning is all that’s required. When browned, remove meat to paper towels to drain. Repeat with remaining 2 tablespoons oil and meat. Return all the browned, drained meat to the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the celery (if using) and carrots into large chunks. Peel and chop the onions. Peel and dice the potato."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees. In a separate skillet, heat pancetta (if using) and olive oil over low heat. Cook gently until the fat renders. When the pork fat is running, add onions, celery, carrot, onion and minced garlic. (If not using pancetta, simply heat olive oil and add vegetables and garlic.) Cook gently, stirring, until softened and golden, about 10 minutes. Raise the heat, add tomato paste and cook, stirring, until fragrant and sizzling. Add the bouquet garni, reserved marinade and potato. Let bubble fiercely for 5 to 10 minutes, until liquid is thickened and syrupy. Add mixture, once cooked, to the pot with the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in the wine and, if needed, enough broth to just cover the ingredients. Stir to combine. Bring to a simmer, cover tightly and bake 4 to 5 hours, until the meat is soft enough to eat with a spoon and the sauce is rich and thick. After 4 hours, if liquid seems thin, uncover pot for the rest of the cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When done, let cool slightly, uncovered. Remove and discard celery (if using) and bouquet garni. To thicken the stew, use a fork to mash some of the carrots and potatoes into the liquid; or, remove and purée them, then add back in. Taste and adjust the seasonings with salt and lots of freshly ground pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat and serve immediately, or let cool and refrigerate. Serve within 3 days; the flavor will only improve. Garnish each serving with a sprinkling of chopped thyme and parsley."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Slow-Cooked Red Wine Beef Stew", "description": "Stews with wine must be cooked slowly, because the alcohol, acidity and fruitiness of wine need some taming.", "thumbnailUrl": "https://static01.nyt.com/images/2018/04/04/dining/04recipelab/04recipelab-mediumThreeByTwo440.jpg", "uploadDate": "2018-04-03T15:34:34.000Z", "duration": "PT1M11S"}}