{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Ginger Applesauce Cake With Cream Cheese Frosting", "description": "This simple sheet cake is packed with three kinds of spicy ginger: fresh, ground and crystallized. The cake is delicious on its own, but cream cheese frosting and a sprinkle of crystallized ginger push it closer to dessert. The cake can be made a day in advance, covered and refrigerated and brought to room temperature before serving. The crystallized ginger should be sprinkled on just before serving as it will weep in the fridge.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2018/11/06/dining/ya-ginger-apple-sheetcake/ya-ginger-apple-sheetcake-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": " 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "candied ginger, cream cheese, ginger, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 103}, "recipeIngredient": ["1 1/4 cups/275 grams light brown sugar", "2 large eggs", "2 cups/480 milliliters unsweetened applesauce", "3/4 cup/180 grams neutral oil like canola or grapeseed", "2 tablespoons fresh ginger, peeled and finely grated", "1 tablespoon ground ginger", "1 teaspoon finely grated orange zest", "1 teaspoon ground cinnamon", "1 teaspoon ground cardamom", "1/4 teaspoon ground allspice", "1 teaspoon vanilla extract", "3/4 teaspoon kosher salt", "2 cups/255 grams all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "1/2 cup/85 grams finely chopped crystallized ginger", "12 ounces/350 grams cream cheese, softened", "1/2 cup/115 grams unsalted butter, softened", "2 1/4 cups/226 grams confectioners' sugar, sifted", "1 tablespoon fresh ginger, peeled and finely grated", "1 teaspoon lemon zest", "1 teaspoon vanilla extract", "Pinch of kosher salt", "1/2 cup/85 grams finely chopped crystallized ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Butter and flour a 9-by-13-inch glass or light-colored metal baking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk sugar and eggs until light, about 1 minute. Add applesauce, oil, fresh and ground ginger, orange zest, cinnamon, cardamom, allspice, vanilla extract and salt. Whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour, baking soda and baking powder, and whisk until just combined. Fold in 1/2 cup chopped candied ginger."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan, smooth the top and firmly tap the pan on a countertop to release air bubbles. Bake the cake until golden and puffed, and a tester inserted into the center comes out clean, 25 to 35 minutes. Cool the cake in the pan on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cake is cool, make the frosting: Add the cream cheese and butter to the bowl of a stand mixer fitted with the whisk attachment. Mix on medium-high until smooth, stopping the mixer occasionally to scrape the bottom and sides of the bowl. Turn the speed to low, and slowly add the confectioners’ sugar. Mix until the sugar is moistened, then turn the mixer speed up to medium-high and whip until smooth. Scrape down the bottom and sides of the bowl. Add the ginger, lemon zest, vanilla and salt, and mix on low. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the frosting over the cooled cake in dramatic swoops and swirls, then sprinkle the remaining 1/2 cup crystalized ginger on top. Serve at room temperature."}]}