{"@context": "http://schema.org", "@type": "Recipe", "name": "Freds’ Chicken Salad With Balsamic Dressing", "description": "This salad is a perennial favorite at Freds, the glittery see-and-be-seen restaurant inside Barneys New York. The recipe calls for a whole roasted chicken, so you'll need to build in time to allow one to cool after roasting, or you can use leftovers or a store-bought rotisserie chicken instead. When prepping the vegetables and pear, make sure the pieces are more or less the same size. And remember to sprinkle the pear with lemon juice to keep it from discoloring, and cut the avocado just before serving. Precision never goes out of fashion.", "author": {"@type": "Person", "name": "Ginia Bellafante"}, "image": "https://static01.nyt.com/images/2019/05/09/dining/freds-chicken-salad-2/merlin_154604952_2850809e-a325-495b-ad7b-a48102eeff6e-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 main-course servings, or 6 appetizer servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, lunch, salads and dressings", "keywords": "appetizer, main course, avocado, chicken, mixed greens, pear", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1166}, "recipeIngredient": ["1 4-pound chicken (or a store-bought rotisserie chicken, in which case skip to the dressing below)", "1 1/2 tablespoons salt", "1/2 bunch fresh thyme", "1 lemon, quartered", "2 cloves garlic, peeled", "1 tablespoon extra-virgin olive oil", "1 teaspoon ground black pepper", "1/4 cup balsamic vinegar", "1/4 cup Dijon mustard", "1/4 cup soy sauce", "2 tablespoons sugar (optional)", "1 teaspoon kosher salt", "1/2 teaspoon ground black pepper", "1 cup extra-virgin olive oil", "1 cup fresh pears diced in 1-inch pieces", "1 tablespoon lemon juice", "4 large handfuls mixed greens, such as a boxed mix with fresh herbs", "1 cup string beans cut in 1-inch pieces, blanched (from about 1/4 pound beans; see note)", "1 cup cherry tomatoes, halved", "1/2 cup minced onion", "2 ripe avocados, cut into 1-inch cubes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the chicken (if you’re using a cooked, store-bought chicken, skip this step): Heat oven to 350 degrees. Place a rack in a roasting pan. Rub 1 tablespoon salt around the inside of the cavity, then stuff it with the thyme, lemon and garlic. Tie the legs closed with cooking twine. Rub olive oil over the entire bird, and sprinkle with 1/2 tablespoon salt and the black pepper. Place on the rack and roast for 72 to 80 minutes. After 72 minutes, begin testing for doneness by inserting a meat thermometer into the leg, close to the bone. The chicken is done when the thermometer reads 165 degrees. Remove from oven and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cool enough to handle, remove the skin from the chicken. Use your hands to remove all the meat (remember, it will be hotter internally) and shred into 2-inch strips. If you’re not going to make the salad for a few hours, place the meat in the refrigerator, but be sure to remove it and let come to room temperature for 30 to 45 minutes before serving, to bring out the best flavor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: Place all the ingredients except the oil in a food processor and pulse for about 30 seconds, until everything is combined. With the machine on low, slowly drizzle in the oil until dressing is emulsified."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the salad: Drizzle pears with lemon juice to prevent them from browning. In a large mixing bowl, combine pears, greens, beans, tomatoes, onion, avocado and half the chicken meat. Add some of the dressing and toss to make sure everything is lightly coated, adding more dressing if needed. Divide the mixture equally among 4 or 6 plates. Lay the rest of the chicken on top and serve immediately, passing the remaining dressing in case people want to add more."}]}