{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker White-Bean Parmesan Soup", "description": "Parmesan rinds are magic. After a long braise, that hard, waxy scrap infuses the entire soup with its rich, distinctive flavor. Here, they make a wholesome soup taste like an incredible indulgence. So don't ever throw them away. They keep in the freezer indefinitely. The wheat berries here are also a great match for the slow cooker. While they may not be the most glamorous grains, they hold their shape and take a conveniently long time to get tender. You can find them at many grocery or natural-foods stores, as well as online. But you can also substitute farro or spelt (whole grains but not pearled). Just note that they'll cook faster and may end up quite soft after an 8-hour cook time.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2018/10/29/dining/sd-white-bean-wheat-berry/sd-white-bean-wheat-berry-articleLarge.jpg", "totalTime": "PT10H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, soups and stews", "keywords": "cannellini beans, fennel, parmesan, wheat berries, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1590}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 715, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "86 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "18 grams", "proteinContent": "42 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1191 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 pound dry cannellini beans, soaked overnight and drained", "Kosher salt and black pepper", "8 ounces Parmigiano-Reggiano, hard rinds cut off and reserved", "1 cup wheat berries", "1/4 cup olive oil", "1 large onion, finely chopped", "1 fennel bulb, cored and finely chopped, fronds roughly chopped and reserved", "3 celery stalks, sliced 1/2-inch thick", "6 garlic cloves, roughly chopped", "1 teaspoon fennel seeds", "1 teaspoon red-pepper flakes", "2 sprigs fresh rosemary", "1/2 cup dry white wine", "6 cups chicken stock or broth", "Leaves from 1 small bunch flat-leaf parsley, chopped", "Juice of 1 large lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the soaked, drained beans in a 5- to 8-quart slow cooker, and season them generously with salt and pepper. Add the Parmesan rinds and the wheat berries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the oil in a large skillet over medium-high heat. Add the onion, season generously with salt, and cook, stirring occasionally, until softened, about 5 minutes. Add the fennel. Continue to cook, stirring often, until the fennel is softened and the onion is lightly browned, about 5 more minutes. Add the celery and garlic, and cook, stirring, until just softened, about 1 minute. Add the fennel seeds and red pepper, and cook, stirring constantly, until combined and fragrant, about 1 minute. Add the rosemary and the wine and let the wine bubble until the pan is almost dry, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the mixture from the skillet into the slow cooker. Add the stock, and season it: Add 1/2 teaspoon salt, if you are using low-sodium broth, or 1 teaspoon salt, if using homemade unsalted stock. (Do not add salt now if you are using fully salted broth.) Stir to combine, and cook on low until the wheat berries are tender and the beans are creamy, about 8 to 10 hours. (Taste the beans to make sure they are creamy; they can vary in their cooking time depending on their age.) The soup can hold well on warm for 1 to 2 additional hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, remove and discard the rosemary sprigs. Stir in the parsley, lemon juice, and reserved fennel fronds. Taste and add salt and pepper if necessary. Serve in bowls topped generously with grated Parmesan."}]}