{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach and Tofu Salad", "description": "Here’s a spinach salad that takes cues from Japan and is hearty enough to be a main course. Try to find crisp, medium curly-leaf spinach, which will hold up when dressed. (Baby spinach leaves will surely wilt.) Other sturdy greens — such as mizuna, curly endive or Napa cabbage — can stand in for spinach, or you can combine several kinds of greens.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/21kitchenrex1/merlin_146065923_e0d513ad-3826-4b31-997c-6ba308774815-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "japanese", "recipeCategory": "dinner, lunch, salads and dressings", "keywords": "cucumber, daikon, edamame, miso, spinach, tofu, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 129}, "recipeIngredient": ["1/2 pound firm tofu", "1/4 cup soy sauce", "1 tablespoon toasted sesame oil", "1 tablespoon rice wine vinegar", "1 tablespoon sake", "1 tablespoon brown sugar", "1 teaspoon grated ginger", "Pinch of cayenne", "8 ounces medium spinach leaves", "2 tablespoons lime or lemon juice", "2 teaspoons brown sugar", "1 tablespoon toasted sesame oil", "3 tablespoons vegetable oil", "1 tablespoon soy sauce", "2 tablespoons white or red miso", "1/2 teaspoon grated garlic (from about 2 to 3 cloves)", "1 teaspoon grated ginger (from a peeled 1-inch piece) ", "1 cup chopped cucumber", "1 cup thinly sliced daikon radish", "1 cup frozen edamame, thawed", "1 teaspoon sesame seeds", "2 tablespoons pumpkin seeds", "2 tablespoons roasted peanuts", "Pinch of kosher salt or flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Slice tofu into 1-inch-by-2-inch pieces about 1/4-inch thick and place in a deep bowl or on a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade: In a medium bowl, whisk together soy sauce, sesame oil, vinegar, sake, brown sugar, ginger and cayenne. Pour marinade over tofu slices to coat well. Leave in marinade for at least 15 minutes. (You may marinate the tofu up to 24 hours in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the tofu marinates, pick over spinach leaves and remove any tough stems. Swish the spinach in a deep bowl of cold water. Lift leaves from water into a colander. If you see any sand in the water, repeat up to 3 times, using fresh water each time. Drain well and dry spinach, then wrap in a kitchen towel and refrigerate until ready to use. (You may wash the spinach up to 24 hours in advance.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a small bowl, whisk together lime juice, brown sugar, sesame oil, vegetable oil, soy sauce, miso, garlic and ginger."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper, and arrange the tofu pieces in a single layer. Spoon remaining marinade over tofu. Bake, uncovered, for 15 to 20 minutes, until slightly crisped. Remove and leave at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salad, arrange spinach in a low, wide salad bowl or on a deep platter. Scatter cucumber, daikon and edamame over spinach, then sprinkle with sesame seeds, pumpkin seeds and peanuts. Tuck slices of tofu here and there."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle a pinch of salt over everything, then drizzle salad with dressing and serve."}]}