{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Red Wine Poached Pears", "description": "As elegant as they are delicious, poached pears are a splendid finish to dinners dressy or plain. Here, the poaching syrup is red wine, honey and good cold-weather spices: cloves, cinnamon and star anise. Look for pears that are ripe but still firm, and if you can, choose pears that have stems — they make for a more attractive dish. You can serve the pears soon after they’re made or you can cover and refrigerate them in their syrup and serve them chilled or at room temperature. They’re good on their own or alongside whipped cream or crème fraîche.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2017/10/29/magazine/29Paris-recipes4/29Paris-recipes4-articleLarge-v2.jpg", "totalTime": "PT35M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, pear, red wine, star anise", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 104}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 235, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "6 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "7 milligrams", "sugarContent": "34 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 lemon", "6 ripe but firm pears", "2 cups (480 milliliters) red wine", "1/2 cup (120 milliliters) water", "3 tablespoons sugar", "3 tablespoons honey", "2 whole cloves", "1 cinnamon stick", "1 whole star anise", "Lightly sweetened whipped cream or crème fraîche, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the lemon, and remove 3 wide strips of rind. Peel the pears, leaving a topknot of skin and the stem, if it’s attached; rub with the cut lemon. Working from the bottom, core the pears."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Choose a pot that will hold the pears snugly. Cut a circle of parchment paper to fit inside the pot. Cut 4 slices from the lemon and put them, the strips of zest and all the other ingredients — except the pears — into the pot. Bring to a boil, lower the heat and add the pears, tops up — it’s O.K. if they’re not fully submerged. Cover with the paper circle and the pot’s lid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer for 15 to 20 minutes — the pears should still be slightly firm but easily pierced with the tip of a knife; transfer them to a bowl. Boil the syrup for 5 minutes, pour over the fruit and discard the spices. Serve slightly warm, at room temperature or chilled, with or without cream."}]}