{"@context": "http://schema.org", "@type": "Recipe", "name": "Sausage and Peppers Pasta With Broccoli", "description": "The classic Italian combination of sausage and peppers creates a satisfying and easy weeknight meal when combined with pasta. Broccoli is a fantastic nutritious addition that adds texture and cooks up quickly, or you can opt for broccolini or broccoli rabe if you want a more assertive vegetable. Sweet Italian pork sausage is used here, but there's no need to feel tied to the recipe: Substitute with spicy Italian sausage for extra heat, use chicken-apple sausage for a healthier take, or swap in fresh chorizo or breakfast sausage to turn this dinner into brunch.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2018/12/06/dining/Italian-Sausage-and-Peppers-Pasta-With-Broccoli/Italian-Sausage-and-Peppers-Pasta-With-Broccoli-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, easy, lunch, quick, weeknight, pastas", "keywords": "broccoli, italian pork sausage, parmesan, rigatoni, yellow bell pepper, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1223}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 981, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "99 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "7 grams", "proteinContent": "41 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1080 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup extra-virgin olive oil", "1 pound sweet Italian pork sausage, casings removed", "1 pound broccoli, cut into 1 1/2-inch florets (about 4 cups)", "2 medium yellow bell peppers (12 ounces), cored, seeded and thinly sliced (about 2 1/2 cups)", "3 cloves garlic, thinly sliced", "Kosher salt and pepper", "1 pound rigatoni", "1/2 cup grated Parmesan (2 ounces), plus more for serving", "2 tablespoons fresh lemon juice (from about 1/2 lemon)", "1/2 teaspoon red-pepper flakes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in a large nonstick skillet over medium heat. Add the sausage and cook, breaking up the meat using a wooden spoon, until browned, about 5 minutes. Scrape the mixture into a medium bowl. Add the remaining 2 tablespoons oil, the broccoli, peppers and garlic to the skillet and season with salt and pepper. Cook, stirring often, until they soften and begin to brown, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the pasta in a large pot of boiling salted water until al dente. Reserve 1 cup cooking water and drain the pasta. Return the pasta and reserved cooking water to the pot over low heat. Add the broccoli mixture, cooked sausage and its accumulated juices, 1/2 cup Parmesan, the lemon juice and red-pepper flakes and stir vigorously until liquid is slightly thickened and saucy, about 2 minutes. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the pasta with additional Parmesan for sprinkling on top."}]}