{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Cooker Steel-Cut Oats", "description": "The rice cooker isn’t a one-trick pony: It’s actually the secret to waking up to hot, creamy oatmeal. Steel-cut oats soften in the machine while retaining their nutty flavor and nubby chew — all without any effort on your part. Since rice cooker models vary, you can play around with the water proportions to achieve your favorite consistency. Generally, though, you’ll need a lot more water to oats using a rice cooker because oats stiffen and soak up even more water as they rest after cooking. Once they’re done, you can top them however you like, but regardless of whether you prefer your oats sweet or savory, be sure to cook them with salt to enhance their flavor.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/08/29/dining/ko-rice-cooker-oats-horizontal/ko-rice-cooker-oats-horizontal-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, grains and rice", "keywords": "main course, steel-cut oats, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 143}, "recipeIngredient": ["1 cup steel-cut oats", "1 teaspoon kosher salt", "Savory toppings: sautéed or roasted vegetables; crisped bacon, sausage or ham; flaked smoked fish; cooked eggs; kimchi; pickles; nori; roasted salted nuts or seeds; avocado; fresh tomatoes; fresh greens or herbs", "Sweet toppings: toasted nuts or seeds; dried fruit; fresh fruit; maple syrup; brown sugar; honey; jam; fruit compotes; milk or cream; nut butters"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the oats and salt in a rice cooker. If using a model with a porridge setting and a cooking timer, stir in 3 1/2 cups cold water. If using a standard model, stir in 4 cups cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If your machine has a timer setting, set it to start cooking 2 hours before you want to eat your oatmeal. If it doesn’t have a timer, turn on the machine right before you go to bed. The machine should automatically go to a warming setting after it cooks the oatmeal, but check your machine to make sure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently stir the oatmeal, then divide among bowls or airtight containers to eat on the go and add the toppings of your choice."}]}