{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli-Walnut Pesto Pasta", "description": "Pesto becomes more full-bodied with the addition of broccoli that’s blanched in the same pot as the pasta and fresher with the combination of mint and lemon. For a sauce that's light and loose, use only the florets — not the stems. Raw walnuts have a welcome natural sweetness and nice crunch that complement the pesto, but you can leave them out or substitute sunflower seeds if you have a tree-nut allergy.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/10/25/dining/gk-broccoli-pesto-pasta/merlin_144334281_b21bf502-cd12-4edd-b4cf-b2896f6a1523-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, pastas", "keywords": "broccoli florets, mint, pasta, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 568}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 535, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "6 grams", "proteinContent": "14 grams", "saturatedFatContent": "3 grams", "sodiumContent": "447 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["Kosher salt", "4 cups broccoli florets (10 ounces from 2 crowns)", "1 pound cut pasta, such as medium shells", "1 large garlic clove, smashed", "2 packed cups fresh mint leaves (about 2 ounces from one small bunch)", "Black pepper", "1/2 cup extra-virgin olive oil, plus more for serving", "1 lemon, zested and juiced", "Parmigiano-Reggiano, for serving", "1/2 cup walnuts, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of water to a boil over high heat. Add 1/4 cup salt, then add the broccoli. Cook, stirring occasionally, until bright green and just tender, about 5 minutes. Use a spider or slotted spoon to transfer to a food processor; keep the water boiling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop the pasta into the boiling water and cook according to the package’s directions for al dente. Reserve 1/2 cup pasta cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add the garlic to the broccoli and pulse, scraping the bowl occasionally, until smooth. Add the mint, 1 teaspoon salt and 1/2 teaspoon pepper. Pulse until smooth, then add the oil with the machine running."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pasta well and transfer to a large bowl. Stir in the pesto. Add 2 tablespoons lemon juice and 1/2 teaspoon each salt and pepper and toss until the pasta is evenly coated. If the mixture seems thick, fold in the reserved pasta water, 1 tablespoon at a time. The mixture will thicken as it cools, so you want it to be saucy. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among serving dishes and top with lemon zest, then grate cheese over. Sprinkle with the walnuts, grind more black pepper on top, then drizzle with olive oil. Serve hot, warm or room temperature."}]}