{"@context": "http://schema.org", "@type": "Recipe", "name": "Kale-Sauce Pasta", "description": "This recipe for a vivid, vegetarian pasta sauce, made from blanched kale leaves and loaded with good olive oil and grated cheese, comes from Joshua McFadden, the chef at Ava Gene’s in Portland, Ore., and was inspired by Rose Gray and Ruth Rogers of The River Café in London. The technique is absurdly simple and quick from start to finish, but the result is luxurious and near-creamy. Feel free to play with the pasta shape, but no matter what you choose, be sure to let the blender run for a while at a powerful setting: You want the kale to completely break down into a smooth, bright, airy green puree.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/01/07/magazine/07mag-eat1/07mag-07eat-t_CA0-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 servings as a main course or 4 as a side", "recipeCuisine": "", "recipeCategory": "weekday, weeknight, noodles, pastas", "keywords": "kale, parmigiano-reggiano, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 918}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 944, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "108 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "12 grams", "proteinContent": "40 grams", "saturatedFatContent": "11 grams", "sodiumContent": "962 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["Kosher salt, to taste", "1/4 cup extra-virgin olive oil, plus more for serving", "2 cloves garlic, smashed flat and peeled", "1 pound lacinato kale, thick ribs removed", "Freshly ground black pepper, to taste", "1/2 pound pasta, like pappardelle or rigatoni", "3/4 cup coarsely grated Parmigiano- Reggiano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large pot of generously salted water over high heat, and bring to a boil. In a small skillet over medium heat, add olive oil and garlic, and cook until the garlic begins to sizzle. Reduce heat to low, and cook very gently until garlic is soft and begins to turn light gold, about 5 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water is boiling, add kale leaves, and cook until tender, but not mushy, about 5 minutes. Pull out the hot, dripping kale leaves with tongs, and put directly into a blender. (Don’t drain the pot; you’ll use that same boiling water to cook the pasta.) Add garlic and its oil to the blender, along with a splash of hot water from the pot if you need some more liquid to get the blender going. Blend into a fine, thick green purée. Taste, and adjust seasoning with salt and pepper, then blend again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the still-boiling water, and cook according to directions on the package. Ladle out about a cup of the water to save for finishing the dish, then drain the pasta and return it to the dry pot. Add the kale purée, about 3/4 of the grated cheese and a splash of the reserved pasta water. Toss until all the pasta is well coated and bright green, adding another splash of pasta water if needed so that the sauce is loose and almost creamy in texture. Serve in bowls right away, and top with an extra drizzle of olive oil and the rest of the grated cheese."}]}