{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Peanut and Pumpkin Soup", "description": "This recipe is a promise of warmth on those cool autumn nights. Habanero chiles and peanuts both feature heavily in Nigerian cuisine, and this soup is an adaptation of a long-simmered stew common to much of West Africa. Don’t be afraid of a chile with seeds: The fragrant oils from these peppers are worth every bite. The peanut butter and coconut milk mellow the warmth of the chile to a gentle, lingering heat, but you can also the chile out before the soup is puréed. An optional spoon of honey to the soup will round out the flavors, and a dollop of crème fraîche or yogurt will further temper the heat. Serve with a baguette or sourdough bread for dipping.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2018/11/15/dining/yk-peanut-and-pumpkin-soup/yk-peanut-and-pumpkin-soup-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "african", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "appetizer, main course, chile, coconut milk, peanut butter, pumpkin purée, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 396}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 477, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "5 grams", "proteinContent": "12 grams", "saturatedFatContent": "21 grams", "sodiumContent": "1115 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 medium onion, peeled and diced (about 1 1/2 cups)", "4 garlic cloves, smashed", "1 (1-inch) piece ginger, peeled and chopped", "1/2 habanero or bird's eye chile", "1 (14-ounce) can pumpkin purée", "3 cups water or chicken or vegetable stock", "1 (13-ounce) can coconut milk", "1 tablespoon agave or honey (optional)", "1/4 cup unsweetened natural peanut butter", "Salt", "2 tablespoons sliced fresh chives", "1/4 cup crème fraîche or yogurt<strong> </strong>(optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large stock pot, heat oil over medium heat. Add onion, garlic and ginger, and cook, stirring frequently until softened and just beginning to brown around the edges, about 4 minutes. Stir in the chile and pumpkin purée, and whisk in the water or stock. Bring to a boil, reduce the heat and allow to simmer on low, giving an occasional stir, for 20 minutes or until slightly reduced and thickened. Remove the chile after the soup simmers if you don’t care for much spice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add coconut milk, agave or honey (if using), and peanut butter to the pot. Using an immersion blender or working in batches in a standing blender, purée the soup until smooth. Season with salt and keep warm over low heat. Do not bring soup up to a simmer or boil at this point. (This reduces the risk of the oils in the peanut butter separating and breaking the soup's smooth texture.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide soup between bowls, sprinkle with the chives and a dollop of crème fraîche or yogurt, or a drizzle of olive oil to make it vegan. Serve with a warm crusty baguette or chunks of warm sourdough for dipping."}]}