{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick-Braised Greens and Beans With Bacon", "description": "These stewed greens develop deep flavor thanks to a quick onion-garlic broth and bacon, used two ways. Sliced bacon is cooked until tender, blending in but imparting its smoky, porky essence, while crisp bacon morsels are sprinkled on top for a salty, crunchy hit. This 30-minute dish is great spooned over rice or polenta, or alongside buttery cornbread for a hearty weeknight meal, but you could also top it with an egg to bring it into brunch territory.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2019/02/01/dining/gk-greens-and-beans/gk-greens-and-beans-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "vegetables", "keywords": "bacon, collard greens, greens, hot sauce, kale, kidney bean, mustard greens, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 130}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 326, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "12 grams", "proteinContent": "18 grams", "saturatedFatContent": "3 grams", "sodiumContent": "831 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 bunches dark and sturdy leafy greens, like collards, kale or mustard greens (about 1 pound)", "4 bacon slices", "1 large red onion (about 1 pound), finely chopped", "Kosher salt and black pepper", "6 garlic cloves, sliced", "1 teaspoon dried sage", "1 cup chicken or vegetable stock", "2 (15-ounce) cans red kidney beans, rinsed and drained", "1 teaspoon hot sauce, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the greens: Cut the tough stems out of the greens and discard. Stack the leaves, roll tightly crosswise and slice into 3/4-inch-wide ribbons. Transfer to a large bowl, cover with cold water and swish to remove grit. Transfer greens to a colander, cleaning them a second time if the water remaining in the bowl is visibly dirty."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook 2 bacon slices in a large Dutch oven or other heavy pot over medium heat, turning occasionally, until browned and crisp, about 6 minutes. Transfer the cooked bacon to a paper towel-lined plate. Meanwhile, cut the remaining 2 bacon slices crosswise into 1/4-inch-wide strips. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the 1/4-inch bacon strips to the hot bacon fat and cook, stirring, until the fat in the bacon strips starts to render, about 1 minute. Add the onion and a pinch each of salt and pepper and cook, stirring often, until golden brown around the edges, about 3 minutes. Add the garlic and sage and cook, stirring, until fragrant, about 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the stock, scraping up any browned bits on the bottom of the pot. Cover, reduce the heat to low and simmer, 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium, add the greens, season with salt and pepper and stir until just wilted, about 2 minutes. Cover and cook until tender with a little bite, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover and add the beans and hot sauce. Stir until the beans are heated through, 2 to 3 minutes. Season to taste with salt and pepper. Divide among serving dishes and crumble the cooked bacon slices on top. Serve with more hot sauce."}]}