{"@context": "http://schema.org", "@type": "Recipe", "name": "Tembleque (Coconut Pudding)", "description": "The journalist and cookbook author Von Diaz cooked her way through the classic Puerto Rican cookbook, Cocina Criolla, about six years ago, eventually using the experience as a jumping off point for her own cookbook, \"Coconuts and Collards.\" Her recipe for tembleque, the delicious coconut-milk pudding set with cornstarch and chilled in the fridge, is simple, but it does involve one laborious task: making coconut milk from scratch. As Diaz notes in her book, the effort is greatly rewarded — fresh coconut milk is infinitely more complex, floral and delicious than the kind that comes in a can. Mature coconuts, the ones ideal for making coconut milk, should be brown, hairy and very heavy. If you shake them around, you should be able to hear the water inside. (That said, you can absolutely use canned if you like; just cut the sugar back to a half cup.)<strong></strong>", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/06/24/magazine/24Eat1/24Eat1-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves 10", "recipeCuisine": "latin american", "recipeCategory": "custards and puddings", "keywords": "coconut, orange blossom water, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 70}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 718, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "61 grams", "fiberContent": "16 grams", "proteinContent": "6 grams", "saturatedFatContent": "54 grams", "sodiumContent": "131 milligrams", "sugarContent": "25 grams", "transFatContent": null}, "recipeIngredient": ["4 pounds coconut (about 1 or 2 whole mature coconuts, or 2 cups fresh coconut meat)", "1/2 cup cornstarch", "2/3 cup sugar", "1/2 teaspoon kosher salt", "1 teaspoon orange-blossom water", "Ground cinnamon, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make fresh coconut milk, extract the coconut water and coconut meat from the coconut: Hammer a screwdriver into the coconut’s three eyes, and pour the coconut water through a fine-mesh strainer into a blender. Wrap the coconut in a towel to balance it, and crack it open with a hammer or the dull side of cleaver. Remove the tough outer shell, then use a vegetable peeler to remove any remaining brown skin on the coconut meat. Rinse the meat thoroughly, then roughly chop it. Add 2 cups coconut meat and 3 1/2 cups hot water to the blender, and process. Strain through a fine-mesh sieve, pressing at coconut solids with the back of a spoon. Wrap the solids in a piece of cheesecloth, and squeeze firmly with your hands to get every last bit of liquid out. (Reserve coconut solids for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, combine the cornstarch, sugar and salt, and mix together with a whisk. Lightly whisk the coconut milk if it has separated, then whisk 4 cups coconut milk into the cornstarch mixture. Add the orange-blossom water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the saucepan over medium-high heat, and whisk until the mixture starts to thicken. Lower the heat to medium-low, and continue stirring until a few bubbles start to appear and break on the surface and the mixture is just barely boiling. Remove from heat and immediately pour into 10 dry ramekins, using a scant half cup for each portion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow it to cool at room temperature for about 30 minutes, then cover with plastic wrap, and chill in the refrigerator for at least 2 hours, or until completely cold. Use a small palette knife to release the edges, and tip the tembleque out onto serving dishes (or, alternately, serve directly out of ramekins). Garnish with a dusting of cinnamon."}]}