{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Peppers With Lemon Ricotta", "description": "Roasted peppers are culinary chameleons — they have their own distinctive flavor, yet they mix easily with so many ingredients. In this recipe, the peppers are slicked with olive oil and vinegar (use either sherry or balsamic) and served with ricotta that’s enlivened with lemon zest and juice. If you’ve got it, add also the finely chopped rind of a salt-preserved lemon to the ricotta. Because the peppers can be made ahead and the ricotta is better chilled, this is a great recipe for a dinner party — it takes just a few minutes to assemble the dish at serving time and it looks good whether you arrange it on a platter or take the time to make individual plates.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2017/10/29/magazine/29Paris-recipes2/29Paris-recipes2-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "appetizer, preserved lemon, red bell pepper, ricotta", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 199, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "6 grams", "sodiumContent": "458 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["6 bell peppers, red or yellow", "2 to 3 tablespoons olive oil", "1 1/2 cups ricotta", "1 lemon", "1 tablespoon chopped preserved lemon rind (optional)", "Fine sea salt", "Freshly ground pepper", "Sherry or balsamic vinegar, for serving", "Minced chives or basil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven, and heat it to 425 degrees. Line a baking sheet with foil. Rinse the peppers, pat them dry and place them on the pan. Roast the peppers, turning every 10 minutes, until their skins are black and blistered, 40 minutes, more or less. Transfer the peppers to a heatproof bowl, cover and, when they’re cool enough to handle, peel off the skins. Remove the caps, cut each pepper in quarters or halves and remove and discard the seeds. Lightly brush the peppers with oil; use now, or cover closely and refrigerate for up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the ricotta into a bowl, and mix with a spatula to smoothen. Grate the lemon zest over the ricotta, squeeze in about 1 tablespoon of the juice and add the preserved lemon rind, if you’re using it. Pour in a few teaspoons of olive oil, and season to taste with salt and pepper. Use now, or cover and refrigerate for up to 1 day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon or spread the lemon ricotta on a platter or individual plates, and drizzle with olive oil. Top with peppers, and brush or drizzle with olive oil and either sherry or balsamic vinegar. Finish with a sprinkling of chives or basil."}]}