{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized-Scallion Sauce", "description": "A twist on the Cantonese classic ginger-scallion sauce, this aromatic purée focuses on the flavor of scallions slow-cooked to draw out their gentle sweetness. Adding more scallions at the end brings a fresh complexity to the sauce, but if you want to keep the whole thing mellow and sweet, feel free to omit that step, and just cook all the scallions at once. It's great as a <a href=\"https://cooking.nytimes.com/recipes/1019309-caramelized-scallion-noodles\">dressing for noodles,</a> boiled or roasted vegetables and simple meats and fish.", "author": {"@type": "Person", "name": "Francis Lam"}, "image": "https://static01.nyt.com/images/2018/05/13/magazine/13Eat2/13Eat2-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "1 3/4 cups.", "recipeCuisine": "chinese", "recipeCategory": "sauces and gravies", "keywords": "peanut oil, scallion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 355}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 602, "unsaturatedFatContent": "57 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "64 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "4 grams", "sodiumContent": "412 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup peanut or vegetable oil, plus more if needed", "1 pound scallions (3 to 4 bunches)", "2 teaspoons kosher salt, or to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a tall-sided saucepan, heat the oil over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the roots from 2/3 of the scallions, and cut them into 1-inch pieces. Pulse the scallions in a food processor until finely minced. (You may need to scrape down the sides once or twice.) Add 3/4 to 1 teaspoon kosher salt, and pulse until wet and puréed. Carefully add the purée to the oil (the oil should be warm, not hot, but be careful of splatters)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat to high, and cook, stirring, until it reaches a boil. Turn the heat down to maintain a mellow but insistent sizzle. Cook, stirring every few minutes to make sure the bottom and sides aren’t sticking and browning, until the purée is army green, just starting to take on brownish tones, and goes from thick and clumpy to very liquid in the pot, around 35 minutes. In truth, it’s ugly. (You can cook it further to get a more browned, caramelized flavor if you like, but don’t let it get dark.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, trim the roots off the remaining scallions, and cut them into 1-inch pieces. Pulse them in the food processor until they are finely minced but not puréed. Remove the scallions to a bowl and stir in another 3/4 to 1 teaspoon salt. When the purée in the pot is ready, carefully stir in the minced scallions, and turn the heat up to high. Bring it back to a boil, stirring, and then remove the sauce to a heatproof bowl to cool to room temperature. When it has cooled, taste, and add more salt if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Store in a jar, topping it with a little oil if necessary to keep everything submerged. The sauce keeps, refrigerated and under oil, for a couple of weeks."}]}