{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Bulgur and Pomegranate Salad", "description": "This colorful and flavorful mountain of bulgur, flecked with pomegranates, walnuts and herbs, is typical of the out-of-the box thinking of the chef Ori Menashe. He learned how to char vegetables in a heavy pan from chefs from Mexico City, who did a pop-up at his Los Angeles restaurant Bestia before it opened and showed him their technique for adding a smoky flavor to rice. (Libyan and Egyptian cooks also have started stews this way for centuries.) Just be careful about the hot pepper as it chars; it might make you cough, so keep the window open for the 6 minutes it takes to do this. This recipe yields 8 cups of cooked bulgur, but you only need 6 cups for the salad. Use those leftover 2 cups in other salads or add them to soups for heft and texture.", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2018/09/12/dining/12orirex1/12orirex1-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, lunch, grains and rice, salads and dressings", "keywords": "appetizer, side dish, bulgur, pomegranate molasses, pomegranate seeds, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "recipeIngredient": ["1/2 large yellow Spanish onion, peeled and quartered", "1 celery stalk, halved crosswise", "1 small carrot, peeled and halved crosswise", "3 fresh bay leaves (or use 1 dried)", "1 Fresno or Serrano chile, halved lengthwise", "2 tablespoons kosher salt", "1 pound coarse bulgur (about 2 2/3 cups)", "1/4 cup red wine vinegar", "1 teaspoon minced shallot", "1/2 teaspoon kosher salt", "1/4 teaspoon ground black pepper", "1/2 cup extra-virgin olive oil", "1 cup pomegranate seeds", "1 cup toasted walnuts, roughly chopped", "4 tablespoons finely diced red onion", "1/2 cup fresh mint leaves, roughly chopped", "16 fresh basil leaves, torn into small pieces", "Kosher salt and black pepper", "1/2 cup crème fraîche", "1 garlic clove, finely minced", "1 Serrano chile, seeded and finely minced", "4 tablespoons fresh dill, finely snipped", "1 teaspoon pomegranate molasses"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the bulgur: In a large, dry heavy pan over high heat, use tongs to char the onion, celery, carrot, bay leaves and chile until completely burnt, about 6 to 8 minutes. Add 8 cups of water and the salt, and cook until reduced by half, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the bulgur in a large bowl. Strain and pour the hot charred vegetable stock over the bulgur. Stir the bulgur and cover with plastic wrap until all the liquid is absorbed, about 30 minutes. (Drain the bulgur if there is any water left in the bowl.) This will yield about 8 cups bulgur. (You can use extra bulgur for a side dish, toss it into salads, like tabbouleh, or add it to soups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the vinaigrette: Mix the vinegar and shallot in a small bowl and set aside for 10 minutes. Sprinkle with the salt and pepper, then slowly drizzle in the olive oil while whisking until the dressing is emulsified."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the salad: In a large bowl, mix 6 cups of the bulgur, the pomegranate seeds, walnuts, red onion, mint and basil. Season with salt and pepper to taste. Add the vinaigrette and toss until just incorporated, but don’t overmix. Taste and adjust the salt as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the crème fraîche, garlic, chile and dill and spread the mixture on the bottom of a serving platter. Pile the salad on top and finish with a drizzle of pomegranate molasses and a pinch more pepper."}]}