{"@context": "http://schema.org", "@type": "Recipe", "name": "Toasted Coconut Rice With Bok Choy and Fried Eggs", "description": "Coconut oil toasts rice grains, lightly coats vegetables, and sizzles eggs in this dish, lending its unique tropical taste and richness. You get an extra dose of richness if you leave the egg yolks runny and cut and swirl them into the rice and greens mixture. If you’re vegan, you can fry tofu or tempeh in the coconut oil instead. If you’re gluten-free, you can use tamari in place of the soy sauce. Here, too, feel free to use prepackaged, trimmed haricots verts if you're short on time, or wax beans, in place of the green beans.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/08/17/dining/coconut-rice/coconut-rice-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, grains and rice", "keywords": "bok choy, green beans, jasmine rice, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 196}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 183, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "10 grams", "sodiumContent": "569 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 large eggs", "3 tablespoons coconut oil", "2 cups jasmine or other medium-grain rice (12 ounces), rinsed and drained", "Kosher salt", "8 ounces bok choy", "6 ounces green beans", "Toasted sesame seeds, soy sauce and Sriracha, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take your eggs out of the fridge so they won’t be ice-cold when you fry them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 tablespoon of the oil in a large Dutch oven or other heavy pot over medium-high heat. Add the rice, sprinkle with salt, and cook, stirring frequently, until the grains start to look translucent and smell toasty, about 3 minutes. Add 3 cups water and bring to a boil. Reduce the heat to low, cover, and steam for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, trim the bok choy and green beans. If the bok choy are large, halve them lengthwise, then cut into 3-inch pieces crosswise. Scatter the green beans over the rice (the water will be mostly absorbed) and sprinkle with salt. Spread the bok choy on top of the beans and season with salt. Drizzle or dollop 1 tablespoon oil over the greens. Cover and steam until the greens and rice are tender, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rice is almost done, heat the remaining tablespoon oil in a large nonstick skillet over medium-high heat until very hot. Crack the eggs into the pan and fry until the whites are set and the yolks runny, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the rice and vegetables among 4 dishes. Slide an egg onto each. Sprinkle with sesame seeds, and season to taste with soy sauce and Sriracha."}]}