{"@context": "http://schema.org", "@type": "Recipe", "name": "Cocoa-Cornmeal Biscotti", "description": "Everything about these biscotti tends toward crunch – their signature double bake, of course, but also the addition of almonds and some cornmeal, which doesn’t lose its appealing roughness under heat. (Don’t think, as I mistakenly once did, that using a polenta-type cornmeal will improve these cookies — it will only make them gritty; choose a fine-grain meal.) The chocolate chips are there to reinforce the deep chocolate flavor the cookies get from being made with cocoa. I like these very crunchy, but if you prefer them less set, give them a shorter second bake. And after the first bake, when the logs have cooled for about 20 minutes, use a long serrated knife and a gentle sawing motion to slice them into cookies about 1/2-inch thick. Hold on to the inevitable crumbs and any little bits that might break off — you’ll be happy to have them over ice cream.<strong></strong>", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/06/24/magazine/24Dessert/24Dessert-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "About 46", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "cocoa powder, cornmeal, mini chocolate chips, sliced almonds, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 75, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "2 grams", "sodiumContent": "43 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups (204 grams) all-purpose flour", "1/2 cup (42 grams) unsweetened cocoa powder", "1/2 teaspoon fine sea salt", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/4 cup (42 grams) finely ground cornmeal", "1 stick (113 grams) unsalted butter, at room temperature", "1 cup (200 grams) sugar", "2 large eggs, at room temperature", "1 teaspoon pure vanilla extract", "1/2 cup (87 grams) mini semisweet chocolate chips", "1/2 cup (50 grams) sliced almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven, and heat it to 350. Line a baking sheet with parchment paper or a silicone baking mat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the flour, cocoa, salt, baking powder and soda together; whisk in the cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a mixer (using a paddle attachment, if you have one), beat the butter and sugar together on medium speed until creamy and smooth, about 3 minutes. Add the eggs one at a time, beating for 1 minute after each egg goes in. Beat in the vanilla extract. Turn the mixer off, and add the flour-cornmeal mixture all at once. Pulse the mixer a few times to begin incorporating the ingredients without having them fly about, and then mix on low speed until they disappear into the dough. Mix in the chips and almonds. The dough will be thick and heavy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape half the dough onto one long side of the baking sheet. Using your hands and a spatula, shape the dough into a log about 12 inches long and 1 1/2 inches wide — perfection is impossible, so just get close. The log will be bumpy and rough, and that’s fine. Form a second log on the other side of the sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 25 minutes, rotating the sheet after 15 minutes. The logs will have spread; they’ll give when squeezed and won’t be fully baked at this point. Transfer the baking sheet to a rack, and allow the logs to rest for 20 minutes. Carefully move one log to a cutting board. (If the parchment on the baking sheet is sticky, turn it over or replace it.) Using a serrated knife, trim the ends and then cut the log horizontally into 1/2-inch-thick slices. Stand the slices up on the baking sheet — you don’t have to leave much room between them; repeat with the second log."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cookies for another 15 minutes — they’ll be firmer, but not completely dry; they firm and dry as they cool. Transfer the baking sheet to a rack, and allow the cookies to come to room temperature. Kept covered and away from humidity, the cookies will hold for at least 1 week."}]}