{"@context": "http://schema.org", "@type": "Recipe", "name": "Root Beer Semifreddo", "description": "The list of ways to put root beer to use is fairly brief. A root beer float or granita are obvious options, as is making a Cuba libre (cola, rum and ice) with root beer instead. Root beer can also be used as the basis for a barbecue marinade, best made by first reducing and concentrating the drink. I took bits of some of these applications to make a frozen dessert, a semifreddo that’s got root beer every which way. The root beer is reduced and infused with spices, then used to make a custard and mixed with whipped cream and egg whites. There is also some birch or maple syrup to enhance the texture as well as the flavor, and rum to spike the sauce of apricots poached in — you guessed it — root beer.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apricots, birch syrup, dark rum, juniper berries, root beer, dessert, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 231, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "8 grams", "sodiumContent": "53 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 12-ounce bottles root beer, preferably made with cane sugar", "1 teaspoon whole allspice", "1 teaspoon juniper berries", "1 teaspoon coriander seeds", "2 teaspoons vanilla extract", "3 large eggs, separated", "4 tablespoons birch syrup or maple syrup, preferably grade B", "1 1/3 cups heavy cream", "1/4 cup dark rum", "4 firm but ripe apricots, pitted and cut in eighths"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 6-cup metal loaf pan with parchment paper, leaving generous overhang on the sides. Place in freezer. Place root beer in a saucepan and bring to a simmer. Crush allspice, juniper and coriander in a mortar and add. Boil root beer until reduced to 1 1/2 cups, about 25 minutes. Strain into a measuring cup. Add 1 teaspoon vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat egg yolks in a small saucepan. Gradually whisk in 1/2 cup warm reduced root beer. Place over low heat and whisk until steam starts to rise and mixture has thickened to custard consistency. Do not overcook. Place bottom of pan in bowl of ice and water to chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1/4 cup remaining root beer to a simmer in a small saucepan. Beat egg whites until softly peaked. Very gradually beat in hot root beer and continue beating about 3 minutes until firmly peaked. Slowly beat in 3 tablespoons syrup. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat cream until it holds peaks. Beat in remaining syrup. Fold egg yolk mixture into whipped cream, then fold in egg white mixture. Spread in pan, overlap paper to cover and freeze at least 6 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 3/4 cup reduced root beer in a saucepan with apricots. Simmer 5 minutes. Add rum and remaining vanilla. Refrigerate. To serve, unmold semifreddo onto a chilled platter, peel off paper and cut in slices. Spoon apricot sauce alongside each portion."}]}