{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Dumplings", "description": "Heartier than chicken soup, this classic comfort dish is decidedly more stewlike, thanks to a golden-brown roux, a densely flavored chicken broth, and, of course, the dumplings. Think of them as a biscuit meeting a matzo ball: fluffy little clouds made from a quick mixture of flour, baking powder, buttermilk, butter and an egg for springiness. They’re cooked right on top of the chicken stew, partly poaching and partly steaming.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/11/20/dining/ar-chicken-and-dumplings/ar-chicken-and-dumplings-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, poultry, soups and stews", "keywords": "chicken thigh, leek, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1387}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 668, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "6 grams", "proteinContent": "33 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1035 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds bone-in, skin-on chicken thighs", "Kosher salt and freshly ground black pepper", "2 tablespoons vegetable oil", "1 large yellow onion, diced", "4 stalks celery, chopped", "6 medium carrots (about 1 1/2 pounds), peeled and sliced 1/4-inch thick", "4 sprigs thyme", "1 tablespoon unsalted butter, plus more as needed", "1/4 cup all-purpose flour", "2 large leeks, white and light green parts thinly sliced", "1 1/2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "3/4 teaspoon kosher salt", "1/4 teaspoon freshly ground pepper", "3/4 cup buttermilk", "1 large egg", "2 tablespoons unsalted butter, melted", "1/2 cup parsley, tender leaves and stems, finely chopped (optional)", "1/4 cup chives, finely chopped (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken on both sides with salt and pepper. Heat oil in a large Dutch oven over medium-high heat. Working in batches if needed, sear chicken, skin-side down, until deeply golden brown, 8 to 10 minutes. Flip chicken and continue to cook until it is browned on the other side, another 5 to 8 minutes. Transfer chicken to a large plate, and pour off all fat into a measuring cup. (You should have about 5 tablespoons, depending on the fattiness of the chicken.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving all the browned bits in the pot, return 2 tablespoons of fat to the pot. Add onions, celery and half the carrots. Season with salt and pepper and cook on medium heat, stirring to scrape up all the bits on the bottom of the pot. Cook until vegetables start to soften, about 4 minutes or so. Return chicken to the pot along with thyme and 8 cups of water. Simmer, uncovered, until chicken is completely tender and liquid has reduced by about 1/4, about 30 to 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken to a plate or cutting board to cool. Strain the stock (you should have about 5 cups; if you have less, you can add water to make up the difference) and wipe out the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 3 tablespoons chicken fat along with 1 tablespoon butter (if you don’t have enough chicken fat, use enough butter to equal 4 tablespoons of fat) over medium heat. Sprinkle in flour and stir constantly until it’s all a pale golden brown, about 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly whisk in reserved chicken stock until no lumps remain (it will thicken considerably at first) and bring to a boil. Add leeks and remaining carrots, season with salt and pepper and lower the heat to simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard the skin and bones from the chicken. Shred the meat and add to the pot. Cook, stirring occasionally, until liquid is nicely thickened and carrots and leeks are tender, 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dumplings: In a medium bowl, whisk together flour, baking powder, salt and pepper. In a small bowl, whisk together buttermilk and egg and add to dry ingredients, followed by melted butter. Using a wooden spoon or spatula, stir just to combine. (Do not overmix.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon, drop generous quarter-size dollops of the dumpling dough into the pot (they should just sit right on top; they will not sink), spacing them apart as much as possible (it’s O.K. if they touch). Cover the pot and reduce heat to low. Cook, undisturbed, until the dumplings are puffed and totally cooked through, 18 to 22 minutes. (Test a dumpling by cutting it in half; it should look slightly biscuity, but with no raw bits of dough. If it needs more time, continue to cook.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lid and divide among bowls; sprinkle with parsley and chives, if using."}]}