{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Brown Butter and Parmesan", "description": "Sometimes you just want a big bowl of pasta with butter and Parmesan. Starchy, silky and salty, it’s always good — and practically foolproof. To make it a little more grown up, just take it one step further: Brown the butter. When you slide the butter into the skillet, let it cook until the milk solids turn a toasty brown. It adds a rich, nutty flavor that makes the dish a bit more sophisticated with very little extra work.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/02/05/dining/as-brown-butter-pasta-print/merlin_150298908_b992b854-cd91-4306-b1ad-5428bfad8614-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "easy, quick, weekday, pastas", "keywords": "butter, parmesan, pasta, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 881}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 751, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "82 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "4 grams", "proteinContent": "26 grams", "saturatedFatContent": "21 grams", "sodiumContent": "416 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Kosher salt", "1 pound spaghetti, linguine or other long noodle", "8 tablespoons unsalted butter", "1 cup freshly grated Parmesan, plus more for serving", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water (2 heaping tablespoons kosher salt to about 7 quarts water) to a boil. Add pasta to boiling water and cook according to package directions until al dente. Reserve 1/2 cup of the pasta cooking water, then drain the pasta, but don’t shake it fully dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet or Dutch oven large enough to hold the pasta (and preferably with a light-colored bottom so you can see the butter solids brown), melt the butter over medium heat. Cook, swirling occasionally, until the foam subsides, the milk solids turn golden-brown and it smells nutty and toasty, 3 to 4 minutes. (Watch carefully to see that it does not burn. If it does, start over.) Remove from heat immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked pasta to the skillet and toss with the brown butter. Stir in the cheese until melted. Stir in pasta water, 1 tablespoon at a time, until the pasta is glossy with sauce (you probably won’t need the full 1/2 cup)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with black pepper and more Parmesan on top."}]}