{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Cookies With White Chocolate and Cherries", "description": "Brownielike and soft-centered, these fudgy cookies are packed with dried cherries, nuts and chocolate chips. Feel free to substitute your favorite nuts and dried fruit for pecans and cherries, or leave them out entirely and add more chocolate chips (no one ever objects to more chocolate). Be sure to use bittersweet chocolate, or the cookies may end up cloying. The higher the percentage of cocoa solids in your chocolate, the less sweet it will be.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/02/14/dining/14appetite2/merlin_133329399_cda21c8d-685b-4203-8d1f-88f859464d1b-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 2 dozen cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "bittersweet chocolate, chocolate chips, dried cherries, white chocolate chunks, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 232}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 128, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "4 grams", "sodiumContent": "73 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces/227 grams bittersweet chocolate, 60 percent to 72 percent cocoa solids, chopped", "6 tablespoons/85 grams unsalted butter, cut into cubes", "1/3 cup/42 grams all-purpose flour", "1 tablespoon/7 grams unsweetened cocoa powder, either Dutch-process or natural", "1 teaspoon baking powder", "1/2 teaspoon fine sea salt", "2 large eggs, at room temperature", "3/4 cup/150 grams granulated sugar", "2 teaspoons vanilla extract", "1/3 cup/56 grams white chocolate chunks or chips", "1/3 cup/56 grams bittersweet chocolate chunks or chips", "1/3 cup/60 grams dried cherries", "1/3 cup/42 grams pecan halves", "Flaky sea salt, for topping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees and lightly grease 2 or 3 baking sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy saucepan set over low heat, melt chocolate and butter over low heat, stirring constantly. (Make sure to scrape sides and bottom of pan to prevent scorching.) Once melted, remove from heat, stir well and set aside to cool slightly. (You can also melt the butter and chocolate together in the microwave on low heat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together flour, cocoa powder, baking powder and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, using an electric mixer fitted with the whisk attachment, beat eggs and sugar until mixture is pale and very fluffy, about 2 minutes. Beat in vanilla extract. Scrape melted chocolate into egg foam and beat until just incorporated, scraping down sides of mixer bowl with a rubber spatula. Beat in flour mixture until no traces of flour remain, scraping sides of mixer bowl with spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, fold in chips, cherries and nuts. Drop scant tablespoons of batter, 2 inches apart, onto prepared baking sheets. Sprinkle with sea salt if you like. Bake until slightly risen and a thin crackling crust forms on the tops of cookies, 9 to 13 minutes, depending on size. Do not overbake; the cookies can dry out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a metal spatula, immediately transfer hot cookies to a wire rack. Let cool completely before serving."}]}