{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Rice (Arroz Verde)", "description": "There are many ways to make arroz verde, but most have something in common: a brightness and depth from the addition of plenty of fresh green ingredients, such as chiles and herbs. This recipe toasts the rice in oil first, then seasons it with a purée of onion, poblano, jalapeños and herbs. For a more complex dish, replace the cooking water with chicken stock or vegetable stock, and serve it with a side of soupy black beans.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/02/21/dining/00RICEGUIDE10/00RICEGUIDE10-articleLarge-v2.jpg", "totalTime": "PT55M", "recipeYield": "3 to 4 servings", "recipeCuisine": "mexican", "recipeCategory": "grains and rice", "keywords": "cilantro, parsley, poblano pepper, white rice, dairy-free, gluten-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 125}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 164, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "439 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 cup long-grain white rice, such as jasmine", "1/4 cup olive oil", "1/2 cup roughly chopped white onion (about half a small onion)", "1/2 cup roughly chopped poblano pepper, stemmed and seeded (about half a large poblano)", "1 jalapeño, stemmed, seeded and roughly chopped", "2 cloves garlic, peeled", "1/2 cup cilantro leaves", "1/4 cup parsley leaves", "1 teaspoon kosher salt, plus more to taste", "1 1/4 cups chicken stock or water", "1 lime, halved, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the rice a few times, until the water that drains from it runs almost completely clear. Set aside to drain well. Put the onion, poblano, jalapeño, garlic, cilantro, parsley and salt in a food processor with a splash of the measured stock or water if needed, to help the blades catch the ingredients and break them down. Purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a medium, heavy-bottomed pot over medium-high heat, then add the rice and stir well. When the grains are dry and toasted, and some are starting to color, about 5 to 10 minutes, add the mixture from the blender along with the remaining stock or water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the liquid comes to a rolling boil, give it a good stir, scraping at the bottom of the pot. Put a lid on the pot and turn the heat down to low. Cook for 15 minutes, then turn off the heat and let the rice rest for another 15 minutes before opening the lid. The green purée will have settled on the top of the rice, so gently mix it in as you stir and aerate the rice with a spatula. Taste, season with salt and serve with a wedge of lime."}]}