{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry Crumb Cake", "description": "For weekend entertaining, planning a menu that can be made in large quantities is essential. A host expecting weekend guests should shop ahead and, well before guests arrive, prepare the recipes that will keep, saving the most perishable for the last minute. Take this cake that Molly O’Neill brought into The Times in 1993, a confection that can play dessert as well as breakfast. As a dessert, slices of the cake can be garnished with whipped cream, a compote of fresh berries or ice cream. For breakfast, slices can be toasted and served with butter, fresh ricotta or marscapone, or warmed in the oven and served with fresh fruit.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "blueberries, dessert, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 410, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "9 grams", "sodiumContent": "315 milligrams", "sugarContent": "34 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3/4 cup all-purpose flour", "1/2 cup sugar", "1/2 teaspoon ground cinnamon", "1/2 teaspoon salt", "4 tablespoons cold unsalted butter, cut in pieces", "1/2 cup unsalted butter at room temperature, plus additional for greasing pan", "1 cup sugar", "2 eggs", "1/2 cup milk", "1 teaspoon vanilla extract", "2 cups plus 3 tablespoons all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon salt", "2 cups blueberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. To make the topping, combine the flour, sugar, cinnamon and salt in a bowl. Add the butter, and rub it in with your fingers until the mixture resembles coarse meal. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake, butter a 9-inch springform pan. Set aside. Using an electric mixer, cream the butter and sugar until very light and fluffy. Add the eggs one at a time, and beat well, stopping to scrape sides of bowl. Add the vanilla to the milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift 2 cups of the flour with the baking powder and salt. Add the flour mixture to the egg mixture alternately with the milk, beginning and ending with flour. Mix just until combined. Toss the blueberries with the remaining 3 tablespoons flour, and stir into the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the batter into the prepared pan and smooth the top. Sprinkle with the topping. Bake until cake springs back when touched in the center, about 1 hour. Put on a rack to cool for a few minutes. Run a small knife around the edge of the pan to loosen, and remove the sides of the pan. Let cool."}]}