{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Chicken Schnitzel With Smashed Cucumbers", "description": "If making chicken schnitzel sounds hard, perhaps it’s because you’ve never tried. The technique itself is so simple, effective and addictive that you might find yourself turning to it all the time. For the crispest crust, you'll want to keep the hot oil circling the schnitzel as it cooks, creating a little space between the crust and the chicken. As for the side, giving your cucumbers and green beans a good whack with the rolling pin opens them up and creates crevices that soak up the harissa and garlic. Be generous with the squeezes of lemon at the end. They'll bring the chicken and spiced cucumbers to their fullest flavor.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/16/dining/sc-schnitzel/sc-schnitzel-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "german", "recipeCategory": "dinner, weekday, poultry", "keywords": "chicken breast, cucumber, green beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 114}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 866, "unsaturatedFatContent": "50 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "68 grams", "fiberContent": "3 grams", "proteinContent": "32 grams", "saturatedFatContent": "13 grams", "sodiumContent": "605 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 small Persian or hothouse cucumbers (about 14 ounces)", "About 4 ounces green beans, trimmed and halved", "1 teaspoon kosher salt, plus more for seasoning", "4 garlic cloves, smashed", "2 eggs, lightly beaten", "1 1/4 cups unseasoned panko bread crumbs", "1/2 cup flour", "1/8 teaspoon cayenne pepper", "2 large chicken breasts (about 1 1/4 pounds), split in half crosswise and pounded 1/8-inch thick", "Black pepper, for seasoning", "Peanut oil, for frying", "1 teaspoon harissa", "2 lemons, halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Smash cucumbers with a rolling pin on a large cutting board, to split them open. Break into bite-size pieces. Smash the green beans and toss them with the cucumbers, salt and garlic and drain in a colander for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chicken: Line a baking sheet with parchment paper. Place the eggs, panko and flour in 3 separate shallow bowls. Season the flour with cayenne, and whisk. Season the chicken generously with salt and pepper. Heat a thin layer of oil (about 1/8 inch) in your largest skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As oil heats, dip the chicken breasts, one at a time, into the flour. Shake off any excess and dip into the eggs, turning to coat evenly. Shake off the excess and dip into the bread crumbs, gently pressing the panko so it adheres. Holding the chicken gently by the ends to keep the coating intact, transfer to the lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil sizzles, add the chicken, two at a time (if there’s space for them to fit completely flat, without overlapping) and swirl the pan to help the oil reach the sides and top of the chicken. When the bottom is golden brown, about 3 minutes, flip the chicken and swirl the pan again, cooking until both sides are golden brown, about 3 minutes more. When the chicken is golden brown and just cooked through, transfer to a paper towel-lined plate and sprinkle with salt. Repeat until all the chicken is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the cucumbers, green beans and garlic with the harissa. Serve alongside the hot schnitzel with a lemon half for squeezing all over."}]}