{"@context": "http://schema.org", "@type": "Recipe", "name": "Homemade Red Wine Vinegar", "description": "This simple recipe for homemade vinegar comes from Harry Rosenblum, a founder of the Brooklyn Kitchen and the author of “Vinegar Revival.” To make it, you’ll need a little raw, live, unpasteurized vinegar, or a vinegar mother (which you can buy online, or pick up from a vinegar-making friend). Be sure to aerate the wine before you start, which helps get it ready to ferment, and remember that the timeline in the recipe is a only a guide: The best way to get a sense what’s happening as your alcohol transforms into vinegar is to observe it and taste it frequently. Instead of red wine, you can also try the recipe with a rosé, sake, hard cider or your favorite beer. Just keep in mind that if the beverage has an alcohol content of 8 percent or lower, there’s no need to add water at the beginning.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/02/07/dining/07vinegarrex2/07vinegarrex2-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About 1½ quarts", "recipeCuisine": "", "recipeCategory": "", "keywords": "vinegar, wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 82, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": null, "fiberContent": null, "proteinContent": "0 grams", "saturatedFatContent": null, "sodiumContent": "4 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 750-milliliter bottle of good red wine", "½ cup live raw vinegar, or vinegar mother"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the wine into a clean, wide-mouthed half-gallon glass jar. Put the lid on and shake it well to aerate the wine. Remove lid, and add drinking water until the jar is about three-quarters full, along with the live raw vinegar or mother. Cover the jar with cheesecloth and keep the cloth in place with a rubber band."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leave the jar undisturbed in a dark place at room temperature for 3 to 4 weeks, checking regularly to see that a vinegar mother (a translucent, gelatinous disk) is growing on the surface, and no mold is forming. (If you see green, black or white mold, scrape it off; if it grows back, throw out the mixture and start over.) You should begin to smell vinegar after a few weeks, and can taste it every week or so to monitor the fermentation."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After about 2 months, when the alcohol has acidified, or when a taste of the vinegar makes your mouth pucker, it's ready to strain and bottle. (You can save the mother to begin a new batch.) The vinegar can be used as is, or aged in the bottle for up to a year to mellow its flavor."}]}