{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Eggs With Garlicky Green Rice", "description": "Fried eggs are a simple vegetarian staple. But set them on top of garlicky kale- and herb-flecked rice, and they form a deeply satisfying supper. This recipe is endlessly customizable: Go with what you have — reheated leftover rice works equally well as a fresh pot — or use any whole grain you have. The secret here is locking flavor into the grains by stirring in garlic herbs while the rice is warm. To finish, be generous with the lime — the acid brings all the flavors up a notch — and play around with your tolerance for garlic and heat. Lastly, don't be afraid to raid your fridge: Avocado or leftover beans would be right at home here, too.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/01/14/dining/sc-fried-eggs/sc-fried-eggs-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weeknight", "keywords": "cilantro, eggs, hot sauce, kale, parsley, rice, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 499}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 601, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "83 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "20 grams", "saturatedFatContent": "8 grams", "sodiumContent": "596 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups brown or white basmati or long-grain rice, rinsed and drained", "1/2 teaspoon kosher salt, plus more for seasoning", "2 tablespoons olive oil", "4 large eggs", "Black pepper", "1/2 small bunch kale, stems removed and leaves finely chopped (about 1 packed cup)", "1/2 bunch fresh cilantro, stems discarded and leaves finely chopped (about 1 packed cup)", "1/2 bunch fresh parsley, stems discarded and leaves finely chopped (about 1 packed cup)", "4 garlic cloves, finely chopped", "1 jalapeño, seeded and finely chopped", "4 small pink radishes or 1 large watermelon radish, thinly sliced", "4 ounces cotija cheese or queso fresco", "2 limes, cut in wedges", "Hot sauce, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook rice with 1/2 teaspoon kosher salt according to package instructions. Set aside, covered, to steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oil over medium in your largest skillet or griddle until glistening. Crack in the eggs and cook until golden-brown around the edges, about 2 minutes. Cover loosely using a lid or aluminum foil and cook until the whites are just set and the yolks are still runny but starting to set. (They’ll break and mingle with the rice in a beautiful way.) Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the eggs cook, fluff the cooked rice with a fork, then stir in the kale, cilantro and parsley. Add the garlic and jalapeño a little at a time and taste, adding more salt, garlic or jalapeño to your liking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon rice into shallow bowls and top with the fried eggs, radishes, cheese and lime wedges. Serve with your hot sauce of choice."}]}