{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Sausage and Parsley", "description": "This is a very simple if slightly stove-intensive dinner, a two-pot meal that comes together serially to achieve a hearty whole. I use sweet Italian sausage most of the time, but the hot varieties work as well, and always the richest chicken stock available — sometimes adding bouillon to my homemade stock for the extra oomph it provides. The key is stirring, stirring, stirring the rice as you add the stock, taking care to incorporate each ladleful entirely into the rice before adding more. Taste often at the end, and adjust the seasoning as you like, but do not stint on either the lemon juice or the parsley, as their brightness acts as a terrific foil to the rich, unctuous quality of the rice.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/01/21/magazine/21mag-eat1/21mag-21eat-t_CA0-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "grains and rice", "keywords": "arborio rice, italian sausage, parmesan, white wine, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1153}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 589, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "2 grams", "proteinContent": "22 grams", "saturatedFatContent": "13 grams", "sodiumContent": "959 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds sweet or hot Italian sausage", "2 tablespoons extra-virgin olive oil", "1/2 teaspoon kosher salt", "Freshly ground black pepper to taste", "5 to 6 cups chicken stock, ideally homemade", "1 to 2 tablespoons unsalted butter", "1 large onion, peeled and diced", "1 1/2 cups Arborio rice", "1/2 cup dry white wine", "1/2 cup packed and roughly grated Parmesan, plus more for serving", "1/2 of 1 lemon", "1/2 cup finely chopped Italian parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With the tip of a small, sharp knife, slit open the sausage casings. Crumble the meat into a wide, heavy skillet or Dutch oven, and set over medium heat. If the meat is not rendering enough fat to coat the bottom of the pan as it begins to cook, add olive oil, 1 tablespoon at a time, until the meat is frying gently, not steaming. Sprinkle the salt and pepper over the sausage, and cook, breaking up any large chunks of sausage and stirring occasionally, until the meat is opaque and crisp at the edges, approximately 10 minutes. Remove sausage from pan, and reserve 1 tablespoon of the rendered fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the stock into a medium saucepan or pot, and bring to a low simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the stock heats, return the heavy skillet or Dutch oven to medium-low heat, and add to it the 1 tablespoon reserved sausage fat and 1 tablespoon butter, or 2 tablespoons butter if you don’t want to cook with the sausage fat. When the butter foams, add the diced onion, and cook, stirring with a wooden spoon, until it is soft and translucent, approximately 5 to 7 minutes. Add the rice, and stir until well coated, adding another tablespoon of fat if necessary. Stir until translucent, an additional 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the heat under the rice to medium, and add the wine to the skillet. Stir until wine is absorbed, then reduce the heat slightly. Begin adding ladlefuls of hot broth to the rice, stirring constantly and allowing each addition to be absorbed before adding the next. Cook rice until it is tender but slightly chewy, approximately 20 to 30 minutes. You may not need all the broth. You may need more than you have; if additional liquid is needed, you can use boiling water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the skillet from heat, and add the cheese, stirring to mix it into the rice. Add the sausage to the rice, and stir again. Taste, and adjust seasonings with additional salt and pepper if necessary. Squeeze the lemon over the rice, and then mound the risotto on a large, warmed bowl. Scatter the parsley over the top, and serve immediately, with more grated Parmesan on the side."}]}