{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp With Hot Fennel Sausage and Polenta", "description": "Shrimp with hominy grits is a favorite in the American South. Polenta stands in for this spicy Italianate version, fortified with hot fennel sausage and tomatoes. For the best-tasting results, be sure to cook the polenta slowly for at least 45 minutes, and try to get freshly made sausages from an Italian deli or butcher shop.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/03/07/dining/07Kitchen1/merlin_133952385_3f8b007a-8844-4577-9608-2613e563ef9b-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, sausages, seafood", "keywords": "main course, polenta, sausage, shrimp, wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 304}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 552, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "3 grams", "proteinContent": "23 grams", "saturatedFatContent": "11 grams", "sodiumContent": "843 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups polenta", "Salt and pepper", "4 tablespoons butter", "2 tablespoons olive oil", "1 1/4 pounds large shrimp (about 24)", "1 cup diced onion", "8 ounces hot Italian fennel sausage, casings removed", "3 cloves garlic, minced", "Crushed red-pepper flakes, to taste", "1/2 teaspoon chopped rosemary or thyme", "1/2 cup white wine", "1/2 cup tomato purée (passata) or chopped tomato", "1/4 cup crème fraîche", "1/4 cup chopped scallions", "2 teaspoons chopped capers", "2 tablespoons chopped parsley", "1 teaspoon lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the polenta: Bring 8 cups salted water to a boil in a heavy-bottomed pot over high heat. Whisk in polenta, continuing to whisk as mixture begins to thicken, about 1 minute. Turn heat to low and let polenta cook slowly, whisking every few minutes for about 10 minutes. Turn heat to very low and continue to cook for least 45 to 60 minutes, stirring occasionally. If polenta gets too thick to stir easily, add a bit of water to obtain a porridge-like consistency. (When finished, there should be no raw cornmeal flavor.) Taste a cooled spoonful, then correct seasoning with salt and pepper. Turn off heat, whisk in butter and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the topping: Heat olive oil in a large, wide skillet over medium-high heat. When oil shimmers, add shrimp in one layer and season with salt and pepper. Cook for 1 minute, until lightly browned. Using tongs, turn shrimp over, season and cook for 30 seconds more. Remove with a slotted spoon and set aside. (Shrimp will not be fully cooked.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onion to pan and cook, stirring, until softened, about 5 minutes. Add sausage meat and cook, mashing with a large spoon to let sausage crumble into rough half-inch pieces. Continue cooking for 5 to 6 minutes, until mixture is lightly browned. Stir in garlic, red-pepper flakes and rosemary, and cook for 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine and tomato purée. Simmer for 1 minute and stir in crème fraîche. Turn off heat and check seasoning. Warm a large serving platter. In a small bowl, mix together scallions, capers, parsley and lemon zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, turn heat to high. Add reserved shrimp to sausage mixture and cook, stirring, for about 2 minutes, until shrimp are cooked through and sauce has thickened slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mound polenta into middle of platter. Spoon shrimp and sauce around polenta. Sprinkle with scallion mixture and serve. (Alternatively, place a large spoonful of polenta into individual plates or soup bowls and top with shrimp and sauce.)"}]}