{"@context": "http://schema.org", "@type": "Recipe", "name": "Brined Pork Chops With Fennel", "description": "Pork and fennel — both fennel seed and the bulb-shaped vegetable — are often companions, and the combination of flavors is quite delicious. For best results, let the chops soak for at least a few hours, preferably overnight, in a quickly made brine.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/09/19/dining/19Kitchenrex/merlin_143112966_794076ea-4143-4b36-ae1f-1b97390e7aa9-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 3 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, steaks and chops", "keywords": "fennel, parsley, pork chops, low-carb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 362}, "recipeIngredient": ["1/4 cup kosher salt", "2 tablespoons granulated sugar", "2 bay leaves", "6 black peppercorns, lightly crushed", "6 allspice berries, lightly crushed", "1 teaspoon fennel seeds, lightly crushed", "2 bone-in pork chops, about 12 ounces each", "2 tablespoons olive oil", "1 large onion, sliced 1/4-inch thick", "3 or 4 trimmed fennel bulbs, about 1 pound, sliced 1/4-inch thick", "Salt and pepper", "2 garlic cloves, minced", "1/2 teaspoon fennel seeds, crushed", "2 tablespoons roughly chopped parsley", "A few tender green fennel fronds", "Lemon wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the brine: Put salt, sugar, bay leaves, peppercorns, allspice and fennel seeds in a bowl. Whisk in 4 cups water to dissolve salt and sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pork chops in one layer in a glass or plastic container. Pour brine over to completely submerge chops. Cover and refrigerate for at least 2 hours, preferably longer, up to overnight. Remove chops from brine and pat dry. Discard brine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the chops: Heat oven to 400 degrees. Set a wide, heavy skillet over high heat and add olive oil. When oil is wavy, add chops in one layer and let brown for about 3 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chops from pan and set aside. Reduce heat to medium-high and add sliced onion and fennel, stirring to coat with oil. Season with salt and pepper and cook, stirring, until beginning to color, about 5 minutes. Stir in garlic and crushed fennel seeds and turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the chops on top of the onion-fennel mixture (alternatively, transfer all of it to a baking dish) and place pan, uncovered, in oven for 20 to 25 minutes, until the internal temperature of chops is 140 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chops and let rest for about 5 minutes. Transfer onion-fennel mixture to a platter and keep warm. Cut chops into 1/8-inch slices and add to platter. Sprinkle with parsley and garnish with fennel fronds. Serve with lemon wedges."}]}