{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pan Shrimp Enchiladas Verde", "description": "If the only thing holding you back from making enchilada verde tonight is the idea of standing over the countertop, stuffing and rolling tortillas, read on. These layered lasagna-style enchiladas cut your work in half. Instead, put all your effort into making a nearly effortless verde sauce with pan-roasted tomatillos, jalapeño and onion. Once that’s done, there is little to do but layer and simmer: The shrimp cooks in minutes in the tomatillo bath. For the best flavor, look for wild-caught Gulf or Argentine shrimp. Then, the only challenge here is deciding how to portion fairly for four people (hint: be generous). If you make this in cast-iron, store any leftovers in glass or plastic in the fridge — the sauce is too acidic to spend a long time in a cast-iron pan — and reheat lightly over a very low flame. (Note, too, that the sauce can be made up to two days ahead, and refrigerated.)", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/08/01/dining/sc-One-Pan-Shrimp-Enchiladas-Verde/sc-One-Pan-Shrimp-Enchiladas-Verde-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 451}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 581, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "8 grams", "proteinContent": "31 grams", "saturatedFatContent": "11 grams", "sodiumContent": "1227 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons vegetable oil", "8 corn tortillas", "1 jalapeño, seeds removed", "2 pounds tomatillos, husks removed (about 20 tomatillos)", "2 small red onions, peeled and sliced into rings", "1/2 bunch cilantro, leaves and stems, plus leaves for garnish", "1/2 to 1 teaspoon salt", "1 pound large shrimp, peeled, deveined and roughly chopped (patted dry if wet)", "6 ounces cotija or queso anejo, crumbled (about 1 1/2 cups)", "Mexican crema or crème fraîche, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in a large cast-iron skillet over medium-high heat. When hot, fry tortillas two at a time, until soft and lightly brown on the edges, about 30 seconds to 1 minute per side, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another tablespoon of oil to the pan, along with jalapeño and tomatillos. Increase the heat to high and cook, covered, until tomatillos and jalapeño are blistered and starting to wilt, about 8 to 10 minutes, stirring occasionally. Add about 3/4 of the onions, reserving a few slices for garnish, reduce the heat to medium and continue cooking until the onions are soft and the tomatillos start to slump. Remove from heat to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer tomatillos, onions and jalapeño to a blender along with most of the cilantro leaves and stems, and salt. Purée until completely smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another tablespoon of oil to the skillet and heat over medium heat. Carefully add a third of the sauce (it will sizzle) and lower heat to medium-low. Layer four tortillas, overlapping slightly, along the bottom of the pan. Sprinkle all the shrimp and half the cotija over tortillas. Drizzle in another third of the sauce, followed by the remaining tortillas, sauce and cotija. Cook, covered, over medium-low until shrimp is cooked through and the sauce is thickened and bubbly, and browning a bit around the edges, 5 to 7 minutes. Remove from the heat, sprinkle with sliced onions and cilantro and serve with crema or crème fraîche on the side."}]}