{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Honey Nut Mix", "description": "Almond, cashew, almond, cashew. Oh, a Brazil nut! There’s a kind of pattern to every nut mix, but in this one, each bite is a little different, pushing you to keep scooping for more surprises. It’s a roasted jumble of nuts (whichever you choose) and flavorful pops — a seed, a honey-crystallized cluster, a pebble of coarse sugar, a bite with swelling heat, then a salty one. Serve them next to olives and cheese at a party, keep a stash in your tote or office snack drawer, or tie a bag of them up with a bow.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/11/27/dining/as-hot-honey-nuts/as-hot-honey-nuts-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 6 cups", "recipeCuisine": "", "recipeCategory": "snack, finger foods", "keywords": "appetizer, honey, nuts, seeds, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 74}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 304, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "9 grams", "saturatedFatContent": "3 grams", "sodiumContent": "137 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 cups unsalted, roasted whole nuts (such as cashews, pecans, pistachios or a mix)", "1 cup seeds (such as pumpkin, sesame, millet, quinoa, sunflower, nigella or a mix)", "1/4 cup honey", "1 tablespoon unsalted butter or coconut oil", "1 teaspoon red-pepper flakes", "1 teaspoon kosher salt", "1 teaspoon turbinado sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees and line a baking sheet with parchment paper. In a large bowl, combine the nuts and seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a microwave-safe bowl, combine honey, butter, red-pepper flakes and ½ teaspoon salt. Microwave until the butter has melted, about 40 seconds. (Alternatively, you can melt the mixture in a small saucepan on the stove.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the honey butter over the nuts and seeds, and stir until well coated. Dump onto the prepared baking sheet and spread in an even layer. You want the nuts spread out as much as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, stirring occasionally, until the nuts are tacky and look and smell toasted, 20 to 25 minutes. Remove from the oven and immediately sprinkle over the remaining 1/2 teaspoon salt and all of the turbinado sugar. Let cool on the baking sheet, then transfer to a bowl and serve (or transfer to an airtight container, where they’ll keep for up to 4 days)."}]}