{"@context": "http://schema.org", "@type": "Recipe", "name": "Blistered Green Beans and Tomatoes With Honey, Harissa and Mint", "description": "It’s worth seeking out a well-seasoned cast-iron pan for this recipe as the heat will evenly distribute throughout the surface area helping to ensure beautifully charred, but tender vegetables. Smoky, earthy harissa is given a lift with the addition of honey and lime juice, which is tossed with the green beans and tomatoes and some butter to melt at the end of cooking. Serve with grilled sausages for a fast and flavorful summer meal.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/07/11/dining/colu-green-beans-horizontal/colu-green-beans-horizontal-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, vegetables", "keywords": "green beans, harissa, mint, main course, side dish, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 314}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 180, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "502 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons harissa", "2 teaspoons honey", "1 tablespoon lime juice (about 1/2 lime)", "Kosher salt", "2 tablespoons grapeseed or canola oil", "1 tablespoon olive oil", "1 pound green beans, trimmed", "10 ounces grape or cherry tomatoes", "1 tablespoon unsalted butter", "2 tablespoons roughly chopped mint", "Flaky salt for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine harissa, honey and lime juice. Stir together until combined and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large cast-iron skillet, heat 1 tablespoon of the grapeseed oil and the olive oil over medium-high heat. Add green beans and cook undisturbed until they began to char in spots, about 3 minutes. Continue to cook, tossing frequently, until beans are just cooked through and slightly blistered and browned in spots, about 5 to 6 minutes more. Some beans will be more cooked than others — that’s O.K. Season with salt and place beans in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 1 tablespoon grapeseed oil in the skillet. Add tomatoes and cook undisturbed until they also begin to char in spots, about 1 minute. Stir tomatoes frequently until they are just cooked through and some begin to burst, about 2 minutes more. They do not need to be totally cooked through. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove skillet from heat and add green beans. Add harissa mixture and butter and toss until everything is combined and butter is melted. Add in half of the mint and stir again. Spoon into a large bowl and scatter with remaining mint. Garnish with flaky salt, if using."}]}