{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Corn and Coconut Soup", "description": "A good corn soup is creamy and naturally sweet; an even better corn soup is spicy, refreshing and addictive. In this recipe, it’s the combination of shallots, garlic, ginger, chiles and coconut milk, rather than heavy cream or butter, that makes the soup at once cooling and rich. It’s a dinner in a bowl (and a vegan one at that), but it would surely welcome a side of steamed rice or salad of leafy greens. To serve, add garnishes that are any combination of spicy (extra fresh chile or store-bought chile oil), crunchy (toasted coconut, chopped peanuts or cashews, fried shallots) or fresh (torn cilantro, chopped scallions), and it’ll be even more dynamic.", "author": {"@type": "Person", "name": "Sarah Jampel"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/corn-soup/corn-soup-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, soups and stews", "keywords": "coconut milk, corn, ginger, red potato, fall, summer, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1399}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 482, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "22 grams", "sodiumContent": "1231 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 ears yellow or bicolor corn (or 5 cups frozen corn kernels)", "2 tablespoons olive oil", "2 shallots, thinly sliced into rings", "3 garlic cloves, minced", "1 (1-inch) piece ginger, peeled and minced", "1 serrano chile (or other chile), minced", "2 small red potatoes (6 to 8 ounces total), cut into 1/2-inch cubes", "2 1/2 cups vegetable broth (or 2 1/2 cups of hot water whisked with 1 1/2 teaspoons jarred bouillon)", "1 (15-ounce) can full-fat coconut milk", "1 tablespoon lime juice (from 1/2 lime)", "Kosher salt, to season", "Torn cilantro leaves, toasted coconut flakes, chopped roasted peanuts, crispy fried shallots, lime wedges and more sliced Serrano chiles, to serve (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the corn kernels off the cobs and transfer to a bowl. Using the back of a butter knife, scrape the cobs so that all of the milky juices collect in the bowl and the cobs look completely dry, like wrung-out sponges. Set aside. (If using frozen kernels, skip this step.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large stockpot over medium heat, heat olive oil. Add shallots, garlic, ginger and chile, and sauté, stirring occasionally, until soft and fragrant, 3 to 5 minutes. Add corn kernels and juices to the pot, and sauté until the corn is softer and brighter, about 3 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potato pieces, and stir to coat, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Now, pour in the vegetable broth and coconut milk. Bring to a boil, reduce to a simmer, cover, and cook for 8 to 10 minutes, until the potatoes are tender all the way through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use an immersion blender to roughly purée the soup, so that it’s creamy with some kernels of corn, chunks of potato, and chile flecks remaining. (Alternatively, ladle about half of the soup into a blender, blend until smooth, and return to the pot.) Season with lime juice and salt, and mix to combine. Ladle soup into bowls and garnish with toppings of your choice. "}]}