{"@context": "http://schema.org", "@type": "Recipe", "name": "Asparagus Frittata With Burrata and Herb Pesto", "description": "Frittata, the savory Italian egg dish, can be thick or thin, flipped in the pan or finished under the broiler. This one, slathered with creamy burrata and drizzled with herb-laden oil, is a rather deluxe version of the ideal, worthy of a weekend lunch or a late dinner.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/05/02/dining/02kitchen1/02kitchen1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "breakfast, brunch", "keywords": "asparagus, basil, burrata, parsley, low-carb, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 408}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 373, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "1 gram", "proteinContent": "15 grams", "saturatedFatContent": "10 grams", "sodiumContent": "352 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small bunch medium asparagus, tough bottoms removed", "1/2 cup extra-virgin olive oil", "1 cup basil leaves, plus a few small basil leaves for garnish", "1 cup flat-leaf parsley leaves", "Salt and pepper", "2 tablespoons unsalted butter", "8 large eggs, lightly beaten", "1/4 cup grated Parmesan cheese", "1 ball of fresh burrata, about 1/2 pound, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse asparagus, and pat dry. Cut into 1-inch pieces on the diagonal, or into julienne strips if preferred. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In blender or small food processor, purée olive oil, basil and parsley to make a thin pesto. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a 10-inch cast-iron skillet or other nonstick omelet pan over medium-high heat. When hot, add butter and swirl to coat pan, then add asparagus. Season with salt and pepper and cook, stirring for about a minute without browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly pour in eggs and stir with a wooden spoon, as if making scrambled eggs. Tilt pan and lift mixture at the edges to allow any runny egg from the top to make its way to the bottom. After 3 or 4 minutes, the frittata should be mostly set. Sprinkle with Parmesan cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay a lid over the skillet, and turn off the heat. Leave for a minute or so, until frittata is moist and just done. (Alternatively, place pan under a hot broiler for a minute or so.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set whole burrata in the center of frittata. Drizzle with herb pesto. Pierce burrata with tip of a knife and spoon contents over frittata. Cut frittata into wedges and serve directly from pan, garnished with basil leaves."}]}