{"@context": "http://schema.org", "@type": "Recipe", "name": "Limpin’ Susan (Okra Stir-Fry With Rice)", "description": "Limpin’ Susan is often called the wife of Hoppin’ John, the pilau of peas and rice that Gullah cooks have made for generations in the South Carolina Sea Islands and Lowcountry, and that is also common in the Caribbean. Like Hoppin' John, the dish takes many forms depending on whose kitchen you grew up in. Some recipes start with fried bacon and end with washed long-grain rice, onions and okra steaming over simmering water for 45 minutes. Others call for simmering everything in chicken stock, or mixing chicken broth and cornstarch, then mixing the broth into cooked rice. B.J. Dennis, a Charleston chef, likes his Limpin’ Susan more like a dry stir-fry, akin to what one might eat in Trinidad. The rice is cooked ahead of time, so liquid is fully absorbed and the grains remain distinct. This recipe is vegetarian, although Mr. Dennis likes to toss in a handful of chopped shrimp when the onions are softening.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2018/02/14/dining/14ricerex/merlin_133371555_0f743ef9-c670-4989-98e2-a8834ab2e221-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "2 to 4 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, weekday, grains and rice", "keywords": "hot peppers, okra, main course, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 686, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "125 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "299 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup cooking oil (coconut oil works well, but any neutral oil will do), plus more if needed", "2 cups sliced fresh okra (1/2 pound), about 1/2-inch thick", "1/2 cup finely chopped onions", "2 teaspoons minced fresh garlic", "1 teaspoon minced fresh ginger ", "1 to 3 fresh hot peppers, such as bird’s eye or habanero, added to taste", "1/2 teaspoon salt", "1/4 teaspoon black pepper", "3 cups cooked long-grain non-aromatic rice, such as Carolina Gold (about 3/4 cups uncooked; leftover rice is good)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour oil into an 8-inch skillet, adding more, if needed, to make sure it coats the entire bottom of the pan. Heat over medium to medium-high heat and add the okra. Cook, stirring occasionally, until okra is slightly browned and tender, about 4 minutes. Cover to allow okra to steam for a bit, until tender, about 1 to 4 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add everything else but the rice and cook for 2 minutes more, stirring frequently. Increase heat to high and add rice, stirring gently but constantly for about 2 minutes. If you want the rice to brown. like fried rice, you can cook the mixture longer. Taste frequently, and add more seasoning and oil throughout the process as needed. Serve hot."}]}