{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Mushrooms With Panko and Pecorino", "description": "These flavorful stuffed mushrooms come together quickly, which makes them great for entertaining. Crunchy panko bread crumbs, instead of the traditional sort, are combined with salty cheese, parsley and garlic, then spooned into mushroom caps and baked until crisp and golden. You can assemble them through Step 2 a few days in advance and pop them into the oven minutes before guests arrive. Pro tip: Don’t throw away the mushroom stems. Freeze them to add to your next pot of stock for unbeatable richness.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/12/12/dining/ch-stuffed-mushrooms/merlin_145792707_5738cf7c-c796-4474-9b3d-b5fc566f5436-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "About 24", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, mushroom, panko, parmesan, parsley, pecorino", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 516}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 34, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "54 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup panko bread crumbs", "1/4 cup finely grated Pecorino or Parmesan", "2 tablespoons finely chopped Italian parsley, plus more for garnish (optional)", "2 garlic cloves, pressed with a garlic press or grated", "4 tablespoons olive oil", "Kosher salt", "Black pepper", "12 ounces cremini or button mushrooms (about 24 mushrooms), stems removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and line a sheet pan with parchment paper. In a medium bowl, mix the panko bread crumbs, cheese, 2 tablespoons parsley,garlic, and 2 tablespoons olive oil and stir to evenly coat the bread crumbs. Taste and then season with salt and pepper. (You might not even want any salt, as the cheese can be pretty salty.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the mushrooms on the sheet pan, top sides down. Drizzle with 1 tablespoon olive oil and season with salt and pepper. Using a spoon, divide the seasoned breadcrumb mixture among the mushrooms (about 1 tablespoon per mushroom)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle the mushrooms with the remaining olive oil and transfer to the oven and bake until the tops are crisp and golden, about 15 minutes. Remove from the oven and allow to cool for about 5 minutes. Garnish with parsley, if using, and serve warm."}]}