{"@context": "http://schema.org", "@type": "Recipe", "name": "Sesame-Glazed Duck Legs With Spicy Persimmon Salad", "description": "Some Chinese cookbooks recommend steaming duck to tender perfection before roasting it to crisp the skin. It is a good technique to master, and works especially well with large moulard duck legs. You get moist tender duck, and a bonus pot full of rendered duck fat. (You can steam the duck up to 6 hours in advance of roasting it.) The accompanying salad of persimmons, oranges, pomegranate and daikon radish gets a kick from Serrano chile, lime juice, freshly grated ginger and sesame oil. Be sure to use Fuyu persimmons, which can be eaten unripe. (The long, pointy Hachiya persimmon must be completely ripe to be palatable.) It’s worth mixing up a batch of fragrant, flavorful Sichuan pepper salt, both for this recipe and to have a little extra on hand to use as an all-purpose seasoning; if you can’t find Sichuan peppercorns in a store, online spice merchants will have them.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/12/12/dining/12kitchrex1/merlin_147153477_bbde9239-c811-43a0-9c3c-bee9e3572de2-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "poultry", "keywords": "duck leg, persimmon, sichuan peppercorns, star anise, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 57}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 302, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "4 grams", "proteinContent": "7 grams", "saturatedFatContent": "6 grams", "sodiumContent": "421 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons Sichuan peppercorns", "3 tablespoons flaky salt", "6 duck legs (about 5 pounds), preferably moulard duck, trimmed of excess fat", "2 or 3 cinnamon sticks, lightly crushed", "12 star anise pods, lightly crushed", "1 tablespoon toasted sesame seeds, for garnish", "2 tablespoons soy sauce", "1 tablespoon toasted sesame oil", "1 teaspoon Chinese spicy fermented bean paste (doubanjiang)", "3 tablespoons brown sugar", "2 tablespoons freshly squeezed orange juice", "4 small Fuyu persimmons, peeled and cut in wedges", "2 navel oranges, peeled and cut crosswise into 1/4-inch rounds", "1 cup peeled and thinly sliced daikon radish or watermelon radish ", "1 or 2 Serrano chiles, to taste, seeded if you like and very thinly sliced", "2 tablespoons lime juice", "1 teaspoon finely grated ginger", "2 teaspoons toasted sesame oil", "Salt and pepper", "3/4 cup pomegranate seeds", "1/4 cup thinly sliced scallions", "1 bunch cilantro, top sprigs only, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make Sichuan pepper salt: Put Sichuan peppercorns and salt in a dry small skillet over medium-high heat. Shaking the pan and stirring frequently, toast mixture until fragrant, 2 to 3 minutes. Let cool, then grind coarsely with a mortar and pestle or spice mill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season duck legs all over with Sichuan pepper salt, then wrap and refrigerate for at least 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a steamer: Fill a large pot halfway with water and set a steamer basket 2 inches above the water. Place crushed cinnamon and star anise on the bottom of steamer basket, then lay seasoned duck legs on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with a lid and bring water to a hard boil over high heat. Reduce heat slightly to maintain a brisker simmer. (Check water level occasionally and add more boiling water as necessary.) Steam legs until tender when pierced with a thin-bladed knife, about 1 hour 15 minutes; start checking at 1 hour. Remove legs and set aside. (They may be left at room temperature for an hour or so before roasting, or you can steam the legs up to 6 hours before roasting and refrigerate, covered. Re-steam the refrigerated legs for 15 minutes to soften before proceeding.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Put legs on a rack set over a foil-lined baking sheet and roast uncovered for about 30 minutes, until skin begins to crisp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As legs roast, make the glaze: Whisk together soy sauce, sesame oil, bean paste, brown sugar and orange juice. Once the legs have been in the oven for 30 minutes, brush them generously with glaze and roast for 30 minutes more (for a total cooking time of 1 hour), brushing them again every 10 minutes. Transfer legs to a serving platter. Sprinkle with sesame seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salad: Put persimmons, oranges, daikon, chiles, lime juice, ginger and sesame oil in a mixing bowl. Season with salt and pepper, and toss gently to coat. Transfer salad to platter with duck legs. Drizzle with any remaining juices from bowl. Garnish with pomegranate seeds, scallions and cilantro sprigs."}]}