{"@context": "http://schema.org", "@type": "Recipe", "name": "Berry Apple-Butter Pie", "description": "The deliciously tart apple butter filling in this pie has a deep rosy color, bolstered by raspberries and blackberries. Apples with darker red skins will produce a filling that contrasts beautifully with the decorative golden brown crust: We opted to top the pie with triangle cutouts, but you could use any shape, or even substitute a woven lattice. You can make the apple butter up to 5 days ahead and refrigerate it in an airtight container, but the pie itself is best the day it is made. Store leftovers at room temperature, tightly covered with plastic wrap.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/11/14/dining/14Berry-apple-butter-pie/14Berry-apple-butter-pie-mediumThreeByTwo440.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "apple, blackberry, dessert, fall, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 265}, "recipeIngredient": ["8 to 10 medium red-skinned apples (about 4 pounds/1.8 kilograms), such as Rome, Jonathan, McIntosh, Gala, Cortland or Zestar, cored and diced", "1 cup/200 grams granulated sugar", "1 ¼ teaspoons ground ginger", "2 tablespoons cider vinegar", "½ cup/120 milliliters apple cider", "6 ounces/170 grams raspberries", "6 ounces/170 grams blackberries", "<a href=\"https://cooking.nytimes.com/recipes/1019713-perfect-pie-crust\">Perfect Pie Crust,</a> doubled, prepared for a fruit pie and chilled", "1 large egg", "Egg wash (1 large egg mixed with 1 tablespoon water), for finishing", "Turbinado sugar, for finishing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the apple butter: In a large pot over medium-high heat, combine the apples, sugar, ginger, cider vinegar and apple cider. Cook, stirring occasionally, until the apples begin to soften and break down, 25 to 30 minutes, reducing the heat as necessary to prevent scorching."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the raspberries and blackberries and stir to combine. Cook for 1 minute, stirring to prevent scorching, then turn off the heat. Use a potato masher or immersion blender to break the mixture down to a coarse purée, being careful not to turn it into a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pot to medium heat and continue to cook, stirring occasionally, until it thickens, 15 to 20 minutes; the apple butter is ready when you can dip a spoon into the pot and lift it out without any of the mixture dripping. You should have about 5 cups of apple butter. If you have too much, return it to the pot and continue to cook until you reduce it to 5 cups. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface and using a lightly floured rolling pin, roll out a disk of dough into a circle about ¼-inch thick. Starting at one end, gently roll up the dough onto the rolling pin. Unfurl the dough over a 9-inch pie plate, preferably ceramic, and press it in lightly, making sure it’s lining the plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the egg into the cooled apple butter until well combined. Pour into the prepared crust and smooth into an even layer. Refrigerate while you prepare the top crust, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out second disk of dough to ¼-inch thickness. Cut out triangles with 1-inch sides, or other similarly sized shapes, from the middle portion of the crust, leaving a 3-inch border. (You don't want cutouts on the portion you're going to crimp.) You can use a cutter, trace from a paper stencil or cut the shapes freehand with a paring knife. Place the cutouts at least ¾ inch apart. Remove and discard the cutouts, or egg wash them and use the same day to decorate another pie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pie from the refrigerator. Starting at one end of the top crust, gently roll up the crust onto the rolling pin. Gently unfurl the top crust onto the pie, aiming the portion with cutouts over the center of the pie. Trim away any excess crust with scissors, leaving ½ inch all the way around the outside rim of the pie plate. Pinch the edges together to seal, tuck them under, and crimp as desired. Return the pie to the refrigerator and chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crust chills, place a rack on the bottom shelf of the oven, and place a baking stone, if you have one, on the rack. Heat the oven to 425 degrees. Line a baking sheet with parchment paper or foil. Transfer the pie to the baking sheet, and egg wash the top crust. (Don’t egg wash the crimped edges; they’ll brown on their own.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with turbinado sugar and transfer the baking sheet to the oven, placing it directly on the baking stone if using. Bake until the top crust is evenly golden brown and the filling has puffed up slightly, 40 to 45 minutes. If the crust is browning too quickly, you can tent it with foil in the last 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool pie on a rack at least 40 minutes before slicing and serving. The pie is best the day it is baked; store leftovers at room temperature covered tightly with plastic wrap."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Berry Apple-Butter Pie", "description": "Berry Apple-Butter Pie", "thumbnailUrl": "https://static01.nyt.com/images/2018/11/14/dining/14Berry-apple-butter-pie/14Berry-apple-butter-pie-mediumThreeByTwo440.jpg", "uploadDate": "2018-11-07T19:08:38.000Z", "duration": "PT2M"}}