{"@context": "http://schema.org", "@type": "Recipe", "name": "Pecan Crunch Cream Cheese Poundcake", "description": "This is an exceptionally velvety and tender cake, reminiscent (in the best possible way) of the frozen pound cake you might buy at the supermarket. Perfected over many years by the expert baker Rose Levy Beranbaum (and published in her book “Rose’s Baking Basics’), its fine texture comes from cake flour and superfine sugar. A caramelized pecan and graham cracker coating lines the pan and provides delicious crunch, but it is optional.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/21leftovers-rex-poundcake/21leftovers-rex-poundcake-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "snack, cakes", "keywords": "cake flour, cream cheese, graham cracker, pecans, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 405, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "185 milligrams", "sugarContent": "30 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons unsalted butter, melted, more for greasing the pan", "3 whole graham crackers (5 by 2 1/4 inches, or 45 grams of crackers)", "1 scant cup/100 grams pecan halves", "1/4 cup plus 2 tablespoons/75 grams granulated sugar", "3 large egg yolks, at room temperature", "1/2 cup/120 grams full-fat sour cream", "1 teaspoon pure vanilla extract", "1 1/2 cups/150 grams sifted cake flour (not unbleached)", "3/4 cup/150 grams superfine sugar", "1/4 teaspoon baking powder", "1/2 scant teaspoon baking soda", "1/4 teaspoon fine sea salt", "6 tablespoons/85 grams unsalted butter, at room temperature", "2 tablespoons plus 2 teaspoons/42 grams full-fat cream cheese, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set an oven rack in the middle of the oven and heat the oven to 350 degrees. Grease a 9-by-5-inch loaf pan with butter and line with two pieces of crisscrossed parchment: Lay the first sheet in the pan, butter it lightly, then lay the other sheet across. Both pieces should extend a few inches above the edges of the pan, making a sling that you’ll use to lift the cake out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pecan crunch, if desired: Break the crackers into a few pieces and add to the bowl of a food processor. Add the nuts and sugar. Process until you have fine crumbs. Add the melted butter and pulse it in until evenly incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about half of the crunch mixture into the prepared pan and press it evenly across the bottom. Press the remaining mixture against the sides, stopping about 1 inch from the top of the pan: Begin by tilting the pan to one side and use a bench scraper or the flat side of a metal spatula to lift, spread and press the coating against the side of the pan. Without tilting the pan, repeat with the remaining three sides. Use the back of a small spoon to even the coating on the sides and against the corners of the pan. Cover with plastic wrap and refrigerate for at least 30 minutes, up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: In a medium bowl, whisk the egg yolks with 2 tablespoons sour cream and the vanilla, just until lightly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, mix the flour, sugar, baking powder, baking soda and salt on low speed for 30 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter, cream cheese and the remaining 6 tablespoons sour cream. Mix on low speed until the flour mixture is moistened. Raise the speed to medium and beat for 1 1/2 minutes. Scrape down the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Starting on medium-low speed, gradually pour the egg mixture to the batter in two parts, beating on medium speed for 30 seconds after each addition. Scrape down the sides of the bowl after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently spoon the batter into the crunch coating-lined pan and smooth the surface. Bake for 50 to 60 minutes, or until a tester inserted into the center comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the cake cool on a wire rack for 20 minutes. Use a small knife to dislodge the crunch coating at the corners and lift the cake out, using the parchment paper “sling.”"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool completely before gently removing the parchment and transferring to a serving plate or cutting board. (Or, wrap well and store at room temperature for 3 days or in the refrigerator for 5 days.) To serve, use a serrated knife to cut into 1/2-inch-thick slices."}]}