{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Pumpkin-Parmesan Polenta", "description": "This tangy polenta, inspired by the flavors of pumpkin ravioli, is as an easy side dish that can be made on the stovetop or in the slow cooker. For something a little lighter, omit the butter that cooks with the polenta and reduce the browned butter to 1/2 stick, or 4 tablespoons, or halve the recipe if you're not serving a crowd. At first, there will seem to be too much liquid, but the nice thing about cooking polenta in the slow cooker is the grain has time to hydrate, plumping and absorbing the water. When you whisk in the cream cheese at the very end, the texture should be glossy and creamy — loose enough to expand slowly when ladled onto a platter but not runny. If it's too liquidy for you, let it sit with the lid off for a few minutes and then whisk it more. If it's too thick, whisk in some boiling water.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2018/11/06/dining/sg-polenta/sg-polenta-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "About 10 servings", "recipeCuisine": "", "recipeCategory": "grains and rice", "keywords": "fall, winter, nutmeg, parmesan, polenta, pumpkin purée, sage, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 206}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 506, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "6 grams", "proteinContent": "18 grams", "saturatedFatContent": "19 grams", "sodiumContent": "558 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups/12 ounces traditional or stone-ground polenta (not instant or quick-cooking)", "2 (15-ounce) cans pumpkin purée", "12 tablespoons unsalted butter (1 1/2 sticks)", "1 1/2 tablespoons kosher salt, plus more for seasoning", "Black pepper", "1 thyme sprig", "1 bunch fresh sage (5 to 8 sprigs)", "1 teaspoon freshly grated nutmeg, plus more for topping", "8 ounces cream cheese, at room temperature", "10 ounces grated Parmesan (about 3 cups), plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Slow Cooker Method", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 6- to 8-quart slow cooker, whisk together the polenta with 10 cups of water, then whisk in the pumpkin. Scatter in 4 tablespoons butter, cut into bits; the salt; a generous amount of pepper; the thyme sprig; 1 sprig of the sage; and 1/2 teaspoon nutmeg. Cook on low for 6 hours, whisking once or twice if possible. (This can hold very well on warm for several hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the cream cheese into pieces and drop them into the polenta; whisk to melt the cream cheese and combine. Remove and discard the herb sprigs. Stir in the remaining 1/2 teaspoon grated nutmeg, then stir in the grated Parmesan. Taste and add more salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium skillet, melt the remaining 8 tablespoons butter over medium-high heat. Pick the leaves from the remaining sage sprigs, and when the butter is melted, drop them in. Cook the butter and the sage, swirling the pan often, until the butter solids start to turn medium-brown and smell toasty, 3 to 5 minutes. (Don’t walk away; butter goes from browned to burned in seconds.) Remove the pan from the heat immediately and swirl the browned butter-sage mixture into the polenta. Serve the polenta in a large platter or shallow bowl, topped with a bit more Parmesan and more nutmeg if desired."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Stovetop Method", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring 10 cups of water to boil over high heat. Add the polenta in a steady steam while whisking constantly. Reduce the heat to low or medium-low. (You want the polenta-water mixture to be steaming hot, but not boiling.) Continue to whisk constantly for about 3 minutes, until the polenta and water have formed a smooth mixture. Whisk in the pumpkin, 4 tablespoons butter, the salt, a generous amount of pepper, the thyme sprig, 1 sage sprig and 1/2 teaspoon nutmeg. Once all the ingredients are combined, cover and cook for 40 minutes, whisking well every 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the pot and cook for about 1 hour more, whisking every 10 minutes, until the polenta is smooth and tender, and the mixture has thickened and is creamy but not runny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the cream cheese into small pieces and drop them into the polenta; whisk to melt the cream cheese and combine. Remove and discard the herb sprigs. Stir in the remaining 1/2 teaspoon grated nutmeg and the grated Parmesan. Taste and add more salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the remaining 8 tablespoons of butter over medium-high heat in a medium skillet. Pick the leaves from the remaining sage sprigs and when the butter is melted, drop them in. Cook the butter and the sage, swirling the pan often, until the butter solids start to turn medium brown and smell toasty, 3 to 5 minutes. (Don’t walk away; butter goes from browned to burned in seconds.) Remove the pan from the heat immediately and swirl the browned butter-sage mixture into the polenta. Serve the polenta in a large platter or shallow bowl, topped with a bit more Parmesan and more nutmeg if desired."}]}]}