{"@context": "http://schema.org", "@type": "Recipe", "name": "A Spice Cookie to Share", "description": "The only thing better than a plate of cookies is one big cookie meant to be shared by everyone around the table. It’s the kind of dessert that will encourage your friends and family to linger at the table and to keep the conversation going. It’s a brown-sugar cookie redolent of ginger, honey, cinnamon and clove that carries the scent of the season and tacks between crisp and slightly chewy, between gingersnap and gingerbread. That it has ground coffee in it marks it as a sweet for grown-ups. It’s a roll-out cookie, but not a fussy one – any shape works and ragged is better than perfect. I usually sprinkle the cookie with sanding sugar, but you can drizzle it with melted chocolate or frost it, if you’d like. For extra fun, put out chocolate or caramel sauce (or both) and invite everyone to dip.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/12/23/magazine/23mag-ondessert-image2/23mag-ondessert-image2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "About 8 servings", "recipeCuisine": "american", "recipeCategory": "cookies and bars", "keywords": "coffee, honey, whole-wheat flour, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 54}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 290, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "8 grams", "sodiumContent": "87 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 cups (170 grams) all-purpose flour", "1/2 cup (68 grams) whole-wheat flour", "1 1/2 teaspoons ground coffee", "1 teaspoon ground cinnamon", "1 teaspoon ground ginger", "3/4 teaspoon ground cloves", "1 stick plus 1 tablespoon (4 1/2 ounces; 128 grams) cold, unsalted butter, cut into small pieces", "1/2 cup packed (100 grams) brown sugar", "1/4 cup (50 grams) sugar", "1/4 teaspoon fine sea salt", "1 large egg", "1 tablespoon honey", "Sanding sugar, for sprinkling (optional)", "Chocolate or caramel sauce, homemade or store-bought, for dipping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the flours, coffee and spices; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with a mixer fitted with a paddle attachment (or a hand mixer), mix the pieces of cold butter, both sugars and the salt on low speed for about 3 minutes, until the mixture forms clumps and then comes together. You’ll see pieces of butter here and there — you’re supposed to. Add the dry ingredients all at once, and then pulse the mixer on and off, just until the risk of flying flour has passed. Mix on low-medium speed until you’ve got a bowl of crumbs, about 3 minutes. Lightly whisk the egg and honey together. With the mixer on low, add the egg mixture gradually, and then continue to mix until the dough forms clumps. Squeeze a bit of the dough, and it will hold together. Reach into the bowl, and press the dough into a ball. Turn it out onto a sheet of parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the dough down, cover it with another sheet of paper and roll it out until it’s about 1/8-inch thick. It can be any shape — round, oval, rectangular, raggedy-edged or pristine. It will probably be about 12-by-15 inches, but the thickness is more important than the dimensions. Being neat doesn’t buy you anything with this cookie. Slide the sandwiched dough onto a baking sheet, and refrigerate it for at least 1 hour (or up to 3 days). If you prefer, you can wrap the dough well and freeze it for up to 2 months; keep it at room temperature for about 20 minutes before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you’re ready to bake, center a rack in the oven, and heat it to 350. Remove the top sheet of paper; leave the dough on the paper-lined baking sheet. If you’re using the sanding sugar, sprinkle the dough with about 2 tablespoons’ worth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cookie for 20 to 24 minutes — the edges will be darker than the middle. Press the center of the cookie, and it should be firm with just a tiny bit of give; it will feel firmer as you work your way out. Transfer the baking sheet to a rack, and allow the cookie to come to room temperature. If you’re not eating it immediately, you can wrap the cookie well, and keep it at room temperature for about 4 days. Make sure the room is dry — humidity is a crisp cookie’s nemesis."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "You can serve the cookie whole, letting everyone break off pieces (of course, there will be crumbs — they’re part of the cookie’s charm), or you can break or cut it in the kitchen and serve the pieces as you would any cookie. Chocolate or caramel sauce (or both) for dipping is optional, but scrumptious."}]}