{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Braised in Two Vinegars", "description": "In this satisfying weeknight recipe, boneless chicken thighs are cooked in best-quality balsamic and red wine vinegar and plenty of garlic, resulting in a pleasantly sticky agrodolce sauce. You could easily crisp some pancetta before the garlic hits the pan or stir in some anchovies right before you begin to braise. This dish can be made a day or two in advance and gently reheated with a splash of water or broth, but wait until right before serving to garnish it with the fresh herbs. (They'll lose their vibrant color otherwise.) Serve over <a href=\"https://cooking.nytimes.com/recipes/1014527-basic-polenta\">polenta</a> or <a href=\"https://cooking.nytimes.com/recipes/2083-rice-pilaf\">rice pilaf.</a>", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/07/11/dining/colu-vinegar-chicken-horizontal/colu-vinegar-chicken-horizontal-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "balsamic vinegar, chicken thighs, red wine vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1377}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 377, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "0 grams", "proteinContent": "45 grams", "saturatedFatContent": "3 grams", "sodiumContent": "699 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds boneless, skinless chicken thighs", "Kosher salt and black pepper", "2 tablespoons olive oil", "6 garlic cloves, peeled and smashed", "1/2 cup best-quality balsamic vinegar", "1/2 cup best-quality red wine vinegar", "1 tablespoon finely chopped Italian parsley (optional)", "2 teaspoons finely chopped oregano (optional)", "Flaky salt, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken well on both sides with salt and pepper. In a large sauté pan, heat olive oil over medium heat. Add garlic and cook until it starts to become fragrant and lightly golden, about 2 minutes. Remove with a slotted spoon and set aside. Begin cooking the chicken, making sure not to crowd the pan (you may need to do this in batches). Cook until the chicken is no longer pink on the outside and begins to lightly brown in spots, about 3 to 4 minutes per side. If it’s not cooked through at this point, that’s O.K."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you’ve cooked the chicken in batches, add all of the meat and any residual juices back to the pan. Pour in the vinegars, add reserved garlic and bring to a simmer. Turn heat to medium-low, cover and allow the meat to continue to cook in the sauce, about 5 to 7 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover and toss chicken well in the vinegar sauce to coat. Cook chicken about 3 to 5 minutes more or until the sauce has reduced by about half and has thickened slightly. Sprinkle with parsley and oregano, if using, and season with flaky salt, if using. Serve in bowls over polenta or with rice pilaf and spoon the remaining sauce atop."}]}