{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Ombré Pie", "description": "This impressive-looking pie is more like a traditional apple tart: Thin slices of apples are tightly arranged, then sprinkled with cinnamon and sugar. In the oven, the apples soften and create a delicious, jammy base inside a buttery, flaky crust. Grouping the slices by color creates a stunning ombré effect, but the rest of the recipe is simple to make up for the assembly time. The recipe calls for a generous number of apples to be sure you fill the crust; use any leftovers for snacking or to make applesauce. Store any leftovers at room temperature, wrapped tightly in plastic wrap.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/xxombreswap/xxombreswap-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "apple, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 555}, "recipeIngredient": ["<a href=\"https://cooking.nytimes.com/recipes/1019713-perfect-pie-crust\">Perfect Pie Crust,</a> prepared for a fruit pie and chilled", "2 medium red apples, such as McIntosh or Cortland", "2 medium pink apples, such as Jonagold, Gala or Fuji", "2 medium yellow-pink or green-pink apples, such as Golden Delicious or Northern Spy", "2 medium green apples, such as Granny Smith", "Lemon juice, as needed", "1 tablespoon unsalted butter, cut into 6 pieces", "¼ cup/50 grams granulated sugar", "¾ teaspoon ground cinnamon", "Pinch of fine sea salt", "Egg wash (1 large egg mixed with 1 tablespoon water)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface and using a lightly floured rolling pin, roll out a disk of dough into a circle about ¼-inch thick. Starting at one end, gently roll up the dough onto the rolling pin. Unfurl the dough over a 9-inch pie plate, preferably ceramic, and press it in lightly, making sure it’s lining the plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim so that there’s about ½ inch of excess dough hanging over the edge of the pie plate. (If the dough feels warm, refrigerate it for 15 minutes.) Tuck the excess dough under itself so it is flush with the edge of the pie plate; leave the pie like this for a straight-edge finish, or crimp as desired. Refrigerate for 30 minutes, and up to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack on the bottom shelf of the oven, and place a baking stone, if you have one, on the rack. Heat the oven to 425 degrees. Use a small brush to evenly paint egg wash on the edge of the crust. Cut a square of parchment paper and use it to line the crust. Fill with pie weights (or dried beans) up to the top edge. Place the plate on a baking sheet lined with parchment or foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the baking sheet to the oven, placing it directly on the baking stone if using. Bake crust until the outer edge is just starting to turn golden brown, 12 to 15 minutes. Remove the parchment and pie weights, and continue to bake until the base appears set, 2 to 4 minutes more. If the dough puffs up anywhere, you can puncture it with a fork. Cool the crust completely. Reduce the oven temperature to 375 degrees"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the crust cools, prepare the apples. Core and quarter each apple, then cut each quarter into slices about ⅛-inch thick. (See Note for tips on slicing.) Keep them together as best as possible and arrange them by color on a baking sheet. Squeeze lemon juice over the apples to prevent browning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the apples in the pie crust in an ombré effect, working from dark red to pink to yellow-pink to green. To do this, grab a few apples in one color at a time, and fan them out in your hand. Place them skin side up inside the crust, arranging them relatively tightly to ensure maximum coverage. You can cut or trim pieces smaller to fill in at the edges as needed. Repeat until the crust is full of apples. (Use the leftovers for another purpose.) Dot the surface with the butter and chill the pie while you heat the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the sugar, cinnamon and salt. When the oven has reached temperature, liberally sprinkle all of the cinnamon-sugar mixture over the top of the apples, in between them and around the edges. Use a small brush to evenly paint egg wash on any exposed crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the baking sheet to the oven, placing it directly on the baking stone if using. Bake until the crust is golden brown and the apples are soft, 25 to 30 minutes; start checking the pie after 20 minutes of baking to be sure it’s not cooking too quickly, which will cause the apples to brown too much and weaken the ombré effect. Let cool on a rack at least 20 minutes before serving. The pie is best the day it is baked."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Apple Ombré Pie", "description": "Apple Ombré Pie", "thumbnailUrl": "https://static01.nyt.com/images/2018/11/21/dining/xxombreswap/xxombreswap-mediumThreeByTwo440.jpg", "uploadDate": "2018-11-07T19:00:48.000Z", "duration": "PT1M45S"}}