{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Chicken Legs With Wild Mushrooms", "description": "A good roasted chicken is a simple pleasure, but a braised chicken dish is always more interesting. Here, dried wild mushrooms, smoked bacon and red wine perfume the sauce to give these chicken legs depth and character, with a flavor nearly similar to a game bird. Using turkey broth makes this braise even more heady. For a quick, concentrated broth, simmer 2 pounds of meaty turkey wings with 6 cups water for about an hour. Finding a dried wild mushroom is not like hunting for its fresh counterpart in the forest. Most Italian delis and nearly all supermarkets sell little packets of dried wild mushrooms.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/11/28/dining/28kitchenrex1/merlin_146065869_2d15c95d-3132-49e5-bfc6-7ed0e2c77a6c-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "bacon, chicken legs, morels, porcini, potato, wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 214}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 833, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "51 grams", "fiberContent": "5 grams", "proteinContent": "46 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1653 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 ounce dried porcini", "1 ounce dried morels", "6 large chicken legs (about 4 pounds)", "Salt and pepper", "4 tablespoons unsalted butter (1/2 stick)", "2 cups finely diced onion", "3 ounces thick-cut bacon, sliced crosswise 1/4-inch wide", "1 tablespoon tomato paste", "2 garlic cloves, minced", "Pinch of cayenne", "2 tablespoons all-purpose flour", "1 cup red wine", "4 cups turkey or chicken broth", "1 bay leaf", "1 large thyme sprig", "1 1/2 pounds small yellow-fleshed potatoes", "3 tablespoons chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse porcini with warm water (they are often sandy), then place in a small bowl, cover with hot water and soak until softened, about 15 minutes. In a separate bowl, soak the morels in hot water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Place chicken legs on a baking sheet in one layer. Season generously on both sides with salt and pepper. Roast, uncovered, for about 20 minutes, or until nicely browned. Remove and set aside. Turn oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: Melt 2 tablespoons butter in a Dutch oven or heavy-bottomed pot over medium-high heat. Add onions and cook, stirring, until softened and beginning to color."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bacon and tomato paste, stir to incorporate with onions, and cook for about 1 minute, then stir in garlic and cayenne. Sprinkle with flour and stir to coat. Add wine and cook for 1 minute, then whisk in turkey broth and bring to a simmer. The sauce will thicken slightly. Add bay leaf and thyme sprig. Drain porcini and morels and add to sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Submerge browned chicken legs in sauce and bring to a brisk simmer. Cover and transfer pot to oven. Bake for about 1 hour, until chicken is tender. Remove from oven and keep covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While chicken bakes, make the potatoes: Put potatoes in a saucepan and cover with 1 inch of water. Add 1 teaspoon salt and bring to a boil over high heat. Reduce to a brisk simmer and cook until tender, about 15 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain potatoes and let cool. Peel potatoes with a paring knife and return to saucepan. (Alternatively, potatoes may be peeled before cooking, or you may opt to leave skins on.) Add remaining 2 tablespoons butter and 1 cup water. Bring to a simmer over high heat to warm potatoes through, then set aside, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide legs among 6 warm plates. Spoon sauce and mushrooms over each serving. Sprinkle parsley over potatoes and place a few potatoes on each plate. Transfer remaining potatoes and buttery juices to a serving dish. Serve remaining sauce in a gravy boat if desired."}]}