{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Brownies With Tahini and Halvah", "description": "It was said that the recipient of the very first batch of these brownies polished them off, alone, in one sitting. There is no proof of this. What we do know is that they are vegan, deeply dark and fudgy. The recipe, which is based on one in Amy Chaplin's cookbook, “At Home in the Whole Food Kitchen,” uses everyday ingredients to reach that fudginess: olive oil (a proven amplifier of chocolate’s complexity) and dates (to round out the bitterness of the cocoa powder, and to act as a binder). But tahini and halvah are the two surprise players here, taking the recipe in a rich direction. The tahini disappears into the brownies, making them shockingly moist, while the halvah lends something familiar and unexpected. Regular almonds are fine; Marconas are better. You could replace the spelt flour with all-purpose for a less savory, more traditional effect.", "author": {"@type": "Person", "name": "Charlotte Druckman"}, "image": "https://static01.nyt.com/images/2019/02/11/dining/cd-vegan-brownies-with-tahini-and-halvah/merlin_150546963_0dd87ddb-109d-4d15-8af0-c1aed1081759-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "24 brownies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "bittersweet chocolate, coconut palm sugar, dates, halvah, spelt flour, tahini, dairy-free, vegan, vegetarian, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 195}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 245, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "3 grams", "sodiumContent": "166 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces/115 grams pitted dates (2/3 cup packed)", "2 cups/480 milliliters boiling water", "3/4 cup/180 milliliters extra-virgin olive oil, plus more for greasing the pan", "1 1/2 cups/270 grams spelt flour", "3/4 cup/90 grams unsweetened cocoa powder", "1 1/2 teaspoons baking powder", "3/4 cup plus 2 tablespoons/210 milliliters unsweetened almond milk or oat milk", "3/4 cup/180 milliliters maple syrup", "3/4 cup/120 grams coconut palm sugar (see Tip)", "1/2 cup/120 milliliters tahini", "1 tablespoon vanilla extract", "1/2 teaspoon fine sea salt", "4 ounces/115 grams vegan bittersweet chocolate, roughly chopped", "3 ounces/90 grams vegan halvah (see Tip), finely crumbled (about 2/3 cup)", "4 teaspoons white sesame seeds", "1/2 cup/70 grams finely chopped toasted Marcona almonds or roasted cashews", "1 teaspoon flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dates in a medium heatproof bowl and pour boiling water on top to cover. Let soak until dates are softened, about 20 minutes, then drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a 13-by-9-inch glass baking dish with parchment paper; brush paper and sides of pan lightly with olive oil and set aside. Sift flour, cocoa powder and baking powder into a large bowl; whisk to combine and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place drained dates, almond milk, maple syrup, coconut sugar, tahini, vanilla, fine sea salt and 3/4 cup olive oil in a food processor; blend until smooth. Pour into the sifted flour mixture and whisk just until combined. Fold in the chopped chocolate and halvah. Transfer the batter to the prepared baking dish and spread out in an even layer using an offset or rubber spatula. Sprinkle evenly with sesame seeds, then almonds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until edges pull away from the sides of the dish and a toothpick comes out clean, 30 to 40 minutes. Remove from oven, sprinkle with flaky sea salt and let cool completely. Refrigerate until cold and firm before cutting. Bring to room temperature before eating, or enjoy them cold, straight out of the fridge."}]}