{"@context": "http://schema.org", "@type": "Recipe", "name": "Herby Pork Larb With Chile", "description": "In this take on the classic Thai dish larb moo, ground pork is pan-cooked, then stirred together with a combination of funky fish sauce, fresh and dried chiles, shallots, lime juice and an abundance of fresh herbs for brightness. If you don't eat pork, ground chicken or turkey will work well in its place. Making the toasted rice powder is a little fussy, but it gives the dish an authentic nutty flavor and crunch. That said, if you skip it, it will still be delicious. If you have the time, top this dish with crispy shallots: It takes the whole thing to the next level, as does a flurry of chive blossoms when in season. Serve this spicy dish with <a href=\"https://cooking.nytimes.com/recipes/1014805-basic-sticky-rice\">sticky rice,</a> and grilled or roasted wedges of cabbage squeezed with lime, but for a low-key weeknight, plain white rice and lettuce leaves work just as well.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2018/07/11/dining/pork-larb-horizontal/pork-larb-horizontal-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, weekday, weeknight, meat", "keywords": "cilantro, fish sauce, ground pork, jasmine rice, mint, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 656}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 363, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "2 grams", "proteinContent": "22 grams", "saturatedFatContent": "9 grams", "sodiumContent": "780 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons jasmine rice", "1 large shallot, thinly sliced into rounds (about 1 scant cup)", "2 tablespoons fish sauce", "1/4 cup lime juice from about 2 to 3 limes, plus more for serving (optional)", "1/2 teaspoon sugar", "1 bird’s eye chile, thinly sliced", "1/2 teaspoon red-pepper flakes, plus more to taste", "3 scallions, thinly sliced", "1/2 cup torn mint leaves", "1/2 cup roughly chopped cilantro, leaves and tender stems", "1 pound ground pork", "Kosher salt", "Flaky salt (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium heat, toast the rice, stirring frequently, until it starts to smell nutty and turns golden in color, about 4 to 5 minutes. Transfer to a mortar and pestle or clean spice grinder and allow to cool for a minute or two. Grind or pulse the rice until it has a powderlike consistency. You should have about 1 1/2 to 2 tablespoons. Set aside and wipe out the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together shallots, fish sauce, lime juice, sugar, bird’s eye chile, chile flakes, half the scallions, half the mint and half the cilantro. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large skillet over medium heat, and add pork, breaking meat apart with the back of a wooden spoon or spatula. Cook until meat is no longer pink, but not browned, about 5 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pork from heat and allow to cool for about 5 minutes. Use a slotted spoon to transfer the pork to the bowl with the chile-herb mixture, add the rice powder and stir together until combined. Season with kosher salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " Top with remaining herbs and serve. Season with flaky salt and an extra squeeze of lime, if desired."}]}