{"@context": "http://schema.org", "@type": "Recipe", "name": "Chorizo Sloppy Joes With Kale and Provolone", "description": "Matthew Hyland — a chef and owner of the Emily and Emmy Squared restaurants in New York — is known for making exemplary pizza and hamburgers. But his sandwich game is strong as well. This one recalls the flavors that he and Emily first experienced as college students in Bristol, R.I., which has supported a sizable Portuguese community since at least the late 19th century. It is a sloppy Joe of sorts, built on a base of crumbled Mexican-style chorizo, which Hyland uses in place of chouriço, a Portuguese sausage also spiced with paprika and garlic. He uses chorizo because he can’t regularly find chouriço in his neighborhood stores. I can, sometimes. Other times, not, and I can’t find Mexican chorizo either. Then I use Guatemalan chorizo instead. It’s a great sandwich whichever member of the chorizo family you use. Do not stint on the olives, banana peppers or celery seeds. The celery seeds especially, a nod to one of the toppings scattered on a Rhode Island “New York System” hot dog, are a perfect touch.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/08/12/magazine/12mag-eat-image1/12mag-eat-image1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "sandwiches", "keywords": "baby kale, bell pepper, chorizo, crushed canned tomatoes, pickled banana peppers, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 286}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1115, "unsaturatedFatContent": "49 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "84 grams", "fiberContent": "5 grams", "proteinContent": "54 grams", "saturatedFatContent": "31 grams", "sodiumContent": "3106 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "1 1/2 pounds Mexican or Guatemalan chorizo or Portuguese chouriço, casings removed", "2 teaspoons whole cumin seeds", "1 large green bell pepper, seeded and thinly sliced", "1 medium-size red onion, peeled and thinly sliced", "2 cloves garlic, peeled and minced", "1 cup canned crushed tomatoes", "2 tablespoons hot pepper sauce, preferably one of the thicker varieties, like Cholula or Frank’s", "4 Portuguese-style rolls or sesame-seed hero rolls", "8 thin slices sharp Provolone", "4 handfuls baby kale or spinach leaves", "1/2 cup sliced pickled banana peppers", "1/2 cup pitted and chopped green olives, like Castelvetrano", "1 tablespoon celery seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chorizo filling for the sandwich. Set a large, high-sided skillet or Dutch oven over medium-high heat. Swirl the oil into the pan, and when it shimmers and is about to smoke, add the chorizo, breaking up the meat with a spoon. Cook the chorizo, stirring occasionally and continuing to break down its bulk, until the meat has rendered some of its fat and started to brown, approximately 10 to 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the cumin, then add the bell pepper, onion and garlic, and cook, stirring occasionally, until the vegetables wilt, approximately 5 to 7 minutes. Stir in the tomatoes, 1/2 cup water and the hot sauce, and bring to a simmer, using the spoon to scrape up any browned bits on the bottom and sides of the skillet. Reduce heat to low, and simmer, stirring occasionally, until the sauce has thickened and the vegetables are very tender, approximately 20 minutes. Keep warm or let cool, then refrigerate and reheat when ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the sandwiches, split and toast the rolls, then place 1 to 2 slices of Provolone on the bottom part of each, and divide the warm chorizo filling on top. Place equal portions of the kale on top of the filling, along with equal portions of banana peppers and olives. Sprinkle each sandwich aggressively with celery seeds, put the top part of the bread on and serve."}]}