{"@context": "http://schema.org", "@type": "Recipe", "name": "Diana Dávila’s Chiles Rellenos", "description": "In her singular take on chiles rellenos, Diana Dávila crosses two classic Mexican preparations of the dish — chiles rellenos ahogados and chiles en nogada — to come up with her own remarkable variation. Roasted, peeled poblanos are stuffed with a ground meat picadillo spiked with apples, raisins, cider vinegar and brown sugar, then dunked in a feathery egg batter and fried until golden. Just before serving, those stuffed, fried chiles are bathed in a brothy tomato sauce lightened with carrot juice. It does take time to put all the elements together, but you won’t regret a minute of it when you taste what might be the best chiles rellenos you’ve ever had: complex, sweet and spicy, and deeply brawny. At Mi Tocaya Antojería, her restaurant in Chicago, Ms. Dávila uses a combination of chopped duck confit and ground pork for the picadillo. But using all ground pork works equally well.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/12/12/dining/12davilarex1/merlin_147457293_04597239-7563-4b84-aa68-a9f1729e7111-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "mexican", "recipeCategory": "meat, vegetables", "keywords": "apple, carrot juice, ground pork, poblano pepper, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 175}, "recipeIngredient": ["10 plum tomatoes, diced", "3 pints cherry tomatoes, preferably a mix of colors, halved", "2 teaspoons kosher salt, more as needed", "1/4 cup sunflower or grapeseed oil", "1 large white onion, diced", "10 garlic cloves, thinly sliced", "2 to 3 Serrano chiles, thinly sliced", "2 cups carrot juice", "1 cup chicken stock, preferably homemade", "2 tablespoons duck fat or sunflower oil", "1/2 large white onion, diced", "1 small Granny Smith apple, diced", "4 garlic cloves, minced", "1 1/4 teaspoons kosher salt", "1/4 cup raisins", "2 tablespoons cider vinegar", "1 tablespoon light brown sugar", "1 pound ground pork (or use a combination of ground pork and chopped duck confit)", "1/8 teaspoon crushed red-pepper flakes", "8 poblano chiles", "3/4 cup all-purpose flour", "4 egg yolks, lightly beaten", "6 egg whites", "Fine sea salt, as needed", "Vegetable or canola oil, for frying", "Epazote, for serving (optional)", "Chopped cilantro, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce: In a large bowl, toss plum and cherry tomatoes with 1 teaspoon salt. Use your hands to smush the tomatoes until their skins soften and break apart, then let sit for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in large pot or Dutch oven, heat oil over medium heat. Add onion, garlic, sliced chiles and 1/2 teaspoon kosher salt. Cook, stirring occasionally, until vegetables are softened but not browned, 8 to 10 minutes. Stir in tomatoes and their liquid, bring to a simmer, and continue to simmer for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in carrot juice, stock and 1/2 teaspoon salt, and simmer for another 20 minutes. The sauce should be thin and brothy. Use an immersion blender (or transfer mixture to a regular blender) and blend briefly; the mixture should still be somewhat chunky. Taste and season with more salt if necessary. (Sauce can be made up to 3 days ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a large skillet, heat the duck fat or oil over medium heat. Add the onion, apple, garlic and salt, and cook, stirring, until the apples and onions soften, 8 to 10 minutes. Stir in raisins, vinegar and brown sugar, and cook until reduced to a glaze, about 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in pork and red-pepper flakes, and use a metal spoon to break up the pork into pieces. Cook until pork is no longer pink and much of the liquid has evaporated, about 10 minutes. Raise the heat and let the pork take on a little color at the edges, 5 to 10 minutes longer. Remove from heat. (Filling can be made up to 3 days ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the poblanos: Heat the broiler, and line a rimmed baking sheet with foil. Arrange poblanos in an even layer, and broil until blackened on one side, 4 to 6 minutes. Turn over and blacken the other side, another 4 to 6 minutes, then transfer to a large heat-proof bowl. Cover and let steam until softened, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the blackened skin off the poblanos, then cut a slit in one side of each pepper and remove seeds (keep the stems). Using paper towels to wipe away the skins and slippery seeds can help with this task."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the poblanos with the filling, folding poblano seams together. Place flour on a plate, and gently roll stuffed peppers in flour to coat. Transfer to a rimmed baking sheet and freeze for 20 to 30 minutes. (Freezing is optional, but this will make them easier to fry.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the batter: Place egg yolks in a large bowl and beat until frothy. Place egg whites in the bowl of an electric mixer and whip to stiff peaks. Fold the egg yolks into the whites, along with a pinch of salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 1/4 inches of vegetable oil in a large skillet over medium heat (it’s hot enough when a drop of batter sizzles in the oil). When hot, dip one pepper by its stem into egg batter, then transfer to hot oil. Fry until golden on all sides, about 3 to 4 minutes per side. Repeat with remaining peppers, making sure not to crowd the pan. Transfer fried peppers as they cook to a wire rack placed over a rimmed baking sheet, and immediately sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all the peppers are fried, reheat sauce. Lower peppers into sauce and simmer for 2 to 3 minutes, so the batter absorbs the sauce. Transfer to serving plates and spoon more sauce on top. Sprinkle with epazote, if using, and cilantro."}]}