{"@context": "http://schema.org", "@type": "Recipe", "name": "Salted Dark Chocolate Cake With Ganache Frosting", "description": "Layer cakes are pretty, but for many, they require far too much work to make on a regular basis. This cake, adapted from “Modern Baking: Cakes, Cookies and Everything in Between” by Donna Hay, may find a place in your recipe repertoire. It requires just two bowls — one for the cake and one for the frosting — and there’s no need to separate wet and dry ingredients. You just toss everything into a bowl and stir. The end result is a tender, sophisticated cake slathered with a glossy milk chocolate-sour cream ganache. Ms. Hay sprinkled black sea salt around the edges of her cake with stunning effect, but traditional white sea salt looks beautiful, too.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2018/12/05/dining/05bookrex1/05bookrex1-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dark chocolate, milk chocolate, sour cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 256}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1009, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "91 grams", "cholesterolContent": null, "fatContent": "68 grams", "fiberContent": "6 grams", "proteinContent": "13 grams", "saturatedFatContent": "41 grams", "sodiumContent": "591 milligrams", "sugarContent": "58 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["2 1/2 cups/310 grams self-rising flour, sifted (see note)", "1/2 cup/45 grams cocoa powder, sifted", "1 1/2 cups/295 grams sugar", "4 large eggs, lightly beaten", "1 1/2 cups/360 milliliters whole milk", "1 cup plus 2 tablespoons/255 grams unsalted butter, melted and slightly cooled", "7 ounces/200 grams dark chocolate, melted and slightly cooled", "2 teaspoons vanilla extract", "1 teaspoon flaky sea salt, white or black", "1 cup/240 milliliters sour cream", "14 ounces/400 grams milk chocolate, melted and slightly cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line 2 8-inch round cake tins with parchment paper. Place the flour, cocoa, sugar, eggs, milk, butter, dark chocolate and vanilla in a large bowl and whisk until smooth. (You may need to use a spatula to start, but use a whisk once the ingredients begin to combine.) Divide the mixture evenly between the tins and bake for 35 to 40 minutes or until a wooden skewer inserted into the center comes out clean. Allow to cool in the tins for 10 minutes before turning out onto wire racks to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ganache: Place the sour cream and melted chocolate in a large bowl. Whisk to combine and refrigerate for 10 to 15 minutes or until firm. Place 1 of the cakes on a cake stand or plate. Spread with half the ganache. Top with the remaining cake and ganache. Sprinkle with the salt to serve."}]}