{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Hake and Asparagus With Aioli", "description": "In this light, flavorful weeknight meal, mild hake fillets are pan-fried in butter with plenty of sweet scallions, and served with crisp green asparagus cooked in the same pan. Then, everything is drizzled with a thin, garlicky aioli, which acts as a pungent sauce. If you can get green garlic (often in season at the same time as asparagus), use it in the aioli. It gives a more rounded, gentle flavor, but regular garlic works nicely, too, packing more of a punch. If you can’t get hake, this dish will work with cod, flounder, black fish and the like. Just be sure to adjust the cooking time, adding or subtracting a minute or two if the fillets are thicker or thinner.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/06/06/dining/06appetite1/06appetite1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "asparagus, hake, healthy, low-carb, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 177}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 671, "unsaturatedFatContent": "39 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "4 grams", "proteinContent": "37 grams", "saturatedFatContent": "14 grams", "sodiumContent": "545 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 to 2 garlic cloves, finely grated or mashed to a paste, or use 1 tablespoon minced green garlic", "1/2 teaspoon lemon juice, more to taste", "1/8 teaspoon fine sea salt, more to taste", "1 large egg", "1 large egg yolk", "3/4 cup extra-virgin olive oil", "1 tablespoon chopped fresh tarragon or chives", "4 (6-ounce) hake fillets, patted dry", "3/4 teaspoon kosher salt, more as needed", "1/4 teaspoon black pepper", "1/4 teaspoon sweet paprika", "4 tablespoons unsalted butter", "1 1/2 pounds asparagus, woody ends trimmed, cut into 1 1/4-inch pieces", "2 red or regular scallions, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the aioli: Combine garlic, lemon juice and salt in a blender or food processor, and let sit a minute or two. Add egg and yolk, and blend until combined. With the blender running, slowly add oil in a thin, steady stream. You’re looking for an emulsified mixture, but it will be on the thin, saucelike side. Taste for seasoning, and add more salt and lemon juice, if needed. Stir in tarragon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the hake: Season hake with 3/4 teaspoon salt, pepper and paprika. Let sit while you cook the asparagus."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the asparagus: Melt 2 tablespoons butter in a 12-inch skillet over high heat. Stir in asparagus and a pinch of salt, and let cook without moving for 2 minutes to brown slightly. Add a tablespoon of water, cover and cook, shaking pan occasionally, until just tender, 2 to 5 minutes longer depending on thickness of stalks. Transfer to a plate and loosely tent with foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return skillet to medium heat, and melt remaining 2 tablespoons butter. Place hake in an even layer in skillet, then scatter in scallions. Cover and cook until golden, 3 to 4 minutes, then flip and cook uncovered about another 3 to 4 minutes, until hake is cooked through and lightly browned on both sides. Transfer hake and scallions to serving plates, and immediately drizzle with aioli to taste. Serve with asparagus."}]}