{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggplant Ragù With Capers and Burrata", "description": "This eggplant dish is a lot like pasta alla Norma, minus the pasta. Instead, it’s the large, crisp chunks of eggplant that star, enrobed in basil-scented marinara sauce and topped with a melting, creamy mix of burrata and ricotta. In this recipe adapted from the chef Amy Brandwein of Centrolina in Washington, D.C., the cubed eggplant is topped with crunchy, salty eggplant chips, sliced ultrathin and deep-fried until golden. But if that’s one step too many when you’re cooking this at home, feel free to leave the chips out.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/10/17/dining/17Brandweinrex1/17Brandweinrex1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 servings", "recipeCuisine": "italian", "recipeCategory": "vegetables", "keywords": "burrata, capers, eggplant, sheep's milk ricotta, side dish, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 113}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 472, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "13 grams", "proteinContent": "16 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1332 milligrams", "sugarContent": "17 grams", "transFatContent": null}, "recipeIngredient": ["6 tablespoons extra-virgin olive oil", "1 large yellow onion, thinly sliced", "2 garlic cloves, finely grated or minced", "1 (14-ounce) can whole plum tomatoes in purée", "1/2 cup basil leaves", "Kosher salt and black pepper", "1/8 teaspoon red-pepper flakes", "2 large eggplants (about 2 1/4 pounds total)", "1/4 cup all-purpose flour", "Vegetable or canola oil, for frying", "1/2 cup burrata (4 ounces), roughly torn", "1/2 cup sheep’s milk ricotta", "Roughly chopped capers, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a 10-inch skillet over medium heat. Add onion and cook until onions start to brown, 8 to 10 minutes, stirring occasionally. Reduce heat to medium-low and continue to cook until lightly caramelized, another 10 to 15 minutes. Add garlic and cook 1 more minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your hands to break up the tomatoes in the can, squishing them into the skillet. Pour in the tomato juices. Fill tomato can halfway with water and stir that water into the skillet. Add half the basil leaves, season with salt and black pepper to taste, and red-pepper flakes, then simmer vigorously until tomatoes break down and sauce has thickened, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler, and place the rack 4 inches from the heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cube 1 1/2 of the eggplants into 1 1/4-inch cubes (about 7 cups). Save remaining half an eggplant for garnish. Arrange cubed eggplant in an even layer on a rimmed baking sheet. Toss eggplant thoroughly with remaining 4 tablespoons oil, then season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil eggplant until browned on one side, 5 to 6 minutes. Flip the pieces and broil until browned and tender, 6 to 8 minutes. (If your eggplant starts to burn, move the baking sheet to a lower rack.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the garnish of eggplant slices, slice remaining eggplant lengthwise into long, thin 1/4-inch-thick slices. Place flour on a plate, and generously coat both sides of each eggplant slice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy-bottomed pot or Dutch oven, heat 1 inch of oil to 350 degrees. Fry eggplant, in batches, until golden, about 1 to 2 minutes, flipping the slices halfway through. Transfer to a separate paper towel-lined plate and sprinkle with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, fold together burrata and ricotta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, gently stir broiled eggplant into tomato sauce until evenly coated. Simmer for 1 to 2 minutes until the eggplant is warmed through. Transfer to serving bowls, and spoon burrata mixture on top. Garnish with remaining basil leaves, crisp eggplant slices and the capers if you like."}]}