{"@context": "http://schema.org", "@type": "Recipe", "name": "Maple Breakfast Sausage", "description": "This classic recipe will come together in the time it takes to make a frittata or a stack of pancakes for brunch. You could also try frying the patties in a cast-iron pan alongside eggs in a hole. As the maple-and-sage-tinged fat renders out of the sausage, the bread will thirstily absorb it. You might even want to drizzle a tiny bit more syrup over the whole thing as you sit down to eat, so that each bite of sausage, bread and runny yolk has the perfect blend of savory and sweet. Be sure to use ground pork with enough fat or you'll end up with dry, flavorless hockey pucks. Twenty percent by weight is a good ratio, though 25 doesn’t hurt. If the ground pork available to you is too lean, ask the butcher to replace two ounces or so of the lean meat with ground pork belly or bacon. For variations on the sausage, check out these recipes for <a href=\"https://cooking.nytimes.com/recipes/1019031-italian-fennel-sausage\">Italian fennel sausage</a> and <a href=\"https://cooking.nytimes.com/recipes/1019032-nem-nuong-vietnamese-sausage\">Nem Nuong, Vietnamese sausage.</a>", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2017/11/05/magazine/05eat1/05eat1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "breakfast, sausages", "keywords": "ground pork, maple syrup, sage, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 145}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 330, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "0 grams", "proteinContent": "19 grams", "saturatedFatContent": "9 grams", "sodiumContent": "283 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 teaspoon dried sage", "2 teaspoons Diamond Crystal kosher salt or 1 teaspoon fine sea salt", "1/2 teaspoon freshly ground black pepper", "1 large pinch ground nutmeg", "1 large pinch ground coriander", "1/4 teaspoon cayenne pepper", "1 pound ground pork (20 to 25 percent fat by weight)", "1 tablespoon plus 1/2 teaspoon maple syrup", "Extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with parchment paper; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely crumble the sage into a large bowl. Add salt, black pepper, nutmeg, coriander and cayenne to the sage, and stir to combine. Add pork and syrup to the spice mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, mix thoroughly for 1 full minute, until the pork begins to appear tacky and sticks to the palm of your hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron pan over medium heat. Use a heaping tablespoon of pork mixture to make a small, thin sausage patty. Add a teaspoon or so of olive oil to the pan. and cook the patty for 2 to 3 minutes on each side, or until cooked through. Taste, and if needed, add salt or any other seasonings to the uncooked sausage mixture, and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide and form the remaining sausage into 8 2 1/2-inch patties, placing them on the prepared baking sheet as you go. Cover, and refrigerate for 30 minutes to allow the flavors to come together. (Patties can be made ahead and covered and refrigerated or frozen at this point until ready to use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook, wipe out cast-iron pan, and return it to medium heat. Add 1 tablespoon olive oil. When it shimmers, add patties in a single layer, leaving space between them. Cook 3 to 4 minutes per side, or until browned on the surface and just cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain sausages on paper towels. Serve hot."}]}