{"@context": "http://schema.org", "@type": "Recipe", "name": "French Fries", "description": "The effort is worth it for these perfect homemade fast-food-style French fries! By soaking the raw fries in cold water, you remove some of the starch, a technique I recommend for other interesting preparations in which you want the vegetal rather than the starchy component of the potato. (Try soaking potatoes in several turns of fresh, cold water and then stir-frying in a blistering wok with Sichuan peppercorns someday. Massively addictive!) Once destarched, the perfect French fry concept is straightforward, if laborious. As with making the best home fries, you want to start with an already-cooked potato. The interesting deviation here is that you parcook the potatoes in acidulated water first, give them a second blanching in hot oil and then freeze the fries at this stage. Once frozen, they are yours to cherish for months at whim — ready your clean, hot fry oil and sizzle away.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2018/09/16/magazine/16mag-eat/16mag-eat-articleLarge.png", "totalTime": "P2DT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "snack, finger foods, project", "keywords": "appetizer, canola oil, russet potatoes", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 340}, "recipeIngredient": ["3 pounds russet potatoes, peeled and cut into 1/4-by-1/4-inch fries kept refrigerated in cold, clean water overnight (about 5-6 potatoes, depending on size)", "2 tablespoons plus 1 teaspoon distilled white vinegar", "3 quarts canola oil", "Kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, remove the fries from the cold water, and drain off as much water as you can without breaking the fries. Discard the water, and place the fries in a large, wide, heavy-bottomed pot. Cover with 2 1/2 quarts of clean, cold water, and add the vinegar. Bring to a low boil for 6 minutes. The fries should be cooked through but not falling apart. Remove the fries with a slotted spoon or spider onto a baking sheet fitted with a paper-towel-lined rack. Cool and dry the potatoes on the rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the potatoes are cool and dry, prepare your deep fryer. Heat the 3 quarts of canola oil in a large Dutch oven (at least a 5 quart). Attach a candy thermometer to the side of the fryer, and heat until the gauge reads 395. Working in three batches, add the fries to the oil, and cook for 1 1/2 minutes. Using a slotted spoon or spider, remove the fries and place on another baking sheet fitted with a paper-towel-lined rack. Repeat with the rest of the fries until all of them have been blanched in the oil for 1 1/2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the fries cool and dry on the rack for 1 hour, and then gently place them in a large, plastic food-storage container, being careful not to break the fries. Cover, and freeze overnight. Cool, strain and reserve the canola oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The following day, reheat the reserved canola oil in the Dutch oven. Attach a candy thermometer to the side of the fryer, and heat the oil until the gauge reads 395. Working in three batches, add the fries to the oil, and cook until the fries are light golden in color, about 4 minutes. Agitate the fries with a slotted spoon or spider during the cooking process to ensure even cooking. Adding the fries will have lowered the temperature of your fryer but adjust as needed in order to maintain 375. (It is better for your fryer to be below 375 rather than over it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fries from the oil into a metal bowl lined with paper towels. Season all over with kosher salt, and serve at once."}]}