{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Bolognese", "description": "This fishy take on the classic pasta sauce does everything the original does but with much less cooking. Tagliatelle is great, but you can use most other pasta shapes.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/10/24/dining/24ottorex2/merlin_145318899_c35bce7f-19bc-4715-85ab-16d496b2a1c7-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "pastas, seafood", "keywords": "cherry tomatoes, fennel, pasta, pernod, shrimp, tagliatelle, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 246}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 942, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "79 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "5 grams", "proteinContent": "37 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1243 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 small fennel bulb, roughly chopped", "1/2 small onion, roughly chopped", "5 garlic cloves, roughly chopped", "1/2 teaspoon red-chile flakes", "1 1/3 pounds/600 grams peeled, raw king prawns or extra-jumbo shrimp (or use the largest shrimp you can find)", "1/3 cup plus 1 tablespoon/90 milliliters olive oil", "1 lemon, finely shaved to get 5 strips of peel and squeezed to get 1 tablespoon juice", "3 tarragon sprigs (about 5 grams), plus 1 tablespoon chopped leaves for serving", "3 1/2 tablespoons tomato paste", "1/4 pound/120 grams cherry tomatoes, finely chopped", "Salt and black pepper", "1/3 cup plus 1 tablespoon/90 milliliters Pernod (or a similar anise liqueur)", "2 cups/500 milliliters chicken or vegetable stock", "12 ounces/320 grams dried tagliatelle pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the fennel, onion, garlic and chile flakes to the bowl of a food processor and pulse about 10 times, until more finely chopped. Add the shrimp and pulse another 10 times, until finely chopped. (Don’t process too much; you don’t want the shrimp to turn to a paste. Smaller shrimp will require less pulsing, though.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/3 cup/70 milliliters oil to a large sauté pan set over medium-high heat with the lemon peel and tarragon sprigs. Gently fry for 2 minutes, then add the shrimp and fennel mixture. Fry, stirring every now and then for about 10 minutes, or until the shrimp have released and then reabsorbed their liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste, tomatoes, 1 1/4 teaspoons salt and a very generous amount of black pepper and fry for 4 minutes, stirring every now and then until the tomato paste becomes thick and sticky and begins to brown. Carefully pour in the Pernod and let it bubble away for 1 minute (it may flame)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock and 1 tablespoon lemon juice, turn the heat down to medium and simmer gently for 15 minutes, lowering the heat if it is bubbling too much. Discard the tarragon sprigs and lemon peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the pasta per package instructions until al dente, then drain well and add to a large bowl. Pour over the sauce and toss together well. Transfer to a platter and drizzle over the remaining tablespoon/20 milliliters oil. Finish with plenty of pepper and the chopped tarragon and serve."}]}