{"@context": "http://schema.org", "@type": "Recipe", "name": "Seafood Chowder", "description": "This chowder of root-cellar vegetables, clams and fish is one of the easiest and best things to cook for a weekend dinner with family and friends. Use a mixture of butter and the powdered dried seaweed called dulse as the flavored fat in which you sauté the vegetables before deglazing them, and each individual flavor in the resulting stew will pop — from carrot to leek, parsnip to potato, bacon to clam to scallop to fish. The seaweed is a powerful flavor enhancer. You can omit it if you want, but really, you shouldn't.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/02/10/magazine/11mag-eat1/11mag-eat1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "cod, dulse, leek, parsnip, sea scallop, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 477}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 495, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "4 grams", "proteinContent": "21 grams", "saturatedFatContent": "18 grams", "sodiumContent": "656 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["36 medium-size quahog clams, usually rated “top neck” or “cherrystone,” scrubbed under cold water to remove sand and grit", "2 tablespoons unsalted butter", "1/4 pound thick-cut bacon, diced", "2 tablespoons dulse flakes", "2 leeks, tops removed, halved and cleaned, then sliced into half-moons", "2 carrots, peeled and halved, then sliced into half-moons", "2 parsnips, peeled and halved, then sliced into half-moons", "2 medium-size all-purpose potatoes, like Yukon Gold, cubed", "1 cup dry white wine", "3 sprigs thyme", "2 bay leaves", "2 cups heavy cream", "Freshly ground black pepper to taste", "1 pound firm white fish fillets, like cod, tautog or sea bass, cut into fingers", "1/2 pound sea scallops, sliced into coins if very large", "1/4 cup chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the clams in a large, heavy Dutch oven, add about 4 cups water, then set over medium-high heat. Cover, and cook until clams have opened, approximately 10 to 15 minutes. (Clams that fail to open should be discarded.) Strain clam broth through a sieve lined with cheesecloth or doubled-up paper towels, and set aside. You should have 5 or 6 cups. Remove clams from shells, and set aside as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse out the pot, and return it to the stove. Add 1 tablespoon of the butter, and turn heat to medium-low. Add bacon, and cook, stirring occasionally, until the fat has rendered and the pork has started to brown, approximately 5 to 7 minutes. Use a slotted spoon to remove pork from fat, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the dulse and the leeks to the fat, and cook, stirring frequently, until the leeks are soft but not brown, about 10 minutes. Add the remaining 1 tablespoon butter, then stir in the carrots, parsnips, potatoes and wine, and continue cooking until wine has evaporated and the vegetables have just started to soften, approximately 5 to 7 minutes. Add enough clam broth to just cover them, approximately 4 to 5 cups, reserving the rest for another use. Add the thyme and the bay leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Partly cover the pot, and simmer gently until vegetables are tender, approximately 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, chop the clams into bits about the size of the bacon dice. When the vegetables are tender, add the cream, and stir in the chopped clams and reserved bacon. Add black pepper to taste. Let come to a simmer. (Do not let chowder come to a full boil.) Remove the thyme and the bay leaves, and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If serving right away, slip the fish fingers into the chowder, place the scallops on the surface and allow them all to cook into translucence in the heat, approximately 5-7 minutes. But chowder improves mightily if it sits overnight to cure. If you have the time, don’t add the fish and scallops right away, but allow the chowder to chill in the refrigerator overnight, then reheat it to a bare simmer before adding and cooking them through. Season to taste with salt and pepper, and serve, garnished with the chopped parsley."}]}