{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread Snickerdoodles", "description": "These cookies combine the crackly outsides and tender, chewy centers of snickerdoodles with the warming ginger and molasses of gingerbread. It’s a more nuanced version of winter gingerbread and a punchier take on snickerdoodles. If you’re in a rush, you can bake the cookies without first chilling the dough. It’ll be too soft to roll in the cinnamon sugar, but you can scoop the dough right onto the pan and sprinkle the cinnamon sugar on top of the rounds. You won’t get as even a coating, but will still get the crackle effect.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/09/04/dining/gingerbread-snickerdoodle/gingerbread-snickerdoodle-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "32 cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 258}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 118, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "69 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups/320 grams all-purpose flour", "1 teaspoon baking soda", "1 teaspoon cream of tartar", "1 tablespoon ground ginger", "2 1/2 teaspoons ground cinnamon", "1/2 teaspoon fine sea salt<strong> </strong>", "<strong></strong>3/4 cup/170 grams unsalted butter (1 1/2 sticks), at room temperature", "1/4 cup molasses", "1 1/4 cups/250 grams sugar", "2 large eggs, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk flour, baking soda, cream of tartar, ginger, 1 teaspoon cinnamon and 1/4 teaspoon salt. In the bowl of a stand mixer fitted with the paddle attachment, beat butter, molasses, and 1 cup sugar on medium speed until creamy and smooth, scraping bowl occasionally. With machine running, add eggs and beat until incorporated, scraping bowl occasionally. Turn speed to low. Gradually add flour mixture and beat until just incorporated. (You can make the dough by hand, too: In a large bowl, beat butter, molasses and sugar with a wooden spoon until creamy and smooth. Beat in eggs, one at a time, until incorporated. While stirring with the spoon, gradually add flour mixture and stir until no traces of flour remain.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover bowl tightly with plastic wrap and refrigerate until firm enough to roll, at least 30 minutes and up to 2 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line 2 cookie sheets with parchment paper. In medium bowl, mix remaining 1/4 cup sugar, 1 1/2 teaspoons cinnamon and 1/4 teaspoon salt. Portion 3/4-ounce (1 1/2 tablespoons) dough by packing dough level into a 3/4-ounce cookie scoop or scooping a rounded ball in a measuring tablespoon. Drop into the cinnamon sugar and roll to coat. Put on a prepared sheet. Repeat with dough and cinnamon sugar, spacing balls 2 inches apart, until sheet is filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until tops crackle and bottoms are golden brown, 10 to 12 minutes. Do not overbake; the cookies should look dry and set. While first batch bakes, scoop and roll remaining dough, then bake after first batch comes out. Cool completely on sheets on wire racks."}]}