{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Beef With Eggplant", "description": "The food of Provence usually evokes summer, with lovely vegetables, salads, seafood and a whiff of lavender. But there’s a wintry side to it as well. When a fierce mistral wind blows, it’s time to crank out beef stews and roasted meats. This braised beef dish, a pot roast, keeps a Provençal flavor profile, with eggplant, garlic, fennel, rosemary, orange, black olives and tomatoes. It’s prepared to allow the eggplant to maintain its character and not disintegrate. I like to braise a nice piece of tri-tip sirloin, but this recipe will suit any cut of beef you prefer for braising. Serve the dish with plain broad egg noodles dressed with a splash of good olive oil.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2019/01/30/dining/30pairrex1/merlin_149231790_c2dcd4e4-9d37-4626-95e5-28872aa010a0-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "meat", "keywords": "fall, winter, fennel, pastis, sun-dried tomato, tri-tip steak, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 366, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "42 grams", "saturatedFatContent": "4 grams", "sodiumContent": "913 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 eggplant (about 1 pound) in 1-inch dice", "Salt", "1 tablespoon extra-virgin olive oil", "1 2 1/2-pound piece of beef for braising (tri-tip, rump or brisket)", "1/2 cup finely chopped fresh fennel bulb", "1/2 cup finely chopped red onion", "2 garlic cloves, minced", "1/2 cup chopped canned San Marzano tomatoes", "3 tablespoons pastis or other anise liqueur", "4 sun-dried tomatoes in oil, slivered", "1 cup dry red wine", "1 cup beef or vegetable stock", "Ground black pepper", "2 branches fresh rosemary", "2 branches fresh thyme", "1 teaspoon grated orange zest", "1 tablespoon black olive tapenade"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place eggplant in a colander, dust with salt and set aside 20 minutes. Meanwhile, heat a 4-quart stovetop casserole on medium-high and add the oil. Dry the beef and brown it on all sides, about 10 minutes. Remove from the pan to a plate. Turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse and dry the eggplant. Reheat the casserole on medium and sear the eggplant, turning frequently, until it is lightly browned, glossy and still somewhat firm, about 10 minutes. Transfer the eggplant to a bowl. Add the fennel, onion and garlic to the casserole and sauté on low heat until translucent. Add the diced tomatoes and pastis and cook, stirring, to deglaze the casserole. Add the sun-dried tomatoes, wine and stock, and bring to a simmer. Season with pepper. Add the rosemary and thyme. Return the meat to the casserole, cover and simmer on low heat for 2 hours, turning once or twice during the cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 2 hours the meat should be tender. If not, give it another 15 or 20 minutes cooking. Remove it to a cutting board. Discard herb branches from sauce, and stir in the orange zest and tapenade. Season to taste with salt. Add the eggplant to the casserole and simmer 5 minutes, just to reheat it. Slice the beef and arrange on a platter. Give the sauce another quick heating, then spoon it with the eggplant over and around the meat and serve."}]}