{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingerbread Rum Balls", "description": "This is the perfect recipe to make if you’ve got crumbs leftover after building a gingerbread house. Or you can use a package of gingersnaps ground up in the food processor or blender. The flavor of rum balls improves after they sit for a couple of days, so plan ahead if you’re considering these for a holiday bash. They will last for two weeks or even longer if you store them airtight at room temperature. Rolling rum balls in confectioners’ sugar gives you a soft, moist confection while using granulated sugar results in a crunchier texture. And if you’d rather skip the alcohol, you can substitute orange or apple juice for the rum. Just reduce the confectioners’ sugar by a tablespoon or two, to taste.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/12/12/dining/12apperex1/merlin_147679470_33185d01-06fe-414e-ac64-3aa7d6ae6a69-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 2 1/2 dozen balls", "recipeCuisine": "american", "recipeCategory": "easy, quick, cookies and bars", "keywords": "dessert, gingerbread, pecans, rum, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 194}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 108, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "64 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 cups/360 grams cookie crumbs, from gingerbread or gingersnaps", "1 1/4 cups/125 grams pecans", "3/4 cup/85 grams confectioners’ sugar, plus more for rolling if you like", "1/3 cup/80 milliliters dark or amber rum, brandy or bourbon, more as needed", "2 1/2 tablespoons maple syrup", "2 tablespoons unsweetened cocoa powder", "1 1/2 teaspoons finely grated fresh ginger, more to taste", "1/2 teaspoon ground cardamom", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "Pinch fine sea salt", "Granulated sugar, for rolling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a food processor, pulse together cookie crumbs and pecans until nuts are coarsely ground. Do not overprocess — you want the nuts to have some texture. Alternatively, finely chop the pecans and toss them in a bowl with the crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate large bowl, stir together confectioners’ sugar, rum, maple syrup, cocoa powder, fresh ginger, cardamom, cinnamon, ground ginger and salt. Add to food processor and pulse until just combined, or stir into bowl with the crumb mixture, squeezing everything together into a mass. Taste and add more fresh ginger if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll dough into 1-inch balls, then roll in confectioners’ sugar or granulated sugar. If the dough starts to dry out as you roll the balls, drizzle in a little more rum. Store in an airtight container at room temperature (they will keep for at least 2 weeks); roll balls in additional sugar just before serving."}]}