{"@context": "http://schema.org", "@type": "Recipe", "name": "Ricotta-Stuffed Shells With Pesto", "description": "Classic stuffed and baked Italian-American jumbo shells are an easy sell. This summery version dispenses with the tomato sauce: The shells are instead drizzled lightly with olive oil, dusted with grated pecorino and bread crumbs, baked briefly until nicely browned, then napped with a bright green garlicky pesto sauce. The effect is more akin to crispy ravioli than a juicy, long-baked casserole. Serve 2 or 3 shells as a first course, 5 to 6 for a main.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/06/27/dining/27kitchrex/merlin_139481913_9caf8a67-39b0-410a-a330-36f7624d6d8f-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "casseroles, pastas", "keywords": "basil, giant pasta shells, pecorino, ricotta, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 316}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 706, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "3 grams", "proteinContent": "23 grams", "saturatedFatContent": "13 grams", "sodiumContent": "524 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Salt and pepper", "1 pound giant pasta shells made from semolina (500 grams on some imported brands), 36 to 40 pieces", "24 ounces fresh ricotta, about 2 1/2 cups", "2 eggs", "3 or 4 scallions, green and white parts, finely chopped", "3 tablespoons finely chopped parsley", "1/2 teaspoon finely chopped thyme, marjoram or rosemary", "Zest and juice of 1 small lemon", "Pinch of crushed red pepper", "1/2 cup grated Parmesan", "1/2 cup grated pecorino, plus 1/4 cup more for topping", "Extra-virgin olive oil", "1/2 cup fine dry bread crumbs", "2 cups basil leaves, rinsed and dried", "1 cup Italian parsley leaves, rinsed and dried", "1 or 2 finely grated garlic cloves", "Salt and pepper", "1 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a large pot of well-salted water over high heat, and bring to a boil. Add the pasta shells, put the lid on the pot to help water return to a boil, then remove lid, stir pasta and continue cooking, uncovered until al dente, usually abut 10 minutes. (It’s better to err on the undercooked side than risk flabby pasta, so check early and often.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pasta from pot and cool in a large bowl of water. Drain well and spread cooked shells on a baking sheet lined with a kitchen towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the ricotta filling: In a mixing bowl, combine ricotta, eggs, scallions, parsley, thyme, lemon zest and juice, and crushed red pepper to taste. Add grated Parmesan and pecorino. Season well with salt and pepper and mix well to incorporate ingredients. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Lightly oil a large shallow baking dish (use 2 dishes if necessary). Using a spoon or pastry bag, put about 1 tablespoon ricotta mixture into each pasta shell. Arrange the filled shells in one layer in the baking dish, packed closely together. Drizzle surface lightly with olive oil, or use a small brush to lightly paint each shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle top with 1/4 cup pecorino and bread crumbs and bake, uncovered, for about 20 minutes, until heated through, crisp and golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pesto, pulse basil, parsley, garlic and 1/2 teaspoon salt in a blender or food processor until roughly chopped. Add oil slowly and blend well. Add a little pepper, taste and adjust seasoning and transfer to a serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, drizzle shells with a little pesto sauce and pass the rest at the table."}]}