{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Pie Bars", "description": "This delivers all the pleasure of apple pie — a buttery crust and topping sandwiching juicy spiced apples — without the need to roll out a dough. A simple dough is pressed into a bottom crust and squeezed into crumbles for the top. You can arrange the topping into a lattice, stripes, or other decorative pattern if you’d like. The whole pan easily serves 24 and can be cut into smaller bars if you want to serve an even-bigger crowd. These bars are best the day they are made, but they can be refrigerated for up to 2 days. Or, they can be frozen immediately after cooling and kept in the freezer for up to 1 month. Just make sure to thaw them before serving.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/09/04/dining/apple-pie-bars/apple-pie-bars-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "2 dozen bars", "recipeCuisine": "", "recipeCategory": "snack, cookies and bars", "keywords": "apple, cardamom, nutmeg, walnut, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 771}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 298, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "9 grams", "sodiumContent": "100 milligrams", "sugarContent": "20 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Softened butter, for greasing pan", "3 cups/385 grams all-purpose flour", "1 cup/200 grams sugar", "1 teaspoon fine sea salt", "3 sticks/340 grams cold unsalted butter, cut into cubes", "3/4 cup/75 grams walnuts, toasted and chopped", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground cardamom", "1 1/2 pounds/680 grams tart apples, such as Granny Smith (about 3 large), peeled, cored and cut into 1/8-inch slices", "1 1/2 pounds/680 grams sweet-tart apples, such as Fuji, Pink Lady or Gala (about 3 large), peeled, cored and cut into 1/8-inch slices", "3 tablespoons lemon juice", "1/4 cup/55 grams unsalted butter (1/2 stick)", "1 teaspoon ground cinnamon", "1 teaspoon freshly grated nutmeg", "1/2 teaspoon ground cardamom", "2/3 cup/135 grams sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust and topping: Heat oven to 350 degrees. Line a 9-by-13-inch cake pan with foil with overhang on all sides. Lightly grease pan with softened butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse flour, sugar and salt in a food processor with the blade attachment to mix. Add butter and pulse until mixture resembles coarse sand. Put 1 1/2 cups in a medium bowl and mix in walnuts, cinnamon and cardamom. Squeeze with your hands to form a solid mass of dough. It’s O.K. if a few bits fall off. Cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour remaining mixture into prepared pan and spread in an even layer, then press into bottom of pan and 1/2 inch up the sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden brown and dry to the touch, 20 to 25 minutes. Cool on a wire rack. Raise oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While crust bakes, make the filling: Toss all of the apples with the lemon juice in a large bowl. Melt butter in a large sauté pan set over medium-high heat. Stir in cinnamon, nutmeg and cardamom and sizzle for 15 seconds. Add apples and cook, stirring often, until just starting to soften, about 5 minutes. Add sugar and stir well. Cook, stirring occasionally, until all liquid releases from the apples then evaporates, 10 to 15 minutes. The mixture should be quite dry and the apples tender, but not sticking to the pan. Remove from heat and cool. (Tip: If you want your apples to cool quickly, spread them on a parchment-lined sheet pan and pop in the freezer for 5 to 7 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread apple filling evenly over crust and press down gently to get rid of any gaps between the apple slices. Uncover the reserved walnut mixture and break off pebble-sized pieces. Arrange pieces in a lattice or striped pattern over filling or scatter evenly on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the topping is golden brown, 45 to 50 minutes. Cool completely in pan on a rack. To serve, lift apple pie bars out of pan and onto a large cutting board. Slide bars off foil, then cut into 6 even strips crosswise and 4 even strips lengthwise."}]}