{"@context": "http://schema.org", "@type": "Recipe", "name": "Bacon and Egg Pizza", "description": "If you’ve ever had a hankering for pizza for breakfast, this recipe is exactly what you need. With a topping of creamy ricotta, runny eggs and plenty of crisp bacon, this white pizza doesn’t need tomato sauce to give it pizazz. The flavors are a little like a carbonara, with the mozzarella and ricotta making it extra creamy.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2017/11/22/dining/22appetite1-sub/22appetite1-sub-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, pizza and calzones", "keywords": "bacon, egg, mozzarella, pizza dough, ricotta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 593, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "2 grams", "proteinContent": "30 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1075 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces thick-cut bacon (4 to 6 slices)", "2/3 cup ricotta cheese", "1 clove garlic, finely grated or minced", "1/4 teaspoon fine sea salt", "1 (9- to 10-ounce) ball of regular or whole-wheat pizza dough, room temperature (<a href=\"https://cooking.nytimes.com/recipes/1016230-robertas-pizza-dough\">see recipe</a>)", "1 1/2 cups shredded fresh mozzarella", "1/8 teaspoon red pepper flakes, plus more for serving", "8 basil leaves, plus more for serving", "3 tablespoons grated pecorino Romano", "2 large eggs, cold", "Flaky sea salt, for serving", "Extra-virgin olive oil, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees, and arrange racks in top and bottom thirds. Place a pizza stone on the top rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange bacon in a single layer on a rimmed baking sheet, and bake on bottom rack until browned and crisp, 7 to 11 minutes. Using tongs, transfer bacon to paper-towel-lined plate to cool, then slice into bite-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise oven temperature to 500 degrees. In a small bowl, stir together ricotta, garlic and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a rimmed baking sheet, stretch dough into an 11-inch circle, about 1/8-inch thick. Sprinkle with mozzarella, leaving a slim border around edges. Scatter bacon on top, add red pepper flakes, then dollop tablespoons of ricotta mixture all over pie. Arrange basil leaves on top, then sprinkle with pecorino."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place baking sheet on top of pizza stone, and bake for 4 minutes. (Edges of dough should be cooked but not browned.) Remove from oven; use the back of a large spoon to make 2 divots on either side of pizza, and crack eggs into the divots. Return to oven and bake until egg whites are almost but not quite set, about 4 minutes. Set oven to broil, and broil until crust is charred and eggs are cooked but yolks are runny, 30 seconds to 1 minute. (If your broiler is in a separate drawer, transfer baking sheet to your broiler drawer and broil to finish cooking the eggs and brown the crust.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slide pizza onto a cutting board. Top with more basil, flaky sea salt and more red pepper flakes. Drizzle with oil and serve immediately."}]}