{"@context": "http://schema.org", "@type": "Recipe", "name": "Pickled Mushroom Salad", "description": "This recipe for roasted mushrooms dressed with sherry vinegar and spices is an adaptation of Patch Troffer’s delicious pickled mushrooms at Marlow & Sons, where it’s served simply as it is, with a drizzle of chile oil. Mixed with some sliced vegetables and roughly picked herbs, it makes for an excellent snack with a glass of wine, or a fall salad. Or serve it with a spoonful of something creamy, like crème fraîche or mascarpone, and pile everything up on thickly cut toasts.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/11/04/magazine/04mag-eat-image1/04mag-eat-image1-articleLarge.jpg", "totalTime": "PT1H25M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, easy, lunch, salads and dressings", "keywords": "crème fraîche, cremini, maitake, shiitake, star anise, trumpet mushroom, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 105}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 366, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "6 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "682 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds mixed mushrooms, like cremini, maitake, shiitake and trumpet", "1/2 cup grapeseed oil", "2 teaspoons kosher salt", "1 teaspoon coriander seeds", "1 teaspoon fennel seeds", "1/2 teaspoon black peppercorns", "1 piece star anise", "1 clove garlic, peeled and finely grated", "1 handful cilantro, roughly chopped", "1 handful dill sprigs", "1 rib celery heart, thinly sliced, plus leaves", "3 tablespoons sugar", "1/4 cup sherry vinegar", "Bread", "Crème fraîche, to serve"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 500. Cut the mushrooms into halves or thick slices, toss with 1/4 cup grapeseed and salt, and divide between two sheet pans. Roast for 10 to 15 minutes, or until the mushrooms are nicely browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mushrooms are roasting, put the coriander seeds, fennel seeds, peppercorns and star anise in a small saucepan over low heat. When they are warm and fragrant, crush in a mortar and pestle or coffee grinder until powdery. Transfer spice to a large mixing bowl with garlic, cilantro, dill, celery rib and any leaves, sugar, remaining grapeseed oil and sherry vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the mushrooms are nicely browned, add them to the bowl while they’re hot. Pour a splash of water into each hot pan, swirl it around and pour over the mushrooms, scraping any browned bits off the pan. Mix well, and taste. Adjust for seasoning. Allow to sit for at least an hour, but ideally overnight in the fridge. Serve with bread and crème fraîche."}]}