{"@context": "http://schema.org", "@type": "Recipe", "name": "Kimchi Grilled Cheese", "description": "Spicy heat plays well with melty cheese (think: queso dip, stuffed jalapeños, Buffalo wings and blue cheese). Here, kimchi and mozzarella cheese come together for a twist on the classic grilled cheese. Mildly flavored mozzarella is an especially good choice in this recipe because it lets the kimchi shine, but you could also add 1/4 cup of grated Cheddar, Monterey Jack or even pepper Jack for more kick. If you have grilled steak, roasted vegetables or practically any other savory leftover in your fridge, chop it up and add about 1/4 cup to your sandwich along with the kimchi. Smearing mayonnaise on the bread, instead of butter, might sound weird, but it won’t burn as quickly as butter, allowing the cheese ample time to melt, and the bread to toast up to golden perfection.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2018/12/28/dining/as-kimchi-grilled-cheese/as-kimchi-grilled-cheese-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "1 serving", "recipeCuisine": "american, korean", "recipeCategory": "for one, lunch, quick, weekday, sandwiches", "keywords": "kimchi, mozzarella, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 254}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 435, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "9 grams", "sodiumContent": "834 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 slices bread, either soft sandwich bread or large rustic slices, not more than 1/2-inch thick", "1 tablespoon mayonnaise", "1/2 cup grated mozzarella, Cheddar or other mild, semifirm cheese", "1/4 cup drained and coarsely chopped kimchi"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy skillet over medium-low heat. Thinly spread 1 side of each slice of bread with 1/2 tablespoon mayonnaise. Place the bread, mayonnaise-side-down, in the skillet and divide the mozzarella evenly over the slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cheese has just melted (no individual shreds of cheese remain), 6 to 10 minutes, add the kimchi to one side. Use a spatula to top with the other slice of bread, cheese-side-down. Press with the spatula to meld, then let cook, covered, flipping as needed to prevent burning, until the bread is crusty-brown and the sandwich is warmed through, 2 to 4 minutes."}]}