{"@context": "http://schema.org", "@type": "Recipe", "name": "Sonoran-Style Flour Tortillas", "description": "In Sonora, a Northern Mexican region where wheat has been cultivated for more than 400 years, tortillas are typically made of flour rather than corn. But unlike the generally lackluster store-bought wrappers most Americans are familiar with, handmade flour tortillas are pliable, chewy, fragrant, and dotted with mahogany blisters.\n\nWhile this recipe, adapted from Teo Diaz and Julia Guerrero of Sonoratown taqueria in downtown Los Angeles, isn’t complicated, it does require allowing some time for the dough to rest. But the investment is worth it. Once you roll out the tortillas and set them on the hot griddle, they’ll begin to puff with steam as they start to brown. When you take a bite, the aroma of sweet flour enveloped in fat will fill your nose and mouth. Finally, you’ll understand that a tortilla is meant to be an essential component rather than just monotextured wrapping paper for tacos, burritos, or <a href=\"https://cooking.nytimes.com/recipes/1019638-chivichangas-de-machaca-stewed-brisket-and-cheese-chivichangas\">chimichangas</a>.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/10/07/magazine/07mag-eat-image1/07mag-eat-image1-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "12 tortillas", "recipeCuisine": "mexican", "recipeCategory": "lunch, snack, breads, project", "keywords": "flour, kosher salt, lard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 316}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 140, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "116 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 heaping cups (10 ounces) all-purpose flour, plus more for rolling", "1 1/2 teaspoons kosher salt", "1 1/4 teaspoons baking powder", "Scant 1/2 cup (3 ounces) lard, melted", "1/2 cup plus 2 tablespoons (5 ounces) hot tap water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer, whisk together flour, salt and baking powder. Place bowl onto mixer, and affix paddle attachment. Mix for 30 seconds at low speed, then slowly add lard in a thin stream. Allow fat to partly incorporate, then slowly pour water in a thin stream. Allow dough to come together, then increase speed to medium-low and knead for about 2 minutes. The dough will be somewhat wet, webby and shiny. Place dough in a plastic bag, and allow to rest at room temperature for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough into 12 pieces the size of a golf ball. Roll into smooth balls, and place on a parchment-lined baking sheet. Cover with plastic, and allow to rest at room temperature for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working on a very lightly floured smooth surface, use a rolling pin to roll balls into 4-inch circles, and place onto a parchment-lined baking sheet in a single layer. Repeat with remaining dough, adding layers of parchment as needed to ensure tortillas do not touch or overlap. Cover last layer with parchment, and allow dough to rest 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a griddle or large cast iron skillet over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working on a very lightly floured smooth surface, use a rolling pin to roll each tortilla into an 8-inch circle: Start with the pin in the center of the circle and roll out to the edge, rotating the tortilla after every roll. Roll until the dough is very, very thin and the edges begin to smear onto the work surface. Alternatively, stretch tortillas out by hand, rotating and pulling gently from the edges, until nearly transparent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When a few drops of water dripped onto the griddle or pan immediately sputter and evaporate, the cooking surface is sufficiently hot. Gently peel the tortilla off the work surface, and lay onto the griddle. It should immediately sizzle and puff lightly. Cook, rotating, for 20 to 30 seconds per side, until lightly golden in spots. Stack in a resealable plastic bag to allow to steam and soften. Continue with remaining tortillas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve warm or use to make tacos, quesadillas or burritos."}]}