{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Creamy Kale With Fontina and Bread Crumbs", "description": "This recipe, made in a slow cooker or on the stovetop, is a rich, satisfying way to eat hearty winter greens, a dish especially suited to a holiday table. Crunchy, lemony panko lends a crucial counterpoint to the creamy braised kale. Use any variety of kale you like, though collards or mustard greens would also work well. Fontina melts beautifully and is a flavorful but relatively mild cheese, making it ideal here. The cream cheese adds tang while stabilizing the fontina and keeping it creamy even as it sits on the table for a long meal.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2018/11/06/dining/sg-kale/sg-kale-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "bread crumbs, cream cheese, fontina, kale, fall, winter, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 227}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 545, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "6 grams", "proteinContent": "16 grams", "saturatedFatContent": "17 grams", "sodiumContent": "538 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 to 3½ pounds kale (3 to 5 large bunches), stemmed and leaves roughly chopped or torn into bite-size pieces", "3/4 cup olive oil", "1 teaspoon kosher salt, plus more for seasoning", "1 tablespoon balsamic vinegar, preferably aged", "3 tablespoons unsalted butter", "1 cup panko-style bread crumbs", "Black pepper, for seasoning", "Finely grated zest and juice of 1 lemon", "8 ounces cream cheese, at room temperature", "8 ounces fontina, grated (about 2 heaping cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Slow Cooker Method", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the kale to a 6- to 8-quart slow cooker in 3 batches: Season each batch with about a third of the olive oil, salt and vinegar, and vigorously massage into the kale with your hands. This will soften and tenderize the kale, causing it to shrink and fit in the slow cooker. Cook the kale until it's very tender, 3 to 4 hours on low, stirring once or twice to ensure even cooking. (The greens will hold well on warm for up to 2 more hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the bread crumbs: Melt the butter in a small skillet over medium-high heat. Add the panko, season with a pinch of salt and more generously with pepper, and cook, stirring constantly, until the bread crumbs are a deep golden-brown, about 3 minutes. Stir in the lemon zest and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon, break up the cream cheese, and drop the pieces into the slow cooker with the kale. (The slow cooker should be on low or warm.) Stir well until the cream cheese has melted into the kale. Add the fontina and the lemon juice, stir, then cover the slow cooker and let the cheese melt, about 1 minute. Stir to evenly combine. Scoop the kale mixture out onto a shallow serving bowl or plate. Evenly spoon the bread crumbs on top to serve."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Stovetop Method", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the kale to a large Dutch oven in 3 batches: Season each batch with about a third of the olive oil, salt and vinegar, and vigorously massage them into the kale with your hands. This will soften and tenderize the kale, causing it to shrink and allowing it to easily fit into the pot. Cover the pot and cook on low to medium-low, stirring every 10 minutes, until the kale is very tender, about 30 minutes. Adjust the heat to low if you feel the kale is browning or sizzling rather than gently braising."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the bread crumbs: Melt the butter in a small skillet over medium-high heat. Add the panko, season with a pinch of salt and more generously with pepper, and cook, stirring constantly, until the bread crumbs are a deep golden-brown, about 3 minutes. Stir in the lemon zest and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon, break up the cream cheese, and drop the pieces into the slow cooker with the kale, over low heat. Stir until the cream cheese has melted into the kale. Add the fontina and the lemon juice, stir, then cover the pot and let the cheese melt, about 1 minute. Stir to evenly combine. Scoop the kale mixture out onto a shallow serving bowl or plate. Evenly spoon the bread crumbs over the top to serve."}]}]}