{"@context": "http://schema.org", "@type": "Recipe", "name": "Barbecue Chicken Pizza", "description": "This simple recipe celebrates a 1980s classic invented by the American pizza genius Ed LaDou (whose fingerprints are also on Wolfgang Puck’s famous smoked-salmon pizza). The pizza matches the flavors of chicken with barbecue sauce, red onion, two kinds of cheese and a little cilantro. Use homemade dough and barbecue sauce, cook it in the hottest setting of your oven, and the classic pie goes from good to great. Want to make the recipe vegetarian? Simply substitute mushrooms for the chicken and sauté until most of their moisture is evaporated.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2019/01/06/magazine/06mag-eat-image2/06mag-eat-image2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 12-inch pizzas", "recipeCuisine": "american", "recipeCategory": "pizza and calzones", "keywords": "barbecue sauce, chicken, mozzarella, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 123}, "recipeIngredient": ["10 ounces chicken breast or boneless, skinless thighs, cut into 1-inch pieces", "1 teaspoon kosher salt", "3 tablespoons olive oil", "1/4 cup plus 2 tablespoons barbecue sauce", "2 17-ounce balls pizza dough <a href=\"https://cooking.nytimes.com/recipes/1016230-robertas-pizza-dough\">(see recipe)</a>", "8 ounces fresh mozzarella, roughly sliced", "1/2 red onion, cut into 1/4-inch slices", "2 ounces Gouda, roughly grated", "A few sprigs fresh cilantro, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500. Season the chicken with salt, and heat 1 tablespoon of oil in a saucepan over medium heat. Toss the chicken into hot oil, and cook for about 5 minutes, shaking the pan occasionally, until you no longer see any pink. Add 2 tablespoons of barbecue sauce, and stir well, then set aside off the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working on two separate pieces of parchment paper, use your hands to stretch the 2 balls of dough into 2 rough circles, about 12 inches in diameter. Slide each piece of parchment paper onto a baking tray, and finish assembling pizza there: Drizzle with remaining olive oil, spread with remaining barbecue sauce, then evenly divide the mozzarella all over. Top with chicken pieces, red onion and finally Gouda."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 15 minutes, or until dough is cooked through and edges of the onion and cheese are just starting to color. Once the pizza is slightly cooled, season with salt and pepper and scatter with cilantro."}]}