{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Ruby Red Shrimp", "description": "", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "concord grapes, mussels, shrimp, main course", "aggregateRating": null, "recipeIngredient": ["16 (about 1/2 pound) fresh mussels", "4 1/3 cups Concord grapes", "1/2 pound fingerling potatoes", "1 teaspoon salt", "2 sprigs fresh thyme", "3 cloves garlic, peeled and lightly crushed", "1 tablespoon butter", "8 ounces smoked bacon slices", "1 tablespoon olive oil", "3 shallots, peeled and thinly sliced", "1 inch fresh ginger, roughly chopped", "1 stalk lemon grass, cut into large pieces and lightly crushed", "1 ounce Tellicherry peppercorns, lightly crushed", "1/2 cup red vermouth", "Juice of 1 lime", "16 large fresh shrimp, peeled except for tips of tails", "1/4 pound arugula, washed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot with a steaming basket, steam mussels over 1 inch of water until shells open. Set aside steaming water. Remove mussels from their shells and reserve. With a paring knife, halve and seed one-third of grapes and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place potatoes in mussel water; if necessary, add water to cover. Add salt, thyme and garlic, and place over medium-low heat. Simmer until potatoes are slightly tender, about 7 minutes. Strain potatoes, peel while warm, and slice into rounds about 1/8 inch thick. Place a wide saucepan over medium heat, melt butter, and add bacon slices. When bacon has begun to firm up, add potatoes, and saut&#233; until bacon slices are lightly browned. Remove from heat and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan over medium high heat, combine olive oil, shallots, ginger and lemon grass. Cover and sweat mixture until shallots are translucent. Add remaining grapes, peppercorns and vermouth, and cook uncovered, stirring occasionally, for 10 minutes. Place a wire mesh strainer over a bowl, and strain sauce, discarding solids. In a saucepan over medium heat, reduce sauce by one-third, then set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one inch of water in a pot with a steaming basket, add lime juice, and bring to a boil. Steam shrimp just until pink, 2 to 3 minutes, then remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place arugula in a large bowl, and add potato and bacon mixture; toss gently to mix. Add halved grapes and reserved mussels, and toss again. Place equal portions of mixture on each of four serving plates, and top with a row of four shrimp. Drizzle sauce over all, and serve."}]}