{"@context": "http://schema.org", "@type": "Recipe", "name": "Rabbit With Morels, Spring Peas and Sage Grits", "description": "There’s nothing fancy about this rabbit with mushrooms and peas, but it is surprisingly hearty and straightforward.", "author": {"@type": "Person", "name": "William Grimes"}, "image": null, "totalTime": "PT1H", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "for two", "keywords": "grits, mascarpone, morels, rabbit, spring peas, main course, spring", "aggregateRating": null, "recipeIngredient": ["1 cup all-purpose flour", "Salt and freshly ground black pepper", "1 whole rabbit, cut into serving pieces", "1/2 cup olive oil", "8 pearl onions, peeled", "4 baby turnips", "4 baby carrots", "6 to 8 morels, trimmed and washed", "1/2 cup fresh spring peas", "1 1/2 cups milk, plus more as needed", "6 ounces Anson Mills or other organic grits", "1 1/2 cups mascarpone", "2 tablespoons fresh sage leaves, lightly toasted and coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine flour with salt and pepper to taste. Dredge rabbit pieces in flour, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large skillet over medium-high heat, and add oil. When oil is hot, add rabbit pieces, taking care not to crowd pan. Sauté until rabbit is well browned and meat is opaque, transferring pieces to a platter as they are cooked. Set aside, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return pan to medium-high heat, and add onions and turnips. Sauté until lightly browned, 4 to 5 minutes. Add carrots and morels, and sauté until vegetables are just tender. Add peas, and cook until tender. Transfer to rabbit platter, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a saucepan over high heat, add milk, and bring to a simmer. Add grits, reduce heat to medium. Stir every 5 minutes until grits are creamy but slightly stiff, holding their shape when spooned, 25 to 30 minutes. Add milk if they become too stiff. Stir in mascarpone, and season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place equal portions of rabbit and vegetables on each of two large plates. Add a portion of grits to each plate, and garnish with chopped sage."}]}