{"@context": "http://schema.org", "@type": "Recipe", "name": "Quiche Lorraine", "description": "There are plenty of opportunities in cooking to riff and freestyle, and many dishes that you can legitimately “set and forget” until mealtime. But this quiche Lorraine is definitely not one of them. If you aren’t in the mood to build — stone by stone — the most classic, tender, custardy, haunting quiche you’ve ever had in your life, continue on and come back another day. If you’re still here, it’s just a matter of enjoying yourself as you take meticulous care with each ingredient, including the size and depth of the pan; each step, including the temperature changes of the oven; and each direction along the way. The downright platonic ideal of quiche that results is the fragrant, golden, encouraging reminder that, as with any endeavor, you only ever get out of it what you put into it.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2018/11/25/magazine/25mag-eat-image1/25mag-eat-image1-articleLarge.jpg", "totalTime": "PT3H35M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "brunch, dinner, lunch, pies and tarts", "keywords": "gruyère, heavy cream, pancetta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 230}, "recipeIngredient": ["1 cup flour", "1 healthy pinch salt", "1 egg", "5 tablespoons cold unsalted butter, cut into cubes the size of your thumbnail", "Ice water", "1 tablespoon butter, for the pan", "7 ounces pancetta, sliced into short matchsticks", "1 teaspoon grapeseed or neutral oil", "7 ounces Gruyère, coarsely grated (about 2 cups)", "2 large eggs", "4 large yolks", "2 cups heavy cream", "Salt and pepper", "A nut of nutmeg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix flour and salt with a fork in a large bowl. Make a well in the center, and add the egg and butter. Mix all the ingredients, using the fork to mash the butter and beat the egg into the flour, until everything is blended together, roughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon over the dough about 1 to 3 tablespoons of ice water, and mix together, using the fork or a plastic flexible pastry dough scraper. If using a dough scraper, press down on the dough and smear it a bit, to get the butter cubes to incorporate without letting the heat of your hands warm up the dough. Work quickly and with muscle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use your hands to quickly work the dough into a flat disc, and refrigerate an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a false-bottomed fluted tart pan, 8 inches wide and 2 inches deep. Refrigerate pan. Roll dough on a lightly floured surface to 1/8 inch, rotating every few strokes, to keep the disc round and even. Drop the disc over the tart pan, and gently press the dough into the bottom and side, allowing excess to extend beyond the top of the ring. Roll a pin over the tart shell, and remove the excess dough. Use your finger to press each flute of the fluted edges. Prick the floor of the shell with a fork several times, then freeze the shell for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the tart pan on a baking sheet, line the shell with parchment and fill with baking beans. Bake at 425 for 20 minutes. Remove the parchment and the beans, and if bottom is not beginning to turn golden, return to oven for a few minutes until it starts to puff and toast golden. Let cool on a rack until ready to fill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the pancetta in boiling water and drain, rinse in cold water, drain and then dry on paper towels. Heat the oil in skillet, and brown the pancetta over medium heat, then drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the cooked pancetta in the bottom of the pastry shell. Then sprinkle around the grated Gruyère, minus 1 loose handful."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the eggs and the yolks, then add the cream and whisk together until homogeneous. Season with salt and pepper and a few vigorous rasps of the nutmeg on a microplane. Pour the custard into the tart shell, place on a baking sheet and bake at 425 for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower temperature to 400, and if the quiche is getting dark, cover loosely with foil, then continue baking for 10 or 15 more minutes, until the center just puffs and starts to crack, with a still-jiggly center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove quiche from oven, and scatter remaining cheese across the top. Place on a wire baking rack to cool, remove the ring and let set at least 30 minutes before serving."}]}