{"@context": "http://schema.org", "@type": "Recipe", "name": "Seafood Pasta With Tomato and Crushed Olives", "description": "Think of this as a weeknight fish stew with pasta rather than a seafood pasta. It's highly customizable: You can use whatever seafood you like, including but not limited to shellfish, like mussels, clams or shrimp, and firm-fleshed white fish, such as cod, halibut or flounder. The trick is to make sure the garlicky tomatoes are brothy enough to gently poach the seafood (which then further flavors the sauce), yet thick enough to coat each tube of pasta. Finished with briny olives and a smattering of fresh parsley, it's best eaten with a spoon and lots of thick-cut toast for sopping up all the goods.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/09/19/dining/19Romanrex1/merlin_141970401_4e9c0bdc-cb4d-4d33-80ac-f9808d187cfd-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas, seafood", "keywords": "cod, mussels, olives, pasta, shrimp, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 538}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 509, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "5 grams", "proteinContent": "38 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1089 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces rigatoni or another tube-shaped pasta", "Kosher salt", "3 tablespoons olive oil, plus more for drizzling", "4 garlic cloves, sliced", "Pinch of red-pepper flakes (optional)", "1 (28-ounce) can whole San Marzano tomatoes, crushed by hand", "1/2 pound mussels or clams (optional)", "1 pound firm-fleshed white fish, such as cod, halibut, swordfish, hake or flounder, cut into 2-inch pieces", "1/2 pound shrimp, peeled and deveined if you like", "3/4 cup Castelvetrano or other green olives, pitted and crushed", "1/2 cup parsley, tender leaves and stems, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook pasta in a large pot of boiling salted water. Once it reaches al dente, drain and set aside while you finish the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat olive oil in a heavy-bottomed Dutch oven over medium heat. Add garlic and season with salt. Cook, stirring occasionally, until garlic is lightly browned and toasted around the edges, about 2 minutes. Add red-pepper flakes, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes and then fill the empty can about 3/4 of the way up with water. Swirl the can to loosen the tomatoey bits left behind and add that to the pot. Season with salt, bring to a simmer and cook, stirring occasionally, until sauce has thickened slightly (it should still look quite brothy), 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mussels or clams to the sauce, if using, along with the fish, and season again with salt. Let the seafood settle into the brothy tomato sauce and gently swirl the pot, encouraging the seafood to cook evenly. Cook a minute or two, then add the shrimp, swirling the skillet again. Cook until all the seafood is just cooked through and the mussels or clams have opened, another 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta and very gently toss to coat, cooking another 1 to 2 minutes, just to let the flavors meld. Add olives and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among bowls, top with parsley and drizzle with olive oil before serving."}]}