{"@context": "http://schema.org", "@type": "Recipe", "name": "Meatloaf Parmesan", "description": "A bit retro, but heartwarming and homey, this recipe is an amalgam of meatloaf, polpettone and meatballs. Ground veal and pork, provolone, pecorino and Parmesan mingle with herbs, broccoli rabe and bread crumbs in what is essentially a sliceable meatball. It is doused with tomato sauce and baked until bubbly, aromatic and mouthwatering.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/10/10/dining/10Kitchen1/merlin_144676881_eaa198c5-3e80-4652-98c1-2c5f5cba7bd7-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles, meatballs", "keywords": "bread, broccoli rabe, pork, veal, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 202}, "recipeIngredient": ["1 pound ground veal, or substitute ground beef or turkey", "1 pound ground pork", "2 teaspoons kosher salt", "1/2 teaspoon black pepper", "Healthy pinch of red-pepper flakes", "1 teaspoon crushed fennel seed", "1/8 teaspoon nutmeg", "1 cup dry bread, cut in 1/2-inch cubes, soaked in 1 cup milk until softened", "2 eggs, beaten", "3 tablespoons chopped parsley", "1/2 teaspoon dried oregano", "5 ounces cooked broccoli rabe or spinach, blanched, squeezed dry and chopped (about 3/4 cup)", "1 cup pitted green olives, roughly chopped", "1 ounce grated Parmesan (about 1 cup)", "5 ounces provolone, cut in 1/4-inch dice (about 1 cup)", "5 bay leaves", "4 tablespoons olive oil", "1 cup diced onion", "1 whole garlic clove", "Salt, to taste", "2 1/2 cups tomato purée", "1 1/2 cups crushed tomatoes", "Pinch of red-pepper flakes", "1 basil sprig", "1 ounce grated pecorino (about 1 cup)", "4 ounces grated provolone (about 3/4 cup)", "1/2 cup dry bread crumbs", "Basil leaves, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put veal and pork in a large mixing bowl. Add salt, black pepper, red pepper, fennel seed and nutmeg. Knead mixture with hands to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add soaked bread with milk, eggs, parsley, oregano, broccoli rabe, olives, Parmesan and provolone. Mix again with hands and knead to make sure all ingredients are distributed evenly. Pat mixture into a free-form loaf and place in a 9-by-13-inch baking dish. Press bay leaves on top. You may complete this step several hours, or a day in advance, of baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make tomato sauce: Put olive oil in a nonreactive pan over medium heat. Add onions, garlic clove and a little salt, then cook, stirring, until translucent, about 8 to 10 minutes. Add tomato purée, crushed tomatoes, red-pepper flakes and basil sprig. Simmer for 10 minutes. Taste and adjust seasoning. Sauce may be made in advance, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Spoon sauce over meatloaf, letting it spill over into the baking dish to surround loaf. Sprinkle top of loaf with grated pecorino and provolone, then sprinkle with bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake at 400 degrees for 30 minutes, then cover, reduce heat to 350 and cook for 30 to 45 minutes more, until internal temperature is 150 degrees. Let rest at least 10 minutes before slicing. Top each serving with a good spoonful of sauce and garnish with basil leaves, if using."}]}