{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Sheet Cake With Buttercream Frosting", "description": "This pleasantly zesty lemon cake is baked in a standard 9-by-13-inch pan, no layering or trimming required, and is easy enough to bake on a weekday. Cover the cake with casual swoops of fluffy lemon buttercream for the perfect teatime or anytime treat.", "author": {"@type": "Person", "name": "Yossy Arefi"}, "image": "https://static01.nyt.com/images/2018/04/02/dining/02COOKING-LEMONCAKE1/02COOKING-LEMONCAKE1-articleLarge-v3.jpg", "totalTime": "PT50M", "recipeYield": "One 9-by-13-inch cake", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dessert, lemon juice, lemon zest", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1269}, "recipeIngredient": ["1 cup/227 grams unsalted butter (2 sticks), softened, plus more for preparing the pan", "3 cups/385 grams all-purpose flour, plus more for preparing the pan", "1 1/3 cups whole milk", "1/4 cup fresh lemon juice", "1 1/4 teaspoons baking powder", "3/4 teaspoon baking soda", "1 teaspoon kosher salt", "2 cups/403 grams granulated sugar", "4 teaspoons packed finely grated lemon zest", "4 large eggs, at room temperature", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), softened", "2 cups/246 grams confectioners’ sugar", "1 teaspoon finely grated lemon zest", "Pinch kosher salt", "4 to 5 tablespoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: Heat oven to 350 degrees. Line a 9-by-13-inch baking pan with parchment paper, butter and flour the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a measuring cup with a spout, combine the milk and lemon juice. Whisk the flour, baking powder, baking soda and salt together in a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream butter, sugar and lemon zest until light and fluffy, about 5 minutes. Add eggs, one at a time, mixing for about 30 seconds after each. Scrape down bottom and sides of the mixer to ensure the mixture is well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With the mixer on low speed, alternately add the flour mixture and milk mixture to the bowl in three additions. Mix until just combined, then use a rubber spatula to finish mixing the batter. Pour the batter into the prepared pan, smooth the top and tap the pan on the counter a few times to release any large air pockets. Bake for 35 to 40 minutes or until puffed and golden and a cake tester inserted into the center comes out clean. Cool the cake completely on a rack before frosting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the frosting: Combine the butter, confectioners' sugar, lemon zest and a pinch of salt in the bowl of a stand mixer fitted with the paddle attachment. Mix on low until combined, then turn the mixer up to medium-high and stream in 3 tablespoons of lemon juice. Whip the frosting until very light and fluffy, about 5 minutes, adding additional lemon juice as necessary until frosting is smooth and spreadable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the frosting over the cooled cake and serve. Store leftover cake at room temperature, covered for up to 2 days."}]}