{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom-Parmesan Tart", "description": "Cremini mushrooms and Parmesan star in this hearty tart, a comforting winter brunch or lunch when paired with a vibrant salad. Make the crust from scratch, and you’ll have two tart shells for the work of one — one for now, and another for later. Chances are you’ll want to make this tart again and again: It’s a relatively easy, make-ahead crowd-pleaser. But if you don’t have time (or energy) to make the dough, a store-bought pie crust will serve you well.", "author": {"@type": "Person", "name": "Klancy Miller"}, "image": "https://static01.nyt.com/images/2019/01/23/dining/KM-mushroom-parmesan-tart/merlin_149237076_e1820641-0867-419c-81ff-60951beef849-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "brunch, lunch, weeknight, pies and tarts", "keywords": "dough, mushroom, parmesan, thyme, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 267}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 529, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "2 grams", "proteinContent": "16 grams", "saturatedFatContent": "21 grams", "sodiumContent": "500 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/3 cups/300 grams all-purpose flour, plus more for dusting", "1 teaspoon kosher salt", "1/2 teaspoon granulated sugar", "1 cup/225 grams unsalted butter (2 sticks), cut into small pieces and chilled", "1/4 to 3/4 cup ice water, as needed", "2 tablespoons extra-virgin olive oil", "1 medium red onion, halved and thinly sliced", "Kosher salt", "1 1/4 pounds thinly sliced cremini mushrooms (about 8 cups)", "1 tablespoon fresh thyme leaves (from 4 sprigs fresh thyme)", "Black pepper", "2 large eggs", "1/3 cup heavy cream", "5 ounces Parmesan, grated (about 1 1/2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dough: In a large bowl, whisk together the flour, salt and sugar. Add the butter and rub it into the flour between your fingers until the butter is in pea-size pieces and the mixture resembles a sandy meal. Add the ice water into the flour mixture 1 tablespoon at a time, stirring with your hands or a fork as you go. Add water until the dough forms a cohesive shaggy mass and most of the flour at the bottom of the bowl has been incorporated. Knead the dough in the bowl a few times if necessary, just until it holds together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 2 equal balls and flatten each into a 1-inch-thick disc. Wrap each in plastic, and transfer to the refrigerator to chill for at least 1 hour. (The dough may be stored in the refrigerator up to 3 days, or in the freezer for up to 1 month.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Heat 1 tablespoon olive oil in a large skillet over medium. Add the onion, sprinkle with a pinch of salt, and cook, stirring occasionally, until the onion is translucent and slightly browned in spots, 5 to 7 minutes. Transfer to a large mixing bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 1 tablespoon olive oil to the skillet and heat over medium. Add the mushrooms and thyme, season with salt and pepper, and cook, stirring occasionally, until mushrooms are tender and their liquid has evaporated, 8 to 12 minutes. Transfer to the large mixing bowl with the onion and let cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take one disc of dough from the refrigerator and roll it out on a floured work surface into an 11-inch circle. Fit the crust into a 9-inch tart pan with a removable bottom (or a pie pan), trimming off or crimping any extra dough around the perimeter. Freeze the crust in the pan for 15 minutes or refrigerate for 1 hour. (If using a store-bought pie shell, pour the mushroom mixture into the crust and, using a spoon, spread it evenly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. In a small bowl, whisk together the eggs and cream; season with salt and pepper. Pour into the bowl with the mushroom mixture, add the cheese and stir until combined. Transfer the mixture into the prepared tart pan and spread it into an even layer using a rubber spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake tart for about 40 minutes, until the crust and filling are golden-brown. Let cool 10 minutes in the pan, then serve hot."}]}