{"@context": "http://schema.org", "@type": "Recipe", "name": "Peking Duck With Honey and Five-Spice Glaze", "description": "Peking duck is one of the most famous and popular Chinese dishes. The traditional method is grand and laborious, requiring three days of intense preparation. This recipe simplifies that method for a home version that comes pretty close to the original. For that coveted crisp, golden skin, all the excess fat is trimmed, and the skin is separated from the meat. The duck is then air-dried overnight and roasted vertically to ensure even cooking, while rendering out the fat. The crunchiest skin comes from the duck’s backside and legs, so carve them off first to maintain their crackly texture. A simple honey and five-spice glaze creates a beautiful mahogany lacquer on the finished duck.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/01/28/dining/kc-peking-duck/kc-peking-duck-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, meat", "keywords": "duck, hoisin sauce, honey, sesame oil, fall, spring, summer, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 143}, "recipeIngredient": ["3 tablespoons mild honey, such as clover, acacia or orange blossom", "2 tablespoons low-sodium soy sauce", "1 teaspoon turbinado or light brown sugar", "1 teaspoon five-spice powder", "1 (5- to 6-pound) Peking or Long Island duck", "3 teaspoons kosher salt", "1/2 teaspoon black pepper", "1 (24-ounce) beer can or other aluminum can, emptied and filled halfway with water", "1/2 cup hoisin sauce", "1 teaspoon toasted sesame oil", "8 <a href=\"https://cooking.nytimes.com/recipes/1018334-chinese-wheat-wrappers\">homemade Chinese tortillas</a>, or 8-inch store-bought flour tortillas, warmed", "4 scallions, cut into 3-inch pieces and thinly sliced lengthwise", "2 Kirby or Persian cucumbers, cut into 3-inch-long matchsticks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine honey, soy sauce, sugar and 1/2 teaspoon five-spice powder in a small saucepan. Stir over low heat until sugar dissolves, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, bring 4 quarts water to a boil. Meanwhile, remove giblets and neck from duck cavity and discard (or reserve for another use). Cut off excess fat from cavity and neck area, then cut off tail. (This helps balance the duck vertically over the beer can.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your fingers, carefully separate the skin from the breast meat through the bottom of the breasts and work your fingers upward to separate the skin from the meat (be careful not to tear skin). Next, separate the skin from the backbone through the neck and working your way down until you reach the legs. (Scissors are helpful, but be careful to avoid piercing the skin.) Transfer duck to a rack set in the sink."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a ladle or measuring cup, pour half of the boiling water evenly over top of the duck. Flip duck and pour the remaining water evenly all over second side. Tilt duck to drain all water from the cavity, then pat dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the remaining 1/2 teaspoon five-spice powder with 1 teaspoon salt, the black pepper and 1 tablespoon of the glaze. Rub the mixture inside the cavity. Stand duck vertically by inserting beer can into cavity and place in a roasting pan or on a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pastry brush, brush the remaining glaze all over the duck and sprinkle evenly with remaining 2 teaspoons salt. Place duck in the refrigerator, uncovered, until the skin feels dry and leathery, 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees with rack in bottom third of oven. Remove duck from refrigerator, and add 1 1/2 cups water to the pan. Wrap wing tips and tips of drumsticks with foil to prevent burning, then loosely tent duck with foil. Roast for 15 minutes. Decrease temperature to 350 degrees and roast, tented with foil, until skin is mahogany and an instant-read thermometer inserted into the thickest part of the thigh registers 165 degrees, 1 hour to 1 hour 15 minutes more, adding more water to the pan if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving duck on the can, transfer duck vertically to a cutting board and let rest for 15 minutes. Carve the crispy skin from the back and legs of the duck, and slice into strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully remove duck from the beer can and return to cutting board. Carve off the breasts and legs; thinly slice the breasts and shred dark meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully strain pan juices into a small bowl and pour off all the fat. In another small bowl, whisk together the hoisin, sesame oil and up to 1/4 cup of the pan juices to form sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spread 1 tablespoon prepared sauce on each tortilla. Top each with some scallions, cucumbers, duck meat and crispy skin. Roll up and enjoy warm."}]}