{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Pie With Pimento Cheese Topping", "description": "Tomato pie is just the kind of supper a Southern cook might serve in the summer: savory and rich, but vibrant with super-fresh vegetables and herbs. Virginia Willis, a Georgia native and food writer, had the inspired idea to add a topping of pimento cheese, another Southern classic. There are multiple steps here because of the scratch-made crust, but everything can be baked in the cooler parts of the day, and the pie can be served warm or at room temperature.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/08/08/dining/08Southernrex1/merlin_141954978_e767e02a-ca96-4ddd-962b-cb220b249943-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "american, southern", "recipeCategory": "brunch, dinner, lunch, pies and tarts", "keywords": "cheddar, herbs, pie crust, pimento, tomatoes, fall, summer, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 118}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 408, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "13 grams", "sodiumContent": "435 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups/250 grams all-purpose flour, more for flouring the work surface", "1 teaspoon fine sea salt", "4 ounces/113 grams chilled unsalted butter (1 stick), cut into 1/2-inch cubes", "2 large egg yolks", "Ice water", "1 1/2 pounds ripe tomatoes (about 3 medium)", "Kosher salt", "2 thick slices bacon, cut into lardons (large matchsticks), or 1 tablespoon olive oil", "1 sweet onion, such as Vidalia or red onion, very thinly sliced", "1/2 cup mixed chopped fresh herbs, such as chives, parsley and basil", "Ground black pepper", "1 1/4 cups grated sharp cheddar cheese (about 4 ounces)", "1/3 cup mayonnaise", "1 tablespoon diced pimentos (roasted, preserved sweet red peppers)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dough: In a food processor fitted with the metal blade, combine the flour and salt. Add the butter. Process until the mixture resembles coarse cornmeal, 8 to 10 seconds. Add the egg yolks and pulse until just combined. Pulse in 5 to 6 tablespoons ice water, 1 tablespoon at a time, just until the mixture holds together as a soft dough, not crumbly or sticky. Use your hands to shape into a 1-inch-thick disk, wrap in plastic and refrigerate until firm, about 30 minutes (or longer, if desired)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a clean work surface and rolling pin. Unwrap and roll out the dough, starting in the center and rolling up to, but not over, the top edge of the dough. Return to the center, and roll down to, but not over, the bottom edge. Give the dough a quarter turn, and continue rolling, repeating the turns until you have a circle about 1/8-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a 9-inch pie pan, being careful not to stretch or pull the dough. Cut away any excess dough, leaving enough to make a thick edge around the rim. Tuck the edges under, press together and, if desired, crimp the edge. Chill until firm, at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the crust: Heat oven to 425 degrees. Prick the bottom of the dough lightly all over with a fork. Line the dough with parchment paper and fill with pie weights, dried beans or uncooked rice, enough to come halfway up the sides of the pan. Bake for 20 minutes. Remove from the oven and remove the paper and weights. Set crust aside to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, line a rimmed baking sheet with paper towels. Using a serrated knife, core the tomatoes and slice them 1/4 inch thick. Place a layer of tomato slices on the baking sheet and sprinkle lightly with kosher salt. Top with more paper towels and repeat with remaining tomatoes. Set aside for at least 30 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using bacon, place in a medium skillet over medium heat, and cook until just crisp, about 5 minutes. Drain on paper towels. Pour off all but about 1 tablespoon of the rendered fat from the pan (discard the fat or reserve it for another use). Or, skip the bacon and start the next step with 1 tablespoon olive oil in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the bacon fat or olive oil over medium heat, then add onions and a pinch of salt. Cook, stirring often, until lightly caramelized and golden brown, about 20 minutes. (Don’t rush this process: the onions should not be white or crunchy.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the pie: Heat oven to 350 degrees. Pat half the tomatoes dry with paper towels and arrange closely in the pie crust. Add half the onions, bacon and herbs. Season with salt and pepper. Repeat with remaining tomatoes, onions, bacon and herbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine the cheese, mayonnaise and pimento very well. Gently spread the mixture on top of the pie. Bake for 30 minutes, or until lightly browned. Transfer to a wire rack to cool at least 30 minutes. Serve warm or at room temperature, slicing with a serrated knife."}]}