{"@context": "http://schema.org", "@type": "Recipe", "name": "Clams and Spaghetti With Spicy Tomato Broth", "description": "Many Italian recipes call for simmering fish and shellfish in “acqua pazza,” or crazy water. It's a quick way to make a small amount of tasty broth, and obviously more flavorful than cooking fish in plain water would be. Every cook makes it differently, but most recipes involve olive oil, tomato and a pinch of crushed red pepper. Garlic, parsley, capers, lemon and even smashed anchovy could also be part of the mixture. The end result is the perfect year-round medium for cooking fish fillets or shrimp or to serve as the base for a brothy bowlful of clams and spaghetti. It takes only a few minutes, and the cooking liquid, conveniently, is also the sauce. Basil leaves and fresh cherry tomatoes, halved and drizzled with olive oil and salt, give the dish a summery feel.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/05/23/dining/23kitchen1/merlin_137723106_2db7ed24-22b7-4018-a86d-c10f51910322-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, pastas, seafood", "keywords": "cherry tomatoes, clams, dry white wine, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 163}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 31, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "88 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Extra-virgin olive oil", "1 small onion, diced", "1/2 cup chopped green garlic shoots or 2 teaspoons minced garlic", "1 bay leaf", "2 or 3 medium hot fresh red peppers, such as Dutch or Fresno, cut into 1/4-inch slices, or 1/2 teaspoon dried red-pepper flakes", "1 large thyme sprig", "Salt and pepper", "2 cups crushed tomatoes (canned is fine)", "1 cup dry white wine", "4 or 5 pounds small clams, such as manila or cherrystones", "1 pound spaghetti", "2 cups red and yellow cherry tomatoes, halved", "1 tablespoon thinly sliced chives", "2 tablespoons roughly chopped parsley", "Handful of basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large pot of water on a back burner over medium-high heat, covered, so it is ready and boiling when it’s time to cook the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a wide Dutch oven or deep heavy-bottomed skillet with a lid over medium-high heat. Add 2 tablespoons olive oil. When the oil is hot, add onion, and cook, stirring, for about 2 minutes, until softened and lightly colored."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in chopped green garlic, bay leaf, hot pepper and thyme sprig. Stir to coat and let sizzle. Season mixture generously with salt and pepper. Add tomatoes and wine, and bring mixture to a brisk simmer, stirring. Simmer 5 minutes, then taste and adjust seasoning. Thin with water if necessary: You don’t want it to be too thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt the pasta water and cook the spaghetti at a rapid boil until al dente — usually a minute or 2 less than instructions on package."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add clams to Dutch oven or skillet, turn heat to high and put on the lid. Stir clams with a large spoon a couple of times (to help heat disperse evenly) and replace lid. They should take 5 to 6 minutes to open. Once all clams are open, turn off heat and leave to rest, covered, for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain pasta and, using tongs, divide among 4 to 6 bowls. Using a large slotted spoon or tongs, top pasta with an equal amount of clams. Ladle all remaining broth in the pot over each serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season halved cherry tomatoes with salt and a little olive oil. Spoon seasoned cherry tomatoes over top of the bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with chives, parsley and basil leaves. Serve."}]}