{"@context": "http://schema.org", "@type": "Recipe", "name": "Open-Faced Hot Turkey Sandwiches", "description": "Sometimes life requires an open-faced turkey sandwich with gravy and mashed potatoes, alongside a glop of cranberry sauce. It is neither a Thanksgiving meal nor a Christmas one, but simply a low-fi American reminder of diners and TV dinners and blankets and comfort itself: soft meat and rich, salty gravy over tight-crumbed bread, with buttery mash and a tang of cranberry. My recipe calls for roasting buttered turkey thighs in the oven while the potatoes were cooking, skin-side down to crisp the skin and allow the fat to render into the pan, creating sticky bits of fond you’ll use to build a base for gravy. Pile the sliced meat onto lightly toasted bread, drench it with gravy and serve alongside the potatoes and peas. Adding canned cranberry sauce, in this application, is no sin.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2018/12/16/magazine/16mag-eat-image1/16mag-eat-image1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "sandwiches", "keywords": "bread, cranberry sauce, mashed potatoes, peas, sage, stock, turkey, white wine, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 73}, "recipeIngredient": ["2 turkey thighs", "4 tablespoons unsalted butter", "Kosher salt and freshly ground black pepper to taste", "1 tablespoon chopped fresh sage", "1 tablespoon lemon zest", "1 cup dry white wine", "2 to 3 cups turkey or chicken stock", "4 tablespoons instant flour, or all-purpose flour", "2 tablespoons cream, milk or half-and-half", "2 slices bread of your choosing, traditionally white sandwich bread", "Buttered peas, mashed potatoes and cranberry sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove turkey and butter from the refrigerator an hour or so before cooking, so that they are approaching room temperature when the turkey goes into the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400. Rub turkey with butter, using your fingers to slide butter under the skin. Season the turkey with salt, pepper, sage and lemon zest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place turkey thighs, skin-side down, into a cast-iron skillet or medium-size oven-safe gratin pan, and roast in the oven for 30 minutes. Turn turkey thighs over, add the wine to the pan or skillet and continue roasting for another 30 minutes or so, basting occasionally, until the turkey is cooked through, golden and crisp, and an instant-read thermometer inserted in the turkey’s thickest part reads in the neighborhood of 165 degrees. Remove turkey thighs from the pan, and allow to rest on a cutting board while you make the gravy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the stock in a small pot. Drain off all but four tablespoons of the fat in the pan or gratin dish. Place pan or dish over low heat on the stove, and whisk the flour into it to make a roux. Stir the roux for 3 to 4 minutes, and then slowly start to add the stock to it, whisking as you do, until the mixture is smooth. Cook, continuing to stir, until the gravy has thickened, approximately 8 to 10 minutes. Add the cream, milk or half-and-half, stir and allow the gravy to thicken again, 2 to 3 minutes more. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sandwiches, carve meat and skin from the turkey thighs, and assemble two separate piles. Toast the bread, and lay one slice on each plate. Put a pile of the meat on each piece of toast, spreading it across the surface of the bread. Absolutely drench each sandwich with the gravy, and serve alongside buttered peas, mashed potatoes and a dollop of cranberry sauce. For this application, canned cranberry sauce is, by etiquette, required."}]}