{"@context": "http://schema.org", "@type": "Recipe", "name": "Butter Tarts", "description": "There may be no more perfectly satisfying treat than a Canadian butter tart. It is small and sweet, bracingly so, with hints of butterscotch and caramel. And each bite delivers three textures: flaky crust, chewy top, gooey center. While its exact origins may never be found, the tart became popular in Ontario in the early 20th century and spread across Canada thanks to its inclusion in the 1913 “Five Roses Cook Book.” Today there are numerous variations. Runny or firm? Raisins or plain? This recipe can be adapted to please all partisans.", "author": {"@type": "Person", "name": "Sara Bonisteel"}, "image": "https://static01.nyt.com/images/2018/01/17/dining/17TartsRex1/merlin_132007970_0525c909-b987-44b4-ab61-4fec3f5925ec-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "1 dozen", "recipeCuisine": "canadian", "recipeCategory": "easy, snack, pies and tarts", "keywords": "brown sugar, raisins, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 824}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 177, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": null, "proteinContent": "1 gram", "saturatedFatContent": "7 grams", "sodiumContent": "100 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cup/191 grams all-purpose flour, more for dusting", "Pinch of fine sea salt", "1/2 cup/113 grams cold unsalted butter or lard (103 grams), cubed", "1/4 cup/60 milliliters ice water", "1 large egg yolk", "1 teaspoon white vinegar", "1/4 cup/36 grams raisins (optional)", "1 cup/220 grams packed brown sugar, light or dark (see Note)", "1/2 teaspoon fine sea salt", "1/4 cup/57 grams unsalted butter, softened", "1 teaspoon vanilla extract", "1 large egg"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry: In a large mixing bowl, combine flour and salt. Using a pastry blender or your fingertips, rub butter or lard into flour until mixture is in pea-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix water, egg yolk and vinegar until well combined. Add liquid to the flour mixture, using a fork to combine. Add 1 tablespoon more water if it looks dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead dough several times by hand to bring it together and shape into a flat square. Wrap with plastic and refrigerate for at least 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once chilled, roll out the dough into a 16-inch-by-12-inch (40.5 centimeters by 30.5 centimeters) rectangle about 1/8- to 1/4-inch (3 to 6 millimeters) thick. Flour the work surface and rolling pin as you work with the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a circular 4-inch (10 centimeter) cookie cutter (or a clean 28-ounce/496 milliliter can) to cut 12 pieces. Reroll dough if needed to cut more circles, but try to cut as many pieces on the first pass. With your fingertips, press each circle into the cup of a standard muffin tin, so that the edge of the dough is flush with the pan. Refrigerate while while you make the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, cover raisins with hot tap water to plump. Heat oven to 425 degrees F (220 degrees C)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a bowl, mix brown sugar and salt, and then beat the butter into the sugar by hand until smooth. Add vanilla and egg and mix until combined. Do not use an electric mixer; it will add too much air to the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the raisins and place seven or eight raisins in each chilled tart shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the filling evenly among the tart shells, filling each one about halfway. Place muffin tin on a baking sheet. Bake 13 to 15 minutes for a runnier tart and 17 to 19 minutes for a firmer one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A few minutes after removing the tarts from the oven, run a knife or offset spatula around the edge of each tart to loosen. Let cool completely in the tin. To remove, run a butter knife or offset spatula around and under each tart to pop it out of the tin."}]}