{"@context": "http://schema.org", "@type": "Recipe", "name": "Old-Fashioned Doughnut Bundt Cake", "description": "This simple vanilla Bundt cake has plenty of freshly grated nutmeg to nod to the flavor of old-fashioned doughnuts. But since it’s baked rather than fried, it also gets a generous coating of melted butter while it’s still warm to give it some of that doughnut richness. Then it’s coated in cinnamon-sugar. It’s neither a doughnut nor a cake – it’s both. It’s delicious right after it’s made, but it tastes even more like an old-fashioned doughnut after sitting overnight. Store it tightly wrapped in plastic wrap at room temperature for up to 4 days.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2018/09/27/dining/ed-doughnut-bundt-cake-horizontal/ed-doughnut-bundt-cake-horizontal-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "butter, buttermilk, cinnamon, flour, nutmeg, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1005}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 460, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "10 grams", "sodiumContent": "310 milligrams", "sugarContent": "37 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["Nonstick cooking spray", "1 cup/225 grams unsalted butter, at room temperature, plus 1/2 cup/115 grams, melted, for finishing", "1 1/2 cups/300 grams plus 2/3 cup/135 grams granulated sugar", "4 large eggs, at room temperature", "1 1/2 teaspoons vanilla extract", "3 1/2 cups/445 grams all-purpose flour", "1 teaspoon freshly grated nutmeg", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "3/4 teaspoon fine sea salt", "1 cup/240 milliliters buttermilk", "2 teaspoons ground cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Generously grease a 10- or 12-cup Bundt pan, taking care to get into all the grooves of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, cream 1 cup/225 grams room-temperature butter and 1 1/2 cups/300 grams sugar on medium speed until light and fluffy, 4 to 5 minutes. Add the eggs one at a time and mix until well incorporated, scraping the mixing bowl after each addition. Add the vanilla and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, nutmeg, baking powder, baking soda and salt to combine. Add half of the flour mixture to the mixer and mix on low speed until incorporated. With the mixer running, add the buttermilk in a slow, steady stream and mix until combined. Add the remaining flour and mix until fully incorporated. Scrape the bowl well to be sure the batter is well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared Bundt pan and spread evenly. Tap the pan heavily on the counter a few times to help even out the batter and remove air pockets. Bake until a toothpick inserted into the cake comes out clean, 45 to 55 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the cake cool in the pan for 15 to 20 minutes, then flip the pan onto a cooling rack set inside a baking sheet. Tap the pan heavily onto the rack. The cake should easily release. If it doesn’t, use a small offset spatula to gently run around the edges of the pan to help release, then tap it again onto the rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix the remaining 2/3 cup/135 grams sugar with the cinnamon to combine. Brush the warm cake all over with melted butter, then spoon cinnamon sugar over the cake. Brush any bare areas with the melted butter and reuse any cinnamon sugar that falls onto the baking sheet below the rack, using your hands to gently press it into the surface of the cake to help it stick. The idea is to get the cake fully coated all over with cinnamon sugar. Let the cake cool completely before serving."}]}