{"@context": "http://schema.org", "@type": "Recipe", "name": "Ginger-Scallion Chicken", "description": "In this easy chicken stir-fry, adapted from Lan Hing Riggin, a home cook from Virginia who grew up cooking with her family in Hong Kong, slivers of ginger and scallions turn golden, adding their sweetness and pungency to the oil. A dash of soy sauce provides saltiness and depth, while a full cup of cilantro leaves, used as garnish, makes the dish a bit lighter and fresher. Fire seekers can add a sliced chile or two along with the ginger.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/05/02/dining/02Appetite1/02Appetite1-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, quick, weekday, weeknight", "keywords": "chicken thighs, cilantro, ginger, scallion, soy sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1372}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 376, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "40 grams", "saturatedFatContent": "3 grams", "sodiumContent": "852 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 large scallions, trimmed", "1/4 cup peanut oil, or neutral oil such as grapeseed or sunflower, more as necessary", "1 3/4 pounds boneless skinless chicken thighs or breasts, cut into 1-inch chunks", "1/2 teaspoon kosher salt, as needed", "1 cup roughly chopped cilantro leaves and tender stems", "1 (2 1/2-inch) piece ginger, cut into thin matchsticks (about 3 tablespoons)", "3 tablespoons soy sauce", "Large pinch sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the scallions in quarters lengthwise, then cut crosswise into 1 1/2-inch-long pieces. You should end up with thin blades of scallions. Separate out the dark green tops from the pale green and white parts. (You don’t have to be very thorough; some mixing of colors is fine.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a wok or 12-inch skillet over very high heat. When it’s shimmering but not smoking, stir in chicken and salt. Cook, stirring almost constantly, until chicken is barely cooked and no longer pink, 3 to 5 minutes. Use a slotted spoon to transfer chicken onto a serving plate, leaving the oil in the pan. Immediately scatter cilantro and scallion greens (not whites) over hot chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return wok to medium-high heat. Make sure there are at least 2 tablespoons oil in the wok. If not, add more oil. Stir in ginger and cook until lightly browned, about 1 minute. Stir in scallion whites, soy sauce and sugar, and cook for another 30 seconds (if using a skillet, remove from heat). Immediately spoon the contents of the pan evenly over chicken and herbs. Serve right away."}]}