{"@context": "http://schema.org", "@type": "Recipe", "name": "Parmesan Chicken Breast With Tomato and Herb Salad", "description": "For better weeknight chicken, dredge it in flour loaded with freshly grated Parmesan and shallow-fry it. The cheese works to create a sort of frico, so you don’t need bread crumbs for a deeply flavorful crust. While you could make this entirely on the stovetop, you risk overcooking the Parmesan, and under- or overcooking the meat. Instead, finish it in the oven, which yields a juicy, tender breast and keeps the Parmesan from getting too dark. Serve with perfectly ripe beefsteak and cherry tomatoes, jumbled together with salt and herbs and a splash of vinegar to make the tomatoes pop.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/16/dining/sc-parm-chicken/sc-parm-chicken-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "chicken breast, parmesan, tomato, fall, summer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 170}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 755, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "4 grams", "proteinContent": "60 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1216 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds ripe beefsteak or heirloom tomatoes, cut into wedges (or halved if small)", "1 pint cherry tomatoes, halved", "1 tablespoon sherry or cider vinegar", "1 teaspoon kosher salt, plus for seasoning", "1/4 teaspoon black pepper, plus more for seasoning", "6 ounces Parmesan", "1 cup flour", "2 large eggs, well beaten", "4 skinless, boneless chicken breast, halved (about 1/2-inch thick)", "3 tablespoons canola or grapeseed oil ", "2 tablespoons thinly sliced basil", "1/4 cup finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss together tomatoes, vinegar, salt and pepper in a bowl, and set aside. Heat the oven to 425 degrees with a rack in the lowest position."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chicken: Line a baking sheet with parchment paper. Finely grate half the Parmesan on a box grater. Grate the remaining half on the larger side of the box grater. Add both to a shallow bowl along with 1/2 cup flour, and whisk together. Put the remaining 1/2 cup flour in another shallow bowl, and the beaten egg in another."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken generously with salt and pepper. Dip the chicken breasts, one at a time, into the flour. Shake off any excess and dip into the eggs, turning to coat evenly. Shake off the excess and dip into the Parmesan mixture, pressing to adhere and holding the chicken gently by the ends to keep the coating intact. Transfer to the lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons oil in your largest ovenproof skillet. When the oil is shimmering, lay the chicken breasts in the pan, in batches if needed. Cook without moving until the coating on the bottom is deeply golden brown and releases easily from the pan, 5 to 6 minutes. Carefully flip the breasts and cook until the other side is just golden on the outside, about 3 minutes more. Transfer the skillet to the oven (or transfer the chicken to a separate baking sheet if needed for space) and cook until the juices run clear and an instant-read thermometer inserted into the thickest part of the chicken registers 165 degrees, 4 to 6 minutes more, depending on the thickness of each breast."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the herbs over the tomatoes, and drizzle with the remaining 1 tablespoon oil; serve alongside the chicken."}]}