{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon Cakes With Thai Basil Yogurt", "description": "Ginger and Thai basil yogurt is a wonderful accompaniment for these fish cakes, but they are also great with just a squeeze of lime if you want to save time. The cakes are best cooked as soon as they are shaped and served as a starter or a snack. However, if you wish to make them ahead of time, or if it's just a matter of preference, swap out the sunchokes (also known as Jerusalem artichokes) for more potato and chill them once they are formed. They should keep for a couple of days in the refrigerator, ready to be fried. If you cook them from cold, pop them into a hot oven after frying to make sure they are properly heated through.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2018/11/21/dining/21ottorex2/21ottorex2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 main course or 8 appetizer servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "appetizer, main course, greek yogurt, salmon fillet, sunchoke, thai basil, wakame seaweed", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1081, "unsaturatedFatContent": "40 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "67 grams", "fiberContent": "4 grams", "proteinContent": "80 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1466 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound/500 grams sunchokes (also known as Jerusalem artichokes)", "5 tablespoons/60 milliliters olive oil", "Flaky or fine sea salt", "1/2 pound/250 grams white or yellow potatoes, peeled and cut into 1 1/4-inch/3-centimeter chunks", "2 tablespoons finely chopped Thai basil, plus 12 whole leaves (or use a combination of normal basil and cilantro)", "1/4 cup/10 grams wakame seaweed, roughly broken up into 1-inch/2-centimeter pieces if large", "1 teaspoon peeled minced ginger", "Scant 1/3 cup/25 grams finely chopped green onions (from 2 or 3 green onions, green parts only)", "1/2 garlic clove (or 1 small clove), crushed", "2 limes (finely grate the zest to get 2 teaspoons then cut into wedges for serving)", "2 1/2 tablespoons potato starch (potato flour), or use all-purpose flour", "1 egg, beaten", "3/4 pound/350 grams store-bought cooked salmon (3 or 4 fillets), skin removed and roughly broken into 1 1/2-inch/4-centimeter pieces (see note)", "1 tablespoon unsalted butter", "8 Thai basil leaves, finely chopped (or use a combination of normal basil and cilantro)", "1 1/2 teaspoons peeled minced ginger", "1 lime (finely grate the zest to get 1 1/2 teaspoons and juice to get 1 1/2 tablespoons)", "1/4 garlic clove, crushed", "1 scant cup/200 grams plain Greek yogurt", "Pinch of salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees Fahrenheit/230 degrees Celsius and position a rack in the top third of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with water. Peel the sunchokes, adding them to the water as you go to prevent discoloration. Cut them into 1 1/4-inch/3-centimeter chunks, then dry very well with a kitchen towel. Toss with 1 tablespoon oil and 1/2 teaspoon flaky salt (or 1/4 teaspoon fine salt) and spread out on a parchment-lined baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast sunchokes for 20 to 22 minutes, tossing them and rotating the pans halfway through, until golden brown and cooked through. Set aside to cool, then very roughly crush them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sunchokes are roasting, add the potatoes to a medium saucepan, cover with cold, well-salted water and bring to a simmer over medium-high heat. Once simmering, cook for 12 minutes, or until soft. Drain and set aside to cool for about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 1/4 cup/48 milliliters olive oil to a small saucepan over medium-high heat. Once hot, add the basil leaves and the wakame and fry for 1 minute, stirring a little until crisp. Strain, reserving the oil, and transfer the basil and wakame to a small plate lined with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the ginger and basil yogurt: Mix together all of the ingredients and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roughly crush the cooled potatoes (some lumps are fine) and add to a large bowl with the cooked sunchokes, ginger, green onions, garlic, lime zest, potato starch (flour), egg, chopped basil and a good pinch of salt. Finely chop half the crisp wakame and add to the bowl. Mix everything together well, then add the salmon and gently mix to combine, trying not to break the salmon pieces too much."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With lightly oiled hands, form the mixture into 8 cakes, pressing them so they hold together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the butter and 1 tablespoon reserved oil to a large nonstick frying pan over high heat. Once hot, lower the heat to medium-high and fry half the fish cakes for 2 to 3 minutes per side, until crisp and golden brown on both sides. Remove from pan and then fry the remaining fish cakes in the same way with the remaining butter and 1 tablespoon of the remaining oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the cakes between four plates and spoon some of the yogurt on each plate. Top the yogurt with the crisp wakame and Thai basil and serve with lime wedges alongside. (To serve as an appetizer, arrange cakes on a platter with the yogurt in a bowl alongside.)"}]}