{"@context": "http://schema.org", "@type": "Recipe", "name": "Sizzled Five-Spice Shrimp With Red Pepper", "description": "This flavorful wok-fried shrimp dish makes an easy but very impressive dinner. Bright and spicy, it calls for strips of ripe red Fresno chiles, which are not very hot and available in the produce section of most supermarkets. Use red bell peppers instead if you want to tame the heat. Look for fresh or frozen wild shrimp when possible, from the Eastern Atlantic, the Gulf of Mexico or Alaska. Make sure to buy farmed shrimp from a certified sustainable source; imported farmed shrimp are not always reliable or of good quality.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2017/12/20/dining/20KITCHEN/20KITCHEN-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian, chinese", "recipeCategory": "dinner, quick, seafood", "keywords": "bok choy, Fresno chile, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 229}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 222, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "18 grams", "saturatedFatContent": "1 gram", "sodiumContent": "807 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds large shrimp, peeled and deveined", "Salt ", "1 tablespoon granulated sugar", "1/2 teaspoon five-spice powder (see Note)", "1 tablespoon soy sauce", "2 tablespoons Chinese rice wine, sake or dry sherry", "2 tablespoons cornstarch", "2 pounds baby bok choy or mustard greens, trimmed ", "3 tablespoons vegetable oil", "6 ripe, red Fresno chiles, split lengthwise, seeded and cut into thin strips (or use 2 large bell peppers)", "1 tablespoon grated fresh ginger", "1 teaspoon grated fresh garlic", "1/4 teaspoon cayenne or crushed red pepper flakes", "1 teaspoon sesame oil", "1 teaspoon sesame seeds, toasted", "1/4 cup slivered scallions, for garnish", "Cilantro sprigs, for garnish", "Lime wedges, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread shrimp out in one layer on a baking sheet. Sprinkle lightly on both sides with salt, sugar, then five-spice powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer shrimp to a large bowl and drizzle with soy sauce and rice wine. Sprinkle with cornstarch and gently toss shrimp with hands or spoons until well coated. Leave to marinate for 15 minutes (or cover and keep refrigerated up to 2 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to the boil. Add bok choy or mustard greens and simmer until just tender, 1 to 2 minutes. Drain and arrange on a large serving platter. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a wok or large cast-iron pan over high heat and add vegetable oil. When oil is hot, add the shrimp in a single layer. (Work in batches if necessary to avoid crowding.) Let shrimp brown nicely on one side, about 1 minute, then turn with tongs and finish cooking the second side. Transfer cooked shrimp to the platter of blanched bok choy, placing on top of greens."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chile strips to oil in wok, sprinkle lightly with salt and cook about 1 minute, until softened, then add ginger, garlic, cayenne and sesame oil. Let mixture sizzle briefly, just until fragrant, then carefully spoon it over shrimp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with sesame seeds; garnish with slivered scallions, cilantro and lime wedges and serve."}]}