{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach Polenta Cake", "description": "This simple, summery cake gets its rustic texture from polenta and ground almonds. Most of its sweetness comes from cut peaches that bubble in a light caramel at the bottom of the cake, then decorate the top when you flip it over. The recipe is from King, a small restaurant in Manhattan where the chefs Clare de Boer and Jess Shadbolt swap the stone fruit out to use whatever is sweet, juicy and in season. Try the cake with peaches, nectarines, plums or even a mix of all three, but make sure to give the cake the time it needs to turn golden brown and firm to the touch. At King, the chefs use the Italian brand Moretti's stone-ground polenta bramata. For a more rustic cake, with a little bite, use coarse polenta. For a more tender crumb, use finely ground polenta.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/07/18/dining/18kingrex/merlin_141364617_9f8d921a-c77c-461e-8ea0-23f543d520c8-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "12 Servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "almond, peach, polenta, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 337}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 751, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "77 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "5 grams", "proteinContent": "10 grams", "saturatedFatContent": "24 grams", "sodiumContent": "136 milligrams", "sugarContent": "47 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/4 cups/470 grams sugar", "2 sticks plus 6 tablespoons/305 grams unsalted butter, at room temperature", "6 to 8 peeled, pitted and halved peaches, nectarines or plums, or use a mix", "1 1/2 cups/230 grams slivered almonds", "1 scant cup/230 grams polenta, or cornmeal (see note)", "1/2 cup plus 1 tablespoon/70 grams all-purpose flour", "1/2 teaspoon kosher salt", "1 teaspoon baking powder", "Zest of 1 lemon", "4 eggs", "Crème fraîche, to serve (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Generously butter the bottom and sides of a 9-inch round cake pan and line the bottom with parchment paper. Cut one long strip of parchment paper to line the sides of the pan so that the paper reaches all the way around the pan with no gap at the seam, and stands about 3-inches high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1 cup/200 grams of the sugar in a saucepan with just enough water to cover, stir well and place over medium heat. When sugar turns the color of maple syrup, take off the heat and add 2 tablespoons/35 grams of the butter. Swirl to incorporate and pour into the cake pan. Place the fruit flesh-side down in a single layer all over the caramel, cutting a few pieces smaller if necessary to make it all fit. You can cram the fruit; it will shrink as it cooks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add almonds and polenta to a food processor and process until fine, then set aside in a large bowl with the flour, salt, baking powder and lemon zest. In the same food processor, cream the remaining butter and sugar. Add eggs one at a time, making sure each is emulsified before adding the next. Scrape the mixture into the bowl with the flour mixture and fold into the ingredients until smooth. Spoon the batter on top of the fruit and even out the top. Bake for about 2 hours, or until the the top is golden in color, crackled and firm to the touch. Set the cake pan on a rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cake has completely cooled, loosen the sides with the tip of a knife and flip it over in one quick motion, directly onto a serving platter. Holding onto the upside down cake pan and the platter at the same time, shake and bump the pan a little, if necessary, to release the cake, before lifting the pan away. Gently peel away any parchment paper. Slice and serve as is, or with a little crème fraîche on the side."}]}