{"@context": "http://schema.org", "@type": "Recipe", "name": "Brown-Butter Chocolate Oatmeal", "description": "Adding a few tablespoons of unsweetened cocoa powder to your morning oatmeal turns a quotidian breakfast into something unexpectedly complex and bittersweet, while browning the butter adds a nutty richness. You can adapt this recipe to work in your slow cooker or pressure cooker, if that’s your preference. Just brown the butter and oats first, then whisk the cocoa into the boiling water until no lumps remain, and proceed as you usually do. For something a little mellower, substitute whole milk, nut milk or coconut milk for up to half of the water.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/03/21/dining/21appetite1/merlin_135367773_f4f31480-549d-410e-bf3b-8c779d9cc3aa-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, grains and rice", "keywords": "chocolate, cocoa powder, oatmeal, high fiber", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 358}, "recipeIngredient": ["2 tablespoons unsalted butter", "1 1/2 cups steel-cut oats", "3 tablespoons unsweetened cocoa powder, preferably Dutch-process", "1/4 teaspoon fine sea salt", "Raw sugar, honey or maple syrup, to taste", "Cream, milk or coconut milk", "Butter", "Flaky sea salt", "Sliced bananas", "Shredded coconut", "Sliced dates", "Sliced avocado"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, melt butter over medium heat. Let cook, swirling occasionally, until it turns deep golden brown and smells nutty, 2 to 4 minutes. You’ll know it’s close when the bubbling quiets down as the moisture cooks off. Add oats and sauté until they turn golden at the edges, 2 to 4 minutes. Scrape oats and butter into a bowl and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the same pot (no need to rinse it out first) add 4 1/2 cups water and bring to a boil. Add cocoa powder and whisk well to dissolve lumps. Whisk in buttered oats and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower to a gentle simmer. Let cook, stirring occasionally, until done to taste, 25 to 30 minutes. Turn off the heat, cover the pot, and let sit for 5 minutes. Check the thickness; thin with boiling water if needed. Stir in sweetener to taste and serve with toppings of your choice."}]}