{"@context": "http://schema.org", "@type": "Recipe", "name": "Leeks Vinaigrette With Sieved Egg", "description": "Nothing brings down a leek like a few grains of sand, so be sure to wash and wash and wash again. I love to eat these leeks after my main course but on the same plate so that the vinaigrette mingles with the last traces of pan drippings.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2017/10/26/dining/26cooking-leeks/26cooking-leeks-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dijon mustard, egg, leek, parsley, red wine vinegar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 329, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "351 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 leeks", "Kosher salt", "1 tablespoon black peppercorns", "3 large eggs, hard-boiled and peeled, yolks separated from the whites", "3 garlic cloves, finely grated", "3 tablespoons Dijon mustard", "1/4 cup red wine vinegar", "1 cup extra-virgin olive oil", "2 tablespoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice off the tangled root end and the thick, woody dark green top of each leek at the approximate same length. Wash the leeks vigorously under slow-running cold water, using your hands and fingers to scrape away insistent dirt and sand. Arrange them on a cutting board, and in one confident move, stab the tip of a sharp chef’s knife into the leek 1/2 inch from the root end, and run it the rest of the length to the green top, in essence cleaving the leek starting from the white pale root, making two legs and a crotch, where only one thick column was to start. Back at the sink, wash again and again, keeping the leeks intact, but removing every single last grain of sand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the leeks in a shallow heatproof dish large enough to hold all of them snugly in a single layer. Barely cover leeks with water, leaving them, as we often say, bobbing in the water like crocodiles submerged at the river’s edge. Season with salt, and scatter with the black peppercorns. Cover with parchment, being sure that the parchment is tucked in around all the edges of your casserole dish. Add a few spoonfuls of water evenly on top of the parchment — allowing the weight of the water to help hold down the parchment, which will start to dome from heat and condensation once the cooking starts. Bring the water to a gentle simmer, and hold it there until the leeks are tender without being mushy, with no raw, crunchy quality at all. The color will be drab on the exterior and still attractive halcyon at the centers. This may take 10 minutes, or even 20; you have to watch them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the leeks from the water with a slotted spoon, and transfer to a clean rack, draining all of their cooking water. Once they have cooled completely, remove the outermost papery, inedible layers of the leek to reveal the tender interiors. Also pick out any black peppercorns that may be clinging inside the layers. Cut into quarters on a bias, and arrange attractively on a serving platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the vinaigrette, place the grated garlic, mustard and red wine vinegar in bowl. Add in a pinch of kosher salt and a few cracks of black pepper. Whisk in the olive oil. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, dress the leeks generously with the vinaigrette. Push the egg whites through a fine-mesh sieve, followed by the yolks, over the leeks — exploiting the color contrast. Scatter with chopped parsley. And finish with a solid few grinds of black pepper. Serve at room temperature."}]}