{"@context": "http://schema.org", "@type": "Recipe", "name": "Biscuits Roses", "description": "Guillaume Portier, a pastry instructor at La Cuisine Paris cooking school, encouraged me as I was trying to recreate Biscuits Rose de Reims, pink sugar-topped cookies that were once dipped into champagne, the most famous export from the French city of Reims.  I kept making delicious cookies, but none of my batches matched the storebought, which used ammonium carbonate (best known as smelling salts) to give them crackle and shelf-life.  Guillaume told me to stop striving for a replica, reminding me that if what we baked at home lasted forever, we’d be deprived of the pleasure of making pastries again and again.  These cookies will hold for a week or so if you keep them in a sealed tin.  After that, you can look forward to the pleasure of making another batch.  A word on piping: If you don’t have a piping bag, use a zipper-lock plastic bag.  Fill with batter, seal and cut a 1-inch diameter opening in a corner.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2018/02/11/magazine/11mag-ondessert/11mag-11ondessert-t_CA1-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "About 16 cookies", "recipeCuisine": "french", "recipeCategory": "cookies and bars", "keywords": "baking powder, baking soda, cornstarch, eggs, flour, sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 80, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "53 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2/3 cup (90 grams) all-purpose flour", "1/3 cup (45 grams) cornstarch", "1/4 teaspoon baking powder", "1/4 teaspoon baking soda", "Pinch of salt", "2 large eggs, at room temperature, separated", "1/2 cup (100 grams) sugar, divided", "1 teaspoon pure vanilla extract", "Red food coloring, optional", "1/2 cup (60 grams) confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350. Line a baking sheet with parchment paper or a silicone baking mat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the flour, cornstarch, baking powder, baking soda and salt together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with an electric mixer fitted with a whisk, beat the egg whites at medium speed until opaque. Increase the speed to high, and add half the sugar (1/4 cup), 1 tablespoon at a time, until you have a stiff-peaked, glossy meringue. Transfer to another bowl (if necessary), and put the yolks in the original bowl (no need to wash it). Beat the yolks, the remaining sugar and the vanilla on medium-high speed for 5 minutes, scraping as needed, until pale and thick. Add enough food coloring to tint the batter deep pink, if you’d like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the meringue out over the yolks, and working with a flexible spatula and a gentle hand, fold the 2 mixtures together until almost combined. Fold in half the dry ingredients, and when almost blended, add the rest, and finish incorporating — check the bottom of the bowl for lurking flour. If you’re using parchment paper, use a little of the mixture to “glue” the four corners to the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape batter into a piping bag with about a 1-inch opening (no tip needed). Pipe out roughly 4-by-1-inch fingers, spaced at least 1 inch apart. Sift confectioners’ sugar generously over the cookies, leave 5 minutes, then repeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 6 minutes, then rotate the pan, and bake 6 minutes more. Turn off the oven, prop the door open a crack (I use a wooden spoon) and let the biscuits dry for at least 30 minutes (or for up to 2 hours). Serve now, or store in an airtight container. They’ll hold for 1 week."}]}