{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy Breakfast Egg and Polenta Casserole", "description": "If you’ve had the pleasure of a cheesy polenta dinner, topped with a creamy-yolked egg, you can imagine how good that combination is at breakfast. This quick casserole for a crowd is exactly that, made elegant and easy so you can have a perfectly cooked portion for each person with very little work. Layer your polenta with anything you desire, whether salami or ham — or keep it vegetable-centric with spinach or oven-roasted tomatoes. Make nests between your toppings and the polenta where the eggs will cook slowly, giving you a soft-cooked finish that’s loaded with flavor.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/11/16/dining/sc-breakfast-polenta/sc-breakfast-polenta-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, casseroles", "keywords": "cured meat, eggs, fontina, parmesan, polenta, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1388}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 244, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "1 gram", "proteinContent": "13 grams", "saturatedFatContent": "7 grams", "sodiumContent": "275 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons unsalted butter, plus more for greasing the pan", "1 cup quick-cooking polenta", "1/2 teaspoon fine sea salt", "1 cup whole milk", "1/2 cup/2 ounces fontina or mozzarella, or a blend, shredded", "5 ounces thinly sliced cured meat, such as hot or sweet Italian sausage, salami or ham (optional)", "1 packed cup spinach, kale or other leafy green, torn or chopped (optional)", "8 large eggs", "1/2 cup/2 ounces grated Parmesan", "Ground black pepper", "1/4 cup packed basil leaves, larger ones roughly torn (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees with the rack in the center. Generously butter a 9-by-13-inch pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 cups water to a boil. Gradually whisk in the polenta and salt, and cook, stirring constantly until the polenta bubbles and pulls away from the pan, about 3 minutes. Vigorously stir in the milk, butter and cheese until smooth and creamy. (It will seem loose.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the polenta onto the bottom of the prepared pan. Layer with meat, greens or anything else you desire. Use the back of a large spoon to create 8 small wells in the polenta. Crack the eggs inside, sprinkle with Parmesan, and bake 10 to 15 minutes, depending on how set you like your eggs. Let stand for 5 minutes; sprinkle with black pepper and basil and serve warm."}]}