{"@context": "http://schema.org", "@type": "Recipe", "name": "Beans and Garlic Toast in Broth", "description": "A simple dish of creamy, thin-skinned beans and broth on toast is easy to make, and a comfort to eat alone or feed a crowd. If you make the beans ahead of time, they can keep in the fridge for 3 days, but may need a splash of water added when you heat them up. The broth is a great way to make use of parmigiano rinds, if you happen to be saving those, but if you don’t have any lying around, you can still make it rich with umami: Whisk a heaped tablespoon of white miso with a little of the bean broth to make it smooth and lump-free, then add it back to the pot. It will add a similar, savory depth. The dish seems plain, but it won’t be if you season the broth well, and garnish each bowl generously with olive oil, grated cheese and herbs, just before you eat it.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2018/03/25/magazine/25mag-eat1-copy/25mag-eat1-copy-articleLarge-v2.jpg", "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weeknight, beans", "keywords": "dried beans, garlic, parmesan, sourdough, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 489}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 602, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "5 grams", "proteinContent": "26 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1230 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup dried beans, such as cannellini or cranberry", "1 small onion, peeled ", "2 garlic cloves, peeled ", "Up to 4 ounces Parmesan rinds", "2 tablespoons extra-virgin olive oil", "1 teaspoon kosher salt", "4 thick slices crusty sourdough bread", "Extra-virgin olive oil", "1 garlic clove, peeled", "2 tablespoons parsley leaves, chopped", "1 tablespoon marjoram leaves, chopped", "Flaky sea salt, finely grated Parmesan and freshly ground black pepper, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If you remember, soak the beans in cold water overnight, or for 10 to 12 hours. Rinse beans, and place in a large heavy-bottomed pot with onion, garlic, Parmesan rinds, olive oil and salt. Cover beans with water, so the water level is a couple of inches above the beans, and bring to a boil, then turn heat down so it’s simmering gently. Put a lid on the pot, and cook until beans are tender, adding more water as needed to keep the beans submerged. This could take 1 to 2 hours or more, depending on the beans and whether or not you soaked them. (If you’re using an electric pressure cooker: Add 5 cups water, set the machine to high pressure and cook for 25 minutes, then allow the machine to slowly depressurize on its own.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a spoon to fish out the onion, garlic and cheese rinds; discard. Taste a couple of beans along with the broth. It should be opaque and slightly creamy; adjust the seasoning with more salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush both sides of each piece of bread with olive oil, and place on a foil-lined sheet pan. Run the pan under the broiler for 2 minutes, so the bread is crisp at the edges and nicely toasted, then flip bread and repeat. While the bread is still hot, rub a garlic clove along one side of each piece, as if you were grating the garlic on the bread, pushing just firmly enough for the clove to fray and dissolve slightly into the bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, place a piece of bread at the bottom of four wide, shallow bowls and ladle hot beans and broth on top. Wait a few seconds for the bread to absorb some broth, then ladle a little extra on each one, so it’s swimming. Garnish the bowls generously: Drizzle olive oil all over the beans, sprinkle with herbs and flaky sea salt, cover with finely grated Parmesan and grind a little black pepper on top."}]}