{"@context": "http://schema.org", "@type": "Recipe", "name": "Breakfast Salad", "description": "From the same trend that brought us avocado toast, the breakfasts served in Australian cafes often include bright vegetables arranged in eye-catching ways. Salad is definitely not part of the traditional American breakfast menu, but on a sunny morning the combination of chilled, crunchy greens; protein-rich cheese and eggs; and an eye-opening dressing is hugely appealing. This one was created at Carthage Must Be Destroyed, an airy (and slightly eccentric) Australian-style cafe hidden behind an unmarked entrance in Brooklyn. The chef and owner Amanda Bechara likes to leave the lettuce leaves whole to make it easier to eat with your fingers. (You can prepare the vegetables the day before, and skip marinating the feta if you must.) This would also make a lovely lunch.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/07/25/dining/25ausrex1/25ausrex1-articleLarge.jpg", "totalTime": "PT12H30M", "recipeYield": "2 servings", "recipeCuisine": "australian", "recipeCategory": "breakfast, brunch, lunch, salads and dressings", "keywords": "avocado, feta, romaine, sprouts, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 318}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 569, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "17 grams", "proteinContent": "18 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1666 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["4 ounces feta cheese (not crumbled), preferably a creamy type made with some sheep’s milk", "1 garlic clove, smashed and peeled", "1 dozen black or mixed peppercorns, coarsely cracked", "Extra-virgin olive oil, preferably cold-pressed", "2 large hearts romaine lettuce, outer leaves removed", "2 lemons, halved", "1 avocado, halved, pit removed", "About 2 ounces sprouts, such as alfalfa, clover or rainbow", "2 mini or Kirby cucumbers, cut into spears or sliced", "2 or 3 hard-boiled eggs, at room temperature, peeled and halved", "Flaky salt and coarsely ground black pepper", "Extra-virgin olive oil", "2 handfuls soft herbs, such as basil, chives, cilantro and mint", "Sourdough toast, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "A day before serving, marinate the cheese: Place feta in a small container with a tight-fitting lid. Add garlic clove and peppercorns. Pour in enough olive oil to just cover the cheese. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and crisp the lettuce: Fill a deep bowl with very cold water, hold the lettuce heart by the stem, dip it in and swish it gently to loosen any dirt. Lift out and let drain upside down. Repeat with the other heart. Cut off the white stem ends and gently unfurl each romaine heart onto a large plate. Use your fingers to fluff and separate the leaves, but try to keep the natural formation intact."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze half a lemon over each lettuce heart. Use a spoon to scoop chunks of avocado on top. Place tufts of sprouts among the romaine leaves. Place cucumber pieces and egg halves near the base of the lettuce. Add about 6 chunks of cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Liberally sprinkle the plate with flaky salt and black pepper, then splash on plenty of olive oil, making sure to hit the egg, cheese and avocado. (You can use the oil used to marinate the feta, if you like.) Tuck the herb leaves in among the lettuce leaves or just sprinkle them over the top. Place the remaining lemon halves near the egg halves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with warm toast if you like. At the table, squeeze lemon over the salad and eat with a knife and fork, or with your hands."}]}