{"@context": "http://schema.org", "@type": "Recipe", "name": "No-Smoker Pastrami", "description": "The lure of this pastrami recipe from La Boîte, a spice emporium in Hell’s Kitchen, is that it is a project that does not require a smoker. The essential ingredients are smoked salt and Prague powder (the curing salt sodium nitrite). Both are sold online. It will take nearly a week to make, but the meat is mostly unattended. You could start it on Monday and have it ready for Sunday dinner. The pastrami — reheated and served with warm sauerkraut, or sliced on rye with mustard and sauerkraut — makes for superb cold-weather feasting. Keep it in mind as you plan for the Super Bowl or other occasions for feeding a crowd.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2018/01/10/dining/10pairingrex/merlin_131870720_fad473cc-fd39-4d14-bbdb-53f85c254dd5-articleLarge.jpg", "totalTime": "P5DT14H", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "meat, project", "keywords": "brisket, Prague powder No. 1, smoked salt, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 28}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 555, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "15 grams", "sodiumContent": "454 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 4 to 5-pound piece of brisket, flat or point cut", "4 1/2 tablespoons smoked salt", "2/3 cup kosher salt", "1/2 cup granulated sugar", "1/2 cup light brown sugar", "4 teaspoons Prague powder No. 1 (curing salt)", "2 bay leaves", "6 cloves garlic, smashed", "3 whole cloves", "1 tablespoon crushed black peppercorns", "1 teaspoon crushed allspice", "5 tablespoons crushed coriander seeds", "3 tablespoons black mustard seeds", "1/2 cup coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place brisket in a gallon-size zipper freezer bag and set aside in a bowl or a large plastic container. Combine 3 tablespoons smoked salt, kosher salt, the sugars, Prague powder, bay leaves, garlic, cloves, crushed pepper, allspice and 1 tablespoon crushed coriander seeds in a large bowl. Add 2 cups boiling water. Let stand 15 minutes, stirring from time to time. Add 4 cups ice water to mixture, stir and pour into the bag with the meat. Add as much additional cold water as needed to fill the bag. Seal the bag, removing as much air as possible, and place in the refrigerator still in its bowl or container. Keep refrigerated for 5 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat from brine, rinse and pat dry with paper towels. Set meat on a rimmed baking sheet that has been lined with parchment paper. Toast remaining coriander seeds and the mustard seeds in a dry skillet. Mix with the remaining smoked salt and crush all together. Add the coarse pepper. Press this spice mixture into the surface of the meat all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 200 degrees. Place a rack in a rimmed baking sheet and cover rack with a piece of heavy-duty foil large enough to enclose meat. Punch some holes in the bottom of the foil for draining. Place meat on foil, wrap tightly and place pan in oven for 12 hours. Remove from the oven and let cool before refrigerating. At this point, pastrami will keep 10 to 12 days in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place all or a portion of the meat, wrapped in foil, in a steamer basket over simmering water in a large pot. Steam until warm, 30 minutes. Slice thin and serve."}]}