{"@context": "http://schema.org", "@type": "Recipe", "name": "Freestyle Roasted Chicken Parm", "description": "<i>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</i>\n\nYou don’t need much for this easy dinner: bone-in chicken thighs, canned crushed tomatoes, mozzarella, a little Parmesan or pecorino, zest from a lemon, olive oil and red-pepper flakes, maybe a few snips of basil if you can find any. (If you can’t, don’t worry, it will still kill.)\n\nToss the chicken in salt, pepper, zest, red-pepper flakes and a few glugs of olive oil, then get them on a greased sheet pan or two in a 425-degree oven, skin-side up, spreading them out as much as you can manage. While the chicken roasts, warm the tomatoes on the stove with a splash of olive oil and a little black pepper. Watch the chicken get well and truly crisped — it’ll take around 35 or 40 minutes — and then place a nice slice of mozzarella on each one to melt. (Activate the broiler, if you like, but I prefer the gentle style.) Spoon warm tomato sauce onto each plate, then top with a cheese-covered chicken thigh, some sprinkled Parmesan and a few torn pieces of basil. Sautéed greens would go nicely on the side.\n\n<i>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</i>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-chickenparm/merlin_147763335_af856008-19d1-4f16-a52b-2674fe427f54-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, weekday, weeknight, poultry", "keywords": "chicken thigh, crushed canned tomatoes, mozzarella, parmesan, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 577}, "recipeIngredient": [], "recipeInstructions": null}