{"@context": "http://schema.org", "@type": "Recipe", "name": "Cajun Shrimp Boil", "description": "In New Orleans, a seafood boil, the Southern tradition of gathering around a newspaper-lined table to eat large amounts of boiled shellfish with your bare hands, is all about salt and spice. In the words of Jared Austin, a Mississippi riverboat pilot and seafood-boil master, ‘‘Nothing about any of this is subtle — people standing around the pot should sneeze and cough.’’ The key to a successful shrimp boil is layering ingredients into the pot so that everything is done cooking at once: First add the potatoes and sausage, then the shrimp, then the frozen corn to bring the temperature down and prevent overcooking. Let it all soak to absorb the salt and spice, then dump it out onto the table and eat with copious amounts of <a href=\"https://cooking.nytimes.com/recipes/1019531-remoulade\">rémoulade</a>. While this recipe can easily be halved, it’s a simple — and extraordinarily fun — way to feed a crowd. Just remember to heed Austin’s advice: ‘‘Don’t be afraid of cayenne. Don’t be afraid to let your nose run.’’", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2018/09/02/magazine/02mag-eat-image1/02mag-eat-image1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "10 to 12 servings", "recipeCuisine": "cajun, southern", "recipeCategory": "seafood", "keywords": "cayenne pepper, kielbasa, potato, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 131}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 379, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "7 grams", "proteinContent": "38 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1326 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 (3-ounce) Louisiana or Zatarain’s brand seafood-boil seasoning pouches", "1/4 cup cayenne-pepper powder", "1 1/2 cups kosher salt (or 2/3 cup fine sea salt)", "2 yellow onions, peeled and halved through root", "3 celery ribs, cut into 3-inch pieces", "2 lemons, quartered", "4 heads garlic", "6 ears corn, shucked and cut into 3-inch pieces", "2 1/2 pounds small (2-inch) red potatoes", "2 12-ounce kielbasi, cut into 3-inch pieces", "6 pounds shrimp, preferably with shells on"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a very large (24-quart) pot with 8 quarts of water set over high heat. Add seasoning pouches, cayenne, salt, onions and celery. Squeeze lemon juice, and add wedges. Break garlic into cloves, and discard excess skin, then add unpeeled cloves. Cover the pot, and bring to a rolling boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay corn on a baking sheet in a single layer, then place in freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste the water after it comes to a boil. It should be very heavily salted and spiced, with a bright orange foam (when standing near the boiling pot causes you to cough, it’s spicy enough)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes and sausage to the pot, and let the water return to a boil. Turn off heat, and allow to soak for 10 minutes or until potatoes are barely tender when pierced with a knife. Bring the water to a boil, and add shrimp. Cook for 3 minutes, then turn off heat, add corn and allow to soak for 7 minutes. Drain, and serve immediately with rémoulade (preferably on a newspaper-lined table)."}]}