{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Chili", "description": "A great chili should be richly spiced, with layers of deep, savory flavor. Here, that big flavor comes from the usual contenders, but also from the unexpected additions of unsweetened cocoa, soy sauce and Worcestershire, which provide complexity. This recipe makes a thick, comforting chili that can be prepared in a slow cooker or in a Dutch oven on the stovetop. Chili is perhaps the ideal slow-cooker dish because its flavor improves with a long, slow simmer. This makes a big batch, perfect for a cold-weather get-together, but if you’re making it for a smaller group, the leftovers freeze well.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/01/09/dining/sd-slow-cooker-chili/sd-slow-cooker-chili-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "beans, beef, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1493}, "recipeIngredient": ["2 tablespoons olive oil", "1 large yellow or red onion, finely chopped", "Kosher salt", "2 pounds ground beef, 80 percent lean, 20 percent fat", "8 garlic cloves, finely chopped", "1 (6-ounce) can tomato paste", "1 tablespoon sweet paprika", "2 teaspoons chipotle powder", "2 teaspoons ground cumin", "2 teaspoons garlic powder", "2 teaspoons onion powder", "2 teaspoons mustard powder", "2 teaspoons hot smoked paprika", "1/2 teaspoon cayenne powder", "1/2 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "12 ounces (1 1/2 cups) pilsner beer, such as Modelo Especial", "1 (14-ounce) can diced or crushed tomatoes in juice", "1/4 cup cider vinegar", "2 tablespoons maple syrup or dark brown sugar", "2 tablespoons soy sauce", "2 teaspoons beef stock bouillon paste, such as Better Than Bouillon", "1 1/2 teaspoons unsweetened cocoa powder", "2 (14-ounce) cans kidney beans, drained and rinsed", "2 (14-ounce) cans pinto beans, drained and rinsed", "1 tablespoon Worcestershire sauce", "Hot sauce, grated sharp Cheddar, sliced scallions, sour cream and crushed tortilla chips, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large Dutch oven over medium. Add the onion, season with salt, and cook, stirring occasionally, until the onion is softened and translucent, about 8 minutes. Increase the heat to medium-high, add the beef and garlic, season with salt and cook, breaking the beef into crumbles with a spatula, until the beef has lost its pink color, 8 to 10 minutes. Stir in the tomato paste and cook until slightly darkened and caramelized, about 1 minute. Stir in all the spices and cook until fragrant, about 1 minute. Add the beer and stir, scraping the bottom of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the beef mixture into a 5- to 8-quart slow cooker. Stir in the tomatoes, vinegar, maple syrup, soy sauce, beef bouillon paste, cocoa, beans and 1/2 cup water. Cover and cook on low for at least 4 hours and up to 6 hours. (The chili can hold well on warm for an additional 2 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " When ready to serve, stir in the Worcestershire sauce. If the chili is too thick, stir in a bit of water until the texture is to your liking. Season to taste with salt. Serve in bowls and pass the toppings at the table."}]}