{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Fish With Soy and Citrus", "description": "For those curious about cooking a whole fish but nervous to try, this skillet method is as simple as cooking a chicken breast. Meant to work with a larger fish, such as a snapper or black bass, this method, which keeps the skin and bones involved, prevents overcooking and drying out (plus it's more fun to eat). Basted with a citrusy browned butter-soy mixture, which also acts as a sauce once the fish is cooked, this one-skillet dish needs little more than some spriggy, fresh herbs for nibbling on alongside, but feel free to serve with a big leafy salad, bowl of rice or thick-cut toast.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/01/23/dining/23Romanrex1/merlin_148945323_3aa45d42-3e15-4efa-8700-2a4f22910719-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, seafood", "keywords": "lemon, lime, orange, red snapper, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 366}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 481, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "60 grams", "saturatedFatContent": "9 grams", "sodiumContent": "894 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 lemon", "1 lime plus 2 tablespoons fresh lime juice", "1 orange", "1 red snapper (about 2 1/2 pounds), gutted and scaled (optional to keep the head on)", "Kosher salt and black pepper", "2 tablespoons canola oil", "4 tablespoons unsalted butter", "2 tablespoons low-sodium soy sauce or tamari", "Flaky sea salt", "1/2 bunch cilantro or parsley, plus more if you like, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Thinly slice half the lemon, half the lime and half the orange."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp paring knife, make 2 to 3 1/2-inch-deep diagonal incisions on each side of the fish, not quite down to the bone, but enough to visibly score the flesh. Season fish inside and out with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in the largest, oven-safe skillet you own (at least 12 inches) on the stove over medium-high heat. Pick up the fish by the tail and gently lower the fish into the skillet away from you to avoid hot oil splatters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the fish is in the skillet, use tongs or a fish spatula to lightly press the fish, encouraging the skin to make even contact with the skillet. Cook, continuing to press lightly, for 1 to 2 minutes. Remove the skillet from the heat and carefully place a few slices of citrus inside the cavity of the fish, letting a few escape and sizzle in the skillet alongside the fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add butter and soy sauce to the skillet, letting the butter sizzle and foam up. Tilt the skillet slightly toward you to allow the buttery soy sauce mixture to pool on one side. Using a large spoon, baste the fish a few times, letting the sauce sizzle and foam up around the fish and into the parts where you’ve made the incisions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the whole skillet to the oven and continue to cook until the fish is firm to the touch and you can see that the flesh has gone from translucent to white and opaque, 15 to 18 minutes. (You may need a few minutes more if you have an especially meaty snapper.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place fish on a large serving platter (leaving the sauce behind), along with remaining halved lemon, lime and orange for squeezing over the top. Add lime juice to the skillet and swirl to combine. Pour sauce over fish and sprinkle with flaky sea salt, serving cilantro alongside for nibbling in between bites of fish, like a very spriggy salad."}]}