{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey and Noodles", "description": "This comforting family recipe belongs to Whitney Reynolds, a New Yorker with roots in Tennessee. She traditionally serves the dish of thickened turkey broth and noodle-shaped dumplings as a side at her Thanksgiving dinner, next to the roasted bird and mashed potatoes. The yolk-rich noodles, rolled and cut with a knife, are dried out for some hours at room temperature. That way, they become strong enough to withstand a long boil during which they soak up the flavors of the roasted turkey stock, going tender and sticky-edged. The stock reduces, until it's somewhere between soup and gravy. Ms. Reynolds, a noodle purist, would never put turkey meat in the dish, but the day after Thanksgiving, when there's often a little left over, it's hard to imagine a better place for it to end up. Consider it optional.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/11/22/dining/22LEFTOVERSJP1/22LEFTOVERSJP1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, pastas", "keywords": "heavy cream, turkey, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 593, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "2 grams", "proteinContent": "22 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1354 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups all-purpose flour", "3/4 teaspoon baking powder", "1 teaspoon salt", "6 egg yolks", "3 tablespoons unsalted butter, melted but cool", "1/4 cup heavy cream", "8 cups turkey broth (<a href=\"https://cooking.nytimes.com/recipes/1013935-turkey-broth\">see recipe</a>)", "1 cup roasted, shredded turkey meat (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine flour, baking powder and salt. In a separate bowl, whisk together yolks, butter and cream, then slowly add to the dry ingredients, beating together with a fork. When the dough gets too stiff for the fork, use your hands to mix and knead in the bowl until dough is yellow and smooth. Wrap well with plastic wrap and transfer to the refrigerator for about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flour a work surface, and roll out dough until it's about 1/4 of an inch thick, dusting with more flour as needed. Use a pizza roller or long knife to cut the dough into thick noodle shapes measuring just under 2 inches by 1/2 inch. Spread cut noodles out on lightly floured parchment paper, cover with a clean dishcloth and let sit out at room temperature for about 6 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, bring turkey stock to a hard boil, then add the noodles, stirring gently. Boil until noodles are moist and tender all the way through and the broth has reduced and thickened like a gravy, about 30 to 40 minutes. If adding turkey meat, stir into the pot in the last 10 minutes of cooking. Taste and adjust seasoning with salt and black pepper and serve in shallow bowls."}]}