{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Pork Rice Noodles With Cucumber and Peanuts", "description": "Sometimes you want dinner to be cold. For those evenings, there's this make-ahead pork and rice noodle dish, offering a robust infusion of zing from garlic, fish sauce and tons of fresh herbs plus plenty of flexibility. Add more peanuts and basil, or go heavy on the mint and lime. Use pork tonight, and ground turkey or chicken the next time; it’s your choice. This basic formula is easily adapted, and the components pack up easily for a work lunch or another night’s dinner. To make this vegetarian, substitute semi-firm tofu, cut into 1/2-inch cubes, for the pork, and substitute a few tablespoons of soy sauce for the fish sauce.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2018/09/16/dining/sc-pork-noodles/sc-pork-noodles-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, weekday, noodles", "keywords": "basil, cucumber, mint, peanut, pork, rice vermicelli, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 560}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 788, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "44 grams", "fiberContent": "5 grams", "proteinContent": "30 grams", "saturatedFatContent": "11 grams", "sodiumContent": "2311 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons peanut, canola or grapeseed oil", "6 garlic cloves, pressed or minced", "1 pound ground pork", "1/2 teaspoon black pepper", "6 tablespoons fish sauce", "4 tablespoons brown sugar", "1 to 2 teaspoons sriracha or chile garlic sauce, plus more for serving", "Kosher salt", "1 (8.8-ounce) package rice vermicelli", "4 small Persian or hothouse cucumbers, thinly sliced (about 4 ounces)", "1 small bunch mint, leaves picked (about 1 cup)", "1 small bunch Thai basil or regular basil, leaves picked (about 1 cup)", "1/2 cup roasted peanuts, roughly chopped", "2 limes, cut in wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large skillet or wok over medium heat. Add the garlic, pork and black pepper and stir to brown evenly, 2 to 3 minutes. Add fish sauce, sugar and sriracha, and continue cooking until pork is just cooked through and evenly coated with sauce, 2 to 3 minutes more. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a rolling boil. Add the rice noodles and cook until tender, 2 to 4 minutes. Drain and rinse with cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the sauce off the pork into a bowl, and toss it with the noodles to coat. Divide the dressed noodles across four bowls and top with pork, cucumber, herbs and peanuts (or toss all together and transfer to a bowl). Drizzle with sriracha to taste and serve with lime for squeezing."}]}