{"@context": "http://schema.org", "@type": "Recipe", "name": "Pâte à Choux", "description": "These elegant swans are made just like an eclair — using two pastry kitchen workhorses: <a href=\"https://cooking.nytimes.com/recipes/1019666-diplomat-cream\">pastry cream</a> and pâte à choux. Pipe the pâte à choux into perfect teardrops, pulling the pastry bag away from the bodies as you finish each one to achieve that pointed tail end. When you are piping out the question marks for the necks, drag the tip of the pastry bag against the baking sheet ever so slightly to create a tiny beak. You'll have so much fun running those golden beaks through a flame after they are baked and watching them blacken into the uncanny likeness of swans.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2018/10/21/magazine/21mag-eat-image1/21mag-eat-image1-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "Around 30 swans of varying sizes", "recipeCuisine": "french", "recipeCategory": "pastries, project", "keywords": "butter, egg, flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 43}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 58, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "2 grams", "sodiumContent": "58 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup water (8 ounces)", "1 stick butter (4 ounces or 1/2 cup)", "1 teaspoon salt", "1 cup flour (4.5 ounces)", "5 large eggs", "Diplomat cream (<a href=\"https://cooking.nytimes.com/recipes/1019666-diplomat-cream\">see recipe</a>)", "Powdered sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to boil the water, with butter and salt over high heat in a deep, wide pot or pan (we use a soup pot for its wider surface area)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flour, reduce heat by 1/4 and stir vigorously and continuously to form a smooth, uniform dough, about a minute or 90 seconds. Take care not to scrape up the crust that forms on the bottom of the pan or reintroduce dry bits back into your smooth paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a mixing bowl, and vigorously beat in the eggs, one at a time, fully incorporating each egg before you add the next, ending with a sticky, smooth, tender and matte paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350, and place rack in middle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the choux paste into two disposable plastic piping bags, unequally divided; put 4 ounces (or about a cup) in one for the necks and the bulk of the paste in the other to form the bodies of the swans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare two half-sheet pans by greasing and fitting with parchment. (Or use silpats; the greasing is only to keep the parchment from slipping when you are trying to pull your tip away during piping.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut just the very tip off the pastry bag with the smaller quantity, leaving the diameter of the opening quite small — just wide enough to pass a whole peppercorn or a lentil, for example."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On one of the prepared sheet pans, pipe big, exaggerated question marks, like the ones on the deck of “Chance” cards in Monopoly. Start each question mark with a short drag of the tip against the parchment, creating a tiny beak as you go. There is ample paste to make mistakes and to practice — you will have plenty of necks even if you mess up a few."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Now cut the tip of the other pastry bag with the bulk of the paste to leave the opening circumference about the size of a dime. Leaving a 1/2 inch between them, pipe plump little 2-to-3-inch teardrops of dough onto the other prepared sheet pan. I make some a little bigger than others so I can end up with cobs and pens — males and females — just for fun."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put both sheet pans into the oven together, and bake the bodies and necks for 8 to 10 minutes, until the necks are fully golden brown, leaving the oven door closed the whole time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the necks, and linger for a few seconds with the oven door open, allowing the steam to escape. Close the door again, and finish baking the bodies 25 to 35 minutes more, until they’re fully golden brown and toasted. Shut off oven, and let swans dry inside for 20 minutes before removing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a small, sharp knife, slice the domes off the bodies of the swans, and cut them in half, creating two wings, placing them back into the cavity of the swan for now."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run the tiny tips of the necks through a flame — a candle or match or Bic lighter are all fine — to briefly blacken. They often catch on fire; blow them out!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the bodies with diplomat cream, place the wings cut edge up in the cavity, place the necks and gently dust with powdered sugar."}]}