{"@context": "http://schema.org", "@type": "Recipe", "name": "Blanquette of Scallops", "description": "Spring for me means discarding dark sauces and turning toward ingredients that are light and green. Here I’m inspired by the French blanquette, a stew, usually veal, in a creamy white sauce. I replaced the veal with plump sea scallops and brightened the whole thing with verdant, seasonal asparagus. Traditionally a blanquette is thickened with egg yolks and has pearl onions and often button mushrooms in the mix. The onion is in my version, but minced. I also omitted the mushrooms and used new potatoes that, unlike the mushrooms, help thicken a sauce made without the egg yolks. The result is a dish that’s fancy enough for guests yet easy enough for a weeknight.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2018/05/09/dining/09pairing/09pairing-articleLarge-v3.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, seafood, soups and stews", "keywords": "asparagus, potato, sea scallop, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 131}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 235, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "3 grams", "proteinContent": "18 grams", "saturatedFatContent": "3 grams", "sodiumContent": "867 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon unsalted butter", "1 pound sea scallops, rubbery tendon removed, scallops patted dry", "1/3 cup finely chopped onion", "1/2 cup dry white wine", "1 cup chicken stock, or more if needed", "4 medium-size new potatoes, about 12 ounces total, peeled and cut in eighths", "Salt and ground white pepper", "8 ounces thin asparagus, ends snapped off, slant-cut in inch-long pieces", "3 tablespoons crème fraîche", "1 teaspoon lemon juice", "1 tablespoon minced fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter over medium heat in a 12-inch sauté pan or skillet that has a cover. Increase heat to medium-high, add scallops and sauté no more than a minute until very lightly browned, then turn them once with tongs to color the other side. They will be undercooked. Remove to a bowl and cover loosely with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to low, add onions and sauté a couple of minutes, until soft but not brown. Stir in wine, scraping bottom of pan, and add 3/4 cup of the stock. Add potatoes, season with salt and pepper, cover and cook on medium-low 10 to 12 minutes, until just tender when pierced with a paring knife."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir ingredients in the pan. Add asparagus and remaining stock. Cook uncovered about 3 minutes, until asparagus are just tender. If liquid in the pan is reducing too much — there should be a saucelike amount — add a little more stock. Stir in crème fraîche, cook briefly until sauce thickens to a creamy consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return scallops and any juices they release to the pan, cook another 2 minutes, basting scallops and potatoes with sauce. Add lemon juice. Taste sauce for seasoning. Transfer blanquette to a serving dish, shower with dill and serve."}]}