{"@context": "http://schema.org", "@type": "Recipe", "name": "Poached Chicken Breasts With Tomatillos and Jalapeños", "description": "Boneless, skinless chicken breasts can be easy to overcook, going from tender to rubbery in a matter of seconds. Not so here, where the breasts are cooked in chicken stock in a very low oven, which keeps them moist and juicy. Tomatillos, jalapeños and garlic, which are roasted at the same time, turn golden and soft before being chopped into a vibrant, cilantro-laced salsa. Make this on days when you don’t mind having the oven on low for a couple of hours. It may take a while to cook, but most of that time is entirely hands-off.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/01/16/dining/16apperex1/merlin_148504038_e388f782-55d2-4dfb-bd56-a30df1cd9ea6-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "chicken breast, jalapeño, tomatillo, low-carb, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 232}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 573, "unsaturatedFatContent": "27 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "8 grams", "proteinContent": "39 grams", "saturatedFatContent": "6 grams", "sodiumContent": "765 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 quart chicken stock, plus more as needed (or use salted water)", "1 1/4 pounds boneless, skinless chicken breasts (3 medium breasts)", "1 1/2 pounds tomatillos, cut into 1/2-inch chunks", "2 to 3 jalapeños, thinly sliced", "6 tablespoons extra-virgin olive oil, plus more as needed", "3/4 teaspoon kosher salt, plus more as needed", "1 teaspoon cumin seeds", "4 garlic cloves, thinly sliced", "3/4 cup cilantro leaves, roughly chopped", "3 scallions, thinly sliced", "Finely grated zest of 1/2 lime", "1 avocado, sliced", "Fresh lime juice, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place racks in the top and bottom third of the oven and heat to 275 degrees. In the microwave or in a small pot on the stove, heat chicken stock until it comes to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken in a small baking dish and cover with hot chicken stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a rimmed baking sheet, toss together tomatillos, jalapeños, 2 tablespoons oil, 3/4 teaspoon salt, and cumin seeds. Spread into a single layer on the sheet, then nudge the tomatillos aside to make room in 1 corner for a small ramekin. Fill ramekin with garlic and remaining 4 tablespoons oil or more as needed to cover the garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken on top oven rack until chicken is cooked through (a thermometer inserted in the center should read 155 degrees), 55 minutes to 1 hour and 10 minutes. At the same time, bake tomatillos on bottom rack, tossing occasionally, until they are tender, and garlic is light golden, 1 to 1 1/2 hours. If chicken is ready before the tomatillos, remove it from the oven and leave it in the pan covered in stock to keep it warm until everything is done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a slotted spoon to remove garlic from oil and coarsely chop. Remove chicken from stock (save stock for another use; it can be frozen for up to 3 months), and slice the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, toss together tomatillos, chopped garlic, cilantro, scallions, lime zest and salt to taste. Drizzle fresh lime juice and garlic oil all over the chicken and avocado if you like, and season with salt. Serve with the tomatillo salsa."}]}