{"@context": "http://schema.org", "@type": "Recipe", "name": "Meatballs in Sour Cherry Sauce (Kabab Karaz)", "description": "The writer Anissa Helou put this bright and tart Syrian dish on the cover of her cookbook \"Feast: Food of the Islamic World,\" which gathers recipes from across the Muslim diaspora. \"If there is a dish that symbolizes the cooking of Aleppo, this has to be it,\" she writes inside; the recipe is adapted from Maria Gaspard-Samra, a chef who taught cooking classes in Aleppo. These small lamb meatballs are browned — take care not to overcook them — and then simmered in a pool of pitted sour cherries, raw cane sugar and pomegranate molasses. Then they are piled on a bed of pita bread triangles drizzled with butter and dusted with chopped parsley and toasted pine nuts. If you can’t find fresh or frozen sour cherries, use dried, which you can rehydrate by soaking overnight in water.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2018/06/06/dining/06helourex/06helourex-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "3 to 4 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, meatballs", "keywords": "ground lamb, pomegranate molasses, sour cherry, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 689, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "7 grams", "proteinContent": "26 grams", "saturatedFatContent": "16 grams", "sodiumContent": "642 milligrams", "sugarContent": "29 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound/450 grams lean ground lamb, from the leg or shoulder", "3/4 teaspoon fine sea salt", "1/2 teaspoon Lebanese 7-spice mixture (see notes) or allspice", "1 tablespoon/15 grams unsalted butter", "2 1/4 pounds/1 kilogram fresh or frozen pitted sour cherries (see notes)", "1 tablespoon raw cane sugar", "1 tablespoon pomegranate molasses", "2 to 3 pita breads, each split into 2 disks and cut into medium triangles", "1 tablespoon/15 grams unsalted butter, melted", "A few sprigs flat-leaf parsley, most of the bottom stems discarded, finely chopped", "1/4 cup/50 grams pine nuts, toasted in a hot oven for 5 to 7 minutes, until lightly golden"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the meatballs: Mix the lamb, salt and spice mixture (or allspice) and shape into small balls, the size of large marbles. Melt the butter in a large skillet over medium heat and sauté the meatballs just until lightly browned. Remove from pan with a slotted spoon and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the cherries, sugar and pomegranate molasses in a pot large enough to eventually hold the meatballs and bring to a bubble over medium heat. Reduce the heat to medium-low and, stirring occasionally, simmer for 15 to 25 minutes, or until the sauce has thickened. Add the meatballs and simmer for another 15 minutes, until tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the dish: Arrange the pita bread triangles all over a serving platter, coarse side up, making sure the pointed ends are nicely arranged on the outside. Drizzle the melted butter all over the bread. Spoon the meat and sauce over the bread. Sprinkle the chopped parsley all over, then the toasted pine nuts. Serve immediately."}]}