{"@context": "http://schema.org", "@type": "Recipe", "name": "Goose Pho", "description": "Wade Truong is the head chef at Kybecca in Fredericksburg, Va. He is also a skilled hunter who does his best to eat only wild game at home. As a result, his freezer always has a stash of goose and duck carcasses, which he turns into pho. Mr. Truong's recipe is based on techniques he learned at his parents’ restaurant, Saigon Café in Harrisonburg, Va., and can be adapted to work with a mix of meats. Although geese give the pho a cleaner, beefier flavor, he sometimes uses duck, which imparts an earthier taste. Cooks who don’t have access to goose or duck carcasses can use a combination of chicken carcasses and beef bones. Mr. Truong adds goose or duck feet, which are rich in collagen, to give the soup the distinct, silky mouth feel of a good consommé. The feet are optional, but he suggests at least adding chicken feet; your butcher or poultry purveyors at the farmers' market can usually sell you some.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2019/02/06/dining/06gamerex01/merlin_149765553_fcb45884-4ec7-4fef-8ab1-75afe06aef3f-articleLarge.jpg", "totalTime": "PT7H", "recipeYield": "6 servings, plus extra broth to freeze", "recipeCuisine": "american, vietnamese", "recipeCategory": "dinner, soups and stews", "keywords": "cinnamon stick, duck, ginger, goose, rice noodles, fall, spring, winter, main course", "aggregateRating": null, "recipeIngredient": ["6 to 8 goose, duck or chicken feet (about 1/2 pound total)", "4 raw goose carcasses or 8 raw duck carcasses (about 6 pounds total), or 2 raw chicken carcasses plus 4 pounds beef soup bones", "1 large yellow onion, halved (skin on)", "1 (2-inch) piece unpeeled ginger, halved lengthwise", "3 egg whites (optional)", "1/2 cup coriander seeds", "3 cinnamon sticks, preferably Saigon cinnamon", "8 star anise pods", "24 green cardamom pods", "6 black cardamom pods", "12 whole cloves", "2 tablespoons fennel seeds", "1/4 to 1/2 cup granulated sugar", "2 to 4 tablespoons fish sauce", "1 to 3 tablespoons monosodium glutamate (MSG), optional", "Kosher salt, to taste", "1 (16-ounce) package dried flat rice noodles", "Very thinly sliced braised or confit goose, duck or venison, or rare duck breast (optional)", "Various pho toppings and garnishes, such as Thai basil, cilantro, thinly sliced onion, lime wedges, chopped scallions, mung bean sprouts, mint, sliced jalapeño, hoisin sauce or Sriracha"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Using a heavy cleaver or large chef's knife, whack the feet into a few pieces, which will help the collagen to render while cooking. Place the feet, carcasses and bones, if using them, on a baking sheet or in a large roasting pan. If necessary, cut carcasses into smaller pieces so everything fits in the pan. Roast, turning the bones after about 30 minutes, until dark brown, at least 45 minutes or up to 1 1/2 hours. Do not allow the bones to burn. Transfer the bones to a large stockpot and discard the rendered fat and juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large heavy skillet over high. Cook the onion and ginger cut-side down in the dry skillet until charred and dark brown, 6 to 8 minutes. Transfer to the stockpot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the pot with water, leaving about 2 inches of space at the top. Bring it to a steady simmer over medium-high, then reduce the heat so that only one or two bubbles come to the surface every second or so. Let simmer very gently, occasionally skimming foam from the top, for at least 4 hours and up to 12 hours. The longer you let it go, the more flavor will be extracted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth through a fine-mesh chinois into another large pot and discard the solids. Allow the broth to settle for a few minutes, then skim the fat and scum from the top. Wipe out the stockpot, then return the broth to the stockpot and bring it to a steady simmer over medium-low, continuing to skim the top of the broth until it has reached the desired clarity, about 10 or 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For a clearer broth, in a small bowl, whisk the egg whites together until foamy. While the broth is at a very slow simmer, gently pour the whites into the broth and allow the mixture to cook, undisturbed. Small particles will stick to the whites as they cook, and the egg whites will form a raft that can be skimmed out once firm, about 10 minutes. If there are small pieces of egg white left behind, strain the broth again through the chinois."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the spices to the stockpot with the broth. You can wrap them together in a piece of cheesecloth and tie tightly with kitchen string, or simply toss them directly into the pot. Simmer until the broth is fragrant, about 1 hour. (Leaving the spices in for an extended period can overwhelm the broth.) Remove spice bag or strain the broth again through the chinois, discarding the spices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sugar, fish sauce and MSG, if using, to the broth to taste, and season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rice noodles according to package instructions. To serve, divide noodles among 6 large bowls. Top with sliced meat, if using, and pour the hot broth over the meat. Serve with a platter of toppings and garnishes to pass at the table."}]}