{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower With Anchovies and Crushed Olives", "description": "In this versatile side dish, cauliflower is both sautéed (for flavor and tenderness) and left raw (for crunch), then dressed with warm, crushed olives and melted anchovies. The preserved lemon, which is optional, may seem like a bit much given all the other salty, briny ingredients, but its punch does a lot to bring everything together.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2018/11/14/dining/14cauliflowerrex4/14cauliflowerrex4-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "cauliflower, green olives, oregano, preserved lemon, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 192, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "523 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["4 tablespoons olive oil, plus more for serving", "4 anchovies", "1 small head cauliflower, cut into small florets", "Kosher salt and black pepper", "¾ cup green olives, such as Castelvetrano, pitted and crushed", "2 tablespoons fresh oregano or marjoram", "2 scallions, thinly sliced", "½ preserved lemon, thinly sliced (optional)", "1 tablespoon white-wine vinegar or fresh lemon juice, plus more to taste", "½ cup parsley, tender leaves and stems"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Add the anchovies, and let them melt and sizzle in the olive oil, about 2 minutes. Add about ¾ of the cauliflower, season with salt and pepper and stir to coat. Cook, tossing occasionally, until the cauliflower is browned on one side, 4 to 7 minutes. Add the olives and half of the oregano and give it a stir. Continue to cook until the cauliflower is completely softened and evenly browned, another 4 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and transfer to a large bowl along with scallions, preserved lemon (if using), vinegar and remaining raw cauliflower. Season with salt, pepper and more vinegar, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cauliflower to a large serving platter or bowl and top with parsley, remaining oregano and a drizzle of olive oil."}]}