{"@context": "http://schema.org", "@type": "Recipe", "name": "Shortbread Plum Tart With Honey and Cinnamon", "description": "Based on a classic <a href=\"https://cooking.nytimes.com/recipes/1017854-gateau-breton\">gâteau Breton</a>, this buttery tart is filled with a fresh plum compote flavored with honey, rosemary and cinnamon instead of the usual puréed prunes. You can make the compote and dough a few days ahead, but this tart is best served within 24 hours of baking. After that, the center starts to turn mushy from the moisture released by the fruit. Serve it on its own, or with a dollop of whipped cream.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/09/05/dining/05apperex1/merlin_142874943_c1fed7ef-3a45-4d92-b2ae-40eb56420209-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "dessert, fall, summer, honey, plum", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 288}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 353, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "11 grams", "sodiumContent": "61 milligrams", "sugarContent": "25 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup/200 grams plus 1 to 3 tablespoons granulated sugar", "2 1/3 cups/290 grams all-purpose flour", "3/4 teaspoon ground cinnamon", "1/4 teaspoon fine sea salt", "8 ounces/225 grams unsalted butter (2 sticks), diced, plus more for greasing pan", "1 large egg", "5 large egg yolks", "4 large plums, halved, pitted, and sliced 1/4-inch thick (about 2 1/4 cups)", "2 tablespoons full-flavored honey such as wildflower", "1 cinnamon stick", "1 small sprig rosemary (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, process 1 cup sugar until powdery and fine, about 1 minute. Add flour, cinnamon and salt; pulse to combine. Add butter and pulse until mixture resembles bread crumbs. Add egg and 4 egg yolks, and pulse until mixture comes together. Divide dough in half, form into disks, and wrap in plastic wrap. Chill at least 2 hours or until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine plums, 1 to 3 tablespoons sugar (this depends on how sweet your plums are), cinnamon, honey and rosemary sprig, if using. Simmer until jammy and thick, 15 to 20 minutes, stirring occasionally. Transfer plum mixture to a bowl to cool, and remove cinnamon stick and rosemary sprig. Taste and stir in more sugar if mixture seems very tart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease an 8-inch springform pan and place it on a rimmed baking sheet to catch any butter leaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Between two sheets of parchment paper or plastic wrap, roll one of the dough halves into an 8-inch circle. Transfer dough to prepared cake pan, pressing into edges. Spoon plum compote on top of dough, leaving 3/4-inch border around edge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll second piece of dough into an 8-inch circle, transfer to pan, press around outside edge to stick the pieces together and seal in fruit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine remaining egg yolk with 1 teaspoon water and beat lightly. Brush over top of cake, then use a fork to score a crisscross pattern into the dough. Bake until golden brown, 1 hour (cover with foil if cake is browning too quickly). Cool in pan for 15 minutes, then run a butter knife around the inside edge of the pan and unmold from ring. Cool completely and serve."}]}