{"@context": "http://schema.org", "@type": "Recipe", "name": "Avocado Salad With Herbs and Capers", "description": "This salad is both dead simple to make and highly luscious. It gets a velvety richness from the avocados. The salad is enlivened by a splash of red wine vinegar in the dressing and a handful of briny capers sprinkled on top. The herbs here are used in two ways, both chopped into a garlicky salsa verde-like dressing, and strewn in whole leaves across the plate. Choose your avocados carefully for this; look for firm but not rock-hard fruit, without any mushy spots. If you’d like to substitute another variety of avocado for the Haas you can, but the salad may not have the same texture. Then serve it either as a side dish or an appetizer with a meal of roasted or grilled meats, chicken or fish. Or make it the foundation of a light lunch, with some crusty bread and tangy cheese on the side.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/07/18/dining/18apperex/merlin_140979597_33375069-29a4-4bb5-be4f-60fa8c21d00a-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weeknight, salads and dressings", "keywords": "appetizer, avocado, capers, cilantro, parsley, red wine vinegar", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 470}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 579, "unsaturatedFatContent": "46 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "15 grams", "proteinContent": "5 grams", "saturatedFatContent": "8 grams", "sodiumContent": "656 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 large bunch cilantro", "1 large bunch parsley", "2 scallions, very finely chopped", "1 jalapeño, seeded and very finely chopped", "1 to 2 garlic cloves, finely grated or minced", "1/2 teaspoon fine sea salt, more to taste", "2 tablespoons red wine vinegar, more to taste", "1/2 cup extra-virgin olive oil, more for serving", "4 Haas avocados, peeled, pitted and sliced", "4 teaspoons capers, drained", "Flaky sea salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve a cup of whole cilantro leaves; finely chop the rest of the leaves and tender stems. Transfer chopped leaves to a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve a cup of whole parsley leaves; finely chop the rest of the leaves and tender stems. Transfer chopped parsley to the bowl with the cilantro. Add scallions, jalapeño, garlic, fine salt and vinegar. Stir in oil. Taste and add more salt, vinegar or both, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the whole cilantro and parsley leaves over 4 serving plates. Fan the avocados out on top, and sprinkle lightly with fine salt to taste. Spoon the herb dressing over the avocado, making sure to include the oil in the bowl, and top with capers. Sprinkle with flaky sea salt and black pepper and serve."}]}