{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick-Pickled Vegetables", "description": "Almost any seasonal vegetable will lend itself to being pickled in a mix of apple cider vinegar and rice vinegar, tweaked with a little salt and sugar. Use a mixture of what's in season, and choose small, slender vegetables when you can. Whatever you choose, make sure to scrub vegetables well and peel away roots and thick skins. ", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2017/10/29/magazine/29Fondue-recipes1/29Fondue-recipes1-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "pickles", "keywords": "apple cider vinegar, asian pear, beet, carrot, coriander seeds, fennel, rice wine vinegar, star anise, turnip, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 58}, "recipeIngredient": ["1 cup water", "1/4 cup rice-wine vinegar", "1/4 cup apple-cider vinegar", "5 tablespoons white sugar", "2 teaspoons kosher salt", "3 whole star anise", "15 black peppercorns", "15 whole coriander seeds", "1 serrano chile, split in half", "6 to 8 carrots, peeled, cut diagonally into 3-inch pieces", "6 to 8 small turnips, scrubbed and halved", "1 small fennel bulb, cored and finely sliced", "2 Asian pears, peeled, cored and finely sliced", "3 to 4 rainbow beets, peeled and finely sliced", "1/2 white onion, finely sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water to a boil, and pour into a heatproof bowl. Mix with vinegars, sugar, salt, star anise, peppercorns, coriander seeds and chile, and stir until sugar is dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange prepped vegetables and fruit in a large jar or glass dish, and pour the vinegar mixture over them. (Depending on the size of the container, you may need to mix another batch of the vinegar mixture to cover them.) Let sit at room temperature until the liquid is slightly cooled, then transfer to the refrigerator for at least one hour, or overnight. Eat within the week."}]}