{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Mashed Potatoes With Sour Cream and Chives", "description": "When stovetop and oven space is at a premium, the slow cooker can be a good friend. This hands-off, one-pot recipe makes creamy, slightly tangy mashed potatoes, and, unlike most mashed potato recipes, this one doesn’t call for milk. The potatoes give off enough moisture as they braise, so just some extra butter and sour cream is enough to make them smooth. After mashing, the potatoes hold very well on warm for up to 3 hours: Just add the chives and give the potatoes a quick stir before serving.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2018/11/06/dining/sg-sour-cream-potatoes/sg-sour-cream-potatoes-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "dinner, vegetables", "keywords": "chives, sour cream, yukon gold potato, fall, winter, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 229}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 303, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "9 grams", "sodiumContent": "590 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 pounds Yukon gold potatoes, peeled and cut into roughly 1-inch chunks", "8 tablespoons/1/2 cup unsalted butter (1 stick), melted, plus 3 tablespoons, cut into chunks", "1 tablespoon kosher salt, plus more to taste", "Freshly ground black pepper", "1 cup sour cream", "1 bunch chives, minced (about ⅓ cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss together the potatoes, melted butter, salt and a generous amount of black pepper in a 6- to 8-quart slow cooker. Cook on high until the potatoes are very tender, stirring once or twice if possible to encourage even cooking, about 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sour cream and remaining 3 tablespoons butter and mash the potatoes with a masher until they are smooth and creamy. Just before serving, fold in the chives and season again with black pepper. Taste and add more salt only if necessary."}]}