{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese-Style Barbecued Ribs", "description": "These are the best oven-roasted ribs ever, and they can also be finished on a grill for extra smoky flavor. Creating steam in the oven is the key to tender meat. The ingredients here are close to the ones used by traditional Cantonese barbecue masters to produce sticky-salty-sweet meat that has a reddish, caramelized crust — with ketchup standing in for Chinese red fermented tofu. (It can be left out if desired.) Although these ribs are presented as an appetizer in many American Chinese restaurants, barbecued meat is traditionally a main course, served with freshly cooked rice and a green side like <a href=\"https://cooking.nytimes.com/recipes/1017629-chinese-smashed-cucumbers-with-sesame-oil-and-garlic\">smashed cucumber salad</a> or stir-fried <a href=\"https://cooking.nytimes.com/recipes/1013418-sauteed-baby-bok-choy\">bok choy</a>.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/07/11/dining/11ribsrex/11ribsrex-mediumThreeByTwo440-v2.jpg", "totalTime": "PT6H", "recipeYield": "4 to 8 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, barbecues, finger foods, meat", "keywords": "appetizer, main course, baby back ribs, Chinese rice wine, five-spice powder, high protein", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 381}, "recipeIngredient": ["3 cloves garlic, smashed and peeled", "4 scallions, white and pale green parts only, plus additional sliced scallion for garnish", "3/4 cup hoisin sauce", "1/2 cup ketchup, or 4 tablespoons tomato paste or Chinese red bean paste (nan ru)", "1/4 cup honey or light corn syrup, more to taste", "1/4 cup soy sauce, more to taste", "1/3 cup Chinese rice wine or vodka", "1/4 cup rice vinegar or cider vinegar", "1/2 teaspoon five-spice powder", "2 racks baby back or St. Louis-style pork spareribs, 5 to 10 pounds total (see note)", "Cilantro leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor or blender, mince garlic and scallions. Add hoisin, ketchup, honey, soy sauce, rice wine or vodka, rice vinegar and five-spice powder. Process until well blended. Taste for sweetness; the mixture should be sweet like barbecue sauce, not candy. Adjust the taste with honey, soy sauce and vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 1/3 cup marinade for basting. Transfer remaining marinade to a container or pan large enough to hold the ribs, or to large resealable plastic bags. Add ribs and turn until well coated. Refrigerate at least 4 hours, and up to 2 days, turning occasionally in the marinade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Set up a rimmed baking sheet (or two) with an oven-safe wire rack that fits inside, the kind you’d use for cooling cookies. Line the bottoms of the pans with foil or nonstick baking mats. Place the racks inside the pans and place the empty pans on the bottom rack of the oven. Pour in hot water until it comes about halfway up the sides of the pan. (Do not skip the water: The steam helps cook the meat to the right tenderness.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oven is hot, remove the ribs from the marinade and place on the racks, meaty side up. Bake without basting, 1 hour for baby back ribs, 2 hours for St. Louis style ribs. Check the water level occasionally to make sure it hasn’t cooked off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove ribs from the oven and raise the oven temperature to 450 degrees. Pour off any water from the baking sheet and return the ribs to the racks. (Alternatively, you can finish the ribs on a medium-hot grill; see below.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return ribs to the oven and roast (or grill), basting 2 or 3 times with reserved marinade, for 20 to 30 minutes (less time for baby backs, more for spareribs). Watch the ribs carefully to make sure that the edges don’t burn, and don’t baste them too close to the end; they should be dry and sticky, not wet on the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a big knife to cut between the bones, making sure that each rib has meat on both sides. Mound on a platter, sprinkle with scallions and cilantro, and serve immediately."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chinese-Style Barbecued Ribs", "description": "Perhaps the best oven-roasted ribs you’ll ever make. Finish the ribs on a grill for extra smoky flavor.", "thumbnailUrl": "https://static01.nyt.com/images/2018/07/11/dining/11ribsrex/11ribsrex-mediumThreeByTwo440-v2.jpg", "uploadDate": "2018-07-09T17:22:21.000Z", "duration": "PT50S"}}