{"@context": "http://schema.org", "@type": "Recipe", "name": "Sausage Sage Biscuits", "description": "For an easy, savory breakfast treat, browned sausage and sage are folded into biscuit dough that’s cut into squares. A generous grinding of black pepper in the mix and on top adds a bit of kick. The flaky biscuits are delicious on their own or stuffed with eggs: Scrambled, fried or poached are all great, but so is egg salad. If you’d like, you can garnish the biscuits with whole sage leaves. Simply brush the unbaked squares with a little melted butter, gently press on a sage leaf, and brush the leaf with a little more butter before baking.", "author": {"@type": "Person", "name": "Genevieve Ko"}, "image": "https://static01.nyt.com/images/2018/10/23/dining/gk-sage-biscuits/gk-sage-biscuits-articleLarge-v3.jpg", "totalTime": "PT1H", "recipeYield": "20 biscuits", "recipeCuisine": "american", "recipeCategory": "dinner, quick breads", "keywords": "black pepper, buttermilk, sage, sausage, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 173, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "4 grams", "sodiumContent": "242 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces fresh pork breakfast sausage, bulk or in links", "1/2 teaspoon neutral oil", "3 cups/385 grams all-purpose flour, plus more for dough", "1 tablespoon baking powder", "1/2 teaspoon baking soda", "1 teaspoon kosher salt", "1/2 teaspoon black pepper, plus more for sprinkling", "1/2 cup/115 grams cold unsalted butter, cut into thin slices", "1/4 cup chopped sage leaves", "1 1/4 cups buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the sausage in a large cast-iron or other heavy skillet. (If it’s in links, squeeze it into the pan, and discard the casing.) Turn the heat to medium and cook, stirring and breaking the sausage into tiny bits, until browned and cooked through, about 8 minutes. If the sausage sticks to the pan, add 1/2 teaspoon neutral oil. Remove from the heat and cool to room temperature. You should have a scant 2 cups cooked sausage bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Line a large baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, baking powder, baking soda, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter and toss to coat with the dry ingredients. Using your fingers or a pastry cutter, press and cut in the butter until coarse crumbs form with some peanut-size pieces remaining. Toss in the chopped sage and sausage until evenly coated. Add the buttermilk and mix with a fork until no dry bits remain and mixture forms a mass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly flour a work surface and turn the dough out onto it. With lightly floured hands or rolling pin, pat or roll the dough into an 8-by-10-inch rectangle (about 1/2-inch thick). Using a sharp knife or bench scraper, cut the dough into 2-inch squares. Put on the prepared sheet, spacing 1 inch apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the dough has softened, refrigerate or freeze until stiff. Brush the tops of the dough squares with butter and press a sage leaf onto each. Grind pepper on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until well risen, and the edges are just beginning to brown, about 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool on the pan on a rack for 5 minutes. Serve warm or room temperature, wrapped in a napkin to eat out of hand."}]}