{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Gingersnap Icebox Cake", "description": "Fluffy swirls of strawberry cream are layered with spicy gingersnaps in this summery, no-bake confection. The deep strawberry flavor comes through twice here: once in the mascarpone cream, which is whipped with berry purée, and in a scarlet topping spiked with lime zest and grated fresh ginger. We used Nabisco gingersnaps, but any brand should work, as could vanilla wafers. This cake is best made the day before you want to serve it, giving the gingersnaps a chance to soften into a luscious, soft cake.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/05/30/dining/30appetite3/30appetite3-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "cakes, ice dishes", "keywords": "dessert, gingersnaps, lime, mascarpone, strawberries, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 888}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 305, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "9 grams", "sodiumContent": "271 milligrams", "sugarContent": "20 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound/455 grams strawberries", "12 ounces/340 grams mascarpone", "1/4 cup/28 grams confectioners’ sugar, more as needed", "1 teaspoon vanilla extract", "1 1/4 teaspoons finely grated lime zest, more to taste", "1/2 teaspoon fresh lime juice, more to taste", "32 gingersnaps (about 8 ounces)", "1 tablespoon granulated sugar", "3/4 teaspoon grated fresh ginger, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside half the strawberries, choosing the smallest, prettiest ones. They'll be used for serving. Hull the remaining berries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a blender or food processor, purée the hulled strawberries, then strain through a fine mesh strainer. You should have about 2/3 cup of purée."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer set on low speed, whisk together strawberry purée, mascarpone, confectioners’ sugar, vanilla, 3/4 teaspoon lime zest and the lime juice. Once the cream mixture is combined, but not fully whipped, taste and add more confectioners’ sugar if necessary (this will depend on how sweet your strawberries are). Whip to medium-stiff peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a serving platter, lay 2 rows of 4 cookies (for a total of 8) in a rectangle. Spread 1/2 cup cream mixture over the cookies, spreading it to the edges. Top with another 8 cookies, and spread with another 1/2 cup cream. Repeat 2 more times, so you have 4 layers of cookies. Top with remaining cream, spreading it along the sides like frosting. Cover loosely with plastic wrap and chill for at least 8 hours, and preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Half an hour before serving, hull and quarter remaining strawberries (cut them in eighths, if they’re large). Toss berries in a medium bowl with granulated sugar, remaining 1/2 teaspoon lime zest and the ginger. Let sit for at least 30 minutes, and up to 1 hour; they should release their juices, which will turn syrupy from the sugar. Taste and add more lime zest, ginger and a squeeze of lime juice, if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, arrange strawberries on top of the cake and drizzle with accumulated syrupy juices. Serve at once, cutting cake into slices."}]}