{"@context": "http://schema.org", "@type": "Recipe", "name": "Beef Carpaccio", "description": "Beef tenderloin is called for here as it will unfailingly yield the tenderest carpaccio. It is a long, slender, tapered muscle that runs under the ribs and close to the back bone, and as such is, in a way, shielded from being worked very hard, unlike cuts lower on the animal. As for all of us, the closer to the ground the muscle lives, the tougher becomes the work. Some chefs have a real affinity for the harder-working muscles. Top round, for example, is also often called for in carpaccio recipes and is cut from a muscle that has to work harder, and therefore, is thought to have more character, and more flavor. I would gently warn that harder-working muscles come with a little more “chew.” Try it here, as written, with sure success, then explore other cuts if you're interested.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2019/04/28/magazine/28mag-eat-slideshow-slide-G373/28mag-eat-slideshow-slide-G373-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "appetizer, arugula, beef tenderloin, parmesan, truffle oil, high protein", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "recipeIngredient": ["1 pound beef tenderloin", "4 cups neutral oil, such as vegetable or canola oil", "1 large russet potato, peeled, cut into 2 1/2-inch-by-1/4-inch matchsticks and soaked in water", "Kosher salt and freshly ground black pepper", "Black- or white-truffle oil, for drizzling", "2 cups arugula (about 1 1/2 ounces), washed and trimmed", "1/2 lemon, juiced (about 1 1/2 tablespoons)", "Extra-virgin olive oil, for drizzling", "2 ounces Parmesan, shaved into curls with a Y-peeler"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the beef tenderloin of all fat, sinew and silver skin. Tightly wrap the beef in plastic wrap, and place in freezer until firm, about 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the beef from the freezer, and slice it crosswise into 1/8-inch-thick rounds. Divide the sliced beef into 4 equal portions among 4 sheets of parchment. Arrange the slices for each portion into a round, like a four-leaf clover or a pansy, with each petal slightly overlapping the next. Place a clean sheet of parchment on top of each neatly arranged round, and with the heel of your hand or a rolling pin, gently press the meat into cracker-thin, uniform circles without tearing the meat, working quickly to keep the meat from warming. Transfer the parchment-covered portions and 4 plates to the refrigerator to chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up a stovetop fryer by heating the neutral oil in a Dutch oven over medium heat. Attach a candy thermometer to the side of the fryer, and heat the oil until the gauge reads 325 degrees, about 7 minutes. Thoroughly and carefully drain, then pat-dry, the matchstick potatoes. Just before cooking the potatoes, increase the temperature to high in anticipation of the plummeting in temperature. Add the potatoes to the oil and cook, agitating with a spider or slotted spoon to ensure even cooking, until the potatoes are light and golden in color, 2 or 3 minutes. Using a slotted spoon, transfer the potatoes to a paper-towel-lined plate. Season with kosher salt and a few drops of truffle oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dress the arugula with lemon juice, a drizzle of olive oil, kosher salt and plenty of freshly cracked black pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, remove the top layer of parchment from a beef portion, turn the beef onto a chilled plate and carefully peel off the remaining parchment. Repeat with the remaining beef portions. Season the beef with salt and freshly ground black pepper. Pile the dressed arugula, Parmesan, then the warm matchstick potatoes on the beef in 4 even portions. Season with salt, pepper and several drops of truffle oil."}]}