{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Pumpkin Pie", "description": "The secret to this rich, creamy pumpkin pie is aquafaba, or the liquid leftover from cooked chickpeas, which is used in recipes to mimic the thickening, binding and foaming properties of egg whites. (For ease, we recommend using the liquid from canned chickpeas in this recipe.) This pie could not be simpler: Just toss everything into a blender for three minutes until it increases in volume, pour it into a prepared, unbaked pie crust, then bake until the top is crackly and ever-so-slightly jiggly in the center. Because this pie doesn't contain any eggs or dairy, once the pie is chilled and set, you can let it sit out at room temperature overnight. For longer-term storage, keep it in the refrigerator for up to a week. Serve with a dollop of vegan whipped cream.", "author": {"@type": "Person", "name": "Isa Chandra Moskowitz"}, "image": "https://static01.nyt.com/images/2019/11/05/dining/icm-vegan-pumpkin-pie/merlin_163633284_a256bde2-aae1-40ff-b996-f5fc517919d1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "One 9-inch pie", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "aquafaba, cinnamon, cloves, coconut oil, cornstarch, ginger, maple syrup, nutmeg, pumpkin purée, dairy-free, vegan, vegetarian, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "recipeIngredient": ["3 cups/740 grams pumpkin purée", "1/2 cup/120 milliliters maple syrup", "1/2 cup/120 milliliters aquafaba (see Note)", "2 tablespoons coconut oil", "2 tablespoons cornstarch", "1 teaspoon ground cinnamon", "1 teaspoon ground ginger", "1/4 teaspoon ground nutmeg", "Pinch of ground cloves", "1/2 teaspoon fine sea salt", "1 (9-inch) vegan pie crust, unbaked and chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Add the pumpkin, maple syrup, aquafaba, coconut oil, cornstarch, cinnamon, ginger, nutmeg, cloves and salt to a blender. Blend on medium speed for about 3 minutes, until light and fluffy. It should increase by 20 percent to 25 percent in volume."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour into prepared pie crust. Bake for 60 to 70 minutes, until the top is crackly, the filling is a little jiggly in the center and pulling away from the sides slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool for about 30 minutes at room temperature, then refrigerate for at least 3 hours. Serve at room temperature."}]}