{"@context": "http://schema.org", "@type": "Recipe", "name": "Zuni Café’s Focaccia", "description": "The excellent hamburger at Zuni Café in San Francisco has always been served on a square of toasted rosemary focaccia. The pastry chef Annie Callan offers this house recipe: Scaled to a reasonable size, it is easy to put together and fun to make. Bake it in a 9-by-12-inch rimmed baking sheet for a nice, thick focaccia that can be cut into six 4-inch squares (the trimmings are a delicious snack), and split horizontally into a hamburger bun. The baked focaccia can be kept for several days in an airtight container and needs only a brief toasting to bring it back to life. But you can also roll the dough thinner and bake a more pizzalike flatbread, perhaps topped with stewed onions or peppers.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/03/06/dining/06kitchrex-zunifoccacia/merlin_150546081_d75979bf-29cd-456c-87b1-99fcd83fef12-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "6 squares", "recipeCuisine": "italian", "recipeCategory": "brunch, dinner, lunch, breads", "keywords": "bread flour, rosemary, yeast, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 170}, "recipeIngredient": ["1 1/4 cups/300 milliliters warm water", "1 1/2 teaspoons dry active yeast", "3 tablespoons olive oil, plus more for greasing pan", "2 teaspoons minced rosemary", "1 2/3 cups/215 grams bread flour", "1 2/3 cups/215 grams all-purpose flour, plus more for kneading", "1 1/2 teaspoons kosher salt", "Fine cornmeal or semolina, for dusting bottom of pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the mixing bowl of a stand mixer, combine water and yeast, stirring to dissolve. Add 3 tablespoons oil and rosemary. Add bread flour and mix, using dough hook, to make a stiff batter. Let sit at room temperature until bubbly and doubled in size, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all-purpose flour and salt. Mix at low speed until dough comes together. Continue mixing for 10 minutes, until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove dough hook and cover bowl with plastic wrap. Let dough rise until doubled, about 40 minutes. Punch down dough, remove from bowl and knead briefly on work surface. Dough should be soft and slightly sticky. Dust with about 2 tablespoons all-purpose flour, if necessary, for easier handling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rolling pin, stretch the dough into a rectangle about 10 by 14 inches. Cover loosely with plastic wrap, and let relax for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 9-by-12-inch rimmed baking sheet with 1 tablespoon olive oil. Dust bottom of pan lightly with cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer dough to baking sheet, and, using your hands, stretch it to the edges of the baking sheet. Dough will spring back: Let it rest again for a few minutes; it may take several attempts to fill entire baking sheet evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover stretched dough loosely with a damp kitchen towel (or use an inverted rimmed baking sheet), set in a somewhat-warm place, and let rise to top of baking sheet, or slightly higher, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Uncover and bake for 35 to 40 minutes, until nicely browned. Cool on a rack and cut into 4-inch squares. (The extra focaccia trimmings are delicious toasted.) Split squares horizontally and reheat before serving."}]}