{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Carrots With Yogurt, Carrot-Top Oil and Dukkah", "description": "You can serve these carrots with Greek yogurt, or with homemade labneh, if you start the night before (see Tip below). This recipe calls for making your own dukkah: You’ll have more than you need, but keep any leftovers in a sealed container to sprinkle over salads, grilled meat or fish. A bunch of carrots from your farmers’ market will work best here, but you can also use regular carrots that have been halved or quartered lengthwise. If you can’t find bunches of carrots with their fresh tops, you can prepare the oil using parsley instead, or double the tarragon for an even more herbaceous version.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2020/02/19/dining/14Ottorex1/merlin_168725634_b46ec8ce-488c-486d-a1de-df8af7754d05-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, vegetables", "keywords": "carrot, dukkah, greek yogurt, honey, olive oil, tarragon, side dish, spring, winter, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 110}, "recipeIngredient": ["2 1/4 pounds/1 kilogram (6-inch/15-centimeter) carrots with greens attached", "3/4 cup/40 grams roughly chopped fresh tarragon leaves", "1/2 cup/120 milliliters olive oil, plus more for greasing the pan", "Kosher salt and freshly ground black pepper", "3 tablespoons/50 grams honey (runny honey)", "1 tablespoon plus 1 1/2 teaspoons apple cider vinegar", "1 2/3 cups/400 grams full-fat Greek yogurt", "1/4 cup/35 grams blanched hazelnuts, toasted", "1/4 cup/35 grams pine nuts, toasted", "2 tablespoons coriander seeds, toasted", "1 tablespoon plus 1 1/2 teaspoons black and white sesame seeds, toasted", "1 teaspoon cumin seeds, toasted", "1 teaspoon dried oregano", "1/2 teaspoon sweet paprika", "1/4 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and peel the carrots and trim the tops, leaving about 1 inch/3 centimeters of the greens attached. Measure out 1 packed cup/40 grams leafy carrot tops and wash well to get rid of any grit. Squeeze out as much water as possible, and pat dry. Roughly chop the carrot tops then transfer them to a blender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tarragon, 6 1/2 tablespoons/100 milliliters oil and a small pinch of salt. Blitz until completely smooth, scraping down the sides as needed, then transfer the mixture to a fine-mesh sieve set over a bowl. Strain the mixture, extracting as much oil as possible. (You should have about 3 tablespoons/45 milliliters.) Discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare a steamer for your carrots by heating water in your steamer or setting a colander over a large pot with a few inches of simmering water. Once ready, add the carrots and steam for 10 minutes, or until you can easily pierce the thick parts with a knife but the carrots are not overly soft. Transfer the carrots to a large, shallow dish along with the remaining 1 1/2 tablespoons/20 milliliters oil, plus 1/2 teaspoon salt and a good grind of pepper. Toss to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the honey, vinegar and a tiny pinch of salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dukkah: Add all the dukkah ingredients to a food processor and pulse a few times until the nuts are roughly chopped. (You should have 1 scant cup.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a well-oiled grill pan over high. Working in a few batches to avoid overcrowding, grill the carrots on all sides, about 6 minutes per batch. Transfer the grilled carrots to the bowl with the honey dressing, and toss gently to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the yogurt with 1/4 teaspoon salt, then spread it out on a large platter. Drizzle all over with the carrot-top oil then add the carrots, arranging them artfully so they’re all facing the same direction. Spoon a generous amount of dukkah on top and pass the rest."}]}