{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp and Avocado Salad With Citrus Vinaigrette (Camarones a la Vinagretta)", "description": "Versions of seafood “coctel” are found around the Caribbean, usually with ketchup as a base for the sauce. Here, the tomato and onion are part of the salad, and the dressing is based on citrus and olive oil, plus a bit of mustard to make it creamy. It’s a refreshing and satisfying dish for hot weather, perfect with a cold beer at the end of a long summer day. Diced avocado makes the dish more filling, but it is optional.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2019/03/19/dining/19puertorex-shrimp/merlin_151977462_e4a8e1c7-3b48-4e45-b436-7128c3c92274-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "salads and dressings, seafood", "keywords": "appetizer, avocado, cilantro, citrus, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "recipeIngredient": ["Kosher salt and freshly ground black pepper", "4 black peppercorns", "2 dried bay leaves", "1 pound fresh shrimp, peeled and deveined", "2 ripe plum tomatoes, diced (or 12 cherry tomatoes, quartered)", "2 tablespoons chopped red onion", "2 tablespoons olive oil", "2 tablespoons fresh lime, lemon, grapefruit or any tart citrus juice", "1 tablespoon fresh orange juice", "2 tablespoons chopped fresh cilantro, culantro (also called recao) or flat-leaf parsley (or a combination)", "1 tablespoon chopped fresh oregano or thyme", "1/8 teaspoon Dijon mustard", "1 ripe avocado", "Whole lettuce leaves, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the shrimp: In a pot, combine 1 quart water with 1 tablespoon salt. Add peppercorns and bay leaves and bring to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare an ice bath: Add enough ice to a large bowl until half full. Sprinkle the ice with 2 tablespoons salt and top with enough cold water to cover. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water boils, stir the shrimp into the hot water and turn off the heat. Let cook until just pink and opaque, 1 to 2 minutes depending on size of shrimp. Drain shrimp and transfer to the ice bath. Stir well and set aside until shrimp are completely chilled, 3 to 5 minutes. Drain shrimp again and transfer to paper or kitchen towels to dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a medium bowl, stir together tomatoes, red onion, oil, fruit juices, herbs and mustard. Season to taste with salt and pepper. Add shrimp, toss to coat and chill for at least 1 hour (or up to 1 day)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, peel and dice the avocado and fold into the shrimp salad. Serve chilled, in a serving bowl or on individual plates lined with lettuce leaves."}]}