{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Crumb Cake", "description": "With their pleasant tang and gorgeous color, cranberries take this brunch staple to the next level. Here, they're nestled in a sour cream cake batter that's topped with a butter crumb, and cook down to add the perfect burst of sour. You can use fresh cranberries or berries that have been frozen and thawed, but note that the cooking time will vary depending on which you use. Lastly, while cranberries make this cake especially nice for fall and winter, blueberries, raspberries or blackberries would be excellent in the summer.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/11/07/dining/ss-cranberry-crumb-cake/merlin_163577526_ced088cf-cc04-4efe-b9f6-31d56c93e2fc-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "24 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "cinnamon, cranberry, orange, sour cream, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 318}, "recipeIngredient": ["1/2 cup/115 grams unsalted butter (1 stick), at room temperature, plus more for greasing the pan", "2 1/2 cups/320 grams all-purpose flour", "1 1/2 teaspoons baking powder", "3/4 teaspoon kosher salt", "1/2 teaspoon baking soda", "1 1/4 cups/250 grams granulated sugar", "1 tablespoon freshly grated orange zest (from 1 or 2 oranges)", "2 large eggs, at room temperature", "2 teaspoons pure vanilla extract", "1 cup/240 milliliters full-fat sour cream, at room temperature", "3 cups/340 grams fresh or unthawed frozen cranberries", "1 1/2 cups/190 grams all-purpose flour", "1 cup packed/220 grams light or dark brown sugar", "1 teaspoon ground cinnamon", "1/2 teaspoon kosher salt", "1/2 cup/115 grams unsalted butter (1 stick), melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: Heat the oven to 350 degrees. Butter a 9-by-13-inch baking pan and line with parchment paper, leaving a 2-inch overhang on two sides. Butter the parchment. In another medium bowl, whisk together the flour, baking powder, salt and baking soda."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the granulated sugar, butter and orange zest with an electric mixer on medium until light and fluffy, about 3 minutes. Add the eggs, one at a time, scraping down the bowl as necessary. Add in the vanilla. Beat in half of the dry ingredients at low speed, then the sour cream, and then the remaining dry ingredients, mixing just until no dry spots remain (do not overmix). Fold in 1 cup of the cranberries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the batter to the prepared pan and spread it out into an even layer using an offset spatula. Top with the remaining cranberries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the crumble: In a medium bowl, whisk together the flour, brown sugar, cinnamon and salt. Add the butter and mix it in with a fork until evenly moistened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the crumble mixture evenly over the top, squeezing into various-size clumps. Bake the cake until a toothpick inserted into the center comes out with moist crumbs attached. If you are using fresh cranberries, start checking the cake around 45 minutes. If you are using frozen cranberries, this could take 55 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cake in the pan to a rack to cool completely (about 3 hours). Using the parchment overhang, carefully lift the cake and transfer to a cutting board to cut and serve."}]}