{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Linguine With Herbs, Corn and Arugula", "description": "The beauty of this pasta lies in its ease: Combine fresh, seasonal ingredients and let them shine. Here, shrimp is sautéed in butter until just cooked through, then set aside while the rest of the dish comes together. Peppery arugula, sweet corn and an abundance of fresh herbs round out this easy-to-assemble dinner, which is perfect after a long day at the beach or even just the office. Seared scallops would work well in place of shrimp, or you could try a combination of the two. Herbs, too, are up to you: Basil screams summer, but tarragon and Italian parsley would also be nice. White wine is used to make a light sauce for the pasta; you know what to do with any extra.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/07/16/dining/ch-shrimp-pasta-with-arugula-and-corn/merlin_157887831_c0b688ec-3ba6-4442-81f0-cb3f29eb4a4b-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, pastas, seafood, vegetables", "keywords": "arugula, butter, corn, herbs, pasta, shrimp, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 275}, "recipeIngredient": ["Kosher salt", "12 ounces linguine or spaghetti", "1 pound large shrimp, peeled and deveined, tails removed, if you prefer", "Black pepper", "1/2 cup unsalted butter (1 stick)", "2 cups fresh corn kernels (from 2 to 3 ears)", "3 garlic cloves, thinly sliced", "1/2 teaspoon red-pepper flakes", "1 cup dry white wine", "8 ounces baby arugula, spinach or other tender greens", "2 cups loosely packed, roughly chopped tender herbs, such as basil and mint", "Extra-virgin olive oil, for drizzling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Add pasta and cook according to package instructions until it is just short of al dente. Reserve 1 cup of the pasta cooking water, then drain pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, season the shrimp well with salt and pepper. Melt half the butter in a deep 12-inch skillet over medium heat. Add the shrimp and sauté until just cooked through, 1 to 2 minutes per side. Remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the corn to the pan and season with salt. Cook, stirring frequently, until browned in spots, 4 to 5 minutes. Add garlic and red-pepper flakes and cook, stirring frequently, 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine, bring to a simmer and cook until it is reduced by about half, 3 to 4 minutes. Add the cooked pasta to the skillet and toss to combine. Add the arugula by the handful, stirring well between each addition, until wilted, adding some of the reserved pasta water as needed. Add the remaining butter and the shrimp to the pasta and toss until the butter is melted and everything is coated with sauce. Add more pasta water as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the herbs and toss to combine. Season to taste with salt and pepper. Transfer to a large bowl or serve directly from the skillet. Top with remaining herbs, drizzle with olive oil, if desired, and serve immediately."}]}