{"@context": "http://schema.org", "@type": "Recipe", "name": "Bibingka (Coconut Rice Cakes With Banana Leaves)", "description": "Bibingka is a cake made of rice flour, so it’s naturally gluten-free, chewy but tender throughout, with a soufflé-like fluffiness. It’s traditionally cooked in a clay pot over and under hot coals, a difficult setup to replicate; instead, I pour the batter into a cast-iron pan lined with banana leaves, which char as the cake bakes, infusing it with their scent. (You can cut the ribs off the leaves to make them more malleable.) Nearly halfway through baking, the cake is topped with salted duck egg, an ingredient available at Asian specialty groceries. If you can’t find it, the cake will be more forthrightly sweet, lacking that sly note of brine. As a final touch, if you have a kitchen torch available, char the edges of the banana leaves, so a little smokiness suffuses the delicate cake.", "author": {"@type": "Person", "name": "Angela Dimayuga"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/08Filipinorex10/merlin_161002752_06a44c57-3e21-4e1a-8e3e-14e0c664d3a5-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Two 8-inch cakes (about 16 servings)", "recipeCuisine": "filipino", "recipeCategory": "snack, cakes", "keywords": "banana leaf, coconut milk, cream cheese, parmesan, rice flour, salted duck egg, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "recipeIngredient": ["4 large sheets frozen banana leaves (from a 1-pound package), rinsed and thawed", "1/2 cup/115 grams unsalted butter (1 stick), melted", "8 ounces/225 grams cream cheese, softened", "1/2 cup/30 grams finely grated Parmesan", "2 3/4 cups plus 2 tablespoons/455 grams rice flour", "2 cups/400 grams granulated sugar", "2 tablespoons baking powder", "2 cups/480 milliliters coconut milk", "4 eggs", "2 salted duck eggs, peeled and thinly sliced crosswise into coins (not ovals)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees and center racks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two 8-inch cast-iron skillets or similar pans with banana leaves: Set 2 large sheets in each pan, allowing banana leaves to overlap in the center and come up the sides. Cut off any overhang that extends more than 1/2 inch beyond the lip of the skillet. Melt the butter, and add 1 tablespoon melted butter to each skillet, brushing it to coat the bottom and sides, reserving the remaining melted butter for the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix together the cream cheese and Parmesan; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the rice flour, sugar and baking powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the coconut milk, eggs and the remaining 6 tablespoons melted butter. Add about a third of the flour mixture and stir to combine. Repeat twice, integrating dry ingredients into wet ingredients, stirring until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour half the cake batter into each buttered skillet and smooth each into an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cakes for 30 minutes, until set around the edges but the surface of the center is puffy and not fully cooked through, rotating the cakes halfway through cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cakes from the oven. Form the cream cheese mixture into about 10 1/2-inch-thick logs. Top each cake with a few slices of duck egg coins in the center, then arrange five cream cheese logs on each cake, radiating outward from the center of each cake, like the arms of a starfish. (The logs will sink in lightly on the top, but should not sink in fully.) Return the cakes to the oven to continue baking for 10 minutes more, then increase the temperature to 400 degrees and cook until the top is a deep golden and cakes are fully set, 10 to 15 minutes. The cakes will be lightly domed and should spring back when touched."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool 10 minutes then cut into slices. Serve warm or at room temperature."}]}