{"@context": "http://schema.org", "@type": "Recipe", "name": "Currywurst", "description": "Created in postwar Berlin in 1949, currywurst originated as a “poor man’s steak,” cobbled together using sausages, canned tomatoes and curry powder. Today, it’s a popular street food across Germany, although how you enjoy it depends on the vendor and your preferences: The sausages can be served with or without skin, and you can request your currywurst sauce to be scharf (hot) or even extra-scharf. In traditional German currywurst sauces, tomatoes and vinegar provide acidity, sugar or juice lend sweetness and mild curry powder adds spice (although some adventurous cooks add other aromatics and spices, like mustard powder, hot chile or even lemongrass). This recipe, adapted from Alfons Schuhbeck's “The German Cookbook” (Phaidon, 2018), is a great introduction, not too spiced or too sweet, and can be customized according to taste.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/09/27/dining/aw-currywurst/merlin_161590545_8a14d4ba-159d-43dc-b7b3-e0d2de7c3afc-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "german", "recipeCategory": "dinner, weekday, sausages", "keywords": "chiles de árbol, cinnamon, curry powder, paprika, sausage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 152}, "recipeIngredient": ["4 tablespoons olive oil", "1 small yellow onion, finely chopped", "1 1/2 tablespoons light brown sugar", "1 tablespoon mild curry powder, plus more for sprinkling", "1 teaspoon ground sweet paprika", "1 (2-inch) cinnamon stick", "1 small dried chile de árbol", "2 tablespoons tomato paste", "1 (14-ounce) can diced tomatoes with their juices", "3/4 cup vegetable stock", "2 tablespoons apple cider vinegar or white wine vinegar", "Kosher salt, to taste", "6 to 8 fresh bratwurst sausages, knockwurst sausages or hot dogs", "1 tablespoon neutral oil, such as canola or vegetable", "French fries, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the currywurst ketchup: In a large skillet, heat 1 tablespoon olive oil over medium. Add the onion and sauté, stirring occasionally, until softened, about 5 minutes. Add the brown sugar and cook, stirring occasionally, until the onion is caramelized, about 5 minutes. Stir in 1 tablespoon curry powder, paprika, cinnamon and chile and cook until just fragrant, about 1 minute. Stir in the tomato paste, then add the chopped tomatoes and their juices, stock and vinegar. Cook, stirring occasionally, until thickened, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the cinnamon stick and chile de arbol, then transfer tomato mixture to a blender and purée until smooth. Blend in the remaining 3 tablespoons olive oil in a steady stream. Season to taste with salt. (This makes about 2 cups of sauce.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, using the tines of a fork, lightly poke a few holes in the skin of the sausages on all sides to allow air to escape as the sausages cook. Heat the neutral oil in a large skillet over medium heat. Add the sausages and pan-fry, rotating until lightly browned on all sides, about 8 to 10 minutes, depending on what type of sausage you select. Let rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the sausages on an angle into thick coins, if desired, and divide the sausages among the plates. Transfer the curry sauce to a squeeze bottle and drizzle on top of the sausages (alternately, you can simply drizzle the curry sauce on top using a spoon). Sprinkle with additional curry powder, if desired, and serve with French fries."}]}