{"@context": "http://schema.org", "@type": "Recipe", "name": "Quick-Seared Short Ribs With Charred Scallion Salsa", "description": "Typically used for long braises, short ribs are insanely flavorful and have excellent marbling, which means you can and should cook them as you would a more expensive cut: seared on all sides until medium-rare. To serve, thinly slice the meat and top it generously with a mixture of fresh and charred scallions and tomatillos. Set it out with warmed tortillas and hot sauce for a D.I.Y. taco experience, though it’s also great over a bed of peppery greens or crunchy romaine.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/07/17/dining/15Romanrex/merlin_156252858_78745786-8129-4875-82dd-25d37d5b0f18-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "meat", "keywords": "cilantro, scallion, short ribs, tomatillo, tortilla, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 128}, "recipeIngredient": ["1 1/4 to 1 1/2 pounds boneless short ribs, at least 1-inch thick", "Kosher salt and ground pepper", "1 large bunch scallions or spring onions (either red or green spring onions work)", "4 ounces tomatillos (6 to 8 tomatillos)", "1/4 cup fresh lime juice (from 2 limes), plus 1 lime, quartered", "2 tablespoons canola oil", "2 teaspoons cumin seed or 1/2 teaspoon ground cumin", "1/4 cup olive oil", "1 cup cilantro, leaves and tender stems", "Tortillas, for serving", "Hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season short ribs with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice half the scallions and half the tomatillos and combine in a medium bowl along with lime juice. Season with salt and pepper and set aside. Leave the remaining scallions and tomatillos whole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet (preferably cast iron) over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sear short ribs until deeply golden brown on both sides, about 3 to 4 minutes per side. Transfer to a cutting board or platter to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Without wiping out the skillet, add remaining whole scallions and tomatillos to the skillet and season with salt and pepper. Cook, turning occasionally, until totally tender and lightly charred in spots, 4 to 6 minutes. Add cumin and toss to coat, lightly toasting the seeds. Remove from heat and, using tongs, transfer the vegetables to a cutting board."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop the scallions and tomatillos and place in a small bowl; add olive oil and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice short ribs crosswise and place on a large serving platter or plate. Spoon charred scallion sauce over the meat. Serve with remaining fresh scallion mixture, cilantro, tortillas, hot sauce and lime wedges for squeezing over the top."}]}