{"@context": "http://schema.org", "@type": "Recipe", "name": "Sekihan (Red Bean Sticky Rice)", "description": "Steamed sticky rice tinted red with adzuki beans is essential Japanese celebration food, for graduations, festivals, milestone birthdays and even first periods (to the extreme embarrassment of teenage girls). Sekihan is usually one of many dishes on the table, and more than pairing with any particular flavor, it conveys a sense of ceremony. In Japan, it’s not essential to osechi ryori, New Year’s cooking, but for some Japanese and many Japanese-Americans, sekihan is part of welcoming the New Year. This recipe was adapted from Gaye Sasaki Chinn, whose family has been celebrating the Japanese New Year in Seattle for more than a century. The internet is rife with shortcut-recipes for making sekihan in a rice cooker, but if you’re going to make it only for special occasions, it’s worth taking the time to steam the rice, as the Sasakis do.", "author": {"@type": "Person", "name": "Hannah Kirshner"}, "image": "https://static01.nyt.com/images/2019/12/25/dining/25OSECHIREX2/merlin_166106922_574d0c78-bf3e-432d-9c97-0e1c66b1c13a-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 small servings", "recipeCuisine": "japanese", "recipeCategory": "grains and rice", "keywords": "black sesame seeds, dried beans, glutinous rice, rice, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "recipeIngredient": ["1/4 cup dried adzuki beans (small ones, if you have a choice)", "2 cups mochi rice (Japanese glutinous rice)", "2 teaspoons black sesame seeds", "1/2 teaspoon flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before (or at least 4 hours before) you make sekihan, cook the beans and soak the rice in the red bean-cooking liquid (through Step 4): In a small saucepan, combine the dried beans and 2 cups water. Bring to a boil, then cook for 1 minute. Strain the beans, discarding the water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the beans to the saucepan, add 2 cups water, cover loosely, and bring to a simmer over high heat. Reduce the heat as needed to simmer the beans for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans, pouring the rusty-red cooking liquid into a large nonreactive bowl or container. Using a ladle, scoop up the liquid and pour it back into the bowl several times to brighten the color by incorporating air. Transfer beans to a plate to cool; cover with a damp cloth and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fine-mesh strainer set over a bowl, rinse the rice in several changes of cool water, until the water runs almost clear (washing away the bran makes the cooked rice shiny and sticky); drain rice. Add the rice to the reserved bean-cooking liquid, cover, and soak overnight (or at least 4 hours) in a cool place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day (or at least 4 hours later), steam the rice: You can use a Japanese steamer pot, or a metal or bamboo steamer that fits in a wok or pot. Fill the pot or wok with plenty of water, but not so much that the water will touch the rice. Line the steamer with a piece of cheesecloth or muslin big enough to fold over the rice (about 24 inches). Drain rice, reserving the liquid. Transfer rice to the cloth-lined steamer, and put pre-cooked beans on top. Fold the cloth loosely over the rice and beans, and close the lid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam over high heat for 10 minutes, then turn off the burner, and open the lid and cloth. Spoon about 2 tablespoons of the reserved liquid over the rice. Use the cloth to gently fold the rice over on itself, incorporating the beans, and then shake it back into a somewhat even layer. Replace the cloth and lid; repeat Step 6 two more times (steaming for a total of 30 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to high and cook until steam comes out steadily, about 3 minutes, then remove from heat, and leave covered for 10 minutes. Transfer sekihan to a lacquerware box, or other special serving container."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a frying pan over medium-high, then toast the sesame seeds, stirring constantly, until fragrant, 30 seconds to 1 minute. Transfer to a bowl and mix with salt (this is called goma-shio); set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve sekihan at room temperature, with goma-shio for sprinkling on individual portions. Leftovers can be shaped into onigiri (rice balls) and rolled in goma-shio."}]}