{"@context": "http://schema.org", "@type": "Recipe", "name": "Aloo Masala (Spiced Potatoes)", "description": "A little bowl of simply spiced half-mashed potatoes and onion, glistening with fat, is a standard side dish at bustling restaurants that serve <a href=\"https://cooking.nytimes.com/recipes/1020908\">dosas</a>. It’s also one of the best vegetable dishes — inexpensive, quick and delicious — to add to your repertoire as a home cook. The key to these potatoes is water, not fat. Overcooking them just slightly ensures that they’re tender, and that they hold enough moisture so when you drop them into the hot pan, they break up and meld into the sautéed onion mix, becoming almost indistinguishable from it. Though aloo masala is great with a hot dosa, it’s a versatile dish that can also work as a side with other meals.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/tr-aloo-masala/merlin_169211607_6cefcc4e-9792-493e-aa27-f00f217a9621-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner, quick, vegetables", "keywords": "cilantro, cumin, ginger, lemon, potato, turmeric, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 284}, "recipeIngredient": ["2 large Yukon Gold potatoes, peeled and cut into 1-inch cubes (about 4 cups)", "2 tablespoons neutral oil, such as grapeseed or canola", "1 tablespoon urad dal (split black gram)", "1/2 teaspoon cumin seeds", "1/4 teaspoon black mustard seeds", "2 tablespoons roughly chopped roasted cashews", "1 green finger chile (or serrano chile), finely chopped", "1 (1-inch) piece fresh ginger, peeled and finely chopped", "1 medium yellow onion, chopped", "1/2 teaspoon kosher salt, plus more as needed", "1/4 teaspoon ground turmeric", "1/4 cup chopped cilantro leaves and tender stems", "1/2 lemon, for squeezing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to boil over high. Once the water boils, add the potatoes. Cook until tender, about 10 minutes, then drain in a colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy pot, heat the oil over medium. Add the urad dal, cumin and mustard seeds, and fry until cumin seeds are browned and dal is crisp, 1 to 2 minutes. Stir in the cashews, chile and ginger, and cook for another 2 minutes. Add the onion, salt and turmeric, and lower the heat. Cook, stirring occasionally, until the onion is translucent and tender but not browned, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tip the cooked potatoes, half the cilantro and 1/4 cup water into the pot, and stir well to coat. As you stir, let some of the potato get mashed. If the mixture seems dry, add a splash more of water. Cook over low, stirring occasionally, until the potatoes are heated through, about 5 minutes, then season to taste with salt. Scrape into a serving dish; top with a generous squeeze of lemon and the remaining cilantro."}]}