{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy White Bean and Seaweed Stew With Parmesan", "description": "Cooking dried beans with seaweed is a traditional method of adding flavor that’s also thought to mitigate some of the gas-inducing enzymes present in the legumes. Here, white beans are simmered with briny dried kombu to add depth, then mixed with slivered kelp for freshness and a slight crunch. It’s a play on white beans with escarole, but with the flavor of the sea.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/04/30/dining/30seaweedrex3/merlin_153567024_f7bc83e9-5a76-4de9-ae5c-15093aa6ba4c-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, beans, soups and stews", "keywords": "cannellini beans, kombu, parmesan, seaweed, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "recipeIngredient": ["1/4 cup extra-virgin olive oil, plus more for serving", "1 yellow onion, diced", "3 teaspoons fine sea salt, plus more as needed", "2 carrots, sliced into 1/2-inch-thick rounds", "1 celery stalk, diced", "1 fennel bulb, trimmed and diced, fronds reserved", "4 garlic cloves, minced", "1 pound dried cannellini beans, covered in salted water and soaked overnight", "2 quarts cold water", "1 (4-inch) square dried kombu", "3 thyme sprigs", "2 cups ready-cut (or slaw-cut) kelp seaweed (about 6 ounces)", "Grated Parmesan, as needed", "Freshly ground black pepper", "Toasted country bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot or Dutch oven, heat 1/4 cup oil over medium until hot but not smoking. Add the onion and 1 teaspoon salt and sauté until softened and lightly golden at the edges, 7 minutes. Add the carrots, celery, diced fennel and garlic and sauté until the garlic is fragrant, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain soaked beans and add to pot along with 2 quarts cold water, kombu, thyme sprigs and remaining 2 teaspoons salt. Bring to a simmer over high heat. Lower heat, partially cover the pot and simmer gently until the beans are done, 1 to 2 hours. If the beans start to dry out before they are cooked, add a little hot water to the pot, or if they seem too soupy, remove the lid during the last half-hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When beans are cooked, discard kombu and thyme sprigs. If you have an immersion blender, stick it in the pot and give it two or three pulses to create a creamy broth. Most of the beans should still be whole. Or, scoop out 1 cup of beans, purée them in a food processor or blender, and stir them back into the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir kelp into the pot and simmer until tender, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have fennel fronds, chop enough to make 2 tablespoons and stir into the pot. To serve, ladle soup into bowls and top generously with Parmesan, pepper and a drizzle of olive oil. Serve with toast."}]}