{"@context": "http://schema.org", "@type": "Recipe", "name": "Dry-Brined Turkey With Sheet-Pan Gravy", "description": "For those who want to let the side dishes do the talking, this is the bird for you. Delightfully simple, it’s dry-brined (meaning highly seasoned) with only salt, pepper, some thyme and a little brown sugar, which helps with that golden-brown skin. It’s roasted on a sheet pan, and cut-up onions, garlic, lemon and herbs are scattered in and around the turkey to cook at the same time. They’re excellent served alongside the turkey, and are instrumental in flavoring the sheet-pan gravy.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/11Romanrex5/merlin_161937558_cd8d44c8-5662-4f6e-a33c-8135670a2336-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "dinner, poultry", "keywords": "apple cider vinegar, lemon, onion, soy sauce, turkey, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 555}, "recipeIngredient": ["1 bunch fresh thyme", "1 (12- to 14-pound) turkey", "1/3 cup kosher salt", "1/3 cup light brown sugar", "2 tablespoons coarsely ground black pepper", "4 to 5 medium red onions, quartered ", "3 lemons, halved crosswise ", "2 heads garlic, halved crosswise ", "1/3 cup olive oil ", "6 tablespoons unsalted butter ", "3 cups Cheater’s Turkey Stock (<a href=\"https://cooking.nytimes.com/recipes/1020608-cheaters-turkey-stock\">see recipe</a>), or low-sodium chicken, turkey or vegetable broth, plus more as needed", "6 tablespoons unsalted butter ", "1/2 cup all-purpose flour ", "2 tablespoons low-sodium soy sauce, plus more to taste ", "2 tablespoons apple cider vinegar or white wine vinegar, plus more to taste ", "Kosher salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the turkey: Strip the leaves from 4 sprigs of thyme, and coarsely chop the leaves. Place in a medium bowl along with salt, brown sugar and pepper; mix to blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the turkey on a rimmed baking sheet lined with a wire rack. (If you do not own a wire rack, just place the turkey directly on the baking sheet.) Make sure the giblets (the bagged heart, kidneys and liver, and the neck) are removed from the cavity. Using paper towels, pat the turkey dry on all sides. Sprinkle with the salt mixture, making sure to distribute the seasoning evenly to all the bits and parts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate turkey, uncovered, for 8 to 24 hours — the longer, the better."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove turkey from the fridge, and transfer it to another clean rimmed baking sheet (discard any liquid that has accumulated on the first baking sheet). Stuff turkey with remaining bunch of thyme, a few of the quartered onions and half of the lemons and garlic. Scatter remaining onion quarters, lemons and garlic around the turkey."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine olive oil and 6 tablespoons butter in a small pot over medium heat until butter is melted. Pour half of the mixture over the turkey and onions. Toss the onions lightly to evenly coat; season everything with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast, rotating the baking sheet every hour or so, until the turkey has reached 160 degrees when a thermometer is inserted in the deepest part of the thigh, 2 1/2 to 3 hours. The turkey will be cooked through and tender, and the skin will be brown, but you can and should get it browner."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase temperature to 425 degrees. Pour remaining butter mixture over the turkey (warm it slightly if solidified) and continue to cook until the internal temperature reaches 165 degrees and the skin is very deeply browned all over, 20 to 25 minutes. It's O.K. if the internal temperature is just shy of 165 degrees, it will come to temperature as it rests. (If you find the skin is browning too quickly, especially on the top at the breast, feel free to place a sheet of foil over the breast.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove turkey from the oven and let rest on the baking sheet for 30 minutes (and upward of 45 minutes). Tip the turkey, cavity-side down, making sure the aromatics stay inside the cavity and letting any juices run out onto the rimmed baking sheet. (This is what we will use to make our gravy.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the roasted onions, lemons and garlic to another dish and set aside. Transfer the turkey to a cutting board and let it continue to rest while you make the gravy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the gravy: Pour about 1 cup Cheater’s Turkey Stock or chicken broth onto the baking sheet. Using a spatula (a fish spatula is great for this), scrape up the bits from the turkey drippings, just like you’re deglazing a skillet after searing a piece of meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully pour the contents of the baking sheet into a large measuring cup or other spouted vessel. Add remaining stock until you have 4 cups of liquid; you may need more or less stock depending on how juicy the bird was."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 6 tablespoons butter in a medium pot over medium heat. Add flour and cook, whisking constantly, until flour is sizzling furiously and well toasted, about the color of a graham cracker, 4 to 6 minutes. (The mixture will be thick at first but will thin as the flour cooks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly whisk in fortified stock mixture, about 1/2 cup at a time, letting it bubble, thicken and incorporate completely between additions until all of it has been added."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add soy sauce and vinegar, and season with salt and pepper. Continue simmering until gravy is at your desired viscosity and the flavors have all melded together, 5 to 8 minutes. Add more soy sauce if you feel like it needs more depth of flavor, vinegar if you want more acidity, and salt and pepper for seasoning. Remove from heat and set aside until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, carve the turkey and arrange on a large platter (or two of your largest plates) with the onions, lemons and garlic. Reheat the gravy until it’s very hot and transfer to two gravy boats (glass measuring cups or coffee mugs work well if you do not own a gravy boat) and serve alongside."}]}