{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Fennel With White Bean Purée", "description": "Creamy but not overtly rich, this simple preparation of earthy vegetables is infused with the flavor of salty, homemade <a href=\"https://cooking.nytimes.com/recipes/1020934-parmesan-broth\">Parmesan broth</a> — but it’s adaptable, and could also be made using vegetable or chicken stock. If fennel isn’t your thing, try this with celery stalks or parsnips. If you are preparing the puréed beans ahead of time, keep them moist when you reheat them by adding a small splash of Parmesan broth or stock to the saucepan and stirring until warm. This deeply comforting dish can be prepared days in advance and assembled and served within minutes.", "author": {"@type": "Person", "name": "Julia Sherman"}, "image": "https://static01.nyt.com/images/2020/03/18/dining/16Parm-braised-fennel/merlin_170016825_b1910d64-5947-4943-a491-b53a5bc233f1-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, beans, vegetables", "keywords": "fall, winter, fennel, garlic, parmesan, shallot, white beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "recipeIngredient": ["2 (15-ounce) cans white beans, rinsed", "2 1/2 cups <a href=\"https://cooking.nytimes.com/recipes/1020934-parmesan-broth\">Parmesan broth</a>, or chicken or vegetable stock", "2 garlic cloves, thinly sliced", "1/4 teaspoon kosher salt", "1/4 teaspoon cracked white pepper, plus more to finish", "2 medium or large fennel bulbs, stalks trimmed, tender fronds reserved", "3 tablespoons extra-virgin olive oil", "1 tablespoon unsalted butter", "4 large shallots, peeled, tops and root ends trimmed, then halved lengthwise", "1/2 teaspoon kosher salt", "Generous pinch of dried ground sage", "1/8 teaspoon red-pepper flakes", "1 cup <a href=\"https://cooking.nytimes.com/recipes/1020934-parmesan-broth\">Parmesan broth</a>", "1/2 lemon, juiced (about 1 1/2 tablespoons)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the bean purée: Add the beans, 2 1/2 cups Parmesan broth, garlic, salt and white pepper to a small saucepan and bring to a boil. Reduce to an active simmer and cook 20 minutes, until there is only about 1/4 inch of broth covering the beans. Let cool slightly, then transfer to a blender and purée until smooth, creamy and spoonable. Set aside and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the braised fennel: Slice the fennel in half lengthwise, and cut each half lengthwise into 3 equal wedges. Add 2 tablespoons olive oil and the butter to a large skillet over medium-high heat. When the butter is melted, add the fennel wedges in a single layer, cut-side down. Sear until golden brown, about 5 minutes. Flip and cook on the opposite cut side for 3 to 5 minutes. (If your fennel doesn’t all fit in the pan, cook the remaining pieces with the shallots in the next step. Do not crowd the pan.) Transfer the cooked fennel to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 1 tablespoon olive oil and cook the shallots on their flat side for 2 minutes. Flip and cook for another 2 to 3 minutes until they have a nice sear. Lower the heat if it starts to smoke."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the fennel to the pan, season with kosher salt, sage and red-pepper flakes. Add 1 cup Parmesan broth, cover and reduce the heat to medium. Cook for 10 minutes, stirring once or twice and being sure to scrape the bottom of the pan, until the vegetables are just tender but cooked through. Remove from heat and stir in lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the bean purée among shallow bowls, spreading it in an even layer, and season with another crack of white pepper. Top with braised vegetables and spoon the sauce over top. Garnish with tender fennel fronds and serve."}]}