{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Cooker Corned Beef and Cabbage", "description": "Corned beef — brisket cured in brine — is beloved for its big, salty, aromatic flavor. It needs to be braised or simmered for a long time to become tender and sliceable, making it an ideal slow cooker dish. Get a corned beef made from flat-cut brisket, if you can, as it will be easier to slice into neat, uniform slabs. (The point cut has more striations of fat and may fall apart when sliced.) Corned beef is often braised in beer, and you could certainly do that, but a slightly sweet wine, like a semi-dry Riesling, balances the beef’s saltiness. Finish with a simple honey-mustard glaze and a quick trip under the broiler. Serve this satisfying one-pot meal with mustard and enjoy with beer. (Here are <a href=\"https://cooking.nytimes.com/recipes/1020057-pressure-cooker-corned-beef-and-cabbage\">pressure cooker</a> and <a href=\"https://cooking.nytimes.com/recipes/1020074-corned-beef-with-cabbage-potatoes-and-carrots\">oven</a> versions of the recipe.)", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/03/03/dining/sd-corned-beef/sd-corned-beef-articleLarge.jpg", "totalTime": "PT8H15M", "recipeYield": "4 servings", "recipeCuisine": "american, irish", "recipeCategory": "dinner, lunch, meat, vegetables", "keywords": "cabbage, carrot, corned beef, potato, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 267}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 972, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "56 grams", "fiberContent": "8 grams", "proteinContent": "60 grams", "saturatedFatContent": "18 grams", "sodiumContent": "4684 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 to 3 1/2-pound ready-to-cook corned beef, preferably flat-cut", "1 1/4 cups semi-dry white wine, such as Riesling", "1 pound red or Yukon gold potatoes, cut into 1- to 2-inch pieces", "2 to 3 large carrots (about 1/2 pound), peeled and cut into 1- to 2-inch pieces", "1/2 small head green or savoy cabbage (about 1 pound), core left intact, cut into 4 wedges", "3 tablespoons Dijon mustard, plus more for serving", "2 tablespoons honey", "Flaky sea salt, if necessary", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the corned beef from its packaging in the sink and reserve the spice packet. Rinse the beef well under cold running water and pat it dry with paper towels. (If you don’t rinse off the brine, the meat will be too salty.) If there is a substantial fat cap on top of the beef, place the beef on a cutting board and trim most of it, if you’d like. (The fat will not completely render away during cooking.) Be sure to leave at least a thin layer of fat on top, about 1/8- to 1/4-inch thick, to keep the meat moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the corned beef into a 6- to 8-quart slow cooker with the fat cap facing up. Add the wine and the spices from the packet. Cook on high for 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to low. Baste the beef with the cooking liquid. Drop the potatoes and carrots into the liquid surrounding the beef. Lay the cabbage wedges on top. Cook on low for 4 hours, or until the vegetables and beef are tender. (A paring knife should slip easily into the beef, though the meat shouldn’t be falling apart.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to high. Stir together the mustard and honey in a small bowl. Using tongs, remove the corned beef from the slow cooker and put it on a foil-lined sheet pan. Spread the honey-mustard all over the top and sides of the beef and place it under the broiler. Cook until the glaze bubbles and caramelizes in spots, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the corned beef rest for 5 to 10 minutes then slice it against the grain into 1/2-inch slabs. Place the beef slices on the serving platter alongside the vegetables and drizzle everything with a little bit of the cooking liquid. Taste the vegetables, and season them with flaky sea salt, if necessary. (The beef will not need to be seasoned with salt.) Season the beef and vegetables to taste with black pepper. Serve with Dijon mustard."}]}