{"@context": "http://schema.org", "@type": "Recipe", "name": "Hot Toddy", "description": "Whether you’re sick in bed or fresh off the slopes, a hot toddy warms everything up. The classic formula of whiskey, sugar and hot water is like the steamy cousin of an old-fashioned, but these days, a lot of other ingredients (citrus juice, apple cider, various spices) get added in the name of innovation, with mixed results. This version cozies up to the original, with a few optional additions based on preference. First, warm the mug with hot water, which primes the vessel to hold heat longer, yielding a truly hot toddy to the last sip. Then add scotch or bourbon, or for a modern twist, rum, cognac or amaro. Stir in a little honey, maple syrup or Demerara sugar, add hot water and stir to dissolve. Garnish with lemon peel and spices, if you like.", "author": {"@type": "Person", "name": "Rebekah Peppler"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/rp-hot-toddy/rp-hot-toddy-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "1 drink", "recipeCuisine": "", "recipeCategory": "cocktails", "keywords": "cinnamon stick, honey, lemon peel, star anise, whiskey, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "recipeIngredient": ["Boiling water, as needed", "2 ounces scotch, bourbon, rye, Irish whiskey, dark rum, cognac or amaro", "3/4 ounce light honey, such as acacia, or maple syrup (or 1 teaspoon Demerara sugar)", "1 (3-inch) lemon peel", "Cinnamon stick and whole star anise, to garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a 6-ounce heatproof mug or glass with boiling water and set aside, 1 minute. Pour out the water then add the spirit and honey to the warmed glass. Top with boiling water and stir until the honey is dissolved. Garnish with the lemon peel and cinnamon stick or star anise, if desired. Let cool slightly before enjoying."}]}