{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Goddess Salmon With Potatoes and Snap Peas", "description": "A sheet pan and a broiler are the secret to many easy weeknight meals. In this particularly vibrant dish, they impart a complex grill-like flavor to salmon and potatoes, which are broiled simultaneously on the same sheet pan. While they cook, you’ll blend together a lively green goddess dressing of fresh herbs, yogurt, mayonnaise, garlic and anchovies. When the oven timer chimes, toss the roasted potatoes with raw cucumbers and snap peas. Serve alongside the just-flaky salmon and dollop with the verdant dressing. The crunchy vegetables, warm potatoes, tender fish and creamy dressing make for an unexpected though delightful combination. (For the dressing, tarragon, dill, parsley or cilantro will provide a familiar flavor to this classic sauce, but mint or arugula will work, too.)", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/05/14/dining/sc-green-goddess-salmon/merlin_154348170_27889e9f-9ca7-4615-adea-770d38d64e99-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, seafood, vegetables", "keywords": "herbs, mayonnaise, new potato, potato, salmon, snap peas, yogurt, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 365}, "recipeIngredient": ["1 1/2 pounds small new or baby potatoes, halved or quartered if large", "4 tablespoons olive oil", "Fine sea salt and black pepper", "1 (1 1/2-pound) piece skin-on center-cut salmon", "1 packed cup parsley leaves", "1 packed cup mixed herbs, such as chives, mint, dill, basil or cilantro, plus a few sprigs of dill, for garnish", "2 anchovy fillets", "1 to 2 garlic cloves", "1 lemon, zested and halved", "1/2 cup whole-milk yogurt", "1/2 cup mayonnaise", "8 ounces snap peas, trimmed and halved on the bias (about 2 cups)", "4 small cucumbers, halved lengthwise and cut on the bias into 1-inch pieces (about 1 ¼ pounds)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler to high with the rack about 6 inches from the broiler. On a sheet pan lined with a silicone mat or aluminum foil, toss the potatoes with 2 tablespoons oil, season with salt and pepper and spread out in an even layer. Broil until crispy and brown and just getting tender, about 10 minutes, turning with a spatula halfway through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, rub the remaining 2 tablespoons oil on both sides of the fish and season generously with salt and pepper. Remove the sheet pan from the oven, move the potatoes to the edges and nestle the fish between them, skin-side up. Broil until the skin is crispy, about 5 minutes. With a large spatula, flip the fish and continue to broil until the fish flakes easily but the center is still pink and glossy, 3 to 5 minutes. (If the potatoes are done after cooking the fish on the first side, pull them from the oven and transfer to a large serving bowl. If not, leave them until the fish is cooked to your desired doneness.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish cooks, combine the parsley, mixed herbs, anchovy, garlic, lemon zest, yogurt and mayonnaise in a blender and purée until thick and uniformly green. Taste and season with salt and pepper as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fish and potatoes from the oven. Scrape the potatoes into a large bowl and toss with the snap peas and cucumbers; squeeze half the lemon over the top, season with salt and pepper and toss again. Cut the remaining lemon half into 4 wedges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the fish and vegetables to a platter and serve the dressing on the side; or divide the fish and vegetables among four plates and dollop with dressing. Sprinkle with dill and serve with lemon wedges."}]}