{"@context": "http://schema.org", "@type": "Recipe", "name": "White Bean Piccata Pasta With Broccoli", "description": "The bright lemon-caper sauce for which <a href=\"https://cooking.nytimes.com/recipes/1019883-chicken-piccata?action=click&module=Global%20Search%20Recipe%20Card&pgType=search&rank=1\">chicken piccata</a> is known plays equally well with other proteins, like </span><span><a href=\"https://cooking.nytimes.com/recipes/1018596-swordfish-piccata\">swordfish</a>, or creamy white beans, and forms a glossy, tangy sauce well suited to pasta. Throw broccoli — or any another quick-cooking vegetable, like asparagus, broccoli rabe or peas — into the pasta’s boiling water in the last few minutes, and you’ve effortlessly managed to squeeze a green into this vegetarian dinner.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/10/16/dining/as-white-bean-piccata-pasta/merlin_161590794_3527afac-a7b0-466d-96b5-2df38244e631-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, pastas", "keywords": "broccoli, capers, pasta, shallot, white beans, white wine, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 420}, "recipeIngredient": ["Kosher salt", "1 pound mezze rigatoni or casarecce", "2 cups small broccoli florets (from 1 head broccoli)", "6 tablespoons unsalted butter", "1 shallot, finely chopped", "1/2 cup dry white wine", "1 (15-ounce) can white beans, such as cannellini or great Northern, drained and rinsed", "1/4 cup drained capers", "3 tablespoons lemon juice, plus lemon wedges for serving", "Black pepper", "1/4 cup finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Add the pasta and cook according to package instructions until al dente. Three minutes before the pasta is done, add the broccoli (the broccoli should be crisp-tender when the pasta is al dente). Reserve 1/2 cup pasta cooking water, then drain the pasta and broccoli."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta cooks, make the sauce: In a large (12-inch) skillet, melt the butter over medium-high heat. Add the shallot and a pinch of salt and stir until softened, 1 to 2 minutes. Add the white wine and cook until reduced by half, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/4 cup of the pasta water, the beans, capers and a pinch of salt, and simmer until saucy and slightly thickened, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium, add the lemon juice, cooked pasta and broccoli, and stir until the pasta is coated in the sauce, adding pasta water as needed to coat. Season to taste with salt and pepper. Transfer to bowls, top with parsley and serve with lemon wedges."}]}