{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Cream Cheese Cookies", "description": "Chewy and sweet, these simple cookies are heavenly with a cup of tea — and a lavish dose of fresh lemon zest provides some pluck. Cream cheese is the star ingredient in both the cookie and its glaze, and performs two tasks: It imparts tanginess and contributes to the soft texture. These cookies are simple but delicate, so you’ll want to pull them from the oven as soon as they begin to turn golden, then let them cool directly on the baking sheets until they firm up. The glaze is optional, but it’s easy to whip together while the cookies cool.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/03/19/dining/ss-lemon-cookies/ss-lemon-cookies-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "1 1/2 dozen cookies", "recipeCuisine": "american", "recipeCategory": "easy, quick, snack, cookies and bars", "keywords": "confectioners' sugar, cream cheese, lemon, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 311}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 148, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "4 grams", "sodiumContent": "96 milligrams", "sugarContent": "13 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups/190 grams all-purpose flour", "1/2 teaspoon baking soda", "1/2 teaspoon kosher salt", "6 tablespoons/85 grams unsalted butter (3/4 stick), at room temperature", "4 ounces/105 grams cream cheese, at room temperature", "1 cup/200 grams granulated sugar", "1 lemon, zested and juiced (about 4 teaspoons zest and 2 tablespoons juice)", "1 large egg", "3 tablespoons confectioners’ sugar", "1 1/2 tablespoons milk, plus more, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. In a medium bowl, whisk together the flour, baking soda and salt. In a large bowl with an electric mixer on medium, beat together the butter and half the cream cheese until combined, about 2 minutes. Beat in the granulated sugar and 4 teaspoons lemon zest until creamy, 1 to 2 minutes more. Beat in the egg until combined. Add flour mixture and beat until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line two rimmed baking sheets with parchment paper. Portion the dough into 2-tablespoon scoops and arrange them on the sheets at least 1 1/2 inches apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, rotating halfway through baking, until the cookies are puffed and set and just beginning to turn golden, 10 to 12 minutes. Transfer baking sheets to wire racks until cookies are completely cooled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the glaze: Whisk together the remaining cream cheese with the confectioners’ sugar, milk and 1 1/2 tablespoons lemon juice until smooth. Add additional lemon juice or milk until mixture forms the proper consistency for a glaze. Drizzle over cooled cookies. Let cookies stand at room temperature until the glaze has set. Store in an airtight container at room temperature for up to one week or in the freezer for a month."}]}