{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Cheesecake Bars", "description": "Great for picnics or potlucks, these portable cheesecake bars incorporate cooked berries directly into the custard, which means they take on a rosy hue. You can even add a few drops of red food coloring if you want to make up for out-of-season berries, which are less vibrantly colored, or if you just want a livelier result. Feel free to use frozen berries in place of fresh, though you’ll need to thaw them fully before beginning the process.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/04/15/dining/em-strawberry-cheesecake-bars/em-strawberry-cheesecake-bars-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "One 9-by-13-inch pan (about 15 bars)", "recipeCuisine": "american", "recipeCategory": "cakes, custards and puddings", "keywords": "cream cheese, eggs, heavy cream, shortbread, strawberries, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 218}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 513, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "18 grams", "sodiumContent": "347 milligrams", "sugarContent": "33 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Nonstick cooking spray", "10 1/2 ounces/300 grams shortbread cookies", "1/2 teaspoon fine sea salt", "4 tablespoons/55 grams unsalted butter (1/2 stick), melted", "1 1/2 pounds strawberries, hulled and halved (about 4 cups)", "1 1/2 cups/300 grams granulated sugar", "3 (8-ounce) packages/680 grams cream cheese, at room temperature", "5 large eggs, at room temperature", "1 tablespoon vanilla extract", "Red food coloring, as needed", "1 1/4 cups/300 milliliters heavy cream", "1/2 cup/60 grams confectioners’ sugar", "3/4 pound strawberries, hulled and thinly sliced (about 2 cups)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees and grease a 9-by-13-inch pan with nonstick cooking spray."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust: In a food processor, pulse the cookies until they form fine crumbs (you should have about 2 1/2 cups). Add the salt and pulse briefly to combine, then add the melted butter and pulse until uniformly incorporated. Press the crust into an even layer on the bottom of the prepared pan and wipe out the bowl of the food processor. Transfer the pan to the oven and bake until the crust has browned slightly and appears set, 10 to 12 minutes. Cool completely. Reduce oven temperature to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: In a medium pot, toss the strawberries with 1/4 cup/50 grams granulated sugar. Cook over medium heat, stirring occasionally, until the strawberries begin to soften and the mixture becomes juicy, 4 to 8 minutes, depending on the firmness of the berries. Cool for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the strawberries and their juices to the food processor and purée until smooth, about 1 minute. Transfer the berry purée to a large bowl and set aside. Add the remaining 1 1/4 cups/250 grams granulated sugar and the cream cheese to the food processor bowl and blend until smooth. Add the eggs one at a time and pulse until incorporated, scraping down the sides of the food processor bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vanilla and pulse to combine. Scrape the custard into the berry purée and stir to combine. The batter should be a pale pink. If it’s not, add 3 to 5 drops red food coloring and mix to combine. Pour the cheesecake custard into the cooled crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cheesecake until the edges appear set and the center still appears slightly jiggly, 45 to 50 minutes. Cool at room temperature for 45 minutes, then refrigerate until firm (at least 4 hours, and up to overnight)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the topping: In an electric mixer fitted with the whisk attachment, whip the cream and confectioners’ sugar to medium peaks, 3 to 4 minutes. Spread the whipped cream on the chilled cheesecake in an even layer. Arrange the sliced strawberries on top. (Arranging them in stripes makes it a bit easier to cut rows out of the bars later.) Use a sharp knife to release the edges of the cheesecake from the pan. Slice into 15 even pieces, wiping the knife clean between cuts for the clean, sharp edges."}]}