{"@context": "http://schema.org", "@type": "Recipe", "name": "Rocky Mountain Rainbow Trout With Trout Roe", "description": "Whole trout makes for a stunning presentation, especially when it is topped with delicate pink roe, which sparkles like gems on top of the fish and imparts a salty, mineral flavor. Trout from the icy Rocky Mountain streams are at their best in late spring, when the ice has just melted. Cooks from the Shoshone tribe, among many others, make delicious meals using the entire fish, wasting nothing: Cheeks and eyes are considered a delicacy, as is the roe harvested from the females, which is prized for its distinct flavor and its relationship to renewal.", "author": {"@type": "Person", "name": "Sean Sherman"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex5/merlin_163486770_ccb18e9b-8011-4c8f-bb9d-30f1576016d5-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weeknight, seafood", "keywords": "main course, rainbow trout, sumac, trout roe, walnut, watercress", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "recipeIngredient": ["4 whole, head-on rainbow trout (about 3/4 pound each), rinsed and patted dry", "1 tablespoon sumac powder", "2 teaspoons coarse sea salt", "3 tablespoons sunflower oil, plus more for drizzling (optional)", "1/4 cup walnuts, toasted and chopped", "1 small bunch watercress (or other dark greens, such as arugula or spinach), for garnish", "1/4 cup trout roe, salmon roe or paddlefish roe, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Open the trout fillets and fan out like a book, lifting open both fillets to create an even, somewhat flat surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix together the sumac and salt. Season the trout on both sides with the sumac-salt blend."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon oil in a large cast-iron skillet over medium-high. Working in batches, add one trout at a time, flesh-side down, and cook undisturbed for 1 to 2 minutes. Flip the fish and cook until firm throughout, 1 to 2 more minutes. Transfer the trout to a warm plate, skin-side down, and tent with foil until all the fish is cooked. Repeat with the remaining oil and fish. (You only need 3 tablespoons oil: 1 tablespoon for each batch except the last, which won’t need it.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly drizzle the cooked trout with more oil, if desired. Garnish with walnuts and watercress; spoon the trout roe on top. Serve immediately."}]}