{"@context": "http://schema.org", "@type": "Recipe", "name": "Vietnamese Iced Coffee", "description": "This popular coffee drink requires only three ingredients: coffee, water and condensed milk. Traditionally, a Vietnamese press is used to make the coffee, but this recipe calls for a simple pour-over cone. (If you don't have a coffee cone, you can substitute brewed espresso for the coffee.) Vietnamese iced coffee is normally made one serving at a time, but for ease, this recipe makes a batch that will serve about four. Be sure to use a boldly flavored dark roast coffee, since the condensed milk and ice will dilute the drink.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/06/03/dining/kc-vietnamese-iced-coffee/kc-vietnamese-iced-coffee-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 servings (about 2 1/2 cups)", "recipeCuisine": "vietnamese", "recipeCategory": "easy, quick, non-alcoholic drinks", "keywords": "dark roast coffee, sweetened condensed milk", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 125}, "recipeIngredient": ["1 cup finely ground dark roast coffee, such as French roast", "3 cups boiling water", "1/2 cup sweetened condensed milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place coffee grounds in a heatproof container. Slowly pour boiling water over the grounds in a circular motion to evenly saturate. Do not stir; let steep 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a coffee cone with a paper filter and place the cone over another heatproof container."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly pour the steeped coffee through the filter, allowing all the liquid to drip through completely. (You should have about 2 cups of strong coffee. See Tip.) Discard the filter and coffee grounds. Stir the condensed milk into the coffee until well blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill 4 glasses with ice cubes. Divide the coffee mixture among the glasses and serve immediately, or transfer to the refrigerator, where it will keep, covered, up to 3 days. Serve over ice."}]}