{"@context": "http://schema.org", "@type": "Recipe", "name": "Kentucky Butter Cake", "description": "If you think you don’t need another Bundt cake recipe, this one exists to prove you wrong. Adapted from Nell Lewis of Platte City, Mo., who entered the Pillsbury Bake-Off contest in 1963, it is a favorite of food bloggers and Pinterest lovers alike. On the surface, it’s not that different from your typical pound cake, but what makes it special is a vanilla-scented, buttery sugar glaze that’s poured over the still-warm cake. Left to sit for several hours before unmolding, the glaze soaks into the cake, making it incredibly tender and rich while leaving behind a delightful sugary crust. There are a lot of variations out there — some with bourbon in place of the vanilla, others with sherry — so feel free to play around.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/08/27/dining/ml-butter-cake/ml-butter-cake-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "10 to 12 servings", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "butter, buttermilk, flour, sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 656}, "recipeIngredient": ["1 cup/225 grams unsalted butter (2 sticks), softened, plus more for greasing the pan", "3 cups/385 grams all-purpose unbleached flour, plus more for dusting the pan", "Nonstick cooking spray (optional)", "2 cups/400 grams granulated sugar", "1 cup/240 milliliters buttermilk (see Tip)", "4 eggs", "2 teaspoons vanilla extract", "1 teaspoon baking powder", "1 teaspoon fine sea salt", "1/2 teaspoon baking soda", "3/4 cup/150 grams granulated sugar", "1/3 cup/75 grams unsalted butter", "2 teaspoons vanilla extract", "Confectioners’ sugar, for sprinkling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Generously butter and flour (or spray with nonstick cooking spray) a 10-inch tube pan or a 12-cup bundt pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with a paddle attachment, or using a handheld mixer, combine the remaining cake ingredients and beat for 3 minutes at medium speed. Pour into prepared pan, level with a spatula and bake until a toothpick inserted in the center comes out clean, 60 to 70 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before the cake is done baking, make the butter sauce: Combine the granulated sugar, butter and vanilla with 3 tablespoons water in a saucepan over low heat until the butter just melts. (Do not let the mixture boil, as you do not want the sugar to completely dissolve.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the cake comes out of the oven, leave the cake in its pan and gently poke it all the way through 15 to 20 times with a long wooden skewer or a long-tined fork. Slowly pour warm butter sauce over the cake. Let cool for at least 3 hours before unmolding from pan. Just before serving, sprinkle with confectioners’ sugar, if desired."}]}