{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony White Beans With Anchovy and Parmesan", "description": "These white beans, adapted from Alison Roman's cookbook \"Nothing Fancy\" (Clarkson Potter, 2019), could potentially be a whole meal, but they are also great alongside another protein since they pull double duty as both starch and salad. While this dish is beautifully seasonally agnostic, it is a summery dream with grilled whole trout or lamb shoulder, and lots of cold red or white wine, preferably in the sunny outdoors.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/07Romanrex2/07Romanrex2-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick, weekday, beans", "keywords": "anchovy, escarole, lemon, white beans, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 292}, "recipeIngredient": ["1/4 cup olive oil", "4 garlic cloves, thinly sliced", "4 anchovy fillets", "2 tablespoons salted capers, rinsed, or 1 tablespoon brined capers", "1 teaspoon red-pepper flakes", "2 (15-ounce) cans white beans, such as cannellini, Great Northern or navy, drained and rinsed", "Kosher salt and freshly ground black pepper", "1 head of escarole or chard, trimmed and torn into large pieces", "1/2 cup fresh mint leaves", "1/2 cup fresh parsley leaves, leaves and tender stems", "A hunk of Parmesan or pecorino cheese, for serving", "1 lemon, halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large skillet over medium heat and add the garlic. Cook, swirling the skillet occasionally until the garlic is pale golden brown, 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the anchovies, capers and red-pepper flakes, swirling until the anchovies melt and sizzle, the capers pop slightly, and the red-pepper flakes toast and bleed into the oil, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans and season with salt and pepper. Reduce the heat to medium-low and toss to coat the beans in all the garlicky business. Let them cook until the flavors have melded and beans no longer taste like they came from a can, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add half the escarole and toss to coat, letting it wilt ever so slightly. Transfer the beans and wilted escarole to a large serving platter or bowl, and mix in the remaining escarole. Scatter with the mint and parsley. Use a peeler or box grater to shave some Parmesan over all. Squeeze the lemon over everything just before serving."}]}