{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Lamb With Scallion Pancakes", "description": "Here is a recipe for grilled lamb inspired by Northern China. It’s treated to a five-spice and soy sauce rub, and served, in a nod to Peking duck, with cucumbers, hoisin sauce and pancakes. The pancakes are not the typically thin crepes served for wrapping slices of Peking duck. Instead they are classic scallion pancakes, a dim sum item usually eaten alone. Here they’re spread with hoisin sauce and topped with slices of lamb and cucumber. Alternatively, you could serve the pancakes like tortillas, to wrap around the lamb, taco-style. Either way, it’s party food.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2019/08/28/dining/22pairrex/merlin_159456246_3ff0716e-adba-489f-aa15-a85d786eed4b-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "recipeIngredient": ["1/2 leg of lamb, rump end, boned and butterflied (about 3 1/2 pounds)", "2 tablespoons soy sauce", "1 tablespoon five-spice powder", "2 1/2 cups all-purpose flour, plus more for rolling", "1 teaspoon salt", "1 tablespoon toasted sesame oil", "2 cups chopped scallions", "Vegetable oil, preferably grapeseed, for frying", "2 cucumbers, peeled, seeded and julienned", "1/2 cup hoisin sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate the meat: Brush the lamb with soy sauce and coat with five-spice powder. Set aside for 1 hour at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pancakes: Whirl the flour and salt in a food processor. Boil 1 cup water. With the machine running, slowly pour the water in through the feed tube. Process briefly to form a smooth dough. Remove from the processor to a lightly floured work surface. Knead briefly. Cover with plastic wrap and let rest for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide dough in 8 pieces. On a lightly floured surface, roll each piece into a thin 10-inch round. Brush each round with sesame oil and scatter with scallions. Roll up each round into a tight cylinder, then coil each cylinder around like a bun. Slightly flatten each bun, then roll each into a round pancake about 6 inches in diameter. Set aside, covered with a towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a grill or broiler for medium heat. Grill or broil the lamb, turning once, until desired degree of doneness, about 12 minutes per side for medium-rare. It’s an uneven cut, so you might remove some parts as they are done. Let rest 20 minutes before slicing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, heat 2 teaspoons vegetable oil in a small skillet on medium. Fry the pancakes one at a time, turning, until lightly browned a minute or so per side, adding more oil as needed. Stack cooked pancakes and wrap them in foil. If using a grill, place the pancakes to one side, away from direct heat to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice the lamb and arrange it on a platter. If serving the dish like tacos, cut the slices in 2-inch pieces. Stack the pancakes to one side of the platter. Pile cucumber slivers in a mound on the platter, and serve with hoisin sauce."}]}