{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Banana Pudding", "description": "This crowd-pleasing Southern dessert created by layering vanilla pudding, vanilla wafers and bananas is adapted from </span><span>Millie Peartree, the owner of </span><a href=\"https://www.nytimes.com/2019/02/28/dining/millie-peartree-fish-fry-soul-food-review.html\"><span>Millie Peartree Fish Fry & Soul Food</span></a><span> restaurant in the Bronx. Her version takes it over the top by caramelizing the bananas with a little melted butter, brown sugar, cinnamon and vanilla before layering. This extra step adds complex flavor to the unapologetically sweet dessert. Serve piles of it in bowls with extra wafers crumbled over the top, a sprinkle of cinnamon and unsweetened whipped cream, if desired.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2020/02/25/dining/ml-banana-pudding/ml-banana-pudding-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "One 9-by-13 dish (12 to 15 servings)", "recipeCuisine": "american", "recipeCategory": "custards and puddings", "keywords": "banana, brown sugar, cinnamon, egg yolks, sugar, dessert, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 229}, "recipeIngredient": ["2 cups granulated sugar", "3 tablespoons cornstarch", "1/2 teaspoon fine sea salt", "1 quart (4 cups) half-and-half", "6 large egg yolks", "4 tablespoons unsalted butter, at room temperature", "2 teaspoons vanilla extract", "8 bananas, peeled and cut into 1/2-inch slices", "2 tablespoons light brown sugar", "1/2 teaspoon ground cinnamon, plus more for serving", "1 (11-ounce) box vanilla wafers, plus more for serving", "Unsweetened whipped cream, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, whisk together the sugar, cornstarch and salt. Add the half-and-half and egg yolks, and whisk to combine. Cook over medium heat, whisking constantly, until thickened and pudding-like, 10 to 12 minutes. Remove from heat and stir in 2 tablespoons butter and 1 teaspoon vanilla extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan or skillet over medium heat, melt the remaining 2 tablespoons butter. Add bananas, brown sugar, cinnamon and remaining 1 teaspoon vanilla. Cook, stirring frequently, until well combined, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer half the vanilla wafers in a 9-by-13 baking or trifle dish. Top with half the caramelized bananas then half the pudding. Repeat procedure with remaining wafers, bananas and pudding. Chill for 4 to 6 hours, or up to overnight. Garnish with crumbled vanilla wafers and sprinkle with additional cinnamon before serving. Serve with unsweetened whipped cream, if using."}]}