{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Grapefruit With Brown Sugar and Flaky Salt", "description": "A classic at a fancy breakfast or brunch, the best broiled grapefruits have a glossy caramelized topping covering sections of the warm, juicy citrus. This recipe also includes a little cinnamon for a heady fragrance, and a touch of sea salt, which softens the bitterness of the grapefruit peel. It’s best served warm from the oven, when the brown sugar is still melted and syrupy. Ruby or pink grapefruits make for the prettiest presentation, but white ones work just as well, and have a livelier, more acidic flavor.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/25/dining/20apperex4/merlin_166104819_c747c82e-1716-4cc0-82a9-2674de4d391e-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch", "keywords": "grapefruit, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 78}, "recipeIngredient": ["2 grapefruits, preferably pink or ruby", "4 tablespoons light brown sugar", "2 tablespoons unsalted butter, melted", "Honey, for drizzling", "Ground cinnamon (optional)", "Flaky sea salt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Move the rack 4 inches away from the broiler, and turn it on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the grapefruits through their equators. Using a paring knife or a grapefruit knife, cut the sections away from the membranes and pith so they are easy to spoon up. Place grapefruit halves, cut-side up, on a baking sheet. Sprinkle each grapefruit half with 1 tablespoon brown sugar, then drizzle with melted butter and a little honey. Sprinkle cinnamon over the tops if you like."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil grapefruit until the sugar melts and caramelizes, 2 to 5 minutes. (Broilers vary a lot so watch carefully to make sure they don’t burn.) Sprinkle with flaky sea salt, and serve immediately."}]}