{"@context": "http://schema.org", "@type": "Recipe", "name": "Ube Pie", "description": "Ube, a purple yam native to the Asian tropics, is a common ingredient in Filipino desserts. It’s no surprise that colorful dishes made with ube have done well on Instagram, prompting the invention of drinks, custards, cakes and sweet breads in cities across the United States. This recipe is adapted from Café 86 in Artesia, Calif., where co-owner Ginger Dimapasok serves an ube chess pie that’s particularly popular around Thanksgiving. The earthy, vanilla flavor of the yam adds color and depth to the sweet, buttery filling. You can find frozen mashed ube — and ube flavoring, which ensures a deep purple hue — at Filipino markets. Okinawa sweet potatoes, or Japanese purple sweet potatoes, can also be substituted.", "author": {"@type": "Person", "name": "Daniela Galarza"}, "image": "https://static01.nyt.com/images/2019/11/12/dining/dg-ube-pie/merlin_163633197_41d364fa-ba2f-4e20-be5e-0c3536eb7467-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 9-inch pie (about 10 servings)", "recipeCuisine": "", "recipeCategory": "snack, pies and tarts", "keywords": "butter, graham cracker, ube, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 131}, "recipeIngredient": ["5 ounces/140 grams graham crackers (1 sleeve), pulsed into fine crumbs in a food processor (about 1 cup)", "3 tablespoons/35 grams granulated sugar", "1/2 teaspoon kosher salt", "1/4 cup/55 grams unsalted butter (1/2 stick), melted", "1 (1-pound/455-gram) package frozen grated ube (see Tip), defrosted", "1/2 cup/100 grams granulated sugar", "1/2 packed cup/110 grams light brown sugar", "2 large eggs", "5 tablespoons/70 grams unsalted butter, melted", "1/3 cup/80 milliliters heavy cream", "1/2 teaspoon ube flavoring (optional)", "1/2 teaspoon kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Prepare the crust: In a medium bowl, mix together graham cracker crumbs, sugar and salt. Stir in the melted butter (mixture will look like wet sand). Press into the bottom and up the sides of a standard (not deep-dish) 9-inch pie pan; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the filling: Remove grated ube from package and place in a microwave-safe bowl. Add 2 tablespoons water. Microwave until cooked, 3 to 4 minutes. (The mixture should feel smooth between your fingers, like thick mashed potato.) Measure out 1 1/4 cups/300 grams cooked ube, and reserve the remainder for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the 1 1/4 cups cooked ube to a food processor. Add the granulated sugar and light brown sugar and process on low until smooth. Scrape down the sides of the bowl. Add the eggs, melted butter, heavy cream, ube flavoring, if using, and salt, and process just until combined and no streaks remain. Pour filling into prepared crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake pie on center rack until slightly puffed around the edges and just set in the center, 30 to 35 minutes. Cool completely before serving at room temperature or chilled. Covered and refrigerated, the pie will keep up to 2 days."}]}