{"@context": "http://schema.org", "@type": "Recipe", "name": "Matzo Ball Soup With Celery and Dill", "description": "Greater than the sum of its parts, matzo ball soup is a wonderful combination of three very simple things: chicken broth (golden brown, deeply savory, lightly seasoned), matzo balls (tender, eggy, schmaltzy dumplings made with ground matzo) and garnish (celery and fresh dill, lots of it). The key to keeping the chicken juicy, tender and something you’re excited to eat is by gently simmering the stock (which will also keep the broth crystal clear rather than muddied). You can pick the meat from the chicken and add it back to the soup if you like, or save for next-day chicken salad. For the matzo balls, matzo meal is preferred for its fine texture, but know that you can also grind your own from matzo boards in a food processor.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2020/04/01/dining/30Romanrex1-matzo/30Romanrex1-matzo-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "jewish", "recipeCategory": "soups and stews", "keywords": "carrot, celery, chicken, dill, matzo meal, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 176}, "recipeIngredient": ["1 (4- to 4 1/2-pound) chicken, cut into 8 pieces, or 4 to 4 1/2 pounds bone-in, skin-on chicken parts", "2 large yellow onions, unpeeled, quartered", "2 garlic heads, unpeeled, halved crosswise", "4 celery stalks, chopped", "2 large carrots, chopped", "Kosher salt", "1 cup matzo meal (not matzo ball mix), or 1 cup finely ground matzo boards", "1/4 cup finely chopped chives", "1 3/4 teaspoons kosher salt, plus more to taste", "5 large eggs", "1/3 cup chicken fat, grapeseed oil or unsalted butter, melted", "1/4 cup club soda or seltzer", "3 to 4 celery stalks, thinly sliced on a bias, plus any leaves", "1/2 cup chopped dill leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the broth: Combine chicken, onions, garlic, celery and carrots in a large pot. Cover with 12 cups water and season with salt. (If your pot can’t handle all that water, fill the pot with as much as you can, and add remaining water as it reduces.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a strong simmer over high heat, then reduce heat to medium-low so that the broth is gently simmering."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue to gently simmer, uncovered, until the broth is extremely flavorful and well seasoned, 1 1/2 to 2 hours. Using tongs, remove breasts, thighs and legs from the pot (let any skin and bones fall into the pot), leaving everything else behind."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick the meat from the chicken, discarding any fat, skin, bones, cartilage or any drier pieces of meat that you wouldn’t find delicious to eat. Set meat aside to either put back into your soup, or to use in another dish (chicken salad, etc)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain broth (you should have about 10 cups) and return to the pot. Season with salt and pepper (it should be as seasoned and delicious as you’d want it to be when serving). Keep warm, if using same day, or let cool and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As broth sits, prepare the matzo balls: Combine matzo meal, chives and 1 3/4 teaspoons kosher salt in a medium bowl. Using a fork, incorporate eggs until well blended. Add chicken fat, followed by club soda, mixing until no lumps remain. Cover with plastic wrap and refrigerate until mixture is firm and fully hydrated, at least 2 hours (and up to 24 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Using your hands, roll matzo ball mixture into balls slightly smaller than the size of a ping pong ball (about 1 1/4-inch in diameter), placing them on a plate or parchment lined baking sheet until all the mixture is rolled (you should have about 24 matzo balls)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add matzo balls to the boiling water and cook until floating, puffed and cooked through, 10 to 12 minutes. (You can always sacrifice one, plucking it from the broth and cutting it in half to check that it’s cooked through. The texture should be uniform in color and texture, and the balls shouldn’t be dense or undercooked in the center.) Using a slotted spoon, transfer the matzo balls to the chicken broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add celery (and some of the picked chicken meat, if you desire) and season again with salt before ladling into bowls, topping with dill, celery leaves and a crack of freshly ground pepper."}]}