{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Steak and Watercress on a Roll", "description": "Serve these little steak sandwiches with drinks. Horseradish, thinly sliced jalapeño and peppery watercress all supply a pleasant kick, tempered by sweet butter and sour cream.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/02Tanisrex-steak/merlin_164993337_d40e5fab-9c74-412d-8754-48db2443ad0e-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "6 small sandwiches", "recipeCuisine": "american", "recipeCategory": "finger foods, sandwiches", "keywords": "appetizer, horseradish root, new york strip steak, rolls, sour cream, watercress, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 12}, "recipeIngredient": ["1 pound New York strip or other steak", "Salt and pepper", "2 tablespoons freshly grated horseradish, from a 2-inch chunk of horseradish root", "1/2 teaspoon sugar, optional", "1/2 cup/4 ounces sour cream or crème fraîche", "6 mini whole wheat rolls or brioche rolls", "Unsalted butter, at room temperature", "A few thinly sliced cornichons (optional)", "2 thinly sliced jalapeños", "1 large handful watercress sprigs or a combination of watercress, basil leaves and radicchio"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season beef generously with salt and pepper. Cook to medium rare in a pan, under a broiler or on a grill, about 4 minutes per side depending on thickness. Set aside to cool for at least 10 minutes. Slice thinly on a bias and set aside. Blot extraneous juice with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make horseradish sauce: Put grated horseradish in a small bowl. Season with a good pinch of salt and pepper and a little sugar. Add sour cream and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Split rolls and lay them cut side up on a work surface. Butter each piece lightly, then spread with 2 teaspoons horseradish sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide sliced meat among the 6 bottom roll pieces, then garnish with cornichons, jalapeño and watercress. Replace top pieces of rolls and serve."}]}