{"@context": "http://schema.org", "@type": "Recipe", "name": "Upside-Down Lemon Sponge Cake With Lemon-Maple Butter", "description": "Warm desserts are the quintessential Christmas treat. This one is made even more special with the charred lemon slices, which give it just the right amount of sharpness to cut through all the sweetness. Be sure to take the butter for the cake out of the refrigerator well in advance, as it needs to be fully softened at room temperature before you make the batter. This cake also reheats quite well; just give it a quick steam to warm through or pop individual portions into the microwave in a sealed, heat-proof bowl.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2019/12/18/dining/13Ottorex1/merlin_165659580_9acb122f-39d8-4b9f-923c-31f3514b12f4-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "snack, cakes, custards and puddings", "keywords": "brown sugar, butter, crème fraîche, lemon, maple syrup, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 286}, "recipeIngredient": ["3 medium lemons", "1/2 cup plus 3 tablespoons/165 milliliters maple syrup", "1 vanilla bean (pod)", "1 3/4 cups/225 grams all-purpose (plain) flour", "2 teaspoons baking powder", "1/4 teaspoon kosher salt", "1 cup/225 grams unsalted butter (2 sticks), cut into small cubes and at room temperature", "3 large eggs plus 1 large egg yolk", "1 packed cup/220 grams soft light brown sugar", "1/4 cup/60 milliliters whole milk", "1 cup/240 grams crème fraîche, for serving", "3 tablespoons/45 milliliters lemon juice (from 1 to 2 lemons)", "1/2 cup/120 milliliters maple syrup", "7 tablespoons/100 grams unsalted butter, cut into small cubes and refrigerated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees Fahrenheit/160 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the 3 lemons, slicing and discarding the tips, then cut each lemon into very thin (1/10-inch/1/4-centimeter-thick) rounds to get 24 slices; discard the seeds (pips). Place a large nonstick skillet over high heat. Working in about three batches, add lemon slices in a single layer and cook until nicely charred on both sides, 1 to 2 minutes per side. Repeat with the remaining slices and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking dish about 8-by-12 inches/20-by-30 centimeters in size with a piece of parchment paper large enough to cover the base and sides, and enough overhang to later fold over the batter. Pour 1/2 cup/120 milliliters maple syrup into the prepared dish. Halve the vanilla bean (pod) lengthwise, scrape the seeds into a small bowl, then add the scraped-out halves to the prepared dish. Top with the charred lemon slices, spreading out so they cover the entire base while overlapping slightly in spots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the flour, baking powder and salt into the bowl of a stand mixer fitted with the whisk attachment, and mix on medium speed to combine. Add the room-temperature butter, eggs and egg yolk, brown sugar, milk, reserved vanilla seeds and the remaining 3 tablespoons maple syrup, and mix on medium-low speed for 2 minutes until combined. The mixture will look like it’s split a little with some smaller cubes of butter, but that’s O.K."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the mixture into a piping bag or resealable plastic bag, snipping the base, and pipe the mixture directly on top of the lemons in the baking dish in an even layer (this ensures the lemons don’t move around too much). Using the back of a spoon, smooth over the mixture to create an even layer. Fold over the excess parchment paper to cover, then wrap the dish tightly in foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the baking dish into a larger roasting pan (tin) that is roughly 10-by-14 inches/24-by-36 centimeters. Carefully add about 1 inch/3 centimeters boiling water to the pan, transfer to the oven and bake until a toothpick inserted into the center comes out clean, about 60 minutes. Lift the baking dish from the water, remove the foil, and unwrap the parchment paper. Set aside for 5 minutes before carefully inverting the whole thing onto a platter, carefully removing the parchment paper to expose the lemons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "During the last 10 minutes of baking, prepare the lemon-maple butter: Add the lemon juice and maple syrup to a small saucepan and bring to a simmer over medium-high heat. Cook for about 2 minutes, then turn the heat down to low. Once the mixture is no longer simmering, gradually whisk in the chilled butter a little at a time until you have an emulsified sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle half the lemon-maple butter all over the warm sponge cake and serve warm, with the remaining lemon-maple butter and crème fraîche alongside."}]}