{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttered Stuffing With Celery and Leeks", "description": "Those of you who love stuffing know that it might be the only reason to host Thanksgiving. This version is an updated classic — no dried fruit, no surprise ingredients, no “twists” — just a very buttery, deeply savory stuffing made with garlic, leeks and a lot of celery. The bread is crusty and torn, never cubed (for those crisp, craggy edges), and the whole thing is baked in a baking dish, never inside the turkey (to keep it light and fluffy with a custardy interior and a golden-brown top). All stuffing needs two trips to the oven: once, covered, to cook it through and twice, uncovered, to crisp up the top. You can do the first bake ahead of time if you like, or do one after the other if the timing works out that way.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/11/13/dining/11Romanrex1/11Romanrex1-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american", "recipeCategory": "dinner, stuffing and dressing", "keywords": "bread, celery, dry white wine, leek, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1234}, "recipeIngredient": ["1 large loaf good, crusty bread, preferably sourdough or ciabatta (about 1¼ pounds)", "1/4 cup olive oil", "8 tablespoons unsalted butter", "6 garlic cloves, thinly sliced", "2 large leeks, white and light green parts, chopped", "Kosher salt and freshly ground black pepper", "6 celery stalks, thinly sliced, leaves reserved for garnish if available", "1/2 cup dry white wine", "1/2 teaspoon red-pepper flakes (optional)", "2 1/2 cups low-sodium chicken, turkey or vegetable broth", "3 large eggs", "1/2 cup finely chopped parsley", "1/4 cup finely chopped chives", "2 tablespoons finely chopped marjoram, oregano or thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using your hands, tear bread, crust and all, into 1 1/2- to 2-inch pieces. (Alternatively, you can cut the bread with a knife, but I prefer the way the craggy bits toast and soak up the goods.) Place chunks on a rimmed baking sheet, and let sit uncovered at room temperature for 12 to 24 hours. If you’re short on time, you can toast the chunks in a 300-degree oven instead, tossing occasionally, until lightly crisped, but not browned, on the outside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. In a large skillet over medium-high heat, combine olive oil and 4 tablespoons butter. Once butter has melted, add the garlic and leeks. Season with salt and pepper and cook, stirring occasionally, until leeks are bright green and totally softened, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add celery, and season with salt and pepper. Cook, stirring occasionally until bright green and tender, 4 to 6 minutes. Add white wine, and cook until reduced by about three-quarters, 3 to 4 minutes. Add red-pepper flakes, if using, and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together broth and eggs in a medium bowl. Place bread in a large bowl (you want a lot of room for mixing, so go big), and add the leek and celery mixture, parsley, chives and marjoram. Stir to coat so that everything is evenly distributed, trying not to totally crush the bread. Pour the egg mixture over everything and toss a few times. Let sit a minute or two and give another toss. Repeat twice until all the liquid has absorbed and evenly distributed to each and every piece of bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer mixture to a 2 1/2- to 3-quart baking dish (a 9-by-13 pan also works), making sure not to pack it too tightly. (You want to keep the bread in the stuffing as light as possible.) Dot the top with the remaining 4 tablespoons butter, making sure to pay extra attention to the corners, where the stuffing will get the crispiest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with foil and bake until the stuffing is sizzling at the edges and completely cooked through, 25 to 30 minutes. If it’s not yet time to serve, remove stuffing from oven and set aside. (If you are nearly ready to serve, proceed directly to the next step and continue without pausing.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, remove foil and increase temperature to 425 degrees. Bake stuffing until crispy, crunchy and impossibly golden brown on top, 20 to 25 minutes. Scatter with celery leaves, if using, and serve."}]}