{"@context": "http://schema.org", "@type": "Recipe", "name": "Khoresh-e Ghormeh Sabzi (Persian Herb, Bean and Lamb Stew)", "description": "There are three essential elements to this khoresh, or stew, which is often called Iran’s national dish. First, the sweet, pungent flavor of dried or fresh fenugreek leaves defines the stew, which simply isn’t the same without it. Likewise, Omani limes (also known as dried Persian limes) add a distinct aged sourness that is vital to the dish. Finally, the classic Persian technique of sautéing a mountain of finely minced herbs lends character and complexity to the foundation of the stew. Don’t be afraid to really cook down the herbs until quite dark and dry; this step is essential to concentrate their flavor.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/05/15/dining/14Iranianrex5/merlin_154113780_11be52fe-dc6f-4a25-8d88-66aaeb09f05b-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "meat, soups and stews", "keywords": "beef, fenugreek, kidney bean, lamb shoulder, rice, saffron, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 162}, "recipeIngredient": ["1 1/2 pounds lamb shoulder or beef chuck, trimmed and cut into 2-inch pieces", "1 heaping teaspoon ground turmeric", "Fine sea salt and freshly ground black pepper", "1/2 cup dried kidney beans", "3 tablespoons plus 1/4 cup extra-virgin olive oil", "1 large yellow onion, thinly sliced", "1 pound Italian parsley (about 3 large bunches)", "1 pound cilantro (about 3 large bunches)", "2 bunches chives", "1 bunch scallions, roots trimmed", "1 tablespoon dried fenugreek leaves", "4 Omani (dried Persian) limes, rinsed and punctured multiple times with a fork", "1/4 teaspoon crumbled saffron threads", "<a href=\"https://cooking.nytimes.com/recipes/1020207\">Polo Ba Tahdig</a> (Persian Rice With Bread Crust), for serving", "<a href=\"https://cooking.nytimes.com/recipes/1020213\">Mast-o Khiar</a> or plain yogurt, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, season the meat with turmeric, 2 teaspoons salt and 1/2 teaspoon pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the beans and place in a medium bowl with 1 cup water and a generous pinch of salt. Set aside to soak for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, place a large Dutch oven or similar pot over medium-high heat. Add 3 tablespoons oil. When it shimmers, add meat and cook, turning regularly so that it browns evenly on all sides, about 15 minutes. Once the meat has browned, move it to the edges of the pot and add the onion to the center of the pot, along with a generous pinch of salt. Cook, stirring regularly, until the onion begins to soften and turn brown, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans and add to the pot, stirring to combine everything and coat the beans with oil. Add 4 cups water, increase heat to high and bring to a boil. Reduce heat to medium-low, cover pot and simmer for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, prepare the herbs: Wash parsley and cilantro, then use a salad spinner to dry very well. Remove and discard the tough stems. Chop the leaves and tender stems very, very finely, or feel free to use a food processor to get these herbs as finely chopped as possible. The more finely chopped the herbs, the more green and unctuous the ghormeh sabzi will be."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separately chop the chives and entire bunch of scallions (including the green tops) as finely as possible by hand. These, too, must be very finely chopped — nearly minced — but they will turn to mush in a food processor and thus should be chopped by hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a large frying pan over medium heat. When the pan is hot, add the remaining 1/4 cup oil and the scallion-chive mixture. Allow to wilt, stirring constantly, for about 2 minutes, then add remaining chopped herbs and fenugreek leaves, crushing the fenugreek leaves between your fingers as you add them. Cook, stirring continuously, until the herbs are wilted and very dark green — but not burned — and they give off a bright green oil when pressed with a spoon, 18 to 20 minutes. This step is crucial to the flavor and color of the stew. You’ll know the herbs are ready when they feel dry and emit a strong, savory aroma."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the meat has cooked for 2 hours, add the cooked herb mixture, Omani limes and 1/2 cup water. Season with salt and bring to a boil. Reduce heat, cover pot, and simmer for another hour. Check on the limes occasionally to make sure they are submerged in the stew but not falling apart. Gently push them into the stew if they’re still floating after 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the stew nears the 3-hour mark, remove the lid and check the meat; it should be very tender. If the ghormeh sabzi seems a little watery, leave it uncovered for the last 20 minutes of cooking and allow to reduce into a thick stew. Taste and adjust the seasoning with salt and pepper. If the stew needs a little acidity, juice a lime into the stew through a sieve by pressing down on it with a spoon (avoid letting the seeds through the sieve, as they can be bitter). Set aside. Taste the stew and continue adding more lime juice until the stew is sufficiently tangy. Stir in the saffron. The stew should be a very deep, dark shade of green and quite thick when done. Return dried limes into the stew to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot with Persian rice and mast-o khiar."}]}