{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingery Fried Rice With Bok Choy, Mushrooms and Basil", "description": "An ideal recipe for reducing waste in the kitchen, fried rice is a great way to use up spare tofu, leftover meats or wobbly vegetables. Master <a href=\"https://cooking.nytimes.com/recipes/1020016-weeknight-fried-rice\">Sam Sifton’s fried rice technique</a>, and you’ll have the tools to repurpose leftovers and surplus vegetables. But if it’s a bright, fresh slew of greens and herbs you’re after, this recipe supplies a high ratio of vegetables to rice. Everything cooks quickly, so your mise en place truly counts here: Get everything chopped and prepped before you pick up the pan, and dinner can be ready in 20.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2020/02/06/dining/aw-bok-choy-fried-rice/aw-bok-choy-fried-rice-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, weekday, grains and rice, vegetables", "keywords": "basil, bok choy, garlic, ginger, jalapeño, mushroom, peas, rice, sesame oil, soy sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 549}, "recipeIngredient": ["4 cups cooked, day-old jasmine rice (or 1 cup uncooked jasmine rice; see Tip)", "5 tablespoons canola or vegetable oil", "3/4 pound mixed fresh mushrooms, such as shiitake and cremini, thinly sliced, or whole shimeji mushrooms", "Kosher salt and black pepper", "3/4 pound baby bok choy (about 8 small baby bok choy), trimmed, then sliced crosswise 1/2-inch thick", "5 scallions, trimmed, greens and whites thinly sliced (about 1/2 cup)", "3 garlic cloves, roughly chopped", "1 jalapeño, thinly sliced (optional)", "3/4 cup frozen peas", "2 to 3 tablespoons finely chopped fresh ginger (from one 2-inch piece)", "2 tablespoons soy sauce", "2 tablespoons sesame oil", "1/8 teaspoon white pepper (optional)", "1/2 cup thinly sliced fresh basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the cooked rice out of the refrigerator, and set it aside at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large wok or nonstick skillet, heat 2 tablespoons canola oil over medium-high. Add the mushrooms, season generously with salt and pepper, and cook, stirring occasionally, until browned and tender, 5 or 6 minutes. Transfer to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the skillet, if needed, then add 1 tablespoon canola oil and heat over medium-high. Add the bok choy, scallions, garlic and jalapeño, if using. Season with salt and pepper and stir-fry, stirring frequently, until aromatic and barely crisp-tender, 2 to 3 minutes. Transfer to the bowl with the mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining 2 tablespoons canola oil to the skillet and heat over medium-high. Add the rice and cook, stirring occasionally, until toasted and toothsome, 4 to 5 minutes. Add the frozen peas, ginger, soy sauce, sesame oil and white pepper (if using), and stir until rice is evenly coated in soy sauce mixture, and no uncoated rice grains remain, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the mushroom and bok choy mixture and the basil until basil is wilted, 1 to 2 minutes. Season to taste with salt and pepper then divide among bowls; serve hot."}]}