{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Chicken Tagine With Butternut Squash", "description": "This warmly spiced stew is inspired by a Moroccan tagine. The word tagine describes both the clay pot traditionally used to cook the dish and the dish itself. This simplified version combines chicken with dates, which mostly disappear into the stew, imparting a honeyed sweetness. Butternut squash wedges steam on top as the chicken cooks, then get stirred in at the end, thickening the sauce.\n<p><em>Find a slow-cooker version of this recipe <a href=\"https://cooking.nytimes.com/recipes/1019698-slow-cooker-chicken-tagine-with-butternut-squash?action=click&module=RecipeBox&pgType=recipebox-page&region=all&rank=22\">here</a>.</em></p>", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/04/03/dining/sd-pressure-cooker-chicken-tagine/sd-pressure-cooker-chicken-tagine-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 5 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner, soups and stews", "keywords": "chicken, cinnamon, cumin, dates, ginger, paprika, turmeric, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 454}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 520, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "9 grams", "proteinContent": "41 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1301 milligrams", "sugarContent": "33 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons canola oil", "1 large red onion, finely chopped", "Kosher salt", "1 (4-inch) piece fresh ginger, peeled and minced (about 1/4 cup)", "6 large garlic cloves, chopped", "1 cinnamon stick", "2 teaspoons sweet paprika", "1 teaspoon ground turmeric", "3/4 teaspoon cumin", "1/2 teaspoon hot smoked paprika", "1/2 teaspoon ground ginger", "1/4 teaspoon ground cayenne", "1/8 teaspoon ground cloves", "Black pepper", "1 tablespoon tomato paste", "1 cup chicken stock", "1/4 cup fresh lemon juice (from about 1 large lemon), plus more to taste", "2 pounds boneless, skinless chicken thighs", "8 dates, such as Medjool, pitted and halved", "1 (2- to 2 1/2-pound) butternut squash, peeled, halved lengthwise, seeded and cut into 1-by-3-inch wedges", "1 small bunch flat-leaf parsley, chopped", "4 scallions, thinly sliced", "Cooked couscous or pita for serving (optional)", "Plain yogurt, for topping (optional)", "Toasted almonds, for topping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the sauté setting, warm the oil in the pot of a 6- to 8-quart pressure cooker. Add the onion, season with salt, and cook, stirring occasionally, until the onion is softened and translucent, about 5 minutes. Add the fresh ginger and garlic and cook, stirring, until fragrant and softened, about 2 minutes. Add the cinnamon stick, sweet paprika, turmeric, cumin, smoked paprika, ground ginger, cayenne and cloves. Season generously with black pepper. Stir well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomato paste and stir until fully combined, fragrant and brick-red in color, about 1 minute. Add the chicken stock and lemon juice, scraping any browned bits that have collected at the bottom of the pan. Turn off the heat. Add the chicken and the dates and stir to combine. Place the butternut squash wedges on top and season them generously with salt and pepper. Close the lid and cook on high pressure for 16 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the pressure release naturally for 10 minutes, then release remaining pressure manually. Open the lid, add the parsley and scallions and gently fold everything together. (The butternut squash will fall apart slightly to thicken the sauce.) Taste and add lemon juice and salt, if necessary. Serve with couscous or pita and top with yogurt and toasted almonds, if desired."}]}