{"@context": "http://schema.org", "@type": "Recipe", "name": "Party Board", "description": "<i>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</i>\n\nYou don’t need a recipe for a party board, which is a fine dinner for a Wednesday night. You don’t even need a no-recipe recipe. You need only what cheese is in the refrigerator, sliced or wedged or cubed, along with cured meats — I like rolled mortadella, spread inside with a little mayonnaise and dotted with pickled jalapeño — and a little bread or pile of crackers. Maybe add to the board some cherry tomatoes, halved and tossed in olive oil and good vinegar with salt and pepper? You could stuff them with mozzarella, if you have the time. Or celery, cut into batons? Carrots, likewise? Raw or roasted peppers, sliced?\n\nThe chef Gabrielle Hamilton calls the assemblage <a href=\"https://www.nytimes.com/2016/10/23/magazine/a-snack-tray-to-gather-the-family-around.html\">a snack tray.</a> In the name of romance, she once stacked Pringles on one, with a ramekin of Castelvetrano olives. Her swain, now her wife, Ashley Merriman, responded with “pepperoni cut as thin as fish scales and shingled just as neatly.” You could go with Jarlsberg, Triscuits and vodka sodas. Or smoked salmon, shaved asparagus, some crème fraîche with chives, dill and tarragon. A party board is what you make of it.\n\n<i>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</i>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17norecipe-partyboard/merlin_147768705_5ed2ada4-d925-4c74-a090-188883a9a5ad-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, weeknight, dips and spreads", "keywords": "appetizer, main course, cheese, crackers, mortadella", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 234}, "recipeIngredient": [], "recipeInstructions": null}