{"@context": "http://schema.org", "@type": "Recipe", "name": "Farro Risotto With Sweet Corn and Tomatoes", "description": "Here’s a heartier, whole-grain alternative to traditional risotto that doesn’t require as much attention or stirring. Pearled farro is a must for this recipe; the tough husks have been removed so the grains cook in less time. The farro simmers in a quick homemade corn stock that makes use of the leftover corn cobs and imparts a rich corn flavor. Finally, fresh tarragon gives this risotto a lot of personality, but basil would be a fresh substitute.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/07/22/dining/lh-farro-risotto-with-sweet-corn-and-cherry-tomatoes/lh-farro-risotto-with-sweet-corn-and-cherry-tomatoes-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, grains and rice, vegetables", "keywords": "corn, farro, leek, lemon, parmesan, tarragon, tomato, white wine, fall, summer, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 418}, "recipeIngredient": ["3 ears fresh corn, husks and silk removed", "Kosher salt and black pepper", "2 tablespoons extra-virgin olive oil", "2 tablespoons unsalted butter", "2 cups thinly sliced leeks, white and light green parts (1 to 2 leeks)", "1 1/2 cups pearled farro (see Tip)", "1/2 cup dry white wine", "1 cup cherry tomatoes (about 6 ounces), halved", "3/4 cup freshly grated Parmesan (about 2 ounces)", "2 teaspoons chopped fresh tarragon or basil", "1 teaspoon lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp knife, cut the corn kernels off the cob, cutting as close to the cob as possible. Set the kernels aside and reserve the cobs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the corn stock: Holding the cobs over a medium saucepan, use a spoon to scrape down the sides of the cobs to release any additional corn and juices. Break the cobs in half and add to the saucepan, along with 8 cups water and 1 teaspoon salt. Bring to a boil, lower the heat, and simmer for 15 minutes before starting the risotto. (Keep the stock and corn cobs simmering while you cook the risotto.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the corn stock simmers, heat the oil and butter in a separate pot or Dutch oven over medium-low heat. Add the leeks and sauté until tender, 5 to 7 minutes. Add the farro and stir for 1 minute. Add the white wine and simmer until most of the liquid has evaporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase the heat to medium and gradually add the corn stock, about 1 cup at a time, to the farro mixture. Cook, stirring occasionally, and adding more stock as the farro absorbs it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the risotto has been cooking for 15 minutes, add the tomatoes, corn kernels, 1 teaspoon salt and 1/2 teaspoon pepper. Continue cooking, adding stock as necessary and stirring often, until the farro is tender, 10 to 15 more minutes. (You will use most — if not all — of the corn stock.) The risotto is done when the farro grains are tender and most of the liquid has been absorbed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Off the heat, stir in the Parmesan, tarragon and lemon zest. Season to taste with salt and pepper and serve immediately."}]}