{"@context": "http://schema.org", "@type": "Recipe", "name": "Mexican Hot Chocolate", "description": "Mesoamerican women are believed to be the first to ferment and roast cacao beans, a crucial step in chocolate making that is still used thousands of years later. Then, it was prepared as a frothy, unsweetened drink for rituals and medicinal purposes. Later, Spanish colonists brought the ingredient back to Spain, where sugar, cinnamon and vanilla were added, making it more similar to the spicy-sweet beverage we know today. This recipe is adapted from Churrería El Moro, a restaurant in Mexico City known for churros and hot chocolate. To get the signature foamy top, use a molinillo, a Mexican wooden whisk, or a wire whisk to make it light and frothy. And while it’s not traditional, you can also put the hot chocolate in a blender for about 2 minutes.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/12/23/dining/kwr-mexican-hot-chocolate/kwr-mexican-hot-chocolate-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 cups", "recipeCuisine": "mexican", "recipeCategory": "non-alcoholic drinks", "keywords": "chocolate, cinnamon, milk, sugar, vanilla, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "recipeIngredient": ["4 cups whole milk", "2 (4-inch) cinnamon sticks (preferably Ceylon)", "1/4 cup granulated sugar", "1 teaspoon vanilla extract", "8 ounces dark chocolate (preferably 70 percent)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine milk, cinnamon, sugar and vanilla. Heat over medium until the mixture begins to steam, stirring occasionally, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mixture heats, cut or break up the chocolate into small pieces so it melts evenly. Once the milk is steaming, add the chocolate and whisk until it’s melted and incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn off the heat and discard cinnamon sticks. Use a molinillo or whisk to mix the hot chocolate vigorously until it's frothy, 3 to 4 minutes, or blend in a blender for about 2 minutes. Serve hot."}]}