{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Ragù Hand Pies", "description": "Leftover <a href=\"https://cooking.nytimes.com/recipes/1020476-chicken-ragu-with-fennel\">chicken ragù</a> — or really any savory filling that is not too liquid — can be tucked inside this tender dough to make baked hand pies. They can be frozen before or after baking, then tucked into lunches and eaten at room temperature. A couple of rounds of prepared pie dough from the grocery store would make a quick and easy substitution.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/23lunchrex2/merlin_160763193_7524422e-0119-481b-9d4e-a4f59015b3cd-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "10 hand pies", "recipeCuisine": "american", "recipeCategory": "dinner, lunch, weeknight, finger foods, pastries, poultry", "keywords": "butter, parmesan, white wine vinegar, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "recipeIngredient": ["2 1/2 cups/320 grams all-purpose flour, plus more for rolling", "1 1/2 teaspoons kosher salt", "1/2 cup/115 grams very cold unsalted butter (1 stick), cut into small cubes", "1/3 cup/80 milliliters ice water, plus more if needed", "1 tablespoon white wine vinegar", "2 eggs", "1 cup <a href=\"https://cooking.nytimes.com/recipes/1020476-chicken-ragu-with-fennel\">chicken ragù</a> or other savory filling", "1/4 cup grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together flour and salt in a large bowl and work the butter into the flour with your fingers until it resembles coarse sand. It’s O.K. if some of the butter pieces aren’t fully incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the ice water, vinegar and 1 egg, then slowly add to the flour a bit at a time, stirring gently with a fork until a shaggy dough forms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flour your hands lightly, gather the dough into a ball and knead it gently a few times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the dough into a thick, flat square, wrap it in plastic wrap and chill for an hour. (The dough can stay overnight in the refrigerator or be frozen at this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. On a lightly floured surface, using a lightly floured rolling pin, roll out the dough until 1/8-inch thick. Cut out 4 1/2-inch rounds (a small bowl works well for this if you don’t have a cookie cutter). Collect dough scraps if needed to re-roll dough to obtain 10 rounds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the remaining egg. Line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add one heaping tablespoon of the chicken ragù to each pie, being careful to not scoop up too much liquid. Sprinkle with a little of the cheese, then brush the outer rim of each round with egg and fold over to seal tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the hand pies on the prepared baking sheet. Use the tines of a fork to crimp the edges, being careful not to puncture the dough that covers the filling. Brush the top of each hand pie with egg."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the pastry tops are golden brown, 15 to 20 minutes. Serve warm or at room temperature."}]}