{"@context": "http://schema.org", "@type": "Recipe", "name": "Gajjara Kosambari (Carrot Salad)", "description": "There are countless variations of this style of salad from Karnataka, but my favorite is a simple version made with crunchy raw carrots, dressed with a little tempered fat, coconut, citrus and chopped herbs. If fresh coconut isn’t available, keep a bag of frozen grated coconut in the freezer. It’s easy to find at most Indian grocery stores and, when you have it on hand, you can bring this salad together in less than five minutes.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/03/11/dining/09Indianrex4/merlin_169211703_f1cf8288-458d-4dba-98c5-e95377e91723-articleLarge.jpg", "totalTime": "PT5M", "recipeYield": "2 cups", "recipeCuisine": "indian", "recipeCategory": "snack, salads and dressings, vegetables", "keywords": "appetizer, side dish, carrot, coconut, cumin seeds, mustard seed, serrano chili, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "recipeIngredient": ["1 tablespoon neutral oil, such as grapeseed or canola", "1 green finger chile (or serrano chile), halved lengthwise", "1/2 teaspoon cumin seeds", "1/2 teaspoon white sesame seeds", "1/4 teaspoon black mustard seeds", "1/4 cup moong dal (split green gram), soaked for 1 hour, rinsed and drained (optional)", "3 large carrots, peeled and roughly grated", "2 tablespoons fresh or frozen grated coconut", "Handful of cilantro leaves and tender stems, chopped", "1/2 teaspoon kosher salt", "1/2 teaspoon granulated sugar", "1/2 lemon, for squeezing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small skillet, heat the oil over medium. Add the chile, cumin, sesame seeds, mustard seeds and moong dal, if using, and sauté for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape out into a large bowl. Add the carrots, coconut, cilantro, salt and sugar. When ready to serve, squeeze lemon on top and mix to combine."}]}