{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Paprika Chicken With Tomatoes and Parmesan", "description": "This deeply savory, weeknight-friendly sheet-pan chicken is worth buying a new jar of sweet paprika for, especially if you can’t remember when you got the one in your spice drawer (for those Fourth of July deviled eggs several summers ago?).The fresher the spices, the more intensely flavorful the dish. This one is as pretty as it is complex, with a mix of colorful cherry tomatoes and peppers that soften and absorb all the chicken juices as they roast. Serve it with something to catch the saucy tomatoes: Crusty bread, polenta or couscous all work well.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/01apperex/merlin_163287228_b349aad3-7d02-4918-8ec1-dc000603e8c5-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "cherry tomatoes, chicken, espelette pepper, parsley, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 669}, "recipeIngredient": ["3 pounds bone-in, skin-on chicken parts (breasts, drumsticks, thighs or a mix)", "Kosher salt", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "1 1/2 tablespoons apple cider vinegar, plus more for serving", "2 garlic cloves, finely grated", "1 tablespoon sweet paprika", "1 teaspoon Espelette pepper or smoked hot paprika (pimentón)", "1 teaspoon dried oregano", "1 pint cherry tomatoes (preferably different colors), halved", "1 poblano chile or 1 small green bell pepper, thinly sliced", "1 cup thinly sliced sweet bell peppers (red, yellow or orange)", "1/3 cup grated Parmesan", "1/4 cup chopped fresh parsley, for serving", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. Season chicken all over with salt, and place it on a rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together olive oil, vinegar, garlic, paprika, Espelette and oregano. Pour over chicken, tossing to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes, poblano and sweet peppers to baking sheet, spread vegetables around the chicken. Season vegetables lightly with salt and drizzle with a little more olive oil. Sprinkle Parmesan all over chicken and vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until chicken is golden, crisp and cooked through, 25 to 35 minutes. Stir the vegetables halfway through cooking but don’t disturb the chicken. If white meat is done before dark meat, remove it as it finishes cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken to plates. Stir vegetables around in pan, scraping up all the delicious browned bits from the bottom and sides of pan, and stir in the parsley and black pepper to taste. Taste and add salt if needed, and a drizzle of vinegar if you like. Spoon vegetables over the chicken to serve."}]}