{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Green Beans With Pancetta and Lemon Zest", "description": "This simple, bright green bean dish is as welcome alongside weeknight salmon as it is a Thanksgiving turkey. Green beans are delicious roasted at a high temperature and take just 15 minutes to cook, which particularly important on Thanksgiving when oven space is precious. Trim the green beans ahead of time, and this dish will come together in a flash. Many grocery stores sell packages of diced pancetta, a shortcut that makes this recipe a cinch. If you’re dicing the pancetta yourself, make sure to chop it very finely so it roasts in time with the green beans. (This recipe is easily halved: Simply cut the quantities in half and roast all the green beans on one sheet pan. The cooking time will remain the same.)", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/10/29/dining/lh-roasted-green-beans/lh-roasted-green-beans-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "vegetables", "keywords": "green beans, lemon, pancetta, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 110}, "recipeIngredient": ["2 1/2 pounds green beans, trimmed", "1 (4-ounce) package diced pancetta", "4 tablespoons olive oil", "1 teaspoon kosher salt, plus more to taste", "1 teaspoon black pepper", "Zest and juice of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and position the oven racks in the lower and top thirds of the oven. Divide the green beans and pancetta evenly between two sheet pans. Drizzle each sheet pan with 2 tablespoons olive oil, and sprinkle each with 1/2 teaspoon salt and 1/2 teaspoon pepper. Toss well, and roast for 10 minutes. Toss, switch racks, and roast for 5 to 10 more minutes, until cooked to your liking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with the lemon juice. Season with salt to taste, toss, and transfer to a serving platter. Garnish with the lemon zest and serve hot or warm."}]}