{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Pork All’Arrabbiata", "description": "This spicy pork shoulder’s long-simmered flavor is one you’ll crave all season long. The browned pork shoulder braises with fire-roasted tomatoes, red wine and basil in the oven until it becomes fork-tender and breaks down into a rich ragù. The red-pepper flakes create a gentle heat, while basil adds sweetness. Serve over polenta or toss with tubed pasta, like penne or rigatoni. If serving with pasta, loosen the sauce with a little pasta cooking water to help the sauce coat the pasta.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/02/12/dining/as-pork-ragu/merlin_168480960_02083adc-f91c-4855-b746-60a1451fe792-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings (about 7 cups)", "recipeCuisine": "", "recipeCategory": "dinner, meat, one pot, sauces and gravies", "keywords": "basil, canned tomatoes, garlic, pork shoulder, red wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 850}, "recipeIngredient": ["2 to 2 1/2 pounds boneless pork shoulder, trimmed of more than 1/4-inch fat", "Kosher salt and black pepper", "2 tablespoons extra-virgin olive oil", "10 garlic cloves, peeled and smashed", "1 1/2 teaspoons red-pepper flakes", "3 (14-ounce) cans fire-roasted crushed or diced tomatoes", "1 cup red wine", "5 basil sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Season the pork all over with 2 teaspoons salt and 1 teaspoon pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large Dutch oven, heat the olive oil over medium-high. Add the pork shoulder and sear until browned on all sides, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to medium-low. Add the garlic and red-pepper flakes to the oil and stir to combine. Add the tomatoes, red wine and basil. Stir to combine, season with salt and lots of black pepper, then bring to a boil over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover, then transfer to the oven and cook until the pork falls apart when prodded with a fork, 2 1/2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working directly in the pot, use two forks to shred the meat into long bite-size pieces. Stir the pork into the tomato sauce until it’s evenly distributed. Ragù will keep refrigerated for 3 days or frozen up to 3 months."}]}