{"@context": "http://schema.org", "@type": "Recipe", "name": "Tiny, Salty, Chocolaty Cookies", "description": "You do not have to be a chocolate person to love this perfect, unfussy, snacky dessert, which is like the edge of a chewy brownie but in cookie form. Adapted from \"Nothing Fancy\" by Alison Roman (Clarkson Potter, 2019), these cookies require no special equipment, fancy techniques or chilling time, which means that even if you bake only once a year, you can still make these. Lightly sweet and definitely salty, it's ideal for the end of a meal.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/07Romanrex4a/merlin_162114405_2dbe0cb5-7085-4e8b-8bc1-f528183763ac-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "24 cookies", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "almond, bittersweet chocolate, cocoa powder, hazelnut, pistachio, walnut, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1297}, "recipeIngredient": ["6 tablespoons unsalted butter (3/4 stick)", "2 1/2 cups confectioners’ sugar", "3/4 cup unsweetened cocoa powder (it's worth investing in high-quality cocoa powder, since that’s mostly what you’ll be tasting here)", "1 teaspoon kosher salt", "2 large egg whites", "1 large egg", "8 ounces bittersweet chocolate (at least 67 percent cacao), chopped", "1/2 cup finely chopped hazelnuts, almonds, pistachios, pecans or walnuts (optional)", "Flaky sea salt, such as Maldon or Jacobsen"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line two baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a small pot over medium heat, swirling, until it's starting to foam and brown, 3 to 4 minutes. (Whisk the butter from time to time so that the solids don’t stick to the bottom of the pot.) Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the confectioners’ sugar, cocoa powder and salt in a medium bowl, ridding it of as many lumps as possible. (If you really want to, feel free to sift everything.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, mix in the egg whites, whole egg and browned butter, stirring until you’ve got a good, smoothish mixture (any small lumps will take care of themselves), followed by the chocolate and any nuts you may want to add."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon, drop quarter-size blobs of dough (the texture is really somewhere between a dough and a batter) onto the baking sheet, spacing them about 2 inches apart (they spread a lot). Sprinkle with flaky salt and bake until the cookies have flattened considerably and look baked through and a little wrinkled, 6 to 8 minutes. Let cool before eating so they can firm up."}]}