{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Noodle Salad With Salted Peanuts and Herbs", "description": "This satisfying salad has rice noodles and vegetables in equal measure, making it bright, crisp and light. The peanuts add richness and a salty crunch, along with a dose of protein. And the dressing is a little spicy and a lot tangy, with a pungent kick from fish sauce, garlic and ginger. The recipe makes just enough dressing to lightly coat the vegetables and noodles, but if you’re a fan of heavily dressed salads, consider doubling it. Any leftover will keep in the fridge for up to a week, and you’ll be happy to drizzle it on fish, chicken and all kinds of vegetables.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/06/18/dining/mc-herbed-rice-noodle-salad/merlin_155267172_eee21cf8-b628-41cf-8cd5-a7d38afae486-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, lunch, weeknight, noodles, salads and dressings, vegetables", "keywords": "carrot, cucumber, fish sauce, herbs, radish, rice noodles, fall, spring, summer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 249}, "recipeIngredient": ["1 bunch radishes, thinly sliced", "1 large carrot, grated", "1 1/2 tablespoons rice wine vinegar", "2 teaspoons granulated sugar", "Pinch of fine sea salt", "8 ounces pad Thai rice noodles", "3 tablespoons lime juice (from about 2 limes), plus more to taste", "2 tablespoons grapeseed or other neutral oil", "1 1/2 tablespoons fish sauce", "1 (1-inch) piece fresh ginger, peeled and finely grated", "1 garlic clove, finely grated or mashed to a paste", "1 to 2 bird’s-eye or serrano chiles, thinly sliced", "1 cup thinly sliced cucumber, preferably Persian", "Handful of lettuce leaves, torn if large", "2 scallions, thinly sliced", "Large handful of fresh, soft herbs, such as dill, mint and cilantro", "1/2 cup roasted and salted peanuts, coarsely chopped", "4 hard-boiled eggs (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, toss radishes and carrot with vinegar, sugar and salt, and let sit while preparing remaining ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook rice noodles according to package instructions. Immediately transfer to a colander and rinse under cold water to cool. Set aside to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, prepare the dressing: Stir together lime juice, oil, fish sauce, ginger, garlic and chiles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pile noodles in a large bowl, then top with radish and carrot mixture and any juices from the bowl, cucumber, lettuce, scallions, herbs, peanuts and eggs, if using. Drizzle the dressing over the top."}]}