{"@context": "http://schema.org", "@type": "Recipe", "name": "Festival", "description": "According to Helen Willinsky, author of “<span>Jerk From Jamaica: Barbecue Caribbean Style</span>” (Ten Speed Press, 2007), festival is a relatively new entry into the Jamaican culinary canon, “but it is already a must.” A cousin of cornbread and hush puppies, festival is a fluffy yet crisp cornmeal-based fritter <span>that is often seasoned with nutmeg or vanilla</span>, then shaped into “fingers” or long buns and fried. (To make them vegan, substitute an equal quantity of full-fat coconut milk or the whole milk.) A touch of nutmeg adds warmth, and salt balances and enhances the sweetness of the corn. Serve festival with jerk </span><a href=\"https://cooking.nytimes.com/recipes/1020376-jerk-chicken-with-pickled-bananas\"><span>chicken</span></a><span>, </span><a href=\"https://cooking.nytimes.com/recipes/1017762-jerk-rib\"><span>ribs</span></a><span> or </span><a href=\"https://cooking.nytimes.com/recipes/4715-jerk-fish\"><span>fish</span></a><span>.", "author": {"@type": "Person", "name": "Daniela Galarza"}, "image": "https://static01.nyt.com/images/2020/02/18/dining/dg-festival/merlin_169064649_9fa40d04-8019-46d5-aa03-9773f7e31a18-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "10", "recipeCuisine": "caribbean", "recipeCategory": "dinner, finger foods", "keywords": "appetizer, side dish, cornmeal, flour, milk, nutmeg, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "recipeIngredient": ["1 cup/130 grams all-purpose flour", "1 cup/170 grams yellow cornmeal", "1 tablespoon granulated sugar", "1/2 teaspoon kosher salt", "1/2 teaspoon baking soda", "1/4 teaspoon ground nutmeg", "1/2 to 3/4 cup whole milk, evaporated milk or coconut milk", "3 to 4 cups vegetable or peanut oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 200 degrees. Line a sheet tray with paper towels and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flour, cornmeal, sugar, salt, baking soda and nutmeg. With a wooden spoon or your hands, mix in just enough milk to create a soft dough, about the same texture of Play-Doh. (The amount you need will depend on the humidity of your kitchen, and the amount of moisture in your flour and cornmeal.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven or large pot, heat oil to 365 degrees. While oil heats, using a bench scraper or butter knife, divide dough into 10 pieces. Roll each between your hands or on your counter into cylinders about 3 to 4 inches long and 1 inch thick. (Avoid overworking the dough or the festival may be tough.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry 4 or 5 festival at a time, flipping them after 1 minute, until golden brown on the outside, about 2 minutes total. (Oil temperature will lower once you add festival; they fry best around 330 to 340 degrees. If festival appear to be browning too quickly, lower your burner.) Using a wire spider or slotted spoon, remove festival from oil and transfer to paper towel-lined baking sheet. Cut into one to ensure the inside is cooked all the way through; it should not look wet. If it is not fully cooked, cook each fritter 30 seconds to 1 minute longer. Transfer to oven to keep warm. Fry remaining festival. Serve hot."}]}