{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Chile Chicken Stew", "description": "Many agree the best green chiles are grown in the Hatch Valley in southern New Mexico, so it’s great to make this delicious chicken stew in early fall when they’re are available. (Get a friend to send you some, or order them online.) But you can also make it throughout the year using frozen or canned green chiles. Though pork, beef or lamb are more traditional for green chile stew, this chicken version is a bit lighter, quicker to cook and still packs a punch. It’s not a dish for the faint of heart.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/09/11/dining/06kitchenrex/06kitchenrex-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, soups and stews", "keywords": "chicken, green chili, potato, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 393}, "recipeIngredient": ["6 large bone-in, skin-on chicken thighs, legs, or a cut-up whole chicken (about 3 pounds)", "Kosher salt and black pepper", "2 tablespoons olive oil or lard", "Flour, for dredging", "1 medium yellow onion, diced", "3 large garlic cloves, minced", "1/2 teaspoon cumin seeds, toasted and ground", "1 cup chopped roasted New Mexico green chile, fresh or frozen and thawed", "3 cups chicken stock or water", "2 large potatoes, peeled, cut in 1-inch cubes", "3 large carrots, peeled, cut in 2-inch slices", "3 tablespoons cornstarch dissolved in 2 tablespoons cold water (optional)", "Chopped cilantro, for garnish", "Warm flour or corn tortillas, for serving", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken thighs generously with salt and pepper. Heat oil in a Dutch oven or heavy-bottomed pot over medium-high heat. Dredge chicken in flour and shake off excess. Brown chicken well on both sides, then remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions to pot, season lightly with salt and cook, stirring, until softened and beginning to brown, 6 to 8 minutes. Add garlic and cumin, and cook for 1 minute. Then add chopped chiles and chicken stock and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return chicken to pot; reduce heat to a brisk simmer, and cook, covered with lid ajar, for 30 minutes. Add potatoes and carrots and cook for 20 to 25 minutes more, until vegetables are soft but not falling apart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim fat from surface of sauce. Taste for seasoning and adjust salt. For a thicker sauce, add dissolved cornstarch and stir well. Cook for 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve in deep wide soup plates with plenty of sauce. Sprinkle with chopped cilantro. Serve with warm tortillas and lime wedges."}]}