{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Gochujang Chicken and Roasted Vegetables", "description": "Gochujang, a Korean fermented chile paste, enlivens a straightforward dinner of roast chicken and vegetables with a salty, spicy and umami-rich layer of flavor. Freshly grated ginger, sliced scallions and quick-pickled radishes elevate the flavor even further. This recipe calls for a wintry mix of squash and turnips, but equal amounts of root vegetables like carrots, potatoes and beets, or lighter vegetables like cauliflower, brussels sprouts or broccoli will work well too. ", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2020/01/24/dining/yk-gochujang-chicken-and-vegetables/merlin_167664060_7435c624-7225-4cb1-b104-4d67761185a4-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, one pot, poultry, roasts, vegetables", "keywords": "butternut squash, chicken, ginger, gochujang, radish, scallion, squash, turnip, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 472}, "recipeIngredient": ["3 tablespoons gochujang", "2 tablespoons soy sauce", "1 (1-inch) piece fresh ginger, peeled and grated (about 1 tablespoon)", "3 tablespoons neutral oil, like grapeseed or canola, plus more for drizzling", "2 pounds squash, such as butternut, acorn or delicata, unpeeled, seeded and cut into 2-inch pieces (about 5 loose cups)", "1 pound turnips, trimmed and cut into 2-inch pieces (about 3 1/2 loose cups)", "10 scallions, ends trimmed, green and white parts separated, but not chopped", "Kosher salt", "2 1/2 to 3 pounds bone-in, skin-on chicken thighs, drumsticks or breasts, patted dry", "1 bunch radishes (about 10 ounces), trimmed", "2 tablespoons rice vinegar", "1 tablespoon sesame oil (optional)", "Steamed rice (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Combine the gochujang, soy sauce, ginger and 3 tablespoons oil in a medium bowl or resealable bag. Add the squash, turnips and scallion whites, toss to coat with glaze, or seal bag and shake to coat. Lightly season with salt and transfer to a rimmed baking sheet. Season the chicken with salt and toss to coat in whatever is left of the glaze in the bowl or bag. Arrange the chicken pieces skin-side up between the vegetables on the sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast until vegetables are tender, chicken is cooked through and the skin crispy and browned in spots, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the chicken cooks, thinly slice the scallion greens. Using a sharp knife or a mandoline, cut the radishes into thin rounds. In a small bowl, toss the sliced scallion greens and radishes with the rice vinegar and sesame oil, if using. Season to taste with salt and set aside to lightly pickle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top the roast chicken and vegetables with the quick-pickled scallion-radish mix and transfer to serving plates. Serve with steamed rice, if desired."}]}