{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Salmon With Citrus and Arugula Salad", "description": "Bursting with color and bright, bold flavors, this simple recipe makes an elegant main course for a dinner party, or a welcome diversion from your go-to weeknight salmon. The technique of cooking salmon in a cast-iron skillet creates a beautifully golden-brown sear and crispy skin. For best results, make this recipe during the cold weather months, when citrus fruit is at its best.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2020/01/15/dining/lh-citrus-salmon/lh-citrus-salmon-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "brunch, dinner, lunch, salads and dressings, seafood", "keywords": "appetizer, main course, arugula, citrus, fennel, grapefruit, orange, salmon, dairy-free, gluten-free, spring, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 244}, "recipeIngredient": ["4 tablespoons olive oil, plus more for brushing", "2 tablespoons freshly squeezed orange juice", "2 teaspoons Dijon mustard", "2 garlic cloves, minced (about 2 teaspoons)", "3/4 teaspoon kosher salt, plus more to taste", "2 tablespoons freshly squeezed lemon juice", "1/2 teaspoon black pepper, plus more to taste", "1/4 cup thinly sliced shallot (from 1 large shallot)", "1 small grapefruit", "2 to 3 navel oranges, blood oranges or Cara Cara oranges, or a combination (about 1 1/2 pounds total)", "4 (6-ounce) skin-on salmon fillets", "2 to 3 ounces baby arugula (about 4 cups)", "1/2 medium fennel bulb, trimmed, cored and very thinly sliced crosswise", "1 ripe avocado, halved, pitted, peeled and thinly sliced", "1/4 cup shelled, roasted salted or unsalted pistachios, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the glaze for the salmon: In a small bowl, whisk 2 tablespoons olive oil with the orange juice, mustard, half the chopped garlic and 1/4 teaspoon salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salad dressing: In another small bowl, whisk together 2 tablespoons olive oil with the lemon juice, 1/2 teaspoon salt and 1/2 teaspoon pepper. Stir in the shallots and the remaining garlic, then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a small serrated knife, peel the grapefruit and oranges and trim to remove any remaining pith. Slice all the peeled fruit crosswise into thin circles (no larger than 1/2-inch thick); remove the seeds and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 12-inch cast-iron or heavy stainless-steel skillet over medium-high until it’s extremely hot (a drop of water flicked onto the pan should turn to steam almost immediately), about 3 minutes. Meanwhile, pat the salmon fillets dry using paper towels, brush both sides with olive oil, and season all over with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pan is ready, cook the salmon fillets skin-side down over medium-high without moving until the salmon skin releases easily from the pan, 3 to 4 minutes. Using a pair of tongs or a spatula, wiggle the fillets to loosen the skin from the bottom of the pan, then carefully flip. Lower the heat to medium and cook until the salmon is cooked through but still slightly rare in the center, 4 to 5 more minutes, depending on the thickness of the fillets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a rimmed plate or serving dish, and brush the glaze all over the salmon, making sure to coat the fillets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the arugula and fennel in a large bowl. Pour the dressing over the salad and toss well. Add the avocado, citrus rounds and pistachios, and toss gently. Transfer to a shallow serving bowl or platter and serve alongside the salmon."}]}