{"@context": "http://schema.org", "@type": "Recipe", "name": "Asparagus, Goat Cheese and Tarragon Tart", "description": "Because you don’t have to make your own crust, this gorgeous asparagus-striped tart is so easy it almost feels like cheating. But it’s not. It’s just simple yet stunning, effortlessly chic and company-ready. As there are so few ingredients in this recipe that each one makes an impact, be sure to buy a good all-butter brand of puff pastry. If you can manage to serve this tart warm, within an hour of baking, it will be at its absolute best, with crisp pastry that shatters into buttery bits when you bite down and still-runny cheese. But it’s also excellent a few hours later, should you want to get all your baking done before your guests arrive. If tarragon isn’t your favorite herb, you can use chives, basil or mint instead. And if you can manage to trim all the asparagus to the same length, this tart will be especially neat and orderly looking.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/03/11/dining/06apperex-tart/merlin_169778565_ce24cc53-5c03-4711-927c-1aa8081e0b22-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "weekday, pies and tarts", "keywords": "appetizer, asparagus, goat cheese, puff pastry, tarragon, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 351}, "recipeIngredient": ["1 cup goat cheese, at room temperature (4 ounces)", "1 large egg, lightly beaten, at room temperature", "1 large garlic clove, finely grated or minced", "1 1/2 tablespoons chopped fresh tarragon leaves, plus more for serving", "1/2 tablespoon finely grated lemon zest", "1/2 teaspoon fine sea salt, plus more for sprinkling", "Pinch of freshly grated nutmeg", "1 cup crème fraîche, at room temperature (8 ounces)", "All-purpose flour, for dusting the work surface", "1 sheet or square all-butter puff pastry, thawed if frozen (about 9 to 14 ounces; brands vary)", "8 ounces thin asparagus, woody ends trimmed", "Extra-virgin olive oil", "2 tablespoons grated Parmesan", "Freshly ground black pepper", "Red-pepper flakes (optional)", "1 1/2 ounces Parmesan, shaved with a vegetable peeler (about 1/2 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. In a medium bowl, use a fork or a wooden spoon to mash together the goat cheese, egg, garlic, tarragon, lemon zest, salt and nutmeg until smooth. Switch to a whisk and beat in the crème fraîche until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, roll out puff pastry into a 13-by-11-inch rectangle about 1/8-inch thick. Transfer the dough to a parchment-lined cookie sheet. With a sharp knife, lightly score a 1/2-inch border around the edges of the puff pastry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the crème fraîche mixture evenly inside the scored border. Line up the asparagus spears on top, and brush them with olive oil. Sprinkle some salt and the grated Parmesan over the asparagus."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the pastry is puffed and golden, 25 to 30 minutes. Let it cool on the cookie sheet for at least 15 minutes or up to 4 hours before serving. Then sprinkle black pepper, red-pepper flakes (if using), the shaved Parmesan and tarragon leaves. Drizzle a little oil on top."}]}