{"@context": "http://schema.org", "@type": "Recipe", "name": "Cider-Glazed Brussels Sprouts", "description": "Simple roasted brussels sprouts get an autumnal upgrade when they are tossed with a tangy, sweet glaze made from apple cider, apple cider vinegar and mustard. If you’re making these for Thanksgiving, make the glaze (see Tip) and trim the brussels sprouts in advance, then pop the sprouts into the oven while the turkey rests. Note that this recipe is easily doubled for larger groups: Just use a larger skillet for the sauce and two sheet pans for the sprouts.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/10/30/dining/lh-cider-braised-brussels-sprouts/merlin_163577493_598520fc-9039-4b43-95a9-3f6036fd1bef-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "easy, vegetables", "keywords": "apple cider, apple cider vinegar, brussels sprouts, shallot, fall, winter, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 215}, "recipeIngredient": ["2 pounds brussels sprouts, trimmed and halved, quartered if very large", "3 tablespoons olive oil", "1 1/2 teaspoons kosher salt", "1 teaspoon black pepper", "2 tablespoons unsalted butter", "1/2 cup finely chopped shallots (about 2 medium shallots)", "2 cups apple cider", "3 tablespoons apple cider vinegar", "1 1/2 teaspoons Dijon mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Place the brussels sprouts on a sheet pan. Drizzle with the olive oil and sprinkle with 3/4 teaspoon salt and 1/2 teaspoon pepper. Toss well and roast for 25 to 35 minutes, tossing a few times throughout, until evenly browned and tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the butter in a medium skillet over medium-low. Add the shallots and cook for 6 to 8 minutes, until tender and starting to brown. In a medium-small bowl or glass measuring cup, combine the cider, cider vinegar, mustard, 3/4 teaspoon salt and 1/2 teaspoon pepper and whisk until smooth. Add this mixture to the shallots and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook over medium heat for 15 to 20 minutes, until reduced to about 3/4 cup and thickened. (The glaze will continue to thicken as it cools.) Set aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the glaze over the roasted brussels sprouts directly on the sheet pan, toss, and serve."}]}