{"@context": "http://schema.org", "@type": "Recipe", "name": "Cowboy Caviar", "description": "Depending on where you’re from, this simple dip is known as cowboy caviar, Texas caviar or Dixie caviar, and it’s a favorite at tailgates and potlucks all over the South. Its creator, Helen Corbitt, a dietitian from New York, had never heard of black-eyed peas when she moved to Texas in 1931. The exact details are fuzzy, but at some point in her 40 years working in restaurants there, she combined black-eyed peas with a simple vinaigrette, and it was a big hit. The recipe has evolved over the years, and you can find a number of variations online. Some contain corn and black beans (as this one does), and others avocado. Some call for bottled Italian salad dressing, others homemade. No matter how you tweak it, it’s always good with a pile of tortilla chips.", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/08/28/dining/ml-cowboy-caviar/ml-cowboy-caviar-articleLarge-v2.jpg", "totalTime": "PT2H15M", "recipeYield": "8 cups", "recipeCuisine": "american", "recipeCategory": "easy, snack, crackers and chips, dips and spreads, finger foods", "keywords": "appetizer, bell pepper, black beans, black-eyed peas, cilantro, tomatoes, tortilla chips", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 189}, "recipeIngredient": ["1/3 cup olive oil", "1/4 cup red wine vinegar", "3 to 4 garlic cloves, minced", "1 teaspoon granulated sugar", "Kosher salt and black pepper", "3 plum tomatoes, cored, seeded if desired, and diced", "1/2 red onion, finely diced (about 3/4 cup)", "1 (15-ounce) can black beans, rinsed", "1 (15-ounce) can black-eyed peas, rinsed", "1 1/2 cups fresh corn kernels (from about 2 to 4 cobs) or thawed, drained frozen sweet corn (about 8 ounces)", "1 red, green or yellow bell pepper, seeded and finely diced", "1 jalapeño, seeded and finely diced", "1/2 cup chopped cilantro leaves and tender stems, plus more for garnish, if desired", "1 scallion, white and green parts, chopped, for garnish (optional)", "Tortilla chips, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: In a medium bowl, whisk the olive oil, vinegar, garlic, sugar, 1/2 teaspoon salt and 1/2 teaspoon pepper to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomatoes, red onion, black beans, black-eyed peas, corn, bell pepper, jalapeño and cilantro. Toss to combine and season with salt and pepper to taste. Cover with plastic wrap and refrigerate for 2 hours before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, toss well and season to taste. Sprinkle with scallions and serve with tortilla chips."}]}