{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond Saffron Cake", "description": "This cake was adapted from Kim Sunée, the Korean-born author of “Trail of Crumbs: Hunger, Love and the Search for Home” (Grand Central, 2008).", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT1H", "recipeYield": "2 8-inch cakes", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "almond paste, orange, saffron, sour cream, dessert", "aggregateRating": null, "recipeIngredient": ["Butter or nonstick spray, for baking pans", "1/3 cup milk", "Generous 1/2 teaspoon saffron threads", "Finely grated zest of 1 orange (about 2 teaspoons)", "2 cups all-purpose flour (stir flour before measuring)", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/8 teaspoon salt", "1 cup butter (2 sticks), at room temperature", "1 8-ounce can (about 1 cup) almond paste (not marzipan), or one 7-ounce tube", "1 cup confectioners’ sugar, plus additional for dusting or glazing cakes", "5 large eggs", "1 8-ounce container whole-fat sour cream", "Juice of 1 orange, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Lightly butter or spray two 8-inch round cake pans. In a small saucepan over medium heat, warm milk and add the saffron and zest. Bring to a low simmer, and remove from heat; set aside. Sift together flour, baking powder, baking soda and salt in a large bowl; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer at medium speed, beat together 1 cup butter and almond paste until creamy, about 3 minutes. Gradually add 1 cup confectioners’ sugar, and beat until fluffy, scraping down the sides. Add eggs one at a time, beating until blended after each addition. Gradually add flour mixture alternately with sour cream, beginning and ending with flour mixture. Add saffron mixture, beating just until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour batter into prepared cake pans, and smooth tops. Bake until tester inserted in center comes out clean, 30 to 40 minutes. Cool 5 minutes, and remove from pans. Serve warm, dusted with confectioners’ sugar, or drizzled with orange juice mixed with 2 to 3 tablespoons confectioners’ sugar."}]}