{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Cooker Mulled Cider With Cardamom, Black Pepper and Ginger", "description": "A slow cooker is an ideal way to make and serve a warm cocktail for a party: Throw the ingredients into the cooker several hours before guests arrive and the cider will bubble away, making the whole house smell wonderful. Reduce the heat before adding the rye whiskey so it maintains its kick. The toasted spices make the flavors so vibrant that the drink is delicious even without the whiskey. No slow cooker? <a href=\"https://cooking.nytimes.com/recipes/1020716\">This recipe</a> is your stovetop option.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/12/11/dining/sd-mulled-cider/sd-mulled-cider-articleLarge-v2.jpg", "totalTime": "PT3H10M", "recipeYield": "16 servings (about 19 cups)", "recipeCuisine": "american", "recipeCategory": "easy, cocktails", "keywords": "apple cider, cardamom, cider, cinnamon, ginger, rye whiskey, whiskey, fall, winter", "aggregateRating": null, "recipeIngredient": ["3 tablespoons green cardamom pods", "2 teaspoons whole black peppercorns", "2 (3- to 4-inch) cinnamon sticks, plus extra for garnish, if desired", "1 teaspoon whole allspice berries", "1 (4- to 5-inch) piece fresh ginger, peeled", "1/2 lemon, scrubbed, thinly sliced and seeded, plus extra for garnish, if desired", "1/2 small orange, scrubbed, thinly sliced and seeded, plus extra for garnish, if desired", "Generous pinch of kosher salt", "1 gallon apple cider, preferably unfiltered", "1 (750-milliliter) bottle rye whiskey, plus more if desired (optional)", "1 teaspoon vanilla extract", "TIP This recipe was designed for holiday parties, but you can easily halve all the quantities to make a smaller batch."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the cardamom pods on a cutting board. Lay the flat of a chef’s knife over them and gently smack the flat of the knife to lightly crush and crack the pods. Add the cardamom pods, peppercorns, cinnamon sticks and allspice berries to a medium skillet over medium-high heat. Toast the spices, shaking the pan often, until very fragrant, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the cinnamon sticks into a 6- to 8-quart slow cooker. Tie up the remaining spices into a cheesecloth bundle, and add that to the slow cooker as well. (If you don’t have cheesecloth, you can use tea infusers or loose tea bags. You could also put the spices directly into the slow cooker, then strain the mixture as you serve.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the piece of peeled ginger in half lengthwise and smash each piece by laying the flat of the knife over it and smacking with the heel of your hand. (At this point, put the slow cooker in the spot where you’d like to serve it, because it will become difficult to move once you’ve added all of the liquid.) Add the ginger, lemon, orange, salt and apple cider to the slow cooker. Cover, and cook on high for 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the heat to warm. Add the rye whiskey and vanilla and stir to combine. You can leave the cider on warm for several hours, allowing guests to serve themselves, adding additional citrus slices and cinnamon sticks to their mugs, as desired."}]}