{"@context": "http://schema.org", "@type": "Recipe", "name": "Buffalo Corn on the Cob", "description": "This recipe delivers a hot wings moment minus the meat: Melt some blue cheese into warm Buffalo sauce and slather it on corn, then sprinkle with even more blue cheese crumbles. There are people in this world who think Buffalo sauce pairs better with ranch dressing than blue cheese, and even some people who detest blue cheese. For them, leave out the blue cheese altogether and drizzle <a href=\"https://cooking.nytimes.com/recipes/1019546-classic-ranch-dressing\">ranch</a> (or our recipe for <a href=\"https://cooking.nytimes.com/recipes/1019912-buffalo-cauliflower\">yogurt ranch sauce</a>) over the Buffalo’d cobs.", "author": {"@type": "Person", "name": "Emily Fleischaker"}, "image": "https://static01.nyt.com/images/2019/07/09/dining/ef-buffalo-corn-on-the-cob/merlin_157388631_26ffa7d5-9361-413d-9ca6-2c16b5368138-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "vegetables", "keywords": "appetizer, side dish, blue cheese, buffalo, butter, corn, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "recipeIngredient": ["4 ears fresh corn, shucked", "2 tablespoons unsalted butter", "2 tablespoons Buffalo-style hot sauce", "1/2 cup crumbled blue cheese", "Kosher salt and black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat your grill to medium-high. Grill corn, turning occasionally, until cooked through and lightly charred, 10 to 12 minutes. (Alternatively, drop corn in a large pot of salted boiling water and cook for 5 to 7 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce: In a small saucepan or skillet, melt the butter with the hot sauce over low heat (you can heat the pan right on the grill), and stir to combine. Remove pan from the heat and stir in 2 tablespoons blue cheese. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slather hot corn with buffalo sauce. (This gets messy, so do it on a plate or platter.) Sprinkle with the rest of the blue cheese."}]}