{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Pear Tart", "description": "Gently spiced poached pears, vanilla pastry cream and flaky puff pastry are the stars of this sophisticated dessert that was created for the 2019 NYT Food Festival by Rachel Gaylord, the pastry chef at La Mercerie in New York. Ideally, this delicate tart should be eaten the day it’s made, so if you’re planning to serve this at a dinner party, make all of the components in advance and assemble the tart just before your guests arrive. Leftovers, if you have any, should be stored in the refrigerator and brought to room temperature before serving. The pastry will have lost some of its flakiness, but it will still be delicious. (This adaptation mercifully calls for store-bought puff pastry, but if you’re feeling ambitious, <a href=\"https://cooking.nytimes.com/recipes/2483-puff-pastry\">you can make your own</a>.)", "author": {"@type": "Person", "name": "Margaux Laskey"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/ml-pear-tart/ml-pear-tart-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "almond, pears, puff pastry, star anise, dessert, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "recipeIngredient": ["1 1/4 cups/250 grams granulated sugar", "1 1/2 teaspoons vanilla extract", "4 to 6 star anise pods", "2 semi-ripe Bartlett pears, peeled, cut in half lengthwise and seeded", "1 sheet store-bought puff pastry (about 8.5 ounces)", "1 egg, beaten", "1 cup/240 milliliters whole milk", "1/2 teaspoon vanilla extract", "1/4 cup/60 grams granulated sugar", "3 tablespoons/25 grams cornstarch", "4 egg yolks, at room temperature", "2 tablespoons/25 grams unsalted butter, softened", "1/2 cup pear purée or applesauce", "1/4 cup/50 grams granulated sugar", "1/2 cup/50 grams toasted sliced almonds, for garnish (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach the pears: Combine 2 cups/480 milliliters water, sugar, vanilla extract and star anise pods in a medium saucepan over medium heat. Bring to a simmer, then reduce the heat to low. Place the pears in the poaching liquid and cover with a lid. Keep just below a simmer and cook until the pears are tender, about 40 minutes depending on the ripeness of the pears. Remove the pears from the liquid to a plate and cool completely. Slice each pear half crosswise into 1/2-inch-thick slices. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pears poach and cool, make the pastry: Trim a sheet of puff pastry to one 4 1/2-by-12 inch rectangle. From the remaining puff pastry, cut two 1-by-12-inch strips. Transfer rectangle and strips to a sheet pan lined with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pastry brush, brush the beaten egg in a thin 1-inch strip along both long edges of the puff pastry, then place the strips of puff pastry on top. (You should have a rectangle of puff pastry with a puff pastry border down each of the long sides.) Use the back of a chef’s knife or the tines of a fork to gently press the strips of puff pastry into the rectangle. Prick the pastry all over with a fork, then refrigerate for 15 minutes. Meanwhile, heat the oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the puff pastry all over with egg wash, then line the center with parchment and fill with baking weights or dried beans. Bake for 20 minutes, turning halfway through. Remove the parchment and baking weights. Bake until golden brown, about 3 more minutes. As soon as you pull it out of the oven, trim the edges with a knife so the layers line up, if necessary. If the center has puffed up, gently prick with a fork or toothpick to release air. Allow to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pastry bakes and cools, make the pastry cream: Combine the milk, vanilla extract, and half the sugar (using 2 tablespoons/30 grams) in a pot. Bring to a simmer over medium-low. In a separate bowl, whisk together the remaining 2 tablespoons/30 grams sugar and the cornstarch, then whisk in the yolks. Whisking the eggs and cornstarch continuously, carefully add 1/4 cup of the hot milk mixture to the egg yolks, and whisk well to combine. Now, whisking the hot milk mixture in the pot continuously, add the egg yolks and cornstarch mixture to the pot. Continue whisking until it thickens. (It happens fast!) Immediately remove from the heat and whisk in the softened butter until smooth. Transfer to a bowl and cover with plastic wrap directly on the surface of the pastry cream. Allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pastry cream cools, make the glaze: Combine the pear purée, sugar and 2 tablespoons water in a medium saucepan and bring to a simmer until slightly reduced and glossy, about 3 minutes. Strain and chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the puff pastry to a serving platter. Spread about 1 1/2 cups pastry cream down the center of the pastry shell. Place the sliced pear halves over the pastry cream in alternating directions. Brush each pear with a thick layer of pear glaze. Garnish any areas between the pears with toasted almonds. Dust the whole tart with confectioners’ sugar just before serving."}]}