{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Forest Cake", "description": "Black forest cake, which originated in the Black Forest region of Germany, is typically made with a light chocolate sponge cake, soaked with cherry syrup and cherry brandy (Kirsch), then layered with whipped cream and cherries. This version swaps the chocolate sponge for a denser, fudgier chocolate cake to delicious effect. But slicing a rich chocolate cake into four thin layers can be a bit tricky. To make the job a little easier, cool them completely before slicing. The cherry jam and syrup can be made in advance.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2020/01/15/dining/ss-black-forest-cake/merlin_165684495_6689b1a0-42b5-4228-b871-37bb983d797e-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "american, german", "recipeCategory": "cakes", "keywords": "cherries, chocolate, heavy cream, kirsch, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 132}, "recipeIngredient": ["1 cup/240 milliliters vegetable oil, plus more for greasing the pans", "1 1/2 cups/140 grams Dutch-process cocoa powder", "1 1/2 cups/360 milliliters boiling water", "1 cup/240 milliliters buttermilk", "4 large eggs", "1 1/2 cups/330 grams packed dark brown sugar", "1 1/2 teaspoons pure vanilla extract", "3 cups/385 grams all-purpose flour", "1 tablespoon baking powder", "1 1/2 teaspoons kosher salt", "3/4 teaspoon baking soda", "4 cups (about 20 ounces/600 grams) fresh or frozen dark sweet cherries, pitted", "1/2 cup/100 grams granulated sugar", "1 teaspoon cornstarch", "1/4 teaspoon almond extract", "1 to 2 tablespoons Kirsch", "1/3 cup/40 grams confectioners’ sugar", "1 tablespoon cornstarch", "4 cups/960 milliliters heavy cream", "6 ounces/170 grams bittersweet chocolate, shaved into curls", "8 fresh or frozen whole dark sweet cherries, pitted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Grease two 9-inch round cake pans with oil and line the bottom of each with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the cake, in a large bowl, whisk together the cocoa powder and boiling water until smooth. Add the buttermilk and 1 cup vegetable oil, and whisk to combine. Add the eggs, brown sugar and vanilla extract, then whisk to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, baking powder, salt and baking soda. Add the dry ingredients to the wet, then whisk to combine. Divide the batter evenly between the two pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Transfer the cakes to a rack to cool for about 20 minutes, then flip the cakes out onto the rack and let them cool completely. Flip the cakes again, so the domed portion is on top, and trim a bit of the dome off each cake to flatten the top. Carefully cut each layer in half horizontally, creating four layers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cake cools, prepare the cherry jam: In a small saucepan, combine the cherries and sugar over medium heat. Cook, stirring occasionally and breaking the cherries down with a wooden spoon or potato masher, until the fruit has released its juice, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pass the cherry mixture through a fine-mesh sieve, reserving the syrup in a medium bowl and setting aside the cooked cherries. Measure out 1/2 cup/120 milliliters of the syrup. (If you have more, store the rest in the refrigerator for another use). Transfer 1 tablespoon syrup from the 1/2 cup to small bowl, then stir the Kirsch into remaining syrup; set aside to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 teaspoon cornstarch to the reserved 1 tablespoon cherry syrup in the small bowl; whisk to combine. Transfer it to the saucepan, add the cooked cherries and cook over medium, stirring, until the mixture has thickened, 3 to 5 minutes. Transfer to a bowl to cool completely. (You should have about 1 1/4 cups/300 milliliters jam.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the whipped cream: In a small saucepan, whisk together the confectioners’ sugar, cornstarch and 1 cup heavy cream. Bring that mixture to a low boil over medium heat and cook, stirring, until thickened to the consistency of thin pudding, reducing heat as necessary to avoid scorching, about 2 minutes. Transfer cream mixture to a large bowl to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cake: Whisk the cream mixture to loosen it, then add the remaining 3 cups heavy cream. Using an electric mixer on medium, beat the mixture until you have medium-stiff peaks, about 2 minutes. Set one cake layer on a serving plate, cut-side up. Brush it with some of the cherry-Kirsch syrup, spread about 1 cup whipped cream over the top, then 1/3 of the cherry jam. Swirl the jam and the cream together a bit to spread it out evenly. Repeat this process two more times and top it with the last cake layer, cut-side down. Then cover the entire cake with a thin layer of whipped cream. Refrigerate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish, frost the cake with the remaining whipped cream. Prepare the chocolate curls: Warm the chocolate bar in the microwave for 10 to 15 seconds, then use a vegetable peeler to create curled chocolate shavings. Press the chocolate shavings onto the sides of the cake and over a 1-inch of the border on top. Top with the 8 cherries. Store leftovers, well wrapped, in the refrigerator for up to 3 days."}]}