{"@context": "http://schema.org", "@type": "Recipe", "name": "Blackberry Corn Cobbler", "description": "This cobbler substitutes fresh, juicy kernels and corn milk for traditional heavy cream, taking advantage of the sweetness of seasonal corn and adding texture to a buttery crust. Grating two large ears of corn should produce enough liquid for the topping, but, if not, you can grate a third ear, or add cream or milk. The rich, crumbly crust also gets some of its moisture from the filling, which is extra syrupy from the mashed blackberries. Serve the cobbler warm with a splash of heavy cream, a dollop of coconut yogurt, or a scoop of vanilla ice cream. Finishing it all off with a drizzle of dark rum, while not necessary, is especially sweet.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2019/07/02/dining/jg-blackberry-cobbler/merlin_156440754_6bc62ccb-7cec-4e1d-ab2c-556173542c93-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "pies and tarts", "keywords": "blackberries, butter, corn, cornmeal, lemon, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 141}, "recipeIngredient": ["4 tablespoons/60 grams very cold unsalted butter (1/2 stick), cut into cubes, plus more for greasing the pan", "2 pounds/905 grams fresh, ripe blackberries (about 6 1/2 cups), lightly mashed with a potato masher", "1 cup/200 grams granulated sugar, plus more as needed", "1 1/2 cups/190 grams all-purpose flour", "2 tablespoons fresh lemon juice", "1 teaspoon kosher salt", "2 large ears sweet yellow corn", "1/3 cup/50 grams finely ground yellow cornmeal", "1 1/4 teaspoons baking powder", "2 tablespoons heavy cream", "4 teaspoons turbinado sugar, for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees and grease the inside of a 9-by-9-inch square casserole dish with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, toss the mashed blackberries with ⅔ cup granulated sugar, ¼ cup flour, the lemon juice and ¼ teaspoon salt. Taste and add additional sugar, if necessary. Transfer the mixture to the baking dish in an even layer and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a box grater, grate the corn over a bowl to collect its meat and milk; discard the corn cobs or reserve for <a href=\"https://cooking.nytimes.com/recipes/1016753-corn-risotto\">another use</a>. Transfer corn mixture to a liquid measuring cup. (The grated corn mixture should measure a healthy ¾ cup; if not, supplement with extra corn, heavy cream or milk.) Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together the remaining 1¼ cups flour, ⅓ cup granulated sugar with the cornmeal, baking powder and ¾ teaspoon salt. Add the cubed butter, separating the cubes and tossing them individually to coat. Pressing the bits of butter between your thumb and the side of your index finger, break up the butter into the flour until evenly dispersed and butter pieces are roughly the size of peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly pour the grated corn over the flour mixture, and, working gently with your hands, begin tossing everything together until the ingredients form a cohesive dough. Crumble the batter over the surface of the berries, and using a pastry brush, brush the top generously with the heavy cream. Sprinkle the batter evenly with the turbinado sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the baking dish on a sheet pan to catch any potential overflow, transfer to the oven and bake until the crust is golden and the blackberries are bubbling and thick, 35 to 40 minutes. Allow to cool at least 10 minutes before serving."}]}