{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Farro With Lentils, Tomato and Feta", "description": "This cold-weather comfort food is loaded with bright flavors and delightful textures. Farro and lentils cook in the same amount of time, so you can bake them together in a garlicky tomato sauce to yield silky, tender lentils and chewy, toothsome farro. For an extra nutty flavor, you can toast the farro first. To finish the dish, place large slices of feta on top and broil until the cheese slouches in the center and crisps at the edges, but you can also use mozzarella or Cheddar.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/01/16/dining/as-baked-farro/as-baked-farro-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, grains and rice, vegetables", "keywords": "fall, spring, winter, farro, feta, lentils, tomato, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 565}, "recipeIngredient": ["1 cup farro", "1/2 cup dried green or brown lentils", "2 tablespoons extra-virgin olive oil, plus more for drizzling", "1 large yellow onion, coarsely chopped", "Kosher salt and black pepper", "4 garlic cloves, thinly sliced", "1 teaspoon red-pepper flakes", "1 (28-ounce) can tomato purée (or substitute your favorite tomato sauce)", "2 sprigs oregano, thyme, rosemary or basil, or 1/2 teaspoon dried (all optional)", "1 (8-ounce) block feta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and place one rack 6 inches from the broiler. Place the farro in an 8-by-8-inch (or 2-quart) broiler-proof baking dish and transfer to the oven to toast, 10 to 15 minutes. Remove the dish from the oven and scatter the lentils over the farro."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the farro toasts, make the tomato sauce: In a medium saucepan over medium-high heat, warm the 2 tablespoons olive oil. Add the onion, season with salt and pepper, and cook, stirring occasionally, until softened, 5 to 7 minutes. Add the garlic and red-pepper flakes and cook until fragrant, 1 to 2 minutes. Add the tomato purée, herb sprigs (if using), and 2 1/2 cups water. Season with salt and pepper, and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently pour the tomato sauce over the lentils and farro and stir to combine. Bake, stirring halfway through, until the lentils and farro are tender, 40 to 50 minutes. If at any point the mixture looks dry, add 1/4 cup water. Meanwhile, cut the feta into 1/4-inch slices and break each piece in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dish from the oven and turn on the broil setting. Stir the lentils and farro once more, discard the herb sprigs (if using), then top with the slices of feta. Drizzle with olive oil and broil until the feta is molten and charred in spots, 6 to 8 minutes. (Depending on your broiler, you may need to rotate the pan after 2 or 3 minutes, for even cooking.)"}]}