{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheveed Polo (Dill Rice)", "description": "This dish is a simple way to make use of a whole bunch of dill and transform an ordinary pot of plain rice. Naz Deravian, the author of “Bottom of the Pot: Persian Recipes and Stories” (Flatiron Books, 2018), uses a mix of fresh and dried dill here. The dried dill enhances the fragrance and also draws out the humidity from the fresh dill so the rice doesn’t turn mushy when steaming. This recipe uses a traditional Persian technique for cooking rice in which you boil the rice for several minutes over high heat, wrap the lid in a kitchen towel to catch the condensation, then steam the rice over low heat for several minutes more. Don't worry; it won't be overcooked. It will be fluffy perfection. Serve it with chicken or seafood, like this <a href=\"https://cooking.nytimes.com/recipes/1020253\">roasted dill salmon</a>.", "author": {"@type": "Person", "name": "Naz Deravian"}, "image": "https://static01.nyt.com/images/2019/05/22/dining/nd-sheveed-polo/merlin_154348143_542cc6cf-4c27-4692-bcea-6be80dc7e7ef-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "middle eastern", "recipeCategory": "grains and rice", "keywords": "basmati rice, dill, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 193}, "recipeIngredient": ["1 large bunch dill, trimmed and finely chopped", "3 tablespoons dried dill", "2 cups white basmati rice, rinsed", "2 tablespoons unsalted butter or olive oil", "2 teaspoons kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 1/4 cup of the chopped fresh dill. In a bowl, combine the rest of the fresh dill with the dried dill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice, butter and salt in a medium pot. Add 3 1/2 cups water and bring to a boil over high heat. Give it a stir, reduce the heat to low, cover and cook until the water has been absorbed, about 12 minutes. (It’s O.K. to lift the lid to check.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the dill mixture into the rice. Wrap the lid in a kitchen towel to catch the condensation, ensuring that the kitchen towel is secured up top so it doesn’t catch fire. Firmly place the lid back on the pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until the rice is cooked through and fluffy, about 15 minutes more. Gently fluff with a spoon, then transfer to a serving platter, scattering the reserved 1/4 cup fresh dill in between spoonfuls of rice."}]}