{"@context": "http://schema.org", "@type": "Recipe", "name": "Jeweled Grains With Broccoli, Peas and Red Onion", "description": "Inspired by <a href=\"https://cooking.nytimes.com/recipes/12377-david-taniss-persian-jeweled-rice\">Persian jeweled rice</a> and grain bowls, this dish combines brown rice, farro and black sticky rice with a jumble of shaved broccoli, pickled red onion, pistachios, sunflower seeds and dried cranberries. When cooking multiple grains, pick ones that more or less require the same grain-to-water ratio and cook time so you can cook them all together in the same pot. This dish can be served warm, cold or at room temperature, served over salad greens or topped with flaky fish. It is endlessly adaptable based on the season or the contents of your fridge.", "author": {"@type": "Person", "name": "Corinne Trang"}, "image": "https://static01.nyt.com/images/2019/04/11/dining/ct-jeweled-grains-with-broccoli/merlin_152756013_a042fd35-644c-435f-966b-e70c29f38323-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, lunch, grains and rice, salads and dressings, vegetables", "keywords": "broccoli, brown rice, farro, ginger, sticky rice, fall, spring, summer, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 157}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "482 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup farro, rinsed", "1/2 cup short-grain brown rice, rinsed", "1/4 cup black sticky rice, rinsed", "1/2 cup frozen peas", "1 small red onion, peeled, halved and very thinly sliced", "1 teaspoon agave nectar or honey", "5 tablespoons unseasoned rice vinegar", "Kosher salt and black pepper", "3 tablespoons tamari or soy sauce", "1 tablespoon grapeseed oil", "2 teaspoons toasted sesame oil", "1 (1-inch) piece fresh ginger, peeled and finely grated", "1 large or 2 small heads broccoli", "1/3 cup raw or roasted unsalted pistachios", "1/4 cup raw or roasted unsalted sunflower seeds", "1/2 cup dried cherries or cranberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot, add the farro, brown rice, black rice and 1 1/2 cups water. Stir to combine the grains, then bring to a boil over medium-high. Reduce the heat to medium-low, cover and cook until the grains are tender yet chewy, about 20 minutes. Remove from the heat. Scatter the peas on top, cover and let sit, 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, toss the red onion and agave with 2 tablespoons vinegar; season with salt and pepper to taste. Let macerate, 20 minutes. Drain the onions before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, stir together the remaining vinegar, tamari, grapeseed oil, sesame oil and ginger. Holding the broccoli stalk firmly in one hand and working over the large bowl, use a sharp knife to shave the floret end into a rough dust, chopping until you reach mostly stalk. (Reserve the stalks for another use.) Add the pistachios, sunflower seeds and tart cherries to the bowl and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fluff the grains and peas with a fork and transfer to the bowl; toss to coat. Garnish with the pickled onions."}]}