{"@context": "http://schema.org", "@type": "Recipe", "name": "Watermelon-Rose Trifle", "description": "This trifle is inspired by one of Sydney’s most exquisite cakes — layers of almond dacquoise, ripe watermelon and rose-flavored cream, covered in strawberries. The pastry chef Christopher Thé invented it for a friend’s wedding, and after he introduced it to Black Star Pastry, the cake became a huge hit. Treating it like a trifle means you can be a little messier, and it’s O.K.: The cake still comes together beautifully.", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2019/05/05/magazine/05mag-eat-slideshow-slide-NHZH/05mag-eat-slideshow-slide-NHZH-articleLarge.png", "totalTime": "PT2H15M", "recipeYield": "8 servings", "recipeCuisine": "australian", "recipeCategory": "cakes", "keywords": "almond, confectioners' sugar, pistachio, rose water, strawberries, watermelon, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 411}, "recipeIngredient": ["1 small seedless watermelon (about 3 1/2 pounds)", "1 tablespoon rose water", "2 tablespoons granulated sugar", "Cooking spray", "1 1/2 cups/185 grams blanched whole or slivered almonds", "1 1/4 cups/155 grams confectioners’ sugar", "5 egg whites", "2/3 cup/135 grams granulated sugar", "2 cups/475 milliliters heavy cream", "1/4 cup/50 grams granulated sugar", "1 tablespoon rose water", "2 cups/300 grams fresh strawberries, thickly sliced", "2 tablespoons granulated sugar", "1 tablespoon rose water", "1 tablespoon pistachios, sliced", "1 tablespoon organic dried rose petals"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the watermelon: Use a serrated knife to carefully remove the watermelon rind, then cut the watermelon into 1/2-inch-thick slices. Transfer slices to a wire rack. Sprinkle rose water and sugar on top, and let the fruit macerate for about 30 minutes. Pat dry on both sides with paper towels, and cut into 2-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the almond dacquoise: Heat the oven to 400. Line a 13-by-18-inch baking sheet with parchment paper; grease the top of the parchment paper with cooking spray. Put the almonds in a food processor, and process until finely ground. Transfer 1 cup ground almonds to a medium bowl, and stir in the confectioners’ sugar. In a stand mixer fitted with the whisk attachment, beat the egg whites on high until soft peaks form, about 90 seconds, then gradually add the granulated sugar and continue beating until the mixture is stiff and shiny, about 2 minutes. Fold in the almond mixture, transfer the mixture to the prepared baking sheet, and spread out in an even layer. Bake until light golden, about 10 to 15 minutes, then set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the rose cream: In a stand mixer fitted with a whisk attachment, beat the cream and sugar on medium until soft peaks form, about 2 minutes. Add the rose water, and continue whipping just until the mixture forms stiff peaks, another 1 or 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Invert the dacquoise onto a cutting board, then peel off and discard the parchment paper. If the outer edges of the dacquoise have browned and are crisp, trim them off (to snack on!). Cut the cake into 2-inch squares. Use about half the cake pieces to cover the bottom of a 9-by-13-inch glass baking dish. Spread 1/3 of the rose cream over the cake, then scatter with half the ground almonds. Add watermelon pieces to cover (you can eat any watermelon that remains after this), then sprinkle with the remaining ground almonds. Spread half the remaining rose cream over the watermelon, and top with remaining cake pieces. Finish with all the rose cream, and place in the fridge to firm up for at least 1 hour (or up to overnight)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, mix the strawberries, sugar and rose water in a medium bowl. Scatter on top of the cake, and sprinkle with pistachios and rose petals. To serve, scoop the trifle into bowls."}]}