{"@context": "http://schema.org", "@type": "Recipe", "name": "Crawfish and Shrimp Pot With Spiced Sweet Potatoes", "description": "Plentiful throughout the Gulf Coast, crawfish and shrimp are Choctaw staples and traditional seasonings like filé, the spice ground from dried sassafras bark, and spicy chiles are a perfect accompaniment. Here, the crustaceans rest on a bed of spicy sweet potatoes, in a dish that calls back to traditional feasts and community gatherings. The sassafras adds a grassy, slightly sour note, and the berries bring more color and tang. You can vary the shellfish depending on the season and your locale in this festive dish, which is easily doubled to serve a crowd.", "author": {"@type": "Person", "name": "Sean Sherman"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex10/merlin_163486104_13bc6535-1da5-448b-989d-6dda6db64247-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "blackberries, crawfish, dandelion greens, file powder, jumbo shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "recipeIngredient": ["1 tablespoon red-pepper flakes, plus more as needed", "1 tablespoon coarse sea salt, plus more as needed", "2 pounds crawfish", "1 pound head-on jumbo shrimp", "2 tablespoons sunflower oil", "1 cup chopped yellow onion", "1 small orange or purple sweet potato, unpeeled, cut into 1/2-inch cubes", "2 tablespoons New Mexico red chile powder or chipotle chile powder", "1 tablespoon filé powder", "1/2 cup fresh or thawed frozen blackberries", "1/2 packed cup sliced dandelion greens (or other dark greens such as arugula or spinach), plus whole leaves reserved for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the red-pepper flakes, salt and 3 quarts water to a large pot. Bring to a boil over high heat. Add the crawfish and shrimp, return to a boil, then lower the heat and simmer until the shellfish is deep red, about 10 minutes, skimming off any foam that rises to the surface. Turn off the heat, cover and let stand for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the vegetables: In a large skillet, heat the oil over medium-high. Add the onion and sauté until it begins to soften, about 3 minutes. Add the sweet potato, chile powder, filé powder and 2 cups of the shellfish cooking water and bring to a boil. Reduce the heat to medium and simmer until the sweet potatoes are tender, stirring occasionally, 8 to 10 minutes. Stir in the blackberries and sliced greens and cook for 1 to 2 minutes. Using the back of a fork or the tip of a wooden spoon, mash the blackberries gently and season the mixture to taste with coarse sea salt and red-pepper flakes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the vegetables onto individual plates or a large platter. Strain the crawfish and shrimp mixture, then arrange the cooked shellfish on top of the vegetables. Garnish with the reserved leaves."}]}