{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Chili With Butternut Squash and Moroccan Spices", "description": "This Moroccan-inspired take on vegetable chili is not so much spicy as it is spiced, using ingredients you’re likely to have stocked in your pantry. In place of the same old kidney beans, this recipe uses butternut squash, cauliflower and chickpeas, making it a lighter, fresher update on the classic dish. Like any good pot of chili, this is even better reheated the next day.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2019/11/26/dining/lh-vegetarian-chili-with-butternut-squash/lh-vegetarian-chili-with-butternut-squash-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot, soups and stews, vegetables", "keywords": "butternut squash, cauliflower, chickpea, crushed canned tomatoes, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 521}, "recipeIngredient": ["3 tablespoons olive oil", "1 large yellow onion, chopped (about 2 cups)", "1 1/2 teaspoons ground chili powder", "1 1/2 teaspoons ground sweet or hot paprika", "1 teaspoon ground cumin", "1/2 teaspoon ground cinnamon", "1 tablespoon minced garlic (about 3 cloves)", "1 (2- to 2 1/2-pound) butternut squash, peeled, seeded and cut into 1/2-inch cubes", "2 (15-ounce) cans chickpeas, drained and rinsed", "4 cups low-sodium vegetable broth", "1 (28-ounce) can crushed tomatoes", "1 tablespoon tomato paste", "2 teaspoons brown sugar", "2 teaspoons kosher salt, plus more to taste", "1/2 medium head cauliflower, trimmed and cored", "Plain yogurt or sour cream, for serving (optional)", "Thinly sliced scallions, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy-bottomed pot or Dutch oven, heat the olive oil over medium. Add the onions, chili powder, paprika, cumin and cinnamon, and cook until tender, stirring often and lowering the heat as necessary to keep the spices from burning, 6 to 8 minutes. Add the garlic and cook, stirring, until fragrant, about 1 minute. (Be careful not to let the garlic burn.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the squash, chickpeas, broth, tomatoes, tomato paste, brown sugar and 2 teaspoons salt, and bring to a boil over medium-high heat. Reduce the heat to low and simmer, partially covered, for 20 minutes. Meanwhile, cut the cauliflower into bite-size florets, trimming and discarding any long stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cauliflower to the pot and simmer uncovered, stirring occasionally, until the chili is thick and the vegetables are very tender, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season to taste with salt, and serve hot, with yogurt and scallions, if desired."}]}