{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Chicken and Pearl Couscous With Moroccan Spices", "description": "This one-pan meal, which is inspired by the tagines of North Africa, is prepared in a deep skillet or Dutch oven instead of the traditional clay pot. Briefly marinate bone-in chicken thighs in lime juice, garlic, cumin and olive oil, then brown and set aside. (If you’re short on time, skip the marinade; simply add the ground cumin when you’re toasting the other spices in the chicken fat.) Stir in harissa, cinnamon and turmeric, toast until fragrant, then add quick-cooking pearl couscous and the chicken, so everything finishes cooking together. Top the finished dish with a fistful of roughly chopped tender herbs and lime zest for a jolt of brightness.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2020/03/25/dining/ch-moroccan-chicken/merlin_170016399_a730fbd8-51fd-4700-b061-3b3e573076e6-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot, poultry", "keywords": "chicken thigh, couscous, cumin, leek, lime, fall, spring, winter, main course", "aggregateRating": null, "recipeIngredient": ["2 1/2 pounds bone-in, skin-on chicken thighs (about 6 thighs)", "1 teaspoon fresh lime zest plus 1/4 cup juice (from 2 limes)", "3 tablespoons olive oil", "3 large garlic cloves, roughly chopped", "1 1/2 teaspoons ground cumin", "Kosher salt and black pepper", "2 tablespoons grapeseed or canola oil", "1 large leek, trimmed, rinsed of grit then thinly sliced into rings (about 1 1/2 cups), or 1 medium yellow onion, chopped", "1 tablespoon harissa paste, tomato paste or chile-garlic sauce", "1 teaspoon ground turmeric", "1/2 teaspoon ground cinnamon", "1 1/4 cups pearl couscous or orzo", "1 1/2 cups chicken stock or vegetable stock", "1/2 cup roughly chopped mixed tender herbs such as parsley, cilantro and mint (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the chicken thighs, lime juice, olive oil, garlic and cumin. Season well with salt and pepper and stir together until the chicken is well coated in the marinade; set aside at room temperature for 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep, 12-inch skillet or Dutch oven with a lid, heat the grapeseed or canola oil over medium-high. When it shimmers, lift the chicken out of the marinade, allowing any excess liquid to drip back into the bowl, then add the chicken to the skillet, skin-side down. Working in batches, if necessary, to avoid crowding the pan, cook until the chicken is well browned on both sides, about 6 minutes per side. Remove and set aside on a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium, add the leek and cook, stirring occasionally, until soft and translucent, 3 to 4 minutes, scraping up any brown bits that have formed on the bottom of the pan. Stir in the harissa paste, turmeric and cinnamon, and cook until lightly toasted, 1 to 2 minutes. Season well with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the couscous to the pan and stir until well coated in the spiced leek oil. Add the stock and bring to a boil. Turn heat to low and add the chicken back to the pan, skin-side up, along with any accumulated juices. Cover and simmer until the couscous is al dente and the chicken is cooked through, 10 to 15 minutes. If you’re lucky, some of the couscous may slightly stick to the bottom of the pan, creating well-seasoned crispy bites."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and remove the lid. Scatter with the herbs, if using, and the lime zest, then serve from the pan."}]}