{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach and Feta Borek", "description": "In Turkey, savory pastries like these are made with hand-rolled yufka sheets, but store-bought phyllo dough makes a fine substitute. Often shaped into bite-size parcels, this large version may be cut into wedges. Serve it with a salad of sliced cucumber and radishes, and a bowl of olives, if desired.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/01Tanisrex1/merlin_163467639_ef6d8861-c0bb-4148-9efa-cb56c967b73d-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "turkish", "recipeCategory": "dinner, lunch, weekday, pies and tarts, vegetables", "keywords": "appetizer, main course, dill, feta, manchego, parsley, scallion, spinach, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 183}, "recipeIngredient": ["1 pound baby spinach or other cooking greens, sliced into 1/2-inch ribbons", "1 cup chopped parsley (from 1 small bunch)", "1 cup chopped fresh dill (from 1 small bunch)", "6 scallions, thinly sliced (about 3/4 cup)", "1 teaspoon dried oregano", "4 eggs, beaten", "Kosher salt and black pepper", "1/2 teaspoon Maras pepper or regular red-pepper flakes", "8 ounces crumbled feta (about 2 cups)", "4 ounces grated Manchego or other sheep’s milk cheese (1 cup)", "1/2 cup extra-virgin olive oil, plus more as needed", "6 sheets phyllo dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Make the filling: In a large bowl, combine spinach, parsley, dill, scallions, oregano and eggs and stir to incorporate. Season with salt and pepper, then add Maras pepper, feta and Manchego, and stir well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush a 10-inch pie plate or skillet with lightly with olive oil. (You can also use a 9-by-13-inch pan for a rectangular pie.) Line with 1 sheet of phyllo, letting the excess fall over the sides of the pan. Brush phyllo lightly with olive oil, then follow with 2 more sheets, brushing each with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the filling into the phyllo-lined pan, spreading it to the edges with the back of a spoon. Top with 3 more sheets of phyllo, brushing each sheet with olive oil before adding the next."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the ends of the phyllo back over the top and toward the center of the borek, and brush with oil. With the palm of your hand, press down on top layer to make the pie compact. (Alternatively, roll the excess toward the center to form a rim.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 minutes, until golden. Let rest for a few minutes before cutting into wedges. The borek is also good served at room temperature."}]}