{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Pepper Beef and Cabbage Stir-Fry", "description": "Coarsely crushed black peppercorns star in this quick weeknight dish, which is built primarily from pantry staples. Don’t be shy about adding the entire tablespoon of pepper, as it balances out the richness of the beef and adds a lightly spicy bite to the dish. A quick rub of garlic, brown sugar, salt, pepper and cornstarch seasons the beef; the cornstarch helps tenderize the beef and later imparts a silky texture to the sauce. Feel free to marinate the beef up to 8 hours ahead and cook when you're ready. If leftovers remain, tuck them into a crunchy baguette or roll them into a wrap.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/sl-cabbage-stir-fry/sl-cabbage-stir-fry-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 to 4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, quick, weeknight, steaks and chops, vegetables", "keywords": "cabbage, cornstarch, pepper, peppercorns, rice, scallion, sirloin steak, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 619}, "recipeIngredient": ["1 tablespoon whole black peppercorns, coarsely crushed with the bottom of a cup or pan<strong></strong>", "3 garlic cloves, grated", "2 teaspoons light brown sugar", "1 teaspoon cornstarch", "Kosher salt", "3/4 pound sirloin steak, thinly sliced crosswise", "3 tablespoons sunflower oil or other neutral oil", "2 tablespoons soy sauce", "1/2 head small green cabbage (about 8 ounces), thinly sliced", "1 tablespoon sherry vinegar", "1 tablespoon toasted sesame seeds, crushed with your fingertips", "2 scallions, thinly sliced", "Cooked rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add peppercorns, garlic, brown sugar, cornstarch and 1 teaspoon salt to a medium bowl and stir to combine. Add sliced steak and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large cast-iron skillet over medium-high. Add steak and cook, stirring frequently, until some of the edges are lightly browned, 3 to 4 minutes. Add soy sauce and toss beef to coat, about 1 minute. Using a slotted spoon, transfer beef to a bowl or plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cabbage to skillet, spread in an even layer and let cook, undisturbed, for 1 minute so that some pieces caramelize in the pan. Toss and cook cabbage, stirring occasionally, until crisp-tender, 4 to 6 minutes. Stir in vinegar and season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add steak and any juices back to the skillet, and stir until well combined with the cabbage and warmed through, about 1 minute. Top with toasted sesame seeds and scallions; serve with rice."}]}