{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Chicken Pita With Yogurt Sauce and Arugula", "description": "You might need a few common ingredients from the grocery store — chicken breast, cucumbers, yogurt, herbs — to make this satisfying pita sandwich, but it’s not at all difficult to put together. It’s a year-round favorite. If you’re in the mood to bake, try making your own <a href=\"https://cooking.nytimes.com/recipes/1016071-homemade-pita-bread\">pita bread</a>.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2020/04/03/dining/03Tanisrex2-pita/merlin_171108072_31d5bba0-dda2-4daf-b55b-305335c210a1-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "lunch, sandwiches", "keywords": "chicken breast, cucumber, olives, yogurt, main course", "aggregateRating": null, "recipeIngredient": ["2 boneless, skinless chicken breasts (about 8 ounces each)", "Salt and pepper", "Extra-virgin olive oil", "1 cup plain yogurt", "1/4 cup chopped green and black olives", "1/2 cup chopped cucumbers, from 2 small Persian cucumbers", "1 tablespoon chopped mint", "1 tablespoon chopped parsley", "1 garlic clove, grated or very finely minced", "Pinch of dried oregano", "1/2 teaspoon sumac (or a little grated lemon zest)", "Pinch of red-pepper flakes", "4 whole-wheat pita breads", "A large handful of arugula, watercress or other salad greens"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken breasts on both sides with salt and pepper and rub with a little olive oil. Bring to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a cast-iron pan or a stovetop grill pan over medium-high heat. When pan is hot, add chicken breasts, lower heat to medium and cook gently for about 3 to 4 minutes on each side, until firm to the touch. (To keep meat moist, do not overcook.) Set aside to rest and cool to room temperature, then slice crosswise at a diagonal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, mix together yogurt, olives, cucumber, mint, parsley, garlic, oregano, sumac and red-pepper flakes. Season with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat pita breads in toaster oven or a dry skillet over medium-high. Cut each pita in half to make half-moon pockets. Fill each pocket with chicken, yogurt sauce and arugula. Serve with extra sauce on the side."}]}