{"@context": "http://schema.org", "@type": "Recipe", "name": "Tofu Scramble", "description": "This quick scramble is a combination of flavors and textures that will surprise and delight tofu-lovers and doubters alike. Soy sauce, turmeric and cumin provide bold seasoning, while searing the block of tofu on both sides before breaking it up yields plenty of crispy bits as well as tender ones. You can add cooked vegetables, leafy greens, beans, cheese or nutritional yeast with the scallions in Step 4, though you may want to increase the seasoning depending on the amount of extras you add. You can also swap in hot sauce, mustard or tahini for the soy sauce and play around with spice combinations, but don’t skip the splash of water — it helps the tofu soak up all the flavors. Serve with toast, tortillas, salad or breakfast potatoes.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/05/20/dining/as-tofu-scramble/merlin_154348539_7e56f903-a468-4584-851d-a97308aded59-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "beans", "keywords": "cumin, scallion, soy sauce, tofu, turmeric, main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 232}, "recipeIngredient": ["1 (14-ounce) block firm or extra-firm tofu", "1 tablespoon low-sodium soy sauce or tamari", "1/2 teaspoon ground turmeric", "1/2 teaspoon ground cumin", "Kosher salt and black pepper", "2 tablespoons canola oil", "2 scallions, trimmed and thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the block of tofu in half horizontally as you would a hamburger bun. Pat both pieces dry and wrap in paper towels. If time allows, press the tofu by placing a cast-iron skillet or other heavy object on top of the wrapped tofu for about 30 minutes. (This helps remove moisture so the tofu retains its shape better during cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a measuring cup or bowl, combine the soy sauce, turmeric and cumin with 2 tablespoons water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unwrap the tofu and season on all sides with salt and pepper. Heat the oil in a medium skillet over medium-high. Add the tofu blocks and cook until golden brown and crisp on the bottom, 3 to 4 minutes. Flip the tofu and cook until golden brown and crisp on the other side, another 3 to 4 minutes. If the tofu is emitting water, hold the tofu with a spatula and pour the water out of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat to medium. Using a spatula or wooden spoon, break up the tofu into chunks. Add the scallions and the seasoning mixture and cook, stirring and continuing to break up the tofu, until absorbed, about 2 minutes. Serve immediately."}]}