{"@context": "http://schema.org", "@type": "Recipe", "name": "Soft-Boiled Eggs With Anchovy Toast", "description": "<i>This is a no-recipe recipe, a recipe without an ingredients list or steps. It invites you to improvise in the kitchen.</i>\n\nIf you’re up for a delicious, slightly sporty breakfast, you might consider making some anchovy butter tonight. Take a stick of unsalted butter, and let it soften on the counter while you assemble the other ingredients: a tin of anchovies, some garlic cloves, a shake or two of smoked or regular paprika, a wee splash of lemon juice and maybe, but probably not, some salt. Rinse and mince the little fish, mince the garlic, and fork everything together into the butter to taste.\n\nThen, come morning, you can slather toast with the result and serve it with soft scrambled eggs or, better yet, soft-boiled eggs, a breakfast I once had in London at a hotel and restaurant the chef Fergus Henderson was running in Leicester Square. Make sure you spread the butter “wall to wall.” That is a vernacular phrase of the chef Gabrielle Hamilton. It means to cover the entire surface of the bread from edge to edge — an important step in buttering, one that is too often shirked.\n\n<i>Sam Sifton features a no-recipe recipe every Wednesday in his What to Cook newsletter. <a href=\"https://www.nytimes.com/newsletters/cooking\">Sign up to receive it.</a> You can find more no-recipe recipes <a href=\"https://cooking.nytimes.com/68861692-nyt-cooking/14326423-no-recipe-recipes\">here</a>.</i>", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/02/17/dining/17NORECIPE-EGG-ANCHOVY-TOAST/17NORECIPE-EGG-ANCHOVY-TOAST-articleLarge.jpg", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, weekday, seafood", "keywords": "anchovies, egg, garlic, toast, appetizer, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 244}, "recipeIngredient": [], "recipeInstructions": null}