{"@context": "http://schema.org", "@type": "Recipe", "name": "Cocoa Nib Sablés With Flaky Sea Salt", "description": "Slightly more tender than shortbread cookies, golden French sablés have a deep buttery flavor and an appealing sandy texture. These are studded with crunchy cocoa nibs (also called cacao nibs), which lend a bittersweet flavor that’s underscored by a drizzle of melted chocolate on top. If you don’t have cocoa nibs, you can substitute mini chocolate chips, which make these cookies even richer.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/02/12/dining/11Chocolaterex-sables1/merlin_168265335_eab81751-f08e-4dfb-8811-c9c315d0499b-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 2 dozen", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "bittersweet chocolate, cacao nibs, coconut oil, salted butter, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "recipeIngredient": ["1 cup/225 grams salted European-style (cultured) butter (2 sticks), at room temperature", "3/4 cup/95 grams confectioners’ sugar", "1 large egg yolk", "2 teaspoons vanilla extract", "1/8 teaspoon fine sea salt", "2 1/2 cups/320 grams all-purpose flour", "1/2 cup/65 grams cocoa nibs or mini chocolate chips", "2 ounces bittersweet chocolate, chopped", "1/4 teaspoon coconut oil", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment or beaters, beat together butter and confectioners’ sugar until smooth and fluffy. Beat in egg yolk, vanilla and fine sea salt until combined. Beat in flour until just combined, then fold in cocoa nibs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape dough into a 1-inch-thick disk, wrap with plastic wrap, and chill for at least 1 hour and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Between two sheets of parchment paper, roll dough until it’s 1/4-inch thick, then chill the dough for at least 30 minutes or until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Position racks in the top and bottom thirds of the oven, and heat oven to 325 degrees. Line 2 cookie sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a 2-inch round cutter to cut out cookies, and transfer to lined cookie sheets. Re-roll and cut scraps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cookies until they are puffed and deeply golden, 18 to 25 minutes, rotating and switching the cookie sheets on racks halfway through. Cool cookies on the baking sheets for 5 minutes, then use a spatula to transfer them to wire racks to finish cooling completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bittersweet chocolate in a small bowl with the coconut oil. Melt the chocolate in the microwave in 30-second bursts, stirring after each burst. Alternatively, place the bowl over a pot of simmering water, and stir until chocolate is smooth and melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a fork, drizzle the chocolate over the cooled cookies. Sprinkle with flaky sea salt while the chocolate is still melted. Let set for at least an hour or two before serving cookies. Or store in an airtight container, between layers of parchment or wax paper, for up to 3 days."}]}