{"@context": "http://schema.org", "@type": "Recipe", "name": "Tangy Pork Noodle Salad With Lime and Lots of Herbs", "description": "This light, bright salad, full of lettuce, leafy herbs and silky rice noodles, is seasoned with just enough ground pork to add richness without weighing it down. The fish sauce and citrus juices make it intense and tangy, while the honey softens its gingery bite. This salad is best served when freshly made and still very crisp, but won’t suffer much from sitting out for an hour or two.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/08/16/dining/16apperex01/merlin_159056964_90d9294d-846b-443c-b440-acd665dd5831-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "weekday, noodles", "keywords": "cilantro, ginger, ground pork, lime, mint, rice noodles, romaine, serrano pepper, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 356}, "recipeIngredient": ["1 teaspoon finely grated lime zest", "2 1/2 tablespoons fresh lime juice, plus more to taste", "2 tablespoons fresh orange juice", "2 tablespoons fish sauce, plus more as needed", "1 tablespoon honey", "Fine sea salt", "4 tablespoons grapeseed or safflower oil", "1/2 cup thinly sliced shallot (1 large)", "6 ounces pad Thai or other flat rice noodles", "2 garlic cloves, finely grated or mashed to a paste", "1 (2-inch) piece ginger, peeled and grated (about 2 teaspoons)", "1 Thai or serrano chile, thinly sliced and seeded if you like", "1 pound ground pork (or turkey)", "1 cup thinly sliced cucumbers", "2 scallions, white and green parts, sliced", "1 1/4 cups cherry tomatoes, halved", "1 cup mung or other bean sprouts (or 1 cup lettuce)", "1 packed cup mint leaves", "1 packed cup cilantro or basil sprigs, or a combination", "2 cups shredded romaine or other crisp lettuce", "Red-pepper flakes, for serving", "Lime wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together lime zest and juice, orange juice, 2 tablespoons fish sauce, honey and a small pinch of salt. Pour half of the mixture into a large bowl and whisk in 3 tablespoons grapeseed oil and the shallots. Set both mixtures aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook noodles in salted water and according to package directions. Rinse under running water to remove any excess starch, then drain well and add to bowl with shallots, tossing well. Set aside while preparing remaining ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining 1 tablespoon grapeseed oil in a large skillet over medium-high heat. Add garlic, ginger and chile, and cook until lightly golden and aromatic, about 1 minute. Add pork and stir, breaking up pieces with a wooden spoon. Cook without stirring too often, until browned, about 8 minutes. Pour in lime juice mixture from the small bowl. Simmer gently until most of the liquid is evaporated, stirring to coat pork in the glaze, another 1 minute. Remove from heat and set aside to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pork, cucumbers, scallions, cherry tomatoes, bean sprouts and herbs to the noodles and toss well to combine. Taste and add more fish sauce, lime juice or both. Just before serving, toss in lettuce, and serve sprinkled with red-pepper flakes with lime wedges on the side."}]}