{"@context": "http://schema.org", "@type": "Recipe", "name": "Pancit Palabok (Rice Noodles With Chicken Ragout and Shrimp)", "description": "We eat pancit, or noodles, always — but especially at birthday celebrations, where the length of the noodles is seen as a promise for an equally long life. Among our many pancit dishes, palabok is the richest. The sauce almost takes on the texture of an Italian ragù, with the meat slowly disintegrating into a thick gravy that’s stained reddish-gold by achuete (annatto). The toppings aren’t decorative, but a crucial part of the dish: a whole regiment of hard-boiled eggs and poached shrimp, plus a tumble of fried garlic and crumbled chicharron (puffed-up crispy pork skins).", "author": {"@type": "Person", "name": "Angela Dimayuga"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/08Filipinorex8-pansit/merlin_160617849_c6545d58-d251-4ebc-8ebe-592849e14481-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "10 to 12 servings", "recipeCuisine": "filipino", "recipeCategory": "dinner, casseroles, grains and rice, noodles, poultry, seafood", "keywords": "annatto powder, banana leaves, calamansi, chicharron, chicken, rice vermicelli noodles, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 59}, "recipeIngredient": ["2 pounds bone-in, skin-on split chicken breasts (about 2 breasts)", "2 pounds bone-in, skin-on chicken thighs", "Kosher salt", "1 pound small shrimp (26/30 count), peeled and deveined", "6 eggs", "3 tablespoons neutral oil, such as canola", "3 tablespoons achuete annatto powder (3/4 ounce)", "2 large yellow onions, finely minced (about 3 1/2 cups)", "8 celery stalks, finely minced (about 3 cups)", "15 garlic cloves, finely minced", "Fish sauce, as needed", "1/2 teaspoon coarsely ground black pepper, plus more for garnish", "Banana leaves, for lining the serving dish (optional)", "16 to 18 ounces rice vermicelli noodles (ideally about the thickness of spaghetti, or whatever you can find!), cooked", "1 bunch scallions, thinly sliced", "3 calamansi, halved, or lemons, cut into wedges, seeds removed", "1 cup chicharron, crushed into small pieces", "A few tablespoons of crushed fried garlic"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken breasts and thighs to a large pot. Cover with about 8 cups water (the chicken should be fully submerged), add 3 tablespoons salt, and bring to a boil over high. Once the mixture comes to a boil, reduce heat to medium-low and simmer until meat is cooked through and can be ripped off the bone easily, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a bowl to cool, and reserve the cooking liquid. Once the chicken is cool enough to handle, discard the skin. Tear the chicken into bite-size pieces and shred into thin strands. Discard the bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the shrimp: Bring 4 cups water and 1 tablespoon salt to a boil in a medium saucepan. Once it comes to a boil, add the shrimp and cook just until pink and tender, about 2 minutes. Pour into a colander, straining and discarding the liquid, then quickly transfer the shrimp to a large bowl of ice water just until chilled, about 2 minutes. Strain shrimp, transfer to a bowl and refrigerate until use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the eggs: Bring a large saucepan of water to a boil over high with 1 teaspoon salt, and prepare an ice bath in a large bowl. Carefully drop in the eggs, one at a time, reduce the heat to a gentle simmer over low and cook, 9 minutes. Transfer eggs to the ice bath and let cool. Drain, then carefully peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over high until shimmering. Add the annatto powder and stir until toasted, slightly darkened and fragrant, about 1 minute. (The natural yellow food coloring dyes the oil a robust hue.) Add the onions, celery, garlic and 1 tablespoon salt, and cook, stirring occasionally, until softened, about 8 minutes. Deglaze with 4 cups reserved chicken stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shredded chicken and simmer, constantly mashing the chicken with a whisk to promote shredding until the chicken has braised and disintegrates into fine threads, and the sauce has thickened, about 30 minutes. Add fish sauce and black pepper to season."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large baking dish with banana leaves, if using. Add the cooked noodles to the dish, top with an even layer of warm chicken mixture, followed by most of the sliced scallions. Top with alternating rows of hard-boiled eggs (thinly sliced crosswise into rounds) and shrimp, squeezing about a half a lemon over the surface or calamansi juice if you have it. Then top with a crunchy mix of chicharron, fried garlic, a few more sliced scallions, a coarse crack of black pepper and remaining lemons or calamansi on the side, for serving."}]}