{"@context": "http://schema.org", "@type": "Recipe", "name": "Perfect Black and White Cookies", "description": "Tender, moist and scented with vanilla, almond and lemon, these classic confections popular all over the Midwest and the state of New York are more cake than cookie, with a fine crumb and velvet texture from the sour cream in the batter. Even better, they are glazed with both vanilla and chocolate, so you don’t have to pick favorites. These are best eaten within 24 hours of baking, when the cake is at its softest and the glaze at its snappiest. But if you store them in an airtight container at room temperature, they’ll be good for a few days longer.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/07/09/dining/mc-black-and-white-cookie/mc-black-and-white-cookie-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 to 14 cookies", "recipeCuisine": "american", "recipeCategory": "cookies and bars", "keywords": "cocoa powder, sour cream, unsweetened chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 449}, "recipeIngredient": ["2 cups/255 grams all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon fine sea salt", "1/4 teaspoon baking soda", "1/3 cup/80 milliliters sour cream or whole-milk yogurt", "1/3 cup/80 milliliters whole milk", "2 teaspoons vanilla extract", "1 teaspoon finely grated lemon zest", "1/4 teaspoon almond extract", "1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "3/4 cup plus 2 tablespoons/200 grams granulated sugar", "2 large eggs, at room temperature", "2 1/2 cups/300 grams confectioners’ sugar", "Boiling water, as needed", "1 1/2 tablespoons light corn syrup", "1 teaspoon vanilla extract", "Pinch of fine sea salt", "2 1/2 ounces/70 grams unsweetened chocolate, melted and cooled", "2 1/2 tablespoons unsweetened Dutch-process cocoa powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Arrange racks in top and bottom thirds, and line two rimmed baking sheets with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk together flour, baking powder, sea salt and baking soda. In a medium bowl, whisk together sour cream, milk, vanilla, lemon zest and almond extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the paddle attachment, beat together butter and granulated sugar until light and fluffy, about 5 minutes. Beat in eggs, one at a time, until combined, scraping the sides of the bowl as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce speed to low and beat in 1/3 of the flour mixture, then 1/3 of the sour cream mixture. Repeat until both mixtures are incorporated, scraping sides of bowl as necessary. (Mixture will be the consistency of thick poundcake batter.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dollop heaping 1/4-cup scoops of batter onto prepared baking sheets, spacing them 2 inches apart. (You should have 12 to 14 cookies.) Bake for 6 minutes. Rotate the baking sheets. Continue to bake until the cookies have firmed up and spring back when lightly pressed in the center, 6 to 9 minutes. (They’ll brown only on the bottoms.) Take care not to overbake, or they will dry out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer baking sheets to wire racks and let cool for 15 minutes, then transfer cookies directly to racks to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cookies cool, make the glaze: Place the confectioners’ sugar in a medium bowl and whisk in 3 tablespoons boiling water, the corn syrup, vanilla and salt. Continue to whisk, adding more boiling water as needed, until you have a thick yet spreadable frosting that is the texture of hot fudge sauce. (Too thick is preferable to too thin.) Flip each cookie over and spoon glaze over half of its flat side, spreading to edges with the back of the spoon. Place on wire rack to set. You will have vanilla frosting left over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk melted chocolate into vanilla frosting, then whisk in cocoa and enough room temperature water to make a thick yet spreadable glaze. Glaze the bare half of each cookie. Let glaze set for at least 1 to 2 hours before serving."}]}