{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Yam Fries", "description": "Not to be confused with American sweet potatoes, West African yams are large, starchy root vegetables found at most West African, Caribbean or Latin American markets. Check the yams for freshness by pressing down on their skin before purchasing; the root should be firm with no soft spots. The brown skin peels off easily with a sharp knife or vegetable peeler to reveal a stark white flesh. These yams are larger, much starchier, denser and less fibrous than American yams or sweet potatoes. Crispy yam fries are a well-known Nigerian snack and side dish. They can be shallow-fried in oil or baked in the oven for a slightly healthier variation (see Tip). Serve fries warm with some <a href=\"https://cooking.nytimes.com/recipes/1020284-braised-bone-in-goat-leg-in-obe-ata\">obe ata</a> or your favorite condiment on the side.", "author": {"@type": "Person", "name": "Yewande Komolafe"}, "image": "https://static01.nyt.com/images/2019/06/26/dining/24Nigerianrex8/24Nigerianrex8-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "african", "recipeCategory": "dinner, snack, vegetables", "keywords": "side dish, yams", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 14}, "recipeIngredient": ["Kosher salt", "1 medium West African yam (about 2 pounds)", "4 to 6 cups canola or other neutral oil, for frying", "<a href=\"https://cooking.nytimes.com/recipes/1020284-braised-bone-in-goat-leg-in-obe-ata\">Obe ata</a> or your preferred condiment, for dipping (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil over high and season generously with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with water. Working quickly to avoid oxidation, slice off the ends of the yam and peel the brown skin. Cut the yam into 3/4-inch-thick rounds and transfer to the bowl. Once sliced and peeled, cut each piece into 1/2-inch-wide matchsticks, slicing a few rounds at a time and transferring matchsticks back to the water. (You should get about 5 to 8 sticks per piece.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, drop the matchsticks into the simmering water and blanch for 2 to 3 minutes. Remove from the hot water and transfer to a rack set over a baking sheet to drain. Repeat the blanching and draining process for the remaining matchsticks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large skillet with 1 inch of canola oil. (You’ll need about 4 cups for a 10-inch skillet.) Heat the oil over medium-high until it registers 350 degrees on an instant-read thermometer. Working in two or three batches to avoid crowding, and replenishing the oil as needed, fry the yam matchsticks, turning occasionally, until golden brown and crispy, about 10 to 12 minutes. Remove from oil and drain on a baking sheet set with paper towels or a rack. Season the fries with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve fries warm, with some obe ata or your preferred condiment for dipping."}]}