{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Rhubarb Trifle", "description": "Boozy, soggy, creamy, sweet and tart, this simple cake is somewhat like a tiramisù, since it is layered with ladyfingers. (But let’s not call it a tiramisù, because it’s really not authentic or traditional.) It’s more like a simplified trifle, as it has no custard sauce or whipped cream, but it’s rich and delicious nonetheless. Mascarpone and crème fraîche are whisked together for the creamy filling, and Campari, orange liqueur and brandy punch up the cooked rhubarb’s syrup. Look for store-bought ladyfingers, available in Italian shops and many supermarkets, or substitute good-quality poundcake or sponge cake. The trifle can be assembled up to a day in advance.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/05/24/dining/24kitchrex1/24kitchrex1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "crème fraîche, ladyfingers, mascarpone, rhubarb, dessert, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 114}, "recipeIngredient": ["1 1/2 pounds rhubarb, tough peels removed, cut into 3/8-inch pieces", "1 cup/200 grams plus 2 tablespoons granulated sugar", "2 tablespoons Cointreau or triple sec", "1 tablespoon Campari", "1 tablespoon brandy or Cognac", "1 cup/250 grams (8 ounces) mascarpone ", "1 cup/250 grams (8 ounces) crème fraîche", "1 teaspoon grated orange zest", "About 20 store-bought ladyfingers, or use poundcake or sponge cake", "Fresh rose petals, organic or unsprayed, for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. In an ovenproof dish, combine chopped rhubarb and 1 cup sugar, and bake, uncovered, for about 30 minutes, until rhubarb is softened and submerged in syrup. Drain rhubarb in a sieve or colander set over a saucepan to collect the syrup. Set rhubarb aside, and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place saucepan over medium-high heat. Add Cointreau and Campari and simmer until syrup has reduced to about 1/2 cup. Stir in brandy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put mascarpone and crème fraîche in a bowl. Add orange zest and the remaining 2 tablespoons sugar. Whisk mixture briefly to incorporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the trifle: Line the bottom of an 8- or 9-inch square glass or ceramic dish with ladyfingers. Break ladyfingers to fill completely. (If using poundcake or sponge cake, cut into 1/2-inch slices.) Spoon half the syrup evenly over the ladyfingers. Top with half of the cooked rhubarb, spreading it flat to the edges of pan. Spread half of the mascarpone mixture over rhubarb."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make another layer with half the ladyfingers and spoon remaining syrup over them. Spread remaining rhubarb on top, and top with the remaining mascarpone mixture. Cover with plastic wrap, and refrigerate for 2 hours or up to a day. A half-hour before serving, remove from refrigerator. Garnish with rose petals, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut trifle into squares and serve on plates, or use a large spoon to scoop portions into bowls."}]}