{"@context": "http://schema.org", "@type": "Recipe", "name": "Crabby Crab Cakes", "description": "Getting the most out of crab cakes often means putting the least into them. Since crab has the best texture and subtlest flavor of all crustaceans, the best crab cakes are those that showcase the crab, not another ingredient. The loose mix is best chilled before shaping, but it is essential to chill it again for a half-hour or so (longer is better) before cooking. When cold, the cakes will hold together, and once the egg, the binding agent, does its work, they will retain their shape until attacked with a fork.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 crab cakes", "recipeCuisine": "", "recipeCategory": "seafood", "keywords": "appetizer, main course, crab meat", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "recipeIngredient": ["1 pound fresh lump crab meat", "1 egg", "1 tablespoon Dijon mustard (optional)", "Salt and freshly ground black pepper to taste", "2 tablespoons flour, more for dredging", "2 tablespoons extra-virgin olive oil or neutral oil, like canola or grape-seed", "4 tablespoons butter (or use a total of 4 tablespoons oil)", "Lemon wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently combine crab, egg, mustard, salt, pepper and 2 tablespoons flour. Cover mixture, and put in freezer for 5 minutes. Shape mixture into 4 hamburger-shaped patties. Line plate with plastic wrap, and put crab cakes on it. Cover crab cakes with more plastic wrap, and refrigerate them for about 30 minutes (or as long as 1 day), or freeze for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put flour for dredging in a bowl. Combine oil and butter in 12-inch skillet, and turn heat to medium. When butter melts and its foam subsides, gently dredge a crab cake in the flour. Gently tap off excess flour, and add crab cake to pan; repeat with remaining crab cakes, and then turn heat to medium-high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, rotating cakes in pan as necessary to brown the first side, 5 to 8 minutes. Turn, and brown the other side (it will take slightly less time). Serve cakes hot, with lemon wedges."}]}