{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Mango Soba Salad With Peanut Dressing", "description": "Japanese buckwheat noodles are usually served cold or in a hot soup, but here, they’re given a bright jolt of color and texture. Delightfully chewy soba noodles are combined with chicken, mango, snap peas, cucumber and a spicy peanut dressing for a great warm-weather lunch that’s also picnic-friendly. Serve it alongside any grilled meat or fish, or leave the chicken out to make it vegetarian. To make this ahead, prepare all the salad components in advance, but wait until serving time to combine to keep flavors and textures vibrant.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/05/09/dining/ss-soba-salad/ss-soba-salad-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american, asian", "recipeCategory": "dinner, lunch, quick, noodles, poultry, vegetables", "keywords": "chicken, cilantro, ginger, mango, peanut butter, snap peas, soba noodles, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 210}, "recipeIngredient": ["1/2 cup smooth peanut butter, natural or regular", "1/4 cup hot water", "3 tablespoons low-sodium soy sauce", "2 tablespoons rice wine vinegar", "1 tablespoon sesame oil", "1 tablespoon finely grated fresh ginger", "1 tablespoon lime juice (from 1 lime)", "1/2 teaspoon Sriracha or other hot sauce", "Kosher salt and black pepper", "1/2 teaspoon granulated sugar (optional)", "10 ounces sugar snap peas (about 2 cups)", "8 ounces soba noodles", "2 cups shredded cooked chicken", "1 small or 1/2 large mango, peeled and thinly sliced", "2 mini cucumbers, thinly sliced (or 1/2 English cucumber)", "1 cup loosely packed fresh cilantro leaves", "2 Fresno chiles, thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. In a medium bowl, whisk peanut butter, hot water, soy sauce, rice wine vinegar, sesame oil, ginger, lime juice and Sriracha until smooth. Season to taste with salt. Add sugar, if using, and stir. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop the snap peas into the boiling water and cook until they just turn bright green, about 30 seconds. Using a mesh strainer or a spider (leave the water in the pot), transfer to a colander and rinse under cold water until cool. Drain and slice each pea lengthwise into 2 or 3 pieces. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return water to a boil and cook soba noodles according to package instructions. Drain and rinse under cold water until cool (if noodles get sticky, rinse again with cool water)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large serving bowl, toss noodles with the chicken, mango and peanut dressing. Add two-thirds of the snap peas, cucumbers, cilantro and chiles, reserving the rest for garnish. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, top with remaining snap peas, cucumbers, cilantro and chiles and serve immediately."}]}