{"@context": "http://schema.org", "@type": "Recipe", "name": "Toor Dal (Split Yellow Pigeon Peas)", "description": "Dal can be made with all kinds of lentils and cooking methods. These vary not just from region to region, but also from day to day, mood to mood. Some cooks like dal soupy, others chunky. There are dals for special occasions, seasoned with charcoal smoke and butter or padded out luxuriously with cream, as well as lighter, leaner dals that can restore you when you’re not feeling well.The flavor of this everyday, Gujarati-style dal comes from the pure nuttiness of split pigeon peas, boiled until tender and bolstered with spices bloomed in hot ghee. This fat-tempering technique, called vaghar in Gujarati, has many names and many uses across the country. In this case, the tempering is a great introduction to the resourcefulness and finesse of Indian home cooks: Just a few tablespoons of carefully seasoned fat, tipped in at the very last moment, transform an entire pot. ", "author": {"@type": "Person", "name": "Tejal Rao"}, "image": "https://static01.nyt.com/images/2020/03/11/dining/09Indianrex2/merlin_169212648_9575b8e9-ce0d-471e-bead-9283b7197dc4-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "4 to 6 servings (about 3 cups)", "recipeCuisine": "indian", "recipeCategory": "dinner, soups and stews", "keywords": "cinnamon, curry leaves, ghee, tomato, turmeric, yellow pigeon peas, main course, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 205}, "recipeIngredient": ["1 cup toor dal (split yellow pigeon peas)", "2 Roma tomatoes, roughly chopped", "1/4 teaspoon ground turmeric", "1/2 teaspoon kosher salt", "1/4 cup raw whole peanuts", "1/4 cup/55 grams ghee", "1 sprig fresh curry leaves", "3 small pieces Indian cinnamon or 1 cinnamon stick", "3 red dried chiles, such as chile de árbol", "3 cloves", "1/4 teaspoon black mustard seeds", "Pinch of asafoetida"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the dal: Soak the pigeon peas in a large bowl of warm water for about 1 hour. (They will have swelled a little.) Thoroughly rinse the soaked pigeon peas with fresh water, then tip the drained pigeon peas into a pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes, turmeric, salt and 5 cups water, and bring to a boil over high. Reduce the heat to medium and simmer until very tender, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use an immersion blender to purée some of the dal, leaving some intact and getting some very smooth, or whisk vigorously to break up some of the soft dal. Stir in the peanuts and continue to simmer, stirring occasionally, until the dal is very tender, about 30 minutes. Taste and adjust with salt. If the dal has become too thick for your liking, stir in a splash of water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the tempering: In a small saucepan over medium heat, warm the ghee. When hot, carefully add all of the tempering ingredients (the mustard seeds will sputter!) and swirl the pan until you can smell all the toasted spices, about 30 seconds. Pour everything over the hot dal."}]}