{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Flank Steak With Worcestershire Butter", "description": "Grilled steak covered in melting herb butter is a cornerstone of summer cooking. Here, both the steak and the compound butter are spiked with Worcestershire sauce, fresh thyme and garlic for an intensely brawny flavor. Then, the steak is garnished with a mix of charred tomatoes, scallions and basil, which gives everything a juicy sweetness brightened with lemon. You can use any cut of beef here; the flank steak has a deeply mineral taste and chewy texture that’s at its best sliced thin. But rib-eye, skirt steak and sirloin also work; just be sure to adjust the cooking time for thinner or thicker pieces.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/06/26/dining/21apperex/21apperex-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "meat", "keywords": "flank steak, tomatoes, worcestershire sauce, low-carb, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 586}, "recipeIngredient": ["1 1/2 pounds flank steak", "Fine sea salt and freshly ground black pepper", "6 thyme sprigs", "3 garlic cloves, finely grated or mashed to a paste", "1 jalapeño, minced", "2 tablespoons minced chives, plus more for serving", "2 tablespoons Worcestershire sauce", "1 tablespoon coconut palm sugar or dark brown sugar", "1 tablespoon fresh lemon juice, plus more as needed", "3 ripe plum tomatoes", "Extra-virgin olive oil", "3 scallions, white and green parts, thinly sliced", "Handful of torn fresh basil, plus more for serving", "1/2 cup unsalted butter (1 stick), softened", "1 tablespoon chopped fresh thyme", "1 tablespoon minced chives", "2 teaspoons Worcestershire sauce", "1 garlic clove, grated or mashed to a paste", "Finely grated zest of 1 lemon", "1/4 teaspoon fine sea salt, plus more to taste", "1/2 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season steak all over with 1 teaspoon salt and 1/2 teaspoon pepper. In a bowl or resealable bag, combine thyme, garlic, jalapeño, chives, Worcestershire sauce, sugar and lemon juice. Add meat and let marinate in the refrigerator for at least 2 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the Worcestershire butter: In a bowl, mash together the butter, thyme, chives, Worcestershire sauce, garlic, lemon zest, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the butter onto a piece of parchment paper or plastic wrap, form into a log and wrap well. Chill for at least 2 hours before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Light the grill or heat the broiler, arranging the rack about 4 inches from the heat source. Grill tomatoes, or broil them on a rimmed baking pan, turning them, until charred on all sides, about 2 to 4 minutes per side. Transfer to a cutting board to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush off any pieces of marinade clinging to the steak, pat steak dry and coat it lightly with oil. Grill or broil steak until it reaches desired doneness, 3 to 5 minutes per side for medium-rare (125 degrees)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer steak to a cutting board. Slice butter into coins and place them on the steak to melt slightly. Let steak rest for 5 minutes while you prepare the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roughly chop tomatoes and place in a bowl with scallions, basil, a pinch of salt and pepper, a drizzle of olive oil and a squeeze of lemon juice. Toss well, adding more salt or lemon juice, or both, to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the steak thinly, across the grain, and serve with the charred tomato mixture spooned on top. Garnish with more chives and torn basil, if you like."}]}