{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry-Mochi Butter Cake With Matcha Glaze", "description": "This cake elicits awe on sight, and it’s a delightfully easy stir-and-bake dessert created by Margarita Manzke, the pastry chef and an owner at République, a restaurant and bakery in Los Angeles. Dense and chewy, mochi is a popular Japanese confection made from glutinous, sticky rice. It’s typically formed into pocket-size balls or squares but can also be made into cakes. As the rice flour batter comes together, it may seem gritty, but it will soak up the coconut milk and evaporated milk and soften as it bakes. Unlike many cakes baked with traditional flour, this gluten-free cake is so rich and moist that it’s hard to overbake. For the glaze, matcha powder is combined with confectioners’ sugar and coconut milk, which gives the cake an earthy tone, but you could easily swap in freeze-dried raspberry or strawberry powder.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/07/09/dining/aw-raspberry-mochi-butter-cake/merlin_157389087_717f1c45-cc83-4ec3-a40e-53e66bc1b388-articleLarge.jpg", "totalTime": "PT4H", "recipeYield": "One 9-inch cake", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "coconut milk, evaporated milk, glutinous rice flour, matcha, raspberries, dessert, gluten-free, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 344}, "recipeIngredient": ["1/4 cup/55 grams unsalted butter, melted, plus more for greasing the pan", "2 1/4 cups/315 grams glutinous rice flour, like Mochiko brand (see Tip)", "1 3/4 cups/365 grams granulated sugar", "2 teaspoons baking powder", "3/4 cup/180 milliliters full-fat coconut milk", "3/4 cup/180 milliliters evaporated milk", "2 large eggs", "1 tablespoon vanilla extract", "12 ounces/340 grams fresh raspberries", "2 cups/280 grams confectioners’ sugar, plus more for dusting", "1/4 cup plus 2 tablespoons/80 milliliters full-fat coconut milk", "2 teaspoons matcha powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line the bottom of a 9-inch round cake pan with parchment paper and grease the sides and bottom of the pan with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the cake: In a large bowl, whisk together the rice flour, granulated sugar and baking powder. In a medium bowl, whisk together 3/4 cup coconut milk with the evaporated milk, eggs, vanilla and the 1/4 cup melted butter. Pour the wet ingredients into the dry ingredients and whisk thoroughly until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared cake pan. Add half the raspberries to the cake batter one raspberry at a time, 1 inch apart, pushing each berry into the batter to fully submerge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake until it’s fully golden brown on top, the center is firm and no longer jiggly, and a toothpick or cake tester inserted into the center of the cake comes out clean, 50 to 60 minutes. Transfer to a cooling rack. After the cake has cooled slightly, about 10 minutes, run a knife around the inside edge of the pan. Continue to let cool in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the matcha glaze: Add the confectioners’ sugar, coconut milk and matcha powder to a medium bowl. Whisk until smooth; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the cake has fully cooled, carefully invert it onto a cake platter or serving plate. Spoon the matcha glaze on top just until the top of the cake is coated. (You’ll have some glaze leftover.) Using the back of the spoon and working in 1-inch increments, swipe the matcha glaze from the top of the cake gradually over the edge of the cake, so it drips decoratively down the sides. (You can add more glaze as needed, or serve any additional glaze with the cake.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully place the remaining raspberries in a decorative pile in the center of the cake. Lightly dust raspberries with confectioners’ sugar and serve immediately. Store the cake in an airtight container at room temperature for up to 2 days."}]}