{"@context": "http://schema.org", "@type": "Recipe", "name": "Citrusy Roast Chicken With Pears and Figs", "description": "This juicy, citrus-scented chicken is a perfect dish for that shoulder season between summer and fall, when pears and figs overlap in the market, and evenings cool down enough to turn on the oven. As the chicken roasts, its skin crisps and its fat renders, flavoring the caramelizing fruit in the pan. Before it’s served, everything is topped with a garlicky orange relish flecked with parsley and drizzled with sherry vinegar. It’s a sweet and savory meal that’s simple enough for a weeknight (if you can marinate the chicken the night before), yet festive enough for guests.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/09/18/dining/13apperex/merlin_160426923_c5699468-f01c-4f9b-8996-08d3a901a54d-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, poultry", "keywords": "chicken, fig, garlic, orange, pear, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 326}, "recipeIngredient": ["3 garlic cloves", "1 large orange", "1 tablespoon finely chopped fresh rosemary, plus 2 whole sprigs", "2 teaspoons fine sea salt", "1 teaspoon freshly ground black pepper", "1 (3 1/2- to 4-pound) whole chicken, patted dry", "Extra-virgin olive oil, for drizzling", "8 seckel pears, halved and cored (or use 4 small ripe Bartlett, Anjou or other pears, quartered)", "8 ounces ripe fresh figs (4 to 6 figs), halved lengthwise", "Sherry vinegar, for serving", "Flaky sea salt, for serving", "1/2 cup parsley leaves, coarsely chopped, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel 2 of the garlic cloves, and finely grate or mash to a paste. Grate 1 teaspoon zest from the orange (reserve zested orange and remaining garlic clove for serving)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine garlic and zest with 1 tablespoon finely chopped rosemary, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken on a 13-by-17-inch rimmed baking sheet, and rub rosemary mixture all over chicken including underneath the skin and inside the cavity. Chill uncovered in the refrigerator for at least 4 hours and up to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Stuff chicken with rosemary sprigs. Drizzle chicken lightly with oil, and roast for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove baking sheet from oven and carefully arrange pears and figs, cut-side down, on the hot pan. Continue to roast until chicken is cooked through, another 15 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer chicken to a cutting board to rest for 10 minutes before carving. Roast pears and figs another 5 to 10 minutes, if necessary, until they are caramelized and tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the white pith off the orange, then cut out orange segments into bite-size pieces. Finely grate or mash the remaining garlic clove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer figs, pears and chicken to a platter. In the pan with chicken juices, toss orange segments, remaining garlic clove, and a drizzle of sherry vinegar; taste and season with flaky sea salt, if needed. Spoon oranges and pan juices over chicken and fruit on platter, and top with chopped parsley and more flaky sea salt."}]}