{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry Cornmeal Shortbread Tart", "description": "Part tart, part crumble, this blueberry shortbread is an excellent way to use up as many blueberries as you can get your hands on. The exposed surface allows the fruit to cook down, thickening and getting jammy with just a little bit of flour to help it along. It’s ideal for baking, slicing and bringing to any and all outdoor gatherings, or serving at home with a ridiculous amount of vanilla ice cream.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/08/14/dining/13roman01/merlin_158776053_ff9df92a-1c43-46ec-8c19-0a9abab0c8bc-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "pies and tarts", "keywords": "blueberries, cornmeal, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 443}, "recipeIngredient": ["1 1/2 cups/190 grams all-purpose flour", "1/3 cup/55 grams cornmeal", "1/3 cup/50 grams confectioners’ sugar", "1/4 cup/55 grams light brown sugar", "1 teaspoon baking powder", "3/4 teaspoon kosher salt", "3/4 cup/170 grams unsalted butter (1 1/2 sticks), melted and cooled slightly", "1 pound/455 grams blueberries", "1/2 cup/110 grams light brown sugar", "2 tablespoons apple cider vinegar or fresh lemon juice", "2 tablespoons all-purpose flour", "Small pinch of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crust and topping: In a medium bowl, whisk together flour, cornmeal, confectioners’ sugar, brown sugar, baking powder and salt. Add melted butter, then use your hands or a wooden spoon to combine ingredients until no dry spots remain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press half of the cornmeal mixture into a 9-inch tart pan with a removable bottom (alternatively, use a 9-inch cake pan or springform pan, lined with parchment), making sure the mixture is evenly pressed on the bottom and about 1/2 inch up the sides. (Using something large and flat, like the bottom of a measuring cup, will be helpful.) Reserve the remaining mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: Toss blueberries, brown sugar, vinegar, flour and salt together in a medium bowl. Pour the fruit into the crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble the remaining cornmeal mixture over the blueberries, pressing bits of the mixture together into large clumps as you go, as you would with a crisp or coffee-cake topping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake tart until the blueberry filling is bubbly and thickened, and both the crust and top are nicely browned, 40 to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let tart cool completely before slicing into triangles and serving. The tart can be baked up to 2 days ahead and stored tightly wrapped at room temperature or refrigerated (especially if your kitchen is hot or humid)."}]}