{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Turmeric Pasta", "description": "This earthy pasta is cobbled together using ingredients that you almost certainly already have in your kitchen. Its approach is fairly standard: Melt some butter, sauté some garlic and shallots, simmer with cream, then add some Parmesan and pasta cooking water to create a silky sauce. That alone would make a great meal, but what makes this recipe really special is the addition of ground turmeric, which gives this simple dish its vibrant color and sophisticated depth of flavor. This is meant to be a lazy meal — the kind of dish you throw together, then eat out of a big bowl while sitting on the couch — but if you're feeling the need for something green, serve the pasta with a simple salad dressed with vinegar and olive oil.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/02/12/dining/sl-turmeric-pasta/sl-turmeric-pasta-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weeknight, pastas", "keywords": "main course, parsley, pasta, shallot, spaghetti, turmeric", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1066}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 456, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "18 grams", "saturatedFatContent": "9 grams", "sodiumContent": "367 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound spaghetti", "2 tablespoons unsalted butter", "1 large shallot, thinly sliced", "2 garlic cloves, thinly sliced", "Kosher salt and black pepper", "1 1/2 teaspoons ground turmeric", "1 cup half-and-half", "2 cups lightly packed freshly grated Parmesan (about 4 ounces), plus more for serving", "4 tablespoons finely chopped fresh parsley or chives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook spaghetti according to package instructions. Reserve 1 cup pasta cooking water and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt butter in a large saucepan over medium heat. Add shallot and garlic, season with salt and pepper and cook, stirring, until golden-brown, 3 to 4 minutes. Add turmeric and stir to toast, about 30 seconds. Slowly whisk in the half-and-half then bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in the 2 cups Parmesan, then add the cooked spaghetti and all of the reserved pasta cooking liquid and toss to coat. Serve with chopped parsley and more Parmesan."}]}