{"@context": "http://schema.org", "@type": "Recipe", "name": "Chez Ma Tante’s Pancakes", "description": "At the Brooklyn restaurant Chez Ma Tante, the brunch pancakes come two to an order, big as dessert plates and almost burnt. “I knew I wanted them to be really, really crispy,” said the chef de cuisine Jake Leiber. He was inspired by a fairly straightforward pancake recipe made with bacon fat he found in “How America Eats,” the seminal cookbook by Clementine Paddleford, an American food historian. Mr. Leiber swaps the lard for butter, adds an extra egg yolk to his batter, cranks up the heat on his vintage cast-iron skillet, then pours in an outrageous amount of melted clarified butter. Fried in shallow pools of hot fat, each pancake gets fritter-like crisped edges. Mr. Leiber serves them with more butter, and glugs of maple syrup.", "author": {"@type": "Person", "name": "Daniela Galarza"}, "image": "https://static01.nyt.com/images/2019/05/08/dining/dg-chez-ma-tante-pancakes/dg-chez-ma-tante-pancakes-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 to 8 large pancakes", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, quick, pancakes", "keywords": "eggs, flour, ghee, maple syrup", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 886}, "recipeIngredient": ["1 large egg", "1 egg yolk", "2 1/2 tablespoons baking powder", "2 tablespoons granulated sugar", "1 teaspoon kosher salt", "1 1/4 cups whole milk", "1 cup all-purpose flour", "1 cup plus 2 tablespoons <a href=\"https://cooking.nytimes.com/recipes/1018510-clarified-butter\">clarified butter</a> (or store-bought), melted", "Salted butter, for serving (optional)", "Maple syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk egg and yolk together in a medium bowl. Add baking powder, sugar and salt; whisk until smooth and fluffy. Pour in half the milk, then half the flour. Using a wooden spoon, stir to combine. Add the remaining milk and flour plus 2 tablespoons clarified butter and stir briefly just until batter comes together but is still somewhat lumpy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large 12-inch cast-iron skillet or griddle over medium-high for at least 5 minutes. Pour about 1/4 cup clarified butter into the pan. When the surface of the clarified butter starts to shimmer, ladle about 1/3 cup of the batter into the skillet for each pancake, leaving a couple of inches between each pancake. Add more clarified butter as pancakes cook to keep about 1/8 inch of fat in the bottom of the pan at all times."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook until the top of the pancake starts to bubble and edges turn browned and crisp, 2 to 3 minutes. Use a spatula to flip each pancake. The cooked surface should be very crispy, with a dark ring around the edge. Cook until the second side is browned and crisp, 2 to 3 minutes. Repeat to cook the remaining pancakes, adding more clarified butter as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve immediately with pats of salted butter, if desired, and maple syrup. If making a large batch, cooked pancakes can be kept warm on a wire rack set in a rimmed metal baking sheet in a 300-degree oven."}]}