{"@context": "http://schema.org", "@type": "Recipe", "name": "Chiles en Nogada", "description": "Considered by many to be the national dish of Mexico, chiles en nogada showcases the colors of the country’s flag: green, white and red. Created by nuns in Puebla in 1821, the dish was presented to the general of the Mexican Army, Agustín de Iturbide, after he signing the treaty that recognized Mexico’s independence from Spain. The nuns used the best of the late-season harvest in the dish, including poblano chiles, peaches, pears, apples and walnuts grown in farms near Puebla. The original dish was stuffed, battered and fried, and significantly heartier than this version. Here, fresh poblanos are fried until lightly cooked, peeled, stuffed, topped with creamy walnut sauce, then eaten at room temperature. It’s served throughout the country every September, in honor of Mexico’s Independence Day.", "author": {"@type": "Person", "name": "Rick A. Martinez"}, "image": "https://static01.nyt.com/images/2019/09/11/dining/09chiles1/merlin_159811173_2640f64c-849b-4ace-8ce3-5e318e4a8f8e-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, meat, vegetables", "keywords": "ground pork, parsley, poblano chili, pomegranate, walnuts or pine nuts, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "recipeIngredient": ["2 tablespoons olive oil", "1 pound ground pork, preferably not lean", "1 medium white onion, chopped", "1/2 sweet, tart apple (such as Winesap or Pink Lady), peeled, cored and chopped", "1/2 firm, sweet pear (such as Bosc or Anjou), peeled, cored and chopped", "1/2 plantain, peeled and chopped", "4 garlic cloves, finely chopped", "Kosher salt and black pepper", "1 teaspoon dried Mexican oregano", "1/2 teaspoon ground cinnamon", "1/4 teaspoon ground clove", "1/4 cup dry sherry", "1 (14-ounce) can diced fire-roasted tomatoes with their juices", "1/2 peach, peeled, pitted and chopped", "1/3 cup raisins", "1/4 cup raw whole almonds, chopped", "1/3 cup pitted Spanish green olives", "1/2 teaspoon finely grated lemon zest plus 1 tablespoon lemon juice", "2 tablespoons chopped fresh parsley", "4 cups vegetable oil, for frying", "8 large poblano chiles", "2 cups raw whole walnuts", "1/4 cup raw whole almonds", "4 ounces crème fraîche (1/2 cup)", "4 ounces queso fresco (about 1 cup), crumbled", "1 cup pomegranate seeds", "1/2 cup small parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the picadillo: Heat olive oil in a large skillet over high. Spread pork in an even layer and cook, undisturbed, until lightly browned, about 3 minutes. Toss and continue to cook, breaking up meat with the back of a spoon and scraping up any browned bits from the bottom of the pan, until meat is crumbled and lightly browned, 4 to 6 minutes. Using a slotted spoon, transfer the browned meat to a large bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce heat to medium and cook onion, apple, pear, plantain, garlic and 1 1/2 tablespoons kosher salt, stirring occasionally, until tender but not browned, 10 to 12 minutes, adjusting the heat as necessary. Add 1 teaspoon pepper, the oregano, cinnamon and clove, and cook, stirring frequently, until very fragrant, 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in sherry and cook, stirring occasionally, until most of the liquid has evaporated and no longer smells of alcohol, 2 minutes. Stir in tomatoes and their juices, peach, raisins and almonds and cook, stirring occasionally, until most of the liquid has evaporated, 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked pork, olives, lemon zest and 1 cup water, and cook, stirring occasionally, until all the liquid has evaporated, the vegetables and fruit are tender and the pork is cooked through, 10 to 15 minutes. Stir in the parsley and lemon juice, season with salt and pepper, and set aside until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, fry the poblanos: Heat vegetable oil in a large saucepan fitted with a deep-fry thermometer on high until thermometer registers 375 degrees. Working in four batches, fry the poblanos, turning once, until skin is opaque and blistered, 1 to 2 minutes per side. Transfer poblanos to a large, heatproof bowl, wrap tightly with plastic and let sit 15 minutes. When cool enough to handle, peel skin from chiles, leaving stem intact. Chiles should still be firm and bright green. Using a paring knife, make a 2-inch cut (about 1 inch from the top) lengthwise down the side of each poblano and carefully remove seeds and ribs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the poblanos cut-side up on a rimmed baking sheet and fill each with about 1/2 cup picadillo, gently pressing the filling into the poblanos with the back of a spoon, until full but not bursting or splitting. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: Purée the walnuts, almonds, crème fraîche and queso fresco with 1 1/4 cups water and 3/4 teaspoon salt in a blender until creamy. Season with salt and thin with more water, if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve stuffed chiles at room temperature topped with nogada sauce, pomegranate seeds and parsley leaves."}]}