{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Salmon With Chive Oil and Lime Crème Fraîche", "description": "The wild king salmon season opens in late spring in Alaska and all the way down the West Coast. The season continues through summer, but is at its best in June. The year’s first wild salmon has brilliant red flesh, a mild sweet flavor and a velvety texture. Farmed salmon doesn’t compare. You pay a high price for wild salmon, but the splurge is worth it. Paired with bright green chive oil and limey crème fraîche, it will make you swoon.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/06/12/dining/07kitchenrex/07kitchenrex-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, seafood", "keywords": "chives, crème fraîche, lime, salmon, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 154}, "recipeIngredient": ["4 (6-ounce) pieces wild king salmon fillet", "2 tablespoons extra-virgin olive oil", "Salt and pepper", "1 cup roughly chopped chives, plus 2 tablespoons thinly sliced chives, for garnish", "3/4 cup grapeseed oil or another neutral oil, such as safflower", "1 cup crème fraîche", "Zest and juice of 1 small lime", "Chive blossoms or other edible blossoms (optional)", "Watercress sprigs or other peppery greens, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Lay the salmon fillets on a parchment-lined baking sheet. Coat salmon with olive oil and season with salt and pepper on both sides. Bring to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chive oil: Put 1 cup roughly chopped chives in a blender or food processor. With the food processor running, slowly add oil and a pinch of salt. You should have a bright-green oil. Transfer chive oil to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put crème fraîche in a small bowl. Stir in lime zest and juice. Season with a little salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake salmon on top rack of oven for 8 to 10 minutes, until just done. When you see juices begin to rise to the surface of the fish, remove fish from oven. (It is better to err on the less-cooked side; the fish continues to cook a bit from residual heat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer fish to individual plates or a platter. Dollop about 1 tablespoon of limey crème fraîche on each fillet. Drizzle chive oil over the top and sprinkle with chives. Garnish with blossoms and watercress sprigs."}]}