{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Sugar Cookies", "description": "The easy-to-handle dough in this basic sugar cookie is perfect for rolling and cutting. It holds its shape well during baking, tastes great, and the flavor can be changed according to whim: Swap out the vanilla and try adding orange zest, lemon zest, finely chopped rosemary or almond extract. You can also give these cookies a radical makeover by decorating them with icing. A few drops of gel food coloring turn them into <a href=\"https://cooking.nytimes.com/recipes/1020647\">Color-Field Cookies</a>; red stripes transform them into <a href=\"https://cooking.nytimes.com/recipes/1020646\">Peppermint Stripe Cookies</a>; or a sprinkle of pomegranate seeds and pistachios create <a href=\"https://cooking.nytimes.com/recipes/1020645\">Abstract Art Cookies</a>. Rubber spacers on your rolling pin are especially helpful here: They’ll help you roll the dough to an even thickness, resulting in beautiful, uniform cookies.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-color-cookies/merlin_163736859_309992ab-fd0e-462c-85a2-9fcddeb29427-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 dozen cookies", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars", "keywords": "butter, flour, sugar, vanilla, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 465}, "recipeIngredient": ["2 1/2 cups/320 grams all-purpose flour", "1/2 teaspoon baking powder", "1/2 teaspoon kosher salt", "1 cup/225 grams unsalted butter (2 sticks), softened", "3/4 cup/150 grams granulated sugar", "1 large egg, at room temperature", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine flour, baking powder and salt in a medium bowl, and whisk to combine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream together butter and granulated sugar on medium-high speed until light and fluffy, 2 to 3 minutes. Add egg and vanilla, and beat on medium speed until well combined, scraping the bowl as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add flour mixture and beat on low speed just until combined. Scrape the bowl and fold a few times to make sure everything is well combined. Wrap dough in plastic wrap, flatten into a disk, and chill until firm, at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Roll out dough 1/4-inch thick. Use 3-inch floured cutters to cut out cookies, and transfer to two parchment- or silicone mat-lined baking sheets, spacing the cookies about 1 1/2 inches apart. Reroll scraps as needed, chilling as needed until firm before rolling and cutting again. Freeze until very firm, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until golden brown at the edges, 12 to 14 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let cool a few minutes on the baking sheets, then transfer to wire racks to cool completely. Cookies will keep in an airtight container at room temperature for up to 2 weeks, or frozen up to 3 months."}]}