{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Hot Honey Ribs", "description": "It’s a pressure cooker miracle: super-tender ribs in little more than an hour, from start to finish. (You could also make these ribs in a slow cooker using <a href=\"https://cooking.nytimes.com/recipes/1020484-slow-cooker-hot-honey-ribs\">this recipe</a>, though be aware it will be significantly more time-consuming.) These sticky, spicy ribs make a fantastic football-watching snack, but they can also be a dinner main, served with some sautéed greens on the side. The ribs emerge from the pressure cooker falling-off-the-bone and flavorful. They just need a quick spicy honey glaze and a two-minute run under the broiler to caramelize. One thing to note: Red chiles taste best in this recipe because green chiles are less sweet and can taste grassy. Any spicy red chile will work beautifully, and red-pepper flakes work in a pinch. If you prefer green chiles, however, you can use them.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2019/09/18/dining/sd-pressure-cooker-hot-honey-ribs/merlin_161002881_73aa0418-adfc-4924-8f82-d8ceae03ba11-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, snack, finger foods, meat", "keywords": "appetizer, main course, baby back ribs, chiles, honey, hot paprika, lime, sweet paprika", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 104}, "recipeIngredient": ["2 tablespoons sweet paprika", "1 tablespoon hot smoked paprika", "1 tablespoon dried mustard powder", "2 teaspoons garlic powder", "Black pepper", "2 racks baby back ribs (about 4 pounds total)", "2 tablespoons kosher salt, plus more as needed", "2/3 cup honey", "5 red Thai chiles or 2 red jalapeño, serrano or finger chiles, stemmed and thinly sliced (or 1 1/2 tablespoons red-pepper flakes)", "3 (1-inch) strips lime peel and the juice of 1/2 lime (about 1 tablespoon juice)", "1 tablespoon apple cider vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sweet and hot smoked paprika, mustard and garlic powders and several generous grinds of black pepper to a small bowl and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the ribs from the packaging and pat them dry with paper towels. (The easiest place to do this is the sink.) Turn the ribs over to remove the membrane that covers the back of the ribs: Grasp one end of the membrane with paper towels to keep your hands from slipping and pull; the membrane should pull right off in one or two sheets. (If it is not easy to pull off, you can skip this step.) Season the ribs all over, front and back, using about 1 tablespoon of salt per rack of ribs. Coat the ribs in the spice mixture, patting it all over both sides of the ribs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 cups of water into a 6- or 8-quart electric pressure cooker. Fit a steamer basket or trivet into the pot over the water. If you don’t have one of those, roll up sheets of aluminum foil to make foil snakes about 1 1/2 inches in diameter. Coil the foil snakes into the bottom of the pot, covering the bottom of the pot with the coil. Make sure the top of the coil is just above the water level. This makes your own steamer trivet. Coil the ribs in the pot with the meaty sides facing the sides of the pot and the bones pointing up, standing them in a ring of concentric circles. Close the lid and cook on high pressure for 18 to 22 minutes. (See Tip)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the hot honey: Combine the honey, chiles and lime peel in a small saucepan over medium heat. Let the mixture get very hot, until it simmers and then starts to foam, about 2 minutes. Remove it from the heat, pour it into a small heatproof bowl and set aside. (The honey can be made several days in advance. When it cools, cover it, and store it at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the cook time is over, turn off the pressure cooker and let the pressure release naturally for 15 minutes, then release the remaining pressure manually. Open the lid. The ribs should be very tender, but not falling apart. They are done when the meat shrinks back from the bones, the bones wiggle easily and a fork can easily shred an edge of the meat. If the meat is not tender, pressure cook on high for 1 to 3 more minutes, then immediately release the pressure manually."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a sheet pan with foil. Using tongs, transfer the ribs to the sheet pan, meaty side up. Heat the broiler. Remove the lime zest from the honey (leave the chiles in) and stir the lime juice and apple cider vinegar into the honey mixture. Using a spoon, drizzle the honey all over the ribs, using about half the honey but leaving the chiles in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil the ribs until they are caramelized and sizzling, and lightly charred in spots, 2 to 3 minutes. (Check the ribs every 30 seconds or so to prevent burning, and rotate them to make sure that all the surfaces get caramelized.) Season the ribs with salt, then drizzle more of the hot honey and chiles over the ribs, to taste. Serve with any remaining hot honey on the side."}]}