{"@context": "http://schema.org", "@type": "Recipe", "name": "No-Bake Lemon Custards With Strawberries", "description": "Ultracreamy but still ethereally light, these individual custards are set with lemon juice rather than eggs, cornstarch or gelatin. They are thick and velvety, but not overly rich, with a bright, clean citrus flavor. Based on a British dessert called a posset, the key is to simmer the cream and sugar before adding the fresh lemon juice, giving the cream a chance to thicken slightly. In this summery version, the custards are served with a topping of syrupy, sugared strawberries and a sprinkling of freshly ground black pepper, which adds a gentle spicy note without overwhelming the fruit.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/06/05/dining/31apperex/merlin_154665804_090d10aa-a543-4e29-8e42-b89dbe1bbfdd-articleLarge.jpg", "totalTime": "PT35M", "recipeYield": "6 servings", "recipeCuisine": "british", "recipeCategory": "custards and puddings", "keywords": "cream, lemon, strawberries, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1303}, "recipeIngredient": ["2 cups heavy cream", "2/3 cup granulated sugar", "2 teaspoons finely grated lemon zest (from 1 to 2 lemons)", "Pinch of fine sea salt", "1/3 cup fresh lemon juice (from 2 to 3 lemons)", "1 cup sliced strawberries", "1 to 2 teaspoons granulated sugar", "Freshly ground black pepper, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine cream, sugar, lemon zest and salt over medium-high heat. Bring to simmer, stirring frequently to dissolve sugar. Simmer vigorously until mixture thickens slightly, about 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and stir in lemon juice. Let sit until mixture has cooled slightly and a skin forms on top, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir mixture, then strain through fine-mesh strainer into a measuring cup with a spout; discard zest. Pour mixture evenly into six 6-ounce ramekins or small bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate, uncovered, until set, at least 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the custards chill, prepare the strawberry topping: Toss strawberries and sugar in a small mixing bowl. Let fruit macerate at room temperature for 30 minutes to 1 hour, until the sugar is dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, top each lemon custard with some strawberry topping and grind black pepper on top."}]}