{"@context": "http://schema.org", "@type": "Recipe", "name": "Macarons", "description": "Filled with ground almonds and flavored with vanilla beans, these classic French macarons are soft in the center, with a crunchy meringue shell that shatters gloriously when you bite. Buttercream is the most traditional macaron filling, but you can substitute jam, chocolate ganache, dulce de leche or lemon curd. And feel free to play with the flavorings: Instead of vanilla, try a dash of rose water, some grated lemon zest or ground cinnamon. If you want to tint the macarons, add a drop or two of food coloring to the batter. These are best made a day or two in advance, and will last for up to 5 days stored airtight at room temperature.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/12/04/dining/mc-macarons/mc-macarons-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 30 small macarons", "recipeCuisine": "french", "recipeCategory": "cookies and bars", "keywords": "almond flour, butter, confectioners' sugar, cream of tartar, egg whites, egg yolks, sugar, vanilla bean, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "recipeIngredient": ["1/2 cup/65 grams blanched almond flour", "1/2 cup/65 grams confectioners’ sugar", "2 large egg whites (60 grams), at room temperature", "1/8 teaspoon cream of tartar", "Pinch of fine sea salt", "4 tablespoons/50 grams granulated sugar", "1 vanilla bean, scraped", "2 large egg yolks", "1/4 cup/50 grams superfine sugar", "1 tablespoon water, brandy or rum", "Pinch of fine sea salt", "1/2 cup plus 3 tablespoons/155 grams unsalted butter, cut into 1/2-inch cubes, at room temperature", "3/4 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 rimmed baking sheets with parchment paper. Sift together almond flour and confectioners’ sugar into a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the whisk attachment, combine egg whites, cream of tartar and salt; whisk on medium until frothy. Gradually add granulated sugar, 1 tablespoon at a time, beating well between additions. Raise speed to medium-high and beat until egg whites are stiff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a rubber spatula, fold almond flour mixture and vanilla seeds into egg whites, continuing to fold until mixture is just thin enough to drop in unbroken thick ribbons off the spatula. It should hold its shape for a few seconds before sinking into the rest of the meringue."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dab a little meringue underneath each corner of the parchment to stick it to the baking sheet, then transfer the rest of the meringue to a piping bag fitted with a 1/2-inch-round tip. Pipe 1-inch rounds of meringue, spaced 1 inch apart. (Hold your tip perpendicular to the sheet to ensure a round shape.) Rap the baking sheet against the counter 2 or 3 times to remove air bubbles and flatten the meringues."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the meringues rest until you can poke them lightly with a finger and feel a skin; this will take 45 to 90 minutes, depending on the humidity of your kitchen. You don’t want the meringues to be sticky when you bake them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack in the center of the oven and heat to 300 degrees. Bake one baking sheet at a time for about 20 minutes, rotating after 10 minutes. Macarons are done when you can easily lift one up from the tray to check if bottoms are light golden. Let cool completely on baking sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the buttercream: Bring 1 inch of water in a medium pot to a simmer. In the bowl of an electric mixer, combine yolks, sugar, water and salt. Place bowl over simmering water, and use a rubber spatula to stir constantly until yolks reach 155 degrees. Transfer to an electric mixer fitted with a whisk attachment, and whip yolk mixture until it reaches room temperature, 4 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With mixer on medium speed, add butter a little at a time, waiting until fully incorporated before adding the next piece. Scrape bowl if necessary. Beat in vanilla extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a piping bag fitted with a 1/4-inch-round tip. Pipe 1/4-teaspoon-size mounds onto the flat sides of half the macarons. Top with remaining pieces, sandwiching them together until filling reaches the sides of the macaron. Store in an airtight container; the macarons taste better the next day when the flavors have had a chance to meld."}]}