{"@context": "http://schema.org", "@type": "Recipe", "name": "Polo Ba Tahdig (Persian Rice With Bread Crust)", "description": "No dinner in an Iranian household is complete without polo, or rice. And no pot of polo is complete without tahdig, the crisp crust whose name means “bottom of the pot.” Tahdig is a highlight of Persian cuisine, and it can be made of rice, potatoes, lettuce or bread, as it is here. If you can’t get your hands on lavash bread, use a thin flour tortilla to line the bottom of the pot. Tahdig is easiest to prepare in a nonstick pot, but you could also prepare it in a cast-iron Dutch oven by reducing the heat to low and extending the cooking time to 50 minutes.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/05/15/dining/14Iranianrex4/merlin_154114503_4ca82386-afb4-4727-9b4a-7bb5eae0a744-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "grains and rice", "keywords": "basmati rice, lavash, saffron, tortilla, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "recipeIngredient": ["3 cups basmati rice", "Fine sea salt", "1/2 teaspoon crumbled saffron threads", "1 large piece lavash bread or 8-inch flour tortilla", "3 tablespoons neutral oil, such as canola or grapeseed", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice in a large bowl and cover with water. Swirl the rice around to release some starch, then drain the bowl and fill again. Repeat several times, until water runs clear, then cover with ample water again and add 1 tablespoon salt. Let soak for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, fill a large soup or stockpot with 6 quarts water. Cover and bring to a boil. Add 7 tablespoons salt (the water should be very salty) and stir to dissolve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a small mortar and pestle to grind the saffron into a fine powder with a pinch of salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a large fine-mesh sieve or colander to drain the rice well. Add rice to the pot and stir gently, then return sieve to the sink. Cook rice, checking the grains frequently for doneness. When the rice breaks easily between your fingers when pressed but is not so soft that it falls apart, it’s done. Most Persian or Indian basmati rice will take about 7 to 8 minutes to reach this point, but different brands will cook differently, so keep a closer eye on the rice than on the clock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working quickly, drain rice into the sieve and rinse with cold water until cool to remove excess starch and keep rice from overcooking. Taste the rice and adjust seasoning with salt as needed. Let the rice continue to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the lid of an 8-inch or 9-inch nonstick pot or cast-iron Dutch oven as a guide to trim the lavash bread into a slightly larger circle. It’s fine to use more than one piece of bread and patch things as needed. Alternatively, use a tortilla, which needs no trimming."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pot over medium heat and add the oil. Carefully lay bread atop the oil and cook until it starts sizzling and turns a light golden color, about 30 seconds. Use tongs to flip bread and let it sizzle for another 30 seconds before adding the rice. Use a spatula to gently spread the rice evenly across the pot. Use the handle of the spatula to poke 6 to 8 holes in the rice down to the bread — this will encourage steam to escape from the bottom of the pot and yield a crisp crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan set over low, heat the butter and the prepared saffron until butter melts. Drizzle over the rice. Wrap the lid of the rice pot with a clean dish towel, using the corners of the towel to tie a knot atop the handle. Cover the pot with the lid — the cloth should not touch the rice, but rather absorb steam as the rice cooks to keep it from getting soggy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce the flame to medium-low (or low, if using cast-iron) and cook for about 48 minutes, rotating the pot a quarter turn every 12 minutes or so to ensure an evenly golden tahdig (add 12 more minutes for cast-iron). The rice will be done when the grains are elongated and dry and the edges of the crust turn a light golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a large platter or plate over the pot, gather your courage, praise your ancestors and flip the rice. It should drop onto the plate in one piece. Serve immediately. If not serving immediately, remove the tahdig to a separate platter to keep it from getting soggy as the rice continues to release steam."}]}