{"@context": "http://schema.org", "@type": "Recipe", "name": "Cod and Kimchi Stew", "description": "Kimchi is a seriously versatile kitchen staple because it’s packed with so many flavors and textures. It’s great chopped and folded into mayonnaise, cooked with your favorite taco filling or stirred in to sauces and soups. In this recipe, it takes center stage as the base for an umami-rich broth. Once cooked, the kimchi is tender and provides a counterpoint to perfectly poached cod. For a heartier meal, serve it over steamed rice and top it with a fried egg.", "author": {"@type": "Person", "name": "Rick A. Martinez"}, "image": "https://static01.nyt.com/images/2019/10/08/dining/rm-cod-and-kimchi-stew/rm-cod-and-kimchi-stew-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, one pot, seafood, soups and stews", "keywords": "cod, ginger, gochujang, kimchi, miso, mushroom, shiitake, whitefish fillet, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 256}, "recipeIngredient": ["3 tablespoons vegetable oil", "1/4 pound shiitake, cremini or button mushrooms, halved", "3 medium shallots, chopped (about 1 cup)", "1 (4-inch) piece fresh ginger, peeled and finely chopped (about 1/4 cup)", "5 garlic cloves, thinly sliced (about 1/4 cup)", "2 tablespoons gochujang (Korean hot-pepper paste) or white or yellow miso paste", "2 cups kimchi with its juices", "3 tablespoons soy sauce", "1 pound boneless, skinless cod fillet (or pollock, halibut or other firm whitefish fillet), cut into 1 1/2-inch pieces", "Sliced scallions and toasted sesame seeds, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large saucepan over medium-high. Cook mushrooms, stirring occasionally, until lightly browned, 4 to 6 minutes. Add shallots, ginger and garlic and cook, stirring occasionally, until just beginning to brown, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in gochujang and cook until fragrant and brick red, 1 minute. Stir in kimchi, scraping up any gochujang from the bottom of the pan, and cook until most of the liquid has evaporated, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add soy sauce and 5 cups water and bring to a boil. Cover, reduce heat to low and simmer until kimchi is tender, about 20 minutes. Stir in fish, cover, remove from heat and let sit until cooked through, about 5 minutes. (The residual heat from the stew will gently cook the fish.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide stew among bowls and top with scallions and sesame seeds."}]}