{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Cinnamon and Dates", "description": "This chicken dish was adapted from Kim Sunée, the Korean-born author of “Trail of Crumbs: Hunger, Love and the Search for Home” (Grand Central, 2008).", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT2H", "recipeYield": " 6 to 8 servings", "recipeCuisine": "", "recipeCategory": "poultry", "keywords": "chicken thigh, golden raisins, hot paprika, main course", "aggregateRating": null, "recipeIngredient": ["1 tablespoon olive oil, plus 2 teaspoons", "1/2 pound (about 2 links) merguez, spicy Italian or lamb sausage, cut in halves or thirds (casings removed, if desired)", "6 to 8 skinless chicken thighs", "1 1/4 teaspoons salt", "3/4 teaspoon freshly ground black pepper", "2 large onions, thinly sliced", "1 tablespoon white wine, orange juice or water", "3 garlic cloves, smashed and coarsely chopped", "1 tablespoon grated fresh ginger", "1 teaspoon ground cinnamon", "1/2 teaspoon ground cumin", "1/2 teaspoon hot paprika", "1 1/2 cups low-sodium chicken broth or water", "1/2 cup fresh orange juice", "About 1/3 cup golden raisins or currants", "2 to 3 carrots, cut lengthwise and halved diagonally", "12 to 15 pitted dates", "1 large orange, cut into 8 wedges", "2 to 3 tablespoons chopped fresh cilantro, plus additional for garnish", "Pine nuts, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Place a large Dutch oven (or skillet, if planning to bake in a tagine) over medium-high heat, and add 1 tablespoon olive oil. Add sausage and chicken, and sprinkle with half the salt and pepper. Brown about 5 minutes. Turn, sprinkle with remaining salt and pepper, and brown again about 5 minutes. Transfer to a plate or the bottom of a tagine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 or 2 teaspoons olive oil to Dutch oven or skillet, as needed, and add onions. Sauté until onions are softened, about 5 minutes. Add wine, and stir, scraping bottom of pan. Add garlic, ginger, cinnamon, cumin and paprika, and stir until garlic and ginger are softened and fragrant, about 3 minutes. Stir in chicken broth, orange juice, raisins and carrots. Return chicken and sausage to pot, or pour onion-carrot mixture over the chicken and sausage in tagine. Add dates and orange wedges, and stir to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover, and bake until chicken and carrots are fork-tender, about 1 1/2 hours. Taste, and adjust seasonings as needed. Garnish with cilantro and pine nuts. If desired, serve with hot buttered couscous and harissa paste, or chutney."}]}