{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Celery With Thyme and White Wine", "description": "Inspired by the French method of cooking duck or chicken confit, in which the meat stews slowly in its own fat, this recipe simmers celery in a classically French sauce, with white wine, stock, shallots and herbes de Provence. The celery is first blanched in heavily salted water, which jumpstarts the cooking process and seasons the stalks from the inside-out, then it’s roasted in liquid until submissive and silky, with a texture reminiscent of roasted fennel. Once the celery is tender, the liquid is reduced on the stovetop until just thick enough to coat a spoon. The resulting sauce bears an uncanny similarity to the jus underneath the Thanksgiving turkey, in both flavor and mouthfeel, and the dish is equally at home at the Thanksgiving table as paired with a store-bought rotisserie chicken and some mashed potatoes. Like classic confit, you can prepare it in advance and simply reheat before serving.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/11/20/dining/19celeryrex2/merlin_164213256_9221ef1a-b75a-439f-982f-011c61e041b0-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, vegetables", "keywords": "butter, celery, herbes de provence, thyme, white wine, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 111}, "recipeIngredient": ["Kosher salt", "2 heads fresh celery (about 2 pounds)", "1 1/2 cups chicken stock or vegetable stock", "3/4 cup dry white wine", "1/2 cup extra-virgin olive oil", "2 medium shallots, peeled and thinly sliced into rounds", "12 fresh bay leaves", "8 fresh thyme sprigs", "4 garlic cloves, peeled and thinly sliced", "2 tablespoons whole black peppercorns", "1 tablespoon dried herbes de Provence", "6 tablespoons unsalted butter (3/4 stick), diced", "Small sprigs of fresh parsley or finely chopped parsley leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of heavily salted water to a boil over high, and heat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the celery: Separate the stalks, and reserve some celery leaves for garnish. Gently peel the outer layer of the thicker stalks to remove any tough strings. Cutting at a sharp angle, trim and discard the tips of the stalks, then cut stalks on an angle into 3-inch pieces. Add the celery segments to the boiling water, and cook just until slightly softened, 1 to 2 minutes. Using a slotted spoon or tongs, transfer the blanched celery to a large 9-by-13-inch glass baking dish, and arrange in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with the stock, wine and olive oil. Add the shallots, bay leaves, thyme sprigs and garlic, tucking them between the celery layers, then sprinkle with the peppercorns, herbes de Provence and 1 teaspoon salt. Dot with the butter, then cover tightly with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the oven and bake until celery is tender and yielding, about 45 minutes, if you want it to retain slight bite, or 1 hour or more, if you prefer it extra-tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs or a slotted spoon, transfer the braised celery to a serving platter or shallow bowl and cover. Transfer the remaining liquid to a medium saucepan and boil over medium-high until reduced by half, about 15 minutes. Pour the reduced sauce over the celery, straining, if desired, and sprinkle with fresh celery leaves and parsley. Serve warm."}]}