{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Apples", "description": "I don’t remember my mother at the stove.  When asked what childhood dish was my favorite, I’d stammer and come up empty.  And then, walking down the stairs in my Paris apartment, I got to the third floor and said out loud to no one: baked apples! My mother made baked apples. Her apples were big Cortlands or Rome Beauties, and she cored and stuffed them with raisins, because my father loved raisins. I also bake with Cortlands or Romes when I can get them, Fujis or Galas when I can’t. I’ll often stuff them with raisins, but I think they’re especially nice filled with bits of dried apple and candied ginger. And I like to baste them with apple cider and honey. They’re good hot or cold, but best served warm and topped with something creamy. Cinnamon (my mom always used too much) is optional.", "author": {"@type": "Person", "name": "Dorie Greenspan"}, "image": "https://static01.nyt.com/images/2019/09/21/magazine/22mag-eat/22mag-eat-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "apple, apple cider, apple juice, cinnamon, crystalized ginger, honey, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 396}, "recipeIngredient": ["4 large baking apples, like Rome Beauty", "2 lemon wedges", "2 to 3 dried apple rings, cut into bits", "4 tiny pieces crystallized ginger (optional)", "3 to 4 teaspoons honey", "1 tablespoon unsalted butter", "1 cup/240 milliliters apple cider or juice", "Heavy cream, whipped cream or ice cream, for serving (optional)", "Cinnamon, for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Center a rack in the oven and heat to 375. Line a baking sheet with parchment paper or foil, and set a 9- or 10-inch glass pie dish on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut a small cap off the top of each apple, and set aside. Using a paring knife or corer, core the apples, making sure not to go all the way to the bottom. Cut away and reserve about 1/2 inch of peel around the tops of the apples. Rub the peeled portions of the apples with the lemon, squeezing a little juice into each opening."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill each apple with an equal amount of dried apple and ginger, if using, pressing down lightly as needed to push bits into the opening. Pour 1/2 teaspoon honey over the dried fruit in each apple. Cut the butter into 4 pieces, and top each apple with a pat. Pop the caps back on the apples. (It’s O.K. if they teeter). Transfer the apples, lemon wedges and a few of the reserved peels into the pie dish; pour in the cider or juice, and stir in 1 to 2 teaspoons honey. (The honey won’t blend evenly into the cider, and that’s fine.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the apples, basting occasionally with the cider and honey, until you can poke them with a skewer or the tip of a knife and not meet much resistance, 50 to 70 minutes. Since apples are so variable, check early and often, as you might need more or less time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let them cool for at least 15 minutes before serving moistened with a little pan sauce, and if you want, top with cold heavy cream, whipped cream or ice cream and dust with cinnamon. The apples are good warm or at room temperature. They’ll keep, covered, for 2 days in the refrigerator and can be reheated in a microwave."}]}