{"@context": "http://schema.org", "@type": "Recipe", "name": "Mexican Hot Dogs", "description": "If you’ve ever walked through the streets of Los Angeles late at night, you may have been lucky enough to happen upon a street vendor selling bacon-wrapped hot dogs piled high with caramelized onions, sautéed peppers, pico de gallo, avocado, ketchup, mustard and mayonnaise. This version of Mexican hot dogs, also known as street dogs or Los Angeles hot dogs, is believed to be a riff on a similar recipe that originated in Sonora, Mexico. In Los Angeles, they’re sometimes fried on a mobile D.I.Y. griddle made with a wheeled cart, a large sheet pan and a heat source underneath, but we don’t recommend trying that at home. For this recipe, a standard sheet pan and an oven will do.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/05/21/dining/kwr-mexican-hot-dogs/kwr-mexican-hot-dogs-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday, barbecues", "keywords": "avocado, bacon, hot dogs, jalapeño, onion, pepper, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 168}, "recipeIngredient": ["8 hot dogs", "8 bacon strips", "4 jalapeños, stemmed, halved lengthwise and seeds removed (optional)", "2 tablespoons vegetable oil, plus more for drizzling (if needed)", "1 small yellow onion, thinly sliced", "1/2 small red bell pepper, thinly sliced", "1/2 small green bell pepper, thinly sliced", "Kosher salt", "8 hot dog buns", "Ketchup, yellow mustard and mayonnaise, for serving", "3 plum tomatoes, diced (about 1 1/2 cups)", "1 avocado, diced", "1/2 small red onion, diced (about 1/2 cup)", "1/4 cup chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Tightly wrap each hot dog with a strip of bacon until most of the hot dog is covered. Transfer hot dogs to an aluminum foil-lined baking sheet. If using jalapeños, place them skin-side down on a separate aluminum foil-lined baking sheet and lightly drizzle with oil. Roast jalapeños until skin starts to blister, about 25 minutes. Roast hot dogs until bacon is browned and starts to ripple, about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 1 tablespoon oil in a large skillet over medium-high. Add the yellow onion and cook, stirring frequently, until it begins to brown and shrinks by half,<strong> </strong>about<strong> </strong>10 minutes. Stir in bell pepper and the remaining 1 tablespoon oil; season to taste with salt. Remove from heat when onions are caramelized and peppers are soft, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pico de gallo with avocado: Combine tomatoes, avocado, red onion, cilantro and lime juice in a medium bowl. Season to taste with salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast buns, if desired. Blot excess oil from the hot dogs with a paper towel and transfer to buns. Top with onions, peppers and pico de gallo. Drizzle with ketchup, mustard and mayonnaise. Finish with roasted jalapeños, if desired."}]}