{"@context": "http://schema.org", "@type": "Recipe", "name": "NoMad Espresso Martini", "description": "The espresso martini, made with vodka, coffee liqueur and fresh coffee, has became a global sensation since it was invented in the 1980s by British bartender <a href=\"https://www.nytimes.com/2016/03/03/world/europe/dick-bradsell-bartender-who-helped-revive-london-cocktail-scene-dies-at-56.html\">Dick Bradsell</a>. At the NoMad Bar in Manhattan, it is one of the most popular cocktails on the menu. But Nathan McCarley-O’Neill, the bar director, has put his own stamp on the recipe, including cold brew liqueur, cold brew concentrate and a touch of aquavit. “By using a concentrate, we reduced the amount of water and dilution being added to the cocktail,” he said. “This meant that the espresso martini had a distinct freshness to it.” For the NoMad drink, Mr. McCarley-O’Neill makes his own concentrate, but for home bartender purposes, a high-quality purchased brand like Stumptown can be substituted. The drops of saline solution — a common trick that cocktail bartenders have been employing for more than a decade — serve to bring out the drink’s innate flavors.", "author": {"@type": "Person", "name": "Robert Simonson"}, "image": "https://static01.nyt.com/images/2020/03/18/dining/16Coldbrew3/16Coldbrew3-articleLarge.jpg", "recipeYield": "1 drink", "recipeCuisine": "american", "recipeCategory": "cocktails", "keywords": "aquavit, coffee, coffee liqueur, vodka", "aggregateRating": null, "recipeIngredient": ["1 ounce Mr. Black Cold Brew coffee liqueur", "3/4 ounce cold brew concentrate, such as Stumptown", "3/4 ounce vodka", "1/2 ounce aquavit, preferably Linie", "Scant 1/2 ounce cane syrup", "5 drops saline solution (1 part kosher salt to 100 parts water), or a small dash of kosher salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine ingredients in a cocktail shaker half filled with ice. Shake until chilled, about 15 seconds. Strain into a chilled coupe glass. No garnish."}]}