{"@context": "http://schema.org", "@type": "Recipe", "name": "Guinness Brownies", "description": "The earthy flavors of stout beer pair perfectly with three kinds of chocolate in these dense, fudgy brownies. You can use bittersweet or semisweet, bars or chips, depending on what you have on hand, but this recipe is at its best using bar chocolate because of its meltability. A sprinkling of milk chocolate chips before baking is a sweet counterpoint to the rich, complex brownies. Do not overbake them: When the brownies are done, they will appear just set in the center and on the verge of underbaked. They’ll set further as they cool. Chilling the brownies makes them easier to cut, but allow them to come to room temperature before serving for the best flavor.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/ejm-guinness-brownies/merlin_170016606_5359a8c1-0a6b-480d-a3b1-d65608f4f2e0-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "One 9-inch pan (16 brownies)", "recipeCuisine": "american", "recipeCategory": "snack, cookies and bars, finger foods", "keywords": "beer, chocolate, cocoa powder, espresso coffee powder, guinness, guinness stout, milk chocolate chips, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 167}, "recipeIngredient": ["Nonstick spray", "1 1/4 cups/160 grams all-purpose flour", "1/3 cup/30 grams unsweetened cocoa powder", "1 tablespoon instant espresso powder (optional)", "1/2 teaspoon fine sea salt", "12 ounces/340 grams finely chopped bar bittersweet or semisweet chocolate", "6 tablespoons/85 grams unsalted butter, cut into 1-inch pieces", "3/4 cup/150 grams granulated sugar", "4 large eggs, at room temperature", "1 teaspoon vanilla extract", "1 1/4 cups/300 milliliters stout beer, at room temperature", "8 ounces/225 grams milk chocolate chips (or other chocolate chips, if you prefer)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Lightly grease a 9-by-9-inch pan with nonstick spray, and line with parchment paper, leaving about 1 1/2 inches of excess paper on two sides (these will serve as “handles” to help remove the brownies from the pan later)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk the flour, cocoa powder, espresso powder (if using) and salt to combine; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a medium pot with about 2 inches of water, and bring to a simmer over medium-low heat. Place a large bowl on top of the pot, and add the 12 ounces of chocolate and the butter to the bowl. Heat, stirring occasionally, until the mixture is fully melted and smooth. Add the sugar and continue to heat, stirring constantly, for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bowl from the heat. Use a whisk to mix in the eggs, one at a time, whisking well until each is fully incorporated before adding the next. Whisk in the vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk in half the flour mixture, then gradually whisk in the stout, mixing just until combined. Add the remaining flour/cocoa mixture and whisk just until combined. Do not overmix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan. Sprinkle the chocolate chips evenly over the surface of the batter, then transfer to the oven and bake until the brownies appear just set in the center, 23 to 30 minutes. They should seem slightly underbaked and will firm up as they cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cool completely to room temperature, then transfer to the refrigerator for at least 2 hours. (It’s easier to cut the brownies when they’re chilled.) Use the parchment “handles” to gently lift the brownies out of the pan, and cut into 16 even pieces. Store brownies in an airtight container at room temperature for up to 1 week."}]}