{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Salmon and Broccoli With Sesame and Ginger", "description": "A healthy sheet-pan dinner that comes together in just 20 minutes? Sign us up. Brushing a simple sesame-ginger glaze onto the salmon before it roasts promotes caramelization on the fish, a feat not easily accomplished when roasting salmon fillets. The garnishes give this dinner a professional finish: A squeeze of lime juice, a sprinkle of sesame seeds, and a handful of thinly sliced scallions make for a beautiful plate.", "author": {"@type": "Person", "name": "Lidey Heuck"}, "image": "https://static01.nyt.com/images/2020/01/02/dining/lh-salmon-and-broccoli/merlin_166281900_293a2d5f-93bf-471a-a75e-02b7a80877a7-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weeknight", "keywords": "broccoli, ginger, salmon fillet, sesame oil, soy sauce, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 673}, "recipeIngredient": ["4 tablespoons toasted sesame oil", "2 tablespoons soy sauce or tamari", "1 tablespoon rice vinegar", "1 tablespoon honey", "1 (2-inch) piece fresh ginger, peeled and finely grated (about 1 tablespoon)", "1 garlic clove, finely grated", "1 pound broccoli, trimmed and cut into florets, thick stems discarded", "2 scallions, trimmed and cut diagonally into 1 1/2-inch segments, plus thinly sliced scallions for garnish", "1 tablespoon olive oil, plus more for brushing the salmon", "Kosher salt and black pepper", "4 (6-ounce) skin-on salmon fillets", "1/2 lime, for serving", "Sesame seeds, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. In a small bowl, whisk 3 tablespoons sesame oil with the soy sauce, vinegar, honey, ginger and garlic until smooth. Set the glaze aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the broccoli florets and 1 1/2-inch scallion segments on a sheet pan. Drizzle with 1 tablespoon olive oil and the remaining 1 tablespoon sesame oil. Sprinkle with 1/2 teaspoon salt and 1/4 teaspoon black pepper, toss well and roast for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the broccoli and scallions roast, place the salmon fillets on a plate and pat dry with paper towels. Brush all over with olive oil and sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the broccoli and scallions and move to the edges of the pan, clearing spaces in the center for the salmon fillets. Place the salmon fillets, evenly spaced, on the center of the pan. Brush the fillets generously with the glaze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan to the oven and roast until the salmon is cooked through but still slightly rare in the center, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Squeeze the lime over the broccoli and sprinkle with salt. Scatter the sliced scallions and sesame seeds over the salmon, and serve hot."}]}