{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai-Style Tomato Salad With Cucumber and Ginger", "description": "The classic combination of tomatoes and cucumbers gets new life here from a lively dressing of lime zest and juice, fish sauce and serrano chile inspired by Thai papaya salad. It’s a study in contrasts: Bracing on its own, the salty-spicy vinaigrette is mellowed by fresh summer tomatoes and cucumbers. Large pieces of fresh ginger add a punch of spice without the heat, while cilantro and basil serve as fresh, cooling elements. Enjoy with <a href=\"https://cooking.nytimes.com/recipes/1018070-pork-satay-with-thai-spices-and-peanut-sauce>pork satay</a> or <a href=\"https://cooking.nytimes.com/recipes/1019791-southern-thai-style-red-curry-kua-kling\">red curry chicken</a>, <a href=\"https://cooking.nytimes.com/recipes/1019200-coconut-rice\">coconut rice</a> and a nice crisp beer.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/08/12/dining/aw-thai-tomato-salad/merlin_158023155_cab3ecad-78a0-4403-9d0c-4d52ff331d94-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "brunch, dinner, lunch, quick, weekday, salads and dressings, vegetables", "keywords": "appetizer, side dish, basil, cilantro, cucumber, fish sauce, ginger, lime, peanut, red onion, serrano chili, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 197}, "recipeIngredient": ["3 Persian cucumbers", "Kosher salt", "3 teaspoons granulated sugar", "1 1/2 teaspoons fresh lime zest plus 3 tablespoons juice (from 2 limes)", "4 teaspoons fish sauce", "1 tablespoon coconut oil or canola oil", "1 tablespoon very thinly sliced green serrano chile (about 1/2 large chile)", "1 garlic clove, finely grated", "12 ounces multicolored cherry tomatoes and small tomatoes, halved or quartered, depending on size", "1/2 cup torn fresh basil", "1/2 cup small sprigs cilantro", "1/4 small red onion, very thinly sliced", "1 (1-inch) piece fresh ginger, peeled and cut into matchsticks", "1/4 cup roasted salted peanuts, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Create stripes on the exterior of the cucumbers by running the tines of a fork along the length of the skin. Halve the cucumbers lengthwise, then cut crosswise into 1/2-inch pieces. Transfer to a colander and toss with 1 teaspoon salt and 1 teaspoon sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the dressing: In a large bowl, whisk together the lime zest and juice, fish sauce, coconut oil, chile, garlic and the remaining 2 teaspoons sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, add the tomatoes, basil, cilantro, red onion, ginger, cucumbers and half the nuts to the dressing; toss to coat. Transfer to a bowl or platter, top with remaining nuts and serve immediately."}]}