{"@context": "http://schema.org", "@type": "Recipe", "name": "Churros With Strawberry Sauce", "description": "Squiggly churros are a crispy, crunchy alternative to <a href=\"https://cooking.nytimes.com/recipes/1016210-orange-scented-jelly-doughnuts-sufganiyot\">sufganiyot</a> for one of the nights of Hanukkah. Serve them coated in cinnamon sugar and, instead of injecting them with jam, dip them into strawberry sauce — or raspberry sauce, Mexican chocolate with cinnamon, even guava sauce. For fluted edges on your churros, you’ll need a pastry bag fitted with a large French star pastry tip, but you could also use a resealable plastic bag with a tip cut off. To prepare the churros in advance, try this trick: Pipe the dough into 6-inch lengths on a parchment-lined baking sheet, then freeze. Fry directly from the freezer in oil heated to 375 degrees (mixture will bubble up).", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": "https://static01.nyt.com/images/2019/12/11/dining/10churros1/merlin_165064092_907e7bc2-223d-4ff9-bee0-4ea02c72edd0-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "About 2 dozen churros", "recipeCuisine": "", "recipeCategory": "snack, finger foods, pastries, project", "keywords": "anise liqueur, brown sugar, cinnamon, strawberries, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "recipeIngredient": ["2 pints fresh or frozen strawberries (about 24 ounces)", "3 tablespoons brown sugar, plus more as needed", "1/2 teaspoon vanilla extract", "Canola oil, for frying", "1 cup granulated sugar", "1 tablespoon ground cinnamon", "1 1/2 cups anise liqueur, such as Pernod", "1 teaspoon kosher salt", "2 cups all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce: Wash, dry and hull the strawberries, then transfer them to a food processor. Pulse a few times until the strawberries are almost puréed. Transfer strawberry mixture to a medium saucepan, cover, and simmer over low heat until slightly thickened, about 20 minutes. Remove from heat, cool slightly, and stir in brown sugar and vanilla extract. Add more brown sugar to adjust sweetness to taste; set strawberry sauce aside. (You should have about 2 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the churros: Pour canola oil into a large pot to a depth of 2 inches. Line a baking sheet with paper towels. Pour granulated sugar and cinnamon into a wide, shallow bowl and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot or saucepan (preferably nonstick) over medium-high heat, bring liqueur, salt and 1 1/2 cups water to a boil. Remove from heat, then gradually add flour, stirring with a wooden spoon. Beat until well blended; the dough will be sticky and should resemble wet cement."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the dough is done, heat the oil to 350 degrees. Working in batches if necessary, scrape the dough into a pastry bag fitted with a large French star pastry tip, or use a resealable plastic bag with the tip cut off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pipe the dough into the hot oil in 6- to 8-inch lengths, using a knife to slice the dough away from the pastry tip as you go; do this in batches of four or five. Fry the churros, using tongs or chopsticks to turn them over a few times and keep them from melding together, until they are deep golden brown, about 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oil and transfer to the prepared baking sheet to drain. While the churros as still hot, transfer them to the bowl with the cinnamon-sugar mixture and turn to coat evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat with the rest of the dough. Serve warm with strawberry dipping sauce."}]}