{"@context": "http://schema.org", "@type": "Recipe", "name": "Barbecue Country-Style Pork Ribs", "description": "This basic barbecue has big flavor and no ketchup or Coca-Cola (no disrespect meant to those who favor that type of seasoning). There’s no fire involved; you use a standard oven. The spicing trends toward Caribbean, with plenty of sweet spice and as much Scotch bonnet or habanero chile heat as you wish. County-style ribs are meaty bone-in pork chops cut from the shoulder end of the loin, so use those or a whole bone-in pork shoulder roast. Cooked until it’s ultratender, it can be cut in chunky pieces and served in its juices with beans, rice and cornbread. Or shred the cooked meat to make pulled pork sandwiches or tacos. It’s quite good accompanied with a crisp slawlike cabbage salad or your favorite version of coleslaw.\n<strong></strong>", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/05/22/dining/17kitchenrex/merlin_154283697_bf589b6e-b014-4ddd-baeb-fbe3046b2087-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, roasts", "keywords": "cabbage, molasses, orange, paprika, pork ribs, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 154}, "recipeIngredient": ["5 pounds thick country-style pork ribs or whole bone-in pork shoulder roast", "1 1/2 tablespoons kosher salt", "2 teaspoons allspice berries", "1 teaspoon black peppercorns", "1 teaspoon coriander seeds", "1 teaspoon whole cloves", "2 tablespoons smoked paprika, such as pimentón de la Vera", "1/2 teaspoon cayenne powder", "1/2 teaspoon ground cinnamon", "1/2 teaspoon annatto powder (optional)", "6 garlic cloves, minced", "1/2 cup molasses", "1/4 cup apple-cider vinegar", "1 tablespoon tomato paste", "2 or 3 Scotch bonnet or habanero chiles, left whole but split to the stem (optional)", "4 bay leaves", "Soft buns or crusty rolls (optional)", "1 medium Savoy cabbage, cut into 1-inch-wide ribbons", "1 teaspoon kosher salt", "1/2 cup orange juice (from 1 medium orange)", "3 tablespoons lime juice (from 1 large lime)", "1 tablespoon apple-cider vinegar", "1 small jalapeño chile, finely chopped", "1 teaspoon cumin seeds, toasted and ground", "1/4 cup thinly sliced scallions", "Cilantro sprigs, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Place pork in a Dutch oven or a roasting pan with a lid. Sprinkle with salt. In a small, dry skillet over medium heat, toast allspice, peppercorns, coriander and cloves until fragrant, about 2 minutes. Using an electric spice grinder or a mortar and pestle, grind spices and transfer to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the ground, toasted spices, add smoked paprika, cayenne, cinnamon, annatto (if using), garlic, molasses, vinegar and tomato paste. Stir well, then rub mixture all over pork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 cups water to pot. Add split chiles, if using (omit if you don’t like really spicy barbecue), and bay leaves. Cover and bake for 30 minutes. Reduce heat to 300 degrees, and continue to bake, basting occasionally for 2 hours, until meat is fork tender and falling off the bone. Pour off juices and remove rising fat. Cut pork into chunks or shred. Serve with pan juices, on a bun or roll, and/or with the cabbage salad. (Alternatively, refrigerate meat and juices for up to 2 days for easier fat removal, and reheat.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make optional cabbage salad, place cabbage in a low, wide bowl. Sprinkle with salt and toss well. Add orange juice, lime juice, vinegar, jalapeño, cumin and scallions. Toss well and leave to macerate for at least 1 hour; repeat tossing once or twice. Garnish with cilantro sprigs."}]}