{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pan Spicy Meatballs With Lentils and Fennel", "description": "In this one-pan meal, you get spicy meatballs, savory lentils and sweet fennel that are all perked up with vinegar and parsley. For the speediest meatballs, use uncased bulk Italian sausage, which comes fully seasoned. When cooked at high heat and partly submerged in the chicken stock, the meatballs brown on top and stay moist on the inside — and the lentils soak up the flavorful pork juices. The roasted fennel provides sweetness and echoes the fennel seed in the meatballs, but feel free to use another vegetable that cooks at the same rate, like thinly sliced carrots.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/01/21/dining/as-meatballs-and-lentils/as-meatballs-and-lentils-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "easy, weeknight, meatballs", "keywords": "brown lentils, fennel, italian sausage, rosemary, sausage, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 218}, "recipeIngredient": ["1 fennel bulb, cored, cut into 1/2-inch wedges through the root, plus 1/4 cup fresh fennel fronds", "2 teaspoons extra-virgin olive oil, plus more for drizzling", "Kosher salt and black pepper", "1 1/2 pounds bulk hot Italian sausage (or fresh hot Italian sausages, casings removed)", "1 egg", "4 cups chicken stock", "2 cups brown lentils", "4 garlic cloves, thinly sliced", "1 fresh rosemary sprig", "1 tablespoon sherry vinegar, white wine vinegar or apple cider vinegar", "1/2 cup fresh parsley leaves, plus more for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. In a 9-by-13-inch baking pan or baking dish, gently toss the fennel wedges with the olive oil to coat and season with salt and pepper. Roast until golden brown underneath, about 10 minutes. (Fennel will not be tender at this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, use your hands or a spoon to mix the sausage with the egg until combined. Roll the mixture into 12 (1 1/2-inch) meatballs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken stock, lentils, garlic and rosemary to the roasted fennel. Stir to combine, then season with 3/4 teaspoon salt. Place the meatballs in the lentil mixture, drizzle the meatballs with olive oil, then roast until the meatballs are browned on top and lentils are tender, 25 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the meatballs to a plate. Discard the rosemary sprig, then stir in the vinegar, parsley leaves and fennel fronds (reserve a few fronds for garnishing, if desired). Season to taste with salt and pepper. Spoon the lentils and any braising liquid onto shallow bowls and top with the meatballs. Garnish with additional parsley leaves and fennel fronds, if desired."}]}