{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato and Peach Salad With Whipped Goat Cheese", "description": "Whizzed in the food processor with some heavy cream and lemon zest, earthy goat cheese becomes rich and creamy, the perfect complement to juicy peaches and tomatoes. Fresh purslane, if you can find it, provides a slight crunch to the salad, but mâche or watercress would also work well. You could also tear up some basil, parsley or other tender herbs you have lying around and toss those in just before serving. Colorful, fresh and easy, this salad works as a starter, a side or a summery supper, piled on top of grilled bread.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/07/22/dining/aw-tomato-and-peach-salad-with-whipped-goat-cheese/merlin_157887927_dd555ee7-3af4-4efc-b3aa-dff8cbaba8bf-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings, vegetables", "keywords": "goat cheese, lemon, mustard, peach, purslane, tomato, main course, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 249}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "1 tablespoon sherry vinegar", "1 tablespoon whole-grain mustard, preferably Maille brand", "1/2 teaspoon fresh lemon zest, plus 2 teaspoons juice", "Kosher salt and black pepper", "1/4 small red onion, very thinly sliced", "4 ounces soft goat cheese or feta", "6 tablespoons heavy cream", "2 large heirloom tomatoes (about 14 ounces total), cored and cut into 1-inch wedges", "2 medium peaches (about 12 ounces), halved, pitted and cut into 1/2-inch wedges", "1 packed cup torn purslane, mâche or watercress (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the olive oil, vinegar, mustard and lemon juice. Season generously with salt and pepper, stir in the red onion and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crumble the goat cheese into the bowl of a food processor and whip until creamy, scraping down the sides of the work bowl as needed, 1 to 2 minutes. Add the heavy cream and lemon zest and whip just until fluffy, about 1 minute, scraping the bowl as needed. Transfer to a bowl and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the whipped goat cheese on a large serving platter or in shallow bowl, distributing it evenly using the back of a spoon. Add the tomato wedges, peach wedges and purslane to the dressing and toss to coat. Season to taste with salt and pepper. Place on top of the whipped goat cheese and serve immediately."}]}