{"@context": "http://schema.org", "@type": "Recipe", "name": "Tepary Beans With Chile-Agave Glaze", "description": "The small tepary beans that grow in the harsh, dry American Southwest are an heirloom variety that has been cultivated and harvested wild by countless generations of Native people in the region. The Diné (more commonly known as the Navajo) seed savers even protected them during <a href=\"https://www.nlm.nih.gov/nativevoices/timeline/332.html\">the Long Walk of 1864</a>, a brutal forced march to eastern New Mexico, hiding the beans in their clothing. This is an amazing bean that can withstand and even prosper in the most extreme heat and drought. The white variety I use here is slightly sweet and nutty, while the brown variety has an earthier flavor. The combination of white and brown tepary beans is both visual and flavorful, but you could also simply use 2 cups of one variety of tepary bean. Top the beans with <a href=\"https://cooking.nytimes.com/recipes/1020558-roasted-turnips-and-winter-squash-with-agave-glaze\">roasted turnips and winter squash</a> for a satisfying vegan meal, or pair them with <a href=\"https://cooking.nytimes.com/recipes/1020557-bison-pot-roast-with-hominy\">bison pot roast</a>, <a href=\"https://cooking.nytimes.com/recipes/1020559-roast-turkey-with-berry-mint-sauce-and-black-walnuts\">roast turkey</a> or other meat.", "author": {"@type": "Person", "name": "Sean Sherman"}, "image": "https://static01.nyt.com/images/2019/11/06/dining/04NativeAmericanrex4/04NativeAmericanrex4-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 entree servings or 8 side servings", "recipeCuisine": "", "recipeCategory": "dinner, beans", "keywords": "fall, winter, hatch chile powder, light agave syrup, tepary beans, main course, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 16}, "recipeIngredient": ["1 cup dried white tepary beans (see Note)", "1 cup dried brown tepary beans (see Note)", "1 tablespoon sunflower oil", "1/2 small yellow onion, thinly sliced", "3 tablespoons light agave nectar", "1 tablespoon New Mexico Hatch chile powder or chipotle powder, plus more for garnish", "Sea salt", "2 teaspoons whole fresh oregano leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the white and brown tepary beans in a large bowl. Add enough water to cover by 4 inches and let soak overnight at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the soaked beans, discarding the liquid, and transfer the beans to a large pot with a tight-fitting lid. Add enough cool water to cover the beans by about 4 inches. Bring to a boil over high heat, then lower the heat, cover and simmer gently, stirring occasionally, until the beans are tender, about 1 1/2 to 2 hours. Reserve 1 cup of the bean cooking liquid, then drain the beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep skillet, heat the oil over medium. Add the onion and sauté until translucent, about 3 minutes. Add the cooked beans and the reserved bean cooking liquid, the agave and the chile powder. Cook, stirring occasionally, until the liquid has reduced to a glaze, about 10 minutes. Season with salt to taste. Divide among bowls, sprinkle with additional chile powder and top with oregano."}]}