{"@context": "http://schema.org", "@type": "Recipe", "name": "Hawaiian Guava Cake", "description": "Now considered a classic Hawaiian dessert, guava cake was created at Dee Lite Bakery in Honolulu, where it became widely popular. This version is adapted from blogger Alana Kysar’s “Aloha Kitchen: Recipes From Hawai‘i,” a cookbook of traditional Hawaiian dishes. Outside of Hawaii and California, pink guava concentrate can be tough to find, but you can also use white guava concentrate or 100 percent guava juice. (If using juice, you’ll need to reduce it; see Tip below.) To mimic that lovely pink color, add a few drops of red food coloring. If you don’t, the cake will still taste like guava, but will look more like a vanilla cake.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/04/08/dining/kw-guava-cake/kw-guava-cake-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "One 9-by-13 cake (about 24 servings)", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "butter, cream cheese, guava, red food coloring, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 269}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 248, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "0 grams", "proteinContent": "3 grams", "saturatedFatContent": "7 grams", "sodiumContent": "160 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 cups/320 grams cake flour", "2 1/2 teaspoons baking powder", "3/4 teaspoon kosher salt", "1/2 cup/115 grams unsalted butter (1 stick), at room temperature", "1 1/4 cups/250 grams granulated sugar", "6 large egg whites", "1/4 cup/60 milliliters neutral oil, like canola or vegetable oil", "1 cup/240 milliliters whole milk", "1 cup/240 milliliters guava concentrate or reduced guava juice (see Tip)", "2 teaspoons vanilla extract", "4 drops of red food coloring (optional)", "1 cup/240 milliliters heavy whipping cream", "8 ounces/230 grams cream cheese, at room temperature", "1/2 cup/100 grams granulated sugar", "Pinch of kosher salt", "3 drops of red food coloring (optional)", "1/2 cup/120 milliliters guava concentrate or reduced guava juice (see Tip)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Line a 9-by-13-inch baking pan with a parchment sling, leaving some over hang on the long sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the cake: In a large bowl, whisk the cake flour, baking powder and kosher salt until combined. In the bowl of a stand mixer fitted with the paddle attachment, combine the butter and sugar and beat on medium until well combined, about 3 minutes. Add the egg whites, in three additions, beating about 1 minute after each. Reduce speed to low, add the oil and mix until combined, about 1 more minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, whisk together the milk, guava concentrate, vanilla and food coloring (if using). On low speed, alternate between adding the wet and dry ingredients to the bowl of the stand mixer, mixing well after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into the prepared pan and bake until a toothpick inserted into the center comes out clean, 25 to 30 minutes. Let the cake cool in the pan for 10 to 15 minutes before transferring it to a wire rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the frosting: In a stand mixer fitted with the whisk attachment, whip the cream on medium speed until frothy, 1 to 2 minutes. Gradually increase the speed to high and whip until it’s light and fluffy with stiff peaks, another 2 to 3 minutes. (Don’t overwhip!) Transfer the whipped cream to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Replace the bowl on the stand mixer and fit the machine with the paddle attachment (there’s no need to clean the bowl). Place the cream cheese in the bowl and mix on medium until smooth, 2 to 3 minutes. Add the sugar and kosher salt and increase the speed to high. Beat until light and fluffy, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the speed to medium and add the food coloring (if using). Add the guava concentrate in four additions, mixing well after each addition, and scraping down the sides of the bowl with a rubber spatula after the second and the final additions. Increase the speed to high and beat until smooth and well incorporated, 1 to 2 minutes. Remove the bowl from stand and, using the spatula, gently fold in the whipped cream in three additions, incorporating completely after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the frosting on the cooled cake, using an offset spatula to smooth it over the edges. Chill for at least 2 hours before serving. Cut into 24 pieces and serve immediately."}]}