{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Toast With Buttered Shrimp", "description": "Crisp, golden-brown toast is the perfect bed for impossibly ripe tomatoes, made even better when topped with saucy, garlicky shrimp. These fully assembled tomato toasts may require a knife and fork to properly tackle, but they are also wonderful eaten with your hands. Keeping the tails on the shrimp makes for a festive presentation, but feel free to remove them so you don’t have to deal with them as you eat.", "author": {"@type": "Person", "name": "Alison Roman"}, "image": "https://static01.nyt.com/images/2019/08/28/dining/26Romanrex/26Romanrex-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, quick, weekday, seafood", "keywords": "bread, shrimp, tomatoes, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 195}, "recipeIngredient": ["6 garlic cloves", "1/2 cup parsley or cilantro, finely chopped", "Kosher salt and black pepper", "4 tablespoons olive oil, plus more as needed", "4 slices bread from a boule or country loaf, about 3/4- to 1-inch thick", "4 tablespoons unsalted butter", "1 1/2 pounds shrimp, peeled and deveined", "1/4 cup dry white wine (optional)", "1 pound fresh tomatoes, thinly sliced", "1 lemon, quartered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop 2 cloves of garlic and add to a small bowl with parsley; season with salt and pepper and set aside. Thinly slice remaining 4 garlic cloves; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Add bread and toast until golden brown on one side, 2 to 3 minutes. Turn bread, adding another drizzle of olive oil as needed and toast on the other side, another 2 to 3 minutes. Transfer to a large serving platter and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat butter and remaining 2 tablespoons olive oil in the same skillet. Add the sliced garlic and season with salt and pepper. Cook, swirling skillet occasionally, until the butter starts to brown and the garlic is golden, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add shrimp and season with salt and pepper. Cook, tossing occasionally, until shrimp are bright pink and just cooked through, 3 to 4 minutes. Add white wine, if using, and let cook for a minute or two, just to take the edge off the wine (don’t reduce so much that you lose that sauciness, though). Remove pan from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place tomatoes on top of toast and sprinkle with half of the parsley-garlic mixture. Spoon shrimp and any buttery sauce in the skillet over the tomatoes and toast. Finish with remaining parsley-garlic mixture and serve with lemon wedges alongside."}]}