{"@context": "http://schema.org", "@type": "Recipe", "name": "Embutido", "description": "There’s a perception that Filipino food is rustic and uncomplicated, but when my lola taught me to make chicken relleno — chicken stuffed with embutido, a kind of meatloaf — I realized that she was using the same techniques I’d learned in professional kitchens cooking French food. She was very particular about ingredients. Even when her memory started fading, her first question when she saw me was always “Are you using chorizo de Bilbao?” (Yes, Lola.) Here, embutido is a centerpiece dish in its own right. I tried chopping the meat for texture, but whipping the ingredients in a food processor, the way my lola did it, integrates everything better.", "author": {"@type": "Person", "name": "Angela Dimayuga"}, "image": "https://static01.nyt.com/images/2019/10/09/dining/08Filipinorex7-embutito/merlin_160617825_92adeb15-dde3-42dd-a69b-562d22d1c1d3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "8 to 10 servings", "recipeCuisine": "filipino", "recipeCategory": "dinner, meat, project, sausages", "keywords": "chorizo, ground pork, olives, parmesan, pickles, raisins, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 51}, "recipeIngredient": ["1 teaspoon plus 1 tablespoon kosher salt", "9 large eggs", "8 ounces chorizo de Bilbao (3 links)", "6 tablespoons unsalted butter (3/4 stick), softened", "3/4 cup finely grated Parmesan", "1/4 cup finely chopped bread-and-butter pickles (1/4-inch pieces)", "1/4 cup finely chopped pitted green olives (1/4-inch pieces)", "1/4 cup raisins", "4 garlic cloves, finely chopped", "1 teaspoon coarsely ground black pepper", "1 pound ground pork", "Flaky sea salt, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan of water to a boil over high with 1 teaspoon salt, and set up an ice bath in a large bowl. Carefully drop 6 eggs into the hot water, one at a time, reduce the heat to a gentle simmer over low and cook, 9 minutes. Transfer eggs to the ice bath and let cool. Drain, then carefully peel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roughly chop the chorizo, then transfer to a food processor. Give it a few quick pulses to break into small crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, add the chorizo, butter, Parmesan, pickles, olives, raisins, garlic, pepper and remaining 1 tablespoon salt and stir to combine. Crack in the remaining 3 eggs. Add the pork and gently mix to combine. (You’ll want to work lightly to avoid packing the meat mixture tightly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear two 15-inch-long sheets of aluminum foil. Divide the meat mixture into four portions. Position one sheet of aluminum foil in front of you, with one long side nearest you. Arrange one portion of meat in a 3-by-10-inch rectangle lengthwise in the center of the aluminum foil. Lay 3 whole, peeled hard-boiled eggs lengthwise across the top of the meat mixture, leaving about 1 inch between each egg. (You want to leave space between the eggs, so you can fully wrap them in meat to protect them from overcooking.) Add one portion meat mixture on top, tucking the meat between the eggs and around the edges and flattening the meat mixture on top. Pat the mixture into a log, completely encasing the eggs with meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with the long edge nearest to you, lift the foil, and fold it away from you to completely cover the log, then roll the log gently until it’s covered lengthwise with foil. Tuck in the sides: Starting on one side, where the foil overlaps, fold that edge in tightly over the meat, then create four additional folds in a clockwise motion until the end of the embutido is fully covered. Set the torchon vertically, sitting it on the sealed base you’ve just created, and do the same to the top, sealing it shut in five folds and pressing down to eliminate any air gaps. Repeat with remaining meat and eggs, forming a second torchon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear a 16-inch length of plastic wrap, and set one torchon in the center of the plastic wrap. Lift the length of plastic wrap closest to you to cover the torchon, then roll the torchon away from you to the edge of the plastic wrap until the torchon is covered lengthwise. Twist the excess plastic wrap tightly at both tips. Repeat two more times, using two more layers of plastic wrap, then after third layer, using your dominant hand, tightly grasp one twist of the torchon. Using your other hand, roll the torchon on the surface toward you, while keeping the twist secure with your dominant hand, increasing tension to create a compact cylindrical shape. Tie the excess twist into a knot, then twist and knot the other end tightly to secure. Your torchon should be roughly 2 1/2 by 10 inches, roughly the size of a salami. Repeat with remaining torchon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer torchons to a large cast-iron pot or deep roasting pan. Cover completely with room temperature water (torchons will float). Transfer both to the middle rack of the oven and cook until pork is cooked through, about 1 hour. (Pierce with cake tester, then hold the cake tester up to the bottom of your lip: If it feels hot, the meat is cooked through.) Remove torchons from the water, and rest on a cutting board to cool and set, about 10 minutes. Unwrap them and cut into slices. When unwrapping, beautiful cooking juices will be released; save them for serving. Transfer embutido slices to a platter and drizzle with reserved cooking juices. To serve, sprinkle with flaky sea salt."}]}