{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Caprese", "description": "Originating in Capri, Caprese mimics the colors of the Italian flag in salad form using the now-classic combination of mozzarella, tomato and basil. Here, that trinity transforms everyday chicken cutlets into something special. Thanks to the proliferation of hothouse tomatoes (which are better enjoyed cooked than raw), this dish can be enjoyed year-round. Cocktail tomatoes, slightly larger than a golf ball and often sold on the vine, are perfect for this, but any size will work. Simple to assemble, this dish forms its own delicious pan sauce as the liquid from the cheese and tomatoes mingles with the caramelized juices from the browned chicken.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/05/08/dining/ss-chicken-caprese/ss-chicken-caprese-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, quick, one pot, poultry", "keywords": "basil, chicken breast, mozzarella, pesto, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1240}, "recipeIngredient": ["4 boneless, skinless chicken breasts (6 to 8 ounces each)", "Kosher salt and black pepper", "8 ounces mozzarella, cut into 1/4-inch slices", "6 ounces cocktail or other tomatoes, cut into 1/2-inch slices", "1 1/2 cups loosely packed fresh basil leaves", "1 tablespoon olive oil", "4 garlic cloves, thinly sliced", "Pesto, store-bought or <a href=\"https://cooking.nytimes.com/recipes/2653-basic-pesto\">homemade</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat chicken dry. Cut a lengthwise pocket into the thick side of each breast without cutting all the way through to the other side. Season breasts inside and out using 3/4 teaspoon salt and 1/2 teaspoon pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff each breast with a quarter of the mozzarella, 2 to 3 tomato slices (depending on size) and 4 to 5 basil leaves. Enclose the filling as much as possible by pulling the chicken over the filling. (The chicken can be prepared to this point, covered and refrigerated up to 24 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a large 12-inch nonstick pan over medium heat. Sauté garlic, stirring, until golden, about 4 minutes. Using a slotted spoon, scoop out garlic and transfer to a paper towel-lined plate, leaving the oil in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium-high and sauté chicken until golden on the bottom, about 6 minutes. If the breasts darken too quickly, lower heat. Flip and cook for 5 minutes, then cover and cook 2 to 3 minutes more, or until chicken is cooked through and filling is hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spatula, carefully transfer chicken to a platter or four plates. Pour pan juices over the chicken. Garnish with pesto, reserved garlic and remaining basil leaves."}]}