{"@context": "http://schema.org", "@type": "Recipe", "name": "Sheet-Pan Italian Sub Dinner", "description": "The Italian sub, a deli sandwich that piles some combination of cheese, cured meats and preserved vegetables onto a soft roll, is an Italian-American classic. But toss those fillings onto a sheet pan and hit them with a little heat, and they caramelize and crisp into a complete dinner with loads of character — sweet and spicy, bitter and briny. In this recipe, salami, red onions, pepperoncini, tomatoes, radicchio and chickpeas get tossed with an oregano-garlic vinaigrette before roasting. The radicchio and red onion mellow, the tomatoes sweeten and the salami releases fat and seasonings that add even more flavor and richness. (You can swap in cauliflower florets, cubes of squash or halved red potatoes for the radicchio.) Serve with a plop of ricotta for creaminess (or provolone and Parmesan, for a more traditional take), more vinaigrette and crusty bread for sopping it all up or piling it into a sandwich.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2020/01/14/dining/as-sheet-pan-italian-sub/as-sheet-pan-italian-sub-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, weekday, sandwiches, sausages, vegetables", "keywords": "chickpea, radicchio, red onion, red wine vinegar, ricotta, salami, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 451}, "recipeIngredient": ["4 garlic cloves", "2 tablespoons dried oregano", "Kosher salt and black pepper", "1/4 cup red wine vinegar", "1/4 cup extra-virgin olive oil", "1 (14-ounce) can chickpeas, drained and patted dry", "5 ounces salami (casing removed if there is one), cut into 1/2-inch pieces", "1 red onion, peeled, halved lengthwise and cut into 1/2-inch wedges", "1 medium head radicchio (about 3/4 pound), quartered lengthwise", "1 cup cherry or grape tomatoes, halved", "8 pepperoncini peppers", "1/2 cup ricotta", "Crusty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Coarsely chop the garlic, then add the dried oregano and 2 teaspoons salt on top of the garlic and chop together until it forms a paste. Transfer to a bowl, then stir in the vinegar and olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour half the dressing into a large bowl, then add the chickpeas, salami, red onion, radicchio, tomatoes and pepperoncini. Mix gently to coat in the dressing, trying not to break up the radicchio and red onions, then spread evenly on a baking sheet. Roast, tossing halfway through, until the red onions and chickpeas are golden, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the ricotta with salt and pepper. Serve the roasted mixture with crusty bread, with a dollop of ricotta and extra vinaigrette, or assemble into sandwiches."}]}