{"@context": "http://schema.org", "@type": "Recipe", "name": "Pressure Cooker Chicken With 40 Cloves of Garlic", "description": "Typically, chicken with 40 cloves of garlic needs to cook for a long time to mellow out all that garlicky sharpness, but in this recipe, a pressure cooker softens and sweetens the garlic in record time. Still, 40 cloves is for the most dedicated garlic lovers, so feel free to reduce the quantity if you like; the recipe will work all the same. The addition of beans to the classic dish makes it a one-pot meal. The chicken skin won’t be crisp at the end of cooking, so if that bothers you, discard it afterward — it will have done its duty, imparting deep chicken flavor to the dish — or you could place the thighs on a baking sheet and set them under the broiler to brown just before serving.", "author": {"@type": "Person", "name": "Sarah DiGregorio"}, "image": "https://static01.nyt.com/images/2020/01/30/dining/sdg-pressure-cooker-chicken-and-white-beans-with-garlic/merlin_168064362_a8446dc8-3c24-436a-9124-82ed4734c638-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, beans, one pot, poultry", "keywords": "cannellini beans, chicken thigh, garlic, lemon, white wine, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "recipeIngredient": ["2 pounds bone-in, skin-on chicken thighs (about 4 to 6 large thighs)", "Kosher salt and black pepper", "2 tablespoons olive oil", "40 garlic cloves (3 to 4 heads of garlic), smashed", "1/2 teaspoon red-pepper flakes", "1/2 cup white wine", "1 tablespoon white wine vinegar", "1 (28-ounce) can or 2 (14-ounce) cans cannellini beans, drained", "2 fresh thyme sprigs or 1/2 teaspoon dried thyme", "1/2 lemon, juiced (about 1 tablespoon)", "2 scallions, white and light green parts thinly sliced", "1/2 cup chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the chicken generously all over with salt and pepper. Turn on the sauté setting of a 6- to 8-quart electric pressure cooker and warm the oil. Add the chicken, skin-side down, and sear until the skin is browned and releases easily from the pot, 6 to 8 minutes. (If you have more than 4 thighs, you may need to do this in two batches.) Using tongs, remove the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic and sauté, stirring constantly, until just softened, about 2 minutes. Add the red-pepper flakes, and toast, stirring constantly, about 30 seconds, then add the white wine and vinegar. Stir well, scraping up all the browned bits. Turn off the sauté setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the beans and thyme. Season lightly with salt and generously with pepper. Nestle the chicken thighs on top, skin-side up. Cook on high pressure for 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the pressure to reduce naturally for 10 minutes, then release the remaining pressure manually. Squeeze in the lemon juice and fold in the scallions and parsley. Serve the beans and chicken in shallow bowls."}]}