{"@context": "http://schema.org", "@type": "Recipe", "name": "Mint Chocolate Chip Ice Cream Cake", "description": "With just a 9-by-13 pan, a spoon and four store-bought ingredients, you can make an ice cream cake that’s creamy, crunchy and fudgy in every bite. It starts with crushed chocolate-mint cookies that are covered with mint chocolate chip ice cream. Next, it’s topped with a layer of ice cream sandwiches, with their cakey cookies and vanilla ice cream. Follow that with more mint chip ice cream, and you’ve made a six-layer cake without breaking a sweat. Feel free to experiment here: Swap out the mint cookies for <a href=\"https://cooking.nytimes.com/recipes/1018581-snickerdoodles\">snickerdoodles</a>, pretzels or broken waffle cones, and the mint-chip ice cream for coffee, peanut butter or strawberry ice cream — or any combination that sounds good to you. Slice the cake into pieces big or small, then drizzle them with hot fudge or Magic Shell. This cake serves a crowd, but you can halve the ingredients and build it in an 8-by-8-inch pan for a smaller group.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/07/29/dining/as-mint-chocolate-chip-ice-cream-cake2/merlin_158598186_2e9c4227-25ca-497d-ba76-ed5a12e199de-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "One 9-by-13-inch cake (15 to 18 servings)", "recipeCuisine": "", "recipeCategory": "cakes, ice creams and sorbets", "keywords": "chocolate, hot fudge sauce, ice cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 307}, "recipeIngredient": ["2 cups coarsely crushed crisp chocolate-mint or chocolate cookies (about 10 ounces)", "2 (1.5-quart) cartons or 6 pints mint chocolate chip ice cream", "12 full-size rectangular ice cream sandwiches", "Store-bought or <a href=\"https://cooking.nytimes.com/recipes/6094-hot-fudge-sauce\">homemade hot fudge sauce</a> or <a href=\"https://cooking.nytimes.com/recipes/1013489-chocolate-shell-ice-cream-topping\">Magic Shell</a>, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 9-by-13-inch pan with two layers of plastic wrap, leaving a few inches of overhang on all sides. Open all of the ice cream containers. Place one 1 1/2 quart (or 3 pints) on the counter and let soften until it resembles thick cake batter, 5 to 10 minutes; you’ll use this ice cream first. Place the other containers in the refrigerator to soften while you build the first half of the cake. (Ice cream will reach the desired consistency in the refrigerator in 20 to 30 minutes.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the crushed cookies in a thin, even layer across the bottom of the pan. Spoon the first softened container of ice cream over the cookies and spread into an even layer. Press down as you go to adhere the ice cream to the cookies. If at any point the ice cream is melting to liquid, pop the cake and ice cream in the freezer to firm to a spoonable consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pan in the freezer while you unwrap the sandwiches. Top the ice cream with a layer of ice cream sandwiches, cutting some as needed to fill the layer to the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the remaining ice cream over the top and spread into an even layer. Cover with plastic wrap and freeze until firm, at least 2 hours or up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, use the plastic overhang to remove the cake from the pan. Cut into squares or rectangles and serve with a drizzle of hot fudge or Magic Shell. If you’re finding the cake too solid to cut, don’t wait for it to soften: Warm your knife by running it under hot water and wiping it dry between cuts."}]}