{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemony Pasta With Kelp, Chile and Anchovies", "description": "Kelp, a hardy seaweed sold fresh, frozen or dried, gives this lemony pasta dish a salty depth that’s also extremely nutrient-dense. A little like pesto, the garlicky sauce coats the rigatoni in a bright green purée, flecked with darker bits of chopped parsley. Don’t skimp on the anchovies; they underscore the ocean flavor of the kelp, adding an appealing umami richness.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/04/26/dining/30seaweedrex2/merlin_153567012_4f90fd82-c1a7-4b3d-a145-fe4ae1245441-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, pastas", "keywords": "anchovy fillets, kelp, parsley, rigatoni, seaweed, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 116}, "recipeIngredient": ["Kosher salt, as needed", "1 pound rigatoni or other pasta", "4 to 8 anchovy fillets, chopped", "4 large garlic cloves, finely grated or minced", "1 1/2 teaspoons finely grated lemon zest, plus fresh lemon juice, to taste", "1/4 teaspoon red-pepper flakes, or to taste", "1/4 cup extra-virgin olive oil, plus more for serving", "1/2 cup/70 grams kelp purée or thawed kelp smoothie cubes (see Note)", "1/2 cup finely chopped parsley, plus more for serving", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook until just shy of al dente, usually 1 to 2 minutes earlier than the cooking time suggested on the packaging. Reserve 1 cup pasta water, then drain pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a medium bowl, stir together anchovies, garlic, lemon zest and red-pepper flakes to make a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 12-inch skillet, heat 1/4 cup oil over medium. Add anchovy paste and cook, stirring, until the anchovies begin to dissolve, about 2 minutes. Add kelp and cook, stirring, until slightly thickened, 1 to 2 minutes. Stir in 1/2 cup parsley and the butter. Add the pasta and toss to coat. If the mixture seems dry, add some of the reserved pasta water, tossing to coat the pasta with sauce. Season with salt and lemon juice, to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish with more parsley, drizzle with oil, if desired, and serve immediately."}]}