{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Swordfish With Smoky Tomato-Anchovy Salsa", "description": "This is a simple summer fish dish with robust flavors. Swordfish would be the first choice, for its meatiness and ease of grilling, but any firm-fleshed white fish, such as halibut, monkfish, corvina or snapper, is a suitable option. Tuna would also work, but for that matter, so would chicken breast, for those at your gathering who don’t eat fish. Topped with an easily made salsa of cherry tomatoes, anchovy, hot pepper and smoky pimentón, the whole affair is rather salad-like, best accompanied by arugula or lettuce leaves. Serve with roasted potatoes or garlic toast for a casual picnic-style summer supper.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/07/03/dining/28kitchenrex/merlin_156916815_308c1d1d-1ed8-4ceb-86a4-ccd5abdb529d-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, seafood", "keywords": "anchovies, swordfish, tomato, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 256}, "recipeIngredient": ["4 (8-ounce) swordfish steaks, cut ¾-inch thick", "Salt and pepper", "Extra-virgin olive oil", "3 tablespoons red-wine vinegar, or to taste", "1 teaspoon smoked Spanish paprika (Pimentón de la Vera)", "1 teaspoon tomato paste", "2 small garlic cloves, smashed to a paste", "1 medium red onion, diced small (about 1 cup)", "1 sweet red pepper, diced (about 1 cup)", "2 Fresno chiles, seeds removed and finely diced", "4 anchovy fillets, chopped, plus 4 whole fillets for garnish", "2 cups halved cherry tomatoes in different colors", "Pinch of dried oregano", "Arugula leaves, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal grill or heat a gas grill. (Alternatively, use a cast-iron skillet or stovetop grill pan over medium-high heat.) Place swordfish steaks on a baking sheet and season on both sides with salt and pepper. Drizzle each with 1 teaspoon olive oil and rub with fingers to coat. Leave at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, put vinegar, smoked paprika, tomato paste and garlic. Stir to dissolve tomato paste. Add onion, sweet pepper, chiles and 4 chopped anchovy fillets, and stir everything together. Add pinch of salt and ½ to ¾ cup olive oil and stir again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cherry tomatoes, lightly season with salt and pepper, then gently fold them into the mixture. Leave to marinate about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill the swordfish steaks over medium-hot coals for about 4 minutes per side. Remove when you see juices begin to rise on second side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to plates or a large platter. Stir salsa and spoon generously over fish. Sprinkle with oregano. Garnish with whole anchovy fillets. Surround with a generous amount of arugula and serve."}]}