{"@context": "http://schema.org", "@type": "Recipe", "name": "Mexican-Style Atole", "description": "Atole, a hot, corn-based drink popular in Central America, provides warmth and comfort when the chilly weather hits. This Mexican-style version, from Veronica Ruiz, a home cook who grew up in Mexico City and immigrated to the United States in the 1990s, is made with milk, cinnamon, piloncillo (pure cane sugar) and masa harina, a finely ground corn flour also used to make tamales and tortillas. You can find strawberry, coconut, chocolate and many other flavor variations of atole, but this one is rich and satisfying, and allows the corn flavor to shine.", "author": {"@type": "Person", "name": "Kiera Wright-Ruiz"}, "image": "https://static01.nyt.com/images/2019/12/23/dining/kwr-atole/kwr-atole-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 cups", "recipeCuisine": "mexican", "recipeCategory": "non-alcoholic drinks", "keywords": "brown sugar, cinnamon stick, masa harina, milk, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 11}, "recipeIngredient": ["4 ounces piloncillo (pure cane sugar) or 1/2 cup packed dark brown sugar", "1 (4-inch) cinnamon stick (preferably Ceylon)", "Pinch of kosher salt", "2 cups whole milk", "1/2 cup masa harina (preferably Maseca brand)", "Ground cinnamon for dusting (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine 2 cups water with the piloncillo, cinnamon and salt. Bring to a boil over high heat, stirring occasionally until the piloncillo is fully dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the mixture comes to a boil, whisk together the milk and masa harina in a large measuring cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the water is boiling, reduce heat to medium. Add the milk mixture gradually, whisking continually to ensure the masa doesn’t clump or sink to the bottom. Cook the atole, whisking constantly, until it is thick enough to evenly coat the back of a wooden spoon, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and discard cinnamon stick. Serve while hot, and dust with ground cinnamon as a garnish, if desired."}]}