{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Muffins With Candied Almonds", "description": "Classic strawberry muffins get a few modern twists in this cheery take. First, egg yolks replace whole eggs, resulting in a richer, more flavorful crumb. The muffins get a double dose of strawberries: diced fresh berries in the batter and an optional dusting of freeze-dried strawberries on top. Finally, a reserved egg white is tossed with sugar and sliced almonds to make a crunchy topping for the muffins. As always, for the best flavor, pick the ripest, brightest strawberries of the bunch.", "author": {"@type": "Person", "name": "Jerrelle Guy"}, "image": "https://static01.nyt.com/images/2019/05/08/dining/jg-strawberry-muffins/jg-strawberry-muffins-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "12 muffins", "recipeCuisine": "american", "recipeCategory": "breakfast, brunch, breads, cakes, quick breads", "keywords": "almonds, lemon, milk, strawberries, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 129}, "recipeIngredient": ["1 1/3 cups/320 milliliters whole milk", "1 tablespoon fresh lemon zest plus 2 tablespoons lemon juice (from 1 lemon)", "3 1/2 cups/450 grams all-purpose flour", "1 tablespoon baking powder", "1 teaspoon kosher salt", "2 eggs, whites and yolks separated", "1 1/2 cups/300 grams granulated sugar, plus 1 tablespoon for the topping", "1 cup/95 grams sliced almonds", "12 tablespoons/170 grams unsalted butter (1 1/2 sticks), melted and cooled", "2 cups/370 grams fresh strawberries, finely chopped", "1/3 cup/5 grams freeze-dried strawberries (optional)", "1 tablespoon confectioners’ sugar (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Line a standard muffin tin with 12 paper liners."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a cup, stir together the milk, lemon zest and juice; set aside to curdle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, sift the flour, baking powder and salt. Whisk to evenly distribute; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk 1 egg white (save the other for another use) with 1 tablespoon granulated sugar until slightly frothy. Fold in the almonds; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, whisk the 1 1/2 cups granulated sugar and butter until combined. Add egg yolks and continue whisking vigorously until the batter is slightly aerated, 1 to 2 minutes. Using a rubber spatula, alternate adding 1/3 of the flour mixture and 1/3 of the milk mixture, folding gently, until you’ve added three batches of each beginning with the flour and ending with the milk. The batter will be thick. Gently fold in the fresh berries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the batter among the liners in the muffin tin. (The liners will be very full, but the muffins will not rise much while baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pinch the almond mixture between your fingers and let the excess egg whites drain away before dividing evenly all over the tops of the muffins. Bake for 12 minutes, then lower the temperature to 325 degrees and continue baking until a toothpick inserted into the muffins comes out clean, 20 to 22 minutes, rotating the pan halfway through. Let cool for 5 minutes, then gently remove the muffins from the pan to cool completely before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mortar and pestle, food processor or resealable bag, combine the freeze-dried strawberries and confectioners’ sugar, if using, and crush until fine. Dust generously over the cooled muffins using a fine-mesh strainer."}]}