{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Roast Chicken With Caramelized Shallots", "description": "Chicken, shallots, a splash of oil and vinegar — that’s all you need to make this deeply flavorful one-pot dish. The shallots caramelize and sweeten under the crisping chicken, while vinegar adds tang to keep things interesting. You could toss in mustard, herbs, fresh chile or toasted spices with the vinegar for a twist. Don’t forget some crusty bread or rice; you’ll want either as a landing pad for the sweet, schmaltzy shallots and pan juices.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/12/18/dining/as-roast-chicken-with-shallots/as-roast-chicken-with-shallots-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, poultry", "keywords": "chicken, shallot, vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 246}, "recipeIngredient": ["3 to 4 pounds bone-in, skin-on chicken pieces", "Kosher salt and black pepper", "1 tablespoon extra-virgin olive oil", "15 shallots, peeled, trimmed and halved through the root", "2 tablespoons sherry vinegar, red wine vinegar or balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Pat the chicken dry and season it on all sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large (12-inch) oven-proof skillet, working in batches as needed to avoid crowding, add the oil, then add the chicken pieces, skin-side down. Turn the heat to medium-high and cook, undisturbed, until the skin is crisp and releases easily from the skillet, and the fat is rendered, 8 to 10 minutes. Transfer to a plate and repeat with additional chicken pieces as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shallots to the skillet, season with salt and pepper and arrange so most are cut-side down. Cook, undisturbed, until browned, 4 to 5 minutes. Flip the shallots and repeat until browned on the other side, another 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vinegar and scrape the bottom of the pan to release any browned bits. Add the chicken, skin-side up, on top of the shallots. Roast until the shallots have collapsed and the chicken is cooked through, about 45 minutes. Check the chicken halfway through. If the skillet looks dry, add a few tablespoons of water. Serve the chicken and shallots with the pan juices."}]}