{"@context": "http://schema.org", "@type": "Recipe", "name": "Thumbprints With Dulce de Leche, Nutella or Jam", "description": "Thumbprints are the simplest of cookies, but these are packed with flavor from freshly toasted nuts, each paired with its own filling: pecans with dulce de leche (or homemade caramel sauce, if you have some on hand), hazelnuts with Nutella, or pistachios with a festive pool of red currant jelly in the center. Choose a single combination, or make a batch of each. These cookies benefit from forming the thumbprint halfway through baking, but if you can't take the heat, let the dough soften a bit and then press the thumbprints into the dough before baking.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-thumbprints/ss-thumbprints-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 dozen cookies", "recipeCuisine": "american", "recipeCategory": "snack", "keywords": "dessert, dulce de leche, hazelnut, jelly, nutella, nuts, pecan, pistachio", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 385}, "recipeIngredient": ["3 ounces/85 grams whole hazelnuts (1/2 cup plus 2 tablespoons), whole pecans (3/4 cup plus 2 tablespoons), or whole pistachios (about 2/3 cup)", "2 1/4 cups/290 grams all-purpose flour, plus 2 teaspoons", "1 cup/225 grams unsalted butter (2 sticks), softened", "2/3 cup/135 grams granulated sugar", "2 large egg yolks, at room temperature", "1 teaspoon vanilla extract", "1/2 teaspoon kosher salt", "1/3 cup dulce de leche (for pecan cookies), Nutella (for hazelnut cookies) or red currant jelly (for pistachio cookies), for filling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Spread the hazelnuts or pecans out on a small baking sheet and cook in oven, shaking several times, until toasted, 10 to 12 minutes. If using hazelnuts, transfer to a bowl to cool, cover with a folded dish towel, then rub off the skins. (No need to toast the pistachios.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cooled, transfer the nuts to a food processor, preferably a mini one. Add 2 teaspoons flour and pulse just until nuts are finely ground, being careful not to overprocess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a stand mixer fitted with the paddle attachment, cream together butter and granulated sugar on medium-high speed until light and fluffy, 2 to 3 minutes, scraping bowl as needed. Add egg yolks and vanilla, and beat on medium-high speed until well combined, about 2 minutes, scraping the bowl a few times as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1/2 cup ground nuts, the salt and the remaining 2 1/4 cups flour; beat on low speed just until combined, then increase speed and beat until dough starts to clump together. Scrape the bowl and fold a few times to make sure everything is well mixed. Wrap dough in plastic wrap, flatten into a disk, and chill until firm, at least 1 hour and up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Pinch off small pieces of dough the size of a rounded tablespoon (about 20 grams each) and roll the top half of each one in the remaining ground nuts. Place a few inches apart on parchment- or silicone mat-lined baking sheets. Chill in the freezer until firm, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 8 minutes, remove from oven and make a thumbprint in each cookie. Bake until golden brown on the bottom, and nuts are looking toasty but not burned, 6 to 8 minutes longer. Let cool a few minutes on the baking sheets and transfer to wire racks to cool further. While the cookies are still a little warm, fill each one with about 1/2 teaspoon of filling, and cool completely. Sprinkle with flaky sea salt. Cookies will keep in an airtight container at room temperature for up to 1 week."}]}