{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pan Chicken With Peperonata and Olives", "description": "Peperonata is a classic Italian side of tangy stewed peppers that is often served with meat, stirred into pasta or draped over crostini. There are many regional varieties (the traditional Sardinian recipe uses only yellow peppers, while the Venetians add eggplant), but this combination of roasted peppers, tomatoes, olive oil and vinegar creates a vibrant, versatile sauce. Olives add a hint of brine, but capers would also do the trick. In this version, boneless, skinless chicken breasts roast directly on top for a no-fuss, one-dish meal. (You could also use chicken thighs, but you’d need to increase the cook time.) Serve this dish with any short pasta, rice or toasted country bread — and any leftovers tucked into a sandwich or tossed into salad.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/02/15/dining/kc-pepperonata/kc-pepperonata-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weeknight, casseroles, poultry", "keywords": "cherry tomatoes, chicken breast, olives, red bell pepper, yellow bell pepper, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 207}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 591, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "5 grams", "proteinContent": "65 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1482 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 medium red bell peppers (about 1 pound), cored, seeded and sliced 1/2-inch-thick", "2 medium yellow bell peppers (about 1 pound), cored, seeded and sliced 1/2-inch-thick", "5 garlic cloves, thinly sliced", "3 thyme sprigs", "5 tablespoons extra-virgin olive oil", "Kosher salt and ground pepper", "10 ounces cherry or grape tomatoes (about 2 cups)", "4 ounces pitted green olives, coarsely chopped (about 3/4 cup)", "1 tablespoon red wine vinegar", "4 boneless, skinless chicken breasts (1 1/2 to 2 pounds total)", "Chopped chives, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. In a 9-by-13-inch or 3-quart baking dish, combine bell peppers, garlic, thyme and 4 tablespoons oil. Season with salt and pepper, toss to coat and arrange in an even layer. Roast until softened, about 20 minutes. Stir in tomatoes, olives and vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine chicken with remaining 1 tablespoon oil and season with salt and pepper. Toss to coat and arrange on top of pepper mixture. Roast until chicken is golden and cooked through and peperonata is tender and saucy, about 25 minutes. Discard thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide chicken among plates and top with peperonata and remaining pan juices. Sprinkle with chives."}]}