{"@context": "http://schema.org", "@type": "Recipe", "name": "Spanakopita", "description": "Spanakopita, the classic Greek savory pie, is elegant and impressive, yet easy to make. The star ingredient is spinach, and lots of it (two pounds to be exact). This pie tastes best when made with fresh spinach, though you could also use the same amount of frozen spinach — just be sure to thaw completely and squeeze out all the excess water before using. This recipe can be baked a day ahead and stored in the refrigerator overnight, then rewarmed at 400 degrees until heated through, about 15 minutes. Cut into small squares or triangles to serve as an appetizer, or for a more complete meal, serve larger squares of the pie alongside soup or salad.", "author": {"@type": "Person", "name": "Kay Chun"}, "image": "https://static01.nyt.com/images/2019/03/14/dining/kc-spanakopita/kc-spanakopita-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "One 9-by-13-inch pie", "recipeCuisine": "greek", "recipeCategory": "casseroles, vegetables", "keywords": "feta, parsley, phyllo, spinach, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 183}, "recipeIngredient": ["3 tablespoons extra-virgin olive oil", "1 cup finely chopped onion", "5 scallions, trimmed and finely chopped (about 3/4 cup)", "2 tablespoons minced garlic", "Kosher salt and black pepper", "2 pounds baby spinach (32 ounces)", "2 large eggs", "1 1/4 cups crumbled feta (6 ounces)", "1/2 cup grated Parmesan (2 ounces)", "1/2 cup chopped parsley", "1/2 cup/115 grams unsalted butter (1 stick), melted", "8 sheets frozen phyllo dough, thawed and halved crosswise"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, heat oil over medium. Add onion, scallions and garlic, season with salt and pepper and cook, stirring occasionally, until softened, 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In batches, stir in spinach until wilted, about 3 minutes. Season with salt and pepper. Strain spinach mixture through a sieve, pressing out excess liquid to prevent a soggy crust. Transfer to a large bowl and cool for 5 minutes. Add eggs, feta, Parmesan and parsley and stir until combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Lightly grease a 9-by-13-inch pan (2 inches deep) with butter. Lay one half sheet of phyllo dough in baking dish. Using a pastry brush, brush dough with butter. Repeat 7 more times to form crust. Spread spinach mixture evenly over crust. Brush one half sheet of phyllo dough with butter and lay on top of filling, butter side up. Repeat with remaining 7 sheets of dough. Using a serrated knife, lightly score top layer of dough into squares (this will make it easier to cut once baked). Bake until crust is lightly golden and filling is heated through, 50 to 60 minutes. Serve warm."}]}