{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Pears With Rosemary, Honey and Walnuts", "description": "This beautiful, aromatic autumn dessert can be prepared several hours in advance, then re-warmed to serve. Feel free to use any variety of pear, and serve with vanilla ice cream, if desired.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/10/02/dining/27tannisrex3-pears/merlin_161340753_240d60d6-d1bf-46bd-bdda-dbbc9b0ddd60-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "anise, cinnamon, pear, rosemary, walnut, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 121}, "recipeIngredient": ["6 small, slightly under-ripe pears, such as Bartlett, unpeeled, halved and cored", "2 star anise pods", "1 (2-inch) piece cinnamon stick", "1/2 teaspoon fennel seeds", "2 whole cloves", "1/2 cup light brown sugar", "1/2 cup golden raisins", "1/4 cup dark rum", "3 tablespoons lemon juice", "3 tablespoons unsalted butter, cut in small cubes", "2 tablespoons mild honey", "1 tablespoon rosemary leaves, from a small sprig", "1/2 cup roughly chopped walnuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Choose a baking dish or roasting pan large enough to hold pears in one layer, or use 2 pans. Scatter star anise, cinnamon stick, fennel seeds and cloves on bottom of dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put pears in a large mixing bowl. Add brown sugar, raisins, rum and lemon juice. Coat pears evenly with mixture. Transfer to baking dish, cut-side down, in one layer. Dot with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake, uncovered, until pears are soft and well caramelized, about 45 minutes. Remove pears from oven, and let them sit at room temperature. Shortly before serving, drizzle the pears with honey, and sprinkle them with rosemary leaves and chopped walnuts. Bake for 10 minutes. Serve warm with plenty of sauce from the baking pan."}]}