{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Cheeseburgers", "description": "The new generation of vegan meat alternatives, such as Impossible and Beyond, are at their best when still medium-rare and juicy. Flipping the patties frequently as they cook ensures an evenly cooked interior and good flavor development on the exterior. To make the burgers vegetarian, feel free to use any good melting cheese, such as American, Cheddar or Swiss, but to make them strictly vegan, be sure to look for vegan burger buns, as standard supermarket burger buns frequently contain milk or other dairy products.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2020/03/04/dining/03fakemeatrex-cheeseburgers/merlin_168791004_aad8d605-35c1-4037-800f-4ea3260fc410-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 cheeseburgers", "recipeCuisine": "american", "recipeCategory": "easy, quick, weekday, burgers", "keywords": "cheese, vegan ground meat, main course, vegan", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "recipeIngredient": ["1 pound vegan ground meat, such as Impossible or Beyond", "Kosher salt and freshly ground black pepper", "1 teaspoon vegetable oil", "4 slices vegan cheese, such as Cheddar-style", "4 vegan hamburger buns, lightly toasted", "Toppings and condiments, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide vegan ground meat into 4 equal pieces. Pick up one piece, transfer to a cutting board, and use your hands to press and shape it into a patty about 1/4-inch wider than your bun. Repeat to form remaining patties. Put three fingers of one hand together, and press a shallow indentation into the center of each patty. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat oil over medium-high until shimmering. Add patties and cook, flipping frequently, until well browned and an instant-read thermometer inserted into the coolest part of the center of the patty registers 120 to 125 degrees for medium-rare, or 130 to 135 degrees for medium. Immediately add cheese slices to the top of the patties, and transfer them to a large plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dress bottom buns as desired. Place a patty on top, and dress top bun as desired. Close cheeseburgers and serve."}]}