{"@context": "http://schema.org", "@type": "Recipe", "name": "Skillet Greens With Runny Eggs, Peas and Pancetta", "description": "Whether you serve it for brunch or supper, this dish of skillet-baked eggs, greens and crunchy bits of pancetta is a light but deeply savory meal. In spring, ramps give the chard a particularly pungent kick, but milder scallions work just as well and are a lot easier to find all year round. If you want to make this vegetarian-friendly, skip the pancetta and add a dusting of cheese right at the end. Serve this with a side of toasted country bread or scoop it out onto a bed of buttery polenta.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/05/08/dining/03apperex/03apperex-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "breakfast, weekday, one pot, vegetables", "keywords": "bacon, chard, eggs, peas, scallion, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 356}, "recipeIngredient": ["2 ounces pancetta or 2 thick-cut slices bacon, diced", "3 tablespoons extra-virgin olive oil", "1 bunch ramps or scallions, thinly sliced, whites and greens separated", "2 bunches red, rainbow or Swiss chard, stems thinly sliced and leaves coarsely chopped", "2 garlic cloves, finely grated or minced", "1/4 teaspoon fine sea salt, plus more to taste", "Pinch of red-pepper flakes", "3/4 cup chicken or vegetable broth, or water", "2/3 cup fresh or frozen peas (you don’t have to thaw them if frozen)", "6 large eggs", "Toasted country bread or baguette, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pancetta and 1 tablespoon oil to a 10-inch skillet and turn the heat to medium. Cook, stirring occasionally, until fat has rendered and the pancetta is golden brown and crisp, about 5 to 7 minutes. Use a slotted spoon to transfer pancetta to a paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the same skillet, add remaining 2 tablespoon oil, ramp or scallion whites, and chard stems, and cook until softened, stirring occasionally, about 7 minutes. Stir in garlic, salt and red pepper and cook for another 1 to 2 minutes, until fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chard leaves, ramp or scallion greens, and broth, set the heat to medium-low, and cook partly covered, until very soft and silky, stirring occasionally, about 20 minutes. If using fresh peas, add them during the last 5 minutes of cooking; if using frozen peas, stir them in when the greens are cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Crack eggs into the greens. Season eggs with salt and pepper, then cover pan completely and cook until eggs are cooked to taste, 5 minutes for very runny, 7 minutes for jammy. Sprinkle with pancetta and serve with toast if you like."}]}