{"@context": "http://schema.org", "@type": "Recipe", "name": "Marinated Feta With Herbs and Peppercorns", "description": "The best recipes often make a good ingredient great through minimal effort. For this easy appetizer, start with good-quality feta, preferably in brine, which is creamier than the squeaky supermarket varieties. Many commercial fetas use only cow’s milk and can taste somewhat one-note, so look for one that contains both sheep’s and goat’s milk, which provide the cheese’s signature tang. Dice the feta, toss it with preserved lemon, peppercorns and chile, and refrigerate overnight. Spoon it onto crostini, or serve it alongside eggs, fish, salad, grilled or roasted vegetables or atop a bowl of pasta.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/08/19/dining/aw-marinated-feta/aw-marinated-feta-articleLarge-v3.jpg", "totalTime": "PT10M", "recipeYield": "About 2 1/2 cups", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, dips and spreads, finger foods, salads and dressings", "keywords": "appetizer, side dish, feta, olive oil, parsley, peppercorns, preserved lemon, serrano chili", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 189}, "recipeIngredient": ["3/4 cup extra-virgin olive oil, plus more if needed", "3 tablespoons finely chopped fresh parsley", "3 tablespoons finely chopped preserved lemon, or 4 strips fresh orange zest plus 1 tablespoon juice (from 1 orange)", "1 red serrano chile, very thinly sliced (optional)", "4 teaspoons finely chopped fresh oregano", "1 tablespoon any combination of whole pink, green, white and black peppercorns, crushed or coarsely chopped", "8 ounces firm Greek feta, in brine", "Crostini or crackers, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, stir together the olive oil, parsley, preserved lemon, chile, oregano and peppercorns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the feta into 1/2-inch cubes and add them to the olive oil mixture. Gently fold together until feta is evenly coated. Transfer to a jar or lidded container and drizzle with more olive oil, if needed to immerse the feta. Refrigerate for at least 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from refrigerator at least 30 minutes before serving to allow solidified olive oil to return to liquid form. Serve with crackers or crostini, or spoon on top of seared fish, grilled or roasted vegetables, pasta or salad."}]}