{"@context": "http://schema.org", "@type": "Recipe", "name": "Color-Field Cookies", "description": "This tribute to the artist Ellsworth Kelly’s work <a href=\"https://www.moma.org/collection/works/109756\">“Nine Colors,”</a> requires just one decorating skill: mixing colors. Use gel food coloring for the best results, and blend the colors together gradually, using the tip of a toothpick to control their transformation. For muted tones, add a touch of brown, or a complementary color, like a drop of purple to bright orange. Try a mixing lighter color first. Then, once you’ve used it, make it darker. For example, sky blue can be deepened  with the addition of royal blue, navy blue or a combination. Don’t feel tied to the colors produced in Kelly’s work, but rather, think of these as an experiment in color.", "author": {"@type": "Person", "name": "Susan Spungen"}, "image": "https://static01.nyt.com/images/2019/11/27/dining/ss-color-cookies/merlin_163736859_309992ab-fd0e-462c-85a2-9fcddeb29427-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 dozen cookies", "recipeCuisine": "american", "recipeCategory": "cookies and bars", "keywords": "confectioners' sugar, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 227}, "recipeIngredient": ["1 (1-pound/455-gram) box confectioners’ sugar (3 3/4 cups), plus more if needed", "3 tablespoons light corn syrup", "2 teaspoons fresh lemon juice", "3 to 4 tablespoons warm water, plus more if needed", "Gel food coloring, preferably red, orange, yellow, green, blue, purple, brown and white", "1 <a href=\"https://cooking.nytimes.com/recipes/1020651\">recipe Basic Sugar Cookies</a>, cut into 3-inch circles, baked and cooled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the glaze: Combine box of confectioners’ sugar, corn syrup, lemon juice and 3 tablespoons warm water in a medium bowl. Stir with a fork to combine well, slowly adding water as needed to achieve the desired consistency. You should have 2 cups total. Test the glaze on a cookie as you go: If it doesn’t spread out on its own to a smooth finish within 10 seconds, it is too thick and needs more water. If it runs off the edge of the cookie, it’s too thin and needs more confectioners’ sugar. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let glaze sit, tightly covered, until ready to use, stirring occasionally. The glaze will keep for at least a week in a small airtight container like a glass jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Decorate the cookies: Pour about 1/3 cup glaze into a small, wide bowl. Starting with a light gel food coloring, mix in color until desired shade is reached. Holding a cookie by the edges, with the top-side down, dip into the glaze, moving the cookie around a bit to make sure it coats the whole surface. Gently shake the cookie from side to side to let the excess glaze drip off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a small offset spatula to stop the flow of icing, gently scrape cookie against edge of bowl, and flip the cookie over. Use the spatula to spread the icing to pop any air bubbles, and make sure it goes all the way to the edges. The glaze should quickly smooth out on its own. If not, thin it out a bit until it does. Use your fingers to wipe away any icing on the outside edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue in this way until you have mixed nine different colors and coated 2 or 3 of the cookies in each color. Let dry completely, a few hours. Cookies will keep in an airtight container up to 3 days."}]}