{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Roasted Broccoli, Almonds and Anchovies", "description": "This no-fuss weeknight pasta makes marvelous use of basic ingredients found in almost every kitchen — and calls for some smart multitasking: Get the broccoli roasting while the pasta cooks, then create an easy emulsified sauce using butter, anchovies, red-pepper flakes, lemon juice and a splash of pasta cooking water. A sprinkle of toasted almonds provides texture and crunch. This dish is endlessly adaptable: Go for cauliflower instead of the broccoli (or a combination of the two); use parmesan or any other hard cheese in place of pecorino; opt for walnuts or pistachios instead of the almonds — or bypass nuts altogether and use toasted panko or breadcrumbs. If you don’t have campanelle or fusilli, that’s fine too. Any pasta with plenty of nooks and crannies to capture the buttery sauce will do.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/03/18/dining/ch-pasta-with-roasted-broccoli-almonds-and-anchovies/merlin_150866628_2aaaec98-2ea9-4b07-98af-40680932169d-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch, weekday, pastas", "keywords": "almonds, anchovy fillets, broccoli, lemon, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 338}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 579, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "7 grams", "proteinContent": "17 grams", "saturatedFatContent": "11 grams", "sodiumContent": "568 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 pounds broccoli, cut into bite-size florets, stems cut into 1/2-inch slices", "2 tablespoons olive oil", "Kosher salt and black pepper", "1 pound shaped pasta, such as campanelle or fusilli", "1/2 cup chopped almonds", "8 tablespoons unsalted butter (1 stick)", "6 to 8 anchovy fillets, roughly chopped", "2 garlic cloves, chopped", "1/2 teaspoon red-pepper flakes", "1/3 cup fresh lemon juice", "Grated pecorino, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. On a large sheet pan, toss the broccoli with the olive oil. Season generously with salt and pepper and toss again. Spread the mixture in an even layer and roast until crisp and lightly browned, tossing halfway through to ensure even cooking, 20 to 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a large pot of well-salted water (2 heaping tablespoons kosher salt to about 7 quarts water) to a boil and cook the pasta according to package instructions until it’s just short of al dente. Reserve 1 cup pasta water and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet over medium-low heat, toast the almonds, stirring frequently so they don’t burn, 4 to 5 minutes. Set the almonds aside and wipe out the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the skillet, melt the butter over medium heat. Stir in the anchovies, garlic and red-pepper flakes and cook, stirring frequently, until the anchovies have melted into the sauce and the garlic is fragrant, about 2 minutes. Add 1/2 cup of the reserved pasta water along with the lemon juice and simmer until it emulsifies, 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta and toss to coat, adding more pasta water as needed. Stir in the roasted broccoli and gently toss and season to taste with salt and pepper. Top with the toasted almonds and serve with cheese, if you’d like."}]}