{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana Cream Pie No-Churn Ice Cream", "description": "This no-churn ice cream doesn’t require any cooking or special equipment. All you have to do is mash up some bananas and whip some heavy cream. The whipped cream mimics the air that’s incorporated into traditional ice cream when it’s churning in an ice cream machine. For the strongest flavor, use really, really ripe bananas; mushy, bruised ones with black peels will work well. Large crumbles of vanilla wafers stirred into the ice cream and sprinkled on top add crunch.", "author": {"@type": "Person", "name": "Erin Jeanne McDowell"}, "image": "https://static01.nyt.com/images/2019/07/15/dining/em-banana-ice-cream/merlin_156813429_6bf861a4-3027-443f-9742-cb26325d2ee4-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About 8 servings", "recipeCuisine": "american", "recipeCategory": "ice creams and sorbets", "keywords": "banana, condensed milk, heavy cream, vanilla, vanilla wafers, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "recipeIngredient": ["1 pound very ripe bananas (about 3 medium bananas), peeled", "1 (14-ounce) can sweetened condensed milk", "2 teaspoons vanilla extract", "Pinch of ground cinnamon", "Pinch of fine sea salt", "2 1/2 cups/600 milliliters heavy cream", "25 vanilla wafer cookies (about 85 grams), broken into coarse pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, use a large fork or a potato masher to mash the bananas well. Add the condensed milk and mash again until the two are well combined. The mixture should be fairly smooth and only slightly lumpy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a silicone spatula, stir in the vanilla, cinnamon and salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer fitted with the whip attachment or a handheld mixer, whip the heavy cream to medium peaks. Add about 1/4 of the whipped cream to the banana mixture and stir with the spatula to fully combine. (This lightens the mixture, making it easier to fold in the remaining whipped cream without losing too much aeration.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining whipped cream in 2 to 3 additions, folding gently just to combine. Add all but 3 tablespoons of the crumbled wafer cookies to the mixture and gently fold them in until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into a 9-by-9-inch pan and spread into an even layer. Sprinkle the reserved vanilla wafers evenly on top. Cover the ice cream with plastic wrap, gently pressing the wrap into the surface of the ice cream, and transfer to the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze the mixture until firm, at least 6 hours. Before serving, let the ice cream soften at room temperature for 10 minutes before scooping."}]}