{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Spicy Ribs With Cilantro and Cucumber", "description": "These ribs are a treat to put together, since everything cooks in one pan until the sauce becomes a sticky glaze and the ribs turn soft and tender. Some roasted potatoes or a potato salad would do well here if you’re serving this as part of a larger spread. Not to be confused with mango chutney, hot mango pickle is a traditional jarred condiment made by preserving mangoes and a variety of hot spices. It’s used most commonly in South Asia, and provides the sour and spicy qualities that give these ribs that special oomph of flavor. You can find it in the international section of many supermarkets or in other specialty markets.", "author": {"@type": "Person", "name": "Yotam Ottolenghi"}, "image": "https://static01.nyt.com/images/2019/09/18/dining/16ottorex/16ottorex-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, meat, roasts", "keywords": "baby back ribs, coriander seeds, cucumber, ginger, jalapeño, pomegranate juice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 236}, "recipeIngredient": ["2 tablespoons olive oil", "1/4 cup/40 grams peeled and finely chopped fresh ginger (from a fat 2-inch knob)", "1 small jalapeño, finely chopped, seeds and all", "1 1/4 cups/300 milliliters pomegranate juice", "3/4 packed cup/30 grams roughly chopped fresh cilantro (fresh coriander)", "1/3 packed cup/75 grams light brown sugar", "1/3 cup/75 grams hot mango pickle, roughly chopped", "2 tablespoons tomato paste", "1 1/2 tablespoons coriander seeds, roughly crushed using a mortar and pestle", "2 1/4 pounds/1 kilogram baby back ribs (pork loin ribs), cut into 4 equal sections of about 4 ribs each, stabbed a few times on the bony side with a small sharp knife", "12 ounces/340 grams shallots (about 4 large or 8 medium shallots), peeled and left whole or halved lengthwise if large", "Kosher salt and black pepper", "1 English cucumber (about 12 ounces/340 grams), halved lengthwise, deseeded, then very thinly sliced into half-moons", "1/4 packed cup/10 grams roughly chopped fresh cilantro (fresh coriander)", "3 tablespoons sour cream", "1 tablespoon fresh lime juice", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees Fahrenheit/150 degrees Celsius."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the ribs: Add the oil to a large skillet and heat over medium-high. Once hot, add the ginger and jalapeño and stir until fragrant, about 1 1/2 minutes. Add the pomegranate juice, cilantro (fresh coriander), sugar, mango pickle, tomato paste and 1 tablespoon crushed coriander seeds and bring to a simmer. Cook, stirring occasionally, until thickened slightly, about 5 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the ribs, shallots, 3/4 teaspoon salt and plenty of pepper to a 10-by-13-inch/26-by-34-centimeter roasting pan and toss everything together, arranging the ribs flesh-side up. Pour the sauce on top, wrap tightly with foil, then transfer to the oven to cook for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat up to 375 degrees Fahrenheit/190 degrees Celsius, remove the foil and baste the ribs with the sauce. Cook, basting once throughout, until ribs are a deep chocolate brown and the sauce is sticky, about 25 minutes more. Let cool slightly while you make the cucumber raita."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining 1/2 tablespoon coriander seeds in a small skillet over medium-high. Toast until fragrant, shaking the pan occasionally, 1 to 2 minutes. Transfer to a medium bowl along with the cucumber, cilantro (fresh coriander), sour cream, lime juice, oil, 1/2 teaspoon salt and a good grind of pepper; toss everything together to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the ribs, shallots and cucumber salad among 4 plates, spooning some of the sauce over the ribs, and serve immediately."}]}