{"@context": "http://schema.org", "@type": "Recipe", "name": "Kale and Quinoa Salad With Tofu and Miso", "description": "A hearty base of kale, quinoa and crisp tofu give this easy salad enough bite to serve as a meal. Curly kale provides heft and holds up nicely to the sweet, sour and spicy dressing. Use your hands to massage the vinaigrette into the kale, and let it marinate for at least 10 minutes to tenderize the sturdy greens. Finish the dish with a drizzle of sriracha and honey, but use a light touch: The point is to balance the heat and sweetness levels without overwhelming the delicate miso vinaigrette. If you like, double the dressing and refrigerate it for future use; it makes a fantastic dip for grilled chicken or pork, or a glaze to brush on salmon before broiling.", "author": {"@type": "Person", "name": "Corinne Trang"}, "image": "https://static01.nyt.com/images/2019/04/02/dining/ct-kale-and-quinoa-salad/ct-kale-and-quinoa-salad-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 to 4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, easy, lunch, quick, weeknight, salads and dressings, vegetables", "keywords": "fall, spring, summer, winter, kale, mirin, miso, quinoa, rice vinegar, tofu, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 450}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 378, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "3 grams", "sodiumContent": "257 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1/2 cup quinoa, rinsed and drained", "2 tablespoons unseasoned rice vinegar", "1 1/2 tablespoons white miso", "1 tablespoon mirin", "2 teaspoons toasted sesame oil", "6 tablespoons grapeseed oil", "1/2 teaspoon sriracha, plus more for drizzling", "1 (1-inch) piece fresh ginger, peeled and finely julienned or grated", "1 small bunch curly kale, ribs removed, leaves chopped (about 4 packed cups)", "1 (14-ounce) package extra-firm tofu, drained and cut into 3/4-inch cubes", "Honey or maple syrup, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine the quinoa with 3/4 cup water. Bring to a boil over high heat, then cover and cook over medium-low until the water is absorbed, 10 to 12 minutes. Turn off the heat and let sit for 10 minutes. Fluff it with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl, whisk together the vinegar, miso, mirin, sesame oil, 2 tablespoons grapeseed oil and 1/2 teaspoon sriracha. Stir in the ginger."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the kale, massage it with the dressing and set aside to marinate. Spoon the cooked quinoa onto the kale and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a nonstick skillet, heat the remaining 4 tablespoons grapeseed oil over medium. When the oil shimmers, cook the tofu, turning occasionally, until crisp on all sides, about 15 minutes. Transfer to a paper towel-lined plate to absorb any excess oil, then scatter it over the kale salad. Drizzle lightly with sriracha and honey and serve immediately."}]}