{"@context": "http://schema.org", "@type": "Recipe", "name": "Zhug", "description": "This bright green sauce from Yemen — so fresh from cilantro, so spicy from serrano chiles, so vividly aromatic — will open up a whole world in your cooking. Treat it just as you would a basil pesto or a salsa verde: Make it in small batches, in the mortar and pestle, and then spoon it with abandon over your lunch of cooked lentils with Bulgarian white cheese, chunks of ripe tomatoes and cold cucumbers, your dinner of roasted chicken and sautéed zucchini, or even your breakfast of fried eggs. It brings intense new life and dimension to everything it touches.", "author": {"@type": "Person", "name": "Gabrielle Hamilton"}, "image": "https://static01.nyt.com/images/2019/10/20/magazine/20mag-eat-02/20mag-eat-02-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "About 8 servings (1 generous cup)", "recipeCuisine": "", "recipeCategory": "brunch, lunch, snack, weeknight", "keywords": "appetizer, side dish, cilantro, garlic, olive oil, parsley, dairy-free, healthy, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 201}, "recipeIngredient": ["2 teaspoons whole black peppercorns", "2 teaspoons coriander seeds", "1 teaspoon cumin seeds", "1/2 teaspoon cardamom seeds, extracted from about 10 cardamom pods", "6 garlic cloves, smashed", "4 serrano chiles, cut into very thin coins", "1 to 3 teaspoons kosher salt, to taste", "3 tightly packed cups roughly chopped cilantro leaves and stems", "1 1/2 tightly packed cups roughly chopped parsley leaves", "1/2 cup extra-virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small, dry pan, toast the peppercorns, coriander seeds, cumin seeds and cardamom seeds over medium heat, shaking the pan occasionally, until slightly toasted and fragrant, about 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the seeds to a large mortar and pestle, and pulverize into a coarse powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic and chiles, and season evenly with kosher salt. Grind the mixture together until a tight paste forms, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add about 1/3 of the cilantro and parsley, and continue to pound together into a rough paste, another 4 to 5 minutes. Repeat two more times, adding the remaining cilantro and parsley in two batches, until the mixture is a slightly pulpy paste, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle in the olive oil while constantly pounding and grinding together the herb mixture until you achieve a loose, homogeneous paste. Continue to mix until it has the consistency of applesauce, about 2 minutes. Let it stand 10 minutes before serving."}]}