{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange Creamsicle Ice Cream Cake", "description": "Refreshing and citrusy yet creamy and sweet, this stunning dessert is just like a Creamsicle, but in grown-up cake form. It’s also incredibly easy: Simply stack spoonfuls of vanilla ice cream and orange sherbet into a springform pan and smoosh them down as you go. As for the crust, use whole vanilla wafers; They're less work, and crunchier than if you used crumbs. There are many ways to riff on this cake. You could try a different sherbet flavor, use frozen yogurt instead of vanilla ice cream, or trade the vanilla wafers for gingersnaps, shortbread or any other crumbly cookie. You could also add salted caramel, jam, nuts or pomegranate molasses in between the layers of ice cream.", "author": {"@type": "Person", "name": "Ali Slagle"}, "image": "https://static01.nyt.com/images/2019/08/22/dining/as-creamsicle-ice-cream-cake/as-creamsicle-ice-cream-cake-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "Makes one 8-inch-round cake (8 to 10 servings)", "recipeCuisine": "american", "recipeCategory": "easy, cakes, ice creams and sorbets", "keywords": "dessert, ice cream, sherbet, vanilla wafers", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 503}, "recipeIngredient": ["1 quart (2 pints) orange sherbet or sorbet", "1 quart (2 pints) vanilla ice cream", "20 vanilla wafers (about 2 1/2 ounces/70 grams), plus more as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the orange sherbet and vanilla ice cream and let sit at room temperature while you prepare the crust. Cover the bottom of an 8-by-2-inch springform pan with a layer of vanilla wafers (see Tip). Break up cookies to fill any big holes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a soup spoon, scoop small, alternating spoonfuls of the orange sherbet and vanilla ice cream and place them randomly on top of the cookies (imprecision is good here). Gently press the ice cream down with the back of the spoon and tap the pan on the counter to fill in the pan and remove any air bubbles. Continue until you’ve used all the ice cream, then spread the top into an even layer. To create decorative swoops on top, press down into the cake with the back of the spoon and move it up and out in circular motions to create swirls and peaks all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the cake with plastic wrap and freeze until firm, at least 2 hours or up to 1 week. To serve, quickly rub the side and bottom of the pan with a warm, moistened kitchen towel to loosen. Unmold the springform and transfer the cake to a serving plate."}]}