{"@context": "http://schema.org", "@type": "Recipe", "name": "Cheesy Eggplant and Rigatoni Bake", "description": "Put on your cozy pants and get comfortable with a giant bowl of this cheesy, eggplant-studded pasta. Don’t be shy about adding plenty of reserved pasta cooking water to the sauce; it's the magical ingredient that creates a silky sauce and keeps the pasta moist while baking. A little grated ricotta salata to finish adds a slight tangy bite that rounds everything out — but, truthfully, more Parmesan or any firm, salted cheese will do.", "author": {"@type": "Person", "name": "Sue Li"}, "image": "https://static01.nyt.com/images/2019/02/12/dining/sl-eggplant-rigatoni/sl-eggplant-rigatoni-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "american, italian", "recipeCategory": "dinner, pastas", "keywords": "basil, canned tomatoes, eggplant, mozzarella, parmesan, rigatoni, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 480}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 557, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "8 grams", "proteinContent": "25 grams", "saturatedFatContent": "10 grams", "sodiumContent": "880 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["1 pound rigatoni", "6 tablespoons olive oil", "2 medium eggplants (about 1 1/2 pounds total), cut into 1-inch pieces", "Kosher salt and black pepper", "1 small yellow onion, thinly sliced", "4 garlic cloves, thinly sliced", "1 teaspoon red-pepper flakes", "1 (28-ounce) can whole tomatoes, juices reserved", "1 cup lightly packed grated Parmesan (about 2 ounces)", "4 cups grated fresh mozzarella (about 1 pound)", "1 cup fresh basil leaves, torn, plus additional for serving", "Grated ricotta salata, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Cook rigatoni according to package instructions but keep it slightly more al dente. Reserve 1 1/2 cups pasta cooking water, then drain and rinse pasta under cold water, and transfer to a large bowl while you cook the eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a large, oven-proof skillet over medium. Add half the eggplant, season with salt and pepper, and cook, stirring, until golden brown on all sides, 9 to 10 minutes. Transfer to the bowl with the rigatoni. Repeat with 2 tablespoons olive oil and remaining eggplant and transfer to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining 2 tablespoons olive oil in the skillet over medium. Add onion and garlic and cook, stirring, until translucent, 3 to 4 minutes. Stir in red-pepper flakes and season with salt and pepper. Add tomatoes and their juices, crushing the tomatoes with your hands as you add them. Cook until the tomatoes are very soft, about 5 minutes. Stir in the reserved pasta cooking water, adding up to 1 1/2 cups as needed to create a silky sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the skillet is large enough, add the rigatoni and eggplant mixture, Parmesan, 1 cup mozzarella and 1 cup basil and toss to coat. Otherwise, add the tomato sauce, Parmesan, 1 cup mozzarella and 1 cup basil to the large bowl with the rigatoni and eggplant, toss to coat and then return to the skillet or transfer to a greased baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top with remaining 3 cups mozzarella and bake until the sauce is bubbling on the sides and the cheese is melted, about 25 minutes. Top with grated ricotta salata and torn fresh basil to serve."}]}