{"@context": "http://schema.org", "@type": "Recipe", "name": "Crispy Fried Rice With Bacon and Cabbage", "description": "This easy, hearty weeknight meal gets a lot of its brawny richness from just a small amount of bacon. The soft, wilted cabbage lends sweetness, while the kimchi (a nod toward <a href=\"https://cooking.nytimes.com/recipes/1018097-kimchi-fried-rice\">bokkeumbap</a>) zips things up. The secret to getting a crackling, crunchy texture is letting the rice sit in the hot oil without touching it until it browns, but using leftover rice also helps. (As the rice dries out, it crisps more easily.) If you’re starting from scratch, just cook 2 cups of dry rice to yield the 6 cups of cooked rice called for here. Then spread the rice out on a baking sheet and let it cool and dehydrate a bit before frying. Be sure to have everything ready and near the stove when before you start. The cooking goes fast, and there won’t be any time to prepare ingredients once you get going.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/02/26/dining/21Apperex1/merlin_169064598_1776eabb-8bdb-441a-95fa-b3c319822a8c-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "weekday, grains and rice", "keywords": "bacon, cabbage, kimchi, rice, scallion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 593}, "recipeIngredient": ["5 tablespoons neutral oil, such as grapeseed or sunflower, plus more as needed", "3 slices thick-cut bacon, in 1/2-inch pieces (about 3 ounces)", "1 small bunch scallions, whites and greens separated, sliced", "4 cups shredded cabbage (from about 1/2 small head)", "Salt", "4 garlic cloves, minced", "6 cups cooked rice, white or brown, preferably day-old", "2 1/2 tablespoons fish sauce, plus more as needed", "1/2 tablespoon soy sauce, plus more as needed", "1/2 cup kimchi, drained and chopped, plus more for serving if you like", "1/2 cup green peas (thawed, if frozen)", "4 fried eggs, for serving (optional)", "Toasted sesame oil, for drizzling (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet or wok over medium-high, heat 2 tablespoons oil until almost smoking. Stir in bacon, and cook, stirring constantly, until bacon is golden, about 2 minutes. Transfer to a heatproof bowl, leaving as much oil in the skillet as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add scallion whites to the pan. Cook until soft, stirring frequently, 1 to 2 minutes. If the pan looks dry, drizzle in a little more oil, then stir in cabbage and a pinch of salt. Cook, continuing to stir frequently, until cabbage is soft, 2 to 4 minutes. Stir in garlic, and cook until fragrant, another 1 to 2 minutes. Transfer to the bowl with the bacon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 3 tablespoons oil to skillet and raise heat to high. Add rice, and a large pinch of salt, then toss thoroughly to coat with oil. Spread out rice in an even layer along the bottom (and sides if in a wok), and drizzle fish sauce and soy sauce over. Let rice sit until sizzling stops and it starts to crackle and crisp, 1 to 4 minutes. Toss, taste, and add more fish sauce or soy sauce if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in bacon mixture, kimchi and peas, then transfer to plates. Top with scallion greens, more kimchi to taste, and fried eggs, if using. Drizzle everything with sesame oil and soy sauce, if you like, and serve immediately."}]}