{"@context": "http://schema.org", "@type": "Recipe", "name": "Bavette Steak With Tahini-Vegetable Salad", "description": "Searing a boneless steak in plenty of fat gives the meat crisp edges while keeping it juicy. While you can use any cut of boneless steak in this recipe (which is adapted from Kate Kavanaugh, the owner of Western Daughters Butcher Shoppe in Denver), bavette steak, also called flap meat or sirloin tip, is a particularly flavorful and tender choice. Ms. Kavanaugh likes to serve it alongside a crunchy vegetable salad that is layered with thinly sliced strawberries and tart rhubarb and tossed with a lime-tahini dressing, but any tangy salad will work well with the richness of the meat.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/08/07/dining/06butcherrex1/merlin_158598249_85b3752c-d97c-4da3-a29d-8277d95a3699-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weeknight, salads and dressings, steaks and chops, vegetables", "keywords": "basil, flank steak, ghee, mint, radish, rhubarb, steak, strawberries, tahini, turnip, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "recipeIngredient": ["1 1/2 pounds bavette steak (sometimes called flap meat or sirloin tip) or flank steak, preferably grass-fed and finished", "Flaky sea salt, as needed", "2 tablespoons ghee, tallow or neutral oil", "2 tablespoons tahini, preferably raw", "Finely grated zest of 1/2 lime plus juice of 2 limes", "1 tablespoon extra-virgin olive oil", "1 tablespoon cold water", "1/4 teaspoon fine sea salt, plus more as needed", "10 to 12 medium-firm strawberries, thinly sliced (about 2 cups)", "1 1/4 cups thinly sliced rhubarb (about 1 stalk) or peeled carrots", "1 medium cucumber, thinly sliced into rounds (about 1 1/2 cups)", "3 hakurei or other small sweet turnips, thinly sliced into rounds (about 3/4 cup)", "3 medium radishes, thinly sliced into rounds (about 3/4 cup)", "1 quart mixed tender greens", "2/3 cup packed coarsely chopped mint", "1/2 cup packed chopped basil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull the steak out of the fridge 1 hour before cooking to come to room temperature. About 5 minutes before cooking, generously season steak all over with flaky sea salt (this helps the salt retain some crunch)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron or other heavy-duty skillet over medium-high until hot enough that a drop of water will sizzle on contact. Add ghee to the skillet and let it melt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add bavette steak and cook, flipping every 2 minutes, until medium-rare, about 8 minutes total, or until medium, about 10 minutes total. (Bavette steak has a tendency to puff up as it cooks, taking longer than the average steak to reach medium-rare. You’ll want to reduce the cooking time if using flank steak.) Transfer steak to a cutting board and let rest for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the salad: In a small bowl, whisk together tahini, lime zest and juice, olive oil, cold water and 1/4 teaspoon fine sea salt until smooth. Taste and season with more salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss together strawberries, rhubarb, cucumber, turnips and radishes. Add just enough dressing to coat, then taste and add more salt, if needed. Add the greens, mint and basil to the bowl and toss gently, adding more dressing and salt, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice steak against the grain and serve with salad."}]}