{"@context": "http://schema.org", "@type": "Recipe", "name": "Perfect Boiled Eggs", "description": "If your goal is perfectly smooth, blemish-free boiled eggs that jump out of their shells every single time, I’ve got bad news: No technique in the world can promise that level of perfection. But armed with data from scientific tests done with more than 90 testers and more than 700 boiled eggs, this technique for boiled eggs — technically steamed, as they cook in just an inch of water — will maximize your odds. Fresher eggs will take slightly longer to peel, but they should peel just as cleanly as older eggs. The eggs in this recipe should be cooked straight from the refrigerator; reduce cooking times by 1 minute if using room-temperature eggs.", "author": {"@type": "Person", "name": "J. Kenji López-Alt"}, "image": "https://static01.nyt.com/images/2019/09/25/dining/23eggrex2/23eggrex2-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, easy, quick, weekday", "keywords": "eggs, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1241}, "recipeIngredient": ["Up to 12 eggs (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Find a lidded saucepan large enough to allow your eggs to comfortably fit on the bottom in a single layer. Add 1 inch of water, cover, and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently lower eggs into the saucepan using a slotted spoon or a steamer basket. (It’s O.K. if the eggs are partly submerged on the bottom of the pot, or elevated on a steamer rack and not submerged at all.) Cover pan and cook eggs, adjusting the burner to maintain a vigorous boil, 6 minutes for a warm liquid yolk and firm whites, 8 1/2 minutes for a translucent, fudgy yolk, or 11 minutes for a yolk that is just barely firm all the way through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain eggs, then peel and eat immediately, or transfer them to a plate and allow them to cool naturally before storing in the refrigerator for up to a week directly in their shell. (A small dot made with a permanent marker on the top of each cooked egg will ensure you don’t mix them up with the raw eggs.) Do not shock them in an ice bath after cooking; this makes them more difficult to peel."}]}