{"@context": "http://schema.org", "@type": "Recipe", "name": "Mediterranean Lentil Salad", "description": "Here’s a summery lentil salad topped with tomatoes, roasted peppers and feta, garnished with hard-cooked eggs, anchovy fillets and good canned tuna. Studded with olives and sprinkled with oregano, it’s a sort-of niçoise salad by way of Greece, an easy main course suitable for a picnic or a no-fuss make-ahead supper.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2019/06/05/dining/31kitchrex1/merlin_155289774_990f698b-fe5d-407f-bc16-ce7c4d3e6768-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, salads and dressings, vegetables", "keywords": "eggs, feta, lentils, potato, tomatoes, tuna, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 390}, "recipeIngredient": ["1 1/2 cups small brown or green lentils, such as Castelluccio or Le Puy ", "1 bay leaf ", "A few thyme sprigs, tied in a bundle", "Salt and pepper", "1 1/2 pounds tiny new potatoes", "12 ounces cherry tomatoes, halved (about 3 cups)", "1/2 small red onion, thinly sliced and soaked in ice water", "2 red bell peppers, roasted, skin removed and cut into long, wide strips", "8 anchovy fillets (optional)", "8 ounces good-quality canned tuna, drained, in large chunks (optional)", "4 hard-cooked eggs (9 minutes), halved or quartered", "2 tablespoons roughly chopped mint", "3 tablespoons roughly chopped parsley", "Small handful of basil leaves, for garnish", "1 cup good-quality black olives, such as niçoise, Kalamata or Moroccan", "4 ounces feta, cut in 1/2-inch slices", "3 tablespoons red-wine vinegar, plus more to taste", "2 garlic cloves, grated or smashed to a paste (about 1/2 teaspoon)", "Salt and pepper", "1/2 cup extra-virgin olive oil, plus more to taste", "1 teaspoon crumbled oregano, plus a little more for sprinkling"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the lentils: Rinse and put in a medium saucepan. Cover with 4 cups water and add bay leaf, thyme sprig and a large pinch of salt. Bring to a boil over high heat, then reduce heat and simmer gently with lid ajar for 20 to 25 minutes, until lentils are tender. Set pot aside and let cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the potatoes in another saucepan, cover with water and add a heaping teaspoon of salt. Bring to a boil, then reduce heat to brisk simmer. Cook about 15 minutes, until cooked through when probed with a paring knife. Drain and set aside. (If desired, use a paring knife to remove skins from potatoes while still warm.) Cut in halves or quarters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While lentils cook, make the vinaigrette: In a small bowl, stir together vinegar and garlic. Season with a good pinch of salt and pepper. Whisk in the oil. Taste and adjust. Stir in oregano."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the cherry tomatoes in a bowl. Drain onion slices, and add to the tomatoes along with roasted pepper strips. Season with salt, then add half the vinaigrette (well whisked). Toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble salad, drain lentils and transfer to a large low, wide bowl or platter and let cool for 10 minutes.  Add remaining vinaigrette, sprinkle with a little salt and toss gently. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top lentils with tomato-onion-pepper mixture. Arrange anchovy fillets, tuna (if using) and eggs on top. Sprinkle with mint and parsley. Arrange halved or quartered potatoes around the perimeter. Garnish with basil leaves, olives and feta. Sprinkle a pinch of oregano over the salad."}]}