{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Ragù Pasta", "description": "Rich and earthy, this creamy pasta feels appropriate for date night, but comes together quickly enough for a weeknight. The process is simple, but the details do matter here: Use a thin pasta, like spaghettini or angel hair, so that it cooks in the same amount of time it takes the stock and cream to reduce to a sauce. Also pay close attention during the last few minutes of cooking the pasta to ensure you’re stirring enough and adding enough water to create a silky sauce. Porcini mushroom powder, which is optional, adds depth, and can be made at home by pulverizing store-bought dried mushrooms in a spice grinder (see Tip). Offset the richness of the dish with a classic green salad, <a href=\"https://cooking.nytimes.com/recipes/1019023-fennel-apple-salad-with-walnuts?action=click&module=Global Search Recipe Card&pgType=search&rank=2\">shaved fennel</a>, or some <a href=\"https://cooking.nytimes.com/recipes/1013401-bitter-greens-salad-with-lemon-mustard-dressing?action=click&module=Global Search Recipe Card&pgType=search&rank=24\">mustardy bitter greens</a>.", "author": {"@type": "Person", "name": "Alexa Weibel"}, "image": "https://static01.nyt.com/images/2019/11/21/dining/aw-mushroom-pasta/merlin_163202022_de0a07bb-60d1-438c-bb40-ca4bdfc6ab2d-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "garlic, mushroom, porcini, port, shallot, spaghettini, thyme, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 180}, "recipeIngredient": ["5 cups chicken or vegetable stock", "1 cup heavy cream", "2 teaspoons dried porcini mushroom powder, optional (see Tip) ", "4 teaspoons fresh thyme leaves", "Kosher salt", "1/3 cup olive oil", "1 1/2 pounds mixed fresh mushrooms, such as shiitake and cremini, finely chopped into 1/4-inch pieces", "3 shallots, finely chopped", "4 garlic cloves, finely chopped", "Black pepper", "1/3 cup port or marsala wine", "1 pound spaghettini or angel hair pasta"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the stock, heavy cream, porcini mushroom powder (if using), 1 teaspoon fresh thyme leaves and 2 teaspoons salt to a large pot. Bring to a boil over high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the liquid comes to a boil, heat the oil over medium-high in a large (12-inch) nonstick skillet. Add the mushrooms, shallots, garlic and 2 teaspoons thyme leaves. Season generously with salt and pepper, and cook, stirring occasionally, until caramelized and tender, about 12 minutes. Add the port, and stir until the alcohol cooks off and the mixture is almost dry, about 2 minutes. Remove from the heat, set aside and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the boiling cream mixture, reduce the heat to medium and cook, stirring frequently with tongs, until the pasta is al dente and absorbs most of the liquid, and the sauce is silky, 6 to 7 minutes. (Stir constantly during the last couple minutes to ensure the pasta cooks evenly. Add a splash of water if needed to keep the mixture glossy.) Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the pasta to bowls, top with the mushroom mixture and the remaining 1 teaspoon thyme leaves, and serve immediately."}]}