{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Stuffing", "description": "The challenge with developing a vegan version of classic Thanksgiving stuffing is figuring out how to achieve that signature texture without the eggs. In this recipe, a few simple steps make it possible: First, vegetable broth is added to the stuffing mixture twice; once while it’s in the skillet, and again just before baking. Finely chopped, toasted pecans add texture, but also act as a sort of flour, absorbing the broth and binding the mixture together. Finally, the stuffing is baked under foil for the first 20 minutes, which ensures that the top doesn’t dry out before the entire dish is finished. The end result is a traditional stuffing that will have everyone — vegans and otherwise — coming back for seconds.", "author": {"@type": "Person", "name": "Gena Hamshaw"}, "image": "https://static01.nyt.com/images/2019/11/05/dining/gh-vegan-stuffing/merlin_163633290_a46c7dcb-e2e4-4871-9c7a-713012c298cb-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, breads, stuffing and dressing", "keywords": "bread, broth, celery, onion, parsley, sage, thyme, vegan butter, dairy-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 192}, "recipeIngredient": ["1 (1-pound) baguette or peasant loaf, cut into 1-inch cubes (about 10 cups)", "1/2 cup pecans (2 ounces)", "4 tablespoons vegan butter, plus more for greasing the dish", "1 large onion, chopped (about 1 1/2 cups)", "3 to 4 celery stalks, chopped (about 2 cups)", "3 tablespoons finely chopped fresh sage leaves", "2 tablespoons fresh thyme leaves", "1/4 cup chopped parsley", "3 cups low-sodium vegetable broth", "Kosher salt and black pepper "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before you make the stuffing, place the bread cubes on a sheet pan and leave them out overnight, uncovered, to dry out. Alternately, you can place them on a sheet pan and bake at 275 degrees for about 25 minutes, or until the bread cubes are dry at the surface, but still soft in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Butter a 9-by-13-inch casserole dish. Place the pecans on a sheet pan and transfer to the oven. Roast for 4 minutes. Remove the pecans from the oven, chop finely and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a deep 12-inch skillet over medium-high heat. Add the onion and celery. Sauté for 5 to 6 minutes, or until the onion is clear. Reduce the heat to low. Add the sage, thyme and parsley, and cook for 1 minute, stirring continuously."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the bread to the skillet and 2 1/2 cups broth. Gently fold everything together, so the bread soaks up the broth. Fold in the pecans. Taste, and season the stuffing with salt and black pepper. (Vegan butter is usually salted, so the amount of salt you need will depend on the butter you use and how salty your broth is.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer all of the ingredients to the prepared baking dish. Drizzle the remaining 1/2 cup broth over the top. Cover the casserole dish with foil and bake for 20 minutes. Uncover the casserole and bake for an additional 20 to 25 minutes, or until the top is just beginning to brown. Serve."}]}