{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp and White Beans With Fennel and Pancetta", "description": "This quick, one-pan meal relies heavily on pantry staples. Browning pancetta or bacon adds richness to the tomato sauce, but skip it if you like. Anise-flavored fennel and seeds are incorporated into the soffrito, which plays nicely with the sweetness of the shrimp and the creaminess of the beans. But if you don’t like them, leave them out. Serve the dish in deep bowls with thick slices of garlic-rubbed toast, finish the dish with a flurry of fresh herbs, and pair it with a glass of something red, light and bright.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2019/02/11/dining/ch-shrimp-and-white-beans-with-fennel-and-pancetta/merlin_149536275_1148132f-65cd-475b-a3b3-2695c3a1bfe0-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, for two, weekday, seafood", "keywords": "fennel, pancetta, shrimp, white beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 666}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 380, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "11 grams", "proteinContent": "29 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1187 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil, plus more for drizzling (optional)", "4 ounces pancetta or bacon, diced", "1 small yellow onion, thinly sliced", "1 small or medium fennel bulb (about 6 ounces), tough outer leaves and stems discarded and thinly sliced crosswise, plus 1 tablespoon roughly chopped fronds", "2 garlic cloves, thinly sliced", "2 teaspoons fennel seeds", "1/2 teaspoon red-pepper flakes (optional)", "Kosher salt and black pepper", "1 (28-ounce) can whole peeled tomatoes with their juices, tomatoes crushed by hand", "1 pound jumbo shrimp, preferably wild, peeled and deveined", "1 (15-ounce) can white beans, such as butter beans or cannellini beans, drained and rinsed", "1/2 cup roughly chopped fresh herbs, such as Italian parsley, basil, mint or a combination (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep 12-inch skillet, heat the olive oil over medium. Add the pancetta and cook, stirring occasionally, until it begins to crisp, 4 to 5 minutes. Remove with a slotted spoon and set aside on a paper towel-lined plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion and sliced fennel to the skillet and cook until softened, 3 to 4 minutes. Stir in the garlic, fennel seeds and red-pepper flakes, if using, and cook until the garlic begins to soften and the fennel seeds become aromatic, about 1 minute. Season with salt and pepper. Stir in the crushed tomatoes and their juices. Fill the tomato can halfway with water, swish it around and add that, too."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the mixture to a simmer and cook on medium-low, allowing the flavors to come together, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat back to medium, stir in the shrimp and cook until just pink, 2 to 3 minutes. Add the beans and the cooked pancetta and cook until warmed through, about 2 minutes. Taste and adjust seasonings as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide among bowls, top with the herbs and drizzle with a bit more olive oil, if desired."}]}