{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry-Rhubarb Slab Pie", "description": "This slab pie is perfect for a party because it’s easy to transport, and it serves a crowd. Convenience aside, the true draw of this sheet-pan pie is the flaky, buttery crust and its rhubarb, blueberry and crystallized ginger filling. Cooking the fruit ahead of time results in a filling that is juicy but not soupy — and prevents the crust from absorbing too much liquid. Preparing the pie dough in the food processor is effortless and helps keep the butter cold, which leads to a flakier crust, but be careful not to over-process: Stop when the mixture is moist but still crumbly.", "author": {"@type": "Person", "name": "Samantha Seneviratne"}, "image": "https://static01.nyt.com/images/2019/06/12/dining/ss-blueberry-slab-pie/ss-blueberry-slab-pie-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "10 servings", "recipeCuisine": "american", "recipeCategory": "pastries, pies and tarts", "keywords": "blueberries, butter, crystalized ginger, flour, rhubarb, sugar, dessert, fall, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 66}, "recipeIngredient": ["2 1/4 cups/290 grams all-purpose flour, plus more for rolling", "3 tablespoons granulated sugar", "1 teaspoon kosher salt", "1 cup/225 grams cold unsalted butter (2 sticks), cut into pieces", "Ice water, as needed", "10 ounces/290 grams fresh rhubarb, cut into 1/2-inch pieces (about 2 1/2 cups)", "4 1/2 cups/600 grams fresh blueberries", "1/3 cup maple syrup", "Pinch of kosher salt", "3 tablespoons cornstarch", "1/4 cup/60 grams chopped crystallized ginger", "1 large egg, beaten", "3 tablespoons sparkling or sanding sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastry: In the bowl of a food processor, combine the flour, sugar and salt. Add the butter and pulse until the mixture is the texture of coarse sand with some larger pieces of butter. Drizzle in 1/3 cup ice water and pulse the mixture about 5 times or until the mixture is crumbly, but evenly moistened and holds together when you squeeze a bit in your hands. Add up to 3 more tablespoons ice water, but stop before the mixture becomes too wet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tip the mixture out onto a large piece of plastic wrap. Using the plastic wrap, press the crumbs together. Divide the dough into thirds; tightly wrap one portion in plastic wrap, then combine the other two portions and wrap that larger piece of dough well in plastic wrap. Use a rolling pin to press both dough portions into two flat rectangles. Chill for at least 2 hours. (You can chill dough for up to 3 days in the fridge or freeze it for up to 3 months.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the filling: In a small saucepan, combine the rhubarb, 3 cups blueberries, the maple syrup and salt. Cook the mixture over medium heat, stirring occasionally, until the rhubarb has started to break down and the blueberries have started to release some of their juices, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer a few tablespoons of the liquid from the saucepan to a small bowl. Add the cornstarch and whisk until dissolved. Return the cornstarch mixture to the pan and cook, stirring, until the blueberry mixture has thickened, 2 minutes. Remove the pan from the heat and stir in the remaining 1 1/2 cups blueberries and the ginger. Let this mixture cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured piece of parchment, roll the larger portion of dough into an 11-by-13-inch rectangle. Trim the edges into straight lines. Transfer the parchment with the dough to a rimmed baking sheet. Roll the smaller portion of dough out to a 7-by-15-inch rectangle on a floured piece of parchment. Using a fluted pastry wheel or a sharp knife, cut the dough lengthwise into seven 1-inch-thick strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the filling over the uncut rectangle, leaving a 1-inch border on all sides. Lay the strips of pastry over the filling on the diagonal, spacing the strips about 1/2 inch apart. Trim the strips so that they are even with the edge of the rectangle. Fold the edges up and over the filling and the strips and press the corners to seal. (Press with the tines of a fork, if desired.) Wrap lightly with plastic wrap and freeze for at least 30 minutes (and up to 2 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Using the parchment, transfer the chilled pie to another rimmed baking sheet. (You don’t want to bake it on the cold sheet.) Brush the beaten egg all over the pastry and sprinkle with sanding sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the pastry is deep golden brown and the filling is bubbling in spots, 50 to 60 minutes. Transfer pan to rack to cool for at least 1 hour before slicing."}]}