{"@context": "http://schema.org", "@type": "Recipe", "name": "Fettuccine With Lobster and Zucchini", "description": "Feta cheese gives a briny edge to this quick pasta dish, with fresh zucchini, tomatoes, herbs and lobster. Add the lobster off-heat at the end to guard against overcooking; it will warm just enough as it is gently tossed, putting all the ingredients on speaking terms. If you are entertaining guests and do not prefer last-minute preparations, don’t hesitate to serve the pasta at room temperature, glossed with an extra glug or two of good olive oil.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2019/07/10/dining/05pairrex/05pairrex-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 251}, "recipeIngredient": ["3 tablespoons extra virgin olive oil", "1/4 cup finely chopped shallots", "2 large cloves garlic, minced", "2 cups diced fresh tomatoes", "2 medium zucchini (10 to 12 ounces), trimmed and diced", "1 1/2 tablespoons minced fresh mint leaves", "2 tablespoons minced chives", "1/2 cup crumbled feta cheese (about 3 ounces)", "1/4 teaspoon smoked paprika", "Salt and ground black pepper", "6 tablespoons heavy cream", "Cooked meat from 2 (1 1/4-pound) lobsters, diced", "1 pound fettuccine", "2 teaspoons grated lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a 12-inch sauté pan. Add shallot and garlic, and sauté on medium-low until soft but not brown. Add the tomatoes and cook about 5 minutes, until most of their liquid has evaporated. Add another tablespoon of the olive oil and then the zucchini and cook, stirring, 3 minutes or so, until the zucchini is tender but not soft. Fold in 1 tablespoon of the mint and 1 1/2 tablespoons of the chives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the feta and cook, stirring, a few minutes, until it softens. Stir in paprika, and season to taste with salt and pepper. Add the cream, bring to a simmer and cook 2 to 3 minutes until the cream starts to thicken. Remove from the heat and stir in the lobster meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil for the pasta. Cook the fettuccine until al dente, about 6 minutes. Reserve 1/4 cup of the pasta water. Drain the pasta, add to the sauté pan, drizzle on the remaining tablespoon of oil and the lemon zest and toss with the zucchini and lobster mixture. Add pasta water, turn the heat to low, add salt and pepper, if needed, and gently mix the ingredients for no more than 3 minutes, just until heated through. Serve with a scattering of the remaining chives and mint."}]}