{"@context": "http://schema.org", "@type": "Recipe", "name": "Kuku Sabzi (Persian Herb Frittata)", "description": "Kuku, which is like a Persian frittata, comes in many forms, but this one, packed to the brim with herbs, is my favorite. Washing and picking through the piles of herbs can be overwhelming if you’re not used to staring down a mountain of produce, so feel free to prepare them in advance. I particularly love kuku sabzi for the contrast between its vivid-green herbaceous interior and its dark, sweet crust. Kuku is traditionally served with flatbread and a selection of crunchy and acidic condiments to balance the sweetness of the herbs; my favorites are fresh radishes, the chopped eggplant pickles called liteh and chunks of soft, salty feta cheese. Leftover kuku slathered with <a href=\"https://cooking.nytimes.com/recipes/1020213\">mast-o khiar</a> makes for a wonderful sandwich.", "author": {"@type": "Person", "name": "Samin Nosrat"}, "image": "https://static01.nyt.com/images/2019/05/15/dining/14Iranianrex1/merlin_154114479_2f72a7d4-c071-4fdd-b86c-d0b24036efc4-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "brunch, lunch, vegetables", "keywords": "appetizer, main course, side dish, cilantro, dill, eggs, herbs, parsley, turmeric", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 161}, "recipeIngredient": ["1 pound cilantro (about 3 large bunches)", "1 pound Italian parsley (about 3 large bunches)", "1 large bunch fresh dill", "4 crisp leaves from a romaine heart", "2 large leeks, roots and top 1 inch trimmed", "3 tablespoons plus 1/4 cup extra-virgin olive oil", "Fine sea salt and freshly ground black pepper", "1 tablespoon dried fenugreek", "2 teaspoons dried dill", "1/4 cup barberries, rinsed and dried", "1 teaspoon ground turmeric", "1/2 teaspoon baking powder", "6 to 7 large eggs", "4 tablespoons unsalted butter (1/2 stick)", "Radishes, for serving (optional)", "Persian liteh pickles or cornichons, for serving (optional)", "Feta, for serving (optional)", "Warmed flatbread, such as sangak, pita or lavash, for serving (optional)", "<a href=\"https://cooking.nytimes.com/recipes/1020213\">Mast-o Khiar</a>, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim woody ends from cilantro, parsley and dill so that only leaves and tender stems remain. Wash herbs and romaine leaves, then use a salad spinner to dry very well. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely dice both the green and white parts of the leeks. Wash well and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a 10-inch cast-iron or nonstick pan over medium-high heat. When the pan is hot, add 3 tablespoons oil. When the oil shimmers, add leeks. Season with a generous pinch of salt and cook, stirring occasionally, until translucent and softened but not browned, about 20 minutes, reducing the heat if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the meantime, very finely chop the cilantro, parsley, dill and romaine by hand — the smaller the pieces, the more deeply green your kuku will be. To chop such a large volume of herbs, take a large handful or two at a time and roll into a tight ball. Run a large, sharp knife through the ball to initially chop the herbs roughly, then continue to rock the knife back and forth through the pile of herbs until very finely chopped. Repeat with remaining herbs until finished. Combine the chopped herbs and romaine with the dried fenugreek and dried dill in a very large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When leeks are cooked, add herb mixture and another generous pinch of salt to the pan and cook, stirring often, until it dries out and the color changes to a very dark green, about 5 minutes. Transfer the mixture back into the very large bowl; spread it out, then allow it to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the herb mixture has cooled, add barberries, turmeric, baking powder, 2 teaspoons salt and 1/2 teaspoon pepper. Taste the mixture: It should be a little on the salty side. If it’s not, add a little more salt. One at a time, add eggs to the herb mixture, stirring well after each addition. Use as few eggs as needed to barely bind the mixture; this will ensure a brilliant-green kuku. The mixture should be the consistency of a loose porridge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the pan and melt the butter over medium-high heat. When the butter melts, add remaining 1/4 cup oil. Add a tiny spoonful of the kuku mixture to the pan. When it sizzles, add the rest of the mixture and use a rubber spatula to spread it out evenly. The oil should bubble up the sides of the kuku. Run the spatula around the edge and jiggle the pan from time to time to check that the mixture isn’t sticking. Cook, rotating pan a quarter turn every 3 to 4 minutes, until the kuku is set, the bottom is a very dark brown, and the edges are golden brown, 15 to 20 minutes. Don’t be afraid of getting your crust really dark — it will appear almost burned, but it will taste heavenly sweet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a rubber spatula to ensure that the kuku is not stuck to the pan, then carefully tip as much of the oil as possible into a medium bowl and set aside. Cover the pan with a large, flat platter or pizza pan and flip the kuku onto it and set aside. Return the oil to the pan and carefully slide the flipped kuku back into the pan to cook the second side. Cook over medium-high until the second side is dark brown and the kuku is cooked through, about 5 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the kuku finishes cooking, wipe off the platter and line with a double layer of paper towels. Flip the finished kuku onto the prepared platter and use another paper towel to dab excess oil from the surface. To serve, flip once more onto a serving platter and peel away paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve warm, cold or at room temperature, with your choice of radishes, pickles, feta, warmed flatbread and mast-o khiar."}]}