{"@context": "http://schema.org", "@type": "Recipe", "name": "The Store’s Green Dip", "description": "Bert Greene was one of the owners of the Store in Amagansett, a gourmet shop and catering outfit on the eastern end of Long Island, N.Y., that was in the early 1970s a kind of lodestar of casual-elegant cooking and entertaining — expensive and, to those with the money to spend it, worth it. (He was like a cross between Ina Garten and Anna Pump, of Loaves & Fishes in Sagaponack.) This is his recipe for a tart, abrasive and wildly delicious dip to serve, garnished with watercress, with an enormous quantity of iced, slivered vegetables. (It’s also great on fish, sandwiches, or even as a dip for slices of delivery pizza.)", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/09/01/magazine/01mag-eat/01mag-eat-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 cups", "recipeCuisine": "american", "recipeCategory": "easy, quick, snack, condiments, dips and spreads, finger foods, salads and dressings, vegetables", "keywords": "anchovies, capers, chives, mayonnaise, parsley, appetizer, side dish, fall, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 423}, "recipeIngredient": ["1 (2-ounce) can flat anchovy fillets packed in oil", "1/2 cup chopped fresh parsley", "2 tablespoons red wine vinegar", "2 tablespoons chopped fresh chives or shallots", "1 tablespoon drained capers, rinsed", "1 1/2 cups mayonnaise", "Freshly ground black pepper, to taste", "Chilled sliced vegetables, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the anchovies and anchovy oil, parsley, vinegar, chives or shallots, and capers into a blender or food processor and purée until the mixture has nearly liquefied, about 3 minutes, pulsing and scraping down the sides as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mayonnaise and pulse to combine. Season with pepper, then transfer to a small bowl and refrigerate until chilled, about 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve as a dip with chilled sliced vegetables."}]}