{"@context": "http://schema.org", "@type": "Recipe", "name": "Bittersweet Brownie Shortbread", "description": "These chewy bar cookies combine two all-time favorites: crumbly, buttery shortbread and bittersweet brownies. Nut lovers can mix almonds, pecans or walnuts into the brownie batter, which gives the bars a delightful crunch. But those who prefer savoring the smooth, gooey centers of their brownies can easily leave them out. In any case, be sure not to overbake the brownies. As soon as the top sets, they’re done.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2020/02/12/dining/11Chocolaterex-shortbread1/merlin_168265194_8c940082-93f4-4f03-9661-cb38423901f0-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "32 bars", "recipeCuisine": "", "recipeCategory": "cookies and bars", "keywords": "cocoa powder, slivered almonds, unsweetened chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 801}, "recipeIngredient": ["1 1/2 cups/340 grams cold unsalted butter (3 sticks), cut into 1/2-inch pieces, plus more for greasing the pan", "3 cups/385 grams all-purpose flour", "3/4 cup/150 grams granulated sugar", "1 1/4 teaspoons fine sea salt", "1 cup plus 2 tablespoons unsalted butter (2 1/4 sticks)", "3 ounces unsweetened chocolate, chopped", "1 1/4 cups/265 grams light brown sugar", "1 cup/200 grams granulated sugar", "1/2 cup plus 1 tablespoon/45 grams cocoa powder", "3 large eggs", "1 tablespoon vanilla extract", "1 1/2 cups/190 grams all-purpose flour", "1/4 teaspoon fine sea salt", "3/4 cup/90 grams slivered almonds, chopped walnuts or pecans (optional)", "Flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease a 9-by-13-inch baking dish, and line with parchment paper so that there is a 2-inch overhang on the two long sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the shortbread: In the bowl of an electric mixer fitted with a paddle attachment or beaters, mix together flour, sugar and salt. Beat in butter on low speed until dough just comes together but is still a little crumbly. (Or pulse together ingredients in a food processor.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press dough into prepared pan. Prick dough all over with a fork. Bake until golden, 30 to 35 minutes. Remove from oven. Raise oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As shortbread bakes, prepare the brownie: Place butter and chocolate in a large bowl. Melt in the microwave in 30-second bursts, stirring after each burst, until smooth. (Alternatively, place bowl over a pot of simmering water, and heat chocolate and butter, stirring until smooth and melted.) Whisk in sugars and cocoa powder until smooth, then whisk in eggs and vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together flour and sea salt. Whisk into chocolate mixture until no streaks of flour remain. Fold in nuts, if using. Spread mixture onto the warm shortbread base. Sprinkle lightly but evenly with flaky sea salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the top is set, the center is soft, and the edges start pulling away from the pan, 23 to 28 minutes. (A toothpick inserted into the center will come out gooey.) Transfer to a wire rack to cool completely. Cut into bars before serving."}]}