{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Burrata and Garlic-Chile Oil", "description": "Burrata — a cousin of mozzarella with a creamy core — is a splurge, but it does all the heavy lifting in this simple dish, adding a rich finish that renders a basic bowl of whole-wheat noodles sophisticated. A spicy-sweet seasoned oil made by sautéing fennel, garlic and red-pepper flakes in good-quality olive oil over low heat is drizzled over the top, complementing the velvety texture of the cheese and the nuttiness of the noodles.", "author": {"@type": "Person", "name": "Sarah Copeland"}, "image": "https://static01.nyt.com/images/2019/05/14/dining/sc-whole-wheat-spaghetti-with-burrata-2/sc-whole-wheat-spaghetti-with-burrata-2-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, for two, lunch, weekday, pastas", "keywords": "burrata, fennel, garlic, red pepper flakes, spaghetti, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 542}, "recipeIngredient": ["Kosher salt", "1 teaspoon fennel seeds", "3/4 cup extra-virgin olive oil", "1 large head fennel (about 8 ounces), trimmed, cored and thinly sliced", "10 garlic cloves, thinly sliced lengthwise", "3/4 teaspoon red-pepper flakes", "1 pound whole-wheat spaghetti", "8 ounces burrata cheese", "1 teaspoon flaky sea salt, such as Maldon", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil. Crack the fennel seeds with the flat side of a large knife or the backside of a heavy skillet. Heat the oil, sliced fennel, garlic, fennel seeds and red-pepper flakes in a large skillet over low. Cook, stirring occasionally, until the garlic and fennel are softened and the oil is deeply flavored, 12 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the pasta according to package directions until al dente. Drain and return pasta to pot. Reserve a few tablespoons of the seasoned oil and fennel mixture, then add the rest to the pot with the pasta and toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the pasta and burrata among four shallow bowls. Spoon the remaining seasoned oil and fennel mixture over the top and season with flaky salt and black pepper to taste."}]}