{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pan Pork Chops With Feta, Snap Peas and Mint", "description": "Brawny and golden brown, these seared pork chops make a hearty one-pan dinner that’s rounded out by sweet sugar snap peas and loads of fresh mint. The feta, added at the end, melts into the pork and peas, spiking the sauce with its brininess. Be generous with the fresh lemon juice at the end; this rich dish gains a lot from the tang.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/06/11/dining/mc-pork-chops-with-feta/merlin_155267139_e8a127de-ac43-4f23-837b-1796c57da158-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "3 to 4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, quick, meat, steaks and chops, vegetables", "keywords": "feta, lemon, mint, pork chops, scallion, snap peas, main course, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 476}, "recipeIngredient": ["2 (1 1/4-inch-thick) bone-in pork chops (about 1 pound each)", "Kosher salt and black pepper", "1 tablespoon extra-virgin olive oil", "1 tablespoon unsalted butter", "4 scallions, white and green parts, thinly sliced, plus more for serving", "2 cups sugar snap peas, trimmed", "1/2 cup chopped fresh mint or basil, plus more for serving", "Large pinch of red-pepper flakes", "1/2 cup crumbled feta", "Lemon juice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season pork chops with salt and pepper. In a large skillet, heat oil over medium-high until shimmering."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pork chops to skillet and sear, without moving, until dark golden, 4 to 5 minutes per side. Lower heat, cover pan and cook the pork chops for 3 minutes longer. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to the stove and reduce heat to medium. Add butter to remaining oil in skillet, then add scallions and cook until lightly golden, 2 to 3 minutes. Add snap peas, mint, red-pepper flakes and a pinch of salt, stirring everything to coat with pan juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Making space in the skillet, return pork chops to pan, surrounding them with snap peas. If necessary, you can mound snap peas on top of pork, but make sure the meat sits directly on the bottom of pan. Scatter feta over pork and snap peas. Cover and cook over low heat until pork chops are just cooked through, 3 to 6 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle or squeeze lemon juice over the dish and sprinkle with more mint, scallions and black pepper before serving."}]}