{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Caramel Matzo Toffee", "description": "Matzo toffee is the Passover-friendly take on <a href=\"https://cooking.nytimes.com/recipes/1013390-saltine-cracker-brickle\">saltine toffee</a>. A layered confection of matzo crackers, brown sugar caramel and melted chocolate, you can top it with practically anything you like, from the most elegantly minimal sprinkle of sea salt to a surfeit of nuts, dried fruit, potato chips, or a combination. Matzo toffee keeps well when stored airtight at room temperature — up to one week, if you haven’t finished it by then.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2019/04/09/dining/mc-matzo-toffee/merlin_152985210_b0cc5bc5-c758-4163-aa7e-b0c39e99d8b4-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "About 2 dozen pieces", "recipeCuisine": "jewish", "recipeCategory": "snack, candies, cookies and bars", "keywords": "butter, chocolate, matzo, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 118}, "recipeIngredient": ["4 to 6 sheets matzo, preferably salted", "1 cup/225 grams unsalted butter (2 sticks)", "1 1/2 packed cups/315 grams light brown sugar", "2 teaspoons vanilla extract", "Large pinch of fine sea salt", "7 ounces chopped bittersweet, milk or white chocolate, or a combination (about 1 cup)", "Toppings, as desired (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a 13-by-18-inch rimmed baking sheet with aluminum foil, allowing it to go up and over the edges of the pan. Line the bottom of the pan with a piece of parchment. Arrange matzo over parchment in an even layer, breaking pieces to fit as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium pot over medium-high heat, bring butter and sugar to a boil, whisking, until thickened and smooth, about 3 minutes. The mixture may separate, and that is O.K. Stir in vanilla and salt. Quickly pour mixture over matzos. Transfer baking sheet to oven and bake until bubbly, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven. Sprinkle chocolate evenly over caramel and let stand until softened, about 5 minutes. Use an offset spatula to spread chocolate smoothly over surface of toffee. If you’ve used different kinds of chocolate, you can swirl them together decoratively."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately sprinkle melted chocolate with desired topping. Transfer baking sheet to refrigerator and chill toffee 1 hour to set chocolate. Break matzo toffee into large pieces for storing and serving."}]}