{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Soup With Toasted Farro and Greens", "description": "Somewhere between a soup and a stew, this comforting dish starts with chicken stock seasoned with leeks, carrots and celery. Garlic and fennel seeds are toasted along with the farro to add another layer of flavor. Boneless chicken thighs are cooked in the broth, then greens are tossed in just before serving. This soup is best served right away, as the farro will continue to absorb liquid as it sits, but leftovers can be reheated with some additional broth or water over low heat. Lemon zest lends a lovely lift, but a spoonful of chile oil would also be lively addition.", "author": {"@type": "Person", "name": "Colu Henry"}, "image": "https://static01.nyt.com/images/2020/01/22/dining/ch-chicken-and-farro-soup/merlin_167526831_9a4c51b4-2ba3-435b-bddd-372b3815f7ee-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weeknight, soups and stews", "keywords": "carrot, chicken, chicken thigh, farro, leek, swiss chard, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 160}, "recipeIngredient": ["2 tablespoons olive oil", "2 medium leeks, white and light green parts only, halved and thinly sliced (about 1 1/2 cups)", "2 medium carrots, peeled and thinly sliced into rounds", "1 celery stalk, thinly sliced", "3 garlic cloves, finely chopped", "1 teaspoon fennel seeds, gently crushed or roughly chopped", "1/2 teaspoon red-pepper flakes", "Kosher salt and black pepper", "1 cup farro, rinsed", "6 cups homemade or store-bought low-sodium chicken stock", "3/4 pound boneless, skinless chicken thighs", "5 cups stemmed and roughly chopped Swiss chard, or other quickly-wilting greens like kale or spinach", "Lemon zest, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large stock pot or Dutch oven over medium. Add the leeks, carrots and celery, and cook, stirring occasionally, until they have softened, but have not taken on any color, 4 to 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic, fennel seeds and red-pepper flakes, and cook until fragrant, about 1 minute. Season well with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the farro and cook, stirring frequently, until slightly toasted, 1 to 2 minutes. Add the stock and chicken thighs. Bring to a boil, then reduce heat to a simmer. Cook until the chicken has cooked through and is no longer pink, 10 to 12 minutes, skimming any bits of foam that float to the surface, if desired. Using a slotted spoon or tongs, transfer the chicken to a cutting board. When cool enough to touch, shred the chicken into bite-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue simmering the soup until the farro is tender but still toothsome, about 20 minutes more. Add the chicken back to the pot along with the greens and stir until greens are gently wilted. Taste and adjust seasonings as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle into bowls and grate lemon zest over top, if desired."}]}