{"@context": "http://schema.org", "@type": "Recipe", "name": "Boeuf a la Mode (Beef and vegetables in red wine)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "beef, carrot, turnip, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 529, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "32 grams", "fiberContent": "3 grams", "proteinContent": "34 grams", "saturatedFatContent": "13 grams", "sodiumContent": "968 milligrams", "sugarContent": "6 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["3 pounds very lean chuck steak in one piece", "Salt to taste, if desired", "Freshly ground pepper to taste", "1 1/2-pound onion", "3 large carrots, about half pound", "2 turnips, about half pound", "1 large clove garlic", "2 ribs celery", "3 sprigs fresh parsley", "2 sprigs fresh thyme or half teaspoon dried", "1 bay leaf", "2 tablespoons corn oil", "2 tablespoons flour", "2 cups dry red wine", "1 cup water", "2 tablespoons Cognac, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the beef into one-and-a-half-inch cubes. Sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape and trim vegetables onto a sheet of wax paper. When finished, the paper may be gathered up and discarded in one fell swoop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a paring knife, peel the onion. Cut it into three-quarters-of-an-inch cubes. There should be about one cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim off the ends of the carrots with a paring knife. Using a swivel-bladed paring knife, scrape the sides of the carrots. Using the chef's knife, cut the carrots into one-and-a-half-inch lengths. Cut the lengths into quarters. There should be about one and a half cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a regular paring knife, cut off the stems and opposite ends of the turnips. Using a swivel-bladed paring knife, peel the turnips. Cut the turnips into quarters. Cut each quarter in half. There should be about two cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a paring knife, peel the garlic. Using a chef's knife, mince it fine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a chef's knife, cut the celery lengthwise into quarters. Cut the strips into one-and-a-half-inch lengths. There should be about one cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gather the parsley, thyme and bay leaf into a bundle. Tie it with string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a heavy skillet (for example, a five-quart skillet 11 1/2 inches in diameter)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the oil is extremely hot and almost smoking, add the beef pieces one cube at a time. As the meat browns on one side, turn the pieces, scraping them from the bottom with a wooden spoon or turning them with a two-pronged fork. While browning the meat the heat should be kept as high as possible. The browning should take about five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beef cubes are browned all over, add the onions and garlic and stir to blend. The beef will give up some liquid. Continue cooking over high heat, stirring often, about three minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use the skillet lid, partly cover and pour off the fat from the skillet. Sprinkle with flour and stir with a wooden spoon to coat the cubes evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine and water and stir until flour is blended with the liquid. Add the tied bundle of herbs, salt and pepper to taste. Cover closely and cook over moderate heat one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the turnips, carrots and celery in a small saucepan (a five-cup saucepan is suitable) and add water to cover. Add salt to taste. Bring to a boil. Let cook about one minute. Drain in a colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vegetables to the stew. Cover closely and continue cooking 30 minutes. Add the Cognac and serve piping hot with rice or boiled buttered potatoes."}]}