{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT50M", "recipeYield": "About six to 10 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "cornmeal, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 160, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "681 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["2 cups coarse cornmeal, preferably imported from Italy (see note)", "8 1/2 cups water", "Salt, if desired", "1 tablespoon olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure the cornmeal and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the water in a heavy casserole and bring to a full, rolling boil over high heat. Add salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start stirring vigorously with a wire whisk. Gradually add the cornmeal in a thin, steady stream. One must stir rapidly as the meal is added to prevent lumping. Stir constantly for at least five minutes, covering the inside of the casserole, bottom and sides, to blend well and prevent lumping."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the end of five minutes, turn the heat to moderately low and continue cooking, stirring quite often with a heavy wooden spoon all around the bottom and sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the end of 15 or 20 minutes, a light crust will start to form on the bottom of the casserole. Add the olive oil and continue stirring with the spoon. For this quantity of cornmeal, the total cooking time should be about 20 minutes. The cooking time, depending on the quantity of cornmeal and water, might take up to 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To unmold quickly, invert the casserole on top of a clean, flat surface. Traditionally, Italian cooks use a string to cut the polenta into serving portions. Hold a string taut at both ends and slip it carefully under the bed of polenta, holding the string close against the flat surface. Force the string under the polenta to a distance of from one to two inches. Bring it up quickly to make a long slice. Repeat, pushing the string farther away from you and bringing it up to make a second long slice. Repeat. Now, turn the string and repeat slicing in the other direction."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve hot with any of various savory stews. Or chill the polenta and bake it later with cheese on top."}]}