{"@context": "http://schema.org", "@type": "Recipe", "name": "Brigadier Anne Field's Keswick Fruitcake", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "1 eight-inch round or square cake or 2 two-pound loaf cakes", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, dried cherries, walnut, dessert", "aggregateRating": null, "recipeIngredient": ["8 ounces white raisins", "4 ounces candied peel", "8 ounces mixed chopped glaceed pineapple, papaya or other fruits", "4 ounces walnuts, chopped", "2 ounces ground almonds", "6 ounces dried cherries", "1/2 cup Cognac or rum", "8 ounces butter", "8 ounces sugar", "4 eggs", "8 ounces plain flour", "1 teaspoon baking powder", "1 1/2 teaspoons salt", "1 lemon", "Grated peel of one orange"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "A day in advance, put white raisins, candied peel and glaceed fruits in a bowl. Add walnuts and ground almonds and mix well into the fruit. Place the cherries in a bowl with the Cognac."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On the day of baking, preheat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cream the butter with the sugar until light colored. Add eggs one at a time and blend in thoroughly. Sift in flour, baking powder and salt. Grate the peel from the lemon and set aside. Add juice from the lemon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold in fruit and nuts, the lemon and orange peels and mix thoroughly. Add cherries soaked in brandy. Mix well. Line one eight-inch round or square tin or two two-pound loaf tins with double grease-proof paper, greasing the tin and paper. Spoon mixture into the tin(s) so that the top is flat (you can do this by knocking the tin(s) gently on the top. Place tin(s) in the low center of the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for one hour, then turn down heat to 300 degrees for the next hour and a half to two hours or until cooked. Test by piercing the center of the cake with a skewer. It should come out very slightly sticky but pretty much clean when the cake is ready. When the cake is cool, wrap in aluminum foil and store in a tin in a sealed plastic container."}]}