{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry-Chocolate Gypsy Bundles", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, side dish, phyllo, raspberries, semisweet chocolate", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 282, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "9 grams", "sodiumContent": "186 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 sheets phyllo dough, defrosted at room temperature for an hour", "6 tablespoons unsalted butter, melted, plus small amount for the baking sheet", "1 1/2 cups fresh raspberries, about 6 ounces", "1 1/2 ounces semisweet or bittersweet chocolate, cut into 6 1/4-ounce pieces", "6 teaspoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Position rack in center of oven. Preheat oven to 400 degrees. Use a non-air-cushioned baking sheet. Cut a piece of parchment paper to fit. Lightly butter the baking sheet, and stick on paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the 12 phyllo-dough sheets on a clean dry surface. With a sharp knife, cut the sheets in half widthwise so that you have 2 stacks, each measuring 8 by 11 inches. Combine the stacks. Cover with a damp towel. As you take sheets of dough from the stack, re-cover to keep them from drying out and becoming unusable. (Avoid getting them wet, because that makes them stick together.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make six sandwiches of the phyllo dough sheets by lightly brushing one sheet of dough with melted butter, covering that with another sheet of dough, buttering that, adding another sheet, buttering that, and finishing with a fourth piece of phyllo. If there are a few tears or gaps in a sheet, just layer over them with another piece of dough. Less butter on the outer edges of the dough allows them to hold their shape better."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1/4 cup raspberries in the center of each sandwich. Top berries with a piece of chocolate. Sprinkle with 1 teaspoon sugar. To form bundles, gather up the edges of each dough sandwich with one hand, gently twisting the extra dough into a topknot on top of the fruit and chocolate. Leave the ends of the dough sticking straight up. Place on baking sheet. Brush bundles with any remaining butter. Bundles can sit for up to an hour before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove to cooling rack. Allow to cool slightly. Serve warm or at room temperature."}]}