{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Wine-Port Ice Cream", "description": "", "author": {"@type": "Person", "name": "William Grimes"}, "image": null, "totalTime": "PT30M", "recipeYield": "1 quart", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, port, red wine", "aggregateRating": null, "recipeIngredient": ["1 bottle French Burgundy, Bordeaux or California pinot noir", "1 bottle vintage port", "3 tablespoons creme de cassis", "3 tablespoons Chambord liqueur", "Zest of 1 lemon", "Zest of 1 orange", "1 stick cinnamon", "5 whole cloves", "5 whole black peppercorns, crushed", "1 3/4 cups milk", "1/2 cup cream", "1 vanilla bean, split", "6 egg yolks", "1 cup plus 2 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy-bottomed saucepan over high heat, combine the Burgundy and port. Bring to a boil, then reduce heat to medium. Simmer until the mixture has reduced to 1 cup, about 30 minutes. Remove from heat, and add the creme de cassis, Chambord, lemon zest, orange zest, cinnamon, cloves and peppercorns. Add the milk and cream. Scrape the pulp from the vanilla bean into the mixture, and add the bean as well. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine the egg yolks and sugar. Mix until blended. Return the saucepan containing the wine mixture to medium heat, and bring back to a boil. Slowly whisk the hot wine mixture into the eggs, then return the contents of the bowl to the saucepan. Place the saucepan over low heat, and stir constantly with a wooden spoon until the mixture is thick enough to coat the back of the spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the mixture into a mixing bowl, and place the bowl in a container of ice water to cool. When the mixture has chilled, freeze in an ice cream maker, according to manufacturer's instructions."}]}