{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Enchiladas", "description": "This Mexican recipe came to The Times in 2002 by way of Amanda Hesser. It is a simply prepared casserole of shredded chicken rolled in corn tortillas underneath a mild, seed-speckled tomatillo sauce. Crumbled queso añejo, a sharp white cheese, is sprinkled over the top before it is baked until the cheese melts and the entire dish is heated through. You could serve it with rice and a medley of steamed beets, cauliflower and carrots, as a cook in Mexico might, but a crisp green salad would be welcome, too. (After reading several comments from readers who felt the sauce needed to be doubled, we retested the recipe and agreed. We've updated the amounts accordingly.)", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2017/04/06/dining/06COOKING-ENCHILADAS1/06COOKING-ENCHILADAS1-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, easy", "keywords": "chicken breast, corn tortillas, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1035}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 861, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "10 grams", "proteinContent": "81 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1662 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Sea salt", "4 skinless, boneless chicken-breast halves", "2 pounds tomatillos, papery skin removed", "2 tablespoons vegetable oil", "2 large white onions, peeled, 1 chopped, the other sliced into rings", "2 tablespoons minced jalapeño", "3 tablespoons chopped cilantro", "12 corn tortillas", "8 ounces queso añejo or cotija, crumbled", "Mexican crema or crème fraîche for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pan of salted water to a simmer and poach the chicken over low heat until just cooked through, about 9 minutes. Remove to a bowl. Let cool. With your fingers, finely shred the chicken. Lightly season with salt, toss to mix and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the sauce. Cut the tomatillos in half. Heat the oil in a skillet large enough to fit the tomatillos in 1 layer. When the oil shimmers, add the chopped onion and jalapeño and sauté until the onion is softened at the edges. Add the tomatillos, season with salt and continue cooking until wilted. Turn off the heat and let cool for a few minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the tomatillos into a food processor or blender and blend until smooth. Add the cilantro. Adjust the seasoning. Pour the sauce into a shallow bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Grease a 2-quart baking dish and spread a little sauce on the bottom. Working with 1 tortilla at a time, soften each in a dry, hot skillet for about 8 seconds per side, then coat lightly with sauce. Lay each tortilla on a plate and sprinkle about 1/3 cup of shredded chicken in the middle and roll into a cylinder. Repeat, lining up tortillas tightly in the dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the rest of the sauce over the tortillas and sprinkle with queso añejo. Cover the dish with aluminum foil and place in the oven. Bake until heated through, about 15 minutes. Remove the foil and bake 10 minutes longer, until the queso añejo is melted. Dollop with crema, garnish with onion rings and serve with additional crema."}]}