{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Rack of Lamb With Rosemary-Lemon Sauce", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "lamb, lemon juice, rosemary, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "recipeIngredient": ["2 racks of lamb, about 3 1/2 pounds total (8 ribs per rack)", "Salt and freshly ground pepper to taste", "2 teaspoons dried rosemary or 1 tablespoon fresh", "2 tablespoons olive oil", "2 tablespoons fresh lemon juice", "4 tablespoons sweet butter", "2 tablespoons minced shallots", "1/4 cup diced parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the thick layer of fat off the back of the racks of lamb. Trim all other fat with a knife and discard. Using a heavy cleaver, chop off the rib bones a few inches from the base. This allows the meat to lay on the grill more easily; the ribs should be grilled separately and served as well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all the meat in a roasting pan. Season generously with salt and pepper. Sprinkle with rosemary and rub with olive oil. Let sit for several hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the base of the racks over hot coals and grill for about 10 minutes, covered, turning occasionally. Add the rib sections during the last 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the meat is cooked place all pieces in an ovenproof roasting pan and let rest on the side of the grill where heat is least intense. Add the butter and shallots to the pan. When the butter has melted, add the lemon juice and the parsley. Let all this mix with the meat drippings for about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carve the rack into serving portions in the roasting pan to catch the juices. Place the meat and some of the ribs on each serving plate. Stir the sauce well over the heat and spoon some over the meat. Serve immediately."}]}