{"@context": "http://schema.org", "@type": "Recipe", "name": "Many-Flavor Duck Salad", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT50M", "recipeYield": "25 servings", "recipeCuisine": "chinese", "recipeCategory": "salads and dressings", "keywords": "cabbage, duck", "aggregateRating": null, "recipeIngredient": ["3 five-to-six pound ducks, red-cooked (<a href=\"http://cooking.nytimes.com/recipes/10492-red-cooked-duck\">see recipe</a>)", "1/2 cup pine nuts", "1/2 teaspoon plus three-quarter cup corn, peanut or vegetable oil", "3 sweet red or green peppers, cored, seeded and cut into one-inch-wide shreds", "12 cups Shandong (white-ribbed Chinese cabbage)", "1 1/2 cups minced scallions, green and white parts combined", "1 1/2 tablespoons minced fresh ginger", "1 tablespoon ground roasted Sichuan peppercorns", "Freshly ground pepper to taste", "3 fresh hot chili peppers, seeded and finely chopped", "9 tablespoons dark soy sauce", "4 1/2 tablespoons hoisin sauce", "3 tablespoons honey", "2 tablespoons finely minced garlic", "2 teaspoons bottled chili paste with garlic"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the ducks one at a time in the sauce. Remove and let cool. Cut the ducks into quarters and pull the bones from the meat. Cut away and discard the skin and any fat. At this point, the ducks may be prepared a day or longer in advance. If it is not to be used immediately, wrap the pieces in foil or plastic wrap and refrigerate or freeze. Cut the meat when it is at room temperature or defrosted or pull it into one-inch-wide shreds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 325 degrees. Put the pine nuts in an ovenproof skillet and toss them in one-half teaspoon of the corn oil. Place in the oven and bake 10 to 15 minutes or until golden brown. Cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the nuts in a large mixing bowl and add the duck, shredded green peppers and cabbage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the remaining three-quarter cup of corn oil in a saucepan and add the chopped scallions, ginger, peppercorns, pepper and chili peppers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the dark soy sauce, hoisin sauce, honey, garlic and chili paste with garlic in a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the corn-oil mixture to the simmer and let cook one minute, no longer. Add the soy-sauce mixture and stir. Remove from the heat. Pour this simmering liquid over the salad. Toss, blending well, and serve immediately."}]}