{"@context": "http://schema.org", "@type": "Recipe", "name": "Banana Walnut Tarte Tatin", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "banana, pastry, walnut, dessert", "aggregateRating": null, "recipeIngredient": ["1 cup coarsely chopped walnuts", "1/2 cup unsalted butter", "1 cup brown sugar", "8 large bananas", "Tarte Tatin pastry (<a href=\"http://cooking.nytimes.com/recipes/10504-tarte-tatin-pastry\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Place a 10-inch skillet over medium heat until hot. Add the chopped walnuts and cook, stirring constantly until nuts are toasted, about 2 minutes. Remove from pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the butter in the skillet and heat until melted. Add the brown sugar and stir until smooth. Remove from heat. Peel the bananas. Cut them in half lengthwise and then crosswise. Arrange the banana pieces in the skillet in concentric circles, rounded side down, so that the curve of the banana fits into the curve of the pan. Make layers as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pan back on the heat and cook for 5 minutes. Roll the dough and cover the bananas according to the directions in the pastry recipe. Bake until the crust is golden brown, about 25 to 30 minutes. Remove from oven and set aside for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Run a small, sharp knife around the edge of the tarte to loosen. Place a large plate or platter over the skillet. Holding the plate and skillet together using 2 kitchen towels, carefully but quickly invert the tarte onto the plate. Let stand a few minutes to cool slightly. Cut into wedges and serve with coffee rum whipped cream (see recipe) or vanilla ice cream if desired."}]}