{"@context": "http://schema.org", "@type": "Recipe", "name": "Marc Peel's Truffled Turkey Potpie", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT3H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "black truffle, turkey, main course, winter", "aggregateRating": null, "recipeIngredient": ["1 roast turkey carcass", "2 medium carrots", "3 stalks celery", "3 medium onions", "2 tablespoons fresh thyme or 2 teaspoons dried thyme", "1 tablespoons whole black peppercorns", "1 cup dry white wine", "1 medium boiling potato", "1 tablespoon flour", "2 tablespoons vegetable oil", "2 bay leaves", "1 cup heavy cream", "4 ounces unsalted butter", "1 ounce fresh black truffles, slivered", "4 ounces fresh foie gras, cut in tiny batons", "Flaky pastry (<a href=\"http://cooking.nytimes.com/recipes/1052-flaky-pastry\">see recipe</a>)", "1 egg", "1 tablespoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pluck as much turkey meat from carcass as possible and set aside. You need about 2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice 1 carrot, 1 stalk celery and 2 onions. Chop up turkey carcass roughly so it will fit into a large pot. Add peppercorns, bay leaves and white wine, and fill the pot with water to just below the top of the turkey bones. (Use as little water as possible.) Simmer for 3 hours, occasionally skimming foam off top. Strain stock, skim off any fat and reduce stock over high heat to about 1 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While stock is reducing, peel potato, remaining carrot and onion and roughly dice them, along with remaining celery."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dust turkey meat with flour; saute over high heat in 2 tablespoons vegetable oil until turkey crisps. Add vegetables and saute until vegetables are just barely tender, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove vegetables and turkey; add stock and cream to the pan and bring to boil for 5 minutes, just until it begins to thicken. Return turkey and vegetables to the pan with cream, and simmer a couple of minutes longer. Season with thyme, salt and pepper. Remove and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When mixture is cool, fill 4 10-ounce souffle molds with mixture. Top with slivered black truffles and tiny batons of foie gras."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top the souffle molds with flaky pastry, rolled about 1/8-inch thick. Pierce in center with fork to allow steam to escape and seal edges with egg wash made from 1 egg beaten with 1 tablespoon water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake at 425 degrees until top is golden brown, about 15 to 20 minutes. Serve hot."}]}