{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Snapper With Sweet and Hot Pepper Sauce", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "green chili, red bell pepper, red snapper fillets, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 280, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "36 grams", "saturatedFatContent": "2 grams", "sodiumContent": "788 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["4 tablespoons extra-virgin olive oil", "2 large sweet red peppers, cored, seeded and chopped", "1 jalapeno or other hot green chili, seeded and minced", "1/2 cup finely chopped onion", "2 cloves garlic, minced", "2 cups water", "1 tablespoon fresh lime juice", "6 red snapper fillets, each about 6 ounces, skin on", "Salt and freshly ground black pepper", "1/4 teaspoon paprika", "Sprigs of fresh coriander"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the oil in a heavy saucepan. Add the red peppers, green chili and onion and saute over low heat until soft, but not brown. Stir in the garlic, cook a few seconds longer, then add the water. Allow to simmer about 20 minutes, until the peppers are very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat a grill or broiler and oil the rack. Mix the lime juice with two tablespoons of the olive oil and brush over the fish. Allow to marinate until ready to cook the fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the peppers are tender, puree the contents of the saucepan in a food processor or blender. Season with the paprika and to taste with salt and pepper. Stir the last tablespoon of the olive oil. Return to saucepan and simmer, then cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To grill the fish, place the fish on the grill skin side up. Cook about six minutes, until the fish is lightly seared. Using a large spatula, turn the fish, cook very briefly on the other side, then transfer to warm plates. To broil the fish, broil it skin side down until the fish is cooked through and lightly seared, six to eight minutes. Do not turn it. Transfer the fish to a warm plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon some of the pepper sauce over and around the fish and garnish with coriander."}]}