{"@context": "http://schema.org", "@type": "Recipe", "name": "Chickens Under a Brick", "description": "These take only 12 or 15 minutes to prepare and can be held in a 50-degree oven for an hour or so. Therefore it is most convenient to grill them two at a time.", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "chicken, main course, summer", "aggregateRating": null, "recipeIngredient": ["6 chickens, 3 to 4 weeks old, weighing about 1 1/2 to 2 pounds each", "1/2 cup vegetable oil", "Coarse sea salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse chickens inside and out and pat dry with paper towels. Butterfly the chickens by removing the spine, flattening the birds with your hand and removing the breast bone with a small sharp knife or your fingers. Then firmly but gently pound them flat with the side of a cleaver or a small iron skillet. Remove and discard the wing tips and fold the wings back. Tuck the legs into the skin surrounding the vent by making neat slits at the point where the leg end can easily be inserted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a stove-top grill large enough to cover two burners and brush the chickens very lightly with oil. Add salt and pepper. When the grill is hot, reduce the flame to medium and lay the chickens skin side down on the grill above each burner. Move the chickens gently with tongs until they begin to sear, to be sure they don't stick to the grill. Cover each with a heavy, flat-bottomed object large enough to cover the entire chicken. You can use 8-quart stockpots or their equivalent filled with water, 10- or 12-inch cast-iron skillets or flat bricks (covered with foil)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In about 5 or 6 minutes the chicken will begin to brown. If not, raise the flame. If the chickens have begun to burn, turn them over, replace the weights and reduce the flame. At this stage you will be making your own decision based on empirical data. The result should be a rich mahogany finish and an intense chicken flavor."}]}