{"@context": "http://schema.org", "@type": "Recipe", "name": "Cassoulet Toulousain", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H", "recipeYield": "Twelve servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "great northern beans, lamb, pork, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 680, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "6 grams", "proteinContent": "44 grams", "saturatedFatContent": "14 grams", "sodiumContent": "867 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound slab bacon", "2 pounds dried Great Northern beans, soaked in water overnight and drained", "1 carrot, peeled", "3 yellow onions, peeled", "4 cloves", "10 cloves garlic, peeled", "2 bouquets garnis", "1/2 teaspoon salt, plus more to taste", "1 gallon chicken or duck broth", "1/4 cup duck fat (from confit de canard, recipe above)", "1 pound lamb stewing meat, cut into 2-inch chunks", "1 pound pork stewing meat, cut into 2-inch chunks", "Freshly ground pepper to taste", "3 tomatoes, peeled and seeded", "1/2 pound French garlic sausage (available at specialty butchers)", "4 duck confit legs (recipe above)", "1 cup bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the fat from the bacon in a large, heavy-bottom pot over medium heat. Add the beans and carrot. Stud 1 onion with the 4 cloves and add, along with 5 of the garlic cloves and 1 bouquet garni. Season with 1/2 teaspoon of salt and add a half gallon of broth. Cover and simmer until the beans are almost tender, about 1 hour. Drain, reserving the broth and beans. Discard the onion and the bouquet garni. Cut the bacon into 1-inch cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large stewing pot over medium heat, melt 1 tablespoon of the duck fat. Add the lamb and pork, season lightly with salt and pepper and sear over medium-high heat, about 3 minutes. Discard all but 1 tablespoon of the remaining fat, return the pork and lamb to the pot. Chop the remaining onions and add. Mince the remaining garlic and add, along with a bouquet garni and the tomatoes. Add 1 quart broth and simmer, uncovered, for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the beans, bacon and garlic sausage to the pot and simmer for 1/2 hour. Remove the garlic sausage and, when cool, slice in 1/2-inch slices. In a large, ovenproof pot, ladle in half the bean-and-meat mixture. Add a layer of sausage and the duck confit. Top with remaining beans and remaining quart of broth. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Three hours before serving, remove the cassoulet from the refrigerator. Remove the top layer of fat and discard. Preheat oven to 325 degrees. Sprinkle with bread crumbs. Bake for 2 hours. If it begins to dry, moisten with reserved bean broth. Serve immediately."}]}