{"@context": "http://schema.org", "@type": "Recipe", "name": "Ras Malai (Fresh Cheese Balls in Milk Syrup)", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "4 servings", "recipeCuisine": "indian", "recipeCategory": "dinner", "keywords": "cardamom pods, milk, pistachio, dessert, fall, winter, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 935, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "153 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "1 gram", "proteinContent": "25 grams", "saturatedFatContent": "14 grams", "sodiumContent": "316 milligrams", "sugarContent": "150 grams", "transFatContent": null}, "recipeIngredient": ["12 cups (3 quarts) whole milk", "5 tablespoons fresh lemon juice", "2 1/2 teaspoons fine semolina", "2 1/4 cups sugar", "10 cardamom pods", "1 tablespoon rose water", "2 tablespoons unsalted pistachios, blanched and finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 8 cups of the milk in a large kettle until it just boils. Remove from the heat and stir in the lemon juice. Set aside for 5 minutes. Line a large colander with a triple layer of cheesecloth and pour the curdled milk through. Drain for 30 minutes. Lift up the cloth's edges and gently twist, wringing out as much liquid as you can."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn curds out onto a smooth surface and knead for 5 minutes. Add the semolina and continue to knead until the curds are smooth and your hands feel greasy, 3 to 4 more minutes. Form the mixture into 12 balls of equal size. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, combine 2 cups of the sugar with 4 cups of water and bring to a boil. Lower the heat and simmer 5 minutes. Put the cheese balls and cardamom into the pan. Simmer uncovered until the balls swell and become spongy, about 1 hour. Remove the balls with a slotted spoon and discard the syrup and cardamom. Place the balls in another saucepan with the remaining milk and allow them to cool completely, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, remove the balls from the milk and set them aside. Place the saucepan with the milk over medium-high heat and bring to a boil. Lower the heat and simmer, stirring occasionally so it does not boil over. Simmer until the milk is reduced to 2 cups, about 1 hour. Remove from the heat, stir in the remaining sugar and the rose water and return the cheese balls to the milk. Cover and refrigerate. To serve, divide the balls between 4 bowls, spoon some of the milk syrup around them and sprinkle with the pistachios."}]}