{"@context": "http://schema.org", "@type": "Recipe", "name": "The Perfect Burger", "description": "", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT25M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, quick, burgers", "keywords": "fall, spring, summer, winter, ground chuck, hamburger roll, sweet onions, main course, nut-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 592, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "55 grams", "saturatedFatContent": "6 grams", "sodiumContent": "441 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds ground chuck, preferably chicken steak or blade steak, not more than 20 percent fat", "6 four-inch Pepperidge Farm Farmhouse white rolls or Amy's Bread rolls", "2 large sweet onions", "2 ripe tomatoes", "6 leaves of Boston or iceberg lettuce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a seasoned cast-iron grill pan over a high flame for five minutes. Meanwhile, place the meat in a bowl and knead lightly. (Disregard experts who warn that kneading will produce a dry burger. Kneading will not have this effect on chuck cooked rare or medium rare, but it will keep the meat from falling apart. Leaner cuts will be dry whether or not you knead them.) Divide the meat into six portions and shape burgers. Do not season."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add burgers three at a time to pan leaving space between them. After four minutes lift burgers from pan with pair of tongs and turn by 90 degrees. After two minutes turn burgers over. The grill marks will form an attractive tick-tac-toe matrix. Meanwhile, toast rolls. In about five minutes meat will be medium-medium rare. Add sweet onion, tomato and lettuce on roll's bottom half. Add burger. Top with other roll half. Serve with ketchup."}]}