{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Farfalle With Eggplant", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles, pastas", "keywords": "eggplant, farfalle, vegetables, main course, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 410, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "57 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "6 grams", "proteinContent": "16 grams", "saturatedFatContent": "5 grams", "sodiumContent": "650 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 eggplant, about 1 1/2 pounds", "Salt", "4 tablespoons extra-virgin olive oil", "1/2 cup chopped onion", "4 cloves garlic, minced", "1/2 teaspoon hot red pepper flakes (or to taste)", "3 cups coarsely chopped ripe or well-drained canned tomatoes", "1 tablespoon minced flat-leaf parsley", "Freshly ground black pepper", "1 pound farfalle", "4 ounces shredded mozzarella cheese", "1/2 cup freshly grated Parmesan cheese", "1/2 cup dry bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a broiler or grill. Slice the eggplant one-half-inch thick. Grill or broil it, turning it once, until it is nicely browned. It will look dry and papery. Set it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a pot with four quarts of salted water over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the oil in a heavy skillet, add the onion and saute until golden. Stir in the garlic and hot red pepper. Add the tomatoes and simmer about 15 minutes, until the sauce is slightly thickened. Stir in the parsley and season to taste with salt and pepper, adding additional hot pepper if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water is boiling, add the farfalle and cook until it is just tender, about eight minutes. Drain it well; toss it with a tablespoon of the oil, and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a baking dish 8 by 12 inches with half a tablespoon of the oil and spread one-third of the farfalle in the dish. Spread half the eggplant on the farfalle and spoon on one-third of the tomato sauce. Top with half the mozzarella. Repeat with a layer of farfalle, the rest of the eggplant, half the remaining tomato sauce and the rest of the mozzarella. Spread the remaining farfalle and tomato sauce on top and sprinkle with the Parmesan cheese, bread crumbs and remaining oil. Set aside until half an hour before serving time. If you refrigerate it, be sure to bring the dish to room temperature before baking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Place the baking dish in the oven and bake for 30 minutes, until the sauce is bubbling and the top has browned."}]}