{"@context": "http://schema.org", "@type": "Recipe", "name": "Farfalle With Artichokes, Mushrooms and Potatoes", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "baby artichokes, farfalle, new potatoes, main course, nut-free, vegetarian, spring, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 344, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "7 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "535 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 pound baby artichokes", "Juice of 1 lemon", "1 pound small new potatoes", "1 pound farfalle", "1/2 pound fresh cremini, porcini or white mushrooms, or morels", "3 tablespoons extra-virgin olive oil", "3 cloves garlic, chopped", "Salt and freshly ground black pepper", "1/2 cup chicken or mushroom stock", "1 tablespoon soy sauce", "1 tablespoon slivered fresh basil", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring six quarts of water to a boil. While it is coming to a boil, trim the artichokes. Slice off the top half-inch and slice the stem flush with the bottom. Pull off the two or three outermost layers of leaves, exposing tender, yellowish leaves. Quarter the artichokes vertically. As the artichokes are trimmed, toss them in a bowl with the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water is boiling, add the artichokes and potatoes and simmer about 20 minutes, until both are tender. Scoop them out of the water with a skimmer or a slotted spoon and add the farfalle to the water. Increase the heat and boil the farfalle about eight minutes, until it is just tender. Drain it when it is done, retaining about a cup of the cooking water. Toss the pasta with one-third cup of the water to keep it moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, quarter the potatoes. Slice the mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy skillet, add the mushrooms and garlic and saute over medium-high heat about 10 minutes, until the mushrooms have wilted. Add the artichokes and potatoes and stir over medium heat a few minutes, then season lightly with salt and pepper. Stir in the stock and soy sauce. Add the cooked farfalle and toss all the prepared ingredients together. Check seasonings, adding more salt and pepper if necessary. Add additional cooking liquid if the mixture is too dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer everything to a warm serving bowl, sprinkle the basil on top and serve with Parmesan cheese on the side."}]}