{"@context": "http://schema.org", "@type": "Recipe", "name": "Sage Hill Salmon", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "asparagus, cucumber, salmon fillet, dairy-free, gluten-free, vegetarian, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 576, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "8 grams", "proteinContent": "39 grams", "saturatedFatContent": "7 grams", "sodiumContent": "1370 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 cups peeled, sliced English cucumber", "2 tablespoons rice-wine vinegar", "1 teaspoon sesame seeds, skillet roasted", "Bragg Liquid Aminos (see note)", "2 tablespoons olive oil", "4 large portobello mushrooms, thinly sliced", "1 tablespoon minced garlic", "1/4 cup fresh lemon juice", "Sea salt", "1/4 teaspoon freshly ground black pepper", "20 stalks asparagus, trimmed to 6 inches long and cut crosswise in half", "1 medium bunch purple broccoli, tops only, separated into small florets", "2 sprigs rosemary or oregano, tied in cheesecloth", "4 fillets Alaskan King salmon about 1 inch thick and about 5 ounces each (remove skin if desired)", "2 tablespoons olive oil", "2 tablespoons lemon juice", "1 small clove garlic, crushed", "2 tablespoons chopped fresh rosemary, oregano or basil", "Sea salt", "3 tablespoons roasted pine nuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the cucumbers, vinegar and sesame seeds in a medium bowl and add a few sprays of Bragg Liquid Aminos. Mix well, adjust seasoning and set aside. Heat the olive oil in a large nonstick skillet over medium heat and sauté the mushrooms and garlic for 3 minutes. Add the lemon juice, 1/2 teaspoon salt and 1/4 teaspoon pepper and cook, stirring frequently, until the mushrooms are soft, about 4 minutes. Set aside. Place tip halves of the asparagus to the side and combine the remaining asparagus and the broccoli in a bowl. Place herbs in cheesecloth in 1/2 inch of water in a large pan and stir in 1/2 teaspoon salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Line a small baking tray with foil and place the salmon pieces on top. Mix the oil, lemon juice, garlic, chopped herb of choice and 1/4 teaspoon salt and spread over salmon pieces. Bake 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the water with the herbs in cheesecloth to boiling. Add the broccoli mixture, cover and cook 3 to 4 minutes, until the vegetables are almost crisp-tender. Add the asparagus tips, cover and cook 1 to 2 minutes, until crisp-tender. Remove the herbs, drain the vegetables and add to mushrooms. Season with salt and pepper and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange a quarter of the mushroom mixture in the center of each of 4 dinner plates, cover with the cucumber mixture and top with a piece of salmon. Sprinkle with pine nuts. Serve immediately."}]}