{"@context": "http://schema.org", "@type": "Recipe", "name": "Mole Coloradito", "description": "", "author": {"@type": "Person", "name": "Kent Black"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "6 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "chicken, chilies, tomato, dairy-free, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "recipeIngredient": ["6 pieces chicken: 3 half breasts, 3 thigh-legs", "1 small onion, halved", "9 cloves garlic, unpeeled", "10 dried ancho chilies (see note)", "1 dried pasilla chilies (see note)", "4 large plum tomatoes, stem end removed", "6 tablespoons vegetable oil", "2 slices stale country bread", "1/2 cup sesame seeds", "15 blanched almonds", "10 black peppercorns", "1 tablespoon dried Mexican oregano", "3 whole cloves", "1 2-inch stick cinnamon, preferably Mexican canela or Sri Lankan, in pieces", "1 tablespoon sugar", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, boil 12 cups salted water. Add chicken, onion and 3 garlic cloves. Reduce to simmer. Cook 25 minutes or until chicken is just cooked through. Remove chicken to a plate, and keep warm. Pour broth through a sieve into a bowl; reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stem and seed chilies. In a large skillet over medium-high heat, roast chilies 3 to 5 minutes until they smoke and blister. Transfer to a medium bowl, and cover with boiling water. Soak for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In same skillet, roast remaining garlic cloves and tomatoes over medium-high heat 12 to 15 minutes. Turn to blister all surfaces. Garlic should be soft and tomatoes evenly covered with brown/black spots. When garlic cools, remove skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In same skillet, heat 3 tablespoons oil over medium-high heat until it shimmers. Add bread, and fry until pale gold, about 2 minutes, turning once. Remove bread from skillet. Add sesame seeds, almonds, peppercorns, oregano and cloves. Cook, stirring frequently, about 4 minutes, until fragrant and seeds are lightly colored. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain chilies, discarding soaking liquid. Transfer to a blender with 1/2 cup reserved chicken broth. Puree, pushing down and scraping sides, as needed. In same skillet, heat remaining oil over medium-high heat. Add paste made from chilies and cook, stirring occasionally, 8 to 10 minutes, until paste darkens and oil is absorbed. Transfer to pot chicken was cooked in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In blender, puree fried bread, roasted garlic, tomatoes, seeds, almonds and spices with 2 cups broth. Scrape down sides as needed. Transfer to pot with chili paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cinnamon in blender with 1/4 cup broth. Puree. Press through sieve over chili paste mixture. Add 1 quart broth to pot, stirring to combine. Increase to high heat. Bring to a boil. Add sugar, salt and pepper. Reduce heat and cook 40 to 50 minutes, until thick enough to coat the back of a spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add reserved chicken. Simmer over medium-low heat for 10 minutes. Serve with rice and corn tortillas."}]}