{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable-and-Ricotta Tortino", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "gluten-free, nut-free, vegetarian, main course, ricotta, swiss chard, vegetables", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 359, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "8 grams", "proteinContent": "16 grams", "saturatedFatContent": "12 grams", "sodiumContent": "881 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups shelled fresh peas", "2 cups asparagus, halved and cut into 1-inch lengths", "4 tablespoons extra-virgin olive oil", "8 cups sliced spring onions, including white and green portions", "6 celery ribs, diced", "4 cups washed and stemmed watercress", "14 cups stemmed, rinsed and coarsely chopped white Swiss chard", "Kosher salt and freshly ground black pepper to taste", "4 large eggs", "1 cup cream", "1/2 cup finely grated Parmigiano- Reggiano", "3/4 cup ricotta, preferably sheep's milk ricotta", "1 teaspoon Aleppo pepper (see note )", "1/2 teaspoon kosher salt", "1/8 teaspoon freshly ground black pepper", "1/2 cup fresh mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to a boil and add the peas and asparagus. Cook until the vegetables are just tender. Drain and immediately plunge the vegetables into a large bowl of cold water to stop the cooking. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large kettle, heat 3 tablespoons of the olive oil over medium heat and add the onions, celery and watercress. Begin adding the Swiss chard, stirring until the leaves fit into the pot. Cook, stirring frequently, until the vegetables are very tender. Season with salt and pepper and drain if necessary. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the eggs, remaining tablespoon of olive oil, cream, 1/4 cup of the Parmigiano, ricotta, Aleppo pepper and 1/2 teaspoon kosher salt. Stir until smooth. Add the peas, asparagus and cooled vegetables and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Pour the tortino mixture into a large, lightly greased casserole dish, sprinkle with the black pepper and cover with foil. (Make sure it does not touch the vegetables.) Place the dish in a large roasting pan and pour in boiling water to rise halfway up the sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 40 minutes. Remove the foil and continue to bake until the center of the tortino is set, an additional 10 to 15 minutes. Remove the casserole from the roasting pan and sprinkle the remaining Parmigiano on the top. Place the casserole under a broiler until the cheese is nicely browned, 2 to 3 minutes. Allow to cool slightly, cut into squares and garnish with mint and serve."}]}