{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Duck", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT5H", "recipeYield": "3 servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "dairy-free, gluten-free, nut-free, duck, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "recipeIngredient": ["1 5-pound duck, rinsed and dried", "Kosher salt", "Freshly ground black pepper", "10 sprigs thyme", "10 cloves garlic, skin on", "3/4 pound (about 6) thin carrots, trimmed", "3/4 pound turnips, peeled and cut into wedges", "3/4 pound golden beets, peeled and cut into wedges", "4 shallots, skin on and halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 500 degrees. Season duck generously inside and out with salt and pepper. Put 1 or 2 pieces each of thyme, garlic, carrots, turnips, beets and shallots, in cavity. Truss duck; set in large casserole dish or medium roasting pan. Scatter rest of ingredients and neck around duck; season with salt and pepper. Cover loosely with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast duck for 10 minutes, lower temperature to 300 degrees and roast for 3 1/2 hours, basting vegetables and duck with pan juices and skimming off fat occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove foil. Take out vegetables and neck, and set aside; roast duck for 1 more hour (if vegetables are not tender, continue roasting until they are). Skin should be well browned and crisp; the meat, extremely tender. Transfer duck to cutting board. Skim fat off pan juices; add water to pan, if necessary, to make 1/2 cup. Bring juices to boil, adjust seasoning, and transfer to serving bowl. Reheat vegetables and neck in baking dish in oven. Carefully carve duck (meat may fall off bone), adding vegetables from cavity to those in pan. Serve with pan juices and vegetables."}]}