{"@context": "http://schema.org", "@type": "Recipe", "name": "Dried Cherry Focaccia (From Ecce Panis)", "description": "", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT5H30M", "recipeYield": "Two loaves", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, dried cherries, honey, raisins, nut-free, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 275, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "3 grams", "sodiumContent": "202 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 3/4 to 2 1/3 cups dried sour cherries, 9 to 12 ounces (see note)", "1 1/3 cups golden raisins, about 8 ounces", "1 1/4 cups water (from soaking fruit)", "1/4 cup mild honey", "1/2 cake fresh yeast, or 1 teaspoon dried yeast", "2 tablespoons finely grated orange zest, about 4 small oranges", "1 teaspoon salt", "3 1/4 to 3 1/2 cups all-purpose flour, plus flour to dust work surface", "2 tablespoons softened butter", "Parchment paper and cornmeal for baking sheet", "2 egg yolks", "1/4 cup heavy cream", "1/4 cup turbinado sugar", "Confectioners' sugar for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the cherries and raisins in a deep bowl, barely cover with water and soak for two to three hours, or until plumped. Drain well, reserving one and a quarter cups of the soaking water, and spread the fruit on paper towels to dry off a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine one cup of the reserved soaking water with the honey and place in the freezer until very cold; a few ice crystals are all right."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the remaining quarter-cup of soaking water in the medium-sized bowl of an electric mixer and add the yeast. When the yeast dissolves and foams, stir in the chilled soaking water, orange zest and salt. If using a heavy-duty mixer with a dough hook, add three-and-a-quarter cups of flour. If using a household mixer with two beaters, add three-and-a-half cups of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the dough on low speed until very elastic, smooth and shiny, forming a single mass around the beater. This will take 12 to 20 minutes depending on the mixer. The dough will eventually climb the beaters of household machines and must be pushed down repeatedly with a wooden spoon. When ready, it will be soft, wet and slightly sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the beaters and knead in the butter by hand, then knead in the drained fruits. Put the dough in a lightly buttered shallow bowl, cover tightly with plastic wrap and refrigerate until thoroughly chilled, at least eight hours but preferably overnight. Dough may be held for 36 hours before the next step."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large flat pan or two cookie sheets with parchment and sprinkle generously with cornmeal. Divide the dough into two rounds and roll each on a lightly floured board until three-eighths-of-an-inch thick. Place the rounds on the prepared baking sheet and allow them to rise, covered with plastic wrap, until they are puffy and hold an impression when dented with a fingertip, about an hour. Meanwhile, beat the egg yolks with the cream and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Use the fingertips to gently pockmark the surfaces of the rounds, then brush with the glaze and sprinkle with sugar. There may be glaze left over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 10 minutes, reduce the heat to 375 and bake 20 to 30 minutes more, or until richly browned. Invert on racks to cool, then turn glaze side up and dust with confectioners' sugar."}]}