{"@context": "http://schema.org", "@type": "Recipe", "name": "Praline Charlotte", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H", "recipeYield": "6 - 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, ladyfingers, pecan", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 572, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "17 grams", "sodiumContent": "101 milligrams", "sugarContent": "37 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 cups sugar", "1 1/4 cups pecan halves", "1 recipe warm creme anglaise (recipe follows)", "1 tablespoon gelatin", "1/8 teaspoon salt", "2 1/4 cups heavy cream", "16 to 21 soft ladyfingers, homemade or store-bought", "1/4 cup powdered sugar", "1 tablespoon light rum"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a heavy skillet over medium heat and add the sugar. Cook, stirring occasionally with a fork, until the sugar is melted and a deep golden color. Remove from the heat and stir in the pecan halves. Pour the mixture onto a buttered sheet pan and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cooled, chop the pralines finely. Set half aside and transfer the other half to the container of a food processor. Pulse until the mixture resembles coarse sand. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make or reheat the custard sauce (it should be warm) and transfer it to a large bowl. Dissolve the gelatin in 2 tablespoons water and stir it into the custard. Stir in the salt. Place the bowl in the refrigerator to cool, stirring occasionally, until it is thickened but not yet gelled, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the powdered praline into the cooled custard. Whip 1 1/4 cups of the cream until it holds soft peaks and fold it into the custard. Fold all but 1/4 cup of the reserved chopped praline pieces into the custard. Save the rest for a garnish. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take 4 to 6 ladyfingers and trim them into &quot;petals&quot; with one rounded edge and one narrow, pointed end. Arrange them, domed side down, in the bottom of an 8-cup charlotte mold, narrow ends pointing in and rounded ends pointed out. Trim the sides of another 12 to 15 ladyfingers and set them upright around the mold, domed sides out, packing them as closely together as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the custard mixture into the mold. Using a serrated knife, trim the tops of the ladyfingers level with the filling. Refrigerate for at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unmold the charlotte onto a serving platter. Combine the powdered sugar, remaining cup of cream and rum and whip until it holds firm peaks. Place some of the cream in a pastry bag fitted with a star tube and pipe lines of cream between the ladyfingers and rosettes around the edge of the plate. Sprinkle the charlotte with the reserved praline, slice and serve with the remaining sweetened whipped cream on the side."}]}