{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Oysters", "description": "", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, cornmeal, oyster, vegetable oil", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["1 dozen bluepoint or similar oysters, shucked (unless you've shucked oysters before and have a good oyster knife, ask your fish market to shuck them for you; do not use bottled oysters, which may taste tinny)", "1 cup yellow cornmeal, preferably Indian Head or Quaker", "Salt, freshly ground white pepper and cayenne to taste", "4 cups vegetable oil (do not use olive oil)", "1 cup Hellmann's mayonnaise", "1/2 bunch of chives, snipped into 1/8-inch pieces", "1 tablespoon lemon juice", "Romaine, cut into 1-inch ''canoes,'' well chilled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the oysters. Spread the cornmeal evenly on a paper towel. Add the salt, pepper and cayenne to taste. Dredge the oysters one at a time, placing each dredged oyster in a colander. Shake off the excess cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a cast-iron skillet or other deep skillet over medium-high heat until it reaches 350 degrees. You can also check by sprinkling some of the cornmeal in the pan and seeing if it spins and dances in the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, mix the mayonnaise, chives and lemon juice until smooth in a small bowl. Arrange the lettuce ''canoes'' on a large serving platter and top each with a dollop of chive mayonnaise. Set aside in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the oil by gently dropping (or lower in with a slotted spoon) an oyster into it. If it bubbles and rises to the top, add 3 or 4 more oysters. If not, remove the oyster, wait and try again. If you add too many oysters at once, you will lower the temperature of the oil, and the oysters will neither brown nor become crisp. Remove the light brown oysters with a slotted spoon or tongs to paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange a fried oyster on top of mayonnaise on the Romaine canoes. Serve immediately."}]}