{"@context": "http://schema.org", "@type": "Recipe", "name": "Butter-Poached Lobster With Leeks, Pommes Maxim And Red-Beet Essence", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "leek, lobster, red beets, main course", "aggregateRating": null, "recipeIngredient": ["1 pound unsalted butter at room temperature, in pieces", "Salt and pepper", "1 1/2 cups thinly sliced leek rounds", "1/4 medium-size ripe tomato, peeled, flesh cut in small diamond shapes", "2 teaspoons minced chives", "1 teaspoon each finely diced carrot, turnip and dark green of leeks", "", "", "Red-beet essence (<a href=\"http://cooking.nytimes.com/recipes/10917-red-beet-essence\">see recipe</a>)", "Par-cooked meat from 3 lobsters at room temperature (<a href=\"http://cooking.nytimes.com/recipes/10915-par-cooked-lobsters\">see recipe</a>)", "Pommes Maxim (<a href=\"http://cooking.nytimes.com/recipes/10916-pommes-maxim\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 tablespoons water in a saucepan. Bring to a boil. Reduce heat to very low, and whisk in butter piece by piece. Continue adding until all butter is emulsified. Set aside, and keep warm (the best way is in a thermos); do not allow to boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a 3-quart pot of water seasoned with 1 tablespoon salt to a boil. Have a large bowl of ice water ready. Add leeks to boiling water, cook 5 minutes until just tender, drain in a sieve and place sieve with leeks in ice water until leeks are cool. Drain, and transfer to a small sauté pan. Place over low heat to reheat. Add tomato, chives, diced carrot, turnip and leek greens. Stir in 1/3 cup emulsified butter. Season with salt and pepper, and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beet essence in a small saucepan. Whisk in 3 tablespoons emulsified butter, and cover to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. Place lobster pieces in single layer in a large saucepan or sauté pan. Add remaining emulsified butter. Lobster meat should be just about covered. Place pan over low heat, and cook 5 to 6 minutes, until meat is just heated through. Remove knuckle pieces, drain and fold into leek mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While lobster cooks, place potatoes in oven 2 to 3 minutes to reheat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a spoonful of warm beet essence in center of each of 6 plates. Briefly reheat leek mixture, and spoon onto beet essence. Remove lobster tails and claws from butter mixture, draining well; place a tail piece and a claw on each plate, on top of leeks. Break potatoes in six pieces and place on top of the lobster. Serve."}]}