{"@context": "http://schema.org", "@type": "Recipe", "name": "Blueberry Pie", "description": "", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, arrowroot, blueberries, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 765, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "147 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "11 grams", "sodiumContent": "44 milligrams", "sugarContent": "92 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 cups all-purpose flour", "6 ounces unsalted butter, diced", "1 tablespoon sugar", "Pinch salt", "3/4 cup water", "1 egg mixed with 1 tablespoon water", "2 quarts plus a little more firm, fresh blueberries", "3 cups sugar", "1/4 cup arrowroot", "1 lemon, seeded and coarsely chopped in the food processor", "Vanilla ice cream for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees and place a sheet pan lined with aluminum foil beneath the rack where the pie will bake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, place the flour, butter, sugar and salt in a food processor and pulse briefly until the butter has been cut in coarsely. Add half the water and pulse, watching to see if the dough forms a ball. If not, add a little more water until it does. Too much water will make a heavy, gummy pastry. Too little will make a crumbly one. If the dough feels too wet, add a little more flour and pulse. If too dry, add a little more water. Pulse sparingly. On a floured board, cut the dough into two parts, one slightly larger. Roll out the smaller portion and place it neatly in a 9-inch deep-dish pie pan. Refrigerate the larger portion while you prepare the berries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, pick over the berries, discarding green or bad ones, and remove any stems. Rinse the berries and drain. In a large bowl, mix the sugar and arrowroot. Add the berries and lemon and mix well. Mound the filling in the pastry shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the remaining pastry into a large round. Brush the rim of the bottom shell with some of the egg mixture and carefully lay the large pastry round over the berries. Trim the edges, leaving a 3/4-inch overhang. Press the top and bottom pastry halves together to seal well. Fold excess top pastry under and crimp the edges. Cut 4 triangular holes near the top. (Do not cut along the sides or all the juices will leak out.) Brush with more of the egg mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 15 minutes. Reduce the oven temperature to 375 degrees and bake 40 to 50 minutes longer, or until the top has browned and the juice has begun to spill out. Cool for about 1 hour so juices can settle. Serve with vanilla ice cream."}]}