{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Salad With Skordalia", "description": "My approach to chicken salad was changed when I traveled to the Middle East and had a chicken salad bound with a distinctive \"mayonnaise\" that turned out to be a version of skordalia, the Greek dip. Like mayonnaise, skordalia will bind any cold minced meat or fish (and make a good sauce served with hot ones), but, unlike mayonnaise, it contains no egg. The binding \"glue\" is bread soaked in milk.\n\nThere are other differences between common mayonnaise and skordalia. The Greek dip is more intensely flavorful -- atop the garlic I like it with a sound dose of strong paprika or mild chili powder and a handful of cilantro leaves -- and it cannot be bought in a jar. Fortunately, assembling a batch takes about five minutes in a food processor. With it, leftover chicken is almost essential, though of course you can cook some especially for the salad.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2011/07/04/fashion/video-chickensalad/video-chickensalad-mediumThreeByTwo440.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "salads and dressings", "keywords": "chicken, rustic italian bread, walnut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 11}, "recipeIngredient": ["2 ounces French or Italian bread", "1 cup milk or stock", "4 ounces peeled walnuts, about 1 cup", "1 small clove garlic, peeled", "Salt and pepper to taste", "1/4 cup extra virgin olive oil", "Chili powder or paprika to taste", "2 to 3 cups shredded cooked chicken", "1 cup chopped cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak bread in milk or stock. Put walnuts, garlic and salt in processor. Pulse to grind coarsely. Squeeze most of the liquid from bread; reserve liquid. Add bread to container, along with oil. Process until combined. Add reserved milk or stock until mixture has the consistency of mayonnaise. Add pepper, along with chili powder or paprika. Bind chicken with sauce. Stir in 2/3 cup cilantro. Garnish with rest."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chicken Salad With Skordalia", "description": "Mark Bittman pairs a flavorful Greek dip with cold cooked chicken, one of his favorite recipes from the Minimalist archives.", "thumbnailUrl": "https://static01.nyt.com/images/2011/07/04/fashion/video-chickensalad/video-chickensalad-mediumThreeByTwo440.jpg", "uploadDate": "2011-07-15T20:35:48.000Z", "duration": "PT3M19S"}}