{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Meat Kreplach", "description": "", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/BeefKreplach/BeefKreplach-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "About 2 dozen", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "appetizer, beef, kosher", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 100, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "74 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons vegetable oil", "1/2 cup minced onion", "1 small clove garlic, minced", "1/2 pound ground beef chuck", "Salt and freshly ground black pepper", "1 3/4 cups all-purpose flour", "2 extra-large eggs", "Salt", "Vegetable oil, for frying", "Applesauce, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For filling: In a small skillet, heat oil over medium heat. Add onion, and saut&#233; until well browned, 6 to 8 minutes. Toward end of cooking add garlic, and stir well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add beef, breaking it up well with side of wooden spoon. Saut&#233; until it has lost its raw color. Season with salt and freshly ground pepper, and saut&#233; another 2 minutes. Remove from heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For dough: Mound flour on a wooden board (or in a large mixing bowl). Make a well in center. Break eggs into well, then add 2 tablespoons lukewarm water. With a fork, beat eggs and water together, incorporating a bit of the flour. As liquids blend, continue to push flour into well. Drizzle in 2 more tablespoons water, one at a time, or as needed to make a cohesive dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When dough is well blended, mix it by hand, then begin to knead it on a flat surface. With a bench scraper, turn dough and press it with your fingertips, then knead a few strokes again. The dough should remain slightly sticky but become smooth and elastic; if dough is very sticky, lightly sprinkle work surface with flour. Form dough into a ball and let rest on the board, covered with a bowl or a piece of plastic wrap, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using half the dough at a time, and keeping other half covered, roll out very thin on floured board. You may need to stretch as you roll. Alternately, use a crank-handled pasta machine on thinnest or near thinnest setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fill and shape kreplach, cut rolled dough into 3-inch squares. Put 1 rounded teaspoon of filling in center of each square. With a brush or a finger, moisten edges of squares with water. Fold dough from corner to corner, forming a triangle, and seal carefully."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook kreplach, bring a large pot of well-salted water to a boil over high heat. Working in batches, if necessary, add kreplach -- do not crowd pot -- and boil until dough is cooked and tender to taste, 6 to 8 minutes. Drain and cool. (Kreplach can be frozen at this point. To use, thaw in refrigerator or at room temperature.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large skillet over medium-high heat and add about 1/8-inch vegetable oil. When oil is shimmering, add boiled kreplach and fry until well browned and crispy on both sides. Serve hot, accompanied by applesauce, if desired."}]}