{"@context": "http://schema.org", "@type": "Recipe", "name": "Lettuce Soup With Cucumber Croutons", "description": "Soup is the most versatile of dishes. When it is rough-chunked, thick and hearty, it is a homey supper; when it is smooth and delicate like the lettuce soup here, it is the perfect elegant starter. It also happens to be a wonderful way of using up any stray lettuces in your fridge. You do not want to use anything that is unpalatable, but I often start the week planning to eat a lot of salad and then end it having not lived up to my intentions. This recipe is the perfect way of atoning for that.\n\nThis time of year I especially prefer this soup chilled, which makes life much easier because you can cook it in advance. If cold soup is not your thing, do not panic; it is just as good served at room temperature. Either way, this soup is taken up a few notches by being studded, by some cucumber croutons: small, jade cubes cut like toasted-bread dice, only so much more elegant.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2014/06/02/dining/Lettuce-Soup-With-Cucumber-Croutons/Lettuce-Soup-With-Cucumber-Croutons-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "About 2 quarts", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "appetizer, cucumber, lettuce, gluten-free, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 49, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "228 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons butter", "6 scallions, white part only, finely sliced", "8 new potatoes, peeled and diced", "7 cups chicken or vegetable stock", "1 pound Boston lettuce, roughly chopped", "1/3 to 1/2 cup sour cream", "Salt", "2 tablespoons finely sliced chives", "1 cucumber, peeled, seeded and diced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt butter in a large saucepan, and add scallions. Sauté until softened. Add potatoes to pan, stir well, then add stock. Bring to a boil, then reduce to low, and simmer until potatoes are tender, 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lettuce to the pan, and stir until it is wilted. Remove from heat, and allow it to cool until no longer steaming. Using a blender and, working in batches, purée soup until it is smooth. Transfer to a serving bowl, and add 1/3 cup sour cream and salt to taste. Stir until smooth, and adjust sour cream and salt as needed. If soup is to be served chilled (it may be served at room temperature), cover bowl with plastic wrap and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, ladle into bowls, and sprinkle with chives and cucumber ''croutons.''"}]}