{"@context": "http://schema.org", "@type": "Recipe", "name": "Gerard Drive Clambake", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT1H", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, clams, lobster, gluten-free, main course, summer", "aggregateRating": null, "recipeIngredient": ["2 2 3/4- to 3-pound chickens, quartered", "2 tablespoons vegetable oil", "2 teaspoons paprika", "1/8 teaspoon red-pepper flakes", "Salt and freshly ground pepper to taste", "24 cherrystone or soft-shell clams", "6 small white onions, about 1/2 pound", "20 pounds wet seaweed, with as much of the sand as possible removed", "12 small red potatoes", "6 live lobsters, 1 1/4 pounds each", "6 ears fresh corn, unshucked", "1 1/2 pounds kielbasa, chorizo or chourica sausage, cut into 6 pieces", "2 cups dry white wine", "1 quart mussels, well scrubbed, with beards removed", "1/2 cup melted butter", "3 lemons, cut in wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken pieces in a large dish and coat with the oil. Sprinkle with the paprika, pepper flakes, salt and pepper. Rub in well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Broil the chicken pieces on both sides until the skin is golden brown, but the meat is not cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 10 12-by-12-inch pieces of cheesecloth. Place two pieces of chicken on four separate pieces of cheesecloth and tie the ends, making individual packages; divide the clams, place on four separate pieces of cheesecloth and tie into packages; divide the onions, place on two pieces of cheesecloth and tie into packages. Separate the seaweed into six equal amounts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one portion of the seaweed in the bottom of each of two 18-quart enameled pots. Divide and layer the chicken, clams and potatoes in each pot. Reserve two potatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place another portion of seaweed in each pot and divide the lobsters (with rubber bands carefully removed), corn and onions between the pots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with the remaining seaweed and put a reserved potato in the center of each pot. Add the sausage pieces. Pour two cups of water and one cup of the white wine into each pot and cover tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring to a boil over high heat, then lower the heat to medium-high, being careful to keep the pots boiling. Cook for 25 minutes. Divide the mussels, add them to each pot and cook for another five minutes. The clambake is ready when the potatoes on top are tender but not mushy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange all the foods on a large platter and serve with melted butter and lemon wedges."}]}