{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Chops With Morels", "description": "", "author": {"@type": "Person", "name": "Trish Hall"}, "image": null, "totalTime": "PT1H", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, mushroom, veal", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 675, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "57 grams", "fiberContent": "1 gram", "proteinContent": "30 grams", "saturatedFatContent": "27 grams", "sodiumContent": "914 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 ounce dried morels, about 1 cup, or 3 ounces fresh mushrooms", "8 tablespoons unsalted butter", "2 tablespoons finely chopped shallots", "1 tablespoon freshly squeezed lemon juice", "7 tablespoons dry white wine", "1 1/4 cups heavy cream", "Salt and freshly ground pepper to taste", "1 tablespoon dry Madeira or dry Sherry", "6 loin veal chops, about 1/2 pound each", "1/4 cup flour", "4 tablespoons corn, peanut or vegetable oil", "1 1/4 cups fresh or canned chicken broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If dried morels are used, place them in a mixing bowl and add hot but not boiling water to cover. Let stand until the water is cool. Drain the morels and pat dry. If fresh mushrooms are used, slice them and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat four tablespoons of the butter in a skillet over medium heat and add the shallots. Cook briefly, about half a minute, stirring, and add the mushrooms. Cook, shaking the skillet and stirring, about three minutes. Add the lemon juice, and cover and cook five minutes over low heat. Add two tablespoons of the white wine, and cover and cook over very low heat for five minutes. Add the cream, cover and cook over slightly higher heat about 10 minutes, stirring occasionally. At this point, the cream should be reduced and thickened. Add salt and pepper to taste and the Madeira or Sherry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dredge the chops in the flour and shake off any excess. Heat the remaining butter and the oil in a heavy skillet large enough to hold the chops in one layer. Cook over relatively high heat about five minutes, or until nicely browned on one side. Turn and cook the chops about five to 10 minutes on the second side until they are just cooked through. Do not overcook or the chops will become dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chops to a serving platter and keep them warm. Pour off most of the fat from the skillet. Add the remaining wine and cook briefly. Add the broth and cook over relatively high heat until reduced to about one-third cup. Add the mushrooms in cream sauce and blend. Pour over the chops and serve."}]}