{"@context": "http://schema.org", "@type": "Recipe", "name": "Greyston's Potato Onion Bread", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H", "recipeYield": "2 loaves", "recipeCuisine": "", "recipeCategory": "", "keywords": "onion, potato, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 318, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "62 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "4 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "345 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 package dry yeast", "1 cup warm water", "1 tablespoons honey", "2 1/2 tablespoons dry milk powder", "2 teaspoons salt", "1 tablespoons vegetable oil", "1/2 pound potatoes, cooked until very tender, mashed and allowed to cool", "3 ounces onion, minced", "4 to 4 1/2 cups unbleached flour", "1 egg beaten with 2 tablespoons water, for egg wash"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dissolve the yeast in the warm water and then add the honey, milk powder, salt, oil, potatoes and onion, stirring well. Gradually stir in 1 1/2 cups of flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 more cups of the flour, 1/2 cup at a time, until the dough is stiff. Turn onto a lightly floured board and knead in enough flour until the dough is no longer sticky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Continue kneading for about 15 minutes and then place the dough in a lightly oiled bowl. Cover the bowl loosely with plastic wrap and set in a warm place to rise until dough is doubled in volume, about 1 1/2 hours. Remove dough from bowl, punch it down and shape into a ball. Return to bowl, cover with plastic wrap and let rise for 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Punch down the dough again and turn onto a lightly floured board . Divide the dough in half and knead one piece, adding about 1/4 cup or more of flour to make the dough stiff enough to hold a round shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form a ball and then fold the dough inward while rotating it against the board to form a mushroom cap. Repeat this rotation 10 times. Lay the ball of dough on its side and roll and press the dough against the board about 10 times, continuing to keep the round shape. Repeat with the other ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place both balls on a buttered baking sheet and let them rise in a warm place, lightly covered with plastic wrap, for about 25 minutes. Brush the loaves with egg wash and make 2 quarter-inch-deep slashes to form a cross in each."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 35 to 40 minutes, until the loaves are golden and produce a hollow sound when tapped on the bottom. Cool at least 1 hour before slicing."}]}