{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Duck Salad Sandwich With Grapes and Jicama", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT15M", "recipeYield": "2 large or 4 small sandwiches", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "dairy-free, duck, grape, jicama, main course", "aggregateRating": null, "recipeIngredient": ["1 cup skinned, smoked duck breast, cut into half-inch pieces (see note)", "1 tablespoon diced red bell pepper", "1 tablespoon diced yellow bell pepper", "1 tablespoon diced carrot", "2 tablespoons julienne strips of jicama", "1 tablespoon diced chayote", "2 tablespoons red seedless grapes, cut into small slivers", "3 tablespoons blanched Sugar Snap or English peas", "4 tablespoons roasted pine nuts", "1 egg yolk", "1/4 teaspoon salt", "Juice of half a lemon", "1 small shallot, diced", "2 tablespoons chopped fresh green coriander", "1 teaspoon chopped chives", "1 teaspoon chopped parsley", "1/2 cup olive oil", "1/2 cup vegetable oil", "Additional salt and freshly ground black pepper to taste", "4 (or 8) slices of whole-grain bread, such as honey-wheat or wheat-berry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In large mixing bowl, combine duck breast pieces with remaining salad ingredients. Set aside while making coriander mayonnaise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mayonnaise, place first seven ingredients in a small mixing bowl and whisk to blend. Combine olive oil and vegetable oil, and slowly, drop by drop, pour into bowl, whisking continuously. As the mayonnaise thickens, you may increase the volume of oil, so that by the end it is coming in a thin but constant stream. When all the oil has been incorporated, continue whisking for 15 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Or make the mayonnaise in a blender or food processor. Blend egg yolk, salt and lemon juice, and incorporate the oils as above, starting with drops and building up to a thin but steady stream. When all the oil is incorporated and the mayonnaise is thick, remove from blender or processor and stir in chopped seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir half a cup of mayonnaise into duck mixture and taste for seasonings, adding salt and pepper if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast bread slices, if desired, before making sandwiches."}]}