{"@context": "http://schema.org", "@type": "Recipe", "name": "Quail in an Omelet Beggar's Purse", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "eggs, quail, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 593, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "2 grams", "proteinContent": "39 grams", "saturatedFatContent": "12 grams", "sodiumContent": "806 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 quails, boned (approximately 3 ounces each)", "Salt and pepper as desired", "6 ounces of goose-liver mousse (see note)", "1 tablespoon salad oil", "4 slices bacon", "1 medium carrot, scraped and diced (1/2 cup)", "2 medium stalks celery, diced (3/4 cup)", "1 small onion, diced (1/4 cup)", "1 bay leaf", "1 sprig fresh thyme, or 1 teaspoon dried thyme", "1/2 cup Port wine", "3/4 cup veal demi-glace (see note)", "1 tablespoon unsalted butter, room temperature", "2 large leek leaves (scallion leaves or chives may be substituted)", "4 eggs", "Salt and pepper to taste", "1 teaspoon water", "Scant amount of oil - approximately", "1/4 teaspoon per omelet"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "The quail:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice each quail open through the back, leaving breast whole. Place skin-side-down on a flat surface, extending quail bodies as much as possible. Season lightly with salt and pepper. Place a quarter of the liver mousse in center of each quail, wrap outer edges of quail over mousse, overlapping where necessary, so that mousse is totally enclosed. Wrap a slice of bacon around each quail to hold it together. Secure each bird with string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an ovenproof saute pan, large enough to hold all 4 birds, over medium heat and add oil. Place quail in pan, breast-side-up, and saute 5 minutes, until brown. Add diced vegetables, bay leaf and thyme. Turn quail to brown other side, 5 to 7 minutes. Then turn breast-side-up again, and place pan in oven until quail are just hot inside, approximately 7 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove quails from saute pan and set aside in a warm place. Place saute pan over medium heat, and continue to cook diced vegetables and herbs until tender, approximately 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon, remove fat from saute pan. To deglaze the pan, over medium heat, add Port, and cook rapidly, scraping up brown bits, until liquid is reduced by half, approximately 3/4 cup. Add demi-glace. Bring sauce to a boil, reduce heat, and simmer approximately 5 minutes. Strain through a sieve into a small saucepan. Taste and correct seasonings, if necessary. Set aside to keep warm. Just before serving, add butter to sauce and incorporate by shaking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch leek leaves in boiling water until soft but not mushy, about 3 minutes. Immediately refresh in ice water. Cut 4 half-inch strips lengthwise down each leaf. Set aside."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Make omelets:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat eggs, salt and pepper. Add water. Heat a 10-inch, nonstick frying pan, and brush lightly with oil. Pour a quarter of the egg batter into pan, shaking pan back and forth to coat thinly but evenly, as for a crepe. Cook over high heat, just 1 to 1 1/2 minutes, until lightly brown. Do not turn. Remove omelet from pan and set aside. Then make three more omelets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove string and bacon strips from quail. Place an omelet, browned side down, on a flat surface. Place a quail in the center of each omelet. Gather edges of omelet together, enclosing quail, and tie omelet one inch from top with leek ''string.'' Place pouches in oven briefly to warm. Spoon sauce onto 4 dinner plates and place quail pouch in center of each."}]}]}