{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaetzle With Corn, Peas, Braised Rabbit and Tarragon", "description": "", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/spaetzlerabbit/spaetzlerabbit-articleLarge-v5.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "main course, rabbit", "aggregateRating": null, "recipeIngredient": ["2 large rabbit legs", "Salt and freshly ground black pepper", "2 tablespoons vegetable oil", "1 carrot, cut into 1/2-inch dice", "1 onion, cut into 1/2-inch dice", "1 medium celery root, peeled and cut into 1/2-inch dice", "1 750-milliliter bottle dry riesling, grüner veltliner or other dry white wine", "1 sprig thyme", "1 large garlic clove, chopped", "2 tablespoons butter", "Dash of lemon juice", "1/2 teaspoon chopped fresh tarragon leaves", "1/2 teaspoon sliced chives", "2 cups milk", "Salt", "1 ear white corn", "1 to 1 1/2 cups fresh shelled English peas (or substitute defrosted frozen peas)", "Salt", "2 cups all-purpose flour", "Freshly ground black pepper", "Freshly ground nutmeg", "2 large eggs", "1/2 cup heavy cream plus 5 teaspoons", "1/2 cup quark or fromage blanc or cottage cheese", "Extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For rabbit: preheat oven to 375 degrees. Season rabbit with salt and pepper to taste. Place a large braising pan or casserole over medium-high heat and add vegetable oil. When oil shimmers, add rabbit and brown lightly on all sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer rabbit to a platter. Add carrot, onion and celery root to pan. Saut&eacute; until softened and lightly browned, about 10 minutes. Return rabbit to pan on top of vegetables, and add wine, thyme and garlic. Cover and braise in oven for 45 minutes. Meanwhile, prepare corn, peas and spaetzle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For corn and peas: in a large saucepan bring milk to a simmer and season lightly with salt. Add corn and simmer for 2 minutes. Drain, cut corn from cob and reserve. Fill a small saucepan with lightly salted water and bring to a simmer. Add peas and simmer just until they turn bright green. Drain, cool in ice water, drain again; reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For spaetzle: place a large pot of lightly salted water over high heat to bring to a boil. Place flour in a large bowl and season to taste with salt, pepper and a pinch of nutmeg. Add eggs, 1/2 cup cream and quark; mix well. When water boils, press dough through a spaetzle maker directly into water. As noodles float to top, remove with a slotted spoon and transfer to a bowl. Mix with a bit of olive oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To finish: when rabbit is cooked, reserve 3 tablespoons stock. Remove rabbit meat from bones and cut into small cubes. Place a large saut&eacute;pan over medium heat, and add butter, corn, peas, rabbit and spaetzle. Saut&egrave; until thoroughly heated. Add reserved rabbit stock, 5 teaspoons heavy cream and a dash of lemon juice. Bring to a boil, add tarragon and chives, and season with salt and pepper to taste."}]}