{"@context": "http://schema.org", "@type": "Recipe", "name": "Praline Baskets", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT40M", "recipeYield": "Fourteen to 16 baskets", "recipeCuisine": "", "recipeCategory": "", "keywords": "almond, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "8 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound blanched almonds, about 2 1/2 cups", "1 1/3 cups sugar", "1/2 pound, plus 2 tablespoons, butter", "7 tablespoons cold milk", "5 1/2 tablespoons flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the almonds into the container of a food processor and blend until coarse-fine. The ideal consistency would be like that of whole peppercorns. There should be about three cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the ground nuts in a saucepan, preferably with a round bottom, and add the sugar and butter. Cook over low heat, stirring constantly, until the butter is melted and the ingredients are evenly blended. Take care that the mixture does not burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat and stir in the milk. Stir in the flour. Let stand until cool. Chill thoroughly. When chilled, the mixture should be easy to shape into round balls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the mixture into 14 or 16 portions, one portion at a time. Shape each portion into a round ball. It is important that you work with only two or three portions at a time. As the balls are shaped, arrange them, spaced neatly and well apart, on rectangles of parchment paper. Cover with a second sheet of parchment paper and roll each portion into circles measuring about five inches. Remove the upper sheet of parchment. (If parchment paper is not available, arrange the balls, two or three at a time, on a buttered baking sheet and flatten them into five-inch circles with the fingers.) Place in the oven on the center shelf and bake eight to 10 minutes or until golden or caramel brown. Do not burn."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point, you must act quickly but cautiously. Remove the rounds from the oven and let stand briefly. The important thing is to allow the rounds to cool for a few seconds or to the precise moment when a metal spatula can be slid beneath each one. If they are allowed to stand too long, they will become brittle and cannot be shaped or molded. Quickly transfer one round at a time into a round-bottom glass or metal container with a capacity of approximately one and one-half cups. Press down to mold the round into a ''basket.'' Quickly proceed to the second and third round, pressing them into shape. The rounds must remain warm as you shape them. If they break slightly, they may be repaired with the fingers, provided they are still warm enough to be malleable. The baskets will become firm as they cool. As they become firm, remove them and set them aside to be filled as a dessert. They may be filled with a chilled pudding or custard mixture, with scoops of ice cream, with fresh fruit or berries and so on. If desired, the inside of each basket may be brushed with melted chocolate before filling."}]}