{"@context": "http://schema.org", "@type": "Recipe", "name": "BBQ Porkette With Fried Potatoes and Scallion Hash", "description": "Porkette is shoulder meat injected with brine, inserted into netting and \"smoked\" with burned-hickory mist. It is an industrial food product (and so's your hanger steak, pal), but it's a more than decent one. And at $4.99 a pound, dinner for four costs less than $20. But it also makes an excellent breakfast. At the Hope & Anchor restaurant in Red Hook, Brooklyn, Dianna Munz served a barbecued ham and scallion hash with two fried eggs, but sometimes hash is better consumed at home. Made with Porkette, Munz's dish takes on a slightly gruffer flavor that is matched perfectly by the sweet of the barbecue sauce and the thick run of an easy-cooked egg yolk. Members of the smart set will cut their potatoes thin the night before. This makes the final preparation of the dish on a weekend morning a snap. Just add hot coffee.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/05/29/dining/Bbq-Porkette/Bbq-Porkette-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves 2 as a main course", "recipeCuisine": "", "recipeCategory": "", "keywords": "main course, porkette, potato", "aggregateRating": null, "recipeIngredient": ["1 tablespoon butter", "1/2 cup finely chopped onion", "1 teaspoon finely chopped garlic", "1/2 cup ketchup", "3 tablespoons brown sugar", "3 tablespoons cider vinegar", "1 tablespoon spicy brown mustard", "1 tablespoon Worcestershire sauce", "Salt and freshly ground pepper", "About 2 quarts peanut oil", "4 medium Idaho potatoes", "Salt", "1 tablespoon olive oil", "1 tablespoon butter", "1/2 cup diced Porkette", "1/2 cup chopped scallion", "2 tablespoons chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: in a saucepan, melt the butter over low heat; add the onions and garlic and cook until the onions are soft but not brown. Add the remaining ingredients and simmer until slightly thickened, about 20 minutes. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the potatoes: fill a deep pot with 2 inches of oil. Heat the oil to 320 degrees. Meanwhile, peel and julienne the potatoes and drop them into a bowl of water. Run water into the bowl until it runs clear. Dry well. Fry in batches so the potatoes are blanched but not browned, about 1 1/2 minutes. Drain. Increase the oil temperature to 375 degrees and fry a second time in batches until golden brown. Toss them in a paper-towel-lined bowl and season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the hash: heat the oil and the butter in a large pan over medium-high heat. Add the Porkette and the scallions and cook until the Porkette starts to brown. Add 2 cups of fried potatoes and cilantro, then 1/4 cup sauce and stir until the potatoes are just coated. Taste and add a tablespoon more if you like; reserve remaining sauce for another use. Serve with fried eggs."}]}