{"@context": "http://schema.org", "@type": "Recipe", "name": "Gotham Bar and Grill's Hot Fudge Sundae", "description": "This hot fudge sundae is nothing close to what you grew up with. That’s a good thing. Here, you’ll mix up a dreamy concoction of cream, bananas, rum and frozen Heath bars, run it through an ice cream maker, and then douse it in a rich chocolate-butter sauce. You can’t lose.", "author": {"@type": "Person", "name": "Rena Coyle"}, "image": null, "totalTime": "PT40M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "banana, chocolate, heath bars, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 275, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "29 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups milk", "3/4 cup sugar", "1/2 vanilla bean, split lengthwise", "6 egg yolks", "1/4 cup heavy cream", "3 medium ripe bananas", "1 tablespoon fresh lemon juice", "2 tablespoons dark rum", "3 Heath bars, frozen, then broken into pieces", "4 1/2 ounces unsweetened chocolate", "1 1/2 tablespoons butter", "2/3 cup water", "2/3 cup sugar", "1 tablespoon light corn syrup", "1/8 cup milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the ice cream, combine the milk, a quarter cup of sugar and the vanilla bean in a saucepan. Over medium-high heat, bring the milk to a boil and let the sugar dissolve. Remove from the heat and let it sit for five minutes to infuse flavors. Then remove the vanilla bean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, whisk together the egg yolks with the remaining sugar. Pour the milk mixture into the egg yolk mixture and blend. Pour this mixture into the saucepan and return the pan to the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heating over medium high, stir the mixture continuously for about three minutes, until it coats the back of a spoon. At this point, remove the pan from the heat immediately, add the heavy cream and blend. Strain the custard into a bowl and place it over an ice bath to cool, again stirring continuously. Once cool, strain it into a bowl and place in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the bananas with the lemon juice. Add the puree and rum to the custard. Strain the mixture again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the custard mixture into an ice cream maker and process according to the manufacturer's instructions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the frozen ice cream from the machine and stir in the Heath bars until they are scattered throughout the ice cream. Place in the freezer until you are ready to assemble the sundaes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the fudge sauce, melt the chocolate and butter in the top part of a double boiler over medium heat. In the meantime, combine the water, sugar and corn syrup in a saucepan and cook until it reaches the soft-ball stage (234 degrees)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the chocolate-butter mixture together with the sugar syrup until blended. Then blend in the milk. Keep the hot fudge in a warm water bath until you are ready to assemble the sundaes. Leftover sauce can be covered and refrigerated for several weeks. When ready to use, reheat in the top half of a double boiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Layer slices of ripe bananas, hot fudge sauce and ice cream in large Pilsener glasses."}]}