{"@context": "http://schema.org", "@type": "Recipe", "name": "General Tso’s Chicken", "description": "General Tso’s chicken is named for Tso Tsung-t’ang, a 19th-century general who is said to have enjoyed eating it. The Hunanese have a strong military tradition, and Tso is one of their best-known historical figures. But although many Chinese dishes are named after famous personages, there is no record of any dish named after Tso. The real roots of the recipe lie in the aftermath of the Chinese civil war, when the leadership of the defeated Nationalist Party fled to the island of Taiwan. They took with them many talented people, including a number of notable chefs, and foremost among them was Peng Chang-kuei. He created this dish in 1950s Taiwan, and brought it with him when he moved to the states in 1973, making it sweeter for American palates. This version is adapted from the original, hot and sour and lacking the sweetness of its Americanized counterpart.", "author": {"@type": "Person", "name": "Fuchsia Dunlop"}, "image": "https://static01.nyt.com/images/2017/01/24/dining/24COOKING-GENERALTSO-CHICKEN1/24COOKING-GENERALTSO-CHICKEN1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "2 to 3 servings", "recipeCuisine": "asian, chinese", "recipeCategory": "dinner, one pot", "keywords": "chicken, red chili, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 741}, "recipeIngredient": ["1 tablespoon double-concentrate tomato paste, mixed with 1 tablespoon water", "1 tablespoon of water", "1/2 teaspoon potato flour or cornstarch", "1/2 teaspoon dark soy sauce", "1 1/2 teaspoons light soy sauce", "1 tablespoon rice vinegar", "3 tablespoons chicken stock or water", "12 ounces (about 4 to 5) skinless, boneless chicken thighs", "1/2 teaspoon dark soy sauce", "2 teaspoons light soy sauce", "1 egg yolk", "2 tablespoons potato flour", "1 quart peanut oil, more as needed", "6 to 10 dried red chilies", "2 teaspoons finely chopped ginger", "2 teaspoons minced garlic", "2 teaspoons sesame oil", "Scallions, thinly sliced, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce by combining all the ingredients in a small bowl. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the chicken, unfold the chicken thighs and lay them on a cutting board. Remove as much of the sinew as possible. (If some parts are very thick, cut them in half horizontally.) Slice a few shallow crosshatches into the meat. Cut each thigh into roughly 1/4-inch slices and place in a large bowl. Add the soy sauces and egg yolk and mix well. Stir in the potato flour and 2 teaspoons peanut oil and set aside. Using scissors, snip the chilies into 3/4-inch pieces, discarding the seeds. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 3 1/2 cups peanut oil into a large wok, or enough oil to rise 1 1/2 inches from the bottom. Set over high heat until the oil reaches 350 to 400 degrees. Add half the chicken and fry until crisp and deep gold, 3 to 4 minutes. Using a slotted spoon, transfer the chicken to a plate. Repeat with the second batch. Pour the oil into a heatproof container and wipe the wok clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the wok over high heat. Add 2 tablespoons peanut oil. When hot, add the chilies and stir-fry for a few seconds, until they just start to change color. Add the ginger and garlic and stir-fry for a few seconds longer, until fragrant. Add the sauce, stirring as it thickens. Return the chicken to the wok and stir vigorously to coat. Remove from the heat, stir in the sesame oil and top with scallions. Serve with rice."}]}