{"@context": "http://schema.org", "@type": "Recipe", "name": "Ziti With Sausage, Sweet Corn, Broccoli and Tomatoes", "description": "When your body craves vegetables, but your mind craves pasta and meat, this 30-minute pasta dish is a happy compromise. It's loaded with fresh cherry tomatoes, corn and broccoli, and the Italian sausage (hot or sweet) adds flavor and heft. Whatever you do, don't feel wed to the recipe. Use cauliflower in the place of broccoli, chicken sausage instead of pork, chopped plum tomatoes instead of cherry. It's the kind of recipe that can be a little different (in a good way) every time you make it depending on what's in your vegetable drawer or C.S.A. box. Also, don't forget taste and season well with salt and pepper as you go. The vegetables need a little seasoning to stand up to the assertive flavors of the sausage and garlic.", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": "https://static01.nyt.com/images/2018/04/19/dining/19COOKING-ZITI1/19COOKING-ZITI1-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "italian sausage, mixed vegetables, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 259}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 649, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "94 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "8 grams", "proteinContent": "24 grams", "saturatedFatContent": "5 grams", "sodiumContent": "898 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Kosher salt", "8 ounces Italian-style sausage, hot, mild or both", "1/4 cup extra virgin olive oil", "1 1/4 pounds short, tubular pasta (ziti, penne or rigatoni)", "3 stalks broccoli (1 1/2 pounds total)", "1 tablespoon chopped garlic", "3 ears sweet corn, kernels removed (about 3 cups)", "1 1/4 pounds cherry tomatoes (cut in half if large)", "Freshly ground black pepper", "Grated Parmesan cheese (optional)", "Red pepper flakes (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Heat 1 tablespoon oil in a large skillet over medium-high heat. Add the sausage; cook, breaking up the meat into 1/2-inch pieces, until most of the fat has rendered from the sausage and the pieces are brown and crunchy, but not burnt, about 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the boiling water, add pasta and cook until al dente. Reserve 1 cup of the pasta cooking water and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta is cooking, separate the broccoli flowerets from the stalks and cut the flowerets into 1-inch pieces. Peel the fibrous skin from the exterior of the broccoli stalks and cut the stalks into 1-inch pieces. Add the broccoli to the sausage and mix well. Then stir in the garlic, reduce the heat to low, cover and cook over medium heat for about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the reserved pasta cooking water to the sausage and broccoli mixture with the corn, tomatoes and the remaining three tablespoons of oil. Season generously with salt, pepper and red pepper flakes (if desired), to taste. Cover, bring to a boil and cook for 1 minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large serving bowl or in the pasta pot, combine the drained pasta with the sausage and vegetables, tossing the mixture together well. Serve with grated Parmesan cheese, if desired."}]}