{"@context": "http://schema.org", "@type": "Recipe", "name": "Ginger Souffle Cake", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, ginger, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 710, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "87 grams", "cholesterolContent": null, "fatContent": "37 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "22 grams", "sodiumContent": "296 milligrams", "sugarContent": "66 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/4 cups flour", "1 teaspoon baking powder", "1 1/2 teaspoons ground ginger", "1 teaspoon cinnamon", "1/2 teaspoon ground cloves", "1/2 teaspoon ground allspice", "1/4 teaspoon salt", "1/2 pound butter, softened", "1 cup light-brown sugar", "2 whole eggs", "1/2 cup buttermilk", "1/2 cup molasses", "3 teaspoons vanilla extract", "3 eggs, separated", "1/2 cup sugar", "1 1/2 cups milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk the flour, baking powder, ginger, cinnamon, cloves, allspice and salt in a bowl until well blended. Set aside. Use some of the butter to grease six 8-ounce souffle dishes or charlotte molds. Preheat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat remaining butter with brown sugar until well-blended. Beat in whole eggs, one at a time. Beating at low speed, add the flour mixture alternately with the buttermilk. Stir in molasses and 2 teaspoons vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean bowl, beat the egg whites until softly peaked. Beat in 1/4 cup of the sugar and continue beating until the mixture holds peaks but is not stiff. Fold the egg white mixture into the batter. Pour the mixture into the souffle dishes. Place in the oven and bake 45 to 50 minutes, until firm to the touch on top and a cake tester inserted in the center comes out clean. Remove from the oven and allow to cool almost to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the souffles are baking, beat the remaining sugar with the egg yolks until thick and light. In a heavy saucepan, scald the milk and, whisking constantly, slowly pour about half into the egg yolk mixture. Then stir the egg yolk mixture into the hot milk remaining in the saucepan. Place over medium-low heat and cook, stirring with a wooden spoon, until the custard has thickened enough to coat the spoon and steam begins to rise from it. Remove from heat, stir in the remaining teaspoon of vanilla, strain into a bowl, cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Unmold the souffles by running a knife around the edges and inverting each onto a dessert plate. Spoon some of the custard around each portion and serve."}]}