{"@context": "http://schema.org", "@type": "Recipe", "name": "Korean Rice Cake Soup With Dumplings (Duk Mandu Gook)", "description": "Korean New Year, Solnal, is greeted with steaming bowls of rice cake soup called duk gook - \"comfort food,\" said Moon Sun Kwak, who serves it at Dok Suni and Do Hwa, her family's restaurants in Manhattan. Her mother, Myung Ja Kwak, who is the chef, slowly simmers beef bones into a marrow-rich broth as the base for the soup.\n\n\"It's so healthy,\" the elder Ms. Kwak said as she dropped homemade dumplings into the soup in Do Hwa's kitchen. Not all versions of the soup have dumplings; it's the duk, or rice cake slivers, that matter. \"You eat it so you can turn a year older.\"", "author": {"@type": "Person", "name": "Dana Bowen"}, "image": "https://static01.nyt.com/images/2014/04/15/dining/Korean-Rice-Cake-Soup/Korean-Rice-Cake-Soup-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "soups and stews", "keywords": "beef, tteok (korean rice cakes), main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 774, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "122 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "10 grams", "proteinContent": "38 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1634 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces mung bean sprouts, chopped", "1 cup diced onion", "12 ounces kimchi, strained and chopped", "4 ounces firm tofu, crumbled", "1/4 pound ground pork", "1 1/2 teaspoons sesame oil", "1/2 teaspoon garlic, minced", "1/4 teaspoon salt", "1 package dumpling wrappers, thawed", "1 egg, beaten", "8 cups beef broth, preferably Korean (see note)", "1 bunch scallions", "1/3 pound lean beef, in thin slivers", "1 pound frozen Korean rice cakes, sliced (see note)", "2 eggs, lightly beaten", "Black pepper, to taste", "2 tablespoons toasted sesame seeds", "Toasted seaweed (optional), julienned"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make dumplings: Place a large pot of water over high heat. When it boils, add sprouts and onions and cook until sprouts are soft, about five minutes. Drain in colander and rinse under cold water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine sprouts and onions with kimchi. Working in batches, transfer a handful to cutting board and mince. Return vegetables to colander in sink. Add tofu, tossing to combine. Press down on vegetables with your hands, draining as much liquid as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working in batches, place a handful of vegetable-tofu mixture on a large piece of cheesecloth or clean, porous cloth, fold up edges and twist, squeezing out liquid. Empty back into mixing bowl. When done, transfer to colander, top with parchment paper and weigh down with a heavy, water-filled pot. Drain for at least a half-hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine pork, oil, garlic and salt. Add drained vegetables and mix well with your fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a scant tablespoon of filling in center of a wrapper, brush wrapper rim with egg, and fold, forming a half moon. Pinch closed with your fingers and squeeze out air. Wrap end tips around until they touch, dab with egg and pinch together: it will look like a tortelloni. Transfer to a parchment-lined plate and repeat until you have about 20 dumplings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make soup: Place a large pot filled with broth over high heat. Prepare scallions: discard white parts, chop a few inches of green parts into rounds and slice remainder lengthwise. When broth boils, add beef and 3 to 4 dumplings a person (freeze unused dumplings), reduce heat to medium and cook 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add frozen rice cakes and scallion slices and cook until cakes are soft, another two minutes. Add eggs and gently stir. Shut off heat and season with black pepper. Ladle into bowls and garnish with scallion rounds, sesame seeds and seaweed, if using."}]}