{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Apricot Tart With Prunes", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apricot, prune, dessert, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 329, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "9 grams", "sodiumContent": "103 milligrams", "sugarContent": "25 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["10 large pitted prunes", "3 tablespoons apricot nectar or orange juice", "2 tablespoons apricot or orange liqueur", "1 cup all-purpose flour", "1 1/2 tablespoons granulated sugar", "1/4 teaspoon salt", "7 tablespoons cold unsalted butter, in small pieces", "3 tablespoons ice water (approximately)", "10 fresh apricots, ripe but not soft", "4 tablespoons light brown sugar", "1 teaspoon cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Quarter the prunes, place them in a small saucepan with the nectar and liqueur, and simmer 10 minutes to soften them. Set them aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the flour, granulated sugar and salt together in a bowl. Add all but one tablespoon of the butter and, using your fingertips or two knives, break the butter up into the flour mixture until the mixture has a coarse, mealy texture. This can be done by pulsing in a food processor. Sprinkle the ice water over the flour and butter mixture and, using a fork, lightly mix until the ingredients begin to cling together and can be formed into a dough. If you mixed the butter and flour together in a food processor, transfer them to a bowl to mix in the water by hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Form the dough into a flattened ball and place it in the freezer for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the dough between sheets of waxed paper to form a circle 12 inches in diameter. Peel off one sheet of the waxed paper and place the dough, with the remaining sheet of paper on top, in a nine-inch tart pan. Peel off the top sheet of waxed paper and fit the dough into the pan. Trim the edges. Cover the pastry with a sheet of foil, weight it with pastry weights or dry beans and bake it for 10 minutes, until it looks dry. Remove it from the oven and remove the foil and weights."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pit and quarter the apricots, mix brown sugar and cinnamon together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the prunes with a tablespoon of the brown sugar and spread them over the bottom of the pastry in the pan. Arrange the quartered apricots in a pattern over the prunes. Sprinkle the apricots with the remaining brown sugar and dot with bits of the remaining tablespoon of butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake about 30 minutes, until the pastry is golden brown and the apricots begin to brown around the edges. Allow to cool to room temperature before serving."}]}