{"@context": "http://schema.org", "@type": "Recipe", "name": "Stargazy Pie", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT1H", "recipeYield": "10 servings", "recipeCuisine": "british", "recipeCategory": "dinner", "keywords": "main course, puff pastry, sardines", "aggregateRating": null, "recipeIngredient": ["2 9-inch rounds short-crust or puff pastry, unbaked", "10 fresh sardines, scaled, cleaned, filleted, heads on and tails removed", "2 tablespoons Dijon mustard", "2 tablespoons chopped fresh thyme or cilantro", "2 tablespoons chopped fresh parsley", "Finely grated rind and juice of 2 lemons", "1 teaspoon kosher salt", "3/4 teaspoon freshly ground pepper", "12 ounces bacon, chopped, lightly fried", "4 hard-boiled eggs (do not overcook), shelled, coarsely chopped", "Egg wash (1 egg mixed with 1 tablespoon water)", "10 small sprigs fresh parsley for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Arrange one pastry round in a shallow pie plate or on a baking sheet. Butterfly 4 of the sardines. Brush cut sides of all sardines with some mustard and sprinkle with chopped herbs, grated lemon rind, salt and pepper. Arrange sardines on pastry round or baking sheet equidistant from one another with filleted side down and heads resting on edge of pastry. Fold up and arrange remaining sardines among the butterflied sardines, heads resting on edge of pastry. Scatter bacon and eggs. Sprinkle lemon juice over sardines, bacon and eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim about 1/4 inch from edge of second round of pastry and place over sardines. Brush bottom pastry at edges with egg wash and press top pastry onto bottom pastry between sardines, arranging a pastry edge around each sardine neck so that just the heads peek out. Gently press pastry around the bodies of the sardines to make a wavy surface. Cut a small vent hole in the center of the top crust. Brush top with remaining egg wash."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake pie for 20 minutes. Reduce oven temperature to 350 degrees and bake 15 to 25 more minutes, until top of pie is a golden brown. Before serving, tuck a sprig of parsley in each sardine mouth."}]}