{"@context": "http://schema.org", "@type": "Recipe", "name": "Chiles Rellenos", "description": "Here’s a Tex-Mex dish of great distinction, taken from the version served at the old El Jardin restaurant in Houston. The recipe offers extremely good instruction on roasting the peppers, information that will hold you in good stead elsewhere in this archive. And the resulting pockets of beef and cheese, fried in batter, make an excellent argument for the relevancy of stuffed peppers in general, and stuffed, fried ones in particular.", "author": {"@type": "Person", "name": "Joe Drape"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1130, "unsaturatedFatContent": "79 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "101 grams", "fiberContent": "4 grams", "proteinContent": "25 grams", "saturatedFatContent": "15 grams", "sodiumContent": "945 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 large fresh poblano peppers", "8 ounces lean ground beef", "1/4 cup finely chopped onion", "1 teaspoon garlic powder", "1 large tomato, chopped", "Salt and freshly ground black pepper", "5 slices bacon, diced", "1 1/4 cups vegetable oil, or as needed", "1 large carrot, finely chopped", "1 medium all-purpose potato, peeled and cut into 1/2-inch dice", "4 large eggs, separated", "1/2 cup all-purpose flour"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat broiler. Place whole peppers on a flat pan and broil, turning frequently, until evenly black and blistered. Remove from heat and place in a plastic bag, twisted closed, for 30 minutes. Meanwhile, place a skillet over medium heat and add ground beef (no oil needed). Sauté until evenly brown, then add onion, garlic powder and tomato. Sauté until onion is translucent, about 3 minutes. Season with salt and pepper to taste, remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate skillet cook strips of bacon until browned and crisp. Using a slotted spoon, transfer bacon to beef mixture. Return pan and bacon fat to medium-low heat, and add 2 tablespoons vegetable oil, the carrot and potato. Sauté until potatoes are tender, 10 to 15 minutes. Remove from heat, spread meat mixture evenly across top, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove peppers from bag. Using protective gloves or under cool running water, peel burnt skins. Carefully make a vertical slit in side of each pepper and remove any seeds or veins. Stuff peppers with ground beef mixture, overlapping slits and securing them with toothpicks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large skillet over medium-high heat and add about 1/4 inch of oil. While oil heats, with an electric mixer whisk egg whites until thick and fluffy. Add egg yolks and whisk just until blended, about 30 seconds. Place flour in a wide shallow bowl. Coat each stuffed pepper with a thin layer of flour, then dip in egg mixture so that entire pepper is covered. Carefully place peppers in hot oil and fry on both sides until golden, about 2 minutes a side. Drain excess oil on paper towels, transfer to a warm platter, remove toothpicks, and serve immediately."}]}