{"@context": "http://schema.org", "@type": "Recipe", "name": "Simple Vanilla Ice Cream", "description": "The texture of this ice cream is better than almost any commercial ice cream, many of which are filled with air (at least when the ice cream is fresh, which is how it should be eaten — straight from the machine). It requires no eggs either, which means no custard, so it's much simpler to make.\n\nThe recipe even works with skim milk, if not quite as brilliantly. With skim milk or half-and-half, this is a much less fat-laden ice cream than one made with six eggs.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/Custard/Custard-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "1 generous pint", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "cornstarch, cream, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 210}, "recipeIngredient": ["2 1/2 cups light cream, half-and-half or milk (whole or skim), or a combination", "1/2 cup sugar", "Pinch of salt", "1 vanilla bean or 1 teaspoon vanilla extract", "3 tablespoons cornstarch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 cups cream, half-and-half or milk, the sugar and salt in a saucepan over medium-low heat. If using a vanilla bean, split in half lengthwise and scrape seeds into liquid, then add pod. Cook until mixture begins to steam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, blend cornstarch and remaining cream, half-and-half or milk; there should be no lumps. Remove bean pod from pot and discard. Add cornstarch mixture to pot. Cook, stirring, until it starts to thicken and barely reaches a boil, about 5 minutes. Immediately reduce heat to very low and stir for 5 minutes or so until thick. Stir in vanilla extract, if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If mixture has lumps, strain it into a bowl. Chill until cool, a couple of hours (you can skip this step if you have a machine with a built-in freezer). When cool or if there are no lumps, pour into an ice cream machine and freeze according to the manufacturer's instructions."}]}