{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-Baked Three Delights (Jiu Yin Sam Sin) (Sea Palace Restaurant)", "description": "", "author": {"@type": "Person", "name": "Fred Ferretti"}, "image": null, "totalTime": "PT2H10M", "recipeYield": "6 servings", "recipeCuisine": "asian, chinese", "recipeCategory": "dinner, lunch", "keywords": "main course, scallops, shellfish, shrimp", "aggregateRating": null, "recipeIngredient": ["2 tablespoons salt", "1/4 teaspoon five-spice powder (see note)", "1/2 pound sea scallops", "1/4 teaspoon baking soda", "12 large whole shrimp", "1/2 pound fresh squid (meat only, no tentacles)", "3 cups water", "1/2 teaspoon sesame oil", "Pinch of white pepper", "1/4 teaspoon salt", "4 tablespoons cornstarch", "4 cups peanut oil", "1 tablespoon fresh hot peppers, cut into 1/8-inch rounds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix salt and five-spice powder. Heat dry wok over high heat for 45 seconds. Add salt mixture and stir thoroughly until you smell the spices, about 1 minute. Remove from wok and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash scallops and drain. Place them in a bowl and add baking soda. Mix well to coat and refrigerate for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash shrimp thoroughly, remove feelers and cut shell along vein. Devein but leave shells on. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cross-cut squid meat, but do not cut it through. Then cut into 2-inch pieces. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add water to wok and bring to a boil. Blanch scallops for 1 minute, then remove. Blanch shrimp for 1 minute, then remove. Blanch squid for 2 minutes, then remove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Marinate scallops, shrimp and squid, each in a separate bowl, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cornstarch in a large plate. Toss scallops until lightly coated. Repeat with shrimp and squid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat wok over high heat. Add peanut oil and heat to 325 degrees. Place scallops in a strainer and lower into oil for 1 minute. Remove, drain and reserve. Bring oil back to 325 degrees and repeat process with shrimp for 1 minute. Remove, drain and reserve. Bring oil back to 325 degrees again and repeat process with squid for 2 minutes. Remove, drain and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain wok. Heat over high heat. Add hot pepper slices and stir. Add all seafood. Then turn off heat, add 3/4 teaspoon of the five-spice salt and stir together quickly until it is well mixed. Remove from wok and serve immediately."}]}