{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey Confit", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT3H", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, main course, fall, gluten-free, turkey", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 11}, "recipeIngredient": ["4 turkey wings, thighs or legs", "1 tablespoon coarse salt", "2 teaspoons ground black pepper", "About 20 sage leaves or 10 thyme sprigs or 5 rosemary sprigs", "10 cloves garlic, crushed and peeled", "2 quarts extra virgin olive oil, or as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss turkey, salt, pepper, herbs and garlic in a bowl and refrigerate, covered, for a half-hour or up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put turkey, herbs and garlic in a saucepan just large enough to fit it. Cover with olive oil. Turn heat to medium and watch carefully; allow just a few bubbles to come up at a time. (Use an instant-read or frying thermometer and keep oil at 190 to 200 degrees.) Do not allow meat to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, turning meat once or twice, for two hours or until it is quite tender but not falling off bone. Remove meat from oil. You can refrigerate turkey and oil separately or together, until needed. (If storing separately, use turkey in a few days; if you store it in oil, it will keep a week or more.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you're ready to cook, put 2 to 4 tablespoons of used oil in a skillet large enough to hold turkey pieces in one layer; set heat at medium-low. (Use leftover oil for other purposes.) Cook turkey pieces slowly, turning once or twice, until browned and crisp, 10 to 20 minutes. Serve hot, warm or at room temperature, alone or over a bed of greens with a little dressing."}]}