{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan Bagnat", "description": "The beauty of a pan bagnat: not only is it impressive and something different to share with fellow picnickers, it also wants to be made in advance. The longer it sits (up to 24 hours), the better it gets. The flavors marry, the oil and tomato juices mingle, the anchovies dissolve into the bread and all of it coalesces into a sophisticated whole that stays intact when you bite in. Pan bagnats can be a catchall for whatever vegetables are on hand: crisp hot and sweet peppers, fennel, cucumber and scallions. Even string beans, peas and fava beans can all work. The tuna itself is optional; some versions are ringed with just anchovies and sliced hard-cooked eggs. And at the  time of year when wild salmon is in season, you could use some of the leftover cooked fish in place of tuna, which would make the sandwich even classier.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/06/06/dining/panbagnavid/panbagnavid-mediumThreeByTwo440.jpg", "totalTime": "PT15M", "recipeYield": "2 to 3 servings", "recipeCuisine": "french", "recipeCategory": "quick", "keywords": "appetizer, side dish, bread, tuna", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 171}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 264, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "19 grams", "saturatedFatContent": "3 grams", "sodiumContent": "432 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 anchovy fillets, minced (optional)", "1 very small garlic clove, minced", "1 teaspoon red wine vinegar", "1/2 teaspoon Dijon mustard", "Pinch of salt and freshly ground pepper", "2 tablespoons extra virgin olive oil", "1 8-inch round crusty country loaf or small ciabatta, halved", "1 Kirby cucumber or 1/2 regular cucumber", "1 medium-size, ripe tomato, sliced", "1/2 small red onion, sliced", "1 jar (5 to 6 ounces) tuna packed in olive oil, drained", "8 large basil leaves", "2 tablespoons sliced pitted olives, preferably a mix of black and green", "1 hard-cooked egg, peeled and thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the optional anchovies, the garlic, vinegar, mustard, salt and pepper. Slowly drizzle in oil, whisking constantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a country loaf, pull out some soft interior crumb to form a cavity. If using a ciabatta, you won't need to eliminate anything."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a Kirby cucumber, slice thinly. If using a regular cucumber, peel, halve lengthwise, and scoop out seeds from one half. Thinly slice seedless half. Add sliced cucumber to vinaigrette and toss well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread half the cucumbers on bottom of bread. Top with tomato and onion slices, then with tuna, basil, olives and egg slices. Top egg with remaining cucumbers and vinaigrette. Cover with second bread half and firmly press sandwich together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap sandwich tightly in foil, waxed paper or plastic wrap, then place in a plastic bag. Put sandwich under a weight such as a cast-iron frying pan topped with a filled kettle, or have a child about 7 years old sit on it. Weight sandwich for 7 to 10 minutes, then flip and weight it for another 7 to 10 minutes (or as long as you can get the child to sit still). Unwrap, slice and serve immediately, or keep it wrapped for up to 8 hours before serving."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Pan Bagnat, the Perfect Picnic Sandwich", "description": "When it comes to picnics, we can do better than a loaf of bread and a wedge of cheese. Melissa Clark shows why the pan bagnat is the ideal sandwich for outdoor summer dining.", "thumbnailUrl": "https://static01.nyt.com/images/2013/06/06/dining/panbagnavid/panbagnavid-mediumThreeByTwo440.jpg", "uploadDate": "2013-06-11T21:29:13.000Z", "duration": "PT3M22S"}}