{"@context": "http://schema.org", "@type": "Recipe", "name": "Julia Child's Caramel Custard", "description": "There are a few tricks to making this delicious custard from Julia Child and Alex Prud’homme, which was featured in The Sunday Times Magazine in 2006. Don’t overcook the caramel, and make sure that the baking water only simmers, never boils. When mixing the hot milk into the egg mixture, whisk constantly to avoid curdling the eggs. Individual ramekins can be used in place of a charlotte mold, but dial back the cooking time.", "author": {"@type": "Person", "name": "Julia Child"}, "image": "https://static01.nyt.com/images/2014/05/12/dining/juliacaramel-still/juliacaramel-still-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 6", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 263, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": null, "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "65 milligrams", "sugarContent": "43 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup plus 2/3 cup sugar", "2 cups milk", "1 1/2 teaspoons vanilla extract", "2 large eggs", "4 large egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. In a small saucepan, combine 1/2 cup sugar with 1/4 cup water. Bring to a boil over low heat, stirring to dissolve the sugar. Increase the heat to high and cook, without stirring, until the syrup turns a light caramel color. Remove the saucepan from the heat and dip the bottom into cold water to stop the cooking. Pour the caramel into a 4-cup charlotte mold, and tilt so that it covers the bottoms and sides. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, bring the milk and vanilla to a boil. In a heatproof bowl, beat the eggs, egg yolks and cup sugar until blended. Whisking constantly, pour the hot milk into the egg mixture; let rest for a few minutes, then strain. Pour the custard into the caramel-coated mold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the mold in a small but deep baking or roasting pan, and add hot water to come about two-thirds up the sides of the mold. Place the pan on the stove over medium heat, and bring the water to a simmer. Transfer the pan to the oven. (The water should stay at a low simmer at all times; do not let it boil or the custard will overcook.) Bake until a knife inserted into the center of the custard comes out clean, 40 to 50 minutes. Keep the custard in the baking pan until the water cools. Remove from the pan to finish cooling. To serve, run the tip of a knife around the top of the custard to loosen it. Invert a serving platter over the mold and quickly turn it over again. Carefully remove the mold."}]}