{"@context": "http://schema.org", "@type": "Recipe", "name": "Jasper White's Pan-Roasted Lobster", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT30M", "recipeYield": "2 generous servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "gluten-free, low-carb, lobster, seafood, shellfish, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 671, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "2 grams", "proteinContent": "27 grams", "saturatedFatContent": "24 grams", "sodiumContent": "734 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 live 1 1/2-to-2-pound lobsters", "2 tablespoons peanut oil", "2 shallots, minced", "1/4 cup bourbon", "2 to 3 tablespoons dry white wine", "6 tablespoons unsalted butter, cut into small pieces and chilled", "1 tablespoon chervil, finely chopped", "1 tablespoon chives, finely chopped", "Kosher or sea salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees. For each lobster, place it on a cutting board, facing you. Place the front tip of a heavy knife in the center of the lobster, near where the carapace meets the tail. In one forceful, swift motion, split the front half of the lobster lengthwise, which will kill it instantly. Turn it around and repeat this motion, splitting the tail and the lobster in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pull the head sac out of both halves. Use fingers or surgical tweezers to remove the intestines. Place the tomalley and roe, if there is any, in a small bowl and use a fork to break it into tiny pieces; cover and refrigerate. With a knife, remove the claws and knuckles by cutting the thin sections where the knuckles meet the body. With the back side of the knife, tap the claws until the shells crack. In another swift, forceful motion, cut the tail from the body on both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a heavy 12-inch saute pan over the highest heat possible and heat for 3 to 5 minutes. Add the oil and heat until it forms a film over the bottom of the pan. Slide the lobster sections, shells down, into the hot oil. Using tongs, move the pieces and flatten them to sear all the shells evenly. The claws need to be seared on only one side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the tomalley and roe and stir; place in the oven for 3 minutes. Remove, return to high heat on the stove top, add the shallots and stir. Remove the pan from the heat and add the bourbon; return to the heat, where the bourbon will probably ignite. Cook until the flames die down, add the wine and cook until the pan is almost dry. Reduce the heat to low."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Quickly remove the lobster and place shell-side down on warm plates. Return the pan to low heat, add the butter, chervil and chives and stir until the mixture resembles a creamy sauce, 1 to 2 minutes. Remove from the heat, season with salt and pepper to taste, spoon the sauce over the lobster and serve."}]}