{"@context": "http://schema.org", "@type": "Recipe", "name": "Grand Flanero's Pumpkin Flan", "description": "", "author": {"@type": "Person", "name": "William Norwich"}, "image": null, "totalTime": "PT5H15M", "recipeYield": "8 servings", "recipeCuisine": "latin american", "recipeCategory": "", "keywords": "dessert, fall, gluten-free, pumpkin", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 256, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "53 milligrams", "sugarContent": "43 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds seeded, peeled fresh pumpkin or calabaza, butternut or other yellow winter squash, or 2 cups canned puréed pumpkin", "1 1/2 cups sugar", "3 eggs", "3 egg yolks", "1 3/4 cups whole milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut pumpkin or squash into 1-inch chunks and place in a pan. Cover with water and heat to boiling. Reduce heat to simmer and cook until tender, about 20 minutes. Remove to a food processor, reserving the cooking liquid. Purée, adding enough (about 1/2 cup) cooking liquid to make a smooth but not watery mixture. Pour 2 cups of the purée (or canned pumpkin purée) into a large bowl. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Heat 3/4 cup sugar in a shallow saucepan over medium heat until melted and amber colored, swirling the pan rather than stirring. When the syrup is bubbly and perfectly clear, pour it into a 6-cup metal loaf pan (the narrower the better) or terrine. Using a potholder, quickly tilt the pan so the syrup evenly covers the bottom. Place on a wire rack to harden."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine remaining sugar, eggs and yolks and whisk until blended. Heat milk until bubbles form around the edges, and whisk into the egg mixture. Pour the mixture through a sieve into the pumpkin purée. Whisk and pour over the caramel in the prepared loaf pan. Cover with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the loaf pan in a high-sided roasting pan just large enough to hold it. Add enough hot water to come up to the sides of the flan. Bake until the sides are set and a knife inserted in the center comes out clean, about 40 minutes. (Do not overbake.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove some water from the roasting pan with a ladle, and then remove the pan from the oven. Place the loaf pan on a wire rack and let cool. Place the flan in a refrigerator until thoroughly chilled, at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: run a thin-bladed knife around the flan and invert onto a rimmed serving dish and slice."}]}