{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Raspberry Shortcakes", "description": "Here, strawberry shortcake is transformed into a chocolate raspberry shortcake, dark and delicious but somehow more grown-up than the traditional dish. Cocoa gives depth, but it can also make cake taste slightly bitter, so honey is added to the dough to counter this. Raspberries offset the chocolate cakes much better than strawberries would, though it would not be a crime to use them. If you have a supply of gorgeous dark, sour-sweet blackberries on hand, they would definitely be a suitable fruity alternative to the raspberries.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2014/06/02/dining/Chocolate-Raspberry/Chocolate-Raspberry-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "12 shortcakes, and filling for 6", "recipeCuisine": "", "recipeCategory": "", "keywords": "chocolate, raspberries, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 258, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "10 grams", "sodiumContent": "134 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Vegetable oil or nonstick spray, for pan", "1 2/3 cups flour", "1/3 cup cocoa", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "2 tablespoons sugar", "8 tablespoons (1 stick) diced chilled butter", "1 large egg", "1 cup sour cream", "2 teaspoons vanilla extract", "3 tablespoons honey", "1/2 cup heavy cream", "1 tablespoon confectioners' sugar", "1 cup raspberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare shortcakes, heat oven to 400 degrees. Oil bottom of each cup in a 12-cup muffin pan. In a mixing bowl, combine flour, cocoa, baking powder, baking soda and sugar. Using a pastry blender or an electric mixer, or working by hand, cut in the butter until mixture resembles damp sand. In a separate bowl, whisk together egg, sour cream, vanilla and honey. Add to flour mixture, and stir until thoroughly blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a scant 1/4 cup dough into each muffin cup. (Do not use muffin papers.) Bake until risen and firm on top, 15 to 20 minutes. Remove from heat, and allow to cool. Then remove from pan, and cool completely. Place 6 shortcakes in an airtight freezer bag, and freeze for another use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare filling for 6 shortcakes, whip heavy cream with 2 teaspoons confectioners' sugar until thick but still soft. Add 1/2 cup raspberries to cream, mashing them roughly with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Split each shortcake in half horizontally, and place a dollop of raspberry cream onto bottom half. Add a portion of whole raspberries, and put the top back on at an angle. Sprinkle a dusting of the remaining 1 teaspoon confectioners' sugar over shortcakes, and serve."}]}