{"@context": "http://schema.org", "@type": "Recipe", "name": "White Chocolate Truffles", "description": "White chocolate does not engender feelings of neutrality; typically, one either loves or hates it. These truffles, adapted from the pastry chef and cookbook author Nick Malgieri, are unapologetically sweet and rich, everything one loves (or hates) about the controversial ivory sweet. This ingredient list is short (just five!), but quality is key. Skip the supermarket white chocolate chips and invest in a good brand like Valrhona or Callebaut.", "author": {"@type": "Person", "name": "Corby Kummer"}, "image": "https://static01.nyt.com/images/2016/11/15/dining/15COOKING-WHITE-CHOC-TRUFFLES2/15COOKING-WHITE-CHOC-TRUFFLES2-articleLarge.jpg", "totalTime": "PT1H55M", "recipeYield": "About 36 truffles", "recipeCuisine": "french", "recipeCategory": "candies", "keywords": "dessert, white chocolate", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 72, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "10 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces/340 grams white chocolate, finely chopped", "4 tablespoons/55 grams unsalted butter, diced", "6 tablespoons/90 milliliters cold heavy cream", "2 tablespoons raspberry eau de vie (or use kirsch or Grand Marnier)", "Cocoa powder, for dusting"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine chocolate and butter in a large heatproof bowl that fits snugly over a pot of barely simmering water (do not let the bowl touch the water). Stir constantly with a rubber spatula until the chocolate and butter are melted. The mixture will look grainy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove bowl from simmering water and thoroughly stir in cream one tablespoon at a time. The mixture will become increasingly grainy. As the last of the cream is added, however, it will become smooth. Press plastic wrap directly against top of mixture and refrigerate for an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape mixture into bowl of an electric mixer. Beat on medium speed for 1 minute then add the liqueur in a slow, steady stream and continue beating until the mixture lightens in both color and texture, 15 to 30 seconds. Do not overbeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape mixture into a 14-inch pastry bag fitted with a 1/2-inch plain tube (Ateco No. 6). Pipe out 3/4-inch spheres onto a pan lined with parchment or wax paper. Refrigerate until firm, about a half hour. Roll each truffle between the palms of your hands to make it completely round. If the mixture gets too soft to roll, chill for a few minutes until firm. Roll in sifted cocoa powder. Store in the refrigerator up to one week."}]}