{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta con le Sarde", "description": "When the photographer and filmmaker Robert Trachtenberg brought this recipe to The Times in 2008, he described it as “a perfectly balanced combination of sardines, fennel, currants and bread crumbs.” Adapted from Gusto in Greenwich Village, this seafood pasta needs no cheese: The saltiness and bite from the sardines and the sautéed vegetables should be more than enough.", "author": {"@type": "Person", "name": "Robert Trachtenberg"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Pasta-con-le-Sarde/Pasta-con-le-Sarde-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "main course, pasta, sardines", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 134}, "recipeIngredient": ["1/2 cup currants", "1/4 teaspoon red-pepper flakes", "1/2 cup dry white wine", "1 tablespoon butter", "1/2 cup unseasoned dry bread crumbs", "1/2 cup plus 6 tablespoons extra-virgin olive oil", "1 medium onion, finely chopped", "2 small cloves garlic, minced", "1 pound fennel, bulb finely chopped, fronds chopped and reserved", "1 tablespoon fennel seeds, crushed", "Salt", "2 pounds fresh sardines (trimmed and deboned, yielding 1 1/4 pounds) or 1 pound canned", "1 pound bucatini pasta", "1/2 cup pine nuts, toasted", "1/4 cup capers, rinsed", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Combine the currants, red-pepper flakes and wine in a bowl; set aside. In a small sauté pan, melt the butter. Add the bread crumbs and cook, stirring, until golden brown. Transfer to a bowl, stir in 2 tablespoons of the olive oil and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy skillet, heat 1/2 cup olive oil over medium-low heat. When hot, add the onion, garlic, fennel bulb and fennel seeds. Season with salt. Cook, stirring occasionally, until the fennel is tender, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine mixture and the sardines, breaking them into pieces with a fork. Bring to a boil and gently simmer for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough salt to the boiling water so that it tastes salty. Boil the bucatini until al dente, 6 to 8 minutes; strain. Return the pasta to the pasta pot and set over low heat. Fold in the fennel-sardine mixture. Toss in the remaining 4 tablespoons olive oil. Add 3/4 of the fennel fronds, the pine nuts, the capers and a quarter of the bread crumbs. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide pasta among plates and sprinkle the remaining bread crumbs and fennel fronds over each. Serve immediately."}]}