{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Potatoes With Salmon Caviar", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, caviar, potato", "aggregateRating": null, "recipeIngredient": ["2 pounds Yukon Gold potatoes", "Coarse or kosher salt", "Canola oil for frying", "1/2 cup sour cream or crème fraîche", "4 ounces salmon caviar", "Snipped chives", "Iced vodka for serving, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a saucepan in a single layer, and cover with cold salted water. Bring to a boil, and boil until almost cooked through but still firm in the center, 20 to 30 minutes. Drain, and peel when cool enough to handle. Cut the potatoes into quarters, and sprinkle them lightly with salt. (The potatoes may be prepared to this point up to 4 hours in advance and held at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 250 degrees, and put an ovenproof platter in it. Heat 2 to 3 inches of oil in a deep pot over medium-high heat, until it bubbles vigorously when a small piece of potato is dropped in. Working in batches to avoid crowding the pan, fry the potatoes until browned and crisp, occasionally moving them around in the oil to make sure they cook evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the potatoes from the oil with a slotted spoon, and drain on paper towels or brown paper bags. Sprinkle the potatoes lightly with salt, and transfer them to the platter in the oven to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all potato quarters are cooked, quickly top each with a heaping 1/2 teaspoon of sour cream, a heaping 1/2 teaspoon of caviar and a sprinkling of chives. Serve right away for best flavor. To eat Russian-style, have a shot of vodka, and immediately pop a potato quarter into your mouth."}]}