{"@context": "http://schema.org", "@type": "Recipe", "name": "Rabbit With Vanilla-Almond Marinade", "description": "", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT8H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "gluten-free, main course, rabbit, vanilla bean", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 300, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "34 grams", "saturatedFatContent": "3 grams", "sodiumContent": "457 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 rabbits, each 2 1/2 to 3 pounds", "Vanilla oil (<a href=\"http://cooking.nytimes.com/recipes/11738-vanilla-oil\">see recipe</a>)", "Flour", "1 lime, cut into slices, for garnish", "1 cup whole almonds", "2 cups chopped onions", "2 tablespoons lime juice", "Seeds from 1 Tahitian vanilla bean", "2 tablespoons vanilla oil", "1/4 teaspoon salt", "1 small onion, quartered", "6 peppercorns", "2 large cloves garlic, bruised but left whole", "Scraped-out vanilla pod from marinade, cut into 1-inch pieces", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the rabbit saddles into two or three pieces each. Set them aside with the meaty rear legs. Bone the rib sections, putting the meat with the saddles and legs. Set aside the other bony rabbit parts for the sauce, reserving liver, etc., for another use (such as pate)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind the whole almonds in a food processor until they are almost paste. Add the onions and grind again until a thick, grainy sauce is formed, then whirl in the lime juice, vanilla seeds, vanilla oil and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coat each meaty piece of rabbit with the marinade and set it in a single layer in a shallow glass or china dish such as a rectangular baking pan. Cover with plastic wrap and allow to marinate for four hours at room temperature or eight hours in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bony parts in a large saucepan or kettle with the onion, peppercorns and garlic. Cover generously with water, using at least five cups. Bring the liquid to a boil, then reduce to a simmer, cover the pan and cook for two hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover and cook one to one-and-a-half hours more. Strain the broth and taste. It should be quite strongly flavored. If it is not, return to the heat and reduce to concentrate. You should get about three cups of broth, of which you will need one-and-a-half cups. (The remainder may be used in recipes calling for chicken stock.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About one hour before serving time, place a rack in the upper third of the oven and preheat to 450 degrees. Put a generous layer, about one-eighth inch, of vanilla oil in a shallow baking pan, such as a jellyroll pan, large enough to hold the rabbit pieces in one well-separated layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the marinade from the rabbit, reserving it and any juices that have collected. Dredge each piece of meat with flour, making sure all parts are coated, and place on the prepared pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the rabbit in the oven, bake 15 minutes, then reduce the heat to 425 degrees and bake 15 minutes more. Using tongs, turn the pieces over. Add more oil if they seem to be sticking. Cook 15 to 25 minutes more, until the meat is well browned and the juices run clear when a piece is pricked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the rabbit is cooking, combine the reserved marinade and juices with one-and-a-half cups of the rabbit broth. Simmer over low heat for about 40 minutes, stirring occasionally, until all the raw onion flavor is gone and a thick, well-balanced sauce has formed. Taste and add salt as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place the rabbit in the center of a warmed serving platter and surround with a border of sauce, using half of it. Garnish the platter with lime slices and serve the remaining sauce separately."}]}