{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Crème Caramel", "description": "", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, eggs, milk, gluten-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 209, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "88 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/4 cups whole milk", "2 star anise", "1/2 cup plus 1 tablespoon superfine sugar", "1/4 teaspoon ground cinnamon", "4 large eggs", "3 cups blackberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place six 2/3-cup to 1-cup dariole molds or ramekins in a roasting pan or baking dish. Set oven temperature to 325, and place pan of molds in oven while it heats up; remove molds when oven is completely heated. Meanwhile, in a small saucepan, combine milk and star anise. Place over medium heat until nearly boiling, then remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine 1/2 cup of the sugar with cinnamon and 2/3 cup water. Place over low heat and stir briefly, then leave until sugar is completely dissolved. Increase heat to medium high and, without stirring, bring to a vigorous boil. Allow syrup to foam and boil until brown and caramelized, 10 to 15 minutes; do not stir. (When sugar is caramelized, it will have a slight burned aroma. To check color of syrup, dip in a wooden spoon and allow syrup to drip off; caramelized syrup will be dark golden brown.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour equal amounts of syrup into each warm mold. Using tongs or oven mitts, quickly swirl caramel around to coat a little of sides as well as bottom. Fill a kettle or pan with about 2 quarts of water, and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine eggs with remaining tablespoon of sugar. Whisk until smooth. Pour milk and star anise into egg mixture, and whisk again. Pour mixture through a fine mesh strainer into a pitcher or bowl, then pour equal amounts into molds. Add enough boiling water into roasting pan to come about halfway up the outsides of molds. Place pan of molds in oven and bake just until set, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove molds from water bath and allow to cool. Cover with plastic wrap and refrigerate until chilled, preferably overnight. Allow to sit at room temperature for at least one hour before serving. To release créme caramels from molds, immerse bottoms of molds in hot water and shake gently, then invert over individual serving plates. Arrange equal portions of berries around each créme caramel, and serve."}]}