{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Burgers With Feta Cheese", "description": "These cheeseburgers with a Middle-Eastern tang were introduced to The Times in 1987 by Pierre Franey, who wrote about them in “60-Minute Gourmet.” They are made of ground lamb sprinkled with cumin, salt and pepper, and topped with crumbled feta cheese. Mr. Franey broiled the burgers, but they are just as good — arguably better — prepared on the grill. “A good dish to serve with the lamb burgers,” Mr. Franey wrote, “is broiled and baked eggplant and tomatoes.”", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, easy, quick, burgers", "keywords": "gluten-free, lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 47}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1179, "unsaturatedFatContent": "54 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "123 grams", "fiberContent": "0 grams", "proteinContent": "15 grams", "saturatedFatContent": "64 grams", "sodiumContent": "466 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds lean lamb, ground", "Salt to taste if desired", "Freshly ground pepper to taste", "1/4 teaspoon ground cumin", "2 teaspoons fresh rosemary, finely chopped, or half that amount dried", "3/4 cup feta cheese, crumbled", "4 teaspoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide lamb into 8 portions of equal size. Shape each into a patty and sprinkle on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle top of each patty with an equal amount of cumin and rosemary. Pat to help the herb and spice adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Patties may be broiled or cooked in a skillet. If broiled, preheat broiler to high. Place patties on a baking sheet and place about 3 inches from source of heat. Broil them 2 minutes if you wish them rare, 4 minutes for well done. Turn patties and cook 1 minute if you wish them rare, 2 minutes for well done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If patties are cooked in a skillet, select one large enough to hold them in one layer. Brush skillet with a little oil and heat thoroughly on stove. Cook patties over moderately high heat for 2 minutes if you wish them rare, 4 minutes if well done. Turn patties and continue cooking 1 minute for rare, 2 minutes for well done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "However the patties are cooked, top each with a portion of feta cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place under broiler, preheated to high, about 3 inches from the source of heat. Let broil about 1 minute. Dot center of each patty with half a teaspoon of finely chopped parsley."}]}