{"@context": "http://schema.org", "@type": "Recipe", "name": "Artichokes With Orzo Macaroni", "description": "", "author": {"@type": "Person", "name": "Robert Farrar Capon"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "pastas", "keywords": "artichoke, orzo, side dish, spring, summer, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 347, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "3 grams", "sodiumContent": "252 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["6 fresh artichokes", "2/3 cup olive oil", "10 cloves garlic, cut in half", "6 sun-dried tomatoes, cut into strips (or use plum tomatoes, seeded and cut into strips)", "1 tablespoon balsamic vinegar, or as desired", "2 tablespoons wine or cider vinegar, or as desired", "Pinch of sugar", "Salt and pepper, to taste as desired", "1 1/2 cups orzo macaroni, cooked according to package directions and drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the stems off the artichokes. Cook the artichokes, covered, in boiling salted water until tender -about 30 minutes, or until a wooden skewer will pierce through an artichoke to the bottom of the pot and come away easily, without lifting the artichoke. Drain and cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a sharp, thin paring knife, cut out the base of each artichoke, removing both the choke and the heart, producing a round piece about 2 to 2 1/2 inches in diameter. Scrape out the choke with a spoon. Cut the heart into 1/4-inch slices and reserve. Using a sharp, heavy knife, carefully cut the remaining upper portion of the artichokes in half vertically and arrange the halves around the edge of a large, deep platter, with their insides facing up and their bases toward the center of the platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the olive oil and garlic cloves into a large skillet and simmer over low heat until the garlic turns a pale gold, about 5 minutes. Add the sun-dried tomatoes, vinegars, sugar, salt and pepper and simmer 2 minutes, mixing well. Add the artichoke heart slices, mix and simmer 2 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carry the skillet to the serving platter and, using a teaspoon, spoon a bit of the liquid in the skillet into the cup formed by the inside of each artichoke, leaving behind about half of the liquid in the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked orzo to the skillet, stirring to mix the orzo with the rest of the ingredients. Check the seasoning for salt and for vinegar. Carefully pile the mixed orzo in the center of the platter."}]}