{"@context": "http://schema.org", "@type": "Recipe", "name": "Tunisian Artichoke And Orange Compote", "description": "", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "african, mediterranean", "recipeCategory": "", "keywords": "artichoke, orange, gluten-free, vegan, vegetarian, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 93, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "7 grams", "proteinContent": "4 grams", "saturatedFatContent": "0 grams", "sodiumContent": "429 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 lemons", "4 large artichokes", "2 tablespoons extra virgin olive oil, more for drizzling", "2 cloves garlic, sliced", "1/3 cup fresh orange juice, more to taste", "1 teaspoon salt or to taste", "1/2 teaspoon pepper", "2 thin-skinned oranges, peeled and sectioned", "Pinch of ground coriander", "1 tablespoon sugar, more to taste", "4 sprigs fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place about 4 cups of water and the juice of one lemon in a bowl. To clean artichokes, cut stem as close to base as possible. Break off leaves as far as they will snap. Using a knife and a vegetable peeler, trim rough parts. Cut off thorny tips. Quarter artichokes, and remove hairy chokes with a melon baller or paring knife. Rub with lemon, and drop into bowl with water and lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons olive oil in a flameproof earthenware or stainless shallow saucepan, add garlic, and saut&#233; gently for 1 minute. Stir in orange juice, juice of remaining half lemon, salt and pepper. Stir with a wooden spoon. Drain artichokes, and add to pan with 1/4 cup water. Cover with crumbled wet parchment paper and a tight-fitting lid, and set over lowest heat to cook for 25 to 30 minutes or until tender, turning artichokes once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine orange sections, coriander and sugar in an eight-inch skillet, adding up to 3 tablespoons orange juice depending on juiciness of oranges. Cook, stirring, over medium-low heat until reduced and syrupy, about 10 minutes. Taste, and add extra sugar if still bitter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a slotted spoon, transfer glazed orange sections to a serving dish. Add artichokes to syrupy juices in skillet, and cook until glazed. Transfer artichokes to serving dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add artichoke cooking juices to skillet. Reduce quickly to a few tablespoons, correct seasoning with salt, pepper, a few drops of lemon juice and a drizzle of fresh oil, and pour over artichokes and oranges. Cool. Just before serving, scatter mint sprigs on top."}]}