{"@context": "http://schema.org", "@type": "Recipe", "name": "Club Sandwiches", "description": "Oh, the perfection of a well-made club sandwich: layers of crisp bacon, tender chicken pulled from the bone (no cardboard chicken breasts here), slices of the ripest tomato you can find and crunchy romaine lettuce leaves. All of this nestled between slices of toasted white bread slathered with homemade mayonnaise. And no one would bristle if you added slices of avocado. They might declare you a genius.", "author": {"@type": "Person", "name": "Julia Reed"}, "image": "https://static01.nyt.com/images/2015/04/03/dining/club-sandwich/club-sandwich-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "lunch", "keywords": "bacon, chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 76}, "recipeIngredient": ["6 slices good white bread, either Pepperidge Farm or from a light homemade loaf", "<a href=\"http://cooking.nytimes.com/recipes/12459-mayonnaise\">Homemade mayonnaise</a>", "4 thin slices breast of chicken, either roasted or poached, on the bone, for the occasion", "Salt and freshly ground pepper to taste", "8 slices thick bacon, crisp", "1 ripe tomato, thinly sliced", "4 lettuce leaves, either iceberg, romaine or Boston (I love Boston best on this), rinsed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly toast bread and spread slices generously with mayonnaise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top two slices of bread with chicken slices. To each, add two pieces of bacon, lettuce to cover the bacon, followed by tomato slices. Lightly salt and pepper. Top each with second piece of toast, mayonnaise side down. Spread mayonnaise on top of the bread. Top with chicken, two slices of bacon, lettuce and tomato. Lightly salt and pepper. Top with third piece of bread, mayonnaise side down. Cut both sandwiches in half and serve."}]}