{"@context": "http://schema.org", "@type": "Recipe", "name": "Onion Pie", "description": "", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, onion, saltine crackers, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 545, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "26 grams", "sodiumContent": "511 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 tablespoons unsalted butter", "4 ounces Saltine crackers (about 36)", "1 1/2 pounds yellow onions, peeled, trimmed, halved lengthwise, thinly sliced (about 4 1/2 cups)", "1/2 teaspoon kosher salt", "3 large eggs", "3/4 cup heavy cream", "4 ounces grated extra-sharp New York cheddar cheese (about 1 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Melt butter in a large skillet or saut&#233; pan over low heat; set aside. In a food processor, pulse Saltines to fine crumbs and transfer to a medium bowl. Pour four tablespoons melted butter over crumbs and toss with fingertips or a rubber spatula until evenly coated. Press mixture firmly into a deep-dish 9-inch pie pan, using a second pie pan, if possible, to compact them evenly against bottom and sides of pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat remaining melted butter in skillet over medium-high heat until frothy. Add onions and 1/4 teaspoon salt. Cook, stirring occasionally, until onions are evenly browned, 15 to 20 minutes. Transfer onions to pie pan, patting them down in an even layer on crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, beat eggs with a whisk and add heavy cream and remaining salt, whisking gently to incorporate. Pour mixture slowly, in a thin stream, into center of onions in pie pan. Sprinkle grated cheese over top and place in oven. Bake until puffy and slightly browned on top, 30 to 35 minutes. Slice with a serrated knife into six wedges and serve."}]}