{"@context": "http://schema.org", "@type": "Recipe", "name": "Beautiful Soup (Vegetable Soup With Beets, Dill and Orange Zest)", "description": "This is a sweet and buttery tomato-onion soup that evolved, many years ago, toward a kind of borscht, but stopped short. Borscht tastes too earthy for my palate. Tomatoes and orange keep the flavor a bit brighter and more acidic. The name comes from the colors: orange carrots, carnelian tomatoes, magenta beets. I serve it at home, at least twice each winter, with snow-white dollops of sour cream floating on top. It looks wonderful, tastes good, and is very healthful. And without my needing to say a word about mincing or dicing, it teaches my children about the satisfaction of a job well done.", "author": {"@type": "Person", "name": "Celia Barbour"}, "image": "https://static01.nyt.com/images/2014/04/16/dining/Beautiful-Soup/Beautiful-Soup-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "appetizer, main course, side dish, beet, vegetables", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 259}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 376, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "7 grams", "proteinContent": "12 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1537 milligrams", "sugarContent": "17 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons butter or 3 tablespoons butter and 3 tablespoons olive oil", "3 medium onions, chopped into 1/2-inch pieces", "4 cloves garlic, minced", "2 small beets, peeled and cut into 1/2-inch dice", "4 to 5 medium carrots, cut into 1/2- inch dice", "4 stalks celery, cut into 1/2-inch pieces", "1/2 medium celery root, peeled and cut into 1/2-inch dice", "3/4 cup chopped dill", "2 quarts beef or chicken stock", "1 28-ounce can diced tomatoes with their juice", "Finely grated zest and juice of 1 orange", "Salt and freshly ground black pepper", "Sour cream, for garnish", "Dark whole wheat sour bread or other hearty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flameproof casserole or other deep, wide pan over low heat and add butter or butter-oil mixture. When butter has melted, add onion and garlic; sauté until soft but not browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to medium-high and add beets, carrots, celery, celery root and half the dill. Sauté, adjusting heat as needed, until vegetables have released their liquid, dried and start to turn golden but not brown, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock and tomatoes with their juice, and bring to a boil. Reduce heat and cook until vegetables are soft, about 45 minutes. Add orange zest and juice, and remaining dill. Season with salt and pepper to taste. To serve, ladle into bowls and top each with a dollop of sour cream. Serve with hunks of bread."}]}