{"@context": "http://schema.org", "@type": "Recipe", "name": "Rao’s Chicken Scarpariello (Shoemaker’s Chicken)", "description": "Chicken scarpariello, also known as shoemaker's chicken, is a classic Italian-American dish of chicken, sausage, vinegar, onions and peppers that has all the flavors and textures: Tangy and rich, spicy and sweet, tender and crunchy. Our version is adapted from one found on the menu at Rao's, the reservations-impossible Southern Italian restaurant and celebrity hangout in Harlem. It starts with pan-frying chicken pieces and Italian sausage in a little olive oil until golden brown. Bell peppers, jalapeños, onion and garlic go into the pan and are sautéed until soft. All of that – plus hot peppers, potatoes, vinegar and wine – goes into a roasting pan and into a hot oven until the sauce thickens and the chicken is cooked through. (The potatoes are totally optional, by the way, but they are a nice, pillowy counterpoint to the prickly heat of the peppers.) Serve with a hunk of good bread to mop up the sauce.", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": "https://static01.nyt.com/images/2018/03/27/dining/27COOKING-RAOSCHICKEN2/27COOKING-RAOSCHICKEN2-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, poultry", "keywords": "chicken, sausage, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 513}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 890, "unsaturatedFatContent": "42 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "67 grams", "fiberContent": "4 grams", "proteinContent": "51 grams", "saturatedFatContent": "20 grams", "sodiumContent": "1297 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds bone-in, skin-on chicken thighs and breasts, breasts cut crosswise in half", "Kosher salt and freshly ground black pepper to taste", "2 tablespoons olive oil", "4 links Italian sausage (2 hot and 2 sweet), about 1 pound", "2 large bell peppers (red, yellow or green), seeded and cut into thin strips", "2 jalapeño peppers, halved lengthwise, seeded and cut into thin slices", "1 large sweet onion, cut in half lengthwise and sliced", "1 teaspoon minced garlic", "4 to 8 hot vinegared cherry peppers (or peppadew or pepperoncini), left whole", "2 to 3 small red potatoes, peeled, sliced and boiled until tender, but not mushy (optional)", "1/2 cup chicken broth", "1/2 cup dry white wine", "1/4 to 1/2 cup red wine vinegar, to taste", "1 tablespoon dried oregano leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Season chicken pieces with salt and pepper. Heat the oil in a large pot or Dutch oven over medium-high heat. In batches, brown the chicken, skin side down to start, about 5 minutes on each side. Remove the chicken to a plate. Add the sausage and sauté until brown, about 3 to 4 minutes. (They will not be cooked all the way through at this point.) Remove with a slotted spoon, cut into 1-inch slices and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove all but 2 tablespoons oil from the pot and sauté the bell peppers, jalapeños, onion and garlic until soft and beginning to brown, about 5 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the sausage to pot, add the cherry peppers, potatoes (if using), chicken broth, wine, vinegar, oregano and season with salt and pepper. Gently mix together, then transfer everything in the pot to a roasting pan. Nestle the chicken in the vegetables and sausage and roast in the oven until chicken is cooked through and sauce has reduced slightly, about 30 minutes."}]}