{"@context": "http://schema.org", "@type": "Recipe", "name": "Skirt Steak With Lentil Salad", "description": "This recipe came to The Times in 1990 in Pierre Franey's 60-Minute Gourmet column. A lentil salad (we used those tiny French green lentils, but you can use the standard supermarket variety as well) is dressed with a Dijon mustard vinaigrette, then topped with skirt steak that's been seared in a cast-iron pan. A simple sauce, made by deglazing the pan with butter, garlic and parsley, is drizzled over the top. It is classic Franey – uncomplicated, elegant and delicious.", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": "https://static01.nyt.com/images/2016/08/17/dining/17COOKINGRECIPE-STEAK1/17COOKINGRECIPE-STEAK1-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, steaks and chops", "keywords": "beef, lentils, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 195}, "recipeIngredient": ["8 cups water", "1 pound dried lentils", "1 cup finely diced carrots", "1 bay leaf", "3 sprigs fresh thyme, or 1 teaspoon dried", "Salt to taste", "1 tablespoon Dijon-style mustard", "3/4 cup vegetable oil", "1/4 cup red-wine vinegar", "1 cup finely chopped onions", "4 tablespoons chopped fresh tarragon or parsley", "Freshly ground pepper to taste", "4 skirt steaks, about 1/2 pound each, trimmed of excess fat", "1 tablespoon vegetable oil", "2 tablespoons butter", "2 teaspoons finely chopped garlic", "2 tablespoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the lentil salad, put the water in a large saucepan. Wash the lentils in a colander and add to the saucepan. Add the carrots, bay leaf, thyme and salt. Cover and simmer 20 to 25 minutes. Do not overcook. Drain and remove the bay leaf and thyme sprigs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl combine the mustard, 3/4 cup of oil and the vinegar, onions, tarragon, salt and pepper. Blend well with a wire whisk. Add the lentils and stir. Serve warm, lukewarm or cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the meat, sprinkle it on both sides with salt and pepper and brush with 1 tablespoon of oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron skillet large enough to hold two steaks over high heat, add the steaks and brown them for 3 minutes for medium-rare. Turn and continue cooking until they are thoroughly browned, about 3 minutes more. Remove to a warm platter. Repeat the procedure for the two remaining steaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the fat from the skillet and reduce the heat. Add the butter, garlic and parsley. Cook briefly, stirring. Add any juices from the platter and blend well. Pour the sauce over the steaks and serve with the lentil salad immediately."}]}