{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Pumpkin Seeds", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "chicken, pumpkin seeds, gluten-free, main course", "aggregateRating": null, "recipeIngredient": ["1 whole chicken, about 3 pounds", "Salt and pepper", "1 medium carrot, peeled and roughly chopped", "1 medium onion, peeled and roughly chopped", "1 celery stalk, trimmed and roughly chopped", "1 cup hulled pumpkin seeds", "3 or 4 ancho chilies", "4 cloves garlic, peeled", "Lime juice to taste", "Chopped cilantro leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chicken in a pot in which it fits snugly, with salt, pepper, carrot, onion, celery and water to barely cover. Cover, bring to boil and adjust heat for a steady simmer. Cook until chicken is almost done, about 40 minutes. (It's all right if some traces of blood remain.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toast seeds, if not already toasted, in a dry skillet over medium heat, shaking and stirring constantly for a minute or two, until seeds start to puff. (Overcooking will make sauce bitter; seeds may pop.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken; strain and reserve stock. Cool chicken, remove meat from bones, shred by hand. (This can all be done a day or so in advance.) Soak chilies in 3 cups of hot stock until tender, about 10 minutes. Remove stems and seeds and put the flesh in a blender, with pumpkin seeds, garlic and enough stock to let machine work; pur&#233;e."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sauce, chicken, the liquid in which the chilies soaked, and about a cup of the remaining stock (or a little water) in saucepan and cook gently until heated through and thick, 10 to 20 minutes. Add salt and pepper to taste and, just before serving, some lime juice. Garnish with cilantro. Serve with white rice."}]}