{"@context": "http://schema.org", "@type": "Recipe", "name": "Pili Pili (Spicy Herb Oil)", "description": "This spicy oil with an African name is popular throughout Provence. It’s usually on the table in pizzerias for drizzling, but it’s also terrific drizzled over vegetables, grilled meats or fish, grains and bread – whatever you want to add a kick to. In France it is made with very hot bird chilies. You could use fresh Thai chilies for this, but I’m using dried chiles de arbol, because that’s what I have on hand and it makes an oil that will last for months.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/06/science/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "1 to 1.25 cups oil", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "dried chili peppers, olive oil, healthy, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1060, "unsaturatedFatContent": "91 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "109 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "15 grams", "sodiumContent": "25 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["2 teaspoons dried oregano", "2 bay leaves, crumbled", "1 teaspoon fennel seeds (optional)", "4 sprigs fresh thyme", "2 sprigs fresh rosemary (optional)", "12 whole small dried red chili peppers or Japanese chilies, or about 8 chiles de arbol, broken in half, or 2 teaspoons red pepper flakes", "1 to 1 1/4 cups olive oil (does not need to be extra virgin), or a combination of olive oil and grapeseed oil, as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the herbs, chiles and oil in a medium saucepan and heat slowly over low heat until they begin to sizzle. If you insert a thermometer, the temperature should not go above 220ºF. Turn off the heat and wait for the oil to stop sizzling, then cover and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the herbs and chiles to a clean, sterilized bottle (you may need to use a funnel to do this neatly). Pour on the olive oil. Close tightly and allow to stand in a dark, cool place for a week to mature."}]}