{"@context": "http://schema.org", "@type": "Recipe", "name": "Puréed White Bean Soup With Pistou", "description": "White beans and pesto or pistou (pesto without the pine nuts) always make a nice marriage. Thin the pistou with a little extra olive oil so that you can drizzle it over the rich-tasting purée.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/13/science/16recipehealth/16recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H15M", "recipeYield": "6 servings.", "recipeCuisine": "", "recipeCategory": "one pot, soups and stews", "keywords": "appetizer, main course, gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegetarian, spring, winter, white beans", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "recipeIngredient": ["1 large onion, chopped", "4 garlic cloves, minced", "1 pound white beans, soaked for six hours (or overnight) and drained", "1 bay leaf", "1 sprig of fresh sage", "2 1/2 to 3 quarts water, as needed (or 2 1/2 quarts water and up to 2 cups milk as needed)", "Salt to taste", "Freshly ground pepper", "About 1/3 cup pistou", "Garlic croutons for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the onion, garlic, drained beans, bay leaf, sage and 2 1/2 quarts water in a large, heavy soup pot or Dutch oven and bring to a boil. Add salt to taste, reduce the heat to low, cover and simmer 2 hours, until the beans are very tender and the broth is fragrant. Remove the bay leaf and sage sprig."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, purée the soup (or you can use a regular blender, working in batches and placing a kitchen towel over the top to avoid splashing) until it is very smooth. Return to the pot, heat through, add freshly ground pepper and adjust salt. Thin out as desired with water or milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the soup into bowls. Stir the pistou, and if it is very stiff, thin out with a little olive oil so that you can drizzle it into each bowl and it won’t just fall in as a clump. Put about 2 teaspoons on each bowl, add a few garlic croutons if desired, and serve. Diners should stir the pistou into the soup for the best flavor."}]}