{"@context": "http://schema.org", "@type": "Recipe", "name": "Giant Limas With Winter Squash", "description": "I love the fact that beans, lentils and greens symbolize prosperity in the New Year in places as disparate as the American South and the South of France. I wonder if it’s really because lentils and beans are round like coins and swell when they cook, or if it’s because that’s about all anybody can afford to eat after the excesses of the holiday season. <br/><br/>The notion of thrift wouldn’t apply to some of the other foods that symbolize good luck or prosperity in certain cultures – fish, for instance, or saffron. I’ve taken traditions from different places this week and thrown some of them together, focusing mainly on lentils, beans, greens and fish. These are simple dishes that I hope will help you to begin 2012 on a happy, healthy note. Look for more New Year’s dishes  in the Recipes for Health index. <br/><br/>Baking in a slow oven is the best way to cook large lima beans, which can fall apart easily if boiled too hard. This dish is luxuriously creamy (though there’s no cream in it) and comforting.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/27/science/26recipehealth/26recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "4 to 6 servings.", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "fall, gluten-free, healthy, high fiber, low cholesterol, nut-free, vegetarian, lima beans, winter squash, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 344, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "17 grams", "proteinContent": "18 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1245 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "4 garlic cloves, minced", "1 pound (about 2 1/2 cups) dried giant lima beans, rinsed", "2 quarts plus 1 cup water", "A bouquet garni made with a bay leaf, a Parmesan rind and a sprig each of sage, thyme and parsley", "1 pound winter squash, peeled and cut in small dice", "Salt to taste", "Freshly ground pepper", "2 tablespoons slivered fresh sage leaves", "Freshly grated Parmesan for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees. Heat the olive oil over medium heat in a large, heavy ovenproof casserole or Dutch oven and add the onion. Cook, stirring often, until it is tender, about 5 minutes. Stir in half the garlic and cook, stirring, until it is fragrant, 30 seconds to a minute. Add the beans, water and bouquet garni and bring to a simmer. Cover and place in the oven for 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the casserole from the oven and stir in the remaining garlic, the winter squash, and salt to taste. If the mixture seems dry, add a little more water. Return to the oven and bake an hour longer, or until the beans and squash are very tender. Remove from the heat and remove the bouquet garni. Adjust salt, add pepper to taste and stir in the slivered sage."}]}