{"@context": "http://schema.org", "@type": "Recipe", "name": "Tacos With Roasted Vegetables and Chickpeas in Chipotle Ranchera Salsa", "description": "These winter vegetables sweeten with roasting and contrast beautifully with the chipotle-spiked cooked tomato salsa. It’s another easy do-ahead dish that can be reheated when the crowds are hungry.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/20/science/21recipehealth/21recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "6 servings.", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "fall, gluten-free, healthy, high fiber, nut-free, vegetarian, main course, tortilla, vegetables", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "43 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "9 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "792 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound butternut squash, peeled and cut in 3/4-inch dice", "2 medium turnips (about 10 ounces), peeled and cut in 3/4-inch dice", "1 medium fennel bulb, cored and cut in 3/4-inch dice", "2 tablespoons plus 1 teaspoon extra virgin olive oil", "Salt and freshly ground pepper to taste", "1 red onion, cut in 3/4-inch dice", "1 can chickpeas, drained and rinsed (optional)", "12 corn tortillas", "2 ounces queso cotija, queso fresco or feta", "1 small onion, cut in half, or .5 medium onion", "1 14-ounce can tomatoes, with juice", "1 or 2 serrano chilies or jalapeños (more to taste), seeded for a milder salsa, roughly chopped", "1 garlic clove, roughly chopped", "1 chipotle chili in adobo, stemmed", "1 tablespoon canola oil", "Salt to taste", "Water as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Cover a large sheet pan with foil, and oil the foil. Place all of the vegetables except the onions in a large bowl, season with salt and pepper and toss with the olive oil until all of the vegetables are coated. Spread in an even layer on the prepared pan. Place in the top third of the oven and bake 20 minutes, stirring halfway through. Meanwhile, rinse the onion, drain on paper towels and toss with a teaspoon of olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onions to the vegetables and toss together. Turn the heat down to 375, move the baking pan to the middle rack and continue to bake until the vegetables are lightly browned on the edges and tender all the way through when pierced with a knife, about 10 to 15 minutes. Transfer to a bowl and add the chickpeas if using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the salsa while the vegetables are roasting. Preheat the broiler. Line a baking sheet with foil and place the onion on it. Broil 5 to 10 minutes, turning once, until charred. Remove from the heat and when cool enough to handle, cut in large dice and place in a blender with the tomatoes, serranos, garlic and chipotle. Purée until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the canola oil in a heavy saucepan or skillet over medium-high heat until a drop of the puree sizzles immediately on contact. Add the purée, season to taste with salt and cook, stirring often, until the sauce darkens and thickens, leaving a canal when you run the cooking spoon across the bottom of the pan, about 15 minutes. If you want a thinner sauce, thin out with water as needed. Remove from heat. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the tortillas. Stir some of the salsa (to taste) into the vegetables. Spoon onto the tortillas, sprinkle on the cheese and serve, with more salsa as desired."}]}