{"@context": "http://schema.org", "@type": "Recipe", "name": "Tacos With Black Beans and Chard", "description": "If you are looking to feed a crowd, one way to meet the challenge is to pick up a supply of corn tortillas and make a big pot of beans and some other dishes that are at home in a taco. Buy some salsa, or make your own, and your house will be taco party central. You can make fillings in advance and arrange in bowls or on platters. Then all it takes is warming tortillas in a microwave, oven or steamer, and guests can assemble their own tacos. These beans are great in tacos, but can also be eaten on their own.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/19/health/nutrition/19recipehealth/19recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 to 8 servings. ", "recipeCuisine": "mexican", "recipeCategory": "dinner, lunch", "keywords": "black beans, tortilla, gluten-free, healthy, high fiber, low cholesterol, low-fat, low-sodium, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 90}, "recipeIngredient": ["1 pound black beans, soaked for 4 to 6 hours or overnight in 2 quarts water ", "1 onion, chopped ", "4 garlic cloves, minced ", "Salt to taste ", "1 bunch cilantro, roughly chopped ", "1/2 pound Swiss chard, stemmed, washed and roughly chopped", "12 to 16 corn tortillas ", "Fresh or bottled salsa", "2 to 3 ounces queso fresco, crumbled "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beans and their soaking water in a heavy soup pot or Dutch oven and bring to a boil. Skim away foam and add the onion and half the garlic. Reduce the heat, cover and simmer 1 hour. Add the remaining garlic, salt to taste and half the cilantro, cover and simmer for 45 minutes. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the Swiss chard, cover and simmer 10 minutes. The chard should be tender but still have some bright color. Stir in the remaining cilantro, taste and adjust salt. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm the tortillas. Top with a generous spoonful of beans with chard, a spoonful of crumbled queso fresco, and salsa if desired. "}]}