{"@context": "http://schema.org", "@type": "Recipe", "name": "Momofuku's Bo Ssam", "description": "This is a recipe to win the dinner party sweepstakes, and at very low stakes: slow-roasted pork shoulder served with lettuce, rice and a raft of condiments. The chef David Chang serves the dish, known by its Korean name, bo ssam, at his Momofuku restaurant in the East Village and elsewhere. He shared the recipe with The Times in 2012. Mr. Chang is known as a kitchen innovator, but his bo ssam is a remarkably straightforward way to achieve high-level excellence with little more than ingredients and time. Simply cure the pork overnight beneath a shower of salt and some sugar, then roast it in a low oven until it collapses. Apply some brown sugar and a little more salt, then roast the skin a while longer until it takes on the quality of glistening bark. Meanwhile, make condiments – hot sauces and kimchi, rice, some oysters if you wish. Then tear meat off the bone and wrap it in lettuce, and keep at that until everything’s gone.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2012/01/15/magazine/15eat1_span/15eat1_span-articleLarge-v4.jpg", "totalTime": "PT13H", "recipeYield": "6 to 10 servings", "recipeCuisine": "asian, korean", "recipeCategory": "dinner, roasts", "keywords": "main course, pork", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 2763}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1115, "unsaturatedFatContent": "45 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "69 grams", "fiberContent": "2 grams", "proteinContent": "71 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1684 milligrams", "sugarContent": "34 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 whole bone-in pork butt or picnic ham (8 to 10 pounds)", "1 cup white sugar", "1 cup plus 1 tablespoon kosher salt", "7 tablespoons brown sugar", "2 1/2 cups thinly sliced scallions, both green and white parts", "1/2 cup peeled, minced fresh ginger", "1/4 cup neutral oil (like grapeseed)", "1 1/2 teaspoons light soy sauce", "1 scant teaspoon sherry vinegar", "1/2 teaspoon kosher salt, or to taste", "2 tablespoons fermented bean-and-chili paste (ssamjang, available in many Asian markets, and online)", "1 tablespoon chili paste (kochujang, available in many Asian markets, and online)", "1/2 cup sherry vinegar", "1/2 cup neutral oil (like grapeseed)", "2 cups plain white rice, cooked", "3 heads bibb lettuce, leaves separated, washed and dried", "1 dozen or more fresh oysters (optional)", "Kimchi (available in many Asian markets, and online)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pork in a large, shallow bowl. Mix the white sugar and 1 cup of the salt together in another bowl, then rub the mixture all over the meat. Cover it with plastic wrap and place in the refrigerator for at least 6 hours, or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you're ready to cook, heat oven to 300. Remove pork from refrigerator and discard any juices. Place the pork in a roasting pan and set in the oven and cook for approximately 6 hours, or until it collapses, yielding easily to the tines of a fork. (After the first hour, baste hourly with pan juices.) At this point, you may remove the meat from the oven and allow it to rest for up to an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make the ginger-scallion sauce. In a large bowl, combine the scallions with the rest of the ingredients. Mix well and taste, adding salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the ssam sauce. In a medium bowl, combine the chili pastes with the vinegar and oil, and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare rice, wash lettuce and, if using, shuck the oysters. Put kimchi and sauces into serving bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When your accompaniments are prepared and you are ready to serve the food, turn oven to 500. In a small bowl, stir together the remaining tablespoon of salt with the brown sugar. Rub this mixture all over the cooked pork. Place in oven for approximately 10 to 15 minutes, or until a dark caramel crust has developed on the meat. Serve hot, with the accompaniments."}]}