{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Lentil Kofta With Spinach", "description": "These bite-size bulgur and lentil balls can be part of a mezze spread — an assortment of appetizers — or they can be served as a side dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/12/27/science/29recipehealtha/29recipehealtha-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings, about 30 kofta", "recipeCuisine": "middle eastern", "recipeCategory": "", "keywords": "appetizer, side dish, dairy-free, healthy, high fiber, low cholesterol, low-sodium, vegan, vegetarian, lentils, spinach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 170, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "519 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1/2 cup red lentils, rinsed", "1/2 onion", "2 garlic cloves, minced", "3 cups water", "Salt to taste", "1 12-ounce bunch spinach, stemmed, cleaned and roughly chopped, or 1 6-ounce bag baby spinach, stems removed, roughly chopped", "2/3 cup fine or medium (No. 1 or No. 2) bulgur", "2 tablespoons extra virgin olive oil", "1 teaspoon cumin seeds, toasted and ground", "1/2 teaspoon allspice, ground", "Aleppo pepper to taste (optional)", "Scallions, radishes, small romaine lettuce leaves and lemon wedges for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the red lentils, onion, garlic and water in a large saucepan and bring to a boil. Skim off any foam, reduce the heat, add salt to taste and simmer 30 minutes, or until the lentils are soft. Remove the onion half. Add the spinach and simmer for another minute, until it is wilted. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the bulgur into the pot, turn off the heat and cover. Let sit for 30 minutes, until the bulgur is tender and has absorbed all the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 2 tablespoons of the olive oil over medium-low heat and add the ground cumin and allspice. Stir for about 15 seconds, until fragrant, then stir into the lentil/bulgur/spinach mixture. Allow to cool, in the refrigerator if you’re leaving for more than an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Moisten your hands with water and knead the mixture in the bowl for 3 to 5 minutes, or stir with a rubber spatula. Each time it begins to stick to your hands, moisten them again. For a spicier mixture, add 1/4 to 1/2 teaspoon Aleppo pepper. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Moisten your hands and shape the mixture into walnut-size balls (about 1 inch). You’ll have to moisten your hands again whenever the mixture begins to stick to them. Place on a platter, garnish with scallions, radishes, romaine lettuce leaves and lemon wedges, and serve, or chill for several hours. Serve cold or at room temperature."}]}