{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea Scallops With Cider Glaze and Cauliflower Two Ways", "description": "", "author": {"@type": "Person", "name": "Floyd Cardoz"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/seascallops/seascallops-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "broccoli, cauliflower, scallops, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 603, "unsaturatedFatContent": "27 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "7 grams", "proteinContent": "33 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1944 milligrams", "sugarContent": "27 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 cups fresh apple cider", "1 teaspoon minced shallots", "1 teaspoon minced ginger", "1/2 inch piece dried pasilla or chipotle chile pepper", "3 tablespoons apple cider vinegar", "2 tablespoons canola oil", "1 teaspoon minced ginger", "2 tablespoon sliced shallots", "3 cups stalks and stems from cauliflowers and broccoli", "2 cups chicken or vegetable stock", "1/2 teaspoon Aleppo pepper flakes or hot red pepper flakes", "1/2 teaspoon ground cumin", "2 tablespoons canola oil", "3 cups cauliflower, cut into 1 1/2-inch florets", "3 cups Romanesco broccoli, purple cauliflower or other broccoli, cut into 1 1/2-inch florets", "1 cup thinly sliced red onion", "1 small sprig rosemary", "1 teaspoon minced ginger", "2 sprigs thyme", "20 large sea scallops", "1/4 cup canola oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the glaze: In a large saucepan, combine the apple cider, shallots, ginger, chile pepper and vinegar. Place over high heat until reduced to about 1/2 cup, about 15 minutes. Remove from heat, discard the chile, and season with salt and pepper. Set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the purée: Place a large saucepan over moderate heat. Add the canola oil and the cumin, and heat until shimmering. Add the shallots and ginger, and cook for 1 minute. Add the cauliflower trimmings and chicken stock. Bring to a boil and cover. Reduce heat to low and simmer for 5 minutes. Add Aleppo pepper and season with salt and pepper to taste. Transfer the trimmings to a food processor with about 1/2 the liquid. Process until smooth, adding liquid from the saucepan as needed to make a thick but pourable purée. Set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the roasted cauliflower: Place a medium skillet over moderate heat. Add the canola oil and the cauliflower and Romanesco broccoli. Stir, uncovered, until coated with oil, about 1 minute. Cover and continue to cook until beginning to soften, 4 to 5 minutes. Add the onion, ginger, rosemary and thyme. Stir, cover and cook for another 5 minutes. Season with salt and pepper to taste, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the scallops: Pat scallops dry with a towel. Heat a skillet over high heat; when hot, turn heat off and add oil. After a moment, add the scallops and return to high heat. Cook until well seared on each side, about 3 minutes a side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place some purée on one side of each of 4 plates. Top with the roasted cauliflower and broccoli. Place scallops on the other side. Drizzle with glaze."}]}