{"@context": "http://schema.org", "@type": "Recipe", "name": "Mashed Turnips and Potatoes With Turnip Greens", "description": "This is inspired by colcannon, an Irish mix of mashed potatoes and kale or cabbage. This lightened version is a mixture of two-thirds turnips and one-third potatoes, with the turnip greens stirred in at the end.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/01/03/science/05recipehealth/05recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4 to 6 as a side dish", "recipeCuisine": "", "recipeCategory": "", "keywords": "gluten-free, healthy, high fiber, low cholesterol, nut-free, vegetarian, potato, turnip, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 76}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 121, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "373 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 bunches turnips with greens attached (1 3/4 to 2 pounds, including greens)", "1 pound russet or Yukon gold potatoes, peeled and quartered", "Salt to taste", "1 to 2 tablespoons extra virgin olive oil", "1 leek, white and light green parts only, finely chopped", "2/3 cup low-fat milk, or as needed", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away the greens from the turnips. Peel the turnips and quarter if they’re large; cut in half if they’re small. Stem the greens and wash in 2 changes of water. Discard the stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the turnips and potatoes in a steamer set above 2 inches of boiling water. Steam until tender, 20 to 25 minutes. Remove from the steamer and transfer to a bowl. Cover the bowl tightly and leave for 5 to 10 minutes so that the vegetables continue to steam and dry out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the bottom of the steamer with water and bring to a boil. Add salt to taste and add the greens. Blanch for 2 to 4 minutes, until tender. Transfer to a bowl of cold water using a slotted spoon or skimmer, then drain and squeeze out excess water. Chop fine. Drain the water from the saucepan, rinse and dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in the saucepan and add the leek and a pinch of salt. Cook, stirring, until leeks are tender and translucent but not colored. Add the milk to the saucepan, bring to a simmer and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a potato masher, a fork or a standing mixer fitted with the paddle, mash the potatoes and turnips while still hot. Add the turnip greens and combine well. Beat in the hot milk and the additional tablespoon of olive oil if desired, and season to taste with salt and pepper. Serve hot, right away, or transfer to a buttered or oiled baking dish and heat through in a low oven when ready to serve."}]}