{"@context": "http://schema.org", "@type": "Recipe", "name": "Spinach and Garlic Omelet", "description": "You can use bagged baby spinach or stemmed and washed bunch spinach for this simple omelet with Mediterranean flavors. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/01/18/science/19recipehealth/19recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "1 serving. ", "recipeCuisine": "mediterranean", "recipeCategory": "breakfast, for one", "keywords": "eggs, spinach, gluten-free, healthy, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 99}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 262, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "1 gram", "proteinContent": "16 grams", "saturatedFatContent": "6 grams", "sodiumContent": "411 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ounces baby spinach or stemmed, washed bunch spinach (2 cups, tightly packed) ", "1 large or 2 small garlic cloves, minced or puréed ", "Salt and freshly ground pepper ", "2 eggs ", "2 to 3 teaspoons low-fat milk ", "2 teaspoons extra virgin olive oil ", "2 teaspoons freshly grated Parmesan "], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the spinach and wilt in a frying pan over medium-high heat. The water remaining on the spinach leaves after washing will be sufficient. Drain, allow to cool and squeeze out excess water. Chop medium-fine and toss with half the garlic and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the eggs into another bowl and beat with a fork or a whisk until they are frothy. Whisk in the remaining garlic, salt and pepper to taste and 2 to 3 teaspoons milk. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat an 8-inch nonstick omelet pan over medium-high heat. Add 2 teaspoons olive oil. Hold your hand an inch or two above the pan, and when it feels hot, pour the eggs into the middle of the pan, scraping every last bit into the pan with a rubber spatula. Swirl the pan to distribute the eggs evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As soon as the eggs are set on the bottom, sprinkle the spinach over the middle of the egg pancake and top with the Parmesan, then jerk the pan quickly away from you then back toward you so that the omelet folds over on itself. If you don’t like your omelet runny in the middle (I do), jerk the pan again so that the omelet folds over once more. Cook for a minute or two longer. Tilt the pan and roll the omelet out onto a plate. "}]}