{"@context": "http://schema.org", "@type": "Recipe", "name": "One-Pot French Onion Soup With Garlic-Gruyère Croutons", "description": "I don’t make onion soup at home partly because I lack the flameproof bowls that chefs run under the broiler to melt the cheese. And what’s the point of making onion soup without the elastic cap of gooey Gruyère? The more I pondered this, the more I wondered if I could skip those individual bowls, layer the croutons and cheese directly into the soup pot, and just broil the whole thing.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/12/17/dining/french-onion-soup/french-onion-soup-articleLarge.jpg", "totalTime": "PT5H", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, one pot", "keywords": "appetizer, gruyère, onion, oxtail, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 533}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 748, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "4 grams", "proteinContent": "59 grams", "saturatedFatContent": "19 grams", "sodiumContent": "1104 milligrams", "sugarContent": "8 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/4 cup extra-virgin olive oil", "4 pounds oxtail or beef shoulder, cut into 1- or 2-inch pieces", "Salt", "8 medium onions", "4 celery stalks, coarsely chopped", "4 medium carrots, peeled and coarsely chopped", "2 bay leaves", "4 thyme sprigs", "8 tablespoons (1 stick) unsalted butter", "Black pepper", "1 cup port wine", "Lemon juice, to taste, optional", "6 ounces baguette loaf, cut into 1/2-inch-thick slices", "2 garlic cloves, halved", "8 ounces Gruyère cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a 6-quart Dutch oven over high heat. Add the oxtail (or beef shoulder) in a single layer (work in batches, if necessary to avoid crowding the pan), and sear until the undersides are brown (do not turn). Season generously with salt and transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop two of the onions; add to the pot, along with the celery, carrots, bay leaves and thyme. Lower heat to medium and cook, stirring occasionally, until vegetables are soft and beginning to caramelize, about 10 minutes. Return the beef to the pot. Pour in 8 cups water. Simmer mixture gently until the meat is very tender, 2 1/2 to 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer beef to a bowl to cool for another use. Strain liquid into a bowl over a fine-mesh sieve; press gently on the solids with the back of a spatula to extract as much flavor as possible. Discard the solids; you should have about 10 cups broth (add water if necessary to equal 10 cups)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the remaining 6 onions through the root end, then peel and thinly slice them lengthwise. Melt the butter in the bottom of the Dutch oven over medium heat. Add the onions and cook, tossing occasionally, until deep golden-brown and caramelized, 45 minutes to 1 hour. Season with 1 teaspoon salt and black pepper. Pour in the port and cook, scraping up any browned bits from the bottom of the pan, for 3 minutes. Pour in the broth and simmer mixture over low heat for 30 minutes. Season with salt and lemon juice, if desired. (For a smaller group, you could refrigerate some of the soup and reheat it later.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the broth simmers, heat the oven to 350 degrees. Arrange the bread slices on a baking sheet and toast until golden, about 12 minutes. Rub the garlic halves over the surface of the bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler and arrange a rack 4 to 6 inches from the flame. Using a cheese slicer, thinly slice 3 ounces of Gruyère. Coarsely grate the remaining cheese. Float the broiled bread over the surface of the hot soup. Layer the cheese slices over the bread; scatter the grated cheese over it. Transfer the Dutch oven to the oven and broil until cheese is golden and bubbling, 3 to 5 minutes (watch to see that it does not burn)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, use kitchen shears or scissors to cut the bread and cheese into portions. Ladle soup, bread and cheese into individual bowls."}]}