{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Pepper Stew", "description": "This is an adaptation of a classic French bistro dish, poulet Basquaise. The chicken is cooked in a pipérade of onion, garlic, hot and sweet peppers, tomatoes and, in the authentic version, cured ham, which I’ve omitted. In this version I use skinned chicken pieces. Serve with noodles, rice or other grains.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/02/15/science/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT50M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "chicken, pepper, tomato, dairy-free, gluten-free, healthy, high fiber, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 406}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 746, "unsaturatedFatContent": "34 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "51 grams", "fiberContent": "9 grams", "proteinContent": "47 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1578 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 to 8 chicken legs and/or thighs, skinned", "Salt and freshly ground pepper", "1 tablespoon canola or vegetable oil", "1 tablespoon extra virgin olive oil", "1 large onion, cut in half lengthwise and then sliced across the grain", "2 mildly hot chilies, like Anaheim or New Mexico chilies, cored, seeded and cut in very thin strips, or 1/4 to 1/2 teaspoon hot red pepper flakes (optional)", "3 to 4 garlic cloves, thinly sliced", "1 1/2 pounds (4 large) mixed green and red bell peppers, cored, seeded and thinly sliced", "1 28-ounce can chopped tomatoes with juice, pulsed in a food processor", "Pinch of sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the chicken pieces and pat dry. Season with salt and pepper. Heat the canola or vegetable oil in a large, heavy skillet over medium-high heat, and brown the chicken pieces, in batches, on each side for about 5 minutes. Transfer to a bowl or plate. Pour off the fat from the pan and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to medium. Add the olive oil and the onion with a pinch of salt. Cook, stirring and scraping the bottom of the pan to deglaze, until the onions begin to soften. Continue to cook, stirring occasionally, until the onions are tender, about 5 minutes. Add the hot and sweet peppers, a bit of salt and the garlic, and cook, stirring, until the peppers begin to soften, about 5 minutes. Add the tomatoes and sugar and stir together until the tomatoes begin to bubble and smell fragrant, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken pieces to the pan. Cover and cook 25 to 30 minutes over medium-low heat, stirring at regular intervals and turning the chicken pieces over so that the ingredients don’t scorch and the chicken cooks evenly. The peppers should be very soft and the chicken quite tender. Add freshly ground pepper, taste and adjust the salt, and serve with rice, other grains of your choice or noodles."}]}