{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole-Duck Cassoulet", "description": "There is a clear order of operations to this cassoulet. Cut up the duck; remove the skin from the legs and refrigerate them overnight. At this point, you can make the stock or pick up the recipe the next day. But you’ll need the fat from the stock in order to make the confit. And you’ll use the fat from the confit to brown the meat. But this recipe isn’t that demanding; it just takes time. You can do it.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2012/02/26/magazine/26eat_span/26eat_span-articleLarge-v2.jpg", "totalTime": "PT5H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, project", "keywords": "duck, tomato, white beans, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 120}, "recipeIngredient": ["4 cups dried white beans", "1/2 pound not-too-smoky slab bacon", "Small bunch fresh parsley, leaves chopped, stems saved", "10 sprigs fresh thyme", "2 bay leaves", "1 teaspoon whole cloves", "Salt and black pepper", "1 pound boneless lamb shoulder, cut into 1-inch cubes", "Reserved fat, as needed", "2 medium onions, sliced", "<a href=\"https://cooking.nytimes.com/recipes/12321-duck-stock-and-confit\">Duck confit </a>", "8 garlic cloves, peeled", "2 cups <a href=\"https://cooking.nytimes.com/recipes/12321-duck-stock-and-confit\">duck stock</a>, plus more as needed", "4 cups chopped tomatoes", "1 tablespoon chopped garlic", "1/4 teaspoon cayenne", "1/2 pound garlicky sausage, preferably in one piece", "1 cup bread crumbs", "2 boneless duck breasts."], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 5 quarts of water to a boil in a large saucepan and add the beans. Remove from heat and let soak for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the bacon slab into 4 large chunks and cover in water in another saucepan; turn the heat to medium, and when the water boils, turn it down to a gentle simmer. Cook for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a bouquet garni by combining the parsley stems, thyme, bay leaves and whole cloves in a piece of cheesecloth and tying it into a bundle. (I never use cheesecloth myself but turn to my old tea ball, which is around for only this purpose.) Add it, along with the bacon, to the beans; bring to a boil, then lower the heat to a gentle simmer. Cook, skimming occasionally, until the beans are just tender, 45 to 90 minutes. (Add water if necessary; ideally the beans will be moist but not swimming when they're done.) Taste and adjust the seasoning if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the lamb with salt and pepper. Put 3 tablespoons reserved duck fat in a large pot over medium-high heat. When it's hot, add the lamb and brown the pieces well. Add the onions and cook, stirring occasionally, until soft, 5 or 6 minutes; turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the duck confit from the refrigerator and scrape off the fat; debone and shred the meat. Add the meat and garlic cloves to the pot with the lamb, along with 2 cups duck stock, tomatoes, chopped garlic and cayenne. Bring to a boil, then reduce the heat to a gentle simmer; cover. Cook, stirring occasionally, until the lamb is very tender, 1 to 1.5 hours. Taste and adjust the seasoning if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you're ready to assemble the cassoulet, discard the bouquet garni. Cut the fat from the meat and cut the meat into small pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons reserved duck fat in a medium skillet over medium-high heat, add the sausage and cook, turning as necessary until well browned; transfer to a cutting board and slice into quarter-inch rounds; don’t wash out the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375. Transfer a layer of beans to a large enameled cast-iron pot with a slotted spoon to leave behind most of the cooking liquid. Layer half of the sausage and bacon on top, then another layer of beans, then half the duck-and-lamb mixture; repeat the layers until you have used all the beans and meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pot over medium heat and bring to a simmer, uncovered, then turn off heat. Cover with bread crumbs and chopped parsley leaves and bake, uncovered, for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the cassoulet is in the oven, put the skillet used for cooking the sausage over medium-high heat. When it's hot, cook the duck breasts, skin-side down, until they release easily from the pan, 3 to 5 minutes. Turn and cook to rare, just another minute or 2. Remove the duck from the pan with a slotted spoon and pour the drippings from the pan over the cassoulet; reduce oven heat to 350."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cassoulet until it’s hot, bubbling and crusted around the edges, 30 to 40 minutes; add a little duck stock if it starts to look too dry. Slice the duck breasts on the diagonal and transfer them to the pot, tucking them into the bread crumbs. Cook until the breasts are medium rare, another 5 minutes or so, then serve."}]}