{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta and Broccoli Rabe Lasagna", "description": "This lasagna layers noodles, polenta, mozzarella, sauce and broccoli rabe for a wonderfully savory and multi-textured one-dish meal. A note about the lasagna noodles: You don’t have to boil them, nor do you have to buy special no-boil noodles. You can soak the noodles in a bowl of water while you prepare the other ingredients, then slap them in the casserole dish. They will start to soften in their cold bath and finish cooking as the lasagna bakes.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2012/03/28/dining/28APPE_SPAN/28APPE_SPAN-articleLarge-v3.jpg", "totalTime": "PT1H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles", "keywords": "broccoli rabe, lasagna noodles, polenta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 51}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 592, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "5 grams", "proteinContent": "23 grams", "saturatedFatContent": "18 grams", "sodiumContent": "703 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["18 dry lasagna noodles (from 1 package)", "3 tablespoons extra-virgin olive oil, plus more as needed", "4 garlic cloves, finely chopped", "1/8 teaspoon red chile flakes, plus more for serving (optional)", "1 28-ounce can or box chopped tomatoes", "2 tablespoons plus 1/2 teaspoon kosher salt", "1/4 cup finely chopped fresh basil", "1 large bunch broccoli rabe (about 1 1/2 pounds)", "1 1/4 cups quick-cooking polenta", "18-ounce container mascarpone or fresh ricotta", "4 ounces parmesan, finely grated (about 1 cup)", "2 tablespoons unsalted butter", "12 ounces fresh mozzarella, torn into bite-size pieces", "1/2 teaspoon black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lasagna noodles in a large bowl of cold water to soak (if you are using no-boil noodles, you can skip this step). Lightly oil a 9- by 13-inch baking pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons oil in a large skillet over medium-high heat. Add the garlic and chili flakes; cook until fragrant, about 30 seconds. Stir in the tomatoes and simmer over medium-low heat for 10 minutes. Stir in 1/2 teaspoon salt and the basil. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tough lower stem ends of the broccoli rabe. Cut the remaining stems, leaves and florets into 1-inch pieces. Fill a pot with 8 cups water and 2 tablespoons salt. Bring water to a boil and add the broccoli rabe. Cook 30 seconds, then use a slotted spoon to transfer broccoli rabe to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slowly whisk the polenta into the water. Simmer until polenta is thick and creamy, 5 to 10 minutes. Add the mascarpone or ricotta, 1/2 cup parmesan and the butter, and stir until combined. Stir in the broccoli rabe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees. Arrange a single layer of lasagna noodles in the bottom of the pan. Tear or break any pieces as needed to fit them in one layer, with no overlapping. Top with a third of the polenta mixture, half the tomato sauce and a third of the mozzarella. Arrange a second layer of lasagna noodles over the mozzarella. Repeat layering of polenta, sauce and mozzarella. Arrange a final layer of noodles over the cheese and finish with the remaining polenta and mozzarella. Scatter 1/2 cup parmesan and the black pepper over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer casserole to the oven. Bake until cheese is golden and bubbling, 30 to 40 minutes. Let stand 20 minutes before serving. Serve with more chili flakes scattered on top, if you like."}]}