{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetarian Spring Rolls With Kohlrabi", "description": "Spring rolls are quite easy to make, and make a light and delicious lunch, appetizer, side dish or snack. You can find the rice flour spring roll wrappers in Asian markets.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/03/06/science/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": " 7 spring rolls (4 to 5 inches long)", "recipeCuisine": "asian", "recipeCategory": "", "keywords": "appetizer, dairy-free, gluten-free, healthy, low cholesterol, low-fat, nut-free, vegan, vegetarian, kohlrabi, rice paper wrappers, tofu, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 162, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "0 grams", "sodiumContent": "374 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 3/4 ounces thin rice sticks", "6 ounces marinated tofu, cut in dominoes 1/2 inch wide by 1/4 inch thick", "1 medium carrot, shredded", "1/2 pound kohlrabi, peeled and shredded (make sure to remove fibrous layer just under the skin before shredding)", "Salt to taste", "1 tablespoon ginger, cut in julienne", "1 tablespoon seasoned rice vinegar", "1/4 cup roughly chopped cilantro, plus 14 sprigs", "2 tablespoons slivered Thai basil or mint leaves, plus 7 to 14 leaves", "7  8 1/2-inch rice flour spring roll wrappers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice sticks in a large bowl and cover with boiling water. Soak for 20 minutes, or until the noodles are pliable, and drain. Transfer the noodles to another bowl. Using kitchen scissors, cut the noodles in half, into roughly 6-inch lengths. Leave the warm water in the bowl for softening the wrappers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, toss the shredded kohlrabi with salt to taste and let sit in a colander placed in the sink for 20 to 30 minutes. Squeeze out excess liquid and toss with the carrot, ginger, chopped cilantro and slivered Thai basil or mint."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": " One at a time, place a rice flour wrapper in the bowl of warm water until just softened. Remove from the water and drain briefly on a kitchen towel. Place the softened wrapper on your work surface and put a line of tofu slices in the middle of the wrapper, slightly nearer the edge closest to you, leaving a 1 1/2-inch margin on the sides. Place a small handful of noodles over the tofu, then place a handful of the shredded vegetable mixture over the noodles. Lay a couple of sprigs of cilantro and a Thai basil leaf or a couple of mint leaves on top.  Fold the sides of the wrapper over the filling, then roll up tightly. Arrange on a plate and refrigerate until ready to serve."}]}