{"@context": "http://schema.org", "@type": "Recipe", "name": "Mussel Pizza", "description": "One bite of this and I’m transported to a seaside town in Italy or Provence. Keep some dough in the freezer and you can make this very quickly.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/03/health/nutrition/03recipehealth/03recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "1 14-inch pizza, serving 3.", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, pizza and calzones", "keywords": "healthy, high fiber, low cholesterol, nut-free, main course, mussels, pizza dough, tomato sauce, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "recipeIngredient": ["16 to 20 black mussels (about 10 to 12 ounces)", "1 whole-wheat pizza dough (1/2 batch, <a href=\"https://cooking.nytimes.com/recipes/1014328-pizza-with-green-garlic-potatoes-and-herbs\">see recipe</a>)", "3 tablespoons extra virgin olive oil", "2 large garlic cloves, minced or puréed", "3/4 cup canned crushed or puréed tomatoes", "Salt and freshly ground pepper", "1/4 cup chopped fresh parsley", "Dried red pepper flakes", "Dried oregano", "1/2 ounce Parmesan, freshly grated (2 tablespoons)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the mussels. Inspect each one carefully and discard any that have opened (if some are partly opened, tap them with your finger, and if they close back up they are O.K.) or have cracked shells. Place in a large bowl, fill the bowl with cold water and rinse several times, swishing the mussels around in the water, pouring out the water and refilling. Clean the shells, if necessary, with a brush or the end of one of the mussels, and pull out the beards – the hairy attachments emerging from the shells. Do not do this until just before cooking, or the mussels will die and spoil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees, preferably with a pizza stone in it. Roll out the pizza dough and place on a peel or on a lightly oiled pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1 cup water or white wine to a boil in a large saucepan, pot or lidded skillet, and add the mussels. Cover and steam until they open, 3 to 4 minutes, stirring the mussels after the first 2 minutes. Using tongs, transfer the mussels to a bowl and discard the water or wine from the pan. When the mussels are cool enough to handle, remove them from their shells and toss with 2 tablespoons of the olive oil, 1 of the garlic cloves, a pinch of red pepper flakes and half of the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the remaining garlic into the tomatoes and season to taste with salt and pepper. Brush the pizza dough, but not the rim, with the remaining tablespoon of olive oil. Spread the tomato sauce on the pizza and sprinkle with chili flakes and oregano or marjoram. Place in the hot oven and bake 10 minutes. Remove from the heat and arrange the mussels over the pizza. Pour on any marinade and return to the oven. Bake for another 10 minutes, or until the crust is brown and crispy on the edges. Remove from the heat, sprinkle with the remaining parsley and the Parmesan, and serve."}]}