{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Garlic, Chive and Red Pepper Frittata", "description": "Green garlic has a small window. At the beginning of the season the bulbs look more like leeks or spring onions than garlic, as they have not yet set cloves. To prepare them just cut away the stalks as you would a spring onion, cut them in half and remove any tough stalk that might be running down the middle, remove the papery outer layers and chop like a scallion or leek. Some farmers sell garlic scapes, the curly, green flowering end of the garlic plant. If you can’t find them at a farmers market, you can find recipes at several Web sites. They can be used in the same way you might use the green parts of scallions.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/14/health/nutrition/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, weekday", "keywords": "eggs, green garlic, ricotta, gluten-free, healthy, low-sodium, nut-free, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 208, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "314 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large red bell pepper, seeded and cut in small dice", "2 bulbs green garlic, trimmed of stalks and papery layers, sliced", "Salt ", "6 eggs", "1 cup whole-milk ricotta", "1/4 cup minced or snipped chives", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a heavy 10-inch nonstick skillet and add the bell pepper. Cook, stirring often, until it is tender, 5 to 8 minutes. Add the garlic and salt to taste and cook, stirring often, until tender, 2 to 3 minutes. Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Whisk in the ricotta, salt (about 1/2 teaspoon) and freshly ground pepper to taste. Stir in the chives and red pepper and garlic mixture. Clean and dry the pan and return to the burner, set on medium-high. Heat the remaining tablespoon of olive oil in the skillet. Hold your hand above it; it should feel hot. Drop a bit of egg into the pan, and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with a spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to low, cover and cook 10 minutes, shaking the pan gently every once in a while. From time to time remove the lid and loosen the bottom of the frittata with a wooden or heatproof spatula, tilting the pan, so that the bottom doesn’t burn. The eggs should be just about set on the bottom; cook a few minutes longer if they’re not. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Uncover the pan and place under the broiler, not too close to the heat, for 1 to 3 minutes, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly and puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking and allow it to cool for at least 5 minutes and for up to 15. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, at room temperature or cold"}]}