{"@context": "http://schema.org", "@type": "Recipe", "name": "Crisp Long Island Duck With Dates, Olives and Almonds", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dates, duck, main course", "aggregateRating": null, "recipeIngredient": ["Olive oil for greasing the pan", "2 whole Long Island ducks, trimmed of wing tips and excess fat", "4 teaspoons kosher salt", "Freshly ground black pepper to taste", "4 ribs celery, chopped", "1 large onion, peeled and roughly chopped", "1 small bunch fresh thyme, roughly chopped", "1 tablespoon olive oil", "16 fresh dates, pitted and thinly sliced", "1/3 cup pitted and sliced picholine olives", "1/4 cup cream sherry", "1/3 cup sliced almonds, toasted", "2 cups chicken broth, homemade or low-sodium canned", "1 tablespoon unsalted butter", "1 teaspoon sherry vinegar", "3 tablespoon chopped Italian parsley", "Kosher salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the duck, preheat the oven to 400 degrees. Lightly oil a large roasting pan. Season the ducks inside and out with salt and pepper. Combine the celery, onion and thyme and stuff the mixture into the cavities of the ducks. Put the ducks in the roasting pan breast side down. Roast for 40 minutes, pouring off the fat every 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the oven temperature to 450 degrees. Roast for 20 minutes. Turn the ducks breast side up and roast until the skin is brown and crisp, about 20 minutes longer. Let stand for 10 minutes before carving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the sauce, heat the olive oil in a large skillet. Add the dates and olives and saute until the dates soften, about 6 minutes. Deglaze the pan with the sherry, simmering until reduced by half. Stir in the almonds and chicken broth and simmer over medium heat until reduced by half, about 12 minutes. Stir in the butter, vinegar, 2 tablespoons of parsley, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the duck among 4 plates, drizzle with the sauce and sprinkle with the remaining parsley. Serve immediately."}]}