{"@context": "http://schema.org", "@type": "Recipe", "name": "Pickled Spring Onions and Asparagus", "description": "", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2012/05/16/dining/16CANNING/16CANNING-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 pints", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "asparagus, spring onions, vinegar", "aggregateRating": null, "recipeIngredient": ["1 teaspoon whole coriander seeds", "12 black peppercorns", "4 teaspoons kosher salt", "2 teaspoons red pepper flakes", "1 teaspoon yellow mustard seed", "4 whole allspice berries", "4 whole garlic cloves, peeled", "2 pounds freshly picked asparagus about the diameter of a pencil", "12 spring onions or scallions", "12 garlic scapes or ramps", "4 lemon slices", "3 1/2 cups white vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit a large pot with a rack or line it with a folded kitchen towel. Fill with water, and bring to a boil. Sterilize four 1-pint canning jars. by running them through a dishwasher cycle. If boiling them, add jars to the pot and boil for 10 minutes. The jars may be left in the dishwasher or pot until ready to be filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a small skillet over medium heat. Add the coriander seeds and stir until lightly toasted and fragrant. Divide equally among the four jars. Repeat with the peppercorns. To each jar add 1 teaspoon kosher salt, 1/2 teaspoon red pepper flakes, 1/4 teaspoon mustard seed, 1 allspice berry and 1 clove of garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the asparagus, spring onions and garlic scapes or ramps to fit the height of the jars, leaving 1/2-inch head space. Set aside the trimmed pieces for another use. Fit everything into the jars snugly; there is no rule about which end goes up, and the shape and size of the pieces can vary. Tuck a lemon slice into each jar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the canning rings in a small saucepan, cover with water and bring to a boil. Turn off the heat and add the lids to soften the rubber gaskets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine the vinegar with 3 1/2 cups water. Bring to a boil and funnel into the jars, leaving 1/2 inch of space at the top. Thoroughly wipe the rims of the jars. Using tongs, remove the lids from the hot water, place them on the jars, and screw the rings on snugly but not too tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the large pot of water to a rolling boil. Gently ease the filled jars upright into the water; the water should be at least 2 inches above the jars. Boil the jars for 15 minutes, then transfer to a kitchen towel to  cool. Listen for the ping that comes from the contracting lid as each jar cools, indicating a secure seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the jars are completely cool, remove the ring and test the seal by lifting the jar by the lid. If the seal fails, refrigerate the jar and use the contents within 6 weeks. Allow the pickles to mature for 1 month before serving."}]}