{"@context": "http://schema.org", "@type": "Recipe", "name": "Lasagna With Spinach and Roasted Zucchini", "description": "You may think of lasagna as a rich, heavy dish, but it needn’t be. There’s no need to compensate for the absence of a traditional Bolognese sauce by packing these casseroles with pounds of ricotta and grated cheese. Some of each of those elements is welcome, but I cut the usual amounts by half in this recipe, and it was plenty satisfying. You can get ahead on lasagna by making up big batches of marinara sauce and freezing it, or in a pinch use a good commercial brand. The noodles are no-boil, which really makes these lasagnas easy to assemble. They can be made ahead and reheated, or frozen.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/05/30/science/28recipehealth/28recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles", "keywords": "healthy, high fiber, nut-free, vegetarian, main course, marinara sauce, no-boil lasagna noodles, spinach", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1037}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 372, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "6 grams", "proteinContent": "21 grams", "saturatedFatContent": "7 grams", "sodiumContent": "862 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "2 medium zucchini, cut in half crosswise, then cut lengthwise into 1/4-inch-thick slices", "Salt and freshly ground black pepper to taste", "1 pound bunch spinach, washed and stemmed, or 1/2 pound bagged baby spinach", "3 cups marinara sauce, preferably homemade from fresh or canned tomatoes", "8 ounces ricotta cheese", "1 egg", "2 tablespoons water", "Pinch of cinnamon", "7 to 8 ounces no-boil lasagna", "4 ounces (1 cup) freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Toss the zucchini with the olive oil and season to taste with salt and pepper. Line a baking sheet with parchment paper and top with the slices of zucchini. Place in the oven and roast 8 minutes. Remove from the oven, close the oven door and, using tongs, flip the zucchini slices over. Return to the oven for 5 minutes, or until the zucchini is tender when pierced with a knife and browned in spots. Remove from the oven and reduce the heat to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the spinach for 2 to 3 minutes above an inch of boiling water, just until it wilts. Rinse briefly with cold water, squeeze out excess water and chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the ricotta cheese with the egg, water, cinnamon, salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil a rectangular baking pan.  Spread a small spoonful of tomato sauce to cover the bottom of the pan.  Top with a layer of lasagna noodles. Top the noodles with a thin layer of ricotta, then a layer of zucchini and spinach, a layer of tomato sauce and a layer of Parmesan. Repeat the layers, ending with a layer of lasagna noodles topped with tomato sauce and Parmesan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the baking dish tightly with foil and place in the oven. Bake 40 minutes, until the noodles are tender and the mixture is bubbling. Uncover and, if you wish, bake another 10 minutes, until the top begins to brown. Remove from the heat and allow to sit for 5 to 10 minutes before serving."}]}