{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Quinoa, Cauliflower and Fava Bean Salad", "description": "In addition to the protein and other nutrients present in quinoa, red quinoa also has antioxidant-rich phytonutrients called anthocyanins present in the red pigment. If you want a prettier, more intensely flavored cauliflower, take the extra step of roasting it (see variation below).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/06/15/health/15recipehealth/15recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "cauliflower, fava beans, red quinoa, gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "12 grams", "proteinContent": "14 grams", "saturatedFatContent": "1 gram", "sodiumContent": "630 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup red quinoa", "1 1/2 cups water", "Salt to taste", "1 1/2 pounds fava beans", "1/2 head cauliflower, broken into small florets ", "2 tablespoons chopped chives", "1 tablespoon freshly squeezed lemon juice", "1 tablespoon sherry vinegar", "1/2 teaspoon curry powder", "1 teaspoon Dijon mustard", "1 small garlic clove, puréed", "Salt to taste", "2 tablespoons grapeseed oil", "5 tablespoons buttermilk", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the quinoa in several changes of water. Heat a heavy medium-size saucepan over medium-high heat and add the quinoa. Stir until the water on the grains has evaporated and the quinoa begins to crackle and smell toasty. Add the water and salt to taste. Bring to a boil, cover and reduce the heat to low. Simmer 20 minutes, until some of the quinoa grains display a little white spiral and the water has been absorbed. Remove from the heat, place a dish towel over the top of the pot and return the lid. Let sit for 15 minutes. Fluff the quinoa with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, shell and skin the fava beans. Bring a medium pot of salted water to a boil. Fill a bowl with ice water. Drop the shelled fava beans into the boiling water and boil 5 minutes. Remove from the pot with a slotted spoon and transfer immediately to the cold water. Allow the beans to cool for several minutes, then slip off their skins by pinching off the eye of the skin and squeezing gently. Hold several beans in one hand and use your other thumb and forefinger to pinch off the eyes; have a bowl for the shelled favas close at hand, and this will not take a very long time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water in the pot back to a boil and drop in the cauliflower. Boil 3 to 5 minutes, until just tender. Transfer to a bowl of ice water, drain and dry on paper towels. Alternatively, steam the cauliflower for 4 to 5 minutes, or see the roasting variation below."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the dressing ingredients. Toss the quinoa, fava beans, cauliflower and chives in a bowl. Toss with the dressing and serve."}]}