{"@context": "http://schema.org", "@type": "Recipe", "name": "Butter-Poached Stone Fruit", "description": "Stone fruit is summer in your hand. To me, there isn’t a better unmessed-with food than a good, ripe peach. Still, stone fruit can be fun to play around with, and a recipe for one kind is a recipe for almost all. Peaches, nectarines, apricots, plums, mangoes and cherries all respond similarly to sautéing, poaching, macerating, grilling, roasting and drying. And once cooked, stone fruit goes with just about everything.\n\nThe length of cooking time will vary, depending mostly on the quality and ripeness of the fruit. Peel it if you like, or leave the skin on to retain texture and extra flavor. (Peeled fruit will cook through faster.) To peel, plunge fruit into boiling water for 10 to 20 seconds to loosen the skin, then slip it off. When you pit the fruit — and you will need to remove the stones for each of these recipes — do so over a bowl to catch the juice, and use it instead of water where needed.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT30M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "butter, fruit, sugar, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "recipeIngredient": ["2 1/2 cups sugar", "5 cups water", "1 stick butter", "Seeds of 1 vanilla bean", "1 1/2 pounds halved fruit (peaches, cherries, plums, nectarines, apricots or mangoes will work)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 2 1/2 cups sugar, 5 cups water, 1 stick butter and the seeds of 1 vanilla\nbean in a saucepan; bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 1 1/2  pounds halved fruit, reduce heat and cook\nuntil tender, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove fruit from liquid. Cool slightly and serve."}]}