{"@context": "http://schema.org", "@type": "Recipe", "name": "Plum Sorbet or Granita", "description": "Use ripe, juicy red plums for this spicy, wine-infused sorbet or granita.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/07/10/science/11recipehealth/11recipehealth-articleLarge-v3.jpg", "totalTime": "PT3H30M", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "ice creams and sorbets", "keywords": "dairy-free, gluten-free, healthy, low cholesterol, low-fat, low-sodium, nut-free, vegetarian, dessert, peppercorns, plum, red wine, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "recipeIngredient": ["125 grams (1/2 cup) red wine", "1 clove", "2 black peppercorns", "1 teaspoon vanilla", "83 to 100 grams (about 1/3 cup plus 1 teaspoon to 1/2 cup) sugar, to taste", "900 grams (2 pounds) ripe red plums, pitted", "20 grams (1 tablespoon) clover honey", "33 grams (1 tablespoon plus 2 teaspoons) corn syrup"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the red wine, clove, peppercorns, vanilla and sugar in a saucepan. Bring to a boil, reduce the heat and simmer 5 minutes. Remove from the heat and strain into a bowl. Allow to cool.  Blend the plums with the honey, corn syrup and wine syrup in a blender until smooth. Chill for 2 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you are making granita, place a 9-by-11-inch baking dish in the freezer. You may omit the corn syrup and reduce the sugar if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an immersion blender, blend the plum mixture for 30 seconds. If making sorbet, freeze in an ice cream maker following the manufacturer’s directions. If making granita, scrape into the chilled baking dish and place back in the freezer. Set the timer for 30 minutes. Using a fork, scrape the ice crystals from the outside of the baking dish toward the center. Return to the freezer and set the timer for another 30 minutes. Continue to scrape the mixture with a fork every 30 minutes until you have a uniform frozen mixture. It should not be frozen solid. If you forget to scrape and the mixture does freeze like an ice cube, cut into chunks and use a food processor fitted with the steel blade to break it up. Transfer to a container and freeze. Allow to soften for 15 minutes in the refrigerator before serving."}]}