{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta With Pomodoro Sauce", "description": "Cooking with your child is an act of relaxation, learning and intimacy. It’s love over a stove. For The Times, the New York chef Marco Moreira and his daughter, Francesca, cooked this simple dish together in 2012. It showcased the fresh tomato sauce they made and provides a recipe as appropriate to grandparents as their kin.\n\n", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": "https://static01.nyt.com/images/2014/03/17/dining/polentapomodro/polentapomodro-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "cheese, polenta, tomato, gluten-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 551, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "15 grams", "sodiumContent": "539 milligrams", "sugarContent": "4 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 tomatoes", "6  garlic cloves", "6 tablespoons olive oil", "3 tablespoons coarsely chopped fresh basil leaves", "Salt and pepper", "4 ounces Parmesan", "2 cups polenta, white or yellow, noninstant variety ", "1/4 pound butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: The adult brings a medium pot of water to a boil, reduces it to a simmer and prepares an ice bath for the tomatoes. Scoring each with an X, the adult slides the tomatoes into the simmering water for 15 to 20 seconds and then, using a slotted spoon, removes and places them in the ice bath for about 15 seconds. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the child has knife skills, he or she can use a paring knife to core the tomatoes and then peel the outer skin. The child cuts each tomato across the middle and squeezes each half to remove the seeds. The adult chops the tomato coarsely and slices the garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a large heavy-bottomed pan over medium heat, the adult heats the olive oil until it shimmers, then adds the garlic and cooks until fragrant but not browned, about 1 to 2 minutes. The adult adds the tomatoes, simmering until slightly thickened, about 30 minutes. The child stirs occasionally. The adult chops the basil coarsely and sets it aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the polenta: The child grates the Parmesan. The adult brings 6 cups of water to boil in a medium pot, reducing to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Under adult supervision, the child can slowly add the polenta. The adults stirs constantly until the polenta is thickened, between 10 and 40 minutes, depending on instructions on the box. As the polenta begins to thicken, the adult adds the cheese and butter. When finished, the polenta should come away from sides of the pan and be able to support a spoon. Serve topped with the tomato sauce and basil."}]}