{"@context": "http://schema.org", "@type": "Recipe", "name": "Caprese Antipasto", "description": "If you have ever eaten a Caprese salad and wished that you could linger with it longer, that there were more tomatoes to spear with your fork, or more milky slices of cheese on the plate, then this is the dish for you. Best at the height of tomato season, it embellishes on the classic Caprese, taking its five simple elements — mozzarella, tomatoes, basil, salt and olive oil — and adding roasted peppers, caperberries (or capers), olive and prosciutto. The result is a luscious lunch or light dinner that will make your dining companions swoon. You will wonder why you didn’t think of it sooner. Serve with a crusty loaf of bread on the side.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2018/08/23/dining/caprese-antipasto-2/caprese-antipasto-2-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "quick, weeknight", "keywords": "appetizer, side dish, mozzarella, prosciutto, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 242}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 333, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "4 grams", "proteinContent": "21 grams", "saturatedFatContent": "11 grams", "sodiumContent": "775 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2  ripe bell peppers, 1 red and 1 yellow if possible", "Salt and pepper", "Extra-virgin olive oil", "1 pound fresh mozzarella, at room temperature", "2 pounds ripe tomatoes, in assorted colors if possible", "1/2 pound cherry tomatoes, in assorted colors if possible", "Handful of caperberries, or 1 tablespoon large capers, rinsed", "Handful of good-quality olives", "6 thin slices of prosciutto, more if desired", "Handful of basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To roast peppers, set them directly in the flames of a stovetop gas burner turned to high, or over hot coals if you happen to be grilling. (You could also roast under the broiler, with peppers as close to heat source as possible.) Turn peppers with tongs until skins are blackened and blistered all over, 5 to 7 minutes. Remove to a plate and let cool. To peel, cut peppers lengthwise. Scrape seeds and veins away with your knife, then turn peppers over and scrape away charred skin. Slice peeled peppers into 1/2-inch ribbons and place in a small bowl. Season with salt and pepper, then add 1 tablespoon olive oil and toss. (Peppers may be roasted up to a day ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut mozzarella into 1/4-inch slices. Cut tomatoes into 1/2-inch slices and halve cherry tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange mozzarella slices in the center of a large platter. Surround with tomatoes and sprinkle lightly with salt. Add roasted pepper strips, caperberries and olives. Drape prosciutto around the platter. Garnish with basil leaves. Drizzle generously with olive oil and serve."}]}