{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Sesame Chicken and Eggplant Salad", "description": "This is a salad that is French by design and Chinese by flavor. The ginger and sesame notwithstanding, it is essentially very much like a salade composée, a “composed salad” where the ingredients are arranged and dressed but not tossed, with grilled chicken breast and a zesty vinaigrette. The jalapeño is optional, so you can turn down the heat.", "author": {"@type": "Person", "name": "David Tanis"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11chiksalad/11chiksalad-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "asian", "recipeCategory": "salads and dressings", "keywords": "chicken, cucumber, eggplant, dairy-free, gluten-free, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 157}, "recipeIngredient": ["4 boneless skin-on chicken breasts, about 8 ounces each", "Salt and pepper", "2 large eggplants, about 2 pounds", "1 tablespoon grated ginger", "1 tablespoon grated garlic", "2 tablespoons soy sauce", "3 tablespoons roasted peanut oil", "1 teaspoon sesame oil", "2 tablespoons rice wine", "1/2 teaspoon Chinese chile paste or 1/4 teaspoon cayenne", "2 teaspoons rice vinegar", "1 teaspoon grated ginger", "1 teaspoon brown sugar", "2 teaspoons Dijon mustard", "1 teaspoon sesame oil", "3 tablespoons roasted peanut oil", "1/2 teaspoon kosher salt", "1 tablespoon lime juice", "Bibb or Romaine lettuce leaves", "1 pound small cucumbers, peeled and cut in 1/4-inch slices", "1/2 cup thinly sliced scallions", "3/4 cup cilantro, leaves and tender stems, roughly chopped", "2 tablespoons toasted sesame seeds", "1 jalapeño, green or red, thinly sliced, optional", "Lime wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tenderloins from the underside of the chicken breasts and reserve for another purpose. Trim breasts if necessary and flatten them slightly with a meat mallet. Season on both sides with salt and pepper and place in a shallow dish. Using a clean knife and cutting board, peel eggplant and cut into 1/2-inch slices, then season with salt and pepper. Place eggplant slices in a separate shallow dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the marinade: stir together ginger, garlic, soy sauce, peanut oil, sesame oil, rice wine and chile paste in a small bowl. Pour half the marinade over chicken and remaining marinade over eggplant, turning over to coat well. Leave at room temperature for 30 minutes. (You may do this step up to 2 hours ahead and refrigerate. Return to room temperature before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the vinaigrette: whisk together rice vinegar, ginger, brown sugar, mustard, sesame oil, peanut oil, salt and lime juice. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a stovetop grill pan over medium-high heat, or use a charcoal or gas grill. Grill eggplant slices until nicely browned and softened, about 3 minutes per side. Remove and hold at room temperature. Lay chicken breasts on the grill skin side down and let cook until nicely browned, about 5 minutes. Turn and cook on the other side until firm to the touch, about 2 minutes more. Remove breasts to a platter and let rest 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large platter with lettuce leaves. Cut chicken into 1/4-inch slices and arrange over lettuce. Arrange grilled eggplant around the platter. Lightly salt cucumbers and dress with 1 tablespoon vinaigrette, then scatter over salad. Spoon the rest of the vinaigrette evenly over salad. Top with scallions and cilantro, and sprinkle with sesame seeds. Garnish with optional jalapeño slices and lime wedges and serve."}]}