{"@context": "http://schema.org", "@type": "Recipe", "name": "Raspberry Chocolate Almond Spread", "description": "This berry-tella is spectacular on a biscuit or a piece of toast, or warmed over ice cream, but a good portion will likely be consumed right from the jar while standing in front of the refrigerator.", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2012/08/15/dining/15RASPBERRY_SPAN/15RASPBERRY_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 half-pint jars (4 cups).", "recipeCuisine": "", "recipeCategory": "", "keywords": "almonds, chocolate, raspberries, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1183, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "222 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "23 grams", "proteinContent": "13 grams", "saturatedFatContent": "11 grams", "sodiumContent": "11 milligrams", "sugarContent": "193 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pints ripe raspberries, picked over but not rinsed", "3 cups sugar", "2 tbsp lemon juice", "8 ounces best-quality bittersweet chocolate, chopped", "1/8 teaspoon almond extract", "1 cup toasted slivered almonds, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fit a large pot with a rack, or line with a folded kitchen towel. Fill with water and bring to a boil. Add 4 half-pint canning jars and boil for 10 minutes. Jars may be left in the warm water in the pot until ready to be filled. (Alternatively, sterilize jars by running them through a dishwasher cycle, leaving them there until ready to fill.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off heat and add lids to soften their rubber gaskets. Rings and lids may be left in the water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy pan, combine raspberries and sugar. Bring to a simmer, stirring, until sugar has dissolved. Put raspberry-sugar mixture through the fine disk of a food mill or press through a fine sieve to remove seeds. Some seeds may remain; don't worry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return mixture to pan, add lemon juice, and bring back to a boil. Boil, stirring constantly, for 5 minutes. Add chocolate and stir well until completely melted. Boil hard for five minutes, stirring all the while. Turn off the heat, wait a minute or two, then push against the mixture. If the surface of the jam wrinkles a bit, it is the correct consistency. If not, return to the heat for another minute or two and try the wrinkle test again. Add almond extract and almonds and stir to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle hot preserves into the warm jars, leaving 1/4 inch at the top, just below the first ring on the jar’s neck. Wipe jar rims clean with a damp towel. Place lids on jars, screw on rings and lower jars back into the pot of boiling water. Return to a full boil and boil the jars for 10 minutes. Transfer jars to a folded towel and allow to cool for 12 hours; you should hear them making a pinging sound as they seal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test the seals by removing rings and lifting jars by the flat lid. If the lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within a month, or reprocessed. (Rings and jars may be reused, but a new flat lid must be used each time jars are processed.) To reprocess, reheat filling to boiling point (as in Step 4), then continue as before."}]}