{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Shrimp With Wilted Spinach and Peaches", "description": "The first principle of Indian spice cookery (and of spices in general) is that spices are best when bought whole and ground fresh, as happens in this recipe. Toasting and then grinding the spices — peppercorns, coriander, mustard seeds and cardamom pods —  used for the spice rub helps to even out their flavors so that they blend with the mild flavor of the shrimp. Serve them over fresh ripe peaches and tender spinach wilted by a hot mixture of ginger, vinegar, orange juice and curry powder.", "author": {"@type": "Person", "name": "John Willoughby And Chris Schlesinger"}, "image": "https://static01.nyt.com/images/2014/03/05/dining/05shrimp/05shrimp-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 appetizer servings", "recipeCuisine": "indian", "recipeCategory": "dinner, quick, weekday", "keywords": "dairy-free, main course, peach, shrimp, spinach, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 196}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 229, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "20 grams", "saturatedFatContent": "1 gram", "sodiumContent": "810 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon white peppercorns (you may substitute black)", "1 tablespoon coriander seeds", "1 tablespoon mustard seeds", "5 green cardamom pods", "1 pound 16- to 20-count (extra large) shrimp, peeled and deveined but tail left on", "Kosher salt and pepper to taste", "2 tablespoons olive oil", "1 tablespoon chopped fresh ginger", "1/4 cup red wine vinegar", "1/4 cup orange juice", "1 teaspoon curry powder", "2 ripe but firm peaches, diced medium", "1 pound spinach, washed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Build a fire in your grill; when the coals are covered with gray ash and the temperature is medium-hot (you can hold your hand 5 inches above the coals for 3 to 4 seconds) you are ready to cook. (For a gas grill, turn all burners to high, lower cover and heat for 15 minutes, then turn burners to medium-high.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the peppercorns, coriander seeds, mustard seeds and cardamom pods in a small sauté pan and toast over medium heat, shaking frequently to avoid burning, until they begin to darken slightly and you can smell them, about 2 minutes. Remove from heat, allow to cool slightly, then grind fine in a spice mill or mortar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle shrimp generously with salt and pepper, then rub all over with the spice mixture, pressing gently to be sure it adheres. Set shrimp aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a small sauté pan over medium heat until hot but not smoking. Add the ginger and cook, stirring frequently, 1 minute. Add the vinegar, orange juice, curry powder and salt and pepper to taste. Bring to a simmer, then reduce heat and cook, stirring occasionally, for 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the peaches and spinach in a medium bowl. Pour hot dressing over them, wilting the spinach."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the shrimp on the grill and cook until just opaque throughout, 3 to 4 minutes a side. (To check for doneness, cut into one shrimp and peek inside.) Divide the spinach-peach mixture among four plates and top each with 1/4 of the shrimp."}]}