{"@context": "http://schema.org", "@type": "Recipe", "name": "Arborio and Red Rice Risotto With Baby Broccoli and Red Peppers", "description": "Baby broccoli has thinner stems than regular broccoli and long, feathery flowers that cook up nicely in this mixed-rice risotto.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/04/science/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "6 generous servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "broccoli, red pepper, rice, dairy-free, gluten-free, healthy, low cholesterol, low-sodium, nut-free, vegan, vegetarian, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 372, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "366 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 cup short or medium-grain non-sticky red rice, like Bhutanese rice (3 cups cooked)", "6 cups well-seasoned chicken or vegetable stock, as needed", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "1/4 to 1/2 teaspoon red pepper flakes, to taste", "1 red pepper, cut in small dice", "2/3 cup arborio rice", "1 to 2 garlic cloves (to taste), minced", "1/2 cup dry white wine, like pinot grigio or sauvignon blanc", "3/4 pound baby broccoli, stems peeled and sliced, flowers torn apart into smaller pieces by hand", "Freshly ground pepper to taste", "1/4 to 1/2 cup freshly grated Parmesan cheese (1 to 2 ounces, optional)", "2 tablespoons minced flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the red rice, combine with 2 cups water in a saucepan, add salt to taste and bring to a boil. Reduce the heat, cover and simmer 30 to 40 minutes, until all of the liquid has been absorbed by the rice. Remove from the heat, remove the lid from the pan and place a dish towel over the pan, then return the lid. Let sit for 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the stock or broth into a saucepan and bring it to a simmer over low heat, with a ladle nearby or in the pot. Make sure that it is well seasoned. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy nonstick skillet or saucepan. Add the onion and a generous pinch of salt, and cook gently until it is just tender, about 3 minutes. Add the red pepper flakes and the red bell pepper and continue to cook, stirring often, for another 5 minutes, until tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the arborio rice and the garlic and stir until the grains separate and begin to crackle. Add the wine and stir until it has been absorbed. Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice, and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock and continue to cook in this fashion, stirring in more stock when the rice is almost dry. You do not have to stir constantly, but stir often. After 10 minutes, stir in the broccoli stems and flowers and continue to add broth and stir the rice for another 10 minutes or so, until the broccoli is crisp-tender. When the rice is just about tender all the way through but still chewy, add another ladleful of stock and the red rice. Season to taste with salt and pepper. Stir together for a couple of minutes, until the stock is just about absorbed, and add another ladleful of stock, the Parmesan and the parsley, and remove from the heat. The mixture should be creamy (add more stock if it isn’t). Stir for about half a minute, then serve in wide soup bowls or on plates."}]}