{"@context": "http://schema.org", "@type": "Recipe", "name": "Master Shortbread Recipe", "description": "If you use half a pound of butter in a batch of cookies, it becomes “short” — because “short” means, historically, pastry with a high percentage of fat. Thus shortbread cookies are — when correctly made — rich, crumbly and impossible to resist. In their simplest form, they taste mostly of sweet and sweetened butter, so the best butter you can lay your hands on will make a difference here. I like that side-of-the-tongue tingling presence of saltiness, and so I tend to use a little more salt than is strictly necessary, hence the range in the recipe.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2012/09/09/magazine/09eat1/09eat1-articleLarge-v3.jpg", "totalTime": "PT40M", "recipeYield": "", "recipeCuisine": "british", "recipeCategory": "", "keywords": "butter, flour, sugar, dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 170}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 265, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "10 grams", "sodiumContent": "100 milligrams", "sugarContent": "13 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 pound unsalted butter, at room temperature", "3/4 cup sugar", "1 egg yolk", "1 1/2 cups all-purpose flour", "1/2 cup cornstarch", "1/2 to 1/4 teaspoon salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use an electric mixer on low speed to combine the butter and sugar, about 30 seconds. Keeping the speed on low, beat in the egg yolk, then the flour, cornstarch and salt, until the mixture barely holds together. Don’t overbeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make shapes, form the dough into a ball, wrap in plastic and freeze or refrigerate for at least 30 minutes, until firm. Roll it out on a lightly floured surface until it is 1/4 inch thick. Cut into any shapes you like, then put the cookies on an ungreased baking sheet. Chill for at least 1 hour. Alternatively, shape the dough into a round, triangular or rectangular log and refrigerate or freeze until firm, at least 30 minutes. Slice 1/4-inch cookies and put on the baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 275. Bake the cookies until just firm but still quite tender and not at all brown, about 30 minutes. Cool for a minute on the sheet before using a spatula to transfer the cookies to a rack to finish cooling."}]}