{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttermilk-Marinated Lamb with Mustard Seeds and Savory", "description": "This recipe comes from Diane St. Clair, a dairy farmer in Vermont. It uses a buttermilk marinade both to flavor the meat and to tenderize it slightly. A wet rub of mustard and savory gets slathered onto the meat before it’s roasted: divine.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 712, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "1 gram", "proteinContent": "62 grams", "saturatedFatContent": "20 grams", "sodiumContent": "984 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 quart buttermilk", "6 garlic cloves, minced ", "Kosher salt and black pepper", "1 leg of lamb, butt portion only, bone in or boneless (about 7 pounds total)", "3 tablespoons whole-grain mustard", "1 tablespoon dried savory or thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large deep bowl or a large sealable plastic bag, combine buttermilk, garlic and 1 teaspoon salt. Add lamb, turn to coat, and marinate in the refrigerator for at least 8 hours or up to 24 hours, turning occasionally. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 and remove lamb from refrigerator. In a small bowl, combine mustard and savory. Remove lamb from marinade and pat dry; discard marinade. Season lamb well with salt and pepper and slather with mustard mixture. Place on a rack in a roasting pan. Roast for about 1 1/2 hours, until the internal temperature registers about 155 on a meat thermometer (for medium). For the last 15 minutes of cooking, raise heat to 400 or turn on convection (or both) to brown the outside of the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from oven, cover lightly with foil and set aside to rest at least 15 minutes before slicing."}]}