{"@context": "http://schema.org", "@type": "Recipe", "name": "Couscous With Chickpeas, Spinach and Mint", "description": "Spinach and chickpeas are a popular combination throughout the Mediterranean. This is one of my favorite couscous tagines. You can also use sturdier greens like chard. If you do use chard, simmer for 10 to 15 minutes rather than the 5 minutes required for spinach. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/09/18/health/nutrition/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT25M", "recipeYield": "6 to 8 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner", "keywords": "chickpea, couscous, spinach, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 237}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 446, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "12 grams", "proteinContent": "20 grams", "saturatedFatContent": "1 gram", "sodiumContent": "504 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large onion, chopped", "Salt, preferably kosher, to taste", "2 to 4 large garlic cloves (to taste), minced  ", "2 teaspoons coriander seeds, lightly toasted and ground", "3/4 teaspoon caraway seeds, lightly toasted and ground", "1 1/2 teaspoons paprika", "1/2 teaspoon cayenne (more to taste)", "2 cups chickpeas, soaked in 2 quarts water for 6 hours or overnight and drained", "A bouquet garni consisting of 8 sprigs each parsley and cilantro", "2 tablespoons tomato paste", "1 tablespoon harissa (more to taste), plus additional for serving", "1 1/2 pounds spinach, stemmed and washed thoroughly, or 2 6-ounce bags baby spinach", "2 to 4 tablespoons chopped fresh mint (to taste)", "2 to 2 2/3 cups couscous (1/3 cup per serving)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large, heavy soup pot or Dutch oven over medium heat and add the onion. Cook, stirring, until it is tender, about 5 minutes, and stir in a generous pinch of salt, the garlic and the spices. Stir together for about half a minute, until the garlic is fragrant, and add the drained chickpeas, 2 quarts water and the bouquet garni. Bring to a gentle boil, reduce the heat, cover and simmer 1 hour. Add the tomato paste, the harissa and salt to taste. Bring back to a simmer and simmer 45 minutes to an hour, until the chickpeas are tender. Remove 1 cup of the broth to flavor the couscous."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reconstituting and steaming the couscous: In a large microwave-safe bowl combine the couscous and salt to taste. Drizzle the remaining olive oil over the couscous and add the cup of broth you removed from the stew. Stir well, or moisten your fingers and rub the couscous with them to evenly distribute the oil and broth. Add enough water to cover by 1/2 inch and let sit for 20 minutes, or until all of the liquid is absorbed. Stir every 5 minutes with a wooden spoon or rub the couscous between your moistened thumbs and fingers, so that the couscous doesn't lump. The couscous will now be fairly soft; fluff it with a fork or with your hands. The traditional way to finish reconstituting the couscous is to place it above the simmering stew for 45 minutes. I find, however, that steaming it in a microwave results in perfectly fluffy couscous. Cover the bowl tightly with plastic and pierce the plastic with the tip of a paring knife. Heat at 100 percent power for 3 minutes. Remove from the microwave carefully and allow to sit for 1 minute. Carefully remove the plastic and fluff with forks or a spoon. Cover again with plastic and microwave for 2 to 3 more minutes. Be very careful when you remove the plastic as the couscous will be steamy. You can reconstitute the couscous a day ahead and reheat in the microwave shortly before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, stir in the spinach and the mint. Simmer 5 minutes. Taste and adjust seasonings. The stew should be spicy and flavorful. Serve the couscous in wide bowls or mound onto plates and top with the stew. Pass more harissa at the table."}]}