{"@context": "http://schema.org", "@type": "Recipe", "name": "Nectarine and Peach Jam With Lemon Verbena", "description": "This is refrigerator jam, allowing you to skip the fuss and time of canning. Here, you’ll use a method from Christine Ferber, one of France’s eminent jam makers. She calls for macerating the fruit in sugar overnight so the juices release, then straining the liquid from the bowl and cooking that down to a syrup before re-adding the fruit. That allows you to cook the fruit less, retaining a better texture and fresher flavor. It works beautifully with this combination of peaches and nectarines spiked with lemon verbena.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/06/09/dining/nectarinejam2/nectarinejam2-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "3 half-pint jars", "recipeCuisine": "", "recipeCategory": "breakfast, condiments", "keywords": "lemon verbena, nectarine, peach, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1100, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "284 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "14 grams", "proteinContent": "7 grams", "saturatedFatContent": "0 grams", "sodiumContent": "103 milligrams", "sugarContent": "257 grams", "transFatContent": null}, "recipeIngredient": ["1 lemon", "3 pounds ripe nectarines or peaches, or a mix, pitted and sliced", "730 grams sugar (3 and 1/4 cups)", "Pinch salt", "10 sprigs fresh lemon verbena"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate zest from half the lemon and place zest in a large saucepan. Juice lemon and add the juice to the zest. Toss in fruit, sugar, salt and lemon verbena and bring to a simmer. Turn mixture into a large bowl and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, if you plan to can the jam, prepare the jars <a href='http://www.nytimes.com/2012/09/19/dining/canning-jam-from-preparing-the-jars-to-testing-the-seal.html'>according to the instructions here</a>."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the liquid from the mixture into a wide, shallow pot or large skillet, reserving the fruit. Bring liquid to a simmer and cook until it thickens enough to wrinkle on the surface when you push it with a spoon (a candy thermometer should read 220 degrees)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove lemon verbena from fruit and add fruit to the pot with the syrup. Simmer fruit gently until mixture looks very thick and jamlike. You can test the jam to see if it’s ready by freezing a small plate. Drop a bit of the jam on the plate, let it cool for a minute and then push it with your finger. The top should wrinkle. If syrup is thin and runny, keep cooking and test again in a few minutes (return plate to freezer in the meantime)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If canning, spoon into hot sterilized jars and process as directed. Otherwise, let jam cool, then store in refrigerator or freezer."}]}