{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti alla Norma", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/09/19/dining/19PAIR_SPAN/19PAIR_SPAN-articleLarge-v2.jpg", "totalTime": "PT2H40M", "recipeYield": "6 first-course or 4 entree servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "eggplant, spaghetti, tomato, fall, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 51}, "recipeIngredient": ["2 medium eggplants, about 12 ounces each, cut in 1-inch cubes", "Salt", "2/3 cup extra virgin olive oil", "2 pounds ripe plum tomatoes, very finely chopped", "2 garlic cloves, minced", "1/4 cup basil leaves, torn", "1 pound spaghetti", "Crushed red chile flakes, to taste", "2 ounces coarsely grated ricotta salata"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place eggplant in a colander, salt generously, set colander over a bowl and let sit at room temperature about 2 hours to draw off excess liquid. Rinse eggplant and dry on paper towels. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large skillet on medium-high and saut&eacute; eggplant, in batches if necessary, until golden. Transfer to several thicknesses of paper towel. Pour off and reserve all but a fine slick of oil from the pan. Reheat pan on medium, add tomatoes and garlic and cook, stirring occasionally, until tomatoes are reduced and their liquid has evaporated. Fold in basil. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to a boil for the spaghetti. Cook until al dente. Drain, reserving about 1/2 cup pasta water. Add pasta to tomato sauce. Return eggplant to pan and cook on low, mixing pasta with sauce ingredients. Add the remaining 2 tablespoons of oil, season with salt and chile if desired and moisten with some pasta water if needed. Divide among plates or shallow bowls, scatter cheese on top and serve."}]}