{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Eggplant With Spiced Chickpeas", "description": "Eggplant is a staple in the Arab world, the source of the dish called moussaq’a, a classic (and vegan to boot, if you leave off the yogurt). The key to cooking eggplant is to do it with high heat that concentrates the flavor and the flesh.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2012/09/26/dining/26EGGPLANT_SPAN/26EGGPLANT_SPAN-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "8 to 12 servings", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, weekday", "keywords": "chickpea, eggplant, pine nuts, fall, halal, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 193}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 338, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "11 grams", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "807 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["3 large eggplants, peeled and sliced lengthwise (about 1/2 inch thick)", "1/4 cup and 2 tablespoons olive oil, plus extra for pans", "1/4 cup peanut oil", "1 onion, minced", "6 garlic cloves, minced", "1 28-ounce can diced tomatoes", "1 teaspoon allspice", "1 teaspoon cinnamon", "1 tablespoon pomegranate molasses", "Sugar to taste", "Salt and black pepper", "1 15-ounce can chickpeas, drained and rinsed (about 1 cup)", "1/2 cup pine nuts, toasted", "Fresh mint leaves, for garnish", "Thick yogurt for serving, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees and lightly oil two baking sheets (or use nonstick). Combine the 1/4 cup olive oil and the peanut oil. Brush eggplant slices on both sides with the mixture, then place on pans. Roast, flipping once, until golden brown on both sides, about 15 minutes total. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat the 2 tablespoons olive oil over medium heat. Add onion and garlic, and cook, stirring, until soft and translucent, about 10 minutes. Add tomatoes, spices and molasses, and bring to a simmer. Add sugar, salt and pepper to taste. (The amount of sugar will depend on the tomatoes’ sweetness; there should be a hint of sweetness in the mixture.) Simmer until slightly thickened, about 15 minutes. Add chickpeas and cook until thick, 5 to 10 minutes more. Stir in half the pine nuts and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place a slice of eggplant on a platter and spoon tomato-chickpea mixture onto the wide end of the slice. Fold the narrower end of the slice over to cover the filling and place a mint leaf on top. Repeat with remaining slices and garnish with remaining pine nuts. Serve cold or at room temperature, topping each piece with a dollop of yogurt, if using."}]}