{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Eggplant Salad With Leeks and Cilantro Leaves", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "vietnamese", "recipeCategory": "salads and dressings", "keywords": "cilantro, eggplant, leek, dairy-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 149, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "7 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "593 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup soy sauce", "1/4 cup sugar", "1/4 cup water", "1 tablespoon white vinegar", "1 tablespoon Vietnamese chile-garlic sauce (tuong ot toi) or sriracha", "1 tablespoon freshly squeezed lime juice", "1/4 cup canola oil, plus extra for pans", "12 baby leeks, well washed, or thick scallions", "3 and 1/2 pounds Japanese or other thin-skinned eggplants", "Salt and black pepper", "1 and 1/2 cups loosely packed cilantro leaves and sprigs, plus about 12 sprigs for garnish, if desired", "Chopped roasted peanuts, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing: stir soy sauce, sugar, water and vinegar together until sugar dissolves. Stir in chile sauce and lime juice, taste and adjust the seasonings. There should be a good balance of sweet, salty, tangy and hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees. Lightly oil a large baking sheet, preferably nonstick. Trim dark green tops off leeks (or scallions) and discard. Leaving stem ends intact, cut leeks in half lengthwise with the tip of a sharp knife. Place cut side down on prepared pan, drizzle with 2 tablespoons oil and sprinkle with salt and pepper. Roast, turning once, until soft and charred in spots, about 15 minutes. Transfer to a plate, cover tightly with plastic wrap, and set aside to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim stem ends off eggplants and discard. Cut eggplants into bite-size pieces. In a large bowl, toss pieces with remaining 2 tablespoons oil, and salt and pepper to taste. Oil the baking pan again. (Use 2 if needed to prevent crowding.) Spread eggplant on pans and roast, turning pieces once or twice, until soft, browned and charred in spots, about 15 minutes total."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When eggplant is cool enough to handle, transfer to a serving bowl. Cut leeks crosswise into 1-inch pieces, discarding stem ends, and add to eggplant. Lightly chop cilantro and add."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir dressing and pour half over the salad, tossing gently until evenly coated. Taste and add more dressing, salt and pepper as needed. Garnish with cilantro sprigs and chopped peanuts, if using."}]}