{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Pilaf With Carrots and Parsley", "description": "Carrots and leeks make a sweet combination, but you can also use regular onion in this pilaf. To get 1/2 cup of finely chopped parsley, begin with 2 cups leaves picked from the stems.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/04/health/nutrition/04recipehealth-pic/04recipehealth-pic-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "carrot, parsley, rice, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 187}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 182, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "436 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 cup basmati rice", "2 cups water or stock (chicken or vegetable)", "2 tablespoons extra virgin olive oil", "1 small onion or 1 medium leek, finely chopped", "3/4 pound carrots (2 large), peeled, cut in half lengthwise if large, and thinly sliced on the diagonal", "Salt to taste", "1/2 cup finely chopped flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the rice in a bowl in the sink and rinse several times with water, or soak for 30 minutes, to wash away some of the starch. Drain through a strainer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the water or stock to a bare simmer in a saucepan or in a Pyrex measuring cup in the microwave."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the oil in a wide, heavy skillet or saucepan over medium heat and add the carrots, onion or leek, and salt to taste. Cook, stirring, until the vegetables begin to soften, about 3 minutes, and add the rice. Cook, stirring, until the grains of rice are separate and beginning to crackle. Add the hot water or stock and salt to taste and bring to a boil. Reduce the heat, cover and simmer 15 minutes, until all of the liquid has been absorbed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the rice and place a clean towel over the top of the pan (it should not be touching the rice). Replace the lid and allow the rice to sit for 10 minutes, undisturbed. Add the parsley and gently fluff the rice, then pile the pilaf onto a platter or into a wide bowl and serve."}]}