{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Rolls With Beets, Brown Rice, Eggs and Herbs", "description": "Uncooked grated beets pair beautifully with spring roll seasonings. The egg “pancakes” contribute protein and an element of comfort to the filling", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/10/health/nutrition/10recipehealth/10recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "8 spring rolls", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, beet, brown rice, cabbage, dairy-free, gluten-free, halal, healthy, kosher, low-fat, low-sodium, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 183, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "32 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "481 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 eggs", "Salt to taste", "1 1/2 teaspoons rice bran oil or canola oil", "1 3/4 cups cooked brown rice", "1/4 cup rice vinegar", "3 to 4 medium-size beets (about 1 pound), peeled and grated", "1/3 cup mint leaves, coarsely chopped, plus additional leaves", "1/4 cup Thai basil leaves, coarsely chopped, plus additional leaves (may substitute regular basil if you can’t get the Thai variety)", "2 cups shredded cabbage", "8 8 1/2-inch rice flour spring roll wrappers"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make three egg “pancakes”: heat an 8-inch omelet pan over medium-high heat and beat 1 egg in a bowl. Season to taste with salt. When the pan is hot add 1/2 teaspoon oil and pour in the egg, scraping all of it out of the pan with a heat-proof rubber spatula. Swirl the pan so that the egg covers the bottom in an even layer, and lift the edges of the thin omelet with your spatula to let the egg run underneath. Push the pan away from you and quickly jerk it toward you to flip or fold the omelet over (if it just folds, that’s fine). Turn out of the pan onto a plate. Repeat with the other two eggs and remaining oil. Slice the omelets into 1/2-inch-wide pieces and set aside"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the rice with 1 tablespoon of the rice vinegar"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the shredded beets and chopped herbs in a bowl and toss with 2 tablespoons of the rice vinegar and salt to taste. Place the shredded cabbage in another bowl and toss with the remaining vinegar and salt to taste"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with warm water and place a spring roll wrapper in it just until it is pliable, about 30 seconds. Remove from the water and drain briefly on a kitchen towel. Place the wrapper on your work surface in front of you and arrange several whole mint and basil leaves, vein side up, on the wrapper. Place a large spoonful or handful of beets (wear plastic gloves if you don’t want the beets to color your hands) down the middle of the wrapper but slightly closer to the bottom, leaving a 2-inch margin on the sides. Place a handful of cabbage over the beets, then a handful of rice. Arrange 3 slices of omelet over the rice. Fold the sides in, then roll up the spring rolls tightly, squeezing the filling to get a tight roll. Refrigerate until ready to serve. Serve with a dipping sauce of your choice if desired"}]}