{"@context": "http://schema.org", "@type": "Recipe", "name": "Wok-Seared Cod With Mushrooms and Peas", "description": "Stir-fry is a great weeknight staple: fast, alive with flavor and bendable to whatever is in your refrigerator or freezer. Here, mushrooms, scallions and peas, flavored with that feisty duo of garlic and ginger, are quickly cooked (there is no other way in a stir-fry) and then pushed aside in the wok before the fish is added. The naturally flaky cod would fall apart if it were tossed around, so it is seared and turned once. Finally, everything is gently stirred together with peas and a mixture of broth, soy sauce and rice wine, which glazes the fish and vegetables. Serve piping hot, with rice or soba noodles that ideally have been cooked while you prepped the ingredients for the stir-fry. A 12-inch stainless steel skillet can stand in for a wok, though it does not perform as well. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11wokcod/11wokcod-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "cod, mushroom, peas, dairy-free, gluten-free, healthy, kosher, low-carb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 184}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 233, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "25 grams", "saturatedFatContent": "2 grams", "sodiumContent": "606 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound Pacific cod fillets", "2 teaspoons cornstarch", "1 1/2 teaspoons plus 1 tablespoon rice wine or dry sherry", "1 tablespoon egg white, lightly beaten", "Salt to taste", "1 teaspoon sesame oil", "1/4 cup chicken broth or vegetable broth", "1 tablespoon soy sauce", "1/2 teaspoon sugar", "2 tablespoons peanut oil, rice bran oil or canola oil", "1 tablespoon minced ginger", "2 fat garlic cloves, minced", "4 scallions, cut 1/2 inch thick on the diagonal, dark green part separated", "1/2 pound mushrooms, sliced", "1 cup thawed frozen peas", "1/4 cup coarsely chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cod fillets on your cutting board and cut down the length where the depression in the middle is. Slice the halves crosswise into 1/4-inch pieces. Place in a bowl and toss with 1 teaspoon of the cornstarch, 1 1/2 teaspoons of the rice wine or sherry, the egg white, salt and sesame oil. Stir gently until all of the cornstarch is dissolved."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the broth, remaining rice wine or sherry, soy sauce, remaining cornstarch and sugar. Stir well to dissolve the cornstarch. Set aside near your wok."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 1 tablespoon of the oil by adding it to the sides of the pan and swirling the pan, then add the garlic and ginger and stir-fry for no more than 10 seconds. Add the mushrooms and white and light green parts of the scallions and stir-fry for 1 to 2 minutes, until the mushrooms begin to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push everything to the sides of the wok and add the remaining oil. Spread the fish in the bottom of the wok in an even layer and do not move it for 1 minute. Sprinkle the fish and vegetables with salt to taste. Gently slide the spatula underneath the fish pieces and turn them over. Sear for another minute. The fish should be cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the broth mixture and the peas to the wok and gently stir-fry for  45 seconds to a minute, until some of the liquid has evaporated and the rest has thickened and glazed the fish and vegetables. Stir in the cilantro and the dark green parts of the scallions and serve with noodles."}]}