{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Rainbow Peppers, Eggplant and Tofu", "description": "My method of roasting the eggplant before stir-frying is not at all Chinese, but it allows me to pull off a beautiful, succulent stir-fried eggplant that doesn’t require at least 1/4 cup of oil. The eggplant is already soft when you add it to the wok. Seek out long, light purple Asian eggplant for this.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/10/16/science/16recipehealth/16recipehealth-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "3 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "bell pepper, eggplant, tofu, dairy-free, gluten-free, healthy, high fiber, kosher, low cholesterol, low-sodium, vegan, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 222}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 306, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "9 grams", "proteinContent": "16 grams", "saturatedFatContent": "3 grams", "sodiumContent": "909 milligrams", "sugarContent": "14 grams", "transFatContent": null}, "recipeIngredient": ["1 pound Asian eggplant", "1 tablespoon rice wine or dry sherry", "2 tablespoons hoisin sauce", "1 teaspoon low-sodium soy sauce", "2 tablespoons peanut oil, rice bran oil or canola oil", "1/2 pound firm tofu, cut in 1/2-inch squares and drained on paper towels", "1 tablespoon minced ginger", "2 fat garlic cloves, minced", "1/2 teaspoon red pepper flakes", "3 bell peppers of varying colors", "1 Anaheim pepper", "Salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Cut the eggplant in half lengthwise and score down to but not through the skin. Line a baking sheet with parchment or foil, lightly oil the foil and place the eggplant on it, cut side down. Roast for 15 to 20 minutes, until the skin begins to shrivel. Remove from the oven, allow to cool until you can handle it, and cut in half along the score down the middle of each half, then into 1/2-inch slices"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the rice wine or sherry, the hoisin sauce and the soy sauce in a small bowl and set aside"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a 14-inch flat-bottomed wok or 12-inch steel skillet over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 1 tablespoon of the oil and add the tofu. Let it sit in the pan for about 30 seconds, until it begins to sear, then stir-fry for about 2 minutes, until lightly colored. Transfer to a plate"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Swirl in the remaining oil, then add the garlic, ginger and red pepper flakes and stir-fry for no more than 10 seconds. Add the peppers and eggplant, sprinkle with salt to taste and stir-fry for 2 minutes. Return the tofu to the wok, add the hoisin sauce mixture and stir-fry for another 1 to 2 minutes, until the eggplant is tender and infused with the sauce and the peppers are crisp-tender. Remove from the heat and serve with rice, grains or noodles"}]}