{"@context": "http://schema.org", "@type": "Recipe", "name": "Preserved Pears With Pepper, Star Anise and Vanilla Syrup", "description": "", "author": {"@type": "Person", "name": "Cathy Barrow"}, "image": "https://static01.nyt.com/images/2012/10/31/dining/31SUBPEARS1_SPAN/31SUBPEARS1_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "6 pint jars, or 12 cups", "recipeCuisine": "", "recipeCategory": "condiments, dips and spreads", "keywords": "pear, sugar, vanilla bean, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 402, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "104 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "12 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "5 milligrams", "sugarContent": "81 grams", "transFatContent": null}, "recipeIngredient": ["2 lemons, juiced", "24 Seckel pears (or Bosc or Bartlett, but they may need to be quartered to fit the jar)", "2 and 2/3 cup sugar ", "6 whole star anise", "6 vanilla beans", "3 tablespoons pink peppercorns"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a rack in a large stockpot, or line the pot with a folded kitchen towel. Fill with water and bring to a boil. Add 6 pint-size canning jars and boil for 10 minutes. Jars may be left in the warm water in the pot until ready to be filled. Alternatively, sterilize the jars by running them through a dishwasher cycle, leaving them there until ready to fill. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place canning rings in a small saucepan, cover with water and bring to a boil. Turn off the heat and add the lids to soften their rubber gaskets. Rings and lids may be left in the water until jars are filled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with cold water and add the lemon juice to keep the pears from browning. Peel, halve and core the pears, dropping them into the water as you go. Meanwhile, make the flavored syrup. Bring 8 cups of water and the sugar to a boil. Add anise, vanilla beans and peppercorns. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the pears and add to the boiling syrup. Boil for five minutes. Using a slotted spoon, divide pears between six jars. Remove the star anise and vanilla from the syrup, dividing them between jars. Ladle in hot syrup and peppercorns, leaving 1/2 inch of headspace. Run a plastic knife gently around the inside of jar to remove any air bubbles. Recheck the headspace. There may be extra syrup, but resist overfilling the jars. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe jar rims clean with a damp towel. Place the lids on the jars, screw on the rings and lower the jars back into the pot of boiling water. Return to a full boil and boil for 20 minutes. Transfer jars to a folded towel and let cool for 12 hours; you should hear them ping as they seal. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once cool, test the seals by removing rings and lifting jars by the flat lids. If a lid releases, the seal has not formed. Unsealed jars should be refrigerated and used within a month, or reprocessed. Rings and jars may be reused, but a new flat lid must be used each time. To reprocess, reheat syrup to boiling, add back pears, return to boiling, then continue as before."}]}