{"@context": "http://schema.org", "@type": "Recipe", "name": "Salted Licorice Brigadeiros", "description": "Luscious Brazilian-style fudge balls coated thickly with chocolate sprinkles get an upgrade in this marvelous recipe from Melissa Clark that brings salted licorice into the mix to create something that looks a lot like chocolate truffles but tastes even more divine: creamy, smooth and just salty enough, while still remaining firmly planted on the sweet side of the equation. Added bonus: They are extremely easy to throw together, an excellent candy-making project for families or those in search of fast-and-delicious treats.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/01/17/dining/recipes-licoricebrigadeiros/recipes-licoricebrigadeiros-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "About 3 dozen", "recipeCuisine": "brazilian", "recipeCategory": "easy", "keywords": "chocolate, licorice, dessert, fall, winter, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "recipeIngredient": ["1 box (7 ounces) soft black licorice", "1 (14-ounce) can sweetened condensed milk", "1 1/2 ounces unsweetened chocolate, coarsely chopped", "Chocolate sprinkles", "Coarse sea salt, like fleur de sel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, grind licorice until finely chopped, about 30 seconds (it will be noisy). "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a heavy-bottomed saucepan and add 1/4 cup water. Cook gently over medium-low heat, stirring frequently, until licorice is shiny and almost melted (a few remaining licorice nibs are O.K.), 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add condensed milk and bring to a simmer, stirring. Scrape mixture back into food processor and add chocolate. Process until as smooth as possible (you will still have a few lumps but that’s O.K.), about 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape mixture into a bowl and chill until very cold, at least 3 hours. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour sprinkles into a bowl. Roll teaspoons of licorice mixture into balls (you may want to lightly coat your hands with butter or oil) and drop them into sprinkles, turning to coat. Place balls into paper candy cups and sprinkle tops with coarse sea salt. "}]}