{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond and Goat Cheese Candy Bars", "description": "In today’s locavore, organic-minded, food-crazed culture, we get so wrapped up in the idea of seasonal fruits and vegetables that it can be easy to forget another important, deep vein of seasonal foodstuff opportunities.\n\nThat is, candy. Because I wasn’t trying to make child-friendly crowd pleasers here, I had the freedom to pull out ingredients that would not normally appear in a candy bowl.  And because these candy bars are savory-sweet, as opposed to cloying sweet, I can eat more of them before my teeth start to ache.\n\nIt’s important to use a mild, soft goat cheese here. You want a slight tang but not an overwhelming barnyard flavor. And if you really dislike the funkiness of goat cheese, you can use cream cheese instead. The candy will be sweeter and not as complex tasting, but the recipe will still work.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/06/09/dining/candybar/candybar-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "18 bars", "recipeCuisine": "american", "recipeCategory": "easy, quick", "keywords": "almond butter, chocolate, goat cheese, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 390}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 195, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "34 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 tablespoons plus 1 teaspoon unsalted butter, softened", "25 grams sliced almonds (about 1/3 cup)", "1/4 teaspoon kosher salt, more as needed", "3/4 cup smooth almond butter", "2 tablespoons softened goat cheese", "55 grams almond flour (about 1/2 cup)", "195 grams confectioner’s sugar (about 1 1/2 cups)", "4 ounces bittersweet (72 percent) chocolate, coarsely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 8-inch square baking pan with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 teaspoon butter in a small skillet over medium heat. Add almonds and a pinch of salt. Cook, stirring occasionally, until almonds are golden, about 5 minutes. Pour into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an electric mixer, beat together almond butter and goat cheese. Beat in almond flour. Stop mixer and scrape down sides. Beat in sugar, 1/4 teaspoon salt and 5 tablespoons butter until combined. Scrape down sides and beat once more to combine. Spread into pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a simmer. Place chocolate in a heatproof bowl. Place bowl over pot of simmering water and cook, stirring, until the chocolate is completely melted. Scrape chocolate into the pan over the almond butter mixture and spread evenly. Scatter almonds over chocolate. Let cool to room temperature. Cover with foil and chill until firm. Cut into 18 bars."}]}