{"@context": "http://schema.org", "@type": "Recipe", "name": "Cedar-Roasted Carrots With Tofu and Carrot Pesto", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2012/10/31/dining/31CARROTS1_SPAN/31CARROTS1_SPAN-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "carrot, tofu, fall, winter, side dish, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 407, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "5 grams", "sodiumContent": "668 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["28 baby carrots in mixed colors, with tops, or larger carrots halved crosswise and lengthwise, rinsed", "1 small clove garlic", "Juice of 1/2 lemon", "½ cup plus 1 tablespoon extra-virgin olive oil", "Salt and ground black pepper", "1/2 pound regular carrots, peeled and diced", "1 cup fresh carrot juice", "1 tablespoon finely grated fresh ginger", "1/2 pound soft tofu, diced", "2 tablespoons toasted sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Soak 4 sheets of cedar paper, about 8 inches square (sold in cookware and Japanese kitchen-equipment stores) in water for 10 minutes. Cut tops off carrots. Reserve 4 sprigs and chop 1 cup, packed, of the tops. Turn on food processor. Drop garlic in through the feed tube and process until minced, scraping down workbowl once or twice. Place chopped carrot tops and lemon juice in processor and process until minced. With machine running, drizzle in 1/2 cup olive oil. Process to a pur&eacute;e. Season with salt and pepper and set aside. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place baby carrots in a large bowl and toss with 1 tablespoon olive oil. Drain cedar paper and spread in the bottom of a roasting pan. Spread carrots evenly on top, cover with foil, place over medium-high heat until the oil starts to sizzle, then place in the oven until carrots are tender, about 30 to 40 minutes, depending on the size of the carrots. Remove from oven and wrap loosely in the foil to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine diced carrots and carrot juice in a saucepan and cook on medium about 5 minutes until about half the liquid has evaporated. Transfer to a blender, add grated ginger and process to a pur&eacute;e. Season with salt and pepper and keep warm. Microwave tofu one minute to warm it, or warm in a steamer. "}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a pool of carrot pur&eacute;e on each of 4 dinner plates, spoon the tofu on each and arrange the roasted carrots on top. Drizzle the pesto around, garnish with some sprigs of carrot tops and scatter sesame seeds on top. Serve warm."}]}