{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa and Cauliflower Kugel With Cumin", "description": "Cauliflower, steamed until tender then finely chopped, combines beautifully here with quinoa and cumin. Millet would also be a good grain choice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/06/science/06recipehealth/06recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner, casseroles", "keywords": "cauliflower, cottage cheese, quinoa, fall, winter, gluten-free, halal, kosher, nut-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 116}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 161, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "2 grams", "sodiumContent": "416 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1/2 medium onion, finely chopped", "1/2 cup quinoa", "1 1/4 cups water", "Salt to taste", "1 pound cauliflower (1/2 medium head), broken into florets", "1 cup low-fat cottage cheese", "2 eggs", "1 scant teaspoon cumin seeds, lightly toasted and crushed", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a medium saucepan and add the onion. Cook, stirring, until just about tender, 3 to 5 minutes, and add the quinoa. Cook, stirring, for another 2 to 3 minutes, until the quinoa begins to smell toasty and the onion is tender. Add the water and salt to taste and bring to a boil. Cover, reduce the heat and simmer 15 to 20 minutes, until the quinoa is tender and the grains display a threadlike spiral. If any water remains in the pot, drain the quinoa through a strainer, then return to the pot. Place a dish towel over the pot, then return the lid and let sit undisturbed for 10 to 15 minutes"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, steam the cauliflower over 1 inch of boiling water for 10 minutes, or until tender. Remove from the heat"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees and oil a 2-quart baking dish or gratin"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely chop the steamed cauliflower, either with a chef’s knife or using a food processor fitted with the steel blade. Place in a large mixing bowl. In a food processor fitted with the steel blade, purée the cottage cheese until smooth. Add the eggs and process until the mixture is smooth. Add salt (I suggest about 1/2 teaspoon), pepper and the cumin seeds and mix together. Scrape into the bowl with the cauliflower. Add the quinoa and stir everything together. Scrape into the oiled baking dish. Drizzle the remaining oil over the top and place in the oven"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 35 to 40 minutes, until the top is lightly browned. Remove from the oven and allow to cool for at least 15 minutes before serving. Serve warm or at room temperature, cut into squares or wedges"}]}