{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate Soufflé With Candied Squash", "description": "In this intensely rich recipe, you’ll jazz up a fudgy chocolate soufflé cake with crème fraîche and candied, cinnamon-scented butternut squash, turning a decadent dessert into something stunningly autumnal. The key to a soufflé is in handling your ingredients gently, so keep a close watch on the heat and cooking time. Cover your baked cake with the crème fraîche and your cooled butternut squash that has been simmered in a cinnamon honey syrup, and serve it in thin slivers. It’s the perfect chocolatey finish to a feast.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/11/12/dining/chocolatesouffle/chocolatesouffle-mediumThreeByTwo440.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 8 to 10", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "chocolate, eggs, squash, dessert, fall, winter, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 405, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "14 grams", "sodiumContent": "118 milligrams", "sugarContent": "38 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup maple syrup", "2 tablespoons honey", "1 cinnamon stick", "Ground clove, as needed", "1 vanilla bean, split lengthwise", "1 medium butternut squash (about 1 pound), peeled, seeded and cut into 1/2-inch chunks", "Unsweetened cocoa powder, for dusting", "280 grams bittersweet chocolate, chopped (about 10 ounces)", "1/2 cup (1 stick) unsalted butter", "1/4 teaspoon fine sea salt", "1 teaspoon vanilla extract", "5 extra-large eggs, separated", "65 grams granulated sugar (about 6 tablespoons)", "1 cup crème fraîche"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a very large skillet, combine the syrup, honey, cinnamon and a pinch of clove. Scrape the vanilla seeds into the skillet and drop in the pod. Bring mixture to a simmer. Add the squash in a single layer. Cover and cook over medium heat until tender, 8 to 10 minutes. Uncover and simmer until juices thicken to a syrupy consistency, about 5 minutes. Remove from heat and cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Grease a 9-inch springform pan and dust with cocoa powder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heatproof bowl set over a pan of simmering water, combine the chocolate, butter and salt and cook until melted and smooth. Stir in the vanilla and remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of an electric mixer, whisk together the egg yolks with 1/4 cup sugar until creamy, about 1 minute. In a clean, dry bowl of an electric mixer, whisk together the egg whites until they just hold their shape. Whisk in the remaining 2 tablespoons sugar on high speed until they hold soft peaks"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the yolks into the melted chocolate. Fold in half the whites to lighten the mixture; once combined, fold in the remaining whites. Scrape the batter into the prepared pan. Bake until barely set in the center, about 25 minutes. Cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice a knife or offset spatula around the edges of the pan to release it. Transfer cake to a platter. Slather top of cake with crème fraîche. Spoon squash and syrup over cake. Slice into thin slivers (it is very rich) and serve."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Chocolate for Thanksgiving", "description": "Along with the usual pies and cakes for Thanksgiving, try serving a chocolate soufflé cake with caramelized butternut squash. Melissa Clark shows how.", "thumbnailUrl": "https://static01.nyt.com/images/2013/11/12/dining/chocolatesouffle/chocolatesouffle-mediumThreeByTwo440.jpg", "uploadDate": "2012-11-09T17:23:31.000Z", "duration": "PT5M59S"}}