{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegan Pizza With Apple, Butternut Squash and Caramelized Onions", "description": "This satisfying cold-weather pizza from Chloe Coscarelli, the vegan cookbook author, makes a great main course, or it can be cut into pieces as an appetizer. The creamy white bean purée made by whizzing cannellini beans, oil, lemon juice, garlic, thyme, salt and pepper in a food processor makes this dish seem like a real treat, and the piles of caramelized onions, roasted butternut squash, apple and spinach finish it off beautifully. If you're a half-hearted vegan, consider sprinkling a handful of blue cheese over the top a few minutes before it's done baking. We won't tell.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2017/11/01/dining/01COOKING-APPLESQUASHPIZZA3/01COOKING-APPLESQUASHPIZZA3-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "pizza and calzones", "keywords": "appetizer, main course, butternut squash, cannellini beans, pizza dough, dairy-free, kosher, nut-free, vegan, vegetarian, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 311}, "recipeIngredient": ["1 (15-ounce) can cannellini or other white beans, rinsed and drained", "1/4 cup olive oil", "1 tablespoon lemon juice", "2 cloves garlic", "1/2 teaspoon dried thyme", "1 teaspoon sea salt", "1/2 teaspoon freshly ground black pepper", "1 to 2 tablespoons water", "4 tablespoons olive oil", "1 onion, thinly sliced", "Sea salt", "Freshly ground black pepper", "2 cups butternut squash, peeled and cut into 1/2-inch cubes", "1/2 cup spinach", "1 apple, peeled and thinly sliced", "Pizza dough (store-bought is fine, or make your own)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Make the garlic white bean purée by blending the beans, oil, lemon juice, garlic, thyme, salt and pepper in a food processor. Add water, as needed, until a smooth consistency forms. Set aside. Can be made two days in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, heat 2 tablespoons oil over medium-low heat and sauté onions until soft and lightly caramelized, about 15 minutes. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the onions are cooking, toss remaining 2 tablespoons oil with squash and season generously with salt and pepper. Transfer to a large-rimmed baking sheet and roast for 30 to 35 minutes until squash is fork-tender, turning once or twice with a spatula. Remove from oven and set aside. Turn heat up to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare pizza. Brush a large-rimmed baking sheet (approximately 9 by 13 inches) with oil. Stretch homemade or store-bought pizza dough into a rectangle and fit it into the prepared baking sheet (You can also use a 14-inch or 16-inch round pizza pan if you have one). Spread a layer of the garlic white bean purée evenly over the rolled-out dough. (You may not want to use all of it.) On top of the dough, arrange the spinach, caramelized onions, roasted butternut squash and apple slices. Season with salt and pepper, and brush the edges of the crust with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake at 450 degrees for about 15 to 20 minutes, rotating midway, until the crust is slightly browned or golden. Let cool, slice and serve."}]}