{"@context": "http://schema.org", "@type": "Recipe", "name": "Brussels Sprout Leaf and Baby Spinach Sauté", "description": "This recipe was brought to The Times in 2012 by Sara Forte, a self-taught vegetarian chef and the author of the Sprouted Kitchen, a vegetarian food blog. While Ms. Forte loves whole roasted brussels sprouts, she knows many people don’t like the woodsy center. In this simple warm salad, only the tender outside leaves are used. Just peel the leaves away, discard the core, then sauté with jumble of fresh spinach and dress with a white wine-maple syrup vinaigrette. A handful of Marcona almonds finishes it off for a a pleasant crunch.", "author": {"@type": "Person", "name": "Tara Parker-Pope"}, "image": "https://static01.nyt.com/images/2012/11/14/health/wellveggie_sprouted1/wellveggie_sprouted1-articleLarge-v2.jpg", "totalTime": "PT10M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "almonds, baby spinach, brussels sprouts, dairy-free, gluten-free, healthy, kosher, vegan, vegetarian, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 75}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 228, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "7 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "96 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound brussels sprouts", "2 tablespoons extra virgin olive oil", "1 tablespoon white wine vinegar or Champagne vinegar", "1 tablespoon maple syrup", "4 cups baby spinach", "2 generous pinches of sea salt", "1/2 cup Marcona almonds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with one brussels sprout at a time, peel off each individual leaf, starting from the outside and working toward the middle. Continue to peel until you get to the tough core where it is just too tight to pull any more leaves. Discard the core and put the leaves in a big bowl. Repeat with the remaining brussels sprouts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over medium heat, warm the olive oil in a large frying pan. Add all of the brussels sprout leaves and sauté for about 30 seconds. Add the vinegar and maple syrup and toss to coat. Add the spinach to the pan and toss until it is just barely wilted. It is better just slightly underdone in this case, as it will continue to cook in its own heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with the salt and Marcona almonds and serve immediately."}]}