{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear Cranberry Galette", "description": "I used Bartlett pears for this juicy galette, but pretty much any variety will work, as long as they’re not overly ripe.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2012/11/20/science/21recipehealth/21recipehealth-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "1 9-inch galette, serving 8", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, dried cranberries, pear, fall, winter, halal, high fiber, kosher, low-sodium, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 73}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 169, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "5 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "17 milligrams", "sugarContent": "23 grams", "transFatContent": null}, "recipeIngredient": ["<a href=\"http://cooking.nytimes.com/recipes/12722-dessert-galette-pastry\">1 dessert galette pastry (1/2 recipe)</a>", "2/3 cup dried cranberries", "2 pounds pears, ripe but not too soft, peeled, cored and sliced (about 8 to 12 wedges per pear, depending on the size; if the pears are very large, cut the slices into 2 pieces at the middle)", "1 tablespoon fresh lemon juice", "2 tablespoons mild honey, like clover", "1/2 teaspoon cinnamon", "1 teaspoon vanilla", "1/4 cup (25 grams) almond flour", "1 egg beaten with 1 teaspoon milk, for egg wash", "1 tablespoon raw brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pastry from the freezer and place it on a baking sheet lined with parchment. Leave to thaw while you prepare the fruit, but don’t keep it out of the freezer for too long. It’s easiest to handle if it’s cold and will thaw quickly. You just want it soft enough so that you can manipulate it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the cranberries for 5 minutes in hot water. Drain and dry on paper towels. Toss the sliced pears with the lemon juice in a large bowl, then add the dried cranberries, honey, cinnamon and vanilla and gently toss together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the almond flour over the pastry, leaving a 2- to 3-inch border all around. Place the fruit on top. Fold the edges of the dough in over the fruit, pleating the edges as you work your way around the fruit to form a free-form tart that is roughly 9 inches in diameter. Place in the freezer on the baking sheet for 45 minutes to an hour. This helps the galette maintain its shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 350 degrees. Remove the galette from the freezer. Brush the exposed edge of the pastry with the egg wash. Sprinkle the sugar over the fruit and the crust. Place in the oven and bake 50 to 60 minutes, until the fruit is bubbly and the juice is running out and caramelizing on the parchment. Remove from the oven and allow to cool for at least 15 minutes. Serve hot, warm or at room temperature."}]}