{"@context": "http://schema.org", "@type": "Recipe", "name": "Joyce Molyneux's Christmas Pudding From The Carved Angel", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT6H15M", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, fruit, kidney suet, dessert, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 325, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "11 grams", "sodiumContent": "76 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2/3 cup flour", "1 3/4 cups soft bread crumbs", "2/3 cup sugar", "1/4 teaspoon grated nutmeg", "1/4 teaspoon mace", "1/4 teaspoon salt", "1 cup raisins", "1 cup currants", "1/2 cup coarsely chopped crystalized ginger", "1 cup chopped Granny Smith apple (1 apple, peeled, cored and chopped)", "1 teaspoon grated orange rind", "1 teaspoon grated lemon rind", "1 1/2 cups finely chopped suet (see note)", "3 eggs", "1/4 cup fine Cognac, Armagnac or brandy", "1 tablespoon orange juice", "1 tablespoon lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour, bread crumbs, sugar, spices and salt in a large mixing bowl and toss to mix thoroughly. Add the raisins, currants, ginger, chopped apple and grated rinds and mix to coat with the dry ingredients. Add the chopped suet and mix to coat well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a smaller bowl, beat the eggs until they are thick and foamy. Add the Cognac and citrus juices and mix together. Add the egg mixture to the larger bowl and fold with a spatula to mix and coat well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter well a two-and-a-half- to three-quart pudding mold (see note). Add the pudding to the mold and cover with the lid. Place a rack in a kettle large enough to hold the pudding mold and add water to the kettle to a depth of one inch. Place the pudding on the rack and bring the water to a boil. Lower the heat to simmering, cover the kettle and steam the pudding for about six hours, checking occasionally to be sure the water in the kettle has not boiled away."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pudding is done, it may be unmolded and served immediately, with creme fraiche, traditional hard sauce or a brandy-flavored creme anglaise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the pudding is not to be served immediately, it should be left in its mold and reheated in a steaming kettle before serving. The pudding may be stored in a cool, dark place for six weeks or longer. For longer storage, remove the lid, pour another half-cup of Cognac or brandy over the surface of the pudding and replace lid."}]}