{"@context": "http://schema.org", "@type": "Recipe", "name": "Egyptian Holiday Cookies (Kach al Ayid)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "24 cookies", "recipeCuisine": "african", "recipeCategory": "", "keywords": "dessert, flour, rose water", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 159, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "106 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 teaspoons granular yeast", "3 tablespoons lukewarm water", "1/4 cup flour", "Salt to taste if desired", "2 teaspoons sugar", "1/4 cup unsalted butter", "6 to 8 cups unsifted flour", "1 1/2 teaspoons rosewater", "1/2 teaspoon pure vanilla extract", "3 or 4 tablespoons lukewarm water", "Date filling (<a href=\"http://cooking.nytimes.com/recipes/1423-agwah-egyptian-date-filling\">see recipe</a>), optional", "Confectioners' sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare starter 30 minutes in advance. In a small mixing bowl, dissolve the yeast in the lukewarm water. Stir in the flour, salt and sugar and let stand until the mixture doubles in bulk and produces air bubbles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the dough, melt the butter in a small saucepan and let it cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dough can be made by hand or in a food processor. To make it by hand, put the flour in a mixing bowl and make a well in the center. Pour the butter into the well and add the starter, rosewater and vanilla. Stir to blend. Rub the mixture between the palms of the hands until it resembles coarse cornmeal. Add lukewarm water a little at a time until the dough can be gathered together to form a ball. Use as little water as possible. Knead the dough until it is smooth and even in texture. To make dough in a food processor, put the flour into the container of the processor and add the butter, starter, rosewater and vanilla while blending. If necessary, add lukewarm water, a little at a time, until the dough can be shaped into a ball and kneaded briefly. If the dough is too soft, it may be necessary to chill it briefly. If you overchill, let it rest at room temperature until it can be shaped by hand."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 24 pieces of more or less equal size. Shape each piece into a ball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you do not wish to use a filling, transfer the pieces of dough to a cookie sheet and flatten them into a cookie shape about half an inch thick or slightly thicker. Or if you use the filling, punch a hole partly down the center of each ball of dough. Shape the dough into a slightly curved saucer shape and put about one teaspoon or less of filling in the middle of the dough. Fold over the edges and seal. Place the dough, sealed side down, on the cookie sheet and press with the palms of the hands to flatten each into a cookie shape."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cookie sheet on the top rack of the oven and bake cookies 35 to 40 minutes. When done, cookies should have an even, golden color and the firmness of a cooked pie crust. Let cookies cool completely. Cover the top and sides of each one with a generous dusting of confectioners' sugar. If you plan to store the cookies, do not frost with confectioners' sugar until the day you use them."}]}