{"@context": "http://schema.org", "@type": "Recipe", "name": "Sourdough Dressing With Truffle Butter and Candied Chestnuts", "description": "", "author": {"@type": "Person", "name": "Kim Severson"}, "image": null, "totalTime": "PT2H", "recipeYield": "6-8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chestnut, sourdough, truffle butter, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 612, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "7 grams", "proteinContent": "12 grams", "saturatedFatContent": "16 grams", "sodiumContent": "867 milligrams", "sugarContent": "19 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["14 ounces chestnuts, vacuum-packed or frozen and brought to room temperature", "3 tablespoons butter, melted and mixed with 1 teaspoon water, more for greasing", "1/4 cup sugar", "1 teaspoon kosher salt", "1 pound sourdough bread, crust removed, cut into 1-inch cubes", "1/2 stick unsalted butter, plus 2 tablespoons", "1 leek, pale part only, quartered and thinly sliced to make 1/2 cup", "1 cup diced shallots", "1 1/2 cups celery root, finely diced", "8 sage leaves, thinly sliced", "2 teaspoons fresh thyme leaves", "Salt and black pepper to taste", "1 1/2 cups tart apple such as Jonathan, Northern Spy or Granny Smith, peeled, cored and cut in 1/2-inch dice", "1 pound chanterelle mushrooms (or a mix of wild and domestic mushrooms), thickly sliced", "1/4 cup Madeira", "2 1/2 cups turkey stock or low-sodium chicken stock", "1/4 cup dried currants", "1/2 cup truffle butter (preferably black truffle)", "1/3 cup each finely chopped flat-leaf parsley and chervil (or use all parsley)", "1/3 cup chervil, finely chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread cubed bread evenly on a baking sheet and bake for 10 minutes at 350 degrees or until slightly toasted. Keep oven on. Cool bread and place in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1/2 stick butter in a wide, heavy skillet over medium heat and add leeks, shallots, celery root, sage and thyme, seasoning with pepper. Cook until celery root is tender, about 7 minutes. Add apples and cook until fork tender, then add mixture to bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe pan, turn heat to medium high. Add 2 tablespoons butter and mushrooms. Season with salt and pepper and cook 6 to 8 minutes, stirring occasionally, until mushrooms release their liquid and most of it has evaporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add Madeira and cook for 2 to 3 minutes, scraping up any browned bits in pan. Add mushrooms and chestnuts to bread mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, bring stock and currants to a boil; pour over bread mixture and mix thoroughly. Mix in 1/4 cup truffle butter, the parsley and chervil. Add a little more pepper, and more salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase oven heat to 375 degrees. Place mixture into a greased 9-by-13-inch baking dish, dot with remaining truffle butter and bake for 30 minutes, or until top layer is slightly brown and crisp."}]}