{"@context": "http://schema.org", "@type": "Recipe", "name": "Poached Fruit With Clove Granite And Cookies", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "Ten servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, dried figs, orange, pear, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 851, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "125 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "12 grams", "proteinContent": "8 grams", "saturatedFatContent": "13 grams", "sodiumContent": "110 milligrams", "sugarContent": "82 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 750-milliliter bottles light dessert wine, like muscat canelli", "1 3/4 cups sugar", "12 cloves", "10 firm Bartlett pears, peeled", "2 cups dried Mission figs, stemmed", "6 oranges", "1 cup hazelnuts, toasted and skinned", "2 cups all-purpose flour", "1/2 teaspoon kosher salt", "1/2 cup dark brown sugar", "3/4 cup cold unsalted butter, cut into 1/2-inch pieces", "1 egg", "1 tablespoon milk", "6 ounces bittersweet chocolate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To poach the fruit, combine the wine, sugar and cloves in a large wide pot. Bring to a boil. Lower heat to a simmer and add the pears and figs. Simmer until pears are soft but not falling apart, about 15 to 30 minutes. Meanwhile, use a paring knife to remove all peel and pith from the oranges. Cut the sections out from between the membranes. Add the sections and simmer 1 minute. Remove the fruit from the liquid with a slotted spoon, place in a bowl and let cool. Cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the syrup stand until cool and strain into a shallow, nonreactive pan. Place in the freezer until firm throughout, stirring from time to time. (The granite can be made a day ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cookies, pulse the hazelnuts in a food processor until coarsely chopped. Add the flour, salt and sugar and process until nuts are ground and mixture is well mixed. Add the butter and pulse to combine. Add the egg and milk and process just until the dough begins to come together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the dough together and divide it in half. Shape into cylinders, about 1 3/4 inches in diameter. Wrap in plastic and refrigerate at least 2 hours or up to 3 days. Preheat the oven to 350 degrees. Line 2 baking sheets with parchment paper. If the dough is very cold, let stand at room temperature until firm but not too hard. Cut the dough across into 1/8-inch slices and place on the baking sheets about 1 inch apart. (Cookies must be baked in batches.) Bake until lightly browned, about 10 minutes. Cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the chocolate and dip half of each cookie in the chocolate. Set aside and let dry completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, arrange the pears, figs and oranges in 10 shallow bowls. Use a spoon to scrape the granite into mounds and place a mound in each bowl. Serve immediately, passing the cookies separately."}]}