{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate and Fresh Cream Truffles", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT30M", "recipeYield": "80-90 pieces (about two pounds)", "recipeCuisine": "", "recipeCategory": "", "keywords": "chocolate, grand marnier, heavy cream, dessert, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 57, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "2 grams", "sodiumContent": "2 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["12 ounces semisweet or bittersweet chocolate", "1 cup heavy cream", "3 tablespoons Grand Marnier or other liqueur or flavoring", "1 pound semisweet or bittersweet chocolate", "2 ounces unsweetened cocoa powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the truffle mixture. In a saucepan, heat the chocolate and heavy cream over low heat, stirring occasionally until the chocolate is melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and pour into a bowl. Stir in the Grand Marnier."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mixture in the refrigerator for a minimum of two hours until it is firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover a baking sheet with a piece of waxed paper. Using two spoons, scoop out and drop onto the paper mounds of the mixture, about one-half teaspoonful to one teaspoonful, depending on the size of truffle you wish. Refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cold, loosen the mounds from the paper and use your hands to make them relatively round, if not already so. Refrigerate until ready to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the chocolate covering: in a saucepan melt the chocolate in a very low oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After the chocolate has melted, stir it well from time to time as it cools to body temperature, which has been reached when you notice no difference in temperature as you touch the chocolate with the knuckle of the smallest finger."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the cocoa powder evenly in a chilled jelly roll pan or on a chilled plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the truffles from the refrigerator and drop two at a time into the coating chocolate. Using two forks, turn the truffles, coating them well with the chocolate. Lift a truffle with one fork, tapping that fork with the other to eliminate excess chocolate, then drop the coated truffle onto the pan containing the cocoa powder. Using a spoon, quickly roll and coat with the powder, then push it to the side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the truffles are firm enough to handle, transfer them to a bowl and refrigerate or freeze."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, mound the truffles in a serving dish. They are delicious when served at room temperature or cold from the refrigerator."}]}