{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Creme Brulee", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall, pumpkin purée", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 362, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "16 grams", "sodiumContent": "41 milligrams", "sugarContent": "24 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups heavy cream", "1/2 cup milk", "1/2 cup plus 6 teaspoons sugar", "1/4 teaspoon ground cinnamon", "1/4 teaspoon ground ginger", "1/8 teaspoon freshly grated nutmeg", "1/8 teaspoon ground allspice", "1/2 of a vanilla bean, halved lengthwise", "6 large egg yolks", "1/2 cup pumpkin puree"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. In a large heavy bottom saucepan, combine the cream, milk, one-quarter cup of the sugar, cinnamon, ginger, nutmeg and allspice. Scrape the seeds from the vanilla bean and add them and the bean to the saucepan. Stir at a medium heat until the sugar is dissolved and then just bring to a simmer. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the yolks and one-quarter cup of the sugar. Remove the bean from the cream mixture and whisk a small amount (not more than one-quarter cup) of the mixture into the egg yolks to temper them so they do not scramble. Slowly add all the cream to the yolks, whisking constantly, until the mixture is smooth and pale yellow. Put the pumpkin puree in a large bowl and gradually whisk in the cream mixture until completely incorporated and smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the custard through a very fine sieve into a chilled pitcher. Pour the mixture into six four-ounce molds. Set the molds in the oven in a baking pan containing enough hot water to come one inch up the sides of the molds. Bake for 20 to 30 minutes or until set. To determine if the custard is done, lightly tap the sides of the custard dish; if the mixture &quot;makes waves&quot; then it is not done. Cool slightly on a wire rack, cover with plastic wrap and refrigerate for at least two hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler just before serving. Evenly sprinkle one teaspoon of granulated sugar on top of each custard. Broil until the sugar caramelizes, anywhere from one to four minutes, depending on broiler's heat. Watch carefully so the sugar doesn't burn; it should be a golden brown. Serve in individual molds on dessert plates."}]}