{"@context": "http://schema.org", "@type": "Recipe", "name": "Crepes", "description": "", "author": {"@type": "Person", "name": "Dena Kleiman"}, "image": null, "totalTime": "PT15M", "recipeYield": "10 eight-inch crepes", "recipeCuisine": "french", "recipeCategory": "lunch", "keywords": "all-purpose flour, eggs, milk, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 27}, "recipeIngredient": ["2 large eggs", "1 cup unbleached, all-purpose flour", "1 cup milk", "1/2 cup water, approximately", "2 tablespoons butter, melted", "Corn or safflower oil for greasing pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl combine eggs and flour with a wire whisk. Blend with milk, making sure to eliminate all lumps. Add water and butter. Batter should have the consistency of light cream. Cover with plastic wrap and refrigerate at least an hour or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to prepare crepes, check consistency of batter and add additional water if necessary. Lightly grease a heavy skillet with a few drops of corn or safflower oil. Heat over medium flame until a drop of water sizzles. Using a ladle, gently pour about three tablespoons of batter into the pan, swirling the pan quickly so that the entire bottom is covered with the thinnest possible layer of batter. Cook for less than one minute, until golden brown. Then, using a spatula, flip the crepe and cook the other side for less then 30 seconds. It is not necessary to add oil after each crepe is prepared."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Eat immediately with butter and jam or stack on a plate and store, covered with plastic wrap, in the refrigerator for up to three days to be reheated with a filling of choice later. Some fillings like sliced Gruyere or ham may be added to the crepes as the second side is cooking. Stuffed crepes should be folded into the center from the top and bottom."}]}