{"@context": "http://schema.org", "@type": "Recipe", "name": "Greens In Phyllo", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT1H", "recipeYield": "5 dozen", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "greens, phyllo, side dish, vegetarian, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 82, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "4 grams", "sodiumContent": "55 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 bunches fresh young kale or mustard greens, about 1 pound", "1 clove garlic, peeled and minced", "1/4 cup pine nuts", "3 tablespoons olive oil", "1 medium onion, peeled and finely diced", "1 medium red bell pepper, cored and finely diced", "1/4 cup dry white wine", "1/4 teaspoon dried rosemary", "1/8 teaspoon cayenne", "1 1/2 cups grated Gruyere cheese", "1/2 cup grated Parmesan cheese", "Salt and freshly ground black pepper to taste", "1 egg", "1 1/2 cups (3 sticks) unsalted butter, melted", "1/2 of a 1-pound package of phyllo dough, thawed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the stems and coarse veins off the greens. Rinse the leaves well and spin dry. Chop them finely and set aside with the garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 300 degrees. Spread the pine nuts on a baking sheet and toast until golden brown, shaking occasionally, about five to seven minutes. Cool and chop coarsely. Set aside. Raise the oven temperature to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large skillet over medium heat. Saute the onion and bell pepper until soft, about five minutes. Raise the heat to medium-high and add the greens, garlic, wine, rosemary and cayenne. Cook, stirring constantly, until the greens are limp and bright green, about five to seven minutes. Transfer to a mixing bowl and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the Gruyere, Parmesan and pine nuts. Season with salt and pepper to taste. Beat the egg lightly and stir it in. Blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter a large sheet of wax paper. Unwrap the phyllo and remove one sheet, keeping the rest covered with a damp dish towel. Lay the sheet over the buttered paper. Brush thickly with more butter. Top with a second sheet and butter again. With a sharp knife, cut the sheets crosswise into eight strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place about a teaspoon of the greens mixture at the bottom of each strip. Fold the strips up flag style to make triangular packets. Place on a buttered baking sheet. Repeat with the remaining phyllo and filling. (Packets can be made to this point and refrigerated until ready to bake.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to bake, brush the packets with melted butter. Bake them for 20 to 25 minutes, until they are crisp and golden brown. Cool slightly before serving."}]}