{"@context": "http://schema.org", "@type": "Recipe", "name": "Rick Moonen's Cioppino", "description": "This recipe may look laborious. To simplify, chef Moonen suggests making the consomme a day in advance and refrigerating it, or up to one month in advance and freezing it.", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "fish, seafood, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "recipeIngredient": ["1/4 cup olive oil", "1 large onion, sliced", "1 red bell pepper, cored, seeded and sliced", "1 green bell pepper, cored, seeded and sliced", "2 serrano or jalapeno peppers, seeded and chopped", "Salt and freshly ground pepper to taste", "1 teaspoon dried basil", "1 teaspoon, plus one pinch, dried oregano", "1 teaspoon, plus one pinch, dried thyme", "1 bunch of parsley stems", "6 cloves garlic, chopped", "1#12-ounce can plum tomatoes", "4 1/2 cups fish stock or bottled clam juice (see note)", "2 cups dry white wine", "2 cups bottled clam juice", "1 pound firm-fleshed white fish (can be any nonoily fish, such as monkfish, flounder, sole, grouper or scallops)", "1 medium onion, chopped", "2 stalks celery, chopped", "1 leek, washed and chopped", "1 cup red or green bell pepper, cored, seeded and chopped", "10 plum tomatoes, fresh or canned, chopped", "2 bay leaves", "1 tablespoon peppercorns", "12 egg whites", "1 pound firm-fleshed fish such as red snapper, striped bass or sea bass, filleted and cut into bite-sized pieces", "1 pound raw large shrimp, shelled and deveined", "1 dozen small clams, washed", "1 dozen sea scallops", "1 pound lump crab meat", "2 dozen cultivated mussels", "2 red bell peppers, cored, seeded and diced large", "2 yellow bell peppers, cored, seeded and diced large", "6 fresh plum tomatoes, seeded and diced large", "1/2 bunch Italian parsley, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, heat the olive oil until it is smoking. Add the onions, peppers and salt and pepper to taste. Cook over medium heat, stirring, for five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the basil, one teaspoon of the oregano, one teaspoon of the thyme, half of the parsley stems and the garlic. Cook for one minute. Add the 12-ounce can of tomatoes with the juice and bring to the boil. Add the stock, wine and clam juice, bring to a simmer over medium-low heat and cook for 20 minutes. Strain the broth through a fine sieve, pressing on the vegetables to extract all the flavor. Set aside the broth and discard the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, place the fish trimmings and pulse the machine on and off until the fish has the consistency of ground beef. Remove the fish to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the onion, celery, leek, pepper and tomatoes in the food processor and pulse on and off until ground. Mix this with the ground fish. With a whisk, whip in the remaining oregano and thyme, the remaining parsley stems, the bay leaves, peppercorns and half the egg whites, until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, whip the remaining egg whites until they form a soft peak. Fold them into the fish and vegetable mixture. Transfer to a large, tall pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another pot, bring the fish broth to a rolling boil. Ladle some of the hot fish broth into the pot containing the fish, vegetable and egg-white mixture, whisking with each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When you have about one-third of the hot liquid incorporated, pour the rest in at once. Whip the mixture well with a whisk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pot over high heat. As the mixture heats up, the egg white mixture on the top will become more solid, forming a raft. When this happens, reduce the heat to low. Using a ladle, push a hole through the center of the raft. This will allow you to see the mixture as it cooks. Do not allow the mixture to boil; if it does, it will not become clear. Simmer slowly for 30 minutes. Ladle out the consomme through the hole and strain through a wet towel. Discard the raft. Once the consomme has cooled, it can be refrigerated for one day or frozen for up to one month."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean pot, bring the clarified consomme to the boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the fish pieces, the shellfish and the peppers in a pot. Pour the boiling consomme over the fish. Simmer until the clams and mussels open up, about four to five minutes after it returns to the simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide into hot soup bowls. Garnish with tomatoes and parsley."}]}