{"@context": "http://schema.org", "@type": "Recipe", "name": "John Clancy's King's Cake", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H5M", "recipeYield": "6 - 8 servings", "recipeCuisine": "british", "recipeCategory": "", "keywords": "all-purpose flour, citron, pecan, dessert, vegetarian, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 462, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "9 grams", "sodiumContent": "328 milligrams", "sugarContent": "14 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 package active dry yeast", "1/2 cup granulated sugar", "1/4 cup lukewarm water", "4 to 4 1/2 cups all-purpose flour", "2 teaspoons salt", "1/2 teaspoon freshly ground nutmeg", "2 teaspoons finely grated lemon peel", "3/4 cup milk", "5 large egg yolks", "8 tablespoons unsalted butter, at room temperature", "2/3 cup finely chopped citron", "1 pecan half", "1 egg yolk, beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the yeast and one-half teaspoon of the sugar into the lukewarm water. Let the mixture stand until it foams about four to six minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the remaining sugar, four cups of the flour, salt, nutmeg, lemon peel, milk, egg yolks, butter and the yeast mixture. Stir all the ingredients together until the liquid is absorbed by the flour. Remove the dough from the bowl and place it on a lightly floured work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead the dough by pushing it forward and folding it back in half on top of itself. Continue to knead the dough for 15 to 20 minutes, or until it is smooth and elastic. Where necessary, sprinkle the dough with enough flour to keep it from sticking to your hands or the work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough in a large buttered bowl and turn it to coat it with the butter. Cover the bowl with plastic wrap or a towel and let the dough rise for about one hour or until it doubles in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the dough from the bowl to the work surface and very gently knead the citron into it, just until the citron is well incorporated. Return the dough to a clean, well-buttered bowl and coat it with butter as before. Cover the bowl and let the dough rise for 45 minutes to one hour, or until it doubles in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch the dough down in the bowl, then transfer it to the work surface, and shape it into a 14- to 16-inch-long cylinder. Press the pecan half into the dough so that it is completely encased. Place the cylinder on a buttered and floured cookie sheet and shape it into a ring by twisting and then overlapping the end securely. Brush the entire surface of the cake with beaten egg yolk and let it rise again for about one hour, or until it doubles in size. Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the cake on a rack in the middle of the oven for 35 to 45 minutes, or until it is golden brown. Transfer the cake to a wire rack to cool."}]}