{"@context": "http://schema.org", "@type": "Recipe", "name": "Pralines", "description": "This deeply Southern and unapologetically sweet candy recipe came to The Times by way of Julia Reed in an article about making one's own edible holiday gifts. Her friend, Mary Cooper “can do anything: she canes chairs, she's an excellent gardener, she even makes her own cheese. And at Christmas she always makes me the best pecan pralines I have ever tasted.” Ms. Cooper was kind enough to share her recipe with Ms. Reed who, in turn, shared it with us. As you spoon the warm praline mixture onto the parchment paper, work quickly. It dries in a snap. Some have been known to sprinkle the tops of the wet pralines with flaky sea salt before they harden.", "author": {"@type": "Person", "name": "Julia Reed"}, "image": "https://static01.nyt.com/images/2017/12/12/dining/pralines/pralines-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "2 dozen", "recipeCuisine": "", "recipeCategory": "project", "keywords": "dark brown sugar, pecan, dessert, vegetarian, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 112, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "8 milligrams", "sugarContent": "18 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup firmly packed dark brown sugar", "1 cup granulated sugar", "1/2 cup evaporated milk", "1 cup pecan halves or pieces", "2 tablespoons butter", "1 1/2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep, 2-quart heavy saucepan, combine the brown sugar, granulated sugar and milk and cook over medium heat, stirring constantly until the sugars melt. Cook, stirring frequently to keep mixture from bubbling over, until a candy thermometer reads 228 degrees. Add the pecans and butter and stir until butter melts. Continue cooking until thermometer reaches 232 degrees. Remove from heat and stir in the vanilla. Allow to cool, stirring occasionally, until the mixture loses some of its gloss."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the praline mixture onto parchment paper, forming 24 thin patties, each about 2 inches in diameter. Let cool at least a half hour. Wrap individually in wax-paper squares."}]}