{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Latke with Smoked Salmon (Crique Stephanioise)", "description": "", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": null, "totalTime": "PT45M", "recipeYield": "About 2 large criques or 10 small criques", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "gold potatoes, smoked salmon, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 624, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "7 grams", "proteinContent": "20 grams", "saturatedFatContent": "7 grams", "sodiumContent": "925 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound baby Yukon Gold potatoes (approximately 6 small potatoes), peeled and grated", "1 extra-large egg", "3 tablespoons chopped chives", "1 tablespoon fresh finely chopped parsley", "1 tablespoon chopped black olives (optional)", "Coarse salt and freshly ground pepper to taste", "3 to 4 tablespoons extra virgin olive oil, plus oil for greasing ring molds", "Coarse salt to taste", "2 tablespoons sour cream", "4 ounces smoked salmon, cut in strips", "Juice and zest of 1 lemon", "1 teaspoon finely chopped chives", "1 teaspoon finely chopped black olives", "Freshly ground pepper to taste", "1 teaspoon finely chopped parsley", "Extra virgin olive oil for drizzling on the plate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the grated potato in a medium bowl. With a wooden spoon, stir in the egg, chives, parsley and olives. Season with salt and pepper, and stir well to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make large criques, warm 1 1/2 tablespoons of the olive oil in a medium nonstick pan over high heat. With your fingers, scoop out one half of the potato mixture, squeeze out the excess liquid between your hands and drop in the center of the pan. Using a fork or spatula, flatten the mixture firmly. Cook the crique over low to medium heat for about 6 to 8 minutes, until golden brown. Flip and cook for an additional 3 to 4 minutes, or until the exterior is crisp and golden brown and the interior is tender. Repeat using the remaining olive oil and potato mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make small criques, lightly brush the insides of three 3 1/2-inch-diameter ring molds with olive oil. Heat the pan with additional oil, and place the molds into the pan. Squeeze the excess liquid out of the potato mixture between your hands, and place 1 1/2 tablespoons inside each ring. Proceed as above, cooking for 3 to 4 minutes on the first side. Using tongs, remove the molds from the criques and gently press with a spatula. Flip and cook for an additional 1 to 2 minutes, or until the exterior is crisp and golden brown and the interior is tender. Set the criques aside. Repeat until remaining olive oil and potato mixture are used up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, sprinkle the criques with salt and top with a dollop of sour cream. Place a small mound of the smoked salmon on top, and drizzle some of the lemon juice over the salmon. Sprinkle with the lemon zest, chives and black olives, and season with pepper. Garnish with parsley, and drizzle some olive oil around the plate. Serve immediately."}]}