{"@context": "http://schema.org", "@type": "Recipe", "name": "Good Fruitcake", "description": "The ridicule that most fruitcakes face has everything to do with bad recipes, which skimp on fruit and load on the batter. In a good fruitcake the batter should barely be perceptible, acting merely as adhesive to bind the fruit and nuts. Broken down into its parts, a good fruitcake contains ingredients that most people love: plump dates, candied cherries, almond extract, pecans, walnuts and sugar. And when it comes out of the oven, it is showered in whiskey. This is by no means an inexpensive cake to make, and that is largely why it became a traditional gift. It is a cake that you wouldn't make for yourself. It is a treat.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2015/12/10/dining/10COOKING-GOODFRUITCAKE1/10COOKING-GOODFRUITCAKE1-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "2 fruitcakes", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "dessert, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 200}, "recipeIngredient": ["Butter for pans", "1 pound pitted Medjool dates", "1/2 pound prunes from Agen or use more dates", "1 pound candied pineapple", "1 pound candied cherries", "1 cup chopped candied orange peel, or 1/4 cup freshly grated orange zest", "2 cups sifted all-purpose flour", "2 teaspoons double acting baking powder", "1/2 teaspoon kosher salt", "4 eggs", "1 cup granulated sugar", "2 teaspoons almond extract", "2 cups shelled salted pistachios", "1 cup shelled almonds", "2 1/2 cups shelled pecans", "2 cups shelled walnuts", "White corn syrup", "1/3 cup Armagnac, bourbon or whiskey"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter two 9-inch springform pans. Line with parchment paper, and butter again. Heat oven to 275 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely chop dates, prunes and pineapple. Combine fruit in a bowl with cherries and orange peel. Sift together the flour, baking powder and salt. Sift this over fruit. With your hands, toss to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In medium bowl, beat eggs until frothy. Beat in sugar, then almond extract. Pour over fruit. With wooden spoon, mix well. Fold in pistachios, almonds, pecans and walnuts, and mix until coated with batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide mixture between pans. Using your hands, pack batter firmly and fill in open spaces. Bake for about 1 1/2 hours, until tops of cakes look dry but not brown. When cakes are done, transfer to cooling racks. Let stand for 5 minutes, then release springform and peel off parchment paper on sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While cakes are still hot, brush lightly with corn syrup. Let cool 30 minutes, then spoon Armagnac on top. When completely cool, remove cakes from pan base and peel off parchment paper on bottom. If not eating right away, wrap fruitcakes in plastic wrap. They will keep for two months in refrigerator. If storing, sprinkle with more Armagnac an hour before serving."}]}