{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Steak", "description": "For \"grilling\" a steak indoors, a cast iron pan really can't be beat. Cast iron can withstand super high heat, and it distributes that heat evenly, meaning you get a perfect brown crust that seals in the meat's juices. You don't need much in the way of seasoning; just a generous sprinkle of salt and freshly ground black pepper. A standard cast iron pan works great for this, or if you like the look of grill marks, get your hands on a ridged cast-iron grill pan.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/06/30/dining/30COOKING-SLICED_STEAK1/30COOKING-SLICED_STEAK1-articleLarge.jpg", "totalTime": "PT55M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, steaks and chops", "keywords": "main course, steak", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 413}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 324, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "0 grams", "proteinContent": "24 grams", "saturatedFatContent": "11 grams", "sodiumContent": "298 milligrams", "sugarContent": "0 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["2 steaks (sirloin strip, rib-eye or other), 8 to 10 ounces each and about 1 inch thick", "Course salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If time allows remove steaks from packaging, dry with paper towels, put on a plate and refrigerate a day or two. If not, wrap in paper towels and set on counter about 30 minutes. (If you're really in a hurry, just proceed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees (550 if possible), and set a rack in the lowest position, unless skillet can be placed directly on oven floor. Place a cast-iron skillet large enough to hold steaks without crowding over high heat, and heat until smoking. Sprinkle surface of pan with coarse salt, and put steaks in. Smoke will billow up; wearing a thick oven mitt, immediately transfer skillet to oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast steaks, turning once, about 4 minutes a side for medium rare, or until browned and cooked to preferred doneness. Sprinkle with salt and pepper, and let rest 3 to 5 minutes. Slice steaks or cut each into two pieces, and serve."}]}