{"@context": "http://schema.org", "@type": "Recipe", "name": "Glazed Pears With Brown-Sugar Oat Crisp and Pear-Brandy Syllabub", "description": "In the 1940s, Robert E. Rich, an independent-minded son of a successful dairyman, introduced RichWhip, the first nondairy topping, to the world. It took off. \n\nThis recipe can be made using RichWhip, which is still available at many kosher supermarkets, or heavy cream.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/Glazed-Pears-With-Brown-Sugar/Glazed-Pears-With-Brown-Sugar-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves 8", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "bosc pear, oats, dairy-free, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 784, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "96 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "11 grams", "proteinContent": "7 grams", "saturatedFatContent": "23 grams", "sodiumContent": "914 milligrams", "sugarContent": "63 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 1/4 pounds (about 8) Bosc pears, peeled, quartered lengthwise, cored and cut into 1/4 -by-1-inch pieces", "2/3 cup sugar", "1 tablespoon plus 1 teaspoon flour", "Salt", "Grated zest and juice of 1 lemon", "1 1/2 teaspoons grated ginger", "1 1/2 teaspoons vanilla extract", "5 tablespoons butter or margarine", "1/2 cup flour", "1/2 cup chopped almonds", "3/4 cup oats", "3/4 cup light brown sugar", "1/2 teaspoon cinnamon, plus more for garnish", "1/4 teaspoon salt", "1/2 cup (1 stick) butter or margarine, cut into 1/2 -inch pieces", "1 1/2 cups heavy cream or RichWhip", "1/4 cup sugar (if using RichWhip, omit sugar)", "1/4 cup pear brandy (Poire William), optional (if using RichWhip, use 1/3 cup)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. In a large mixing bowl, combine the pears, sugar, flour, 1/4 teaspoon salt, lemon zest and ginger. Mix in 1 tablespoon lemon juice and the vanilla."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet fitted with a lid, melt the butter over medium-high heat. Add the pear mixture and sauté for 2 minutes. Pour in cup water and bring to a boil. Cover and cook at a gentle boil for 20 minutes. Uncover and simmer, stirring every 10 minutes, until most of the liquid evaporates, about 40 minutes more. Add the remaining lemon juice and keep at a gentle boil, stirring occasionally, until the liquid becomes syrupy, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the crisp: In a large bowl, combine the flour, almonds, oats, brown sugar, cinnamon and salt. Cut in the butter with a pastry blender or 2 forks, then mix the dough with your hands until combined and crumbly. Transfer to a small baking sheet and cook until golden, 20 to 25 minutes. Stir the crisp, then let cool and break into pieces with a wooden spoon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the syllabub: Whisk the cream with an electric mixer until it starts to thicken. If using heavy cream, gradually pour in the sugar. Add the brandy, if you choose, one tablespoon at a time, tasting after each addition. Turn the mixer to high and whip to soft peaks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the dessert: in clear glasses, place a layer of pears, followed by a layer of crisp (about 1/3 cup each per serving). Top each with syllabub and dust with cinnamon. Or assemble in a large trifle bowl."}]}