{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Cakes", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "boneless fish fillets, bread crumbs, mayonnaise, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 37}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 497, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "30 grams", "fiberContent": "2 grams", "proteinContent": "36 grams", "saturatedFatContent": "10 grams", "sodiumContent": "607 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Olive oil", "1 1/2 pounds cod, striped bass or other fish fillets", "Sea salt", "1 tablespoon chopped parsley", "3/4 cup fresh, soft bread crumbs", "1 egg", "1/4 cup mayonnaise", "1 tablespoon Dijon mustard", "3/4 cup fine, dry bread crumbs", "4 tablespoons butter", "1 lemon, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Sprinkle the base of a baking pan with a thin film of olive oil. Lay the fish skin (or skinned) side down. Sprinkle with about a tablespoon of olive oil and season with salt. Bake until the fish is just cooked through, 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lift the cooled fish from its skin, leaving behind any bones or brown parts, and break it into small pieces as you drop it into a mixing bowl. Add the parsley and fresh bread crumbs. Whisk together the egg, mayonnaise and mustard and pour it over the fish. Use a fork to lift and fold the fish. Don't overmix. Pour the dry bread crumbs into a bowl. Pat the fish into 8 3-inch cakes and coat with the bread crumbs. The fish cakes may be covered and chilled for up to a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large sauté pan over medium heat. If the fish cakes have been chilled, also preheat the oven to 350 degrees. When the sautépan is hot, add the butter. As soon as it stops foaming, lay the fish cakes in the pan. Let them be until they are browned on the bottom, 2 to 3 minutes. Turn and cook for another 2 minutes. If the fish cakes were chilled or are not thoroughly hot in the center, place the pan in the oven and bake until heated through, about 4 more minutes. Serve with a wedge of lemon and tartar sauce."}]}