{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Lamb With Garlic", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT3H45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "garlic, leg of lamb, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 713, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "1 gram", "proteinContent": "52 grams", "saturatedFatContent": "19 grams", "sodiumContent": "1011 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 leg of lamb, 4 or 5 pounds, bone in", "5 cloves garlic", "1 tablespoon sea salt", "1 tablespoon freshly ground black pepper", "1 tablespoon sugar", "4 ounces slab bacon", "1 tablespoon olive oil", "1 1/2 cups thinly sliced yellow onions", "1 cup red wine", "2 bay leaves", "1 tablespoon chopped fresh thyme, or 1/2 teaspoon dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Trim lamb of any visible fat or skin. Peel garlic cloves and slice. Then, using the point of a sharp knife, prick the flesh of the lamb and insert a slice of garlic in each incision, using all garlic. Rub lamb with salt, pepper and sugar (the sugar helps give it a caramel-brown color) and place on a rack in a pan and put in the hot oven. Let brown 15 minutes; turn over and brown 15 minutes more. Remove from oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While lamb is cooking, cut rind from bacon and slice into small lardons, about 1/2 inch long. Bring small pot of water to boil. Add bacon pieces, return to boil and drain immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat olive oil in a braising pot large enough to hold the lamb leg. Saute bacon lardons in the oil until brown. Remove and set aside. In the bacon fat, saute sliced onions over medium-low heat until soft and a golden color; this will take 15 to 20 minutes. When onions are done, remove, draining well, and set aside. Discard remaining fat. Wipe pot with paper towel to remove all traces of grease."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lamb in braising pot. Deglaze pan in which lamb was cooked by adding wine and, over high heat, scraping the brown bits from the bottom. Add resulting wine gravy to the braising pot. Decrease oven heat to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add onions, bacon, bay leaves and thyme to lamb. Add water if necessary - the liquid should barely cover the onions and bacon. Bring to a simmer over medium-low heat, cover and place in 300-degree oven. Cook 2 to 2 1/2 hours. If you wish to add sage-flavored beans (see recipe), do so after 1 1/2 hours of cooking time. When done, the lamb may be served immediately or set aside, Mediterranean fashion, to cool to just above room temperature before serving. Serve with onions, bacon and, if used, sage-flavored beans."}]}