{"@context": "http://schema.org", "@type": "Recipe", "name": "Honey-Fried Chicken", "description": "This recipe came to The Times in 1986 from the Dallas kitchen of Stephan Pyles, a native Texan whose culinary star still shines over the state. It is a sophisticated twist on a classic, dousing a skin crisp with white and whole-wheat flour in a creamy sauce of lemon, mint and thyme. This is not exactly weeknight cooking — you’ll need to marinate the chicken in honey and vinegar for at least two hours before frying — so consider it for a Sunday supper, a savory treat before the work week begins.", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 26}, "recipeIngredient": ["1 four-pound chicken, cut into serving pieces", "1/2 cup honey", "2 1/2 tablespoons vinegar, preferably raspberry or other fruit-flavored vinegar", "Salt, if desired", "Freshly ground pepper to taste", "1/2 cup lard", "1/2 cup corn, peanut or vegetable oil", "1/2 cup all-purpose flour", "2 tablespoons whole-wheat flour", "1/2 cup dry white wine", "1/2 cup rich chicken broth", "1 1/2 cups heavy cream", "1 tablespoon finely chopped fresh thyme leaves or one teaspoon dried", "1 teaspoon freshly grated lemon rind", "1 1/2 tablespoons finely chopped fresh mint leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken pieces in a mixing bowl. Blend the honey and vinegar and pour it over the chicken. Stir to coat the pieces evenly. Let stand at least two hours, stirring occasionally. Drain the pieces on paper toweling but reserve and set aside two tablespoons of the marinade. Sprinkle chicken with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the lard and oil in a 12-inch frying pan to a temperature, if a thermometer is available, of 360 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, combine the all-purpose flour with the whole-wheat flour. Add the chicken; stir to coat all over. Shake off excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pieces skin-side down in the hot fat and cook, turning the pieces often, until they are golden brown all over and cooked through, about 20 minutes or longer. The dark meat pieces generally require a longer cooking time than the white."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off most of the fat from the pan, leaving the brown particles that may cling to the pan. Do not wipe out the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the wine with the chicken broth. Heat the skillet and add the mixture, stirring to dissolve the brown particles. Cook until reduced by half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cream, thyme, lemon rind, mint and the two tablespoons of reserved marinade. Cook until reduced to about two cups. Put the sauce through a fine sieve, pressing to extract all the juices from the solids. Reheat and season with salt and pepper to taste. Spoon sauce over the chicken and serve."}]}