{"@context": "http://schema.org", "@type": "Recipe", "name": "Fricassee of Lobster And Mussels", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "fennel, lobster, mussels, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1011, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "4 grams", "proteinContent": "76 grams", "saturatedFatContent": "33 grams", "sodiumContent": "2222 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 sweet peppers, preferably 1 red and 1 yellow", "6 tablespoons butter", "4 large cloves garlic, peeled and lightly crushed", "1 cup fish broth", "2 cups dry white wine", "1 1/2 cups heavy cream", "1 cup coarsely chopped onion", "4 sprigs fresh thyme", "4 sprigs fresh parsley", "2 bay leaves", "1/4 teaspoons peppercorns, preferably white", "1 cup water", "2 live lobsters, about 1 1/4 pounds each", "20 mussels, about 1 3/4 pounds, well scrubbed", "3/4 cup finely shredded fresh fennel", "1/4 cup finely shredded fresh basil", "Salt to taste", "Freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a swivel-bladed paring knife, scrape off the outer skin of the peppers. Set the scrapings aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away and discard the core of each pepper. Cut each pepper in half and discard the veins and seeds. Cut each half into lengthwise strips, about 1 inch wide. Cut each strip into diamond shapes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the butter in a saucepan and add the garlic and the pepper scrapings only. Cook, stirring, about 2 minutes. Add the fish broth and 1 cup of the wine and bring to a boil. Let simmer about 10 minutes or until reduced to about 1 1/2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cream and bring to a boil. Cook about 8 minutes or until reduced to about 2 2/3 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "As the sauce cooks, bring enough water to a boil in a kettle to cover the lobsters when they are added."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate kettle, combine the remaining 1 cup of wine, the onion, thyme, parsley, bay leaves, peppercorns and 1 cup of water in a small kettle and bring to a boil. Let simmer about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a saucepan with a sieve and pour in the sauce that has been cooking on the stove. Press to extract as much liquid as possible from the solids. Discard the solids. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lobsters to the boiling water and cover closely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mussels to the second kettle containing the onion mixture. Let the mussels cook about 3 or 4 minutes or until they are all opened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the lobsters have cooked 5 minutes, drain them. Crack the lobster shells and remove the meat from the tail and claws in neat pieces. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the coral and liver from the body of each lobster and add the pieces to the container of a food processor or electric blender. Remove the tough outer shell from the body of one lobster and discard the shell. Add the remaining shelled body it to the processor. Add the remaining 5 tablespoons butter and blend as thoroughly as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the sieved sauce to a boil and add the butter mixture, stirring. Pour the mixture into a sieve, preferably of the sort known in French kitchens as a chinois. Press to extract as much liquid as possible from the solids. Discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the sauce to the heat and add the fennel and let cook 1 minute. Add the sweet pepper diamonds. Cook about 2 minutes. Add the basil, salt and pepper to taste. Stir and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the lobster tails on the bias into medallions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the hot sauce over a serving dish and arrange the lobster pieces symmetrically on top. Arrange the mussels around the lobsters and serve."}]}