{"@context": "http://schema.org", "@type": "Recipe", "name": "Plum Tart", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, plum, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "7 grams", "sodiumContent": "100 milligrams", "sugarContent": "32 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour, plus more for rolling", "1/4 teaspoon salt", "1/4 teaspoon sugar", "6 tablespoons cold unsalted butter, cut in 1/2-inch slices", "1/4 cup ice water", "2 1/2 tablespoons all-purpose flour", "10 to 12 tablespoons sugar", "1 to 1 1/4 pounds firm ripe plums, halved, pitted and sliced 3/8 inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, combine the flour, salt and sugar in a medium bowl. Using your hands or a pastry cutter, combine half of the butter slices with the flour until mixture resembles coarse meal. Cut in the remaining butter slices until the dough forms chunks the size of large peas. Stir in the water with a fork. The dough should hold together when pressed. If it doesn't, add a few more drops of ice water. Shape the dough into a ball and chill for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. On a lightly floured surface, roll the dough into a rough circle about 15 inches in diameter. Do not try to make a perfect circle -- its roughness is part of its charm. Place the dough onto a baking sheet lined with parchment paper. Refrigerate for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, combine the flour with 3 tablespoons of the sugar. Spread the flour-sugar mixture over the dough, leaving a 2-inch rim uncovered. Lay the plums over the flour-sugar mixture in an even layer. Sprinkle the plums with 4 to 6 tablespoons of the sugar, depending on the sweetness of the plums."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold the 2-inch edge over the plums, gathering it to fit. Brush the edge of the pastry liberally with water and sprinkle generously with 3 tablespoons sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until plums are tender and pastry is well browned, with spots where the sugar has caramelized, about 45 minutes. Immediately slide the tart from the pan to a rack. Brush the top of the fruit with some of the juices to glaze it slightly. Allow the tart to cool. Serve with vanilla ice cream."}]}