{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Quail Salad", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": null, "recipeIngredient": ["4 quail, about 3/4 pound each, cleaned weight", "1 1/2 tablespoons Dijon-style mustard", "2 tablespoons peanut, corn or vegetable oil", "1 teaspoon finely minced garlic", "1 tablespoon finely minced fresh thyme leaves or half the amount dried", "1 tablespoon coarsely ground peppercorns", "Salt to taste if desired", "16 cups mixed salad greens such as spinach, curly chicory, radicchio and/or romaine, cut or torn into large, bite-size pieces", "Sherry vinegar vinaigrette (<a href=\"http://cooking.nytimes.com/recipes/2117-sherry-vinegar-vinaigrette\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The quail may be prepared and seasoned the day before. If they are, cover with plastic wrap and refrigerate until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully run a sharp knife lengthwise up and down one side of the backbone of each bird. Open each up, skin side down, on a flat surface, and carefully run the knife lengthwise up and down the other side of the backbone to cut it away. Discard the backbones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently press with the fingers on either side of the breast bones to make the birds lie flat. Carefully cut away breast bones, using the knife tip."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub quail evenly on both sides with the mustard and oil. Smear them with the garlic, thyme, peppercorns and salt. Put the quail in a bowl and let stand until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook quail, preheat a charcoal grill or the oven broiler to high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange quail skin side down and flat on the charcoal grill or, if the broiler is to be used, place a rack on a baking dish and arrange the quail skin side up. Grill about 5 minutes on one side and turn. Cook 3 to 5 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the broiler, place quail about 4 inches from heat source. Broil about 4 minutes and turn. Broil about 3 to 5 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve quail put the salad greens in a large skillet and start heating, stirring. Quickly pour the salad dressing over all and toss briefly until warm and the salad greens start to wilt. Do not overcook or allow greens to wilt completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange an equal portion of greens on each of 4 salad plates. Arrange 1 quail on each serving."}]}