{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Boar and Black Bean Chili", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "Six to eight servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "black beans, wild boar, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 312, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "470 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup bacon drippings", "2 large cloves garlic, crushed", "3 tablespoons chili powder", "1/8 teaspoon ground cumin seeds", "1/4 teaspoon freshly ground black pepper", "1 saddle of wild boar (or loin of pork with bone in), 3 1/2 to 4 pounds", "1 pound black turtle beans", "2 tablespoons olive oil", "1/2 cup diced salt pork", "2 medium onions, chopped", "3 medium cloves garlic, minced", "1 large jalapeno pepper, seeded, deveined and minced", "1 cup (about 5 ounces) diced, cooked, smoky ham, preferably Smithfield", "2 cups beef broth, plus more if needed", "1 bay leaf", "1 teaspoon chopped fresh oregano, or 1/2 teaspoon dried", "1 teaspoon red-wine vinegar", "2 tablespoons dark rum", "3 to 4 cups cooked rice", "4 scallions, thinly sliced, for garnish", "2 hard-cooked eggs, sieved, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, combine the bacon drippings with the crushed garlic, two tablespoons of the chili powder, the cumin and freshly ground pepper. Spread over the wild boar and let stand while preparing the beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot, cover the beans with cold water. Heat to boiling and boil for two minutes. Turn off the heat and let stand one hour. Drain. Wipe out the pot and return the beans, cover with cold water and heat to boiling. Reduce heat and simmer uncovered for 30 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees. Cook the salt pork in boiling water for five minutes. Drain and pat dry with paper towels. Heat the oil in a heavy, deep casserole. Stir in the salt pork and cook over medium heat until golden, about three minutes. Stir in the onion, minced garlic and jalapeno pepper; cook one minute. Stir in the ham; cook two minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the remaining tablespoon of chili powder into the onion mixture. Add the beans, two cups of the broth, the bay leaf, oregano, vinegar and rum. Mix well. Place the saddle of boar on top of the beans, cover and put in the middle of the oven. Cook for one-and-a-half to two hours, or until internal temperature reads 170 degrees on a meat thermometer, turning the meat twice and stirring the beans. Add more broth if too dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat and allow it to stand, covered, for 10 to 15 minutes. Meanwhile, skim the fat from the chili and boil the chili to thicken, if desired. Cut the meat from the bone, and into thin slices, and layer it over the beans. If desired, stew, covered, to tenderize the meat. Serve with the rice and a sprinkling of scallions and hard-cooked egg. Pass the remaining scallions and egg in separate bowls for garnish."}]}