{"@context": "http://schema.org", "@type": "Recipe", "name": "Gloria Slater's Stuffed Veal Pocket With Oyster Dressing", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "12 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, roasts", "keywords": "fall, ground veal, oyster, veal shoulder, main course", "aggregateRating": null, "recipeIngredient": ["1 16-ounce loaf day-old French bread cut in 1/2-inch cubes", "3 dozen raw oysters, shucked, drained and liquid reserved", "2 tablespoons vegetable oil", "1/2 pound ground pork", "1/2 pound ground veal", "8 scallions, half of their tops removed, minced", "6 cloves garlic, minced", "6 stalks celery, minced", "1/2 cup olives, chopped", "1/2 cup pecans, chopped", "1/2 cup parsley, minced", "1 teaspoon salt", "1 teaspoon pepper", "1 teaspoon dried thyme", "1/2 teaspoon cayenne pepper", "1/4 cup unseasoned bread crumbs", "6 pounds veal shoulder boned to form a rolled roast", "Salt and pepper to taste", "4 tablespoons vegetable oil", "4 tablespoons flour, sifted", "6 cloves garlic, chopped fine", "5 shallots, chopped fine", "1/2 cup parsley, chopped fine", "2 cups red wine", "2 cups veal stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, moisten the bread cubes with the oyster liquid. Heat the oil in a heavy-bottom pot over medium heat and cook the pork and veal. Stir in scallions, garlic and celery and cook for 10 minutes more, stirring frequently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the oysters and cook an additional 10 minutes, stirring frequently. Add bread cubes, olives, pecans, parsley and the rest of the dressing seasonings and stir well. Add bread crumbs and mix well. Refrigerate for at least 1 hour and up to a day in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Rub the veal shoulder on both sides with salt and pepper. Lay out with fat side down, spread dressing evenly across and roll into a spiral. Tie the roast tightly using pieces of string at 1-inch intervals and tie lengthwise 2 or 3 times. Place the meat in a roasting pan and roast uncovered for the first hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile make a roux: In a small, heavy pot, heat the oil over medium heat and slowly add the sifted flour, stirring constantly; cook, stirring to prevent burning, until mixture is reddish brown, about 4 minutes. Remove from heat and add the garlic, shallots and parsley and cook for 1 minute. Return to medium heat and gradually stir in the wine and stock until the gravy is thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After 1 hour, pour the gravy over the roast, cover and return to the oven for an additional hour. Remove and allow the roast to set for an hour before slicing in 1/4-inch pieces. Serve with gravy."}]}