{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Lobster With Basil Vinaigrette", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "basil, lobster, olive oil, main course, summer", "aggregateRating": null, "recipeIngredient": ["4 quarts water (see note)", "1 tablespoon peppercorns", "Salt to taste if desired", "1/2 teaspoon dried thyme", "2 bay leaves", "1/4 teaspoon dried hot red pepper flakes", "4 1 1/2-pound live lobsters", "10 or 12 leaves fresh basil, rinsed and patted dry", "1/2 cup olive oil", "1/4 cup finely chopped shallots", "2 tablespoons balsamic vinegar", "Three-salad chiffonade (<a href=\"http://cooking.nytimes.com/recipes/2326-three-salad-chiffonade\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the water, peppercorns, salt, thyme, bay leaves and pepper flakes in a kettle large enough to hold the lobsters. Cover and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lobsters quickly, one at a time, and cover. When the water returns to a boil, cook the lobsters for 10 minutes and drain thoroughly. When the lobsters are cool enough to handle, break off the tails and remove the meat from each in one piece. Crack the large claws and remove the meat from each in one piece. Remove the meat from the remaining claw shells. Put all the meat in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stack the basil leaves and cut them into fine shreds. There should be about 1/2 cup. Add to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the olive oil, shallots, vinegar and salt in a small mixing bowl and toss to blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut each piece of tail meat on the bias into 1/2-inch-thick medallions. Reassemble the slices from one lobster tail on a plate. Arrange two of the large pieces of claw meat at the top of the tail meat to resemble a lobster shape. Spoon about a quarter of the sauce over the tail and claw meat. Scatter a quarter of the small pieces of lobster meat around. Garnish each side of the tail meat with a quarter of the recipe for three-salad chiffonade. Repeat with the remaining lobster meat and three-salad chiffonade."}]}