{"@context": "http://schema.org", "@type": "Recipe", "name": "Fillet Of Sole With Greens And Mango Yogurt Sauce", "description": "", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT3H", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "lettuce, mango, sole, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 669, "unsaturatedFatContent": "48 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "60 grams", "fiberContent": "9 grams", "proteinContent": "6 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1281 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup light olive oil", "1 small red chili pepper, seeded, deveined and cut into strips", "1/4 cup raspberry vinegar (or less, depending on the acidity)", "1/2 teaspoon Dijon-type mustard", "Salt and freshly ground white pepper to taste", "1/2 cup yogurt", "1/3 cup mayonnaise (preferably homemade)", "1/2 teaspoon curry powder", "1 scant tablespoon cilantro, chopped", "1/4 cup of the diced mango cubes chopped fine (see below)", "1 bunch cress, an inch of stem removed, washed and dried thoroughly", "1 small red oak leaf lettuce, washed and dried thoroughly", "1 small salad bowl lettuce, washed and dried thoroughly", "4 medium-large artichoke hearts, steamed, trimmed and julienned", "1/2 pound small string beans, trimmed (preferablly haricots verts)", "1 bunch baby carrots, trimmed so some of the green remains, and cleaned", "1 small mango, peeled and diced into 1/2-inch squares", "1 tablespoon lemon juice", "1 tablespoon unsalted butter", "4 fillets of sole, preferably gray or lemon (about 1 3/4 pounds)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the dressing, heat the oil with the chili pepper over low heat until the oil reaches 125 to 135 degrees, or warm to the touch. Remove from the heat and allow to steep for two hours. Reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine the vinegar, mustard and the seasonings and mix thoroughly. Gradually whisk in the chili oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, in a small bowl combine the yogurt and mayonnaise and whisk in the curry. Allow to set for half an hour. Then add the remaining ingredients for the sauce. Cover and chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear the greens into bite-size pieces. Wrap in a towel and refrigerate. Refrigerate the artichoke hearts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a small pot of lightly salted water to the boil. Add the beans and cook for two to five minutes, or until just tender. Drain under cold water and drain again. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat the process with the carrots and cook for three to five minutes or until just tender. Drain under cold water and drain again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the diced mango with the lemon juice in a small bowl and cover tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the fish, in a large Teflon pan, melt one tablespoon of butter over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the fish over medium heat for two or three minutes on each side. Set aside in a warm place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the greens, vegetables and remaining mango with enough dressing to coat the greens. Divide among four plates. Carefully place the sole over the greens. Serve immediately and pass the sauce at the table."}]}