{"@context": "http://schema.org", "@type": "Recipe", "name": "Shu Mai: (Chicken-And-Shrimp Pastries)", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT40M", "recipeYield": "24 shu mai", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "chicken, shrimp, wonton skins, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 122, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "252 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound skinless, boneless breast of chicken", "1/2 pound raw, peeled, deveined shrimp, rinsed thoroughly and patted dry", "1 egg white", "1 teaspoon cornstarch", "1/2 teaspoon salt, if desired", "1 teaspoon sugar", "1 teaspoon light soy sauce", "1 teaspoon finely chopped fresh ginger", "1 teaspoon Shaoxing or dry sherry wine", "2 tablespoons finely chopped green onion", "1 tablespoon finely chopped fresh coriander leaves", "24 won-ton skins, widely available in supermarkets and Oriental grocery stores"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away and discard any membranes or peripheral fat from the chicken breast. Place the breast on a flat surface and cut it into the thinnest possible slices. Stack the slices and cut them into very thin shreds. Cut the shreds into very fine cubes. Chop the cubes with a cleaver or a heavy sharp knife. Or blend the meat in a food processor, but do not process to a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the shrimp by hand or in the container of a food processor until it has the same consistency as the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the chicken and shrimp in a mixing bowl and add the egg white. Add the cornstarch, salt, sugar and soy sauce and blend. Blend the ginger and wine. Squeeze to extract the liquid. Discard the ginger. Add the liquid to the chicken and shrimp mixture. Beat briskly about five minutes. Add the green onion and coriander and blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If the won-ton skins are square, cut them into rounds or circles. To do this, stack the won-ton skins and cut them into circles about three inches in diameter. Cut around with a cleaver, a sharp knife or a three-inch biscuit cutter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Hold one round won-ton skin in the hand and fill the center with one tablespoon of the filling. Bring up the edges of the won ton skin to enclose the filling all around, but leaving the top of the meat mixture exposed. Smooth over the top. As the shu mai are filled, arrange them open side up on a steamer rack without crowding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring water to a boil in the bottom of a steamer rack. Place the rack with shu mai over the boiling water and cover tightly. Let steam eight minutes. A sauce is not essential for shu mai, but if desired, vinegar, soy sauce, Sichuan paste and hot mustard may be added."}]}