{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb Chops In Phyllo Pastry", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 first-course servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "lamb, phyllo, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 765, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "2 grams", "proteinContent": "23 grams", "saturatedFatContent": "24 grams", "sodiumContent": "2918 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 lamb chops cut from a rack of lamb, the meaty portion of each chop about 1 inch thick (see step 1)", "Salt to taste if desired", "Freshly ground pepper to taste", "1 teaspoon corn, peanut or vegetable oil", "3/4 teaspoon finely chopped fresh rosemary or half that amount dried", "1 tablespoon finely chopped shallots", "1/4 teaspoon coarsely cracked black peppercorns", "4 cloves peeled roasted garlic", "16 cut-to-order rectangles of phyllo pastry, each measuring about 6 by 8 inches", "3 tablespoons melted butter", "1 2/3 cups roasted yellow pepper sauce (<a href=\"http://cooking.nytimes.com/recipes/2393-roasted-yellow-pepper-sauce\">see recipe</a>)", "3/4 cup roasted red pepper puree (<a href=\"http://cooking.nytimes.com/recipes/2394-roasted-red-pepper-puree\">see recipe</a>)", "Small cutout rectangles or diamonds of fresh green or red peppers for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The chops used must be cut from the rack. It is best that the butcher prepare them to order: The chine bone of a rack of lamb should be cut off and removed and the chops cut between the ribs, leaving the ribs intact and the meaty portion of each chop at least 1 inch thick. Have any fat or other coating trimmed from the perimeter of the meaty portion. Ask that each rib be scraped clean to make them ''French style.'' Sprinkle the chops with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a small skillet and add the rosemary, shallots and peppercorns. Smash the peeled roasted garlic cloves (they will be soft after roasting) to a fine pulp. Add this pulp to the skillet. Cook briefly, stirring, about 30 seconds. Remove from the heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stack two rectangles of phyllo pastry, one atop the other. Brush the top rectangle with butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The meat will be attached to the bottom of the rib. Insert a small paring knife in the center of the meaty portion at the base to make a hole for stuffing. Using the fingers, stuff each hole with an equal portion of the garlic filling. Press the meaty portion so that it will set flat with the rib standing upright."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chop, rib upright, on one corner of the buttered rectangle of dough. Bring up the pastry all around to completely enclose the meat, folding and tucking it under as necessary. Leave the rib exposed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stack two more rectangles of pastry and brush the top rectangle with butter. Place the pastry-wrapped chop on the rectangles and neatly wrap these pastry pieces around the chop. Continue filling chops and wrapping them in the four layers of dough. Brush the outside of each pastry-wrapped chop with a little more butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chops, ribs up, on a baking sheet and bake 20 minutes or until pastry is browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about 1/4 cup of well-heated yellow pepper sauce onto each of four plates. Spoon about 3 tablepoons of well-heated red-pepper puree in the center. Arrange one chop, rib upright, in the center of the red sauce. Garnish, if desired, with small cutouts of fresh green or red pepper."}]}