{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb With Sichuan Pepper And Orange", "description": "", "author": {"@type": "Person", "name": "Robert Farrar Capon"}, "image": null, "totalTime": "PT20M", "recipeYield": "2 or more servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "dairy-free, lamb, orange, sichuan peppercorns, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["1/4 cup peanut oil", "Rind of a large, fragrant orange, cut into eighths (white pulp removed)", "2 hot red chili peppers", "2 tablespoons Sichuan peppercorns (ordinary black peppercorns, crushed, may be substituted)", "3/4 pound lean raw lamb", "Salt to taste", "2 large onions, sliced into thin rings"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a wok and fry the orange peel in it until lightly browned. Remove both oil and peel and set aside. When the peel is cool enough to handle, cut it into fine julienne strips. Reserve the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Seed the chili peppers and cut them into julienne strips. Add to the orange shreds and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the peppercorns in a dry skillet, toast them over moderate heat until they begin to smoke, then remove and crush fine in a mortar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the lamb across the grain into fairly uniform slices ( 3/8 inches thick and 1 to 1 1/2 inches long). Put them in a bowl and mix thoroughly with the crushed pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the wok in which the peel was fried until very hot, spread out the lamb slices in a single layer and fry them for 1 minute without moving them. Then stir-fry vigorously for 10 to 20 seconds and remove quickly to a serving dish. (They will still be raw in the center at this point.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the wok, heat the reserved orange oil until hot again, add salt to taste and stir-fry the onion rings until nicely browned. Add the orange peel, the red-pepper shreds and the lamb, stir-fry for 5 to 10 seconds and dish up. Serve over noodles dressed with a little sesame oil and soy sauce."}]}