{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Celery Hearts With Tomato And Olives", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 - 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "celery, niçoise olives, tomato, fall, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 454, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "47 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "6 grams", "proteinContent": "9 grams", "saturatedFatContent": "4 grams", "sodiumContent": "653 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["4 large heads celery", "Salt", "14 1/2 ounce can diced tomatoes in juice, drained", "3/4 cup extra-virgin olive oil", "black pepper", "1 large onion, finely diced", "1/2 cup white wine", "1/2 cup chicken broth", "24 whole, pitted Nioise olives, soaked in hot water for 15 minutes and drained", "Pinch of sugar (optional)", "16 salt-packed anchovy fillets, julienned (optional)", "4 cups toasted breadcrumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Leaving root ends intact, strip off outer branches, leaving about 2 pounds tender, leafy inner stalks. Cut into 8-inch lengths . Quarter lengthwise, place in large mixing bowl, toss with salt, set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oven racks in top position, preheat broiler. Place tomatoes in pie plate, drizzle with one tablespoon oil, sprinkle with salt and pepper. Broil, stirring occasionally, until surface moisture evaporates and tomatoes are charred, about 10 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm 2 tablespoons olive oil in large skillet over medium heat. Add onions, saute until soft and golden, stirring frequently, about 7 mintues. Transfer onions to shallow 3-quart gratin dish. Warm 3 tablespoons olive oil in same skillet over medium heat. Place celery flat side down in a singer layer, sprinkle with salt and pepper, and sear without moving, until celery is golden brown on one side, about 4 minutes. Turn hearts with tongs and brown second side. Transfer celery to dish with onions, arrange snugly. Add 3 tablespoons more olive oil to skillet, brown remaining celery. Arrange in gratin dish. (Celery should be in a single layer.) Slide tomatoes over celery and onions. Add wine and stock to gratin dish, drizzle vegetables with remaining oil. Shake dish gently to settle vegetables. Position black olives in low spots so they don't dry out."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust oven racks to middle position and preheat oven to 350 degrees. Set gratin dish over low flame and bring to a simmer. Taste liquid and season with salt, if necessary, or a pinch of sugar if acidic. Shake pan to distribute. Cover with foil, transfer to oven and bake until celery is tender, 30 to 40 minutes. Remove foil, increase oven temperature to 475 degrees, bake until tips of vegetables are brown, 5 to 10 minutes. Garnish with julienned anchovy fillets and toasted breadcrumbs, if desired."}]}