{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Capon Breast With Corn And Pea Risotto", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "capon, risotto, veal, main course", "aggregateRating": null, "recipeIngredient": ["1 7- to 7 1/2-pound capon, breast separated, boned and cut in 2", "Meat from the capon legs", "1/4 pound ground veal", "1/2 cup heavy cream", "1/4 pound fresh leaf spinach (tough stems removed), washed, blanched, drained and finely chopped", "1 ounce freshly grated Parmesan cheese", "Salt, freshly ground black pepper and freshly grated nutmeg to taste", "1 tablespoons unsalted butter", "1 tablespoon vegetable oil", "3 tablespoons unsalted butter", "2 shallots, finely chopped", "5 ounces Arborio rice", "1 1/2 ounces dry white wine", "3 to 4 cups strong chicken stock, heated until hot", "5 ounces frozen tiny peas, defrosted", "5 ounces frozen corn kernels, defrosted", "2 tablespoons unsalted butter", "2 tablespoons whipped heavy cream", "Salt and freshly ground black pepper to taste", "Freshly grated Parmesan cheese", "2 cups chicken stock", "1 ounce Madeira", "2 ounces white wine", "1 to 1 1/2 cups heavy cream", "1 to 2 tablespoons unsalted butter", "Salt and freshly grated black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the stuffing, process the meat from the capon legs in a food processor, fitted with a steel chopping blade, until fairly smooth. Scrape it into a bowl. Add the veal and enough cream to bind. Stir in the spinach, grated cheese and salt, pepper and nutmeg to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Butter a baking dish large enough to hold the breasts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fillets from the breast halves and flatten them slightly. Cut a pocket in each piece. Divide the stuffing between the breasts, then sew them together with thread or secure them with toothpicks or tiny skewers. Season the outsides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter and oil in a heavy skillet over medium-high heat. When the butter has foamed, add the breasts and brown them on both sides. Transfer them to the baking dish and bake for 20 to 25 minutes, basting several times with the pan juices. Remove from the oven, cover loosely and let sit while finishing the risotto."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the capon is baking, melt three tablespoons of butter in a heavy casserole. When it has foamed, add the shallots and saute them over medium-high heat until soft. Add the rice, stir to coat with butter and cook for one minute. Pour in the wine and let it evaporate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the hot stock in ladlefuls, making sure each is absorbed before adding the next. Cook for about 20 minutes, or until al dente, stirring frequently. Add the peas and corn in the last five minutes. Before serving, stir in the remaining butter, cream, salt, pepper and grated cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While preparing the risotto, combine the chicken stock, Madeira and white wine in a saucepan. Bring the mixture to a boil over high heat and reduce it by one-third. Add the heavy cream and reduce it further, until it thickens. Whisk in the butter and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, remove the thread (or toothpicks or skewers) and slice the capon breasts. Place the slices alongside the risotto and spoon the sauce over the capon. Serve with fresh asparagus spears."}]}