{"@context": "http://schema.org", "@type": "Recipe", "name": "Poire Tart Tatin", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "butter, pastry dough, pear, dessert", "aggregateRating": null, "recipeIngredient": ["1 1/2 cups flour", "Salt", "12 tablespoons unsalted butter", "1 tablespoon sugar", "3 to 4 tablespoons ice water", "4 pounds Comice or Bosc pears", "1/4 cup sugar", "1/2 cup unsalted butter, melted", "Milk or egg yolk for glazing the pastry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry dough. By hand: Sieve the flour and the salt into a large bowl. Cut the butter into small pieces and work into the flour with two knives, crossing the blades and pulling them away from each other rapidly, using a light touch, until the mixture resembles course bread crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle on two tablespoons ice water. Gather the dough into a bowl and knead gently with the heal of your palm to bind. Shape into a ball and dust with flour. Place in a plastic bag and refrigerate for an hour."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "In a food processor:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the flour, salt and butter cut into pieces, into the bowl of the machine fitted with a steel blade. Buzz stop 15 times (each time long enough to count to three). Add the water and repeat 10 times. The dough should look like sticky coarse bread crumbs. It should not be allowed to form a ball in the machine or it will become difficult to roll out and the crust will be tough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the dough onto a floured surface and bind with the heel of your palm. Shape into a ball. Dust with flour, place in a plastic bag and refrigerate for an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, core and quarter the pears, and place them in acidulated water to stop them from turning brown. Put half the butter into an enameled cast iron skillet and sprinkle with sugar. Arrange the pears in circles on top and pour on the remaining butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the pastry dough to a circle big enough to leave an inch overhanging the pan. Place the pastry over the pears, turning the extra dough under. Using the point of a sharp knife, make several slits in the dough so that the air can escape while the tart is baking. Brush the pastry with milk or egg yolk and bake for 25 or 30 minutes or until the crust is golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven and using a bulb baster, remove excess liquid from the tart through a hole in the shell. Cook the tart on top of the stove over high heat for 10 to 15 minutes or until it caramelizes. Cool for 20 minutes and unmold, inverting a serving plate on top and turning the tart over. Serve at room temperature with heavy cream, whipped cream or creme fraiche."}]}]}