{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck Sausage", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT1H", "recipeYield": "11 or 12 sausages", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "duck, pistachio, main course", "aggregateRating": null, "recipeIngredient": ["2 ready-to-cook ducks, about 6 pounds each (see note)", "1/4 teaspoon crushed dried thyme", "1/2 bay leaf, broken into small pieces and finely chopped", "1/4 teaspoon allspice", "Salt to taste, if desired", "Freshly ground pepper to taste", "1/2 cup shelled, blanched pistachios"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "It is best to prepare these sausages one day in advance and refrigerate them until ready to cook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away and reserve the meat from the ducks. There should be about 2 pounds of meat. Discard the bones and any fibrous membranes. Reserve 1/4 pound duck fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the duck meat into 1-inch cubes and put in a mixing bowl. Chop up the duck fat and add it and the thyme, bay leaf, allspice, salt and pepper. Blend well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a sausage stuffer, put half the duck mixture into the container of a food processor and blend until the mixture is slightly finer than hamburger. Repeat with the remainder. Combine the two batches and add the pistachios. Blend well in a bowl. Follow the manufacturer's instructions for filling the sausage casings. If using a meat grinder and stuffer, follow the manufacturer's instructions for stuffing the casings. When the filling has been added, pinch off the casing and tie a knot at each end. Tie a piece of string at 5- or 6-inch intervals. There should be 11 or 12 sausages. Wrap the sausages in clear plastic wrap and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook, cut off as many lengths of sausage as desired. Prick each sausage all over, forming pin-sized holes. Grill or broil the sausages, turning as necessary, about 15 minutes or until done. Or preheat the oven to 375 degrees. Place the sausages in a skillet and add 1/8 inch water. Bring the water to a boil on top of the stove and place the skillet in the oven. Bake 15 to 20 minutes, turning once, or until the sausages are done."}]}