{"@context": "http://schema.org", "@type": "Recipe", "name": "Alain Sailhac's Lamb Fillet With Elephant Garlic", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2H40M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "dry white wine, garlic, lamb, main course", "aggregateRating": null, "recipeIngredient": ["1 full saddle of lamb (about 10 pounds with bones), boned", "2 carrots, sliced", "3 stalks celery, sliced", "1 small onion, sliced", "1 bottle dry white wine", "2 quarts water", "1 clove garlic, crushed", "2 tomatoes, chopped", "2 sprigs parsley", "1/2 teaspoon thyme", "2 bay leaves", "2 heads elephant garlic", "1/2 pint heavy cream", "1/2 cup water", "Coarse salt and freshly ground pepper to taste", "2 ounces butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Remove any fat from the two fillets, wipe them dry with paper towels and set them aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the lamb bones in a roasting pan or large cast-iron skillet and roast them in the oven until browned. Add the carrots, celery and onion, spreading them over the bottom of the pan so they're able to brown, and roast for five to 10 minutes. Using a slotted spoon, remove the bones and the vegetables and place them in a large stock pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the white wine, water, garlic, tomatoes, parsley, thyme and bay leaves. Simmer, uncovered, for 45 minutes or until reduced by one-third. Remove bones and vegetables, and pour the stock into a smaller pot. Continue reducing the sauce until you have only half a cup of liquid. (This may take an hour.) Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the elephant garlic cloves and blanch them in boiling water for two minutes. Drain and simmer for 30 minutes in the cream and water. Puree in a food processor. Return to the saucepan, season with salt and pepper and add the butter. Mix thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Heat a cast-iron pan over high heat. When very hot, add the lamb fillets, and brown them on all sides. Slide the pan into the oven for five minutes or so for rare lamb, longer if you want it more done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the lamb thinly and arrange the slices on heated individual dishes, garnishing each serving with a little sauce under the meat, and a dollop of a garlic puree on the side."}]}