{"@context": "http://schema.org", "@type": "Recipe", "name": "'21' Club Hamburger", "description": "When the “21” Club reopened in the spring of 1987, the new menu — not to mention the new décor — was the talk of both the food world and the society that considered the place home. The principal question in food circles about the menu had nothing to do with such elegant fare as breast of guinea hen or lobster. No, it was the direction of the restaurant's “new” hamburger that stirred the most curiosity. Craig Claiborne and Pierre Franey went to investigate, and the result was this marvelous, butter-rich recipe for hamburger, one that should take its place in your repertory.", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "One hamburger", "recipeCuisine": "", "recipeCategory": "lunch, burgers", "keywords": "butter, ground chuck, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "recipeIngredient": ["8 tablespoons butter at room temperature", "1 tablespoon finely chopped fresh thyme", "2 tablespoons finely chopped fresh basil", "1 tablespoon finely chopped fresh parsley", "12 ounces freshly ground choice chuck (preferably with a 22 percent fat content)", "Salt to taste, if desired", "Freshly ground pepper to taste", "2 slices Italian peasant bread, each slice about 1/2 inch in thickness and 5 inches in diameter", "3 tablespoons olive oil", "2 to 4 thin slices red, ripe tomatoes", "2 thin slices red onion", "2 teaspoons freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the butter, chopped thyme, one tablespoon chopped fresh basil and chopped fresh parsley. Blend well. Place the mixture on a rectangle of waxed paper or aluminum foil and roll it into a sausage shape about one inch in diameter. Place in the freezer for an hour or longer, until it is frozen. This butter may be used a portion at a time and refrozen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a gas or charcoal broiler to high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the meat into a round ball without kneading. With the finger, make a partial indentation through the center of the ball. Shove one frozen tablespoon of butter into the center of the ball and press to close the opening. Flatten the meat into a patty shape about three-quarters of an inch thick. Sprinkle on both sides with salt and pepper. Place the meat on the grill and cook about four minutes until it is well seared on one side; turn the meat and cook about four minutes longer or to the desired degree of doneness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the bread slices on one side with one tablespoon of olive oil. Place the slices oiled side down on the grill and cook briefly until lightly toasted. Turn and cook briefly on the second side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, as the meat cooks, place the tomato and onion slices in a small bowl and sprinkle with the remaining two tablespoons of oil, the lemon juice, salt, pepper and remaining tablespoon of chopped fresh basil. Toss briefly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one slice of the warm grilled bread on a dinner plate, place the hamburger in the center and cover with the second slice of bread. Serve the tomato and onion slices on the side to be added to the hamburger as desired. Serve tomato ketchup only on request. The hamburger is also served with freshly cooked gaufrette potatoes on the side."}]}