{"@context": "http://schema.org", "@type": "Recipe", "name": "Gotham Bar And Grill Hamburger", "description": "“I use freshly ground trimmed ends from strip steak or chopped sirloin,” Alfred Portale, the chef at Gotham Bar & Grill, told Craig Claiborne and Pierre Franey of The Times in 1987. “The meat,” he continued, “must be seared well so that it is crisp on both sides and moist in the center. We serve the hamburgers on so-called hard — not spongy — buns with a sesame topping and with sliced tomato, onion and leaves of bibb lettuce.” The side garnishes were classic dill pickles, pickled green tomatoes and French fries. Portale used 9 ounces of meat for each hamburger. That’s a lot. But you can’t argue with the finished dish.", "author": {"@type": "Person", "name": "The New York Times"}, "image": null, "totalTime": "PT20M", "recipeYield": "One hamburger", "recipeCuisine": "", "recipeCategory": "lunch, burgers", "keywords": "ground sirloin, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 16}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 783, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "8 grams", "proteinContent": "59 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1675 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["9 ounces freshly ground sirloin steak, preferably with a 10 to 15 percent fat content", "Salt to taste, if desired", "Freshly ground pepper to taste", "1 sesame-seed hamburger bun (see note)", "1 slice red, ripe tomato", "1 1/4-inch thick sliced red onion", "1 pickled green tomato", "1 small pickled sweet pepper", "1 classic dill pickle", "French-fried potatoes"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a gas or charcoal grill to high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shape the meat loosely, pressing gently without kneading, into a patty about one inch thick and about four and one-half inches in diameter. Season the meat on both sides with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the meat on the grill and cook three to three and a half minutes on each side for a rare hamburger; four to four and a half minutes on each side for a medium-well hamburger, and five minutes on each side for well-done. A rare hamburger will be soft to the touch; a medium-well, slightly springy, and well done, firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toast both bun halves on the cut side until lightly browned. Arrange the bottom half, cut side up, on a dinner plate. Place the meat on top and cover with a slice of tomato and slice of onion. Cover with the other half of the bun. Garnish with pickled green tomato, pickled sweet pepper, classic dill pickle and french fries. Serve with tomato ketchup on the side."}]}