{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Black-Bean Soup", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "Eight servings", "recipeCuisine": "american", "recipeCategory": "soups and stews", "keywords": "appetizer, black beans, ham, pumpkin, fall, high fiber", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 55}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 327, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "11 grams", "proteinContent": "19 grams", "saturatedFatContent": "4 grams", "sodiumContent": "642 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound black beans, washed and picked over", "1 teaspoon salt", "3 tablespoons unsalted butter", "1 1/2 cups finely chopped onions", "3 large cloves garlic, minced", "3/4 cup canned tomatoes, drained", "1 cup fresh or canned pumpkin puree", "6 ounces boiled ham, cut into 1/8-inch cubes", "2 1/2 to 3 1/2 cups beef stock", "1 tablespoon ground cumin", "3 to 4 tablespoons sherry vinegar", "1 teaspoon salt, or to taste", "Freshly ground black pepper", "1/2 to 1 cup medium sherry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beans in a heavy saucepan and cover with boiling water to a level of about two inches above the beans. Add one teaspoon of salt, return to the boil and then simmer, partially covered, for about two to three hours or until the beans are tender. Add more water if beans become dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the butter in a heavy skillet over medium heat. When it has foamed, stir in the onions and garlic and saute for 8 to 10 minutes or until lightly colored and tender. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans are tender, stir in the tomatoes and transfer to a processor fitted with a steel chopping blade. With a few on-off motions, process until the beans have started to smooth out, but are still somewhat chunky. This will have to be done in batches. Return the beans and tomatoes to the saucepan and stir in the pumpkin, ham and two-and-a-half cups of stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sauteed onions and garlic, cumin, vinegar, salt and pepper and stir to mix well. Bring this mixture to the boil and then reduce heat and continue cooking uncovered for another 20 to 25 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the sherry and taste for salt, additional vinegar and other seasonings. If soup is too thick, add stock or sherry. If too thin, continue cooking until thicker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, use a handsome pumpkin and cut off the lid in a scalloped or zigzag pattern. A so-called sugar pumpkin has fewer seeds and heavier meat. Remove the seeds and pull off the strings from them. Toast the seeds on a flat pan in a preheated 400-degree oven in two tablespoons of oil for seven to nine minutes or until they are well colored. Remove from the oven and sprinkle with salt. Fill the pumpkin with soup and use the toasted seeds as croutons."}]}