{"@context": "http://schema.org", "@type": "Recipe", "name": "Mary Perpich's Apple Strudel", "description": "", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": null, "totalTime": "PT1H50M", "recipeYield": "10 to 12 servings", "recipeCuisine": "austrian", "recipeCategory": "", "keywords": "apple, butter, sugar, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 531, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "6 grams", "proteinContent": "8 grams", "saturatedFatContent": "11 grams", "sodiumContent": "275 milligrams", "sugarContent": "21 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 1/2 cups bread flour or unbleached all-purpose flour", "1 teaspoon salt", "1/2 cup warmed vegetable oil, plus 2 tablespoons", "2 eggs", "2/3 cup lukewarm water", "12 apples, peeled and diced", "1 to 2 cups sugar, depending on the tartness of the apples", "2 teaspoons cinnamon", "1 cup bread crumbs", "1/2 pound unsalted butter, melted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 150 degrees or to its lowest setting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 3 cups of the flour and the salt. Make a well in the flour, and into the well add the 1/2 cup of the oil, the eggs and water. Mix with a fork, and then knead well with your hands, about 20 minutes. Add more flour -enough to make a soft but not sticky dough. Put the dough in a ceramic bowl, cover with the remaining 2 tablespoons oil, and place in the oven until the dough is warm and easy to pull, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a table or other flat surface that is at least 3 feet by 5 feet, spread a clean sheet so that the edges hang slightly over the sides. Sprinkle the sheet with flour, and roll out the dough to form a 9-by-13-inch rectangle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The novice may want to ask a friend to help stretch the dough. Using your hands, start stretching and lifting the dough with your fingertips until you can see through it. When you are finished, the dough should cover the table's surface. Try to minimize the number of holes, but a few won't matter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the apples over the dough. Sprinkle with sugar, cinnamon and bread crumbs. Dribble about three-fourths of the melted butter over the mixture. Taking hold of the sheet on the longer (5-foot) side, lift the sheet up and over the apples to start rolling up the dough jellyroll-style. Place the strudel in a greased jellyroll or baking pan, large enough to hold the pastry comfortably. You will probably have to form the pastry into a large crescent to fit. If desired, freeze the strudel and bake later, or pour the remaining butter on top of the strudel and bake at 350 degrees for 50 to 60 minutes or until golden. If the strudel begins to brown too quickly, cover with foil."}]}