{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Mushrooms", "description": "This classic hors d'oeuvres recipe first appeared in The Times in a February 1981 column by Craig Claiborne on the then-popular topic of no-salt cooking. Mushrooms, he said, are “the one basic ingredient best suited to a no-salt cookery,” noting a “depth of flavor” and “a meat-like consistency.”  We may have relaxed our beliefs regarding our salt consumption, but this more than 30-year old recipe remains a reader favorite. It's also blessedly easy to make. After removing the stems from the mushrooms, you simply sauté the caps with a little butter, lemon juice and black pepper (we won't tell if you add a little salt). Make a simple stuffing of chopped mushroom stems, shallots, garlic, celery, thyme, egg, bread crumbs and shredded Gouda. Stuff the mushroom caps, drizzle with butter and bake for about 15 minutes. See? The 1980s weren't so bad.", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": "https://static01.nyt.com/images/2017/04/05/dining/05COOKING-STUFFSHROOMS1/05COOKING-STUFFSHROOMS1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, bread crumbs, cheese, mushroom, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 586}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 146, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "6 grams", "sodiumContent": "331 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/4 pounds mushrooms", "4 tablespoons butter", "Juice of 1 lemon", "Freshly ground pepper to taste", "1/3 cup coarsely chopped shallots", "1/2 teaspoon minced garlic", "1 cup coarsely chopped celery, optional", "1/4 teaspoon dried thyme", "1 small bay leaf", "1/4 cup coarsely chopped parsley", "1 egg, lightly beaten", "1/4 cup fine fresh bread crumbs", "1/4 cup grated cheese, preferably low-sodium cheese, such as Gouda", "Salt and pepper, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and reserve the mushroom stems. There should be about two cups. Chop the stems coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the butter in a saucepan and add the mushroom caps. Sprinkle with the juice of half a lemon and a generous grinding of pepper. Cook, stirring often but gently so as not to break the caps. This is to remove the moisture from the caps. Cook about two minutes. Remove the caps to a platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add one tablespoon of butter to the saucepan and add the shallots and garlic. When they've begun to soften, add the chopped mushroom stems and juice of the remaining half a lemon. Add the celery, thyme and bay leaf. Cook, stirring often, about five minutes. Remove the bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon and scrape the mixture into the container of a food processor. Add the parsley and process to a fine puree."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the mixture to a saucepan and cook, stirring often, about five minutes. Add the egg and bread crumbs. Cook about 10 seconds, stirring, and remove from the heat. Stir in cheese. Salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stuff the caps with an equal amount of the filling. Smooth over the tops. Arrange the caps as they are stuffed close together in a baking dish. Sprinkle with two tablespoons of melted butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mushrooms caps in the oven and bake 15 minutes."}]}