{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Roulades With Shrimp", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne And Pierre Franey"}, "image": null, "totalTime": "PT45M", "recipeYield": "Eight servings", "recipeCuisine": "indonesian", "recipeCategory": "dinner", "keywords": "chicken, shrimp, vegetables, main course", "aggregateRating": null, "recipeIngredient": ["4 to 6 skinless, boneless chicken or capon breast halves, about 1 1/4 pounds", "7 large shrimp, about 1 1/2 pounds", "25 fresh coriander leaves", "Salt to taste, if desired", "4 thin slices lean salt pork, about 2 ounces", "32 thin, julienne strips carrot, each about 2 inches long", "32 thin, julienne strips hot green pepper", "32 thin, julienne strips scallions or green onions", "Oil for brushing the roulades", "1/2 teaspoon coriander seeds", "1/2 teaspoon caraway seeds", "2 teaspoons finely minced garlic", "1 tablespoon corn, peanut or vegetable oil", "1/2 cup finely sliced shallots", "1/4 cup light soy sauce", "1/2 cup rich chicken broth", "1/2 teaspoon dark brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "There are several ways that these roulades may be cooked. They may be broiled, charcoal-grilled or cooked in a skillet with a little oil. Preheat a broiler or charcoal grill or have a skillet ready."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the breast halves on a flat surface and cut off enough of the end pieces to make five ounces. Put the end pieces into the container of a food processor or electric blender and add the shrimp, coriander leaves and salt. Blend until it has the consistency of hamburger meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the salt pork slices in a small skillet and cook, turning the pieces often, until they are well browned and slightly crisp. Remove the slices from the skillet, and when they are cool enough to handle, cut them lengthwise into 32 thin, julienne strips."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken breast halves on a flat surface and cut them on the diagonal into approximately 16 thin slices. Pound each slice until it is quite thin and almost transparent. Spoon an equal amount of the ground shrimp-and-chicken mixture into the center of each slice. Smear this filling evenly over each piece. Stack two pieces each of the salt pork, carrot, green pepper and green onion over the center of the filling. Roll each slice over neatly and tightly, like small sausages, to enclose the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange four of the filled chicken pieces close together and run two skewers parallel and crosswise through the centers to hold the groupings of four together. Brush each grouping on all sides with a little oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the sauce, grind together the coriander seeds, caraway seeds and garlic, preferably in a mortar and pestle or in a small spice mill or grinder."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of oil in a small skillet and add the sliced shallots. Cook briefly, stirring, and add the ground spice mixture. Add the soy sauce, chicken broth and brown sugar and bring to the boil. Let simmer about five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cook the skewered chicken roulades as desired - under the broiler, on a grill or in a skillet. Cook about four or five minutes or less on one side. Turn the roulades and cook about four or five minutes on the second side. Spoon the sauce over the roulades and serve."}]}