{"@context": "http://schema.org", "@type": "Recipe", "name": "Ripe Cantaloupe Pie", "description": "", "author": {"@type": "Person", "name": "Janet Bukovinsky"}, "image": null, "totalTime": "PT2H", "recipeYield": "Two pies", "recipeCuisine": "southern", "recipeCategory": "", "keywords": "cantaloupe, eggs, pie crust, dessert, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 391, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "12 grams", "sodiumContent": "276 milligrams", "sugarContent": "22 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 1/2 cups flour", "1 teaspoon salt", "1 teaspoon sugar", "1 cup (2 sticks) unsalted butter, chilled", "7 to 8 tablespoons ice water", "3 eggs, separated, plus the white of an additional egg", "3/4 cup milk", "1/3 cup plus 6 tablespoons sugar", "1 large, ripe cantaloupe, peeled, seeded and cut into chunks", "1/2 teaspoon cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the piecrust, combine the flour, salt and sugar in a large bowl. Cut the butter into chunks and cut it into the flour mixture - one chunk at a time - using a pastry blender or two knives, until the mixture resembles coarse meal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gradually add the ice water, blending until the dough adheres and is no longer crumbly. Turn out onto a lightly floured surface and knead lightly, pressing the dough away from you with the heel of the hand. Gather into a ball, flatten into a disk, and wrap in plastic wrap. Refrigerate for half an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, beat the egg yolks with the milk and one-third cup of sugar in a heavy saucepan. Add the cantaloupe and cook over low heat, stirring often, until the mixture is somewhat thickened and the cantaloupe is soft, about 25 to 30 minutes. Remove from the heat and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Roll out the piecrust dough and fit it into two nine-inch pie pans. Crimp the edges and prick the bottom with a fork. Line the pans with foil, and weight with beans or aluminum pie weights. Bake for 15 to 18 minutes, removing the weights and foil during the last five minutes. Place on a rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the cooled pie shells with the cantaloupe mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, make a meringue by beating the egg whites until foamy. While still beating, add the cream of tartar. Continue beating until soft peaks form. Then beat in the six tablespoons of sugar, one at a time, until stiff peaks form."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the meringue mixture on the pies, making sure to fill in the pies completely and to cover the edges of the crust. Bake for eight to 12 minutes, until lightly browned. Cool completely before cutting. Serve immediately when cool, as the pies do not keep long."}]}