{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Potatoes With Sage and Garlic", "description": "The word “sage” is derived from the Latin word salvia, which means “safe, whole, healthy.” In ancient times, sage was viewed as a medical cure-all, at once a diuretic, an antiseptic and a tonic for digestive disorders, liver trouble and headaches; small wonder the plant maintained a premier spot in the herbal apothecary throughout the Middle Ages.\n\nOf solid character and haunting flavor, sage does better with robust, earthy peasant fare rather than with more refined cuisine. It pairs perfectly here with potatoes and stands up well to garlic. Enjoy with your favorite roasted or grilled meat.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": "https://static01.nyt.com/images/2016/11/16/dining/16COOKING-ROAST-POTATOES-GARLIC1/16COOKING-ROAST-POTATOES-GARLIC1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "garlic, potato, sage, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 225}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 272, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "7 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "467 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds small creamer potatoes, halved", "1/3 cup flour", "1 1/2 tablespoons vegetable oil", "4 cloves garlic, minced", "1/4 cup chopped sage leaves", "1 tablespoon unsalted butter", "Kosher salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees and place a large, heavy skillet or roasting pan in the oven to heat up. Place the potatoes in a large saucepan and cover with cold salted water. Place over high heat and bring to a boil. Lower the heat and simmer 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the potatoes well and place them on paper towels. Place the flour on a plate and when the potatoes are dry, roll them in the flour to coat, shaking off any excess. Remove the hot skillet from the oven and add the oil and potatoes. Roast, shaking the pan occasionally until the potatoes are golden brown all over, about 30 minutes. Remove from the oven and add the garlic, sage and butter. Return the pan to the oven for one minute. Season generously with salt and pepper and serve."}]}