{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Pie With Pepper", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "black pepper, pumpkin purée, dessert, fall", "aggregateRating": null, "recipeIngredient": ["Pastry for a 10-inch one-crust pie, chilled", "1 3/4 cups light cream (or 1 cup heavy cream and 3/4 cup milk)", "3 large eggs", "1/2 teaspoon vanilla extract", "3/4 cup packed, light brown sugar", "1/2 teaspoon salt", "1/4 teaspoon finely ground black pepper", "1/2 teaspoon ground ginger", "1/4 teaspoon mace", "1/4 teaspoon nutmeg", "2 cups solid-pack canned pumpkin or fresh pumpkin puree", "Whipped cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Roll out the pastry and line a 9-inch pie pan with it, making an extra-high, fluted rim. Lightly prick the bottom, line with foil and weight with pastry weights or dry beans. Bake 13 minutes. Reduce heat to 400 degrees, remove the foil and weights, and bake 7 minutes longer. Remove from the oven. Increase oven temperature to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cream in a small saucepan over moderate heat until little bubbles form around the edges. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs lightly in a large bowl. Beat in the vanilla, sugar, salt, pepper, ginger, mace and nutmeg. Add the pumpkin and mix well. Gradually beat in the hot cream. Pour into the baked pie shell, place in the oven and bake 10 minutes. Reduce heat to 350 degrees and bake about 40 minutes longer, until the center no longer seems liquid when the pie is gently shaken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the oven and serve warm or at room temperature with whipped cream."}]}