{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut jumbles", "description": "Old-fashioned and buttery-crisp, and from an old family recipe, these are perfect cookies for filling attractive tins.", "author": {"@type": "Person", "name": "Lisa Yockelson"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "About six dozen cookies", "recipeCuisine": "american", "recipeCategory": "", "keywords": "butter, cake flour, coconut, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 100, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "52 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 cups unsifted cake flour", "3 teaspoons baking powder", "1 teaspoon salt", "1/2 pound (two sticks) unsalted sweet butter, softened at room temperature", "2 cups granulated sugar", "1 whole egg, extra large", "2 egg yolks, extra large", "1 teaspoon pure vanilla extract", "4 tablespoons light cream", "About 2 cups sweetened, shredded coconut", "2 egg whites, beaten until frothy"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift the cake flour, baking powder and salt together; set aside. In the large bowl of an electric mixer, cream the butter until light. Add the granulated sugar in two additions, beating until fluffy after each portion is added. Add the whole egg; beat for one minute. Add the egg yolks and continue beating for an additional minute. Blend in the vanilla extract and light cream. In three additions, add the sifted flour mixture, mixing just until the flour particles have been absorbed. The dough is quite sticky at this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into three portions on sheets of wax paper; wrap up and refrigerate. Chill the dough until quite firm, at least four hours. (The dough may be kept, well wrapped and refrigerated, for up to four days before baking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured wooden board, roll out a portion of dough oneeighth-inch thick. Stamp out cookies with a three- or three-and-one-half-inch cutter and place them, at least two inches apart, on a cookie sheet lined with parchment paper. Repeat with the remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have the coconut at your side. Brush egg white over the surface of each cookie, then top with a generous sprinkling of coconut. Lightly press down the coconut so that it sticks to the cookie."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake each sheet of jumbles for 10 minutes in a preheated, 400-degree oven, on the lower third level. Remove the cookies from the sheet with a wide spatula to cooling racks. Store the jumbles in airtight containers."}]}