{"@context": "http://schema.org", "@type": "Recipe", "name": "Saucisson en Brioche (Sausage in brioche)", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "lunch", "keywords": "butter, flour, sausage, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 680, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "4 grams", "proteinContent": "21 grams", "saturatedFatContent": "18 grams", "sodiumContent": "473 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/4 cup warm milk (110 to 115 degrees)", "1/2 teaspoon sugar", "1 package dry yeast", "1 1/2 sticks sweet butter", "3 cups flour", "3/4 teaspoons salt", "4 large eggs", "1 egg yolk", "2 garlic sausages, about 1 1/4 pounds total (any favorite sausage will work; each should be about 1 1/2 inches long; if sausage is raw, cook and dry well)", "1 egg, beaten, for coating dough"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine sugar and warm milk in small dish and slowly stir in yeast. Mash yeast well if it forms lumps. Set mixture aside in warm place for 5 minutes; it should foam."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In food processor or mixer combine flour, salt and butter, blending well. Add eggs, 2 at a time, incorporating well before adding next 2. Add yoke and process until dough is elastic and smooth; it should pull away from beater in one piece. Some processors will not have enough power to finish job; if so remove and knead by hand on lightly floured surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dough in greased bowl, cover with damp cloth and let rise in warm place (80 to 90 degrees) for 2 hours or until it doubles in bulk. Punch down and knead for several minutes in bowl and form ball about size of softball."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If dough is difficult to work with, place in freezer for 5 minutes. (If you are not using right away, dough can be stored, covered, in refrigerator for day.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut dough ball in half and roll out each half into roughly 10-by-5-inch rectangles. Coat both dough ball and sausage with beaten egg, then sprinkle flour over dough to form ''glue'' that will hold sausage in place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay sausages on dough rectangles and bring up sides of dough to seal them, forming seams on top. Seal edges. Place rolls on buttered sheets of aluminum foil. Wrap foil around rolls same way dough was sealed, forming seam on top. They should be wrapped loosely to allow for expansion."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rolls on baking sheet, seam side down, and let them rise for 1/2 hour. Bake 35 minutes, rotating about every 12 minutes so sausage doesn't sink to one side. After 35 minutes, open foil, wash rolls with beaten egg mixture again and cook 10 minutes more. Let them cool before slicing and serving."}]}