{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon and Green Beans Pojarski With Cucumber Hot Sauce", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT31M", "recipeYield": "6 servings", "recipeCuisine": "russian", "recipeCategory": "dinner", "keywords": "bread crumbs, green beans, salmon, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 514, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "3 grams", "proteinContent": "35 grams", "saturatedFatContent": "6 grams", "sodiumContent": "567 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["About 1 3/4 pounds salmon (to accommodate trimming and removal of skin); you should have 1 1/2 pounds of cleaned flesh", "10 ounces fresh green beans", "1 1/2 cups fresh bread crumbs (from 3 to 4 slices fresh bread)", "1/2 to 3/4 (depending on size) of 1 whole jalapeno pepper, rib and seeds removed, and cut into 1/8-inch pieces (about 2 teaspoons)", "3 large eggs", "3 cloves garlic, peeled, crushed and chopped fine (about 3/4 teaspoon)", "1/2 teaspoon freshly ground black pepper", "1 1/2 teaspoons salt", "1/3 cup shredded basil", "Cucumber hot sauce (<a href=\"http://cooking.nytimes.com/recipes/3219-cucumber-hot-sauce\">see recipe</a>)", "4 tablespoons corn or safflower oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard any skin and sinew from the salmon and cut the flesh into 1-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away any damaged spots on the beans, wash thoroughly in cold water, and cut into 1-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the fresh bread crumbs, break fresh bread into pieces and grind in the bowl of a food processor. You should have 1 1/2 cups. (Note: fresh bread crumbs are superior to dry bread crumbs. If, however, fresh crumbs are not available, use half the amount of dry crumbs - 3/4 cup for this recipe.) Transfer to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the green beans and hot pepper in the bowl of a food processor and process until finely chopped; the mixture should be rather granulated, not smooth and liquid. You should have about 2 cups. Transfer to a bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the unwashed bowl of the processor, place the salmon and process for a few seconds, starting and stopping the machine, until coarsely chopped. Add to the bean puree with the eggs, bread crumbs, garlic, pepper, salt and shredded basil. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a spoon, make patties weighing about 3 to 3 1/2 ounces each. Wet your hands if you feel they will stick to the salmon mixture and arrange the patties on a tray lined with plastic wrap. You should have 12 patties, 2 per person, and each patty should be no more than 1 inch thick and about 3 inches across. Set aside while you make the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook the salmon, use 2 large skillets, preferably nonstick. Heat 2 tablespoons of the oil in each skillet. When hot, add the patties and cook over medium to high heat for 2 1/2 minutes on each side. Set aside for a few minutes before serving with cucumber hot sauce."}]}