{"@context": "http://schema.org", "@type": "Recipe", "name": "Chocolate-Pumpkin Layer Cake", "description": "This rich and decadent spiced pumpkin cake is just the thing to serve for an autumn celebration, Thanksgiving or otherwise. Chocolate chips and chopped pecans are added to the pumpkin batter for extra sweetness and a bit of welcome crunch. For those who like to plan ahead, it can be made and frozen – iced and all. Just put the entire finished cake on a plate or a baking sheet, unwrapped, and freeze it overnight until it is hard. Then it can be wrapped without damage to the frosting, and returned to the freezer. Layers can also be wrapped well and stored, to be iced later.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2015/09/23/dining/23PUMPKINCAKE/23PUMPKINCAKE-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "8 to 12 servings", "recipeCuisine": "", "recipeCategory": "cakes", "keywords": "chocolate, pecans, pumpkin purée, dessert, fall, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 986}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 765, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "94 grams", "cholesterolContent": null, "fatContent": "46 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "24 grams", "sodiumContent": "290 milligrams", "sugarContent": "86 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["20 tablespoons (2 1/2 sticks) soft unsalted butter, more for greasing", "2 cups flour, more for dusting", "1 teaspoon cinnamon", "1/2 teaspoon ground ginger", "1/2 teaspoon nutmeg", "1/4 teaspoon allspice", "1 teaspoon baking soda", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "1 1/2 cups granulated sugar", "3 eggs", "1 1/2 cup plain pumpkin purée, canned, frozen or fresh", "1 cup semisweet chocolate chips", "1 cup chopped pecans", "2 1/2 cups confectioners' sugar", "10 ounces bittersweet or semisweet chocolate, melted and cooled to room temperature", "1 teaspoon vanilla extract", "Milk or cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Use a little butter to grease two 9-inch round cake pans. Line bottoms with parchment paper. Butter and flour the paper. In a large bowl, whisk flour, cinnamon, ginger, nutmeg, allspice, baking soda, baking powder and salt together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an electric mixer, cream 8 tablespoons butter and the granulated sugar together until light and fluffy, about 3 minutes. Beat in eggs one at a time. Stir in pumpkin purée. Mixture may look slightly curdled. Stir in flour mixture about half a cup at a time until smooth. Fold in chocolate chips and pecans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter into pans and bake in middle of oven until springy to the touch and a tester inserted in center comes out clean, about 35 minutes. Cool cakes in pans for 10 minutes, run a knife around edges, invert onto racks and peel off paper. Let cakes cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, blend remaining 12 tablespoons butter and confectioners' sugar together. Blend in chocolate and vanilla extract and beat until smooth. If the frosting is too thick, add cream or milk by the tablespoon, blending well after each addition, until it reaches spreading consistency."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one cake layer, smooth side up, on a platter. Ice top. Place second layer, smooth side down, on top; ice top and sides of cake."}]}