{"@context": "http://schema.org", "@type": "Recipe", "name": "Swirled Persimmon Semifreddo", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/08/dining/semifreddo-still/semifreddo-still-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "8-10 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "amaretti cookies, heavy cream, persimmon, dessert, fall, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "0 grams", "proteinContent": "2 grams", "saturatedFatContent": "11 grams", "sodiumContent": "51 milligrams", "sugarContent": "13 grams", "transFatContent": null}, "recipeIngredient": ["4 soft hachiya (heart-shaped) persimmons, the redder the better (see note)", "1/4 cup Grand Marnier", "1/2 cup sugar", "2 large egg whites, at room temperature", "2 cups heavy cream", "3 tablespoons amaretto cookie crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a 9-by-5-by-3-inch metal loaf pan with parchment paper across the width, allowing enough overhang to eventually cover top of finished loaf. Cut down around leaves of persimmons (as if removing a tomato core). Quarter persimmons, cut away any additional core and scoop flesh from skin, removing any black spots. Place in food processor and pur&eacute;e. Transfer to a bowl and stir in half the Grand Marnier. Chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, dissolve sugar in 3 tablespoons water. Place over high heat. While sugar heats, place egg whites in electric mixer and beat until very softly peaked. Cook sugar to 239 degrees on a candy thermometer. With mixer running, drizzle in sugar syrup and continue beating until egg whites are stiff and glossy. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, beat cream until peaked but not stiff. Fold in remaining Grand Marnier. Whisk 1/2 cup egg whites into persimmon pur&eacute;e. Fold in 1/3 of the whipped cream. Fold remaining whipped cream into remaining egg whites."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a thin layer of plain mixture in bottom of pan. Then drop generous spoonfuls of each mixture, alternating persimmon and plain, into pan. Rap pan on a counter to eliminate any air pockets. Use a dinner knife to cut down and up through the mixture, in a swirling motion, for a marbled effect. Smooth top, cover with overhanging paper and freeze at least 6 hours, until firm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, run a knife down ends of pan, where there is no paper. Uncover top and invert pan onto a chilled platter. If necessary, place a towel soaked in hot water and wrung out, over pan to release semifreddo. Using a hair dryer works, too. Peel off paper. Dust top with amaretto crumbs and serve."}]}