{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Plum Pudding", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT40M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bread, plum, sugar, dessert, nut-free, vegetarian, summer", "aggregateRating": null, "recipeIngredient": ["3 pounds Italian prune plums, halved and pitted", "1 cup sugar", "1/2 teaspoon cinnamon", "1/2 cup water", "Juice of 1 lemon", "1 pound firm-textured thin-sliced white sandwich bread", "Whipped cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Quarter each plum half and place all the plums in a heavy saucepan. Add the sugar, cinnamon, water and lemon juice. Bring to a simmer and cook, stirring, about five minutes, until the sugar has completely dissolved, the mixture is very juicy and the plums are tender but still hold their shape. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the crusts from the bread and line the bottom and sides of a 6-cup bowl with the slices, overlapping them slightly so there are no gaps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon about one-third cup of the juice from the plums into a small bowl, cover and refrigerate. Fill the bread-lined bowl with the remaining plums and their juice. Cover the top with a layer of bread, then place a sheet of plastic wrap directly on the bread, allowing the plastic to extend over the sides of the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Select plate, pie pan or cake pan that can be put directly on top of pudding, fitting inside bowl. Place it on pudding and weight it down with heavy can, rock or some other object. Refrigerate the pudding overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, run knife or thin spatula around inside of bowl and invert pudding onto a dish with a rim to catch excess juices. Use the reserved plum juice to paint any areas of the bread that did not become soaked with juice from the pudding and are still whitish. Serve with whipped cream."}]}