{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Asparagus And Morels", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, quick", "keywords": "arborio rice, asparagus, morels, gluten-free, nut-free, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 606, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "5 grams", "proteinContent": "20 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1226 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 ounces dried morels, soaked for 30 minutes in warm water", "6 ounces fresh morels", "2 shallots, minced", "3 tablespoons unsalted butter", "About 5 cups hot chicken stock", "1 tablespoon olive oil", "1 1/2 cups Arborio rice", "Coarse salt and freshly ground pepper to taste", "1/2 cup dry white wine", "8 asparagus spears, sliced on the bias into one-inch pieces", "1/2 cup freshly grated Parmesan cheese", "1 tablespoon parsley, chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop the dried morels up from their soaking liquid and squeeze them, letting them drain back into the bowl. Follow by straining the soaking liquid through several layers of cheesecloth and then rinse the morels under running water before slicing them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fresh morels. Rinse the morels quickly under cold running water and dry them with paper towels. Slice the tops and stems. In a small skillet, soften the shallots in one tablespoon of the butter over moderate heat. Add all the mushrooms and the strained soaking liquid, cover and cook gently for five minutes. Meanwhile, bring the chicken stock to a slow simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon butter and the olive oil in a large, heavy skillet and add the rice. Cook, stirring, until the grains are coated with the butter. Add a cup of the hot stock and cook, stirring frequently, until the rice has absorbed the liquid. Add the mushrooms and season them with salt and pepper to taste, and add the white wine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the liquid has evaporated, add the asparagus, reserving the tips in another one-half cup of the stock. Continue adding the stock, one-half cup at a time as the rice absorbs the liquid, stirring continuously. Add the asparagus tips after the rice has cooked for about 12 minutes, and continue adding the broth, one-half cup at a time, stirring frequently. Continue adding liquid and stirring until the rice is creamy and tender, but just slightly al dente. Correct seasoning, stir in the Parmesan cheese and the remaining butter and sprinkle with parsley."}]}