{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Garlic Noodle Cake", "description": "This amazingly flavorful dinner cake came to The Times from Allen Susser, a Florida chef. It’s an Americanized and sweetly garlicky version of noodle kugel. With white and green fettuccine, it makes a festive spring or holiday presentation, rich and firm, that can hold its own at the center of the table.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, side dish, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 526, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "19 grams", "saturatedFatContent": "6 grams", "sodiumContent": "525 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 heads garlic, cloves separated but not peeled", "3 tablespoons olive oil", "4 medium shallots, peeled and cut into thin strips", "6 eggs", "1/2 pound spinach fettuccine", "1 pound white fettuccine", "2 teaspoons salt", "3/4 teaspoon freshly ground white pepper", "1 teaspoon dried thyme", "1/8 teaspoon ground nutmeg", "2 cups half-and-half", "Parmesan cheese, to coat pan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Place garlic in a small baking dish. Drizzle with 1 tablespoon of the olive oil. Cover with foil and bake until garlic is very soft, about 1 hour. Squeeze the garlic from the skins and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a small skillet. Add shallots and saute until they begin to caramelize, about 3 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the spinach and white fettuccines separately in salted water until tender but firm. Drain and place each in a separate large bowl. Whisk together the roasted garlic, 1 teaspoon of the salt, 1/2 teaspoon of the white pepper, thyme, nutmeg, 1 1/2 cups of the half-and-half and 4 of the eggs. Pour over the white fettuccine and mix well. Whisk together the shallots, 1 teaspoon salt, 1/4 teaspoon white pepper, 1/2 cup half-and-half and 2 eggs. Pour over the spinach fettuccine and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease a 10-inch round springform pan with the remaining tablespoon olive oil. Coat the pan with the Parmesan. Place half of the white fettuccine mixture in the bottom of the pan. Top with the spinach fettuccine mixture. Cover with the remaining white fettuccine mixture. Cover the pan with aluminum foil. Bake for 45 minutes. Let rest for 5 minutes. Run a small knife around the edge of the pan to loosen. Unmold, cut into wedges and serve."}]}