{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Baked Salmon With Green Mayonnaise", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H", "recipeYield": "10 to 12 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "dairy-free, gluten-free, nut-free, vegetarian, main course, rosemary, salmon", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 108, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "2 grams", "sodiumContent": "126 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 whole salmon, scaled, with head on, about 5 to 6 pounds", "1 onion, sliced", "1 lemon, cut in half", "6 sticks rosemary", "Coarse salt and freshly ground pepper to taste", "3 tablespoons olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the salmon on a roasting pan, on a piece of foil if the pan is too short for the fish. Place slices of onion inside the cavity and squeeze the lemon inside and over the top. Place two to three whole sticks of rosemary inside the cavity and sprinkle the leaves from the remaining sticks on top. Season with salt and pepper and brush the fish with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the salmon lightly with foil, turning up the ends of the piece underneath so that the juices do not run out while it is cooking. Roast for 30 minutes, then remove the foil. Roast for 15 to 20 more minutes or until the salmon is cooked (test by inserting a knife into the flesh to check; it is better to undercook than overcook salmon. When overcooked it becomes dry)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the salmon on a serving platter. It can be served hot or cold. If serving the salmon hot, decorate it with lime or lemon slices and sprinkle it with chives. Serve it immediately. If serving it cold, allow the salmon to cool to room temperature (you can refrigerate it overnight or serve on the day a few hours after it has been cooked, without refrigerating it). Remove the skin from the top side of the salmon. Decorate the fish with slices of lime and lemon and chopped chives."}]}