{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Squid, Lisbon Style", "description": "", "author": {"@type": "Person", "name": "William Grimes"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "Six servings", "recipeCuisine": "portuguese", "recipeCategory": "", "keywords": "appetizer, bacon, prosciutto, squid, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["1/4 pound slab bacon, cut into small dice", "3 tablespoons olive oil", "2 medium yellow onions, peeled and sliced thin", "2 medium carrots, peeled and sliced thin", "1 large garlic clove, peeled and minced", "1/2 cup fish stock or bottled clam juice", "1/2 cup dry white wine", "3 tablespoons tomato paste", "Juice of 1 large lemon", "1 whole bay leaf (do not crumble)", "1 1/2 pounds squid, cleaned, tentacles separated from body and reserved", "2 tablespoons olive oil", "1 tablespoon bacon drippings", "1 medium yellow onion, peeled and chopped", "1 small garlic clove, peeled and minced", "1 small carrot, peeled and chopped", "Reserved squid tentacles, washed well and coarsely chopped", "1/4 pound prosciutto, finely minced", "2 tablespoons tomato paste", "2 cups fine, soft bread crumbs", "1/4 cup dry white wine", "1/3 cup water", "1/4 teaspoon freshly ground pepper", "1 tablespoon minced parsley", "2 egg yolks, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small, heavy skillet, saute the bacon in 1 tablespoon of the olive oil over moderate heat 5 to 6 minutes, or until the bacon bits are crisp; remove with a slotted spoon and drain on a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 2 tablespoons of the bacon drippings into a large, heavy kettle, add the remaining olive oil and turn heat to high; reserve remaining 1 tablespoon dripping for the stuffing. When oil is very hot, add the onions, carrots and garlic. Saute over moderate heat, stirring often, about 5 minutes or until onions turn glassy. Mix in fish stock, wine, tomato paste and lemon juice; add the bay leaf. Bring to a low boil, then lower heat and simmer gently while you make the stuffing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stuffing: In a large, heavy skillet, heat the 2 tablespoons olive oil and the reserved 1 tablespoon of the bacon drippings. Add the onion, garlic and carrot and saute over moderate heat 5 minutes, or until the onions begin to turn glassy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chopped squid tentacles; turn heat to low, cover and steam 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix in the prosciutto, tomato paste, bread crumbs, wine, water, pepper and parsley and cook, stirring, 2 to 3 minutes, or until the mixture is very thick and pastelike."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, let cool slightly, then blend in the egg yolks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Push the stuffing into each squid until about 3/4 inch from the top; close top with a toothpick. Do not stuff too near the top or too compactly, since the stuffing will expand when cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the squid in the kettle of simmering sauce; cover and simmer 1 hour. Remove the squid, spoon the sauce over it and serve with bacon bits sprinkled on top."}]}