{"@context": "http://schema.org", "@type": "Recipe", "name": "Spring Lamb With Baby Greens", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "Six to eight servings", "recipeCuisine": "irish", "recipeCategory": "dinner, roasts", "keywords": "dairy-free, gluten-free, nut-free, greens, lamb, parsnip, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 287, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "10 grams", "proteinContent": "9 grams", "saturatedFatContent": "6 grams", "sodiumContent": "436 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds fresh tender spinach leaves", "2 cups fresh mint leaves, chopped", "1/2 cup minced orange zest", "2 cloves garlic, peeled and finely chopped", "1 small red onion, peeled and finely chopped", "1/4 teaspoon ground cinnamon", "1/4 teaspoon ground ginger", "2 tablespoons Dijon mustard", "1/2 teaspoon salt", "1 teaspoon freshly ground pepper", "1 pound fresh tender dandelion leaves, trimmed and rinsed", "1/2 pound fresh tender chicory, trimmed and rinsed", "1 butterflied leg of spring lamb, about 4 pounds, trimmed of all fat, at room temperature", "2 tablespoons olive oil", "1/4 cup wine vinegar", "1/2 cup red wine", "2 1/2 cups chicken broth, homemade or low-sodium canned", "1/2 cup apple cider", "1 pound parsnips, peeled and cut diagonally into 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Steam two-thirds of the spinach for a few minutes, or until it is just wilted. Rinse under cold running water. Squeeze out all of the excess water and chop coarsely. Put the chopped spinach in a large bowl, add the rest of the stuffing ingredients and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Steam the remaining spinach leaves along with the dandelion leaves and chicory until barely wilted. Rinse under cold running water until cool. Pat dry and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the leg of lamb, fat side down, on a flat surface. Spread the stuffing over the meat. Starting with the smallest end, roll up the meat lengthwise like a jellyroll. Tie it tightly with butcher's string."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large cast-iron skillet over medium-high heat until it is hot. Carefully put the lamb in the skillet and sear it on 4 sides, about 4 minutes per side, until golden brown all over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the heat, take the leg out of the pan and set it aside. Gently scrape any burned pieces or fat from the bottom of the pan and discard. Add the vinegar and wine. Bring the liquid to a boil and simmer until it reduces to 1/4 cup, about 3 minutes. Add the chicken broth and apple cider. Put the lamb back into the skillet. Drape the greens on top of the meat, crosswise. Lay the remaining greens in the bottom of the pan. Set the pan in the oven and roast the lamb for 30 minutes, basting continually."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the lamb over, add the parsnips to the skillet and continue to roast for an additional 20 minutes. Test for doneness by inserting a meat thermometer in the large end of the leg. The thermometer should read 125 degrees for rare meat, or 130 degrees for medium rare. Let the lamb rest for at least 20 minutes before carving. Keep the greens and parsnips warm and serve alongside the sliced lamb."}]}