{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese Omelet With Stir-Fried Vegetables In Spicy Sauce", "description": "", "author": {"@type": "Person", "name": "Marialisa Calta"}, "image": null, "totalTime": "PT15M", "recipeYield": "Six servings", "recipeCuisine": "chinese", "recipeCategory": "", "keywords": "appetizer, dairy-free, gluten-free, nut-free, eggs, mung bean sprouts", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 238, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "367 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup chicken broth", "2 1/2 tablespoons light soy sauce", "2 tablespoons rice wine or sake", "1 1/4 tablespoons sugar", "1 tablespoon Chinese black vinegar or 1 teaspoon Worcestershire sauce", "1 tablespoon cornstarch", "1 teaspoon sesame oil", "1 tablespoon corn or safflower oil", "2 tablespoons minced scallions, white part only", "1 tablespoon minced ginger root", "1 1/2 tablespoons minced garlic", "3 tablespoons corn or safflower oil", "1 red bell pepper, julienned, about 3/4 cup", "3/4 cup julienned snow peas, about 2 1/2 ounces", "2 teaspoons rice wine or sake, approximately (optional)", "1 cup mung bean sprouts, rinsed and drained", "8 large eggs, lightly beaten", "2 tablespoons minced scallion greens, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small mixing bowl, combine the ingredients for the spicy sauce except the corn (or safflower) oil, scallions, ginger root, and garlic. Heat the corn oil in a saute pan or wok. Add the scallions, ginger root and garlic and stir-fry over high heat, about 15 seconds, until fragrant. Add the combined sauce mixture and stir until thickened. Keep warm until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the omelet, in a saute pan or wok, heat 1 tablespoon of the corn (or safflower) oil until hot. Add the bell pepper and snow peas and toss lightly over high heat, about 30 seconds, adding some rice wine or sake if the mixture is very dry. Add the bean sprouts and toss briefly, about 10 seconds. Remove the mixture and let cool slightly, then fold into the beaten eggs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, well-seasoned omelet pan or wok and add the remaining 2 tablespoons of the corn oil. Heat until very hot. Add the eggmixture and let it set at the bottom while twirling the pan. When a thin crust begins to form, cover and reduce the heat to low. Cook for about 5 to 7 minutes, or until the omelet is puffed and lightly golden on the bottom. Using a spatula, carefully turn it over and cook until lightly golden and cooked through. (The omelet can be done ahead of time and kept warm in a 200-degree preheated oven.) When ready to serve, cut the omelet into wedges, spoon the sauce over them and sprinkle with the scallion greens."}]}