{"@context": "http://schema.org", "@type": "Recipe", "name": "Zrazy Zawijane (Stuffed rolls of beef)", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H55M", "recipeYield": "6 servings", "recipeCuisine": "eastern european", "recipeCategory": "dinner", "keywords": "dried porcini mushrooms, round steak, slab bacon, main course, nut-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 379, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "1 gram", "proteinContent": "29 grams", "saturatedFatContent": "8 grams", "sodiumContent": "590 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 four-inch piece of stale French bread, crust removed", "1 Polish-style dill pickle", "3 thick slices of slab bacon", "6 thin slices rump or round steak, about 4 ounces each", "2 medium-size onions, peeled, halved and very thinly sliced", "Salt and freshly ground black pepper to taste", "1 1/2 cups chicken or beef broth", "2 Polish dried mushrooms, or 1/2 ounce Italian dried porcini", "1/4 cup or more all-purpose flour", "2 tablespoons cooking oil", "2 tablespoons unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the bread lengthwise into six pieces, each one as thick as an index finger. Slice the pickle lengthwise into six fingers. Cut each bacon slice in half crosswise."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a steak slice between two pieces of plastic wrap or wax paper and pound evenly until it is very thin. Distribute a few onion slices over center of meat, add a finger of bread, one of pickle and a half slice of bacon. Sprinkle a very little salt (the bacon will add salt) and some pepper over all. Wrap the steak slice around the stuffing and tie or fasten with toothpicks. Repeat with remaining steak slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the chicken or beef stock to a slow simmer and add the dried mushrooms. (If using Italian mushrooms, soak them first in warm water for 20 minutes, then rinse to rid them of sand.) Remove from heat and let mushrooms steep in hot stock for at least 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll beef rolls in the flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of oil and one of butter in a skillet over medium-high heat until butter foam subsides. Add remaining sliced onion and cook, stirring and tossing slices until onion is thoroughly browned; remove to an ovenproof dish. Add remaining butter and oil to the pan and brown the beef rolls evenly on all sides. When rolls are thoroughly browned and crisp on all sides, add to the dish with the onions. Distribute onions over and around beef rolls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add stock and mushrooms, and bring to a gentle simmer on top of the stove. Place in oven and bake about two hours, or until the beef rolls are fork tender and the braising liquid has reduced to a syrupy gravy."}]}