{"@context": "http://schema.org", "@type": "Recipe", "name": "Sorrel Soup With Hard-Boiled Eggs", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT3H10M", "recipeYield": "6 servings", "recipeCuisine": "eastern european", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, beef bones, sorrel, vegetables, nut-free", "aggregateRating": null, "recipeIngredient": ["1 1/2 pounds meaty soup bones", "10 1/2 cups water", "Vegetables for stock (see note)", "1 tablespoon plus 1 teaspoon salt", "Freshly ground black pepper to taste", "1 bay leaf", "2 dried Polish mushrooms, or 1/2 ounce dried Italian porcini", "2 tablespoons butter", "3/4 cup rice", "2 1/2 cups slivered fresh sorrel (about one pound)", "1/2 cup sour cream", "1 tablespoon flour", "1 cup croutons made from stale French bread, crusts removed", "4 hard-boiled eggs, shelled and coarsely chopped", "2 tablespoons finely minced dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a rich beef stock by simmering beef bones in 9 cups water over medium-low heat, skimming the gray scum that rises to the top. Add trimmed, pared and split vegetables, the tablespoon of salt and the pepper, the bay leaf and the dried mushrooms. (If using Italian mushrooms, first soak for 20 minutes in warm water to soften, then rinse to remove sand.) Bring to a simmer, partly cover and cook for two hours. When cooking is done, discard vegetables and bones. Cool in refrigerator or freezer, then skim fat if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring remaining 1 1/2 cups of water to a boil, add remaining teaspoon salt and one tablespoon of the butter. When butter has melted, add rice. Cook, partly covered, about 15 minutes, or until rice is cooked through but not mushy. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and drain sorrel. Bring stock to a rolling boil and add sorrel all at once. Stir, and cook until sorrel is soft, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While sorrel is cooking, mix sour cream with flour to make a smooth paste. Add a little boiling stock and mix well. Keep adding stock and mixing until you have a cup of liquid. When sorrel is cooked, beat the sour cream mixture into the hot soup. Add salt and pepper if necessary. Cook at a gentle boil about 5 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt remaining butter in a skillet over medium-high heat. Add croutons and toss until browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, put a quarter-cup mound of rice in each soup plate. Pour the hot soup around it and top with chopped eggs, croutons and finely minced dill. Serve immediately."}]}