{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal With Tomatoes And Balsamic Vinegar", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "balsamic vinegar, tomato, veal, dairy-free, gluten-free, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 319, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "47 grams", "saturatedFatContent": "2 grams", "sodiumContent": "791 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra-virgin olive oil", "3 pounds veal for stew (see note)", "3/4 cup finely chopped onion", "1 cup, approximately, veal or beef stock", "4 tablespoons balsamic vinegar", "1 1/2 cups finely chopped ripe plum tomatoes", "1 1/2 teaspoons fresh rosemary leaves, plus fresh sprigs for garnish", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a heavy flameproof casserole. Add the veal in batches and lightly brown over high heat, taking care not to crowd the meat in the pan. As the pieces are browned, remove them and place in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining olive oil and the onion to the casserole, lower the heat and lightly brown the onion. Stir in 2/3 cup of the stock, 3 tablespoons of the vinegar and 1/2 cup of the tomatoes. Add 1 teaspoon of the rosemary leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the veal to the casserole along with any juices. Cover and simmer until the meat is tender, 1 to 1 1/2 hours. If necessary, add a little more stock during the cooking. The stew can be prepared up to this point 2 days ahead and refrigerated, or frozen for later use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Up to 2 hours before serving, reheat the stew. Stir in the remaining chopped tomatoes and balsamic vinegar and, if necessary, some additional stock. The stew should be quite moist. Add the remaining rosemary leaves, bring to a simmer and season to taste with salt and pepper. Simmer for 10 minutes, then remove from the heat and set aside, covered, until ready to serve. Just before serving, bring the stew to a simmer again, then transfer it to a serving dish and garnish with the fresh rosemary sprigs."}]}