{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Kidney Bean Puree", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT2M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "dry red wine, red kidney beans, gluten-free, nut-free, vegetarian, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 373, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "10 grams", "proteinContent": "13 grams", "saturatedFatContent": "7 grams", "sodiumContent": "369 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound red kidney beans, washed and picked over", "1 1/2 cups full-bodied red wine", "1 stick cinnamon or a pinch of ground cinnamon", "1 onion stuck with 1 clove Herb bouquet made with thyme, parsley and bay leaf", "1/4 teaspoon crushed red pepper flakes", "Coarse salt and freshly ground pepper to taste", "4 tablespoons unsalted butter", "Few drops balsamic vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the beans in cold water overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the wine in a saucepan with spices, onion, herbs and peppers and two cups of water. Bring the liquid to a boil and keep it at a simmer. Meanwhile, drain the beans, cover them with cold water and bring them to a boil. Boil hard for five minutes and drain. Immediately add the beans to the simmering wine, cover and cook over medium low heat one to one-and-a-half hours. Add boiling water if necessary to keep the beans covered. (Season with one teaspoon of salt only when the beans are tender.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans, reserving one-half cup of the cooking liquid. Discard the cinnamon stick, bouquet and onion. Puree the beans in a food processor; for a finer result one can then press them with the cooking liquid through the fine blade of a food mill. Return the beans to the saucepan and cook, stirring with a wooden spoon, over low heat until the puree becomes thick enough to come away from the sides of the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gradually beat in the butter. Correct the seasoning. (The beans can be prepared one day in advance. Reheat them slowly in a double boiler or a covered glass dish in the microwave.)"}]}