{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Vegetable Sandwich With Parsley Arugula Salad", "description": "", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT2H", "recipeYield": "Four sandwiches", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, lunch", "keywords": "bread, eggplant, red pepper, dairy-free, nut-free, vegan, vegetarian, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 286, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "3 grams", "sodiumContent": "512 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["3 red peppers", "2 medium eggplants, sliced crosswise into 1/2-inch-thick disks", "2 tablespoons coarse salt", "2 ripe tomatoes, cored, or substitute 1 cup imported canned plum tomatoes, drained of juices", "1 large onion cut into 1/8's", "1 sprig fresh rosemary", "1/2 head of garlic, cut along the clove", "1 cup extra-virgin olive oil", "1 tablespoon Sherry vinegar (or substitute red-wine vinegar)", "2 teaspoons lemon juice (optional)", "1/2 cup flat-leaf parsley, washed, dried and loosely packed", "1 1/2 cups arugula, washed, dried and loosely packed", "8 slices crusty French or Italian bread from a large round loaf", "1/4 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To roast the red peppers, place either over a gas burner, under the broiler or in a very hot oven (450 to 500 degrees), turning frequently until the pepper skins blacken. Place the peppers in a paper bag or covered bowl until they cool. Gently peel away the skin, cut in half and carefully remove the seeds. Roasted peppers can be covered with olive oil and kept in a covered container in the refrigerator for up to two weeks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the eggplant slices with about one-and-a-half tablespoons of coarse salt and let stand for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatoes, onion wedges and rosemary sprig in a lightly oiled oven-proof skillet or pan, just large enough to contain the vegetables. Place the garlic, cut-side down, on top of one of the tomatoes. Generously brush the vegetables with olive oil and sprinkle with salt and pepper. Roast in the oven, tossing the vegetables lightly to coat them with oil and juices. Remove when the garlic and onion are tender and golden brown, about 45 minutes. The tomato will be very soft, its skin split."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables are roasting, rinse the eggplant slices under cold water and dry well with paper towels. Place the slices on an oiled baking sheet and brush the tops with olive oil. Bake in a 450-degree oven, turning once, until golden brown, about 15 to 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take the roasted garlic and squeeze the head to release the softened cloves into the bowl of a food processor. Add the onion, flesh of tomato, discarding the skins, one teaspoon of Sherry vinegar, two teaspoons of lemon juice (if desired) and two tablespoons of olive oil. Process, using short pulses, until the mixture is the consistency of a relish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, lightly dress the parsley and arugula with about one teaspoon of Sherry vinegar and olive oil. Sprinkle with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush one side of each slice of bread with olive oil and lightly toast on the rack of the 450-degree oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the sandwiches, place a quarter of the eggplant and roasted pepper slices on each of four slices of bread, oil-side up. Spoon on about two or three tablespoons of sauce (see note). Top with the dressed greens and cover with a second slice of bread, oil-side inward."}]}