{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Ketchup", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT2H40M", "recipeYield": "Two pints", "recipeCuisine": "", "recipeCategory": "condiments", "keywords": "dairy-free, gluten-free, nut-free, vegan, vegetarian, garlic, onion, tomato, summer", "aggregateRating": null, "recipeIngredient": ["6 pounds ripe tomatoes, washed and coarsely chopped", "2 large onions, peeled and sliced", "2 cloves garlic, peeled and split", "1/3 cup sugar", "2 teaspoons paprika", "1/4 teaspoon ground mace", "1 cup 5 percent red-wine vinegar (see note)", "12 black peppercorns", "1 stick cinnamon", "1/2 teaspoon mustard seed", "8 whole cloves", "1 small dried red chili pepper, bruised"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatoes, onions and garlic in a heavy, nonaluminum pot, cover and slowly bring to a boil over medium heat. Remove the lid, stir, and continue cooking for about 45 minutes, or until the tomatoes are very soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pot from the heat, and pass the mixture through a food mill or strainer, discarding the seeds and skin. Return the liquid to the pot, stir in the sugar, paprika and mace, and slowly cook over medium heat for about one hour, or until the volume is reduced by half. Stir frequently, and as the sauce thickens, adjust the heat down."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce is cooking, place the vinegar, peppercorns, cinnamon, mustard seed, cloves and chili pepper in a small saucepan and bring to a boil. Reduce the heat to low and let it simmer slowly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the ketchup has thickened, strain the seasoned vinegar into it, stirring to mix well, and continue cooking for another 45 minutes. Allow the ketchup to cool, pour it into sterilized jars and store in the refrigerator for three to four months. Or pour it into sterilized jars, leaving a half-inch space at the top, cover with preserving lids and process in boiling water for 20 minutes."}]}