{"@context": "http://schema.org", "@type": "Recipe", "name": "Tom Colicchio's Crab-Meat-And-Celery-Root Napoleon", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT20M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, celery root, lump crab meat, tomato, dairy-free, gluten-free, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 821, "unsaturatedFatContent": "66 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "82 grams", "fiberContent": "2 grams", "proteinContent": "15 grams", "saturatedFatContent": "12 grams", "sodiumContent": "668 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 teaspoon curry powder", "1 teaspoon Dijon mustard", "1/4 cup white-wine vinegar", "3/4 cup grape-seed oil", "1 large celery root, about 1 pound", "1 pound lump crab meat", "2 medium-size ripe tomatoes, peeled, seeded and diced", "1 bunch fresh chives", "Salt and freshly ground black pepper to taste", "1 1/2 cups peanut oil for deep-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine the curry powder and mustard. Beat in the vinegar, then slowly add the grape-seed oil to make a well-emulsified dressing. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the celery root. Cut into 3 sections horizontally, making the middle section about 2 inches thick. Slice the middle section into 12 thin, large disks, wrap them in plastic wrap and reserve. Cut the other 2 sections, along with any of the celery root remaining from the middle section, into small dice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a boil, add the diced celery root and cook for 2 to 3 minutes, or until just tender. Drain and refresh under cold water. Drain well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pick over the crab meat to remove any stray bits of cartilage. In a bowl, mix the crab meat with the cooked, diced celery root and the tomatoes. Reserve 6 of the chives, finely chop the rest and mix them in. Beat the dressing and fold half of it into the crab-meat salad. Season with salt and pepper to taste. Refrigerate until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the peanut oil in a wok or a skillet until very hot. Dry the reserved celery root disks on paper towels if necessary and fry the slices, turning them once, until golden brown, about 2 to 3 minutes per side. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, place a round of celery root on each of 6 plates, top each with a portion of the crab-meat salad, then with another round of celery root. Mix the remaining dressing again and pour it around each of the napoleons. Cut the reserved chives in half and place two pieces across the top of each celery-root disk."}]}