{"@context": "http://schema.org", "@type": "Recipe", "name": "Indian Lamb-And-Eggplant Napoleon", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Four servings", "recipeCuisine": "indian", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, eggplant, ground lamb, nut-free", "aggregateRating": null, "recipeIngredient": ["1 eggplant, about 1 1/2 pounds", "Salt to taste", "2 tablespoons, plus 1 1/2 cups, vegetable oil", "1 teaspoon black mustard seeds", "1 1/2 teaspoons cumin seeds", "2 medium-size onions, chopped", "1 small hot green chili, seeded and minced", "3/4 pound lean ground lamb", "3 medium-size ripe tomatoes, peeled and chopped", "Cayenne pepper to taste", "1 slice peeled fresh ginger, about 3/4-inch thick, finely minced", "1 small bunch coriander, minced", "8 ounces plain yogurt", "8 Indian pappadums (available at most specialty markets)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice the eggplant, sprinkle it with salt and set it aside for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the 2 tablespoons of oil in a large, heavy skillet over medium-high heat. Add the mustard seeds and cumin seeds. When they start to smell aromatic and pop, about 1 to 2 minutes, add the onions. Saute until the onions are tender, about 5 minutes, then add the chili. Stir in the lamb. Continue to saute until the lamb has lost its red color and is finely broken up, about 3 to 4 minutes. Remove the skillet from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain and rinse the eggplant. Pat the pieces dry on paper towels. Reheat the lamb mixture in the skillet, add 1 more tablespoon of the oil and add the eggplant. Cook, stirring, until the eggplant has lost its dryness, about 10 minutes. Stir in the tomatoes. Cover and simmer until the eggplant is tender, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season to taste with salt and cayenne pepper and set aside until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the ginger, coriander and yogurt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining oil in a wok or skillet. Add one of the pappadums. As soon as it begins to curl, about 15 to 20 seconds, turn it over using tongs or chopsticks. Flatten it in the pan and cook another few seconds. It should not darken. Drain on paper towels and repeat with the remaining pappadums."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, reheat the eggplant and lamb mixture. Place a pappadum on each of 4 plates, top with a quarter of the lamb mixture, then cover with another pappadum. Spoon some of the yogurt mixture on top and serve with steamed rice, if desired."}]}