{"@context": "http://schema.org", "@type": "Recipe", "name": "Philippe Boulot's Whipped-Potato-And-Wild-Mushroom Napoleon", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT50M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "appetizer, main course, gluten-free, vegetarian, potato, wild mushrooms", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 661, "unsaturatedFatContent": "51 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "60 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "8 grams", "sodiumContent": "636 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 medium-large Idaho potatoes, about 2 1/4 pounds", "3/4 cup milk", "2 tablespoons unsalted butter", "1 1/2 tablespoons each chopped fresh parsley, tarragon and chives", "1 1/2 tablespoons fresh chopped tarragon", "1 1/2 tablespoons fresh chopped chives", "4 tablespoons olive oil", "1/2 pound chopped fresh wild mushrooms, like portobello, cremini, oyster, shiitake - or a mixture", "Salt and freshly ground black pepper to taste", "1 to 1 1/2 cups vegetable oil, like canola or peanut, for deep-frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel three of the potatoes, cut them in small chunks and place them in a saucepan with cold water to cover. Bring to a boil and cook the potatoes until they are tender, about 15 minutes. Drain and pass the potatoes through a food mill or a ricer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pan, heat the milk; add the butter and the cooked potatoes and mix over medium heat. Remove from the heat and add the herbs. Set aside, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a heavy skillet. Add the mushrooms and saute over medium heat until tender, about 6 to 8 minutes. Drain off any excess oil and mix the mushrooms with the potatoes. Season the potato mixture with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrub the remaining potato. Cut it into very thin slices lengthwise, either with a mandoline or food processor or by hand. You should have 18 slices. Pat them dry on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil for deep-frying in a skillet or a wok until very hot. Fry the potato slices a few at a time, turning them once, until golden, about 1 minute per side. Drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, preheat the oven to 300 degrees. Place the fried potato slices on a baking sheet and reheat for 5 to 8 minutes. Meanwhile, reheat the mashed potato mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, spread some of the potato puree on each of six plates, top with a slice of fried potato, then repeat twice more, making three layers of mashed potato and three of fried, ending with the fried potato."}]}