{"@context": "http://schema.org", "@type": "Recipe", "name": "Gingered Lentil And Celery Salad", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, salads and dressings", "keywords": "appetizer, side dish, celery, ginger root, green lentils, dairy-free, gluten-free, nut-free, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 351, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "9 grams", "proteinContent": "17 grams", "saturatedFatContent": "2 grams", "sodiumContent": "767 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 carrot", "3 ripe tomatoes, cored, peeled, seeded and minced", "1/2 pound green lentils", "1 small white onion", "1 rib celery, minced", "1/2 red onion, minced", "1/4 teaspoon ginger, peeled and chopped fine", "1/4 cup lemon juice", "1 1/2 tablespoons soy sauce", "3 tablespoons olive oil", "Salt and freshly ground pepper to taste", "1 cucumber, peeled, seeded and diced", "1 tablespoon sherry vinegar", "1/2 teaspoon Dijon-style mustard", "1 cup alfalfa sprouts", "8 sprigs parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of water to a boil. Peel the carrot and cut it lengthwise into 8 strips that are 1/8-inch thick and about 5 inches long. (If it is hard to get strips that long, shorter ones can be used.) Plunge the strips into boiling water for 1 minute, cool immediately under cold water, pat dry and set aside. Put the tomatoes in a fine sieve over a bowl and push them with the back of a spoon to press out excess liquid; set tomatoes aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the lentils and the white onion in 2 quarts of cold water over medium heat and cook gently for 45 minutes. Drain, remove the onion and let the lentils cool. When cool, put lentils in a mixing bowl with the celery, red onion, ginger, lemon juice, soy and olive oil. Mix, adjust seasoning with salt and pepper, and chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the cucumber, vinegar and mustard in a blender; season lightly with additional salt and pepper, and puree. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the inside of a round cookie cutter 2 1/2 to 3 inches in diameter with a carrot strip. Put the cookie cutter on a serving dish and use it as a mold. Spoon in the lentils and pat firmly. Gently smooth the tomatoes on top in a thin layer. Repeat with the remaining carrot strips and lentils, placing 2 rounds on each of 4 serving plates. Spoon the cucumber vinaigrette around the cakes, garnish with sprouts and parsley, and serve."}]}