{"@context": "http://schema.org", "@type": "Recipe", "name": "Jamaican Jerked Pork And Chicken", "description": "", "author": {"@type": "Person", "name": "Michele Evans"}, "image": null, "totalTime": "PT1H25M", "recipeYield": "Six to eight servings", "recipeCuisine": "caribbean", "recipeCategory": "dinner", "keywords": "chicken, chilies, pork, dairy-free, gluten-free, nut-free, main course", "aggregateRating": null, "recipeIngredient": ["1 6 1/2-pound pork shoulder, or 6 1-inch-thick loin pork chops", "3 chicken breasts, split, with skin on", "6 chicken legs", "2 ounces whole allspice berries", "1/4 teaspoon fresh grated nutmeg", "1/2 teaspoon ground cinnamon", "8 scallions (white part and 1 inch of green each), chopped", "1 large garlic clove, chopped", "1 teaspoon fresh serrano or other hot pepper, seeded and chopped", "3 tablespoons red-wine vinegar", "1/4 cup peanut or vegetable oil", "1/2 teaspoon salt", "1/4 teaspoon freshly ground pepper", "2 bay leaves, crumbled", "Pickapeppa sauce (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away the rind and most of the fat from the pork. Remove all the meat from the bones and cut it into pieces about one-and-a-half-inches thick and three or four inches long."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pork pieces and the chicken in a large bowl, cover and refrigerate until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the seasoning, heat the allspice berries over medium heat in a small heavy saucepan for three or four minutes, stirring often until heated through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Two tablespoons at a time, crush the berries in a mortar and pestle until all are cracked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size bowl, combine the crushed berries, nutmeg, cinnamon, scallions, garlic, pepper and one tablespoon of the vinegar. Crush into a pasty mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rest of the vinegar, oil, salt, pepper and bay leaves. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the mixture over the pork and chicken and rub the meat with the seasoning, coating it evenly. Cover and refrigerate for two hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the jerked pork and chicken on the grill over hot coals or on a gas-heated barbecue as far away from the heat source as possible, at least six inches. Cover with the lid. Turn the meat every 10 minutes for about one hour, until done. If desired, halfway through the cooking time, toss one teaspoon of whole allspice berries into the fire."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cooked pork into one-third-inch slices and serve with the chicken. Accompany with Pickapeppa sauce."}]}