{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon Fillets Braised In Red Wine", "description": "", "author": {"@type": "Person", "name": "Bryan Miller And Pierre Franey"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "dry red wine, salmon fillet, vegetables, gluten-free, nut-free, vegetarian, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 916, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "2 grams", "proteinContent": "70 grams", "saturatedFatContent": "15 grams", "sodiumContent": "426 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons butter", "1/2 cup chopped shallots", "1/2 cup chopped onions", "1/2 cup chopped celery", "1 cup diced carrots", "1 pound fish bones, and the salmon head, gills removed", "3 1/2 cups dry red wine, such as a Cotes du Rhone", "1 cup water", "1/2 bay leaf", "1/4 teaspoon dried thyme", "4 sprigs fresh parsley", "4 salmon fillets, boneless and skinless, each 6 to 8 ounces, at room temperature", "1/2 teaspoon salt", "Freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, place one tablespoon of the butter, a quarter cup of the shallots, the onions, celery and carrots. Cook, stirring, for one minute over a medium-high flame. Chop the fish bones and head coarsely and add them to the pan. Cook and stir for two minutes. Pour three cups of the wine and the water into the pan, then add the bay leaf, thyme and parsley. Reduce the cooking liquid for 45 minutes over a medium-low flame, or until it reaches about one cup. Strain the broth into a pan. Discard the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Select a pan large enough to hold the fish in one layer. Rub the bottom of the dish with a half teaspoon of butter and sprinkle the remaining shallots over the bottom of the pan. Arrange the fish, skin side down, in the pan. Sprinkle with salt and pepper generously. Add the remaining half cup of wine and fish broth. Dot the fish with one tablespoon of the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pan over a medium-high flame and cook, covered, for about 90 seconds, flip the fillets gently and cook another 90 seconds (cooking time may vary with thickness of the fish). The salmon should be just barely cooked in the center; do not overcook."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the fish to a serving dish, cover with foil and keep it warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over a high flame, reduce the cooking liquid to about one cup. Strain it through a fine sieve and into a saucepan. Swirl in the remaining butter and, while hot, spoon the sauce over the fish. Serve immediately."}]}