{"@context": "http://schema.org", "@type": "Recipe", "name": "Taillevent Pear Souffle", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "Eight servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "dessert, egg whites, pear, pear liqueur, gluten-free, nut-free, vegetarian", "aggregateRating": null, "recipeIngredient": ["2 1/4 cups sugar", "8 ripe Bartlett or Anjou pears", "4 tablespoons eau de vie de poire", "1 1/2 tablespoons unsalted butter", "8 large egg whites"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, combine one and one-third cups of the sugar with three cups of water. Bring to a simmer and cook until the sugar dissolves. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, core and quarter the pears. Place them in the saucepan, adding a little more water if necessary, so they are just covered with the syrup. Simmer gently until the pears are tender, about 20 minutes. Remove from the heat and drain. Discard the syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice eight quarters of the pears. Puree the rest in a food processor. Return the puree to a saucepan and cook until it is reduced to about two cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, dissolve two-thirds cup of the sugar in one-third cup water. Cook over medium-high heat, without stirring, until the mixture reaches the hard-crack stage, 300 degrees on a candy thermometer. This is just before the sugar turns to caramel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately pour the hot sugar into the warm pear puree and stir. Add the eau de vie de poire."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter eight one-cup souffle dishes and dust them with the remaining sugar. Divide the diced pears among them. The souffle can be prepared ahead up to this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 475 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until they hold firm peaks but are still creamy. Fold the pear puree and egg whites together and spoon the mixture into each of the prepared souffle dishes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 8 to 10 minutes, until the souffles are puffed and nicely browned. Serve at once."}]}