{"@context": "http://schema.org", "@type": "Recipe", "name": "Cassatine Di Ricotta", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H", "recipeYield": "Twelve servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "almond, flour, ricotta, dessert, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 343, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "9 grams", "sodiumContent": "94 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups unbleached white flour", "2 egg yolks", "2 tablespoons sugar", "1/4 teaspoon salt", "4 ounces unsalted butter", "2 to 3 tablespoons very cold water", "1 cup slivered almonds", "2 tablespoons dark Jamaica rum", "1/2 cup golden raisins", "1 pound whole-milk ricotta", "2 eggs", "1/2 cup sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pasta frolla, or shortcrust pastry: Sift the flour in a bowl. Add the egg yolks, sugar and salt. Stir with a fork. Cut the butter into six or eight pieces and add to the flour. Add two tablespoons of ice water and mix together quickly, using a wooden spoon or your hands, but be careful not to ''cook'' the pastry. Add more water if it seems necessary. When all the ingredients are well-blended, form into a ball, cover with plastic wrap or foil and refrigerate for at least one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, heat the oven to 350 degrees. Toast the almonds in the oven until they are light brown. Set aside to cool and raise the oven temperature to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the rum and the raisins in a small saucepan. Add water to just cover the raisins. Bring to a boil over high heat and set aside for a few minutes to plump the raisins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the ricotta in a bowl until it is light and fluffy. Separate the eggs, and add the yolks, one at a time, beating after each addition. Add the sugar and beat well. Then fold in the almonds and the drained raisins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate bowl, beat the egg whites until they form stiff peaks. Gently fold the egg whites into the ricotta mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the pasta frolla as thinly as possible (between two sheets of aluminum foil or wax paper to prevent the pastry from sticking). Butter 12 individual three-inch tart tins or two 9-inch tins (for the larger pies, springform pans or pans with removable bottoms are the easiest to unmold). Line the tins with the rolled-out pastry. Add the ricotta mixture, filling the pastry cases to just below the top of the pastry. Place on a cookie sheet in the preheated oven and bake for 20 to 30 minutes, or until the tops are golden brown and the insides are firm. The pies may be served lukewarm or cold."}]}