{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Duck With Collard Greens and Black Pepper Spoonbread", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Four servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "collard greens, duck breast, yellow cornmeal, gluten-free, nut-free, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 669, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "8 grams", "proteinContent": "39 grams", "saturatedFatContent": "9 grams", "sodiumContent": "1763 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups water", "1 teaspoon salt", "1 cup yellow cornmeal", "2 tablespoons unsalted butter", "3 eggs", "1 cup buttermilk", "1 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon freshly ground black pepper", "1 1/2 teaspoons olive oil", "1 pound skinless, boneless duck breasts", "1 medium onion, peeled and diced", "3 carrots, peeled and diced", "1 cup small white mushrooms, quartered", "2 cups red wine", "1 cup chicken broth, homemade or low-sodium canned", "Salt and freshly ground pepper to taste", "2 tablespoons chopped Italian parsley", "2 slices bacon, diced", "8 cups cleaned and trimmed collard greens, torn in large pieces", "1/2 cup water", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the spoonbread, preheat the oven to 400 degrees. Butter a 2-quart souffle dish and set aside. Place the water in a medium saucepan over medium heat, add the salt and bring to a boil. Stirring constantly, add the cornmeal in a slow, steady stream. Cook, stirring, for 2 minutes. Scrape into a mixing bowl, stir in the butter and set aside to cool to lukewarm. In another bowl, whisk together the eggs, buttermilk, baking powder, baking soda and pepper. Gradually stir the egg mixture into the cornmeal mixture. Scrape into the prepared pan and bake until set, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the duck, heat the oil in a large skillet over medium-high heat. Add the duck and sear on both sides. Set aside. Add the onion and carrots to the skillet and cook for 3 minutes. Add the mushrooms and cook for 5 minutes. Add 1 cup of wine and deglaze the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining wine and the broth. Bring to a boil. Reduce to a slow simmer. Add the duck and cook until medium rare, about 10 minutes. Remove the duck, slice on the diagonal and set aside. Increase the heat and simmer until liquid has reduced to 1 1/2 cups. Strain through a fine-mesh sieve. Season with salt and pepper. Place in a medium skillet and add the duck. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce is reducing, make the collard greens: cook the bacon in a large pot over medium heat until the fat is rendered. Remove the bacon with a slotted spoon. Add the greens and cook, stirring until wilted. Add the water, cover the pot, turn heat to low and cook until the greens are tender, about 15 minutes. Season with salt and pepper. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the duck and the sauce just until warmed through. Arrange the duck slices on each of 4 plates, spoon some of the sauce over them and sprinkle with parsley. Divide the collard greens and the spoonbread among the plates. Serve immediately."}]}