{"@context": "http://schema.org", "@type": "Recipe", "name": "Fredy Giradet's Poussins With Endives And Green Peppercorns", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "belgian endive, cornish hen, gluten-free, main course", "aggregateRating": null, "recipeIngredient": ["4 poussins or Cornish hens", "Coarse salt and freshly ground pepper to taste", "2 carrots", "1 rib celery", "2 shallots", "3 pounds Belgian endive", "2 lemons", "4 tablespoons peanut oil", "13 tablespoons unsalted butter", "1 small onion", "2 garlic cloves", "1/2 cup port", "1 cup chicken stock", "1 1/2 tablespoons sugar", "6 teaspoons green peppercorns, drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the poussins or hens inside and out with salt and pepper and truss them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the carrots and the celery and cut the shallots in half. Cut the endives in triangular pieces by cutting diagonally, giving the endive a quarter-turn and cutting again. Continue rotating and cutting until the endives are all sliced. Separate the leaves and put in a bowl. Squeeze one-fourthcup lemon juice on them to prevent them turning brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Heat the oil in a roasting pan over high heat, and when it is very hot put in the poussins. Brown them on all sides. This should take around 10 minutes. When the poussins are golden all over, remove them and pour the oil out of the pan. Replace it with four tablespoons of butter and let it melt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the poussins back in the pan on their sides and add the carrots, celery, shallots, onion and garlic. Roast the poussins in the preheated oven for 20 minutes, basting often with the pan juices and turning them carefully from one side to the other and finally onto their backs so that they cook on all sides. Watch the oven so that it does not overheat and burn the butter or the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the poussins are done, from 45 minutes to an hour, remove from roasting pan and discard the fat, leaving the vegetables in the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce. Hold the poussins over the roasting pan and drain the juices from the insides of the birds into the pan. Add two tablespoons of the butter to the roasting pan. Put the pan over medium heat and pour in the port. Let it boil while scraping the bottom of the pan firmly with a wooden spatula to get all the coagulated juices into the sauce. Add the chicken stock, bring the sauce back to boil and then strain it into a saucepan. Press the vegetables to get all their juices and discard the vegetables. Set the sauce aside while you prepare the endives."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the endives with the sugar, salt and pepper and three tablespoons of the lemon juice. Mix well. Heat one-and-a-half tablespoons of the butter in each of two frying pans and add half the endive to each. Cook over high heat for three minutes, stirring two or three times. Remove to a heated serving plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the sauce to a boil. Add the green peppercorns and the remaining tablespoon of lemon juice and then thicken the sauce by whisking in the remaining four tablespoons of butter. Put the poussins on top of the endives on a heated serving platter. Coat them very lightly with the sauce and serve the rest in a sauceboat."}]}