{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Broccoli", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, roasts", "keywords": "broccoli, chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 17}, "recipeIngredient": ["1 whole chicken, about 4 pounds", "1 bunch broccoli", "2 tablespoons olive oil", "1 cup chopped onion", "1 tablespoon minced fresh ginger", "1 large clove garlic, minced", "1/4 teaspoon dried crushed red peppers, or to taste", "1/2 cup dry white wine", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Dry chicken inside and out. Cut and separate broccoli flowerets from stems and reserve. Peel and chop the stems."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat two tablespoons of the oil in an ovenproof casserole large enough to hold the chicken. Lightly brown the chicken in the oil on all sides. Remove the chicken from the casserole and set aside on a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the onion, ginger, chopped broccoli stems, garlic and red pepper to the casserole and saute over low heat until the onion is transparent but not browned. Stir in the wine. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken to the casserole along with any juices from the plate. Cover the casserole and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the casserole in the oven and bake for 45 minutes. Scatter the broccoli flowerets in the casserole around the chicken, baste them with some of the juices in the casserole, cover and bake another 10 to 15 minutes, until the broccoli flowerets are tender and the chicken is done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the casserole and disjoint or carve it. Arrange the broccoli flowerets and the chopped broccoli and onion mixture around the chicken and serve."}]}