{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli Risotto", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "arborio rice, broccoli, vegetable stock, gluten-free, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "recipeIngredient": ["1/2 bunch broccoli", "3 cups (approximately) chicken stock or vegetable stock", "2 tablespoons olive oil or unsalted butter", "1/2 cup finely chopped onion", "1 1/2 cups arborio rice", "Salt and freshly ground black pepper", "1 teaspoon finely minced fresh sage or 1/2 teaspoon dried", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the flowerets from the broccoli, divide them into small pieces and steam about three minutes, until just tender and bright green. Rinse under cold water, drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop enough of the stems to make one cup, place in a small saucepan with about two-and-a-half cups of water and simmer until very tender, 15 to 20 minutes. Drain, reserving the cooking liquid. Puree the chopped broccoli in a food processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough chicken or vegetable stock to the cooking liquid to make five cups, place this stock in a saucepan and bring to a slow simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil or butter in a heavy saucepan. Add the onion and saute until the onion is tender but not brown. Stir in the rice and cook, stirring, about five minutes. Stir in the broccoli puree and season with salt and pepper and sage."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin adding the simmering stock, about a half-cup at a time, stirring and adding additional stock as the liquid is absorbed by the rice. After about 20 minutes nearly all the liquid should have been added. The rice should be just tender with a bit of resistance in the middle and the mixture should be creamy, not quite liquid. Stir in the reserved broccoli flowerets, check seasonings and serve with Parmesan cheese."}]}