{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Artichoke Hearts", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, one pot", "keywords": "arborio rice, artichoke hearts, chicken stock, low-fat, side dish", "aggregateRating": null, "recipeIngredient": ["4 large artichokes", "Juice of 1 lemon", "Water", "3 tablespoons extra-virgin olive oil", "1/2 finely chopped red onion", "2 cloves garlic, minced", "1 1/2 cups arborio rice", "5 cups hot chicken stock", "Salt and freshly ground black pepper", "3 tablespoons minced fresh parsley", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim each of the artichokes. First slice off the stem flush with the base. Tear off all the heavy outer leaves, then the inner ones until the thick, fleshy bottom is exposed. By this time there should be a small pointed cluster of leaves left. Cut through the leaves and the bottom vertically to quarter it, then cut away the remaining leaves and the fuzzy choke, leaving the round, solid bottom pieces. Cut the quarters of the bottom in narrow wedges and place in a bowl of lemon juice mixed with water to prevent browning while you prepare the rest of the artichokes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy saucepan. Add the onion, saute over medium heat for about five minutes, then stir in the garlic. Dry the artichoke pieces on a paper towel, add them to the saucepan and saute, stirring, another two to three minutes. Stir in the rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Keep the chicken stock at a simmer and add it to the rice about one-half cup at a time. Slowly stir the rice, adding more stock as it is absorbed. Regulate the heat so the mixture simmers. Continue adding stock and stirring until the rice is just tender and all the stock has been absorbed, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season to taste with salt and pepper. Fold in the parsley and serve with Parmesan cheese on the side."}]}