{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear-Pomegranate Pie", "description": "In this welcome departure from the traditional apple pie, a combination of Anjou and Bosc pears are caramelized in a mixture of pomegranate molasses and butter, then combined with a smaller portion of fresh, uncooked pears. The whole glorious mess is then dumped into an all-butter crust and baked until tender. The happy result is a pie that's soft and sweet, tangy and toothsome, and oh so good. (Don't let making your own pie crust intimidate you: our <a href=\"http://cooking.nytimes.com/guides/how-to-make-a-pie-crust \">pie guide</a> has everything you need to know.)", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/10/05/dining/mc-pear-pomegranate-pie/mc-pear-pomegranate-pie-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "One 9-inch single pie, 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "anjou pear, bosc pear, pomegranate molasses, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 272}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 437, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "89 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "8 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "434 milligrams", "sugarContent": "45 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 Bosc pears (about 2 pounds), peeled and cored", "4 Anjou pears (about 2 pounds), peeled and cored", "6 tablespoons pomegranate molasses", "3 tablespoons unsalted butter, cut into small pieces", "3 tablespoons tapioca", "3/4 cup light brown sugar", "1/2 teaspoon ground ginger", "1/4 teaspoon salt", "Flour, for dusting", "Dough for 2 9-inch pie crusts (<a href=\"http://cooking.nytimes.com/recipes/448-all-butter-pie-crust-with-variations\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Quarter 6 pears. In a large skillet over medium-high heat, bring 3 tablespoons molasses to a boil. Let simmer about 2 minutes, until molasses thickens. Arrange half the quartered pears in a single layer in skillet. Sprinkle 1 1/2 tablespoons butter over pears. Cook, turning occasionally, until pears are well caramelized on all sides (but not cooked through), about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape pears and molasses into a bowl. Add tapioca and toss to combine. Repeat cooking process with remaining molasses, butter and quartered pears. Add second batch of pears to bowl; combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice remaining pears and add to bowl. Stir in sugar, ginger and salt. On a lightly floured surface, roll out both crusts to 12-inch circles. Place one crust in 9-inch pie plate. Scrape pear filling into crust."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut remaining dough into strips about 1 inch thick. Top pie with strips, weaving them into a lattice. Crimp edges to seal. Place pie on a foil-lined, rimmed baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 15 minutes; reduce heat to 350 degrees and continue baking until crust is dark golden and pears are tender when pricked with a fork, about 45 minutes more. Let cool for 30 minutes before slicing."}]}