{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Breasts With Peppers, Tomatoes and Saffron", "description": "Portugal launched great explorations in the 15th and 16th centuries, often in search of spices, and to a large extent, their discoveries defined their national cuisines. They discovered Madeira, the Azores and the Cape Verde Islands. Vasco da Gama, seeking a sea route to India, brought back one of most important spices of all, black pepper. Exploration of the New World turned up sweet and hot peppers, corn, all varieties of beans, tomatoes, vanilla, avocados, chocolate, squashes and guavas (from which chewing gum is made). These discoveries truly revolutionized the kitchens of Europe. This dish has a sauce based on tomatoes and is typical of casseroles found in Portugal. First the peppers, onions and garlic are sautéed in olive oil. Tomatoes and saffron, another spice associated with the Iberian peninsula, are added to this mixture. The chicken is browned first, then slowly cooked. The pan is deglazed with chicken stock and white wine before the other ingredients are combined.", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": "https://static01.nyt.com/images/2016/12/05/dining/05COOKING-PORTUGUESECHICKEN1/05COOKING-PORTUGUESECHICKEN1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "portuguese", "recipeCategory": "dinner, one pot", "keywords": "bell pepper, chicken breast, saffron, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 856}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 352, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "3 grams", "proteinContent": "34 grams", "saturatedFatContent": "5 grams", "sodiumContent": "821 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "3 cups cored seeded sweet red, green and yellow peppers, cut into thin strips", "1 cup thinly sliced onions", "1 tablespoon finely chopped garlic", "Salt and freshly ground pepper to taste", "1 cup canned crushed tomatoes", "1/4 teaspoon saffron stems or 1/2 teaspoon turmeric", "2 tablespoons butter", "4 boneless skinless chicken breasts, about 1 1/4 pounds", "1 tablespoon finely chopped shallots", "1/4 cup dry white wine", "1/4 cup fresh or canned chicken broth", "4 tablespoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium high heat in a skillet. Add the peppers, onions, garlic, salt and pepper. Cook, stirring, about 3 minutes or until crisp tender. Then add the tomatoes and saffron. Cover and simmer 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, melt the butter in a skillet large enough to hold the chicken breasts in one layer. Season the chicken with salt and pepper. Cook over medium heat until lightly browned, about 4 minutes. Turn the pieces, reduce the heat and cook about 5 minutes or until done. Do not overcook. Transfer the chicken to a warm platter and keep it warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the shallots to the skillet and cook until wilted. Do not brown. Pour in the wine and scrape the bottom with a wooden spatula to dissolve any brown particles that may cling to the bottom of the skillet. Reduce the wine almost completely and add the chicken broth. Let this cook until it is almost totally reduced. Add the chicken breasts and any liquid that may have accumulated. Add the pepper and tomato mixture, bring to a simmer and add the parsley. Serve with rice."}]}