{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Pancakes", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "german", "recipeCategory": "", "keywords": "eggs, onion, russet potatoes, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "recipeIngredient": ["1 medium yellow onion diced small (about 1 1/4 cups)", "1 egg", "3 large russet baking potatoes, peeled, diced small (about 4 cups)", "5 to 7 tablespoons flour", "Salt and pepper to taste", "Vegetable shortening for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the onion and egg in a blender until they are liquified. Add about a third of the potato cubes and blend very quickly, just until lumps disappear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rest of the potato cubes and stir them into the puree. Blend quickly to eliminate all lumps but do not puree for more than a minute. If you have to do this blending in batches, remove half the potato batter, add the rest of the cubes and puree quickly, and combine with the rest of the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour all into a bowl and add the flour and salt and pepper. If the batter is very wet, blot the top with a towel until most of the water is eliminated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fry the pancakes, heat a heavy deep pan and melt the shortening to about a half-inch in depth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When shortening is very hot, drop large spoonfuls of batter into the hot fat and allow the pancakes to brown on one side. Then turn them over very carefully and brown them on the other side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain pancakes on paper towels. Serve immediately. If you are frying these in batches, keep them warm in a moderate oven for no more than 15 minutes."}]}