{"@context": "http://schema.org", "@type": "Recipe", "name": "Indian Nopales Salad", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT45M", "recipeYield": "Six to eight servings as a side dish", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "fall, nopales, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 140, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "332 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 large red bell peppers", "2 large poblano peppers", "3/4 pound firm, fresh nopales, or cactus paddles (see note)", "3/4 cup jicama (about 1/3 pound), peeled and cut to matchstick size", "3 tablespoons extra-virgin olive oil", "1 teaspoon oregano (preferably Mexican)", "1 teaspoon ground cumin", "4 tablespoons fresh lime juice, or to taste", "Salt to taste", "Freshly ground black pepper to taste", "1/2 cup pine nuts", "1/2 small red onion, peeled and sliced very thin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the bell and poblano peppers on a foil-covered baking sheet. Place them under the flame and roast, turning every few minutes, until the peppers are charred and blistered on all sides, about 15 to 20 minutes. Transfer the peppers to a brown paper bag and seal. Set aside until the peppers are cool enough to handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, carefully scrape off all the thorns from the nopales with a paring knife or a potato peeler. Shave off the outer edges. Place the nopales in a steamer in a small saucepan and steam them over high heat until they are just tender, about 5 minutes. (This can take more or less time, depending on the size.) They should be fairly soft but not gray and mushy. Remove and set aside to cool. Cut the nopales into thin strips about 2 inches long."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the strips in a bowl with the jicama. Remove the peppers from the bag. Slide the skins off, remove the seeds and ribs and scrape away any blackened sections. Cut the peppers into matchstick-size strips, the same size as the jicama and nopales. Add them to the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another bowl, combine the olive oil, oregano and cumin. Whisk in the lime juice and pour the mixture over the vegetables, tossing to coat. Season generously with salt and pepper. Add more seasoning if desired. Cover and set in the refrigerator overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the pine nuts on a small baking sheet and roast them until they are barely golden brown, about 5 minutes. Watch them carefully and stir often. Remove and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spread the vegetables on a platter. Lay the onion slices on top of them and sprinkle with the toasted pine nuts."}]}