{"@context": "http://schema.org", "@type": "Recipe", "name": "Gratin Of Penne And Vegetables", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "lunch, casseroles, one pot, pastas", "keywords": "broccoli, mushroom, penne, main course, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 549, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "5 grams", "proteinContent": "21 grams", "saturatedFatContent": "17 grams", "sodiumContent": "823 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 quarts, plus 1/3 cup, water", "1/2 pound penne, macaroni or bow-tie pasta", "1 pound broccoli flowerets, cut into 1 1/2-inch pieces (4 cups)", "8 ounces mushrooms, cut into 1/2-inch pieces", "1 red pepper (8 ounces), seeded and diced (1 cup)", "1/2 cup walnut pieces", "2 tablespoons olive oil", "10 ounces spinach -- damaged or wilted leaves and stems removed -- washed", "3 tablespoons grated Parmesan cheese (see step 2.)", "1 teaspoon salt", "1/2 teaspoon freshly ground pepper", "1 cup grated Swiss cheese", "1 tablespoon unsalted butter", "1 1/2 tablespoons all-purpose flour", "2 cups milk", "1 cup heavy cream", "1/2 teaspoon salt", "1/2 teaspoon freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the 3 quarts of water to a boil in a large pot and add the penne. Cook for approximately 8 minutes, until just tender, and drain. Rinse briefly under cool water to stop the cooking if you don't intend to assemble the dish immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 1/3 cup of water to a boil in a large skillet. Add the broccoli pieces, cover, return to the boil and cook for 3 minutes, or until most of the water has evaporated. Add the mushrooms, red pepper, walnuts and olive oil and mix well. Add the spinach, still wet from washing, cover and cook 2 to 3 minutes, or until it is wilted. (At this point, the vegetables can be combined with the warm pasta, seasoned with salt and pepper and served with a little grated Parmesan cheese as a side dish.) For the gratin, set the vegetables aside while you make the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the bechamel sauce, melt the butter in a saucepan. Add the flour, mixing it in well with a whisk. Stir in the milk and bring the mixture to a boil, stirring with a whisk (especially around the edges where it might have a tendency to burn) until lightly thickened. Add the cream and salt and pepper, then return to the boil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, mix together the vegetables, pasta and bechamel sauce and stir in the Swiss cheese. Spread the mixture into a 10-to-12-cup gratin dish. If the ingredients are still hot, place the dish under a hot broiler for 5 minutes, until the top is lightly browned. If some of the ingredients are lukewarm or cool, heat the gratin for about 10 minutes in a 400-degree oven until bubbling hot, then brown for 5 minutes under the broiler. If the mixture is cool throughout, place the gratin in a 400-degree oven for approximately 15 to 20 minutes, then place under the broiler for 5 minutes. Serve immediately."}]}