{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Ciabatta", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT12H", "recipeYield": "4 small breads", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "flour, olive oil, yeast, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 756, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "152 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "6 grams", "proteinContent": "21 grams", "saturatedFatContent": "1 gram", "sodiumContent": "817 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1/4 teaspoon active dry yeast", "1/4 cup warm water", "3/4 cup tepid water", "2 1/2 cups unbleached flour", "1 teaspoon active dry yeast", "5 tablespoons warm water", "1 tablespoon olive oil", "1 cup plus 3 tablespoons tepid water", "3 3/4 cups unbleached flour, plus flour for dusting work surfaces", "1 tablespoon salt", "Cornmeal"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the starter, stir the yeast into the warm water and let stand until creamy, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tepid water. Then add the flour, a cup at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat by hand, in an electric mixer or in a food processor, to form a sticky dough. Place in a lightly oiled bowl, cover with plastic wrap and set aside in a cool place to rise until tripled in volume, 6 to 24 hours. Starter can be made in advance and refrigerated until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough, mix yeast with warm water in the bowl of an electric mixer. Set aside 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add oil and the prepared starter and a little of the tepid water. Start mixing at very slow speed, adding the rest of the tepid water gradually until these ingredients are well blended. Mix flour with salt, add them, and mix for 2 to 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Attach a dough hook to the mixer and mix for 2 minutes at slow speed, then 2 minutes at medium speed. Scoop the dough out onto a floured work surface and knead briefly. The dough should be very moist and elastic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dough in a lightly oiled bowl, cover with plastic wrap and set aside to rise until doubled, 1 1/2 to 2 hours. The dough should still be sticky but full of air bubbles."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dough on a well-floured work surface and cut into four equal portions. Roll each into a cylinder, then stretch the cylinders into rectangles about 4 by 10 inches."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you can bake the bread on stones, generously flour four pieces of parchment paper and place each shaped loaf on a sheet of the paper, seam side up. Otherwise, oil a baking sheet, dust it with flour and cornmeal and place the loaves on the baking sheet. Cover loosely with damp tea towels and allow to rise about 2 hours, until doubled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees with a baking stone in it if you have one. Dust the stone with cornmeal. Gently roll the breads from the parchment onto the stone so the seam is down and the floured side is up. Otherwise, simply place the baking sheet with the breads in the oven. Bake until the breads are golden brown, about 30 minutes, spraying them with water a few times during the first 10 minutes. Cool on racks."}]}