{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Turnovers", "description": "This recipe requires minimal attention, making it perfect for holiday gatherings or large parties. The apple triangles can be assembled up to a month ahead and frozen, since puff pastry is so packed with butter that it keeps perfectly.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/appletriangle/appletriangle-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "12 triangles", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall, puff pastry, tart apples", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 155}, "recipeIngredient": ["6 tablespoons granulated sugar", "1/2 teaspoon ground cinnamon", "1 cup peeled and grated tart apple, like Granny Smith (about 2 apples)", "1 tablespoon fresh lemon juice", "1/8 teaspoon salt", "Flour for rolling out pastry", "2 sheets frozen puff pastry, thawed overnight in refrigerator", "2 tablespoons coarse sugar like Demerara or turbinado (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. In a bowl, combine 2 tablespoons granulated sugar and cinnamon; set aside. In another bowl, mix apples, remaining granulated sugar, lemon juice and salt. Let sit 5 minutes, and drain, reserving juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured work surface, roll out a sheet of puff pastry to a rectangle roughly 9 by 12 inches. Cut into 6 squares, and place 1 tablespoon apple filling in center of each. Lightly brush edges with reserved apple juice; fold into triangles, and seal edges by crimping with a fork. Repeat with remaining puff pastry and filling. Transfer turnovers to freezer, and freeze until firm, at least 15 minutes. Turnovers can be kept frozen in zipper-lock freezer bags up to 1 month."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line 2 baking sheets with parchment paper or nonstick pan liners. Brush tops of frozen turnovers with apple juice, sprinkle with cinnamon sugar and arrange on baking sheets. (If reserved apple juice is no longer available, use commercial juice or water.) Sprinkle with coarse sugar. Bake until well browned, 20 to 25 minutes, rotating pans halfway through baking time. Let cool slightly before serving."}]}