{"@context": "http://schema.org", "@type": "Recipe", "name": "Duck-and-Shrimp Gumbo", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "creole", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "duck, okra, shrimp, fall, main course", "aggregateRating": null, "recipeIngredient": ["1/4 cup plus 2 teaspoons vegetable oil", "1 medium onion, peeled and chopped", "1 green bell pepper, stemmed, cored and diced", "2 ribs celery, diced", "1/4 cup all-purpose flour", "4 cups chicken broth, homemade or low-sodium canned", "2 teaspoons dried thyme", "1 teaspoon dried oregano", "1 bay leaf", "1/2 teaspoon cayenne pepper", "1/2 teaspoon freshly ground pepper", "1/2 teaspoon salt", "1 4-pound duck, cut into serving pieces and skinned", "1 10-ounce box frozen cut okra", "1 pound large shrimp, shelled and deveined"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot over medium heat, heat 2 teaspoons of oil and cook the first three vegetables until soft, about 8 minutes. Scrape the mixture into a bowl and set aside. Heat the remaining 1/4 cup oil over medium-high heat until it begins to smoke. Gradually add the flour using a long-handled whisk (mixture will get very hot). Lower the heat slightly and cook, whisking constantly, until mixture turns a deep reddish brown color, about 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat and gradually whisk in the chicken broth. Stir in the onion mixture, herbs, spices, pepper and salt. Add the duck and simmer slowly for 25 minutes, skimming off the foam. Stir in the okra and cook 5 minutes longer. Remove the pan from the heat. Remove the duck with tongs; when cool, pull the meat off the bones and cut into bite-size pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim fat from the broth. Bring to a boil. Stir in the shrimp, immediately remove from the heat and let stand for 2 minutes. Stir in the duck meat and add salt and pepper to taste. Ladle over cooked white rice and serve."}]}