{"@context": "http://schema.org", "@type": "Recipe", "name": "Freda Cenarrusa's Braised Lamb Shanks", "description": "", "author": {"@type": "Person", "name": "Susan Herrmann Loomis"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "Six servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, project", "keywords": "egg noodles, lamb shanks, parsley, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 858, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "58 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "3 grams", "proteinContent": "61 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1031 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 lamb shanks, weighing 16 to 18 ounces each, trimmed of excess fat", "Salt and freshly ground black pepper to taste", "1 large onion, diced", "3 cloves garlic, minced", "1/2 cup hearty red wine", "1 pound dry egg noodles", "1 cup loosely packed parsley leaves for garnish", "1 garlic clove for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Brown the lamb shanks in a Dutch oven or a large skillet over medium-high heat. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the lamb shanks are browned, reduce the heat to medium. Add the onion and the garlic and work them down among the lamb shanks so they are on the bottom of the skillet. Cook, stirring as best you can by moving the lamb shanks around in the skillet, until the onions and garlic begin to turn golden, about five minutes. Pour in the wine and stir. When it begins to boil, reduce the heat to low, cover and cook until the cooking juices have thickened somewhat and the lamb shanks are tender enough to fall from the bone. Depending on the size and quality of the lamb shanks, this will take from three to four hours. If the cooking juices are browning too rapidly, add a half cup of water and continue cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the shanks are done, remove them from the cooking juices. Remove any meat from the bone and cut away any gristle you don't want to eat. If there are very large pieces of meat, cut them into bite-sized pieces. Keep them warm. Increase the heat under the pan to medium and reduce the cooking juices, stirring up any brown bits, until they are thickened, about five minutes. Season to taste and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the sauce is reducing, bring a large pot of salted water to a boil. Add the egg noodles, stir and cook until they are al dente, about 10 minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mince the fresh parsley and the garlic clove together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide the noodles among six warmed dinner plates or shallow soup bowls. Place equal amounts of lamb atop the noodles and pour the sauce over all. Garnish with the parsley and garlic and serve immediately."}]}