{"@context": "http://schema.org", "@type": "Recipe", "name": "Pears in Mint and Tea", "description": "", "author": {"@type": "Person", "name": "Jacques Pepin"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "dessert, mint, pear, tea", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 163, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "5 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "31 grams", "transFatContent": null}, "recipeIngredient": ["1 large lemon", "1/2 cup sugar", "6 Bosc pears (about 2 pounds)", "1 regular tea bag (orange pekoe or another tea to your liking)", "1/3 cup shredded fresh mint leaves or 1 mint-flavored tea bag", "1 teaspoon cornstarch dissolved in 2 teaspoons water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour 2 cups water into a stainless steel saucepan. With a vegetable peeler, peel the surface of the lemon, removing long strips of peel. Cut the lemon in half and press it to extract the juice. You should have 2 to 3 tablespoons of lemon juice. Add the lemon peel and juice to the water with the sugar, and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the pears and cut them into quarters. Remove the cores and place the pear wedges in the saucepan. Add the ordinary tea bag and, if fresh mint is not available, the mint-flavored tea bag. Bring the mixture to a boil over high heat, cover, reduce the heat to low and cook gently for about 20 minutes, until the pear pieces are tender when pierced with the point of a knife or with a fork. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately add the dissolved cornstarch to the saucepan and stir it into the juices to thicken them slightly. Let the pears cool in the syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, remove the tea bag and discard. If using fresh mint, stir it gently into the syrup. Divide the pears among six plates, about 4 wedges per plate. Spoon some of the syrup over the pears and serve."}]}