{"@context": "http://schema.org", "@type": "Recipe", "name": "Bourbon Roasted Pheasant With Braised Cabbage", "description": "", "author": {"@type": "Person", "name": "Joanna Pruess"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "2 - 3 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "bourbon, cabbage, pheasant, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 908, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "6 grams", "proteinContent": "39 grams", "saturatedFatContent": "18 grams", "sodiumContent": "1018 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon unsalted butter", "4 1/2 tablespoons vegetable oil", "2 large onions, peeled and chopped coarse", "1 large green or white cabbage (about 2 1/2 pounds), cored, tough ribs removed and shredded", "Salt to taste", "Freshly ground pepper to taste", "8 juniper berries", "1 pheasant (about 2 to 2 1/2 pounds, dressed), cleaned, plucked and skinned", "2 tablespoons Dijon mustard", "1 medium-size whole onion", "6 cloves", "1/2 cup flour", "1/2 cup bourbon or sour-mash whisky like Jack Daniel's", "1/3 to 1/2 cup heavy cream", "Chopped fresh parsley (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, deep casserole, heat the butter and 3 tablespoons of the vegetable oil over medium-high heat. When the butter foams, add the chopped onions and saute until they are lightly colored, about 6 to 8 minutes. Add the cabbage and cook until it begins to color, about 10 minutes. Cover, leaving the lid askew, and cook for 20 to 25 minutes, stirring occasionally, until the cabbage is medium-brown. Remove from the heat, season with salt and pepper and add the juniper berries. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Wash the pheasant under cold water and dry well. Season the cavity with salt and pepper. Brush the inside of the bird with the mustard. Stud the whole onion with the cloves and place it inside the cavity. Tie the legs together and turn the wing tips under. Lightly dredge the bird in flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy skillet, heat the remaining oil over medium-high heat. Add the pheasant and brown lightly on all sides, about 6 to 8 minutes. Transfer the pheasant, breast side up, to the casserole dish with the cabbage mixture. Pack the cabbage mixture around and over the bird. Cover the casserole and place in the middle of the oven. Cook for 35 to 45 minutes, basting several times with the pan juices, until the leg moves easily in its socket and the juices run clear. Brush the cabbage off the top of the pheasant and bake uncovered for 10 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the dish from the oven. Transfer the bird to a warm platter, untie the legs and discard the whole onion. Drain any cooking juices back into the casserole dish. Place it on the stove over high heat and carefully pour in the bourbon. Heat the liquid and stir for 2 to 3 minutes. Turn the heat down to medium, stir in the cream and cook for 3 minutes. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut up the pheasant and serve it on a bed of the cabbage mixture. Top with chopped parsley, if desired."}]}