{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea Trout Tartar With Avocado and Herbs", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "irish", "recipeCategory": "dinner", "keywords": "avocado, citrus, trout, main course, raw", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 283, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "5 grams", "proteinContent": "21 grams", "saturatedFatContent": "3 grams", "sodiumContent": "458 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["24 ounces sea trout fillets (or salmon or halibut), trimmed", "1 teaspoon fine sea salt", "1 1/2 teaspoons fine brown sugar", "Juice of 1 lemon", "2 tablespoons aquavit", "2 tablespoons chopped fresh dill", "1 large shiso, chopped fine (about two tablespoons) or substitute fresh mint", "2 tablespoons chives, chopped fine", "1 large ripe avocado (or 2 small ones)", "Juice 1 lime", "1 large orange", "1 large red or pink grapefruit", "Sprigs of dill and torn shiso leaves to garnish", "6 teaspoons extra-virgin olive oil (1 teaspoon per plate)", "6 tablespoons reserved orange-grapefruit juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop sea trout fillets in quarter-inch cubes without crushing the flesh of the fish and make sure there are no small bones. Put fish in large bowl with salt, sugar, lemon juice, aquavit, dill, shiso leaves and chives. Toss gently. The fish can be served immediately or prepared in advance and allowed to marinate for 12 to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, divide the fish into six equal portions to create little towers in the center of six large individual plates (a one-and-one-half-inch ring mold can be used.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and halve the avocado, removing the stone, and cut each half into three. Cut each section into thin slices, leaving the narrow end intact. Spread it out in a fan shape on each plate to one side of the fish and sprinkle with lime juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut slice from top and bottom of the orange and grapefruit. Cut through the peel and pits in strips around each fruit and remove it. Work over a large bowl to catch the juice and segments. Segment the fruit by cutting between the flesh and membrane. Squeeze any remaining juice from membranes. Divide sections equally among the six plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish fish with sprigs of dill and torn shiso leaves. Sprinkle a teaspoon of olive oil over and around each plate and pour a little of the reserved fruit juice on the avocado and fruit sections. Serve immediately."}]}