{"@context": "http://schema.org", "@type": "Recipe", "name": "Yellow-and-Red-Pepper Yin-Yang Soup", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "lunch, soups and stews", "keywords": "appetizer, bell pepper, caviar, chicken stock", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 240, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "10 grams", "sodiumContent": "827 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["3 yellow bell peppers, stemmed, seeded and coarsely chopped", "1/2 teaspoon ground cumin", "2 pinches sugar", "4 cups chicken or vegetable stock", "3 red bell peppers, stemmed, seeded and coarsely chopped", "1/4 dried red chipotle chili, or other smoked, dried chili to taste", "1 cup heavy cream", "Kosher salt and freshly ground white pepper to taste", "1 tablespoon red flying-fish roe or salmon roe for garnish, or brunoise (tiny dice) of red bell pepper", "1 tablespoon sevruga caviar for garnish, or brunoise of yellow bell pepper", "Chopped chives for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine the yellow peppers, cumin, 1 pinch of the sugar and 2 cups of the stock. In another small saucepan, combine the red peppers, chipotle, remaining pinch sugar and remaining 2 cups stock. Place both pans over medium heat, bring to a boil, reduce the heat and simmer, uncovered, until the peppers are very tender, about 25 minutes. Remove both pans from the heat and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the yellow-pepper mixture to a blender and blend until smooth. Strain through a fine-mesh sieve back into the pan, pressing the solids with the back of a spoon to extract as much liquid as possible. Discard the solids. Repeat the process with red-pepper mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place both pans over medium-low heat and stir 1/2 cup cream into each saucepan. Season to taste with salt and pepper; do not boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm 6 wide soup bowls. Using 4 layers of aluminum foil, fashion a divider that will fit securely in bowls, dividing each in half. Place divider in one bowl. Pour 1/2 cup yellow soup into a cup with a spout. Pour 1/2 cup red soup into another cup with a spout. Simultaneously pour each soup into separate halves of bowl. Carefully remove divider. Garnish yellow half of the soup with 1/2 teaspoon red caviar (or brunoise of red pepper). Garnish red half with 1/2 teaspoon sevruga caviar (or brunoise of yellow pepper). Sprinkle with chives. Repeat with all bowls and serve."}]}