{"@context": "http://schema.org", "@type": "Recipe", "name": "Texas-Style Brisket", "description": "", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": null, "totalTime": "PT6H", "recipeYield": "8 to 10 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, project, roasts", "keywords": "beef brisket, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "recipeIngredient": ["1 5- to 6-pound piece beef brisket, with thick layer of fat", "1/4 cup basic rub (<a href=\"http://cooking.nytimes.com/recipes/4947-basic-rub-for-barbecue\">see recipe</a>)", "5 cups hickory or oak chips, soaked in cold water for 1 hour, and then drained"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat grill to 325 degrees, building fire on opposite sides of grill if using charcoal, or on one side or opposite sides if using gas. Season brisket with rub."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using charcoal, every hour for first 5 hours add fresh coals and toss 1/2 cup wood chips on each mound of coals. If using gas, place wood chips in smoker box, and preheat until you see smoke (depending on model of gas grill, use all 5 cups at once or 1 cup every hour for first 5 hours)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place brisket, fat side up, in foil roasting pan just large enough to hold it. Place pan in center of grill, away from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Barbecue brisket until nicely browned, cooked through and very tender, for 5 to 7 hours. If brisket starts to brown too much, tent it loosely with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer cooked brisket to cutting board, cover with foil, and let rest for 10 minutes, reserving pan juices. With sharp knife, trim and discard any large lumps of fat. Slice brisket thinly across grain. Serve with slices of white bread, spooning pan juices over top."}]}