{"@context": "http://schema.org", "@type": "Recipe", "name": "Butterscotch Praline Parfait", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, heavy cream, ice cream, pecans", "aggregateRating": null, "recipeIngredient": ["1/2 pound light brown sugar", "4 teaspoons butter", "1 3/4 cups heavy cream", "8 ounces unsalted pecans (pieces are less expensive and fine for this recipe)", "1 pound granulated sugar", "Vanilla ice cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the butterscotch:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "in a 5-quart saucepan, combine brown sugar and 1 1/84 cup water. Place over high heat until the mixture is thick and foamy, about 3 minutes. Remove from heat and add the butter, swirling pan until butter is melted. Return to high heat, add the heavy cream and bring to a boil. Reduce until slightly thickened, approximately 5 minutes. Pour into a stainless-steel container and refrigerate until serving."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the praline:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "preheat the oven to 350 degrees. Place pecans on a baking sheet and toast in the oven for 5 minutes. Shake nuts once or twice so they don't burn. Remove the pan and set aside. In a large saucepan, combine sugar and 1/2 cup water over high heat. When the liquid starts to turn brown, swirl the mixture occasionally. Don't take your eyes off the mixture: it will foam up and will be done in seconds. The sugar should be a mahogany color. Immediately pour over the pecans. Let praline cool completely. Invert pan and whack the bottom with something heavy. Break into chunks. (It stores better in large chunks but the dessert requires smaller ones.) Leftovers can be stored at room temperature in an airtight container."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, warm the butterscotch in a double boiler or water bath. Fill four tall glasses with scoops of vanilla ice cream. Drop spoonfuls of butterscotch over the ice cream and speckle with pieces of praline."}]}]}