{"@context": "http://schema.org", "@type": "Recipe", "name": "Tangy Stuffed Flatbread", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT45M", "recipeYield": "2 large flatbreads, serving 4 or more", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "flour, jalapeño, yogurt, side dish, summer", "aggregateRating": null, "recipeIngredient": ["3/4 cup plain yogurt", "1/4 teaspoon ground cumin", "1/4 teaspoon salt", "2 cups all-purpose flour (approximately)", "1/2 cup grated fontina, Gouda or Monterey Jack cheese", "3 tablespoons crumbled feta cheese", "1 egg yolk", "2 tablespoons minced fresh parlsey", "1 fresh jalapeno or Serrano chili, seeded and minced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, combine yogurt with 1/4 cup water, the cumin and salt. Add two cups of flour, a cup at a time, mixing well to make a dough that is soft but not sticky. Add a little more flour if necessary. Divide dough into two balls, cover and allow to sit at room temperature 15 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a grill to a medium, not searingly hot, temperature. (Medium is as hot as some gas grills get.) Be sure the grates are clean and lightly oiled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the cheeses, egg yolk, parsley and chili together in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured board, roll out the dough into two rectangles, about 7 by 14 inches and 1/8-inch thick. Spoon half the filling over half of each rectangle, then fold dough to make a turnover that is roughly square. Press down with a fork on all the edges to enclose filling. Place the filled breads on a baking sheet to transport them to the grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill breads uncovered on the cooking grate for 3 to 4 minutes on each side, until crisp and lightly browned. Watch carefully so they do not burn. The flatbreads should be moist but not doughy inside. Serve at once, cut into sections."}]}