{"@context": "http://schema.org", "@type": "Recipe", "name": "Morels Rosenthal In Kataifi Nests", "description": "", "author": {"@type": "Person", "name": "R. W. Apple Jr."}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "fresh herbs, morels, pastry, main course, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 732, "unsaturatedFatContent": "29 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "54 grams", "fiberContent": "9 grams", "proteinContent": "11 grams", "saturatedFatContent": "21 grams", "sodiumContent": "601 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["12 ounces kataifi pastry (available at Greek and specialty markets), divided into four long bunches", "7 tablespoons butter", "1/2 cup chopped fresh herbs, like savory, thyme, oregano, or basil", "1/3 cup thinly sliced onion", "1/3 cup thinly sliced red bell pepper", "1 pound whole fresh morels", "2 tablespoons flour", "1/2 teaspoon salt", "1 teaspoon sugar", "1 tablespoon soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 300 degrees. On a nonstick baking sheet or a baking sheet lined with parchment paper, form each bunch of kataifi strands into a circle about 4 1/2 to 5 inches in diameter, allowing some strands to form the bottom of the nest. Melt 3 tablespoons butter, and drizzle over the kataifi. Sprinkle the fresh herbs on top. Bake until lightly golden and crisp, about 15 minutes. Set aside at room temperature. (Nests may be made up days in advance if stored in an air-tight container and kept cool.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saute pan over a medium flame, heat 2 tablespoons butter and add onion and bell pepper. Saute until slightly softened, about 1 minute. Add morels, and stir. Reduce heat to low, cover pan, and allow morels to braise for about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While morels are braising, prepare a roux: in a small saute pan over medium-low heat, melt the remaining 2 tablespoons butter. Add flour, and stir with a wooden spoon until smooth. Continue stirring until roux is golden brown, 5 to 7 minutes. Remove from heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add salt, sugar and soy sauce to the morels, and stir well. Bring liquid to a simmer, and stir in just enough roux to thicken the sauce. All of the roux may not be needed; the mixture will continue to thicken as it stands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place the kataifi nests on four serving plates, and fill each with morels. Serve immediately."}]}