{"@context": "http://schema.org", "@type": "Recipe", "name": "Quails With Peppercorns", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT6H45M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "fall, main course, side dish, peppercorns, quail", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 249, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "1 gram", "proteinContent": "22 grams", "saturatedFatContent": "4 grams", "sodiumContent": "297 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["8 quails", "1 1/2 teaspoons coarse sea salt", "3 tablespoons mixed whole peppercorns (any combination of white, pink, green and Sichuan)", "1/4 cup honey", "3 tablespoons apple-cider vinegar", "Chopped tarragon leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the quails and pat them dry. Use poultry shears or a sharp knife to cut away the feet and any extra neck portions from the birds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a small skillet over medium heat and add the salt and peppercorns. Roast the mixture, shaking the pan, until the peppercorns become fragrant and the salt just begins to color, about 2 minutes. Transfer the mixture to a cutting board and use the back of a heavy pot to very coarsely crush the peppercorns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub each quail generously inside and out with the peppercorn mixture. Refrigerate for 4 to 6 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook the quails, prepare a charcoal grill or preheat the oven to 425 degrees. Whisk together the honey and vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To grill the quails, have the coals at moderate heat. Place the quails breast-side down on the grill and brush them with the honey-vinegar mixture. Turn them every 3 to 4 minutes and baste with the sauce until all sides are browned and the juices from the quails are just rosy, about 12 to 20 minutes. (To roast in the oven, place the quails breast-side down in a roasting pan fitted with a rack and brush generously with the honey-vinegar mixture. Roast, turning every 5 minutes and basting again with the mixture, until they are nicely browned and the juices are just rosy, about 20 minutes. Remove them from the oven.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow the quails to sit, covered, for 5 minutes. Use poultry shears to split the quails down the middle and remove the back bone. Place the quail halves on a platter and garnish with chopped tarragon. Serve with cranberry relish (see recipe)."}]}