{"@context": "http://schema.org", "@type": "Recipe", "name": "Cambodian Hot-Pot Banquet With Vegetables And Seafood", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT6H", "recipeYield": "Eight servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "asian vegetables, chicken, seafood, main course", "aggregateRating": null, "recipeIngredient": ["2 large chickens, cut into pieces", "8 quarts water", "6 stalks fresh lemongrass (bottom 5 inches only)", "1 tablespoon coriander seeds", "2 teaspoons kosher salt", "3 grinds fresh pepper", "4 lemons", "8 cloves garlic, peeled", "1/2 cup sugar", "1/2 cup nuoc mam", "1/2 cup chicken broth", "1 1/2 teaspoons chili-garlic sauce, plus more to taste", "2 fennel bulbs, trimmed and cut into 6 wedges", "4 small zucchini, trimmed, halved lengthwise and cut across into 2-inch pieces", "8 medium carrots, peeled, halved lengthwise and crosswise", "16 asparagus tips with 2 inches of stalk left on", "16 shiitake or white mushrooms, stemmed", "2 small heads Napa cabbage, quartered and tied together with string", "2 small taro roots, peeled and cut into chunks about 3/4 inch by 1 1/2 inches", "16 scallions, white and light green parts only", "4 medium baking potatoes, peeled and cut into large chunks", "2 heads broccoli, florets only", "1 pound salmon fillet, cut into chunks about 2 inches by 1 inch by 1/2 inch", "1 pound tuna steak, cut into chunks about 2 inches by 1 inch by 1/2 inch", "1 pound sea bass fillet, cut into chunks about 2 inches by 1 inch by 1/2 inch", "1 pound large shrimp, peeled and deveined", "1 pound sea scallops", "16 littleneck clams", "16 small mussels", "1 pound squid, cut into rings"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least one day before serving, make the broth by placing the chickens in a large stockpot. Add the water and bring to a boil. Lower the heat and skim off the foam as it rises. Cook 10 minutes. Add the lemongrass, coriander, salt and pepper. Simmer slowly for 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dipping sauce, juice 2 of the lemons. Peel the other lemons with a paring knife, removing all peel and pith. Cut the lemon sections away from the membranes. Squeeze out the lemon remains to get all the juice. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Chop the garlic in a food processor. Add the lemon sections and juice and pulse to make a coarse puree. Scrape into a bowl and stir in the sugar, nuoc mam, chicken broth and chili-garlic sauce. Store, covered, in the refrigerator. (Let come to room temperature before serving.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth through a fine- mesh sieve. Refrigerate overnight and skim off the fat. Place in a large pot and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch the vegetables in the broth one type at a time, removing them with a slotted spoon or skimmer before adding the next group. Make sure the broth is simmering before adding the vegetables. Blanch the fennel until crisp-tender, about 5 minutes; zucchini until tender, about 3 minutes; carrots until tender, about 12 minutes; asparagus until crisp-tender, about 1 to 2 minutes; mushrooms until tender, about 3 minutes; Napa cabbage until crisp-tender, about 15 minutes, then untie; taro root until tender, about 15 to 20 minutes; scallions until tender, about 5 minutes; potatoes until tender, about 15 minutes; broccoli florets until tender, about 5 minutes. The vegetables can be blanched a few hours ahead of time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, strain the broth again and divide between 2 electric cook pots, large fondue pots or large pots that can be placed over electric hot plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the vegetables and the raw seafood on platters. Spoon the dipping sauce into 8 individual shallow bowls or plates. Guests should have long-handled forks, or individual dipping baskets, soup spoons, chopsticks and soup bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the table, heat the broth to a simmer and let guests cook the seafood and reheat the vegetables in the broth, as well as ladle some broth into their bowls."}]}