{"@context": "http://schema.org", "@type": "Recipe", "name": "Fromage Blanc Parfaits With Citrus Fruits And Caramel Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT30M", "recipeYield": "Six servings", "recipeCuisine": "french", "recipeCategory": "brunch", "keywords": "blood orange, fromage blanc, kumquats, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 475, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "81 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "9 grams", "proteinContent": "8 grams", "saturatedFatContent": "8 grams", "sodiumContent": "74 milligrams", "sugarContent": "70 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup fromage blanc or farmer's cheese", "1/4 cup mascarpone", "2 tablespoons almond paste", "3/4 cup whole milk", "1/4 cup sugar", "1 1/2 teaspoons gelatin", "1 tablespoon water", "2 tablespoons amaretto", "1/2 cup heavy cream", "8 blood oranges", "2 navel oranges", "4 mandarin oranges", "10 kumquats", "3/4 cup sugar", "1/4 cup water", "Juice from 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the parfaits, place the fromage blanc, mascarpone, almond paste, milk and sugar in a metal bowl over a pan of gently simmering water. Heat until the sugar and almond paste are dissolved, whisking occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a small bowl, sprinkle the gelatin over 1 tablespoon of water. Pass the cheese mixture through a strainer into another bowl. Add the gelatin and place back over the water, whisking just until gelatin dissolves. Let cool. Stir in the amaretto."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate the mixture until it is chilled and beginning to set; do not let it get firm. Whip the cream to soft peaks. Stir in 1/3 of the cheese mixture, then fold in the rest. Spoon into 6 1/2-cup ramekins. Refrigerate for several hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, squeeze the juice from 4 of the blood oranges and all of the navel oranges. Set aside. Working over a bowl to collect any juice, use a paring knife to remove all the peel and pith from the mandarin oranges and the remaining blood oranges. Cut the sections out from between the membranes. Thinly slice the kumquats crosswise, removing any pits. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the sugar, water and lemon juice in a medium saucepan over medium heat. Use a pastry brush dipped in water to wash down any sugar on the side of the pan. Cook until the sugar turns a nice caramel color. Quickly remove from heat and carefully add the orange juices. Return the sauce to the heat and simmer until reduced to a syrupy consistency. Remove from heat and stir in the orange sections and kumquats. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, dip the bottoms of the ramekins briefly in hot water. Run the tip of a small knife around the edge of the parfaits to loosen. Unmold onto 6 dessert plates. Spoon some of the sauce and fruit beside each one and serve immediately."}]}