{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Snapper With Eggplant and Tomato", "description": "", "author": {"@type": "Person", "name": "Joan Nathan"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "eggplant, red snapper fillets, tomato, kosher, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 20}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 418, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "5 grams", "proteinContent": "37 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1004 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["6 tablespoons extra-virgin olive oil, more if needed", "1 large onion, peeled and diced", "2 large tomatoes, peeled, seeded and diced", "2 teaspoons fresh thyme leaves", "1 bay leaf", "1 clove garlic, peeled and crushed", "2 tablespoons red-wine vinegar", "2 teaspoons honey", "Salt and freshly ground pepper to taste", "1 large eggplant (about 1 pound), peeled and cut into 1/4-inch rounds", "1 1/2 pounds red snapper fillets, deboned, with skin on one side, cut into 8 rectangular slices"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan, place 1 tablespoon of the olive oil and the onion, cover the pan, and sweat the onion for about 10 minutes. Then, add the tomatoes, thyme, bay leaf, garlic, 1 tablespoon of the vinegar, the honey and 1 additional tablespoon of the oil. Simmer, uncovered, over medium heat for 15 minutes, until much of the liquid has evaporated. Discard the bay leaf, and season to taste with salt and pepper. Puree in a food processor, and then put through a fine sieve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 more tablespoons of the oil in a large nonstick pan, and fry the eggplant until the rounds are golden brown on both sides. Repeat until all the eggplant has been cooked, adding more oil, if needed, for each new batch. Drain on paper towels; season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining tablespoon of vinegar to the pan, and stir for 1 minute over high heat to deglaze the pan. Spoon the liquid over the eggplant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean the nonstick pan. Working very carefully with the fish fillets, salt and pepper them on both sides. Place the fillets in the pan, and over medium heat fry them for 2 to 3 minutes on each side in the remaining 2 tablespoons of oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For each serving, place the tomato sauce in the middle of the plate, top with several rounds of the eggplant and then, carefully, with 2 fish fillets, skin side up. Serve warm."}]}