{"@context": "http://schema.org", "@type": "Recipe", "name": "Pot au Feu, With Horseradish Sauce", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 643, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "6 grams", "proteinContent": "46 grams", "saturatedFatContent": "13 grams", "sodiumContent": "567 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 to 4 lean beef flanken or 2 1/2- to 3-pound boneless brisket", "6 carrots, peeled", "2 leeks, well scrubbed", "2 stalks celery", "2 onions, each stuck with three cloves", "6 peppercorns", "8 cups stock (beef, chicken or a combination) or water, approximately", "1 2 1/2-pound chicken cut in half", "1 tablespoon dried, imported mushrooms soaked in 1 cup boiling water", "3 parsnips, peeled", "1 pound new potatoes", "4 1/2 tablespoons grated fresh horseradish", "1 1/2 cups sour cream", "Pinch sugar", "1 tablespoon chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine beef, two of the carrots, the leeks, celery, onions and peppercorns in a large kettle. Cover with stock or water. Bring to a boil and allow to boil for about five minutes, carefully skimming all the froth and scum that accumulate on the surface. Lower heat, partially cover and simmer gently for about one-and-a-half hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the broth with salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken, mushrooms with their liquid, parsnips and remaining carrots. Add more stock or water if necessary. Bring to a boil and allow to boil for five minutes, skimming any scum that accumulates on the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower heat, partially cover and simmer for about 45 minutes, until the chicken is done (the juices will run clear when the thigh is pricked with a fork). The beef should also be tender by this time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the chicken is simmering, boil the potatoes in a separate pan in salted water until tender, 20 to 30 minutes. Drain, cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the horseradish sauce. Combine four tablespoons of the horseradish with the sour cream. Add the sugar and a pinch of salt. Cover and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken and the beef from the kettle, carefully removing any bits of vegetable that cling to them. Cut them into manageable serving pieces and arrange them in a large, deep platter. Cut the carrots and parsnips into two-inch lengths and arrange them in the serving dish along with the boiled potatoes. Cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth through a fine sieve and skim off as much of that as possible. Moisten the meats and the vegetables with a little of the hot broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve the broth in cups as a first course, garnished with the parsley mixed with remaining half tablespoon of horseradish. The meats and vegetables should follow as a separate course with the sour-cream horseradish sauce served on the side."}]}