{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple-and-Fig Napoleons With Red-Wine Sauce and Sour-Cream Ice Cream", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "apple, phyllo, sour cream, dessert, fall", "aggregateRating": null, "recipeIngredient": ["2 cups whole milk", "1 vanilla bean, split", "6 egg yolks", "3/4 cup sugar", "2 pints sour cream", "Peel of 1 lemon, removed in fine strips with a zester (for garnish)", "6 sheets phyllo dough (keep covered with a damp cloth)", "3 tablespoons unsalted butter, melted", "6 tablespoons sugar", "2 bottles fruity red wine (like Beaujolais)", "1 1/2 cups sugar", "1 tablespoon black peppercorns", "1 2-inch cinnamon stick", "8 Macintosh apples, peeled, cored and cut into 3/4-inch chunks", "1/4 cup sugar", "3 2-by- 1/4-inch strips lemon zest", "1 vanilla bean, split", "1 teaspoon fresh lemon juice", "8 ounces dried mission figs, stemmed", "1/2 cup heavy cream", "1 tablespoon Armagnac", "1 teaspoon fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the ice cream, place the milk and vanilla bean in a medium saucepan over medium heat and bring just to a simmer. Meanwhile, whisk together the egg yolks and sugar. Whisking rapidly, pour the milk into the yolk mixture. Pour the mixture back in the saucepan, place over low heat and stir constantly until thick enough to coat the back of a spoon; do not let mixture simmer. Pour into a bowl, cover and refrigerate until cold. Remove the vanilla bean and whisk in the sour cream. Freeze in an ice cream machine. Store in freezer until shortly before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the phyllo, preheat the oven to 375 degrees. Lay 1 sheet of phyllo on a work surface, brush lightly with butter and sprinkle with 1 tablespoon of sugar. Top with another sheet of phyllo, brush with butter and sprinkle with sugar. Repeat once more. Trim the edges to make a 10-by-14-inch rectangle. Cut into 8 3 1/2-by-5-inch rectangles. Place on a baking sheet lined with parchment paper. Repeat with the remaining phyllo, butter and sugar. Bake until lightly browned and crisp, about 5 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, combine all ingredients in a large saucepan and simmer until reduced to 1 1/3 cups, about 40 minutes. Strain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the apples, combine the apples, sugar, lemon zest and vanilla bean in a medium saucepan over low heat. Cook, covered, for 8 minutes, stirring once. Uncover and simmer until apples are soft but not mushy and some liquid has evaporated, about 5 minutes more. Remove the lemon zest and vanilla bean. Stir in lemon juice and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the fig paste, puree the figs in a food processor. Add the cream, Armagnac and lemon juice and puree until smooth. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, place 1 piece of phyllo on each of 8 plates and spread with some of the fig paste. Spoon the apple mixture over it. Spoon a pool of the sauce beside the pastry on each plate. Lean 1 piece of remaining phyllo over the sauce and against one of the longer edges of the plated phyllo. Repeat with all the plates. Place a scoop of ice cream beside the napoleons and sprinkle with a few strands of lemon zest. Serve immediately."}]}