{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Jelly With Cold Poached Chicken", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT5H20M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "chicken, chicken gizzards, main course", "aggregateRating": null, "recipeIngredient": ["5 pounds chicken backs and necks", "5 quarts water", "2 cloves", "1 medium yellow onion, unpeeled", "1 sprig fresh parsley", "1 rib celery, roughly chopped", "5 black peppercorns", "Kosher salt to taste", "3 pounds chicken gizzards, washed", "2 chicken breasts, on the bone, split and skinned", "Freshly ground pepper to taste", "1 tablespoon chopped Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Add chicken backs and necks to 4 quarts of water in a large pot. Press the cloves into the onion and add to the pot along with the parsley, celery and peppercorns. Bring to a boil. Lower heat and simmer slowly for 3 hours, skimming off the foam. Season with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you wish to save the gizzards for another use, tie them in cheesecloth. Add them to the pot with 1 quart of water. Simmer 2 more hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and save gizzards if desired. Strain broth through a fine mesh sieve. Clean pot and pour broth back in. Bring to a boil, lower the heat slightly and simmer for 1 1/2 hours. Lower the heat so the broth is at a bare simmer. Add chicken breasts and poach until just cooked through, about 25 minutes. Remove breasts from the broth and set both aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate chicken and broth overnight. Remove layer of fat from chicken jelly. Remove the breast meat from the bones and thinly slice on the diagonal. Season with salt and pepper. Spoon some jelly into 4 bowls and fan chicken over it. Sprinkle with parsley and serve. Leftover chicken jelly can be used in soups or sauces for a rich chicken broth."}]}