{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Potatoes", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "main course, pasta, potato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 417, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "6 grams", "proteinContent": "13 grams", "saturatedFatContent": "1 gram", "sodiumContent": "639 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil", "1/2 cup minced pancetta or bacon, optional", "3 or 4 potatoes, about 1 1/2 pounds, peeled and cut into bite-size chunks", "1 tablespoon chopped garlic", "3 or 4 small dried hot red chiles, or to taste (or substitute about 1 teaspoon crushed red pepper flakes)", "1 28-ounce can whole plum tomatoes, not drained", "1 1/2 pounds assorted dried pasta", "Salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put several cups of water in a pot on stove, and keep it at a simmer. Place olive oil in a large saucepan, and turn heat to medium. If you're using pancetta or bacon, add it to the oil and cook, stirring occasionally, until it becomes slightly crisp, about 10 minutes. (If you are omitting the meat, proceed to the next step.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potatoes, garlic and chiles and raise the heat to medium-high. Cook, stirring occasionally, until potatoes begin to brown all over, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add tomatoes and their juice, along with 2 cups of the simmering water, and bring to a boil. Turn heat down to medium-low, and cook uncovered, stirring occasionally to break up the tomatoes and prevent sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While potato mixture is cooking, break long dried pasta, like spaghetti, into several lengths; place cut pasta, like ziti, in a bag, and break it up with the back of a pot or a hammer. After potato mixture has simmered for about 10 minutes, add pasta and plenty of salt and pepper to pot. Simmer, stirring and adding the simmering water as necessary; mixture should remain thick and stewy, never dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When potatoes are tender and pasta quite tender &#8212; this will take 20 minutes or more &#8212; the dish is done. (It may be covered and refrigerated for a day or two, or put in a closed container and frozen for several weeks; it's likely that you will need to add more liquid when you reheat.) Check the seasoning, and add some crushed red pepper flakes, black pepper or salt if needed. Serve hot, in bowls."}]}