{"@context": "http://schema.org", "@type": "Recipe", "name": "Lemon Poundcake", "description": "This recipe came to The Times in 2001 in an article by the chef Bill Yosses, who would go on to become the executive pastry chef for the Obama White House. He learned it, he wrote, in France, from a pastry chef named Jacques Mahou at Au Vieux Four in Tours. \"He had a special technique,\" Yosses wrote. \"Instead of brushing the cake with a sweet syrup, Jacques immersed his in a lemon syrup bath. Then he gently squeezed the cake like a sponge. It was a tricky maneuver since the warm loaf was apt to fall apart -- you have to cradle it gently, and apply just a little bit of pressure -- but it's worth the extra care. The cake absorbs a lot more liquid, which moistens the interior and intensifies the citrus flavor.\" In addition, Yosses added lemon segments to the batter. \"The fruit evaporates, leaving behind powerful little pockets of lemon,\" he wrote. \"It makes a major difference. The lemon segments, combined with the syrup, also help preserve the cake. Well wrapped and stored in the refrigerator, it keeps for 7 to 10 days\"", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2015/12/24/dining/24COOKING-LEMONPOUNDCAKE/24COOKING-LEMONPOUNDCAKE-articleLarge.jpg", "totalTime": "PT2H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, lemon, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 346}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 724, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "121 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "14 grams", "sodiumContent": "136 milligrams", "sugarContent": "83 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["9 lemons", "2 3/4 cups all-purpose flour", "1 1/2 cups superfine sugar", "1 1/2 teaspoons baking powder", "3/4 cup crème fraîche or heavy cream", "6 large eggs", "11 tablespoons unsalted butter, melted", "1 1/2 cups granulated sugar", "1/2 cup confectioners' sugar", "Raspberry coulis, optional", "Mint ice, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Grease a 9-by-5-inch loaf pan, line with parchment or waxed paper. Grease paper. Grate zest of 4 lemons; slice tops and bottoms off 3 (reserve fourth). Stand lemons on end on a cutting board, and cut away white pith until the flesh is exposed. Over a bowl, cut segments from membranes, letting fruit and juice fall into bowl (remove seeds). With fork, break segments into 1-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour, superfine sugar and baking powder into the bowl of an electric mixer. Begin mixing on low speed, then add crème fraîche or cream. Increase speed to medium, and beat in eggs, one at a time, then butter. Gently fold lemon segments and juices and 3 tablespoons zest into batter. Scrape into pan, and bake 15 minutes. Use a sharp knife to cut an incision lengthwise down middle of cake, and bake 30 minutes longer. Lower oven to 325 degrees, and bake 40 to 45 minutes longer, or until a tester comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, juice the remaining 6 lemons. Put granulated and confectioners' sugars in a pot, and add 1 1/2 cups water. Bring to a simmer, and cook, stirring, until sugar dissolves. Stir in lemon juice and remaining zest, and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cake is done, put pan on a wire rack for 30 minutes. Raise oven to 350 degrees. Unmold cake, and transfer it to a pie pan or deep dish. Pour lemon syrup over cake, and very gently squeeze the cake to help it absorb syrup. Carefully turn cake upside down in syrup, and squeeze a bit more. Put cake on a baking sheet; return to oven for 10 minutes. Cool on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, lightly toast 1/2-inch slices of the cake. If desired, put raspberry coulis on each serving plate. Place two slices of cake on top and a scoop of mint ice on top of cake."}]}