{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato And Artichoke Gnocchi In Lobster Broth", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "all-purpose flour, lobster, potato, main course", "aggregateRating": null, "recipeIngredient": ["2 cups dry white wine", "1 small onion, peeled and minced", "2 cloves garlic, peeled and minced", "4 1 1/2-pound lobsters", "1 pint cherry tomatoes, halved", "1 teaspoon grated lemon rind", "1 1/2 quarts chicken broth, homemade or low-sodium canned", "1/2 teaspoon saffron threa", "1 1/2 pounds boiled potatoes", "1 13 3/4-ounce can artichoke hearts, drained and finely chopped", "1 teaspoon salt, plus more to taste", "1/2 teaspoon freshly ground pepper", "1/2 cup all-purpose flour, plus up to 1/2 cup for kneading", "2 tablespoons minced basil leaves", "2 tablespoons minced scallions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine wine, onion and garlic in a large pot over medium heat. Bring to a boil and add the lobsters. Cook until lobsters turn bright red, about 10 minutes. Remove from pot and set broth aside to cool. Shell the lobsters, cutting the tail meat crosswise into 1-inch-thick pieces and leaving the claws whole. Set aside. Finely chop the shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the chopped lobster shells, lobster broth, tomatoes, lemon and chicken broth in a large saucepan. Simmer over medium heat until reduced to 1 quart, about 30 to 45 minutes. Strain. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a saucepan and cover with cold water. Simmer over medium heat until tender, about 30 minutes. Drain. Let cool slightly, peel and pass through a ricer into a large bowl. Stir in the artichokes, salt, pepper and flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough on a lightly floured surface. Knead the dough, adding more flour if necessary, until it is smooth and slightly sticky. Shape the potato mixture into small dumplings. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the lobster broth into a medium saucepan. Bring to a simmer over medium heat. Add the saffron. Working in batches, place the gnocchi in the simmering broth. Cook 10 seconds after the dumplings rise to the surface, about 5 minutes total time. Remove with a slotted spoon and divide among 6 warmed bowls. Ladle the broth over the gnocchi, divide the lobster and garnish with basil and scallions. Serve immediately."}]}