{"@context": "http://schema.org", "@type": "Recipe", "name": "Ismail Merchant's Very Hot Chicken Soup", "description": "Warmth is a given with chicken soup, but this one turns the heat up with ginger and chiles. It comes from Ismail Merchant, the Indian-born film producer and director who had a longtime partnership with James Ivory. It is an easy recipe and will take about an hour of your time, and is a deliciously healthy twist on an old standby.", "author": {"@type": "Person", "name": "Suzanne Hamlin"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, soups and stews", "keywords": "appetizer, main course, side dish, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 569, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "1 gram", "proteinContent": "43 grams", "saturatedFatContent": "11 grams", "sodiumContent": "752 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 whole 3-pound chicken", "5 to 6 cups water", "8 whole cloves", "1 1-inch piece fresh ginger, peeled and crushed or chopped very fine", "2 whole long or round dried hot red chili peppers, or 1/2 to 1 1/2 teaspoons dried red pepper flakes, to taste", "2 tablespoons olive oil or unsalted butter", "2 small fresh or canned tomatoes, peeled, seeded and chopped", "3/4 to 1 teaspoon salt, to taste", "1/2 teaspoon coarsely ground black pepper, or to taste", "Fresh cilantro or parsley leaves to garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chicken in a straight-sided 3-to-5 quart nonreactive pot, and add just enough water to cover. It should not take more than 6 cups. If it does, cut the chicken in quarters so no more water will be needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add all the other ingredients, except for cilantro or parsley, using the minimum amounts of chili pepper, salt and black pepper for the first 25 minutes of cooking time. Simmer gently, partly covered, for 15 minutes, adding water if necessary to maintain original level."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste for seasoning and cautiously add more chili, salt and black pepper. Continue to cook for another 20 to 25 minutes, until chicken is just about falling off the bones. Keep adding water to maintain original level. Remove cooked chicken, cloves and chili pepper stems, if any. Pick the chicken meat from the bones, discard skin and bones and return small chunks of chicken to the soup. Garnish with cilantro or parsley leaves."}]}