{"@context": "http://schema.org", "@type": "Recipe", "name": "Souffleed Citrus Tart", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT9H", "recipeYield": "Eight servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "almonds, lemon, dessert, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 422, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "12 grams", "sodiumContent": "140 milligrams", "sugarContent": "17 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 cups flour", "1 teaspoon plus 2 tablespoons sugar", "1/3 teaspoon salt", "2 tablespoons roasted ground almonds", "1 1/2 sticks cold sweet butter, cut into chunks", "1 egg yolk", "1/4 cup cold water", "1/4 cup shaved almonds", "5 eggs, separated", "1/2 cup sugar", "3 tablespoons flour", "1/3 cup fresh lemon juice", "1/4 cup grated lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour, 1 teaspoon sugar, salt and roasted ground almonds in a large bowl. Add the butter. Working very quickly with the tips of the fingers, combine until mixture resembles coarse cornmeal. In a small bowl, combine the egg yolk and water. Form a well in the center of the flour and butter mixture. Pour in the liquid and combine well. Form the mixture into a ball, cover and refrigerate for 4 to 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Roll out the crust and press it into a 9-inch tart pan. Press the shaved almonds into the crust. Line with wax paper, fill with pie weights and bake for 20 minutes. Remove the weights, sprinkle the crust with 2 tablespoons of sugar and bake for 5 more minutes until almonds are golden. Remove and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat the egg yolks until frothy. Continue beating while slowly adding 1/4 cup of the sugar. Beat until the mixture is thick and light yellow. Use a rubber spatula to fold in the flour, add the lemon juice and zest and stir to combine well. Transfer to a double boiler over medium heat. Cook, stirring constantly until the custard is thick enough to coat the back of the spoon, about 5 minutes. Remove from heat. Transfer to a large bowl and cool in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until they form soft peaks. Continue beating while adding the remaining sugar. Using a rubber spatula, fold about a cup of the egg whites into the lemon custard. Fold in the remaining egg whites, pour the filling into the shell and bake until golden, about 20 minutes. Cool and serve."}]}