{"@context": "http://schema.org", "@type": "Recipe", "name": "Cranberry Stollen", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "Two large loaves", "recipeCuisine": "german", "recipeCategory": "", "keywords": "all-purpose flour, almond paste, dried cranberries, dessert, side dish, winter", "aggregateRating": null, "recipeIngredient": ["2 packages active dry yeast", "1/4 cup warm water", "1/2 cup unsalted butter, softened, plus more for greasing bowl", "7 ounces almond paste", "1/2 cup sugar", "2 eggs, at room temperature", "1 cup whole milk, warmed slightly", "5 to 7 cups all-purpose flour", "2 teaspoons kosher salt", "1 teaspoon ground nutmeg", "1 cup chopped blanched almonds", "1 1/2 cups dried cranberries Confectioners' sugar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the yeast and water together and let stand until dissolved. Using an electric mixer, beat the butter and almond paste together until light. Beat in the sugar. Add the eggs 1 at a time, mixing well after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir the milk into the yeast mixture. Very slowly stir the yeast mixture into the butter mixture. Add 1 cup of flour, the salt and nutmeg and mix well. Stir in the almonds and cranberries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin adding flour 1 cup at a time until the dough becomes too difficult to stir. Turn the dough out onto a floured surface and knead until smooth, adding enough additional flour to make a soft but not sticky dough. Butter a large bowl, shape the dough into a ball and place in the bowl. Cover with a kitchen towel and let stand in a warm place until doubled in bulk, about 2 to 2 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough and divide into 2 parts. Press 1 piece of dough out with your hands into an oval shape about 12 inches long and 8 inches wide. Fold 1 of the long sides about two-thirds of the way over, overlap with the other side and press down firmly. Repeat with the remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Place the 2 pieces of dough on a baking sheet as far apart as possible. Cover with a towel and let rise for 45 minutes. Bake until breads sound hollow when tapped on the bottom, about 45 minutes. Cover with aluminum foil if breads brown too quickly. Cool on a rack. Sift confectioners' sugar over the tops before serving."}]}