{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Shanks With Tomato Sauce", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "main course, tomato, veal shank, veal stock", "aggregateRating": null, "recipeIngredient": ["4 tablespooons unsalted butter", "2 medium onions, minced", "2 carrots, minced", "2 leeks, minced (just the white parts)", "2 ribs celery, minced", "1/3 cup olive oil", "8 medium-size pieces of veal shank", "1/2 cup flour", "1 cup white wine", "1 pound peeled, seeded tomatoes, diced", "2 cups veal stock", "6 leaves fresh basil", "Strip of lemon rind", "1 bay leaf", "2 sprigs fresh thyme or 1/4 teaspoon dried thyme", "2 sprigs parsley", "3 cloves garlic, peeled and crushed", "Salt to taste if desired", "Freshly ground pepper to taste", "1 pound wheat noodles"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In large, deep skillet, melt the butter over medium-low heat, and saute the onions, carrots, leeks and celery for about 10 minutes, or until they are soft but not browned. Remove skillet from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a separate skillet, heat the oil over medium-high heat. Dredge the veal shanks in flour, and shake off excess. Brown them a few minutes on each side. Remove shanks and place them in the first skillet over the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Deglaze the empty browning skillet with white wine, and then reduce liquid by half. Pour this over the shanks. Put the skillet containing veal shanks back over the heat, and add remaining ingredients and salt and pepper to taste. Bring liquid to a boil; let it boil for 3 to 4 minutes. Reduce heat to low and simmer, covered, for about 1 hour and 15 minutes. Then test the meat; it should be tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a deep pot, bring lightly salted water to a boil. Add noodles and cook until done, 5 to 10 minutes depending on the thickness. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat from the skillet, and keep it warm. Turn up heat, and reduce cooking liquid until it is fairly thick. Remove bay leaf, parsley sprigs, lemon strip and thyme sprigs. Pour sauce into a blender, and mix at low speed at first. Taste for seasoning. Then blend at high speed for about 10 seconds. Serve veal shanks with noodles on the side; pour sauce over both."}]}