{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple Galette", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "all-purpose flour, apple, dessert, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 418, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "3 grams", "proteinContent": "4 grams", "saturatedFatContent": "15 grams", "sodiumContent": "112 milligrams", "sugarContent": "23 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup cold unsalted butter", "1 cup all-purpose flour, plus more for rolling", "1/4 teaspoon kosher salt", "2 to 3 tablespoons cold water", "1/2 cup apricot jam or preserves", "2 teaspoons water", "3 medium Gala or Golden Delicious apples, cut into 1/8-to-1/16 -inch slices", "1 tablespoon sugar", "2 teaspoons unsalted butter, cut into shavings", "1 cup sour cream mixed with 1 tablespoon sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry, cut the butter into small pieces and freeze for 5 minutes. Put the butter, flour and salt in a food processor. Process for 10 seconds, add 2 tablespoons of water in humid weather or 3 tablespoons in dry weather. Process for another 10 seconds or until the mixture looks like cornmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump the mixture onto a counter and bind a small amount at a time with the heel of your hand, using a sliding motion to incorporate the butter and flour smoothly. Gather the dough into a ball and flatten it. Wrap in wax paper and refrigerate for 15 minutes, just long enough to firm up the butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Flour a work surface and rolling pin. Roll the dough to a 13-inch circle, keeping counter and rolling pin floured to prevent sticking. Refrigerate on a parchment-lined baking sheet until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. To make the filling, heat the jam with 2 teaspoons of water in a small saucepan. Brush half of the warm jam over the dough. Arrange slightly overlapping apple slices on top, leaving a 1-inch border. Fold the border over the apples. Brush the apples and pastry edge with remaining jam. Sprinkle the apples with the sugar, then with shavings of butter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place on the bottom rack of the oven and lower the temperature to 400 degrees. Bake until the bottom of the crust (peek by gently lifting the tart with a long, narrow spatula) is golden, about 30 minutes. Serve warm with a bowl of sweetened sour cream."}]}