{"@context": "http://schema.org", "@type": "Recipe", "name": "Tomato Tart", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "brunch, lunch", "keywords": "appetizer, main course, pie dough, tomato, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "recipeIngredient": ["Prepared unsweetened pie dough for an 8-inch tart pan or 4-by-13-inch rectangular tart pan", "2 1/2 tablespoons olive oil, plus more for drizzling", "2 onions, thinly sliced", "Salt and freshly ground black pepper", "1 cup goat cheese", "1 pound tomatoes (any combination of red, yellow, heirloom, cherry), sliced if large or halved if small", "1/2 cup crumbled feta or Stilton cheese", "1/4 cup pitted calamata olives (optional)", "8 sliced basil leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Roll out the dough to about 1/4 inch thick and line the tart pan with it, pressing excess dough against the sides to make a thicker edge. Prick bottom and sides with a fork. Line with parchment paper, fill with pie weights or dried beans and bake for 20 minutes. Remove weights and parchment and bake another 7 or 8 minutes, until crust is golden brown. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat and add the onions. Season with salt and pepper and cook until the onions are lightly browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the onions over bottom of the crust and dot with goat cheese. Arrange tomatoes on top in a mosaic pattern. Dot with the feta or Stilton and push olives into the top. Sprinkle lightly with salt and pepper and drizzle with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat broiler. Cover the edge of the crust with foil to protect it from burning and broil until tart is lightly browned and bubbly, 4 to 5 minutes. Let cool to room temperature and garnish with basil."}]}