{"@context": "http://schema.org", "@type": "Recipe", "name": "Craig Claiborne's Smothered Chicken, Creole Style", "description": "For this version of a classic Southern smothered chicken, Craig Claiborne and Pierre Franey reddened the gravy and brought it some of the gentle heat of the Delta. Served with white rice, it makes for a classic family meal.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": null, "totalTime": "PT1H20M", "recipeYield": "Four servings", "recipeCuisine": "creole", "recipeCategory": "dinner, times classics", "keywords": "chicken, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 605, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "3 grams", "proteinContent": "45 grams", "saturatedFatContent": "14 grams", "sodiumContent": "960 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 chicken, approximately 3 1/2 pounds, butterflied (split down the backbone, breast left intact and unsplit)", "Kosher salt and freshly ground black pepper, to taste", "2 tablespoons unsalted butter", "1 cup finely chopped onion", "1 cup finely chopped celery", "1 cup finely chopped, cored and seeded green pepper", "1 1/2 teaspoons finely minced garlic", "2 tablespoons all-purpose flour", "1 3/4 cups canned imported tomatoes, crushed or chopped", "1 bay leaf", "2 tablespoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Craig Claiborne believed a black iron skillet to be essential for the authentic preparation of this dish. Sprinkle the chicken on both sides with salt and pepper. Select a skillet large enough to hold the chicken comfortably when it is opened up as for broiling. Fold the chicken wings under to hold them secure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in the pan and add the chicken skin-side down. Cover the chicken firmly with a plate that will fit comfortably inside the skillet. Place a heavy can, stone or brick on the plate to weight it down. Cook over low heat, checking the skin side of the chicken, until it is nicely browned, approximately 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken to a warm platter. To the skillet add the onion, celery, green pepper and garlic and cook, stirring, until onions are wilted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with flour and stir to blend. Add the tomatoes, bay leaf, salt and pepper, stirring rapidly with the whisk. Bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken to the sauce skin-side up. Cover with the plate and weights and continue cooking over low heat 45 minutes longer. Remove the chicken to a warm platter and cook down the sauce briefly, stirring. Pour the sauce over the chicken and sprinkle with parsley."}]}