{"@context": "http://schema.org", "@type": "Recipe", "name": "Craig Claiborne's Smothered Chicken With Mushrooms", "description": "A classic of his Mississippi childhood, Craig Claiborne's smothered chicken made its debut in The Times in 1983, accompanied by mushrooms and small onions that give it a slightly more metropolitan flavor. (You could always omit these if you have neither on hand.) The basic idea is to split a chicken down the back and cook it whole in a skillet over butter, with a weighted plate on top to insure a crisp skin, and rich gravy. In terms of temperature and time, the Southern gospel of low and slow is key to achieving maximum smother.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/01/17/dining/recipes-smotheredchickenSUB/recipes-smotheredchickenSUB-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, times classics", "keywords": "chicken, mushroom, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 195}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 761, "unsaturatedFatContent": "26 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "47 grams", "fiberContent": "6 grams", "proteinContent": "49 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1496 milligrams", "sugarContent": "14 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 chicken, approximately 3 1/2 pounds, butterflied (split down the backbone, breast left intact and unsplit)", "Kosher salt and freshly ground pepper to taste", "4 tablespoons unsalted butter", "1/2 pound mushrooms, sliced, cut in half or quartered, depending on size", "16 very small white onions, about 1 pound, peeled and left whole", "1 bay leaf", "1/4 teaspoon dried thyme", "1/2 cup dry white wine", "1/2 cup chicken broth, ideally home-made", "2 tablespoons finely chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Craig Claiborne believed a black iron skillet to be essential for the authentic preparation of this dish. Sprinkle the chicken on both sides with salt and pepper. Select a skillet large enough to hold the chicken comfortably when it is opened up as for broiling. Fold the chicken wings under to hold them secure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt half the butter in the pan and add the chicken skinside down. Cover the chicken firmly with a plate that will fit comfortably inside the pan. Place a heavy can, stone or brick on the top of the plate to weight it down. Cook over low heat, checking the skin side of the chicken, until it is nicely browned, approximately 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove weight and plate and weights. Pour off most of the fat from the pan and add the remaining two tablespoons of butter. Turn the chicken skin-side up."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scatter the mushrooms over the chicken. Scatter the onions around it. Add the bay leaf, thyme, wine and chicken broth. Replace the plate and the weights and continue cooking over low heat about 45 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken to a warm platter. Spoon the mushrooms and onions around the chicken. Cook down the pan liquid until reduced by half. Pour this over the chicken and sprinkle with parsley."}]}