{"@context": "http://schema.org", "@type": "Recipe", "name": "'Big Night' Timpano", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "flour, ground meat, mozzarella, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "recipeIngredient": ["2 cups flour", "1/4 teaspoon salt", "3 large eggs, lightly beaten", "1 tablespoon olive oil", "1 pound ground pork", "1 pound ground beef", "1 teaspoon fennel seed", "1 egg, lightly beaten", "1/2 cup chopped parsley", "1 cup fine bread crumbs", "1 medium onion, diced", "1 medium carrot, minced", "1 medium rib celery, minced", "4 cloves garlic, minced", "2 tablespoons tomato paste", "4 tablespoons chicken broth or white wine", "2 28-ounce cans Italian plum tomatoes, passed through the medium disk of a food mill to remove seeds", "1/2 cup shredded fresh basil", "2 teaspoons salt", "Freshly ground black pepper, to taste", "1/2 pound penne or other short-shaped pasta, cooked al dente, drained and reserved", "3 tablespoons olive oil", "6 hard-boiled eggs, cut in quarters", "1 pound mozzarella, cut into 1-inch cubes", "1/2 pound thinly sliced Genoa salami"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pasta, mix the flour and the salt together, then stir the salted flour with the eggs and the oil. Continue to stir until the dough comes together in a ball. On a floured work surface, knead the dough for 10 minutes, or until silky smooth. Wrap with plastic and set aside at room temperature for at least 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine all the meatball ingredients. Roll into about 65 balls, using 1 tablespoon of meat for each. In a large nonstick frying pan, cook as many meatballs as will fit in 1 layer over medium heat, turning occasionally, for 20 minutes. Repeat if necessary. Set aside in a bowl at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same pan used to make the meatballs and utilizing the fat left in the pan, cook the onion, carrot, celery and garlic over medium heat for 8 minutes, stirring occasionally. Dissolve the tomato paste in the stock or wine and stir into the vegetables. Cook the mixture for 1 minute. Stir in the tomatoes and basil. Simmer for 30 minutes. Season with salt and pepper to taste and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the timpano, preheat the oven to 350 degrees. Toss the penne with 2 cups of the sauce. Roll out the pasta on a lightly floured surface to make a 26-inch round. Grease a 3-quart stainless- steel bowl with 2 tablespoons of oil and gently mold the pasta sheet to the contours of the bowl; there should be enough hanging over the edge to fold over and cover the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon 1 cup of penne into the bowl. Top with 1/2 cup of the sauce, 12 pieces of egg, half of the meatballs and 1/3 of the mozzarella. Repeat the process, this time using 3 cups of penne, 1 1/2 cups of sauce, the remaining eggs, meatballs and cheese. Top with the remaining penne and sauce. Create a final layer with the salami. Fold the pasta over the filling and brush with 1 tablespoon of oil. Cover tightly with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the timpano for 45 minutes. Remove the foil and bake for 45 more minutes. To check if it's done make a small hole at the top using a knife blade. If steam comes out and the cheese is melted, it's done. Otherwise, bake for 10 to 15 more minutes. To serve, remove from oven and cool for 5 minutes. Carefully turn upside down onto a large platter."}]}