{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Suckling Pig a la 'Grande Bouffe'", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "black truffle, slab bacon, suckling pig, main course", "aggregateRating": null, "recipeIngredient": ["2 8-ounce loaves French bread, cut into 1/2-inch cubes", "8 ounces slab bacon, cut into 1/2-inch cubes", "3 medium leeks, white and light green parts only, cleaned thoroughly and sliced thinly crosswise", "2 pounds chestnuts, scored, blanched, peeled and coarsely chopped", "1 1-ounce black truffle, sliced as thinly as possible", "1 tablespoon dried thyme", "1 teaspoon dried savory", "2 to 2 1/2 cups chicken stock", "1 tablespoon salt", "Freshly ground black pepper, to taste", "1 small suckling pig (about 15 pounds)", "1 cup white wine or water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 250 degrees. Lay the bread cubes out on 2 cookie sheets, in single layers. Bake for 20 minutes. Toss the cubes and bake for 10 more minutes; the bread should be dry, not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size skillet, cook the bacon over low heat until the fat is rendered and the bacon is crisp, about 20 minutes. Drain the bacon on paper towels. Cook the leeks in the bacon fat until they begin to soften, about 4 minutes. Add the chestnuts and stir for 4 minutes. Transfer to a large bowl, and add the bread cubes, bacon, truffle, thyme, savory, 2 cups of stock, salt and pepper. Add additional stock if you like the stuffing very moist."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise the oven to 475 degrees. Remove the tail from the pig. Stuff the cavity with the bread mixture. Truss the pig to enclose the filling. Place in a roasting pan (with or without a rack), the trussed opening face down. Tuck the back legs under the body. Cover the snout and ears with foil to avoid burning. Place on the middle rack and roast for 45 minutes. Turn the pan and roast for 30 minutes more. Remove the foil and roast another 15 minutes. (The skin should be hard and crackly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pig on a platter. Pour the wine into the pan and bring to a boil on top of the stove, scraping the bottom of the pan to get up any browned bits. Carve the meat, skin on. Serve with the stuffing on the side, moistened with the pan juices."}]}