{"@context": "http://schema.org", "@type": "Recipe", "name": "Puffed Montpelier Crackers", "description": "", "author": {"@type": "Person", "name": "Marilyn Stout"}, "image": null, "totalTime": "PT1H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, butter, montpelier crackers", "aggregateRating": null, "recipeIngredient": ["Montpelier crackers", "Ice water", "Butter", "Paprika (if desired)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow at least two whole crackers per person. Split each cracker in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put ice cubes into a large bowl of cold water. When the water is very cold, put in the split cracker halves. Have ready some clean damask napkins, the kind that are getting a few thin places in them. At the end of three minutes - or sooner, if they seem to be getting too soft - remove the crackers from the ice water. A pancake turner with holes in it is best for this. If the crackers stay in too long, they will fall to pieces; if not long enough, they will not puff."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When they have drained for about five minutes, put them into iron dripping pans and dot them thickly with soft butter. Dust them with paprika, if you wish. Heat the oven to 450 to 500 degrees and bake them until they are puffed, crisp, and golden brown. They should be done in 25 to 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "It is hard to get on too much butter. Always allow at least an hour for the whole process, as nothing is less attractive than a puffed cracker that has changed its mind and decided to be a wet blotter. It should show no symptoms of ever having been near the water. If you didn't put on enough butter the first time, add some more halfway through the baking. There is no use making them if you are not going to be reckless with butter."}]}