{"@context": "http://schema.org", "@type": "Recipe", "name": "Madame Mouriere's Cassoulet", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT5H35M", "recipeYield": "10 to 12 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "duck, pork sausage, white beans, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1281, "unsaturatedFatContent": "54 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "90 grams", "fiberContent": "14 grams", "proteinContent": "52 grams", "saturatedFatContent": "29 grams", "sodiumContent": "1175 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 Preserved Duck (<a href=\"http://cooking.nytimes.com/recipes/5689-preserved-duck-confit-de-canard\">see recipe</a>)", "2 pounds dried white beans (Great Northern are excellent)", "1 pound fresh pork rind or bacon, cubed", "2 bay leaves", "1 teaspoon dried thyme", "1/2 pound carrots, peeled and cut into 1/2-inch rounds", "1 tablespoon salt", "1/2 cup goose fat (see note) or butter", "2 1/2 pounds fresh all-pork garlic sausage (Polish or German sausage is fine)", "1 pound medium-sized onions (about 4) thin sliced", "2 cloves garlic", "2 1-pound-10 3/4-ounce cans imported plum tomatoes, undrained", "2 cups fresh bread crumbs, blended with 2 cloves finely minced garlic"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the confit, or preserved duck. This can be done weeks in advance or the same day if desired. To reduce the amount of time the dish takes, it is best to make it at least a day ahead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before the cassoulet will be served prepare the beans. Rinse them well and pick them over to eliminate tiny stones. Put them in a Dutch oven or large saucepan and cover with cold water. Bring to a boil, cover and remove from the heat. Allow to sit 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in another large saucepan cover the fresh pork rind or bacon with cold water and bring to a boil over high heat. Simmer for several minutes, rinse, drain and set aside. This is done to remove the salt, which would have a toughening effect on the beans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "By this time the beans should have swollen. Discard the liquid (to help make the beans more digestible), rinse the beans and cover them again with cold water. Add the bay leaves, thyme, and drained pork rind or bacon and bring to a boil over medium-high heat. Boil vigorously for about 45 minutes to one hour, or until the beans are quite well-cooked but still a bit firm. Add the carrots and additional boiling water if necessary and cook an additional 15 minutes, or just until the carrots are cooked. The mixture should not be too dry. Remove from the heat, stir in a tablespoon salt and allow to cool to room temperature. Cover and refrigerate overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a very large frying pan melt three tablespoons goose fat (or butter). Add the sausages all in a single coil, if you can, and cook them over medium heat for about 12 minutes on one side, about 6 minutes on the other side. (Remember which side was cooked for the shorter time. When the cassoulet is assembled, you will place the sausage with the less cooked side down, so the remaining fat will soak into the bean mixture.) You need not prick the sausage. Remove the sausage from the pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same saucepan, add an additional three tablespoons goose fat (if necessary) to cook the confit. If the confit was made ahead, let it come to room temperature to soften the fat and remove all of the confit pieces, wiping off the fat as you remove them. Now saute the pieces of confit over medium-high heat until the skin is very crisp and turns a rich, deep brown. Baste off the fat as necessary. The duck should cook about five to 10 minutes on each side. Remove from the frying pan, drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bean mixture from the refrigerator to bring to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same frying pan, add two tablespoons goose fat (if necessary) and cook the onions over high heat for about 5 minutes. Add the tomatoes and the liquid and a clove garlic and cook until the mixture is fairly dry, or about 30 minutes. The mixture should be a rich, deep red. Combine the bean and carrot mixture with the tomato and onion mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bones from the duck confit and cut the duck into large chunks without removing the skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Assemble the cassoulet in a large, earthenware casserole. An oval casserole measuring 12 by 17 by 3 inches deep is a perfect size for this recipe. Rub the inside of the casserole with one clove of garlic and discard the garlic. Layer in this order: a single layer of the bean mixture, using about a third of it. Cover this with the cutup pieces of duck. Add a second layer of the bean mixture. Add the sausages in one layer with less-cooked side down. Add the last layer of beans. Finally, add the bread-crumb mixture. Be sure there is at least half an inch of growing space between the bread crumbs and the rim of the casserole."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place in the oven and bake for 1 1/2 to 2 hours, or until the crust is golden and firm. Serve immediately."}]}