{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Tuna Salad", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner, salads and dressings", "keywords": "fish, tuna, waxy potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 696, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "11 grams", "proteinContent": "51 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1620 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 medium waxy potatoes, like Yellow Finn, Yukon gold, or Bintje", "1 1/2 pounds fresh tuna steak, cut at least 1 inch thick", "2 red or yellow bell peppers (or 1 of each), roasted, skinned and seeded", "1/2 cup extra-virgin olive oil, or more as needed", "Kosher salt and freshly ground pepper to taste", "3 shallots, peeled and finely chopped", "2 tablespoons finely chopped Italian parsley", "1/4 cup sherry vinegar or white-wine vinegar, or more as needed", "4 large handfuls of mixed greens, like basil, arugula, radicchio, bibb lettuce, chicory, dandelion and endive", "2 tomatoes, peeled, cut into 6 wedges and seeded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the potatoes in a 4-quart pot and cover with cold water. Simmer gently until tender, about 25 minutes, being careful not to overcook them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the grill, adjusting the rack 2 inches above the coals. Trim the tuna, discarding the skin and any dark purple flesh. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the roasted peppers lengthwise into 1/4-inch-wide strips. Put in a bowl and toss with 1 tablespoon of the olive oil. Season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the potatoes and peel while still hot. Slice into 1/4-inch rounds and arrange 1/4 of them in a pie plate or casserole. Sprinkle with 1/4 of the shallots, 1/4 of the parsley and salt and pepper. Repeat the layers until all the potatoes are used. Whisk 2 teaspoons of the vinegar with 1 tablespoon of the oil and pour over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly rub the tuna steaks with 1 tablespoon of the olive oil and season with salt and pepper. Grill until charred on the outside and rare in the center, about 2 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the greens in a large salad bowl and top with the potato mixture, the peppers and the tomatoes. Slice the tuna into 1/4-inch strips and arrange on top of the salad. Just before serving, make a vinaigrette from the remaining vinegar and oil and pour over the salad. Season with salt and pepper. Taste and toss with more vinegar or oil if needed. Serve immediately."}]}