{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Vinegar", "description": "Jean-Georges Vongerichten learned how to make this recipe from the chef Paul Bocuse, who popularized it at La Mère Brazier in Lyon, France. Chicken with vinegar is one of the great poultry dishes from that area, where the chickens are considered by many to be the best in the world. Mr. Bocuse insisted that it was neither the amount of work nor the cost of ingredients that determined the worthiness of a dish, but how it tasted. The variations are numerous, but the piercing flavor of vinegar is so dominant that it matters little whether you use shallots or garlic, thyme or tarragon. One technical note: Most wine vinegar sold in the United States has an acidity level of 7 percent; many French vinegars are just 5 percent acidity. So it's best to cut strong vinegar with some water.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/27/dining/Chicken-With-Vinegar/Chicken-With-Vinegar-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, red wine vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1133}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 579, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "1 gram", "proteinContent": "43 grams", "saturatedFatContent": "11 grams", "sodiumContent": "972 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil", "1 3-pound chicken, cut up for sauteing", "Salt and freshly ground black pepper", "1/4 cup minced shallots or scallions", "1 cup good red-wine vinegar", "1 tablespoon butter (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Set a large ovenproof skillet over medium-high heat. Add oil; when it is hot, place chicken in the skillet, skin side down. Cook undisturbed for about 5 minutes, or until chicken is nicely browned. Turn and cook 3 minutes on the other side. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place skillet in the oven. Cook 15 to 20 minutes, or until almost done (juices will run clear, and there will be just a trace of pink near the bone). Remove chicken to an ovenproof platter. Place it in the oven; turn off the heat, and leave the door slightly ajar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour all but 2 tablespoons of the cooking juices out of the skillet (discard them). Place skillet over medium-high heat, and add shallots; sprinkle them with a little salt and pepper, and cook, stirring, until tender, about 2 minutes. Add vinegar, and raise the heat to high. Cook a minute or two, or until the powerful acrid smell has subsided somewhat. Add 1/2 cup water, and cook for another 2 minutes, stirring, until the mixture is slightly reduced and somewhat thickened. Stir in butter, if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the chicken and any accumulated juices to the skillet, and turn the chicken in the sauce. Serve immediately."}]}