{"@context": "http://schema.org", "@type": "Recipe", "name": "Deviled Short Ribs With Pumpkin, Chickpeas And Kale", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT3H45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef short ribs, pumpkin, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 7}, "recipeIngredient": ["6 short ribs, about 1 pound each", "2 tablespoons kosher salt", "2 tablespoons cracked black peppercorns", "1/4 cup vegetable or light olive oil", "3 cups chopped onions", "6 cloves garlic, finely chopped", "2 tablespoons brown sugar", "12 ounces porter or stout", "4 cups beef, veal, chicken, vegetable stock or water", "3 cups diced fresh pumpkin or winter squash (butternut or acorn)", "2 cups canned chickpeas, drained", "3 tablespoons Dijon mustard", "1 teaspoon dry mustard", "2 tablespoons white wine", "2 cups fresh bread crumbs", "1/4 cup chopped fresh parsley", "2 cups chopped fresh kale, or Swiss chard", "Freshly grated horseradish root, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Rinse short ribs, and dry thoroughly with paper towels. Season with salt and pepper. In a large ovenproof casserole over high heat, heat oil and add ribs. Sear until well browned and crusty on all sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove ribs from pan, and reduce heat to medium. Add onions, and saute until just beginning to brown, about 10 minutes. Add garlic, brown sugar, porter and stock. Return ribs to pan, coverpan and bake in oven until meat is very tender, about 3 hours. Remove pan from oven. Transfer ribs to a platter, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add pumpkin to casserole, and place pan over medium-high heat. Cook until the liquid has reduced and thickened and the pumpkin is just tender, about 5 to 7 minutes. Reduce heat to low, and add chickpeas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 475 degrees, or a broiler with a rack 3 inches from heat. In a small mixing bowl, combine the Dijon mustard, dry mustard and white wine. Brush mixture on all sides of the short ribs. In a bowl, combine bread crumbs and parsley. Pat onto short ribs. Place ribs on a baking sheet, and place in oven or under broiler. Cook until hot and crispy, being careful to avoid burning, about 5 minutes. While ribs are browning, add kale to pumpkin and chickpea mixture. Simmer until heated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon pumpkin ragout into large flat soup plates. Place a serving of short ribs on top of each plate. Sprinkle with freshly grated horseradish, if desired, and serve immediately."}]}