{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Pheasant With Chestnuts", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chestnut, pheasant, main course", "aggregateRating": null, "recipeIngredient": ["1 cup stock made from pheasant neck and gizzard", "1 onion", "1 carrot", "Celery stalk and leaves", "thyme", "bay leaf", "Coarse salt and freshly ground pepper", "1 tablespoon butter", "2 carrots", "4 shallots", "1/2 pound small white turnips", "1 tablespoon flour", "1 2-2 1/2 pound pheasant, larded under the skin", "1/2 pound chestnuts", "1/2 cup red wine pheasant liver"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stock by simmering the pheasant neck and gizzard with the onion, carrot and celery, salt and pepper, thyme and bayleaf for 20 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a casserole large enough to hold the pheasant surrounded by vegetables in one layer. Saute the carrots, shallots and turnips in the butter until they are golden brown. Sprinkle the flour on the pheasant and brown in the butter. Turn down heat, cover and leave to simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, make a short vertical slit through the top of the chestnuts toward the bottom. Simmer for five minutes in boiling water. Remove with a slotted spoon one at a time and peel while hot. If your allow the chestnuts to cool, the inner skin sticks to the chestnut. Use rubber gloves if you cannot peel the chestnuts with your bare fingers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chestnuts to the casserole . Add the wine and one cup of stock. Cover and cook for half an hour. Test the pheasant for doneness and season with salt and pepper. Remove the pheasant to a serving dish. If the sauce is too liquid, bring to a boil and reduce. If it is too thick, add more stock."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the vegetables and sauce around the pheasant and serve hot."}]}