{"@context": "http://schema.org", "@type": "Recipe", "name": "Florence Fabricant's Lobster Fra Diavolo", "description": "“Lobster Fra Diavolo, lobster in a spicy tomato sauce with linguine, ‘brother devil’ style, sounds Italian, tastes Italian and is a staple in Italian restaurants. But is it Italian?” Florence Fabricant set out to find out in a 1996 column. She spoke to a number of experts on Italian food, but came away with few answers. Some insisted it was an Italian-American dish, with roots in New York, specifically Long Island or Little Italy, while others pointed to Naples. She included this recipe, adapted from “Lobster at Home” by Jasper White, the executive chef of the Legal Sea Foods chain. His version is served on bread, but this adaptation is served on pasta.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "linguine, lobster, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1009, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "99 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "8 grams", "proteinContent": "93 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1960 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 tablespoons extra virgin olive oil", "1 medium onion, chopped fine", "1 tablespoon garlic chopped fine", "1 teaspoon crushed red pepper flakes", "1 teaspoon dried oregano", "1 cup fish or seafood stock", "1/2 cup dry white wine", "1 tablespoon tomato paste", "1 bay leaf", "1 28-ounce can Italian plum tomatoes", "Freshly ground black pepper to taste", "2 lobsters, each 1 3/4 pounds, cut up", "Salt", "1 pound linguine", "1 tablespoon chopped Italian parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons of the oil in a heavy 3-quart saucepan. Add the onion and garlic, and saute over medium heat until they begin to brown. Stir in the pepper flakes and oregano. Stir in stock, wine, tomato paste and bay leaf. Pour the canned tomatoes into a strainer held over the saucepan so that you add the juice but not the pulp. Chop the pulp; then, add it to the saucepan. Bring to a simmer, and cook over medium heat, stirring from time to time, for 30 minutes. Season to taste with black pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining oil in a large saute pan. Add lobster pieces, and sear them over high heat, turning often, until the shells are bright red."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the lobster is searing, bring a large pot of salted water to a boil for the linguine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the sauce over the lobster, bring to a simmer and cook, partly covered, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the lobster is cooking in the sauce, add the linguine to the boiling water, and cook about 7 minutes, until al dente. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, transfer the lobster pieces coated with sauce to one side of a large platter, leaving some of the sauce in the pan. Sprinkle with half the parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the drained linguine to the sauce in the pan, and reheat briefly, stirring to coat the linguine. Transfer to the platter alongside the lobster, sprinkle with the remaining parsley and serve."}]}