{"@context": "http://schema.org", "@type": "Recipe", "name": "Len Allison's Baked Crabmeat Pirogi", "description": "", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT3H", "recipeYield": "About 48 pastries: appetizers for 12; main dish for 6", "recipeCuisine": "eastern european", "recipeCategory": "dinner", "keywords": "all-purpose flour, lump crab meat, appetizer, main course", "aggregateRating": null, "recipeIngredient": ["1 cup heavy cream", "1/2 cup chicken stock", "1/2 ounce dried porcini mushrooms, 1/2 cup lightly piled", "1/4 cup lemon juice", "Scant tablespoon Dijon mustard", "1 tablespoon salt", "1 pinch black peppers", "1 pinch cayenne peppers", "2 tablespoons dry Sherry", "2 egg yolks", "3 thinly sliced scallions, including 1 inch of the green part", "1 pound lump crabmeat", "3/4 of a 6/10-ounce cube of fresh yeast, crumbled, or 1/4-ounce package of active dry yeast", "6 tablespoons warm milk", "Pinch of sugar", "14 ounces all-purpose flour, about 2 3/4 to 3 cups", "2 1/4 teaspoons salt", "2 eggs", "1 egg yolk", "6 tablespoons creme fraiche or sour cream", "12 tablespoons butter, melted, plus butter for the bowl", "Cornmeal for baking sheets", "1 egg, beaten with 2 tablespoons of milk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the cream, stock and mushrooms in a small saucepan. Cook over medium-low heat, stirring more and more frequently, until the liquid is reduced to a half cup, 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the mushrooms with a slotted spoon and reserve. Stir the lemon juice, mustard, seasonings and Sherry into the liquid, then beat it into the two yolks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the yolk mixture to the pan and place over very low heat. Cook, stirring constantly, until thickened, about four minutes. Do not let it boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the mixture from the heat. Chop the mushrooms coarsely and add them, along with the scallions. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the crabmeat on a flat pan and pick out any obvious bits of shell. Set the pan in a 350-degree oven for three to four minutes, remove and allow to cool. Any remaining shells will stand out opaquely against the gray-white meat. Discard them, and add the crabmeat to the mushroom mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover tightly and chill at least one hour before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the yeast, milk and sugar. Stir until the yeast dissolves, then set aside in a warm place until foamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the flour and salt in a food processor fitted with a steel blade."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the eggs, yolk, creme fraiche and butter and set aside. When the yeast mixture is foamy, whisk it in."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the processor on and slowly add the yeast mixture through the feed tube. Process until the dough forms a ball on the blades, then process one minute longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter a bowl and transfer the dough to it. Cover tightly with plastic wrap and allow to rest in a warm place for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead the dough two or three times on a lightly floured board, then wrap tightly in plastic wrap and chill thoroughly. Dough may be made a day in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into tablespoon-size portions and roll each into a ball. Chill for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working with six balls at a time, sandwich in rows of three between sheets of waxed paper. Roll into circles one-third-inch thick, about three inches in diameter. As each sheet is rolled, refrigerate, still sandwiched in the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the top paper from a sheet of circles. Put a heaping-teaspoon-sized dollop of filling on each, slightly below center. Very lightly moisten the edges, fold over and seal securely, either by pressing with fork tines or pinching and folding as though for empanadas. As the pastries are formed, peel them from the bottom paper and set on cornmeal-sprinkled cookie sheets. Glaze and bake at once, or refrigerate, covered, until wanted, up to half a day."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Glaze the pastries with egg wash and bake for 20 minutes, or until puffy and browned. Serve at once, or cool on racks, wrap securely and freeze."}]}