{"@context": "http://schema.org", "@type": "Recipe", "name": "Crayfish Fricassee With Chablis", "description": "", "author": {"@type": "Person", "name": "Pierre Franey"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "crayfish, dry white wine, herbs, main course", "aggregateRating": null, "recipeIngredient": ["1 cup coarsely chopped onions", "1 cup coarsely chopped carrots", "1/2 cup coarsely chopped celery", "1/4 cup coarsely chopped shallots", "1 bouquet garni in cheesecloth consisting of 1 sprig thyme, 1 sprig parsley, 1 bay leaf", "12 black peppercorns", "1/4 cup vinegar", "Salt to taste", "4 pounds fresh crayfish (heads reserved for sauce)", "Reserved crayfish heads", "2 tablespoons butter", "1/3 cup coarsely chopped carrots", "1/3 cup coarsely chopped leeks", "1/3 cup coarsely chopped celery, plus 2 ribs", "1/2 cup peeled, seeded and coarsely chopped tomato", "1 cup white Chablis wine", "4 tablespoons butter", "1 tablespoon finely chopped sweet red pepper", "1/4 cup diced carrots", "1/4 cup diced celery", "1/2 cup Chablis white wine", "4 tablespoons fresh peas, blanched", "4 tablespoons fava beans, blanched and skinned", "Salt and freshly ground pepper to taste", "4 sprigs fresh tarragon for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the court bouillon. In a large pot, place the onions, carrots, celery, shallots, bouquet garni, peppercorns, vinegar, salt and 12 cups of water. Bring to a boil and simmer about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to prepare crayfish, take them, one-by-one, in the palm of your hand, belly up. With the thumb and forefinger of the other hand, remove the middle, fanlike appendage at the end of the tail, which is connected to the intestines. Pulling it out gently will remove the bitter, black intestine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the crayfish to the simmering court bouillon. Cover, and bring the liquid back to a boil. Remove the crayfish from the bouillon immediately. Allow them to cool briefly so that they can be handled for shelling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 4 whole crayfish with shells on for decoration. To shell the rest, gently separate the head section from the tail section. Reserve heads for the sauce. Remove the tail meat in one piece from its casing by squeezing the shell gently to loosen it and then gently pulling away each ring of the tail shell, one by one."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, crush reserved crayfish heads using a kitchen mallet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan melt the butter, and add the carrots, leeks, chopped celery and tomato. Cook, stirring, over medium heat. Add the crayfish heads, and continue to cook about 5 minutes. Add the wine, 2 cups water and the 2 celery ribs. Simmer for 15 minutes. Strain through a fine sieve and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble the dish, heat 1 tablespoon of the butter in a medium-size saucepan and add the sweet red pepper, carrots and celery. Cook, stirring, over medium heat, about 3 minutes. Add wine, and continue to cook until the liquid is reduced by half. Add the crayfish sauce, and cook until the liquid is reduced by half. Whisk in the remaining butter over medium heat, being careful not to let the sauce return to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add peas and fava beans, and continue to cook only until ingredients are heated through. Check for seasoning, and sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide shelled crayfish evenly among 4 warmed soup plates. Pour sauce over them. Top each serving with a whole crayfish in the shell, and decorate with a sprig of tarragon."}]}