{"@context": "http://schema.org", "@type": "Recipe", "name": "Andre Soltner's Treflai (Potato Pie)", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT2H", "recipeYield": "Four to six servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "main course, pastry crust, potato, smoked bacon", "aggregateRating": null, "recipeIngredient": ["Pastry for a 2-crust, 9-inch pie", "5 ounces thick-sliced mild smoked bacon", "1 1/4 pounds smooth skinned Long Island or Maine potatoes, peeled and sliced thin", "1/4 cup finely chopped parsley", "Salt and freshly ground black pepper to taste", "4 hard-cooked eggs, peeled and sliced thin", "1/2 cup creme fraiche or heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the bottom of a nine-inch pie pan with a little more than half of the pastry and chill. Reserve and chill the remaining pastry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the bacon strips crosswise into pieces a quarter-inch wide. Sautee the bacon until just beginning to brown around the edges. Drain on absorbent paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the potato slices in cold water to remove excess starch. Drain and dry them. Toss with parsley and season to taste with salt and pepper. Make a layer of overlapping slices of potato in the pastry shell, using half the potatoes. Cover with the pieces of bacon, then arrange the egg slices over the bacon and top with the rest of the potato. Spread with the creme fraiche. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the remaining dough into a circle to fit the top of the pie. Beat the remaining egg yolk with a teaspoon of cold water, brush the edges of the pastry, cover the pie and crimp and seal the edges. Brush the top with egg wash and cut several decorative slits in it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 20 minutes. Lower the oven temperature to 350 degrees and bake 50 minutes longer, then lower the heat to 300 degrees and bake another 10 minutes. Allow the pie to rest 10 minutes before cutting and serving."}]}