{"@context": "http://schema.org", "@type": "Recipe", "name": "Wiener Schnitzel", "description": "Perfect golden Wiener schnitzel can be a work of art. Or it can be the worst dish of your life, more like a piece of lead.\n\nthe eggs have to be beaten with a little cream to make them fluffier, the bread crumbs are not pressed onto the meat, and when you cook the schnitzel -- and you always do only one slice at a time -- you keep it moving in the pan, nearly covered with bubbling oil. That's the only way to get the coating on the veal to form a puckery, crunchy surface.\n\nI use the top round cut. The very white milk-fed veal doesn't have enough flavor. You don't have to worry so much about tenderness because the veal is pounded. Each portion is cut on the bias about a half inch thick. Make sure all the membrane, or silver skin, is removed. Slice each piece through the middle, not quite all the way, then open it like a book, a butterfly. Place it between sheets of plastic and pound it flat and evenly, not too hard. You can trim away any ragged edges.", "author": {"@type": "Person", "name": "Kurt Gutenbrunner"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "austrian", "recipeCategory": "dinner", "keywords": "bread crumbs, eggs, veal, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 34}, "recipeIngredient": ["1 1/4 pounds veal top round cut in 5-ounce scaloppines", "Salt and freshly ground white pepper", "1 cup flour", "2 eggs", "2 tablespoons heavy cream", "2 cups unseasoned bakery bread crumbs", "2 cups vegetable oil", "1/2 cup, packed, flat-leaf parsley leaves, rinsed, well-dried and coarsely chopped", "3 tablespoons unsalted butter", "4 lemon wedges", "Cucumber or bibb lettuce salad in vinaigrette dressing"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "One at a time, place veal pieces in heavy 1-quart plastic bag, and pound thin with meat pounder. Place veal on large platter, and lightly salt and pepper both sides."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put flour in shallow bowl wide enough to hold a piece of veal flat. Put eggs and cream in a similar bowl. Beat to blend. Put bread crumbs in a third similar bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 175 degrees. Line baking sheet with parchment. Arrange bowls near stove, along with a platter covered with layers of paper towel and a small plate covered with layers of paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in an 11- to 12-inch skillet or sauteacute; pan, the deeper the better. When oil is quite hot, put parsley in strainer, put in oil, and fry 10 seconds. Remove parsley, draining well, and place on the small plate. Add butter to skillet, and adjust heat to medium."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1 slice veal in flour, cover well, then shake off excess. Dip in egg, turning to coat. Put in bread crumbs, coating well, then shake off excess. Put in skillet, and fry about one minute, gently moving pan in circular motion on the burner. Oil should be frothy. When breading looks bubbly and starts to brown, turn and cook another minute, then transfer to paper-towel-lined platter. Repeat with remaining veal, adjusting heat so crumb coating cooks gradually and evenly, without burning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cooked, drained schnitzels on a baking sheet, and put in the oven until ready to serve, up to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange veal on platter or individual plates. Garnish with lemon wedges and fried parsley, and serve with salad."}]}