{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom-Barley Soup", "description": "Soup made without meat or meat broth can be insipid. That's why most people think pea soup needs ham and mushroom-barley soup needs beef. But it's possible to make a satisfying, even hearty, vegetarian soup if you choose your ingredients carefully and extract every bit of flavor from them. Enter this mushroom-barley soup, a vegetarian dish with real body, texture and depth of flavor. The key ingredient here is dried porcini, which can be reconstituted in hot water in less than 10 minutes, giving you the best-tasting mushrooms you can find outside the woods and an intensely flavored broth that rivals beef stock. Don’t forget to toast the barley while really browning the mushrooms and carrots — it lends a deep warmth.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/08/dining/mbarleysoup/mbarleysoup-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "one pot, soups and stews, times classics", "keywords": "appetizer, dried porcini mushrooms, pearl barley, shiitake, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 753}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 362, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "68 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "14 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "393 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce dried porcini mushrooms (about 1 cup)", "2 tablespoons olive oil", "1/4 pound shiitake or button mushrooms, stemmed and roughly chopped", "3 medium carrots, peeled and sliced", "1 cup pearl barley", "Salt and pepper", "1 bay leaf", "1 tablespoon soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak porcini in 3 cups very hot water. Put olive oil in a medium saucepan and turn heat to high. Add shiitakes and carrots, and cook, stirring occasionally, until they begin to brown. Add barley, and continue to cook, stirring frequently, until it begins to brown; sprinkle with a little salt and pepper. Remove the porcini from their soaking liquid, and reserve liquid. Sort through porcini and discard any hard bits."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add porcini to pot and cook, stirring, for about a minute. Add bay leaf, mushroom soaking water and 3 cups additional water (or stock, if you prefer). Bring to a boil, then lower the heat to a simmer; cook until barley is very tender, 20 to 30 minutes. Add soy sauce, and taste. Add salt if necessary and plenty of pepper. Serve hot."}]}