{"@context": "http://schema.org", "@type": "Recipe", "name": "Tarte Au Chocolat Amer (Bitter-Chocolate Tart)", "description": "", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT2H", "recipeYield": "Eight servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "all-purpose flour, bittersweet chocolate, eggs, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 288, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "9 grams", "sodiumContent": "56 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour", "1/8 teaspoon salt", "1/3 cup sugar", "6 tablespoons (3 ounces) unsalted butter, chilled and cut into pieces", "1 small egg, lightly beaten", "5 ounces bittersweet chocolate, perferably Lindt or Tobler", "1 whole egg", "2 egg yolks", "2 tablespoons granulated sugar", "1 teaspoon confectioners' sugar, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare the pastry, place the flour, salt, sugar and butter in the bowl of a food processor fitted with a metal blade. Process just until the mixture resembles coarse crumbs, about 10 seconds. Add the egg and pulse just until the pastry begins to hold together, about nine times. The dough will be very soft and supple, like a cookie dough. Turn the pastry into a 10 1/2-inch tart pan with a removable bottom. Using a spatula, and working quickly, evenly distribute the dough in the pan. To avoid problems with shrinkage as the pastry bakes, build the dough a bit higher than the height of the pan. Prick the bottom of the shell with the tines of a fork. Chill, uncovered, for one hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line the shell loosely with aluminum foil, pressing well into the edges. Fill with weights of rice or beans -making sure you get all the way into the edges - to prevent shrinkage. Bake just until the pastry begins to brown around the edges and seems firm enough to stand up by itself, about 20 minutes. Remove the foil and weights and continue baking until the pastry is lightly and evenly browned, about 10 more minutes. Watch the pastry carefully, for ovens vary tremendously and pastry can brown very quickly. Cool for at least 10 minutes before filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chocolate in the top of a double boiler. Stir and melt over medium heat. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine the egg, egg yolks and granulated sugar and beat until thick and lemon-colored. Add the chocolate and whisk until thoroughly combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the chocolate mixture into the prebaked, cooled tart shell, spreading it evenly, and bake just until the filling is set, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the tart has cooled, sprinkle with confectioners' sugar, and serve."}]}