{"@context": "http://schema.org", "@type": "Recipe", "name": "Penne Al Ortolano (Penne With Garden Vegetables)", "description": "Seasonal vegetables can be substituted for the ones in this recipe. Lightly steamed green beans, broccoli or cauliflower broken into small pieces work well in place of the zucchini; shredded spinach or other greens can take the place of the eggplant.", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT30M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, quick, pastas", "keywords": "main course, mixed vegetables, penne, tomato sauce, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 484, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "6 grams", "proteinContent": "12 grams", "saturatedFatContent": "3 grams", "sodiumContent": "663 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 medium sweet pepper, red or yellow", "1 small eggplant", "1 clove garlic, coarsely chopped", "1/2 cup extra-virgin olive oil", "2 small or 1 medium zucchini", "3 tablespoons minced fresh green herbs, like flat-leaf parsley, basil, chives or a combination", "Sea salt to taste", "1 pound penne, or other short, stubby pasta", "3/4 to 1 cup tomato sauce (like the recipe above, without the added basil, or a good-quality canned tomato sauce)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Core and seed peppers and cut them into 1/4-inch strips. Cut eggplant into cubes 1/2-inch or smaller."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large frying pan, saute garlic and peppers in 2 tablespoons olive oil over medium-low heat until they are very soft. Remove and set aside in medium bowl. Add remaining oil to pan, and raise heat to medium-high. Add eggplant, and brown quickly, removing cubes as they brown and adding them to peppers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While vegetables cook, cut zucchini in half lengthwise, and then slice about 1/2-inch thick. Add zucchini pieces to pan, brown quickly on both sides, and add them to eggplant and peppers."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from heat, and immediately stir minced herbs into hot oil. Pour over vegetables and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 5 to 6 quarts water to rolling boil. Add at least 2 tablespoons salt and then the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While pasta is cooking, warm the tomato sauce in separate pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Start testing pasta at 6 minutes. When pasta is done, drain it and turn it immediately into preheated bowl. Mix rapidly with hot tomato sauce. (Or drain pasta when it is not quite done, and finish cooking in sauce.) When sauce is thoroughly mixed in, add sauteed vegetables, and mix lightly. Serve immediately."}]}