{"@context": "http://schema.org", "@type": "Recipe", "name": "Gregory Cox's Warm Chicken And Vegetable Salad", "description": "", "author": {"@type": "Person", "name": "Andrew Arons"}, "image": null, "totalTime": "PT40M", "recipeYield": "One dinner-sized salad", "recipeCuisine": "", "recipeCategory": "dinner, for one", "keywords": "chicken breast, mixed greens, vegetables, main course", "aggregateRating": null, "recipeIngredient": ["1 teaspoon butter or oil, for sauteing", "2 shallots, sliced very thin", "1/4 cup walnut or grapeseed oil", "2 tablespoons Sherry vinegar", "1 teaspoon fresh chives, marjoram or sage, minced", "3 to 4 ounces boneless, skinless chicken breast", "2 small new potatoes, cut into 1/2-inch dice", "1/2 small head (three inches) fresh fennel, bulb only, cut into 1/2-inch dice", "1/4 cup haricot verts or American green beans", "Salt and freshly ground pepper to taste", "2 tablespoons olive oil", "4 small shiitake mushrooms, caps only, sliced", "2 cups mixed greens (such as arugula, red oak, frisee, Boston or bibb lettuce)", "1/4 cup lentils, cooked according to package directions"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 325 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salad dressing, heat the butter in a small saute pan until the foam subsides. Add the shallots and saute over a medium flame until they are golden brown. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together the walnut oil, vinegar, the chives, marjoram or sage and the shallots. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub the chicken breast with about 1 teaspoon of the salad dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the diced potatoes and fennel with 1 tablespoon of the olive oil. Season with salt and pepper to taste. Place them with the chicken on a sheet pan. Bake in the preheated oven for about 10 to 15 minutes, or until the chicken is cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring a small pot of salted water to the boil. Add the beans to the water and, after it begins to boil again, drain and submerge in cold water. Drain and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saute pan, heat 1 tablespoon of olive oil. When the oil is hot, add the shiitakes and saute until golden brown and crunchy. Season with salt and pepper to taste, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the chicken into thin strips when it is cool enough to handle. Toss the chicken, mushrooms, lentils, vegetables and greens with the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve as a meal with crusty whole-grain bread."}]}