{"@context": "http://schema.org", "@type": "Recipe", "name": "Henry Meer's Curried Salmon With Lemon Grass En Papillote", "description": "", "author": {"@type": "Person", "name": "Andrew Arons"}, "image": null, "totalTime": "PT40M", "recipeYield": "One serving", "recipeCuisine": "", "recipeCategory": "", "keywords": "", "aggregateRating": null, "recipeIngredient": ["16-ounce filet of fresh salmon, skinned", "1 1/4 cups white wine", "1 tablespoon curry powder", "1 stalk lemon grass, washed and sliced in half", "4 tablespoons butter", "3 tablespoons fresh peas", "2 plum tomatoes, peeled and seeded", "1 small zucchini", "1 medium-sized carrot", "2 small white onions, thinly sliced", "3 sprigs Italian parsley", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tomatoes, zucchini and carrot into 1-inch matchstick julienne strips. Bring a medium-sized pot of lightly salted water to the boil. Add the zucchini to the water and when it returns to the boil, cook for about 1 minute, until it is al dente. Remove with a slotted spoon and refresh by submerging in cold water. Drain and set aside. Add the carrot to the boiling water, and when it returns to the boil, cook for 2 minutes, or until al dente. Drain and refresh in cold water. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saute pan, place 2 tablespoons of the butter and heat over a medium flame until foamy. Add the onion slices, curry and lemon grass and saute until the onions are translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the white wine. Raise the heat to high and reduce until there is about a half cup left. Add the remaining 2 tablespoons of butter, bit by bit, whisking with each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Thoroughly butter a 24-inch piece of parchment paper or aluminum foil, then fold it in half. Make a pocket by closing 3 sides with small folds, like an envelope. Place on a jellyroll pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the salmon with salt and pepper and slip it in the envelope, adding the vegetables and parsley. Add the curry mixture and seal the parchment tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pocket in the preheated oven. Bake about 10 minutes, or until the papillote inflates. Remove and serve with basmati rice."}]}