{"@context": "http://schema.org", "@type": "Recipe", "name": "Individual Chocolate Tarts", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H35M", "recipeYield": "8 individual tarts", "recipeCuisine": "", "recipeCategory": "", "keywords": "almond flour, bittersweet chocolate, pastry dough, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 449, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "14 grams", "sodiumContent": "194 milligrams", "sugarContent": "30 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 chocolate pastry dough (<a href=\"https://cooking.nytimes.com/recipes/6215-chocolate-pastry-dough\">see recipe</a>)", "Butter for greasing the tart pans", "5 tablespoons unsalted butter", "6 tablespoons sugar", "3/4 cup almond flour (see note)", "1 tablespoon dark rum", "1 large egg", "7 ounces bittersweet chocolate, preferably Valrhona, very finely chopped", "2 teaspoons strong brewed espresso", "3 tablespoons light corn syrup", "1 cup minus 2 tablespoons heavy cream", "3 tablespoons unsalted butter, at room temperature", "Small pieces of gold leaf (see note)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On a floured surface, roll out the dough to a e-inch thickness and cut out 8 5-inch circles of the dough. Transfer circles to a large parchment-lined cookie sheet and refrigerate until chilled. Ease the chilled circles into 8 individual 4-inch-wide buttered tart pans; trim the edges with a paring knife. Chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the almond cream, cream the butter in the bowl of an electric mixer. Beat in the sugar until smooth. Add the almond flour, rum and egg, beating well after each addition. Spoon a thin layer of the almond cream in the bottom of each chilled tart. Heat the oven to 375 degrees. Bake the tarts until the almond cream is lightly browned and the pastry is crisp, about 10 minutes. Remove the pans' outer rings and cool the tart shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the chocolate filling, combine the chocolate, espresso and corn syrup in a medium bowl. Place the heavy cream in a small saucepan and bring just to a boil. Pour the cream over the chocolate mixture and stir gently in the same direction (do not beat), until the chocolate is melted and the mixture is smooth. Stir in the butter until it is melted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into a cup with a spout and fill the tarts to the rims. Use a knife tip to pop surface bubbles. Clean the knife and use it to cut out and lift fragments of gold leaf, and place one in the center of each tart. Let the tarts set, about 1 hour. Serve or store in an airtight tin up to 2 days."}]}