{"@context": "http://schema.org", "@type": "Recipe", "name": "Trumps Tuna Pastrami", "description": "", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT21M", "recipeYield": "6 to 8 servings as first course", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, coriander seeds, fish, grainy mustard, mayonnaise, mesquite chips, tuna fillet", "aggregateRating": null, "recipeIngredient": ["1 pound piece of tuna, trimmed to 2 inches in diameter (ahi tuna if possible)", "3 to 4 cups water", "3 tablespoons chopped garlic", "2 teaspoons salt", "5 tablespoons cracked coriander seed", "4 tablespoons cracked black peppercorns", "Charcoal briquettes", "8 to 10 mesquite chips"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the tuna in a brine made of the water, garlic and salt for 4 to 5 hours in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the refrigerator half an hour before cooking. Drain the brine and coat the outside of the tuna with a mixture of the coriander and peppercorns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the mesquite chips according to manufacturer's instuctions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a smoker, follow directions. If using a covered grill, open all the vents. Cover the bottom with charcoal and allow it to burn to a white ash, about 30 minutes. When the temperature reaches 175 to 200 degrees at the grill level, add the wet mesquite directly to the charcoal; it should be very smoky. Grease the grill, place the tuna on it and close the cover immediately. After three minutes turn the tuna and cook 3 minutes longer. The outside should be grayish white and the inside rare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Refrigerate for several hours. To serve, slice very thin and accompany with mustard sauce."}]}