{"@context": "http://schema.org", "@type": "Recipe", "name": "Broccoli-Rabe-and- Pine-Nut Tart", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "appetizer, main course, broccoli rabe, extra virgin olive oil, pine nuts, puff pastry", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 373, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "6 grams", "proteinContent": "12 grams", "saturatedFatContent": "3 grams", "sodiumContent": "541 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons plus 2 teaspoons extra-virgin olive oil", "1 1/2 cloves garlic, minced", "1 bunch broccoli rabe, well rinsed, tough stems removed", "3/4 teaspoon lemon juice", "Kosher salt and freshly ground black pepper to taste", "1 medium yellow onion, thinly sliced", "6 tablespoons toasted pine nuts", "1/2 pound frozen puff-pastry dough, thawed", "1 egg, lightly beaten with 1 teaspoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large kettle set over medium-high heat, heat 1 tablespoon of the oil and add the garlic. Cook, stirring, until the garlic just begins to brown. Immediately add the broccoli rabe, reduce the heat to medium and cook, stirring occasionally, until the rabe is tender and most of the liquid has evaporated, about 10 minutes. Add the lemon juice, season with salt and pepper and cook for 2 minutes more. Remove from the heat, cool and coarsely chop. (You should have about 1 1/4 cups.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat another tablespoon of oil in a small saucepan, set over medium heat and add the onion. Cook, stirring occasionally, until the onion is lightly browned, about 10 minutes. Transfer the onion to a food processor, add 4 tablespoons of the pine nuts and 1/2 teaspoon kosher salt and process until smooth. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. On a lightly floured surface, roll the puff-pastry dough out to a thickness of 1/8 inch. Using a ruler as your guide, cut a 12-inch-by-6-inch rectangle from the dough (this will form the base of the tart) and carefully transfer it to a parchment-lined baking sheet. From the remaining dough, cut two strips, each measuring 3/4 inch by 12 inches. (These will form the edges of the tart.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a pastry brush to wet the sides of the base with water and carefully attach edge strips, pressing with your fingertips to firmly adhere the pastry. Use the tines of a fork to prick the pastry all over, including the edges. Refrigerate for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the attached edges with beaten egg and spread the onion and pine-nut mixture over the base of the tart. (Do not cover the edges.) Top the tart with the rabe and sprinkle with the remaining 2 tablespoons of pine nuts. Bake until the pastry is lightly browned, about 15 minutes. Drizzle the top with the remaining 2 teaspoons of olive oil, cut into 4 portions and serve immediately."}]}