{"@context": "http://schema.org", "@type": "Recipe", "name": "Tony Garnier’s Gumbo", "description": "Here is a remarkable gumbo recipe that Eric Asimov scored off Tony Garnier, the bassist who plays behind Bob Dylan and is sometimes called his musical director, in 1998. It calls for all kinds of interesting meats, most of which can be substituted if you can't find them at the store, though the duck is tough to live without. Mr. Garnier picked up the recipe in the 1970s at Jay's Lounge and Cockpit in Cankton, Louisiana, a dive deep in Cajun country where the proprietor would keep a pot of gumbo simmering for when the music and the cockfighting were done for the night. ''I became interested in how to cook it, so I'd sneak back to the kitchen and ask questions,'' Mr. Garnier said. He refined the recipe for years. It is now at its apex.", "author": {"@type": "Person", "name": "Eric Asimov"}, "image": null, "totalTime": "PT7H30M", "recipeYield": "12 servings", "recipeCuisine": "cajun, creole, southern", "recipeCategory": "dinner, project", "keywords": "celery, chicken, chicken stock, cooked rice, duck, flour, green pepper, okra, onion, parsley, pheasant sausage, poultry, shrimp, spices, vegetable oil, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 17}, "recipeIngredient": ["1 medium free-range duck, cut into 8 to 10 pieces", "Salt and freshly ground black pepper to taste", "Cayenne pepper to taste", "1 1/2 cups all-purpose flour", "Vegetable oil", "1 1/2 large yellow onions, chopped", "2 stalks celery, chopped", "1 1/2 tablespoons chopped garlic", "1 green bell pepper, chopped", "1 pound okra, stemmed and thinly sliced", "6 quarts unsalted chicken or vegetable stock, or unsalted canned broth", "1 tablespoon celery salt", "1/8 teaspoon ground cloves", "1/4 teaspoon ground allspice", "6 bay leaves", "1 tablespoon Worcestershire sauce", "1 pound pheasant sausage, hot or mild (see note)", "1 free-range chicken, cut into 8 pieces", "2 tablespoons olive oil", "1 1/2 pounds medium shrimp, peeled", "4 scallions, including tops, chopped", "1/2 cup chopped fresh parsley", "4 cups cooked rice", "File powder"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Season duck with salt, black pepper and cayenne to taste. Place in a deep roasting pan, and roast until the meat releases most of the fat, about an hour. Reserve the duck meat (cool, cover, and refrigerate) and allow the pan juices to settle. Carefully pour 1 1/2 cups clear duck fat from the pan into a large measuring cup. If there is less than a cup of duck fat, add enough vegetable oil to make 1 cup. Discard fat and juices remaining in pan. Duck meat and fat may be prepared a day ahead, and stored, covered, in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a roux: In a heavy 4-quart saucepan over medium-low heat, warm the duck fat. Slowly add flour, stirring constantly. After about 10 minutes, mixture will have the consistency of thick gravy. If it is too thick, add a small amount of vegetable oil. Continue to stir, adjusting heat (or removing pan from stove, if necessary) to prevent flour from burning. Continue to stir constantly as the mixture gradually darkens to the color of milk chocolate, about 30 minutes. Remove from flame, and let mixture settle for about 10 minutes. Pour off and discard oil that has separated from roux. Roux may be prepared a day ahead, and stored, covered, in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place pan with roux over medium heat. Add onions, celery, 1 tablespoon garlic, and half the bell pepper. Cook about 15 minutes, stirring occasionally. Add okra. Cook, stirring, an additional 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large stockpot, bring chicken or vegetable stock to a full boil. Pour about 4 cups of stock into roux mixture, and stir well. Pour all of roux mixture into stockpot. Bring to a boil, and add celery salt, cloves, allspice, bay leaves and Worcestershire. Boil uncovered for 15 minutes. Reduce heat to low, cover and simmer for 1 1/2 hours. Add duck to stockpot, and return to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice sausage into rounds. In a small skillet over medium heat, brown sausage until the fat is cooked out. Remove sausage from fat, and add to stockpot. Continue simmering for an additional 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Season chicken with salt, black pepper and cayenne. Place in a roasting pan, and bake until juices run clear when meat is pierced, about 40 minutes. Add chicken to stockpot. Simmer an additional 45 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 15 minutes before serving time, place a large skillet over medium heat. Add the olive oil, remaining garlic, remaining bell peppers and shrimp. Saute briefly, about 2 minutes. Add to stockpot. Add scallions and parsley, and adjust seasonings if necessary. To serve, ladle over bowls of rice. Sprinkle about 1/4 teaspoon file powder in each bowl, and stir. Serve immediately."}]}