{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Meatballs", "description": "Carbohydrate avoidance be damned: pasta with meatballs is the perfect culinary counter to the cruel world. Just looking at a slippery, tomato-sauced tangle of spaghetti topped with juicy toothsome meatballs makes you feel better; eating it is the instant antidote to whatever ails you. The recipe here makes more sauce, perhaps, than you'd normally want to use to dress a pound of pasta, but when I sit down to eat with the children I want to make sure I'm not going to have to get up and make them anything else to eat before they go to bed. (Of course you can freeze a portion of little meatballs in sauce for easy access in meals ahead. They need not accompany a bowl of pasta. My children like them just as much with a mound of plain white rice. Who wouldn't?)", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2017/04/05/dining/05COOKING-NIGMEATBALLS2/05COOKING-NIGMEATBALLS2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pastas", "keywords": "bread crumbs, egg, ground beef, ground pork, pasta, spaghetti, tomato passata, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 322}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 897, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "100 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "8 grams", "proteinContent": "42 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1036 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["8 ounces ground pork", "8 ounces ground beef", "1 large egg, lightly beaten", "2 tablespoons freshly grated Parmesan cheese", "1 garlic clove, peeled and minced", "1 teaspoon dried oregano", "3 tablespoons bread crumbs or semolina", "1 teaspoon salt", "Freshly ground black pepper", "1 onion, peeled and halved", "2 garlic cloves, peeled", "1 teaspoon dried oregano", "1 tablespoon unsalted butter", "1 tablespoon olive oil", "2 cups tomato passata (available at specialty food stores) or pureed canned tomatoes (not canned tomato puree, which is thicker)", "Pinch of sugar", "Salt and freshly ground black pepper", "1/2 cup whole milk", "1 pound spaghetti, tagliatelle or linguine, cooked to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare meatballs: In a large bowl, combine pork, beef, egg, Parmesan, garlic, oregano, bread crumbs, salt and pepper to taste. Mix thoroughly but lightly, handling mixture as little as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a baking sheet with plastic wrap. Shape rounded teaspoonfuls of meat mixture into balls 1 inch in diameter, and place on plastic. Refrigerate while making sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare sauce: Combine onion, garlic and oregano in a food processor, and puree until smooth. Combine butter and oil in a wide, deep pan, and place over low heat until butter melts. Add onion-garlic mixture. Simmer, stirring occasionally, about 10 minutes; do not brown. Add passata and 2 cups water to pan. Season with sugar, and salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Simmer for 10 minutes, then add milk and bring sauce back to a simmer. Gently drop in meatballs one by one so that they do not break (make sure the meatballs are submerged); do not stir pan. Cover pan partially with a lid, and simmer for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Adjust seasonings to taste. Place hot pasta in a large serving bowl. Pour most of sauce (reserving meatballs) on pasta, and toss to combine. Top pasta with meatballs, and serve."}]}