{"@context": "http://schema.org", "@type": "Recipe", "name": "Liz Schillinger's Shenandoah Berry Pie", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT5H30M", "recipeYield": "Serves 8", "recipeCuisine": "", "recipeCategory": "", "keywords": "blueberries, butter, flour, lard, lemon, strawberries, sugar, dessert, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 579, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "73 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "12 grams", "sodiumContent": "366 milligrams", "sugarContent": "39 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups unbleached all-purpose flour, plus more for rolling out the dough", "1 teaspoon salt", "1/2 pound (1 cup) lard", "1 cup sugar", "1/4 cup unbleached all-purpose flour", "1/2 teaspoon freshly grated lemon zest", "1/4 teaspoon salt", "5 cups blueberries and sliced strawberries (any mixture you like)", "2 teaspoons fresh lemon juice", "1 tablespoon melted unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a marble pastry slab and marble rolling pin in the freezer until very cold, at least 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pie dough, in a medium bowl, whisk the flour and salt together. Place the lard in a glass measuring cup and microwave on high until almost but not completely melted, about 1 minute. Remove from microwave and stir until completely melted. Pour into 1-cup measuring cup and then remove 2 tablespoons of the lard. Add 2 tablespoons of water and mix; you should have exactly 1 cup liquid. Stir liquid into flour with a wooden spoon for a few seconds until the dough holds together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the slab and pin from freezer. Flour the slab lightly. Place a cloth cover on the marble rolling pin and flour lightly. Working quickly, roll the dough out to a thickness of between 1/8 and 1 1/816 inch. If the dough is sticky and doesn't roll smoothly, it may be too warm; pop the whole thing (slab and dough) back in the freezer for a few minutes to chill it before working it again. If the dough is too stiff and begins to crack and shatter, it is too cold; walk away for a few minutes and then try working it again. Use your fingers to press together any cracks or fix any holes in the dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Invert a 9-inch pie plate onto one side of the dough. Using a paring knife, cut a circle around it, making the circle 1/2 inch larger in diameter than the plate. Using 2 spatulas, loosen the dough from the slab; it should be very stiff and come up easily in one piece. (If it sags or sticks, pop the whole thing back in the freezer for a few minutes.) Lift the dough with the spatulas and center it over the pie plate. Let it sit on the plate until it warms up and sags into the plate. (Don't worry if it has some cracks.) Press the edges in gently with your fingers and fix any tears by pressing the dough together. Crimp the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut small basset-hound shapes, or any decorations you like, from the remaining dough. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. To make the filling, in a large bowl whisk together the sugar, flour, zest and salt. Add the fruit and toss to combine. Add the lemon juice and butter and toss again. Scrape into the prepared crust and lay your decorations over the top. Bake until the crust is browned and the fruit is bubbling, about 1 hour. Remove from oven and let cool."}]}