{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Lobster Sauce", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT45M", "recipeYield": "3 cups", "recipeCuisine": "", "recipeCategory": "condiments, sauces and gravies", "keywords": "butter, chicken broth, dijon mustard, heavy cream, lemon juice, lobster, onion, tarragon, worcestershire sauce", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 356, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "33 grams", "saturatedFatContent": "13 grams", "sodiumContent": "885 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1 1/4-pound live lobsters, rinsed in cold water", "3 tablespoons unsalted butter", "1/4 pound onion, peeled and minced", "1 tablespoon Worcestershire sauce", "1 teaspoon Dijon-style mustard", "1/2 teaspoon hot red pepper sauce, like Tabasco", "1 cup heavy cream", "1/2 cup chicken broth", "2 tablespoons chopped fresh tarragon leaves", "2 tablespoons freshly squeezed lemon juice, or to taste", "Coarse kosher salt to taste", "Freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, microwave-safe plastic bag, arrange lobsters head to tail. Twist the top of the bag shut. Cook in a 650- to 700-watt oven at 100 percent power for 8 minutes. Carefully remove from oven. Drain any liquid that has collected in the bag into a bowl. Remove lobsters from bag and allow to cool while proceeding with the recipe."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 2-quart souffle dish, melt butter, uncovered, at 100 percent power for 2 minutes. Stir in onion and cook, uncovered, at 100 percent power for 3 minutes. Remove from oven. Whisk in Worcestershire, mustard and Tabasco. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Holding the lobster over the bowl, separate the head from the body. Using a spoon, scrape out tomalley and roe into the bowl, being careful to avoid the brain sac. Holding the feelers, squeeze the head to extract juices. Remove meat from tail and claws. Dice the tails. Reserve claws whole for garnishing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cream and chicken broth to onion/butter mixture. Heat, uncovered, at 100 percent power for 4 minutes. Whisk tomalley, roe and reserved juices into cream mixture. Cook, uncovered, at 100 percent power for 4 minutes. Add tarragon and reserved lobster tail meat and cook 2 minutes longer. Remove from oven. Season to taste with lemon juice, salt and pepper. Toss with hot fettucine. Garnish with reserved claws. Serve immediately."}]}