{"@context": "http://schema.org", "@type": "Recipe", "name": "Manhattan Clam Chowder with Hake and Chorizo", "description": "This recipe dresses up the chowder with chorizo and pan-fried hake, an inexpensive cousin to cod.", "author": {"@type": "Person", "name": "Dana Bowen"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/manhattanclamchowder/manhattanclamchowder-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 main-course servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bay scallops, chorizo, clam juice, dry white wine, fennel, green pepper, hake fillet, quahogs, red chili, slab bacon, tomato, yukon gold potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 25}, "recipeIngredient": ["1/2 cup dry white wine", "10 pounds quahogs or other large clams, scrubbed", "5 tablespoons olive oil", "5 ounces (about 1 cup) diced slab bacon", "3 cloves garlic, chopped", "1 large onion, diced", "1/4 bulb fennel, diced", "1 stalk celery, diced", "1 green bell pepper, diced", "1 medium carrot, diced", "2 bay leaves", "1 1/2 teaspoon dried oregano", "2 small dried red chili peppers, crushed, or 1/2 teaspoon hot red pepper flakes", "1 tablespoon tomato paste", "3/4 pound (1 large) Yukon Gold potato, peeled and cut into 1/2-inch dice", "1 cup bottled clam juice", "6 vine-ripe tomatoes, cored and diced", "4 to six 6-ounce hake fillets", "Sea salt and freshly ground black pepper", "1/4 pound dried chorizo, sliced into thin rounds", "1 pound bay scallops, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large heavy-bottomed pot, combine wine with 1 1/2 cups water. Place over high heat, and bring to a boil. Add clams, cover, and cook until they open, about 5 minutes. Discard unopened or cracked clams, and transfer others to a bowl. Strain liquid through a fine-mesh strainer into a bowl; set aside. When clams are cool enough to handle, remove from shells and chop into 1/4-inch pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large soup pot, heat 3 tablespoons olive oil over medium heat. Add bacon and sauté until golden brown, about 2 minutes. Add garlic, onion, fennel, celery, bell pepper, carrot, bay leaves, oregano and chili peppers. Sauté until softened, about 10 minutes. Add tomato paste and sauté for 2 minutes. Add potato, reserved clam broth and bottled clam juice. Bring to a boil, lower heat and simmer until potatoes are tender, 8 to 10 minutes. Add tomatoes, cook for 2 minutes, and shut off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large nonstick skillet over medium heat, and add 2 remaining tablespoons olive oil. Season hake on both sides with salt and pepper to taste. When oil is hot, sear skin-side down for 2 minutes, then flip and cook until opaque in center, 3 to 4 minutes. Transfer to a plate. Add chorizo to pan, and sauté until lightly browned, about 1 minute. Transfer to a plate. If using scallops, add to pan and sauté just until opaque, about 1 minute. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add clams to pot of chowder. Reheat if necessary, and adjust salt and pepper to taste. To serve, ladle chowder into bowls and top with hake, chorizo and scallops. Serve immediately."}]}