{"@context": "http://schema.org", "@type": "Recipe", "name": "Broth for Mongolian Hot Pot", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "4 quarts of broth", "recipeCuisine": "", "recipeCategory": "", "keywords": "chicken wings, ginger, pork, virginia ham, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 91, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "0 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "135 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/2 pounds chicken wings", "2 1/2 pounds lean pork", "1 pound Virginia ham", "1 thin slice of fresh ginger"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large stock pot, combine all the ingredients with five quarts of water. Bring to a boil and simmer for four hours, skimming off the foam occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the broth into a large heat-proof bowl, reserving 1/2 cup of the ham for garnish. Skim fat from the surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "A number of ingredients can be cooked in the broth, either on top of the stove or at the table. If cooking on the stove, bring the broth to a boil, add the ingredients and let them simmer for about five minutes. If cooking at the table, pour the broth into two casseroles and place on hot plates. The ingredients can be added one at a time or all together. Possibilities include cellophane noodles, which should be pre-soaked in warm water for 20 minutes; Chinese black mushrooms, pre-soaked in warm water for 30 minutes, then stems removed; soft bean curd sliced into one-inch cubes; Chinese cabbage sliced into two-inch lengths and Chinese chard or bok choy. Also typical are spinach, watercress, bean sprouts, water chestnuts, cleaned and deveined shrimp, shellfish, meat and won tons. Serve immediately, adding sate sauce if desired."}]}