{"@context": "http://schema.org", "@type": "Recipe", "name": "Rhineland Sauerbraten", "description": "“Braising is a cooking method that is little understood and much neglected,” Mimi Sheraton wrote in The Times in 1983. “The long, slow, moist process fills the house with warm scents of simmering meats, vegetables and herbs and yields in robust main courses that include rich sauces and gravies to be aborbed by potatoes, rice or noodles. And because the moisture tenderizes the meat, even the least expensive cuts gradually take on savory overtones.” She accompanied her article with this luscious sauerbraten, which benefits greatly from larding the meat with bacon or salt pork, and is even better the day after it is prepared.", "author": {"@type": "Person", "name": "Mimi Sheraton"}, "image": null, "totalTime": "PT4H45M", "recipeYield": "8 to 10 servings", "recipeCuisine": "german", "recipeCategory": "dinner, project, sauces and gravies, times classics", "keywords": "bacon, beef, beef rump, carrot, onion, pickling spices, raisins, salt pork, wine vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 53}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 609, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "1 gram", "proteinContent": "53 grams", "saturatedFatContent": "14 grams", "sodiumContent": "1096 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["5 pound rump of beef (top or bottom round can be used but they are not quite as good)", "1/2 pound salt pork for larding", "2 teaspoons salt", "3 cups wine vinegar (approximately)", "3 cups water (approximately)", "1 large onion, sliced", "2 bay leaves", "8 cloves", "8 peppercorns", "1 tablespoon pickling spices", "1 large carrot, scraped and sliced", "4 slices bacon", "2 tablespoons butter", "2 large onions, sliced", "1 bay leaf", "6 cloves", "3 tablespoons flour", "2 tablespoons sugar", "lemon juice to taste", "1/2 cup white raisins, soaked in warm water", "Tomato puree or sour cream (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rump or round of beef should be well larded with thin matchstick strips of bacon or salt pork. Tie meat firmly with string in several places so it will be easy to turn without piercing and will hold shape. Rub well with salt on all sides and place in deep, closefitting glass or earthenware bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine vinegar and water and add onion, bay leaves, cloves, peppercorns, pickling spices and carrot. Bring to boil and simmer 5 minutes. Cool marinade thoroughly and pour over beef. Meat should be completely covered by marinade; if it is not, add equal amounts of water and vinegar until it is. Cover and place in refrigerator for 3 to 5 days; the longer it stands the more piquant the roast will be, so adjust time to suit taste. Turn meat in marinade 2 or 3 times a day, using string as handle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat from marinade. Strain marinade and reserve. Dry meat thoroughly with paper towels. Meat will not brown properly if it is wet, so dry as much as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dice bacon and fry slowly in butter in 5-quart Dutch oven or casserole. When fat is hot, add meat and brown slowly. Using string as handle, turn so meat is well seared and golden brown (but not black) on all sides. This should take about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove browned meat and add sliced onions to hot fat. Fry, stirring from time to time, until onions are deep golden brown but not black."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return meat to pot, placing on top of onions. Add marinade until it reaches about halfway up sides of meat. Add fresh bay leaf and cloves (not those used in marinade). Bring marinade to boil, cover pot tightly with heavy, close-fitting lid, reduce heat and simmer very slowly but steadily 3 1/2 to 4 hours, turning meat 2 or 3 times during cooking. Add more marinade to pot if needed. If you cannot lower heat enough to keep sauce at slow simmer, place an asbestos mat or flame trivet under pot. Meat is done when it can be pierced easily with long-pronged fork or skewer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat to heated platter and strain gravy. Skim off excess fat and return gravy to pot. Melt butter in saucepan and when hot, stir in flour and sugar. Cook over very low heat, stirring constantly until sugar mixture turns a deep caramel color. Be very careful doing this, as sugar burns all at once (if it become black, this part of the operation would have to be started again). Add sugar-flour to hot gravy and stir through briskly with wire whisk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season with lemon juice to taste; gravy should have a mild sweet-sour flavor. Add raisins, which have been soaked and drained. Return meat to pot, cover and simmer 10 minutes. If sauce becomes too thick, add a little more marinade. Tablespoonful of tomato puree can be stirred in and heated 4 or 5 minutes before serving time, to enrich the color of the gravy. Check gravy for seasoning. Slice meat and arrange on heated platter and mask with a little gravy, serving rest in heated sauceboat. Serve with dumplings, noodles, boiled potatoes or potato pancakes."}]}