{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken la Tulipe", "description": "Jonathan Reynolds brought this recipe to The Times in 2000, from the New York restaurant La Tulipe. He thought it a perfect dish for a man to cook for a woman. (Whether that is also true for men cooking for men and women cooking for women, he said he didn’t know, so we tested it out: It does.) The morels and Cognac are wildly sophisticated additions to what otherwise might be a plain roasted chicken, making the dish an easy, stylish win for newish cooks interested in making an impression on a sweetheart or someone who might become one. Make the cooking “appear effortless,” Mr. Reynolds wrote. “Pour things from a great height. Think Fred Astaire, not one of those grunting tennis players.” ", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": "https://static01.nyt.com/images/2014/04/11/dining/altulipe/altulipe-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "2 servings", "recipeCuisine": "french", "recipeCategory": "dinner, project, sauces and gravies, times classics", "keywords": "chicken, cognac, dried morels, dry white wine, poultry, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 231}, "recipeIngredient": ["1 1/2 ounces dried morels", "2 tablespoons Cognac", "2 tablespoons butter, divided", "1 1/4 cups light cream or creame frache, divided", "1 3 1/2-pound chicken, rinsed (neck, giblets and liver removed)", "1 teaspoon salt, divided in half", "Pinch of cayenne", "1/4 teaspoon pepper", "1/4 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees and let morels soak in Cognac 15 minutes. Drain, reserving liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Saute morels in 1 tablespoon butter for 5 minutes; then add 1/2 cup light cream and reduce by half. Stir in 1/2 teaspoon salt and the cayenne."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub chicken with remaining butter and sprinkle with remaining salt and the pepper. Spoon morels into the body cavity. Roast chicken on one side for 15 minutes, baste and then roast on the other side 15 minutes and baste again. Finally, roast it breast side up for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken from the oven. Throw away most of the fat from the pan, add the wine and mushroomy Cognac, deglazing, and flambe immediately. Reduce over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shake morels and juices from the chicken into the pot, add 3/4 cup light cream and simmer for 5 minutes, until thickened. Taste for seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the chicken into 8 serving pieces, arrange them on the platter and pour the morel sauce over them."}]}