{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Tamales", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "mexican", "recipeCategory": "dinner, project", "keywords": "amarillo chili, aniseed, black beans, chicken broth, cinnamon, dark brown sugar, dried corn husks, lard, masa harina, mexican oregano, pasilla chilies, pumpkin purée, tomatillo, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["2 1/4 cups masa harina", "1 3/4 to 2 1/2 cups warm chicken broth, homemade or low-sodium canned, plus more as needed", "1/2 pound lard, at room temperature", "1 tablespoon salt", "12 to 14 dried corn husks (or more if small), soaked in boiling water until soft, 30 minutes to 1 hour", "2 cups Oaxacan yellow mole filling (<a href=\"http://cooking.nytimes.com/recipes/6550-oaxacan-yellow-mole-filling\">see recipe</a>)", "2 cups black bean filling (<a href=\"http://cooking.nytimes.com/recipes/6551-pumpkin-tamales-with-black-bean-filling\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the dough, place the masa harina in a large bowl. Use a wooden spoon to beat in just enough chicken broth to make a smooth, soft dough, like a medium-pliable bread dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the lard in the bowl of an electric mixer on medium speed until very fluffy and fully aerated, about 3 minutes. Still mixing on medium speed, begin adding the masa a handful at a time, stopping to scrape down sides of bowl as necessary. If the mixture becomes too stiff, add up to 1 cup of broth a little at a time. When all the masa has been incorporated, the mixture should be very light and delicate, the texture of buttercream frosting. Beat in the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To fill and steam the tamales, drain the corn husks and select as many as you can of the larger pieces, being careful not to open the crinkled leaves of the core that are full of corn silk. If necessary, select some of the better-looking middle-size or narrow pieces and paste them together with a little of the tamale dough. Pat the husks dry. Place a husk on a work surface. Spread 1/4 to 1/3 cup of the dough across the wide end of the husk, covering it from side to side and extending about halfway up toward the narrow tip. Place 1 heaping tablespoon (smaller husks will take less) of filling in the center of the dough. Make a cone shape by folding the 2 long edges over the filling so that they overlap slightly. Fold in half crosswise. Repeat with the remaining husks and filling. As they are finished, place the tamales on a baking sheet (they can be refrigerated, covered with plastic wrap, up to 1 day, or frozen for 1 month)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have a steamer and insert ready, with about 1 inch of boiling water in the bottom of the pot. Place the tamales in the insert, in layers as necessary. Place some of the unused corn husks over the tamales to help absorb the steam. Cover tightly and bring quickly to a full boil over high heat. Reduce the heat to medium-low to maintain a simmer. Cook for 1 hour, adding boiling water as necessary. Remove the steamer basket and let the tamales stand 10 minutes before serving."}]}