{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato-And-Mushroom Strudel", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "baking potatoes, dry white wine, mushroom, shallot, shiitake, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 302, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "1 gram", "sodiumContent": "154 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["7 baking potatoes, peeled", "1/4 cup lowfat milk", "1/4 teaspoon salt, plus more to taste", "1/8 teaspoon freshly ground pepper, plus more to taste", "2 teaspoons olive oil", "2 large shallots, peeled and minced", "3 cups shiitake mushrooms, stemmed and thinly sliced", "3 cups domestic mushrooms, stemmed and thinly sliced", "2 tablespoons dry white wine", "1/2 cup chicken broth, homemade or low-sodium canned", "1/4 cup minced parsley", "Olive oil spray"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 4 of the potatoes into 3/4-inch cubes. Place in a medium saucepan and cover with water. Simmer until tender, about 15 minutes. Drain and pass potatoes through a ricer. Stir in milk, salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Place oil in a large, nonstick skillet. Add shallots and cook over medium heat for 2 minutes. Add mushrooms and cook until softened, about 10 minutes. Turn heat to low. Add wine and broth. Cook for 3 minutes. Stir in 2 tablespoons of the parsley, the salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spray a large baking sheet lightly with olive oil. Heat the baking sheet in the oven for 5 minutes. Meanwhile, slice 3 remaining potatoes lengthwise into very thin slices. Place potatoes on the hot baking sheet. Spray them lightly with olive oil and sprinkle with salt and pepper. Bake until potato slices are browned and crisp, about 20 minutes, turning slices once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower oven to 350 degrees. Spray a medium-size, shallow, rectangular baking dish with olive oil. Line the bottom with a layer of potato slices. Spread the slices with half of the mashed potatoes. Cover the potatoes with half of the mushroom mixture. Repeat layers of mashed potatoes and mushrooms. Cover top with a layer of potato slices. Bake until heated through, about 15 minutes. Cut into squares and garnish with remaining parsley. This dish must be served immediately."}]}