{"@context": "http://schema.org", "@type": "Recipe", "name": "Peach Ice Cream", "description": "This easy ice cream is meant to evoke hazy memories of a summer spent luxuriating on a front porch, cold glass in hand, waiting as your ice cream maker does the churning work for a late-afternoon treat. Use the best peaches you can find — the flavor of this depends directly on the fruit. You can also use mangoes or strawberries, or other stone fruits. Use your imagination, but let the ice cream maker do most of the work.", "author": {"@type": "Person", "name": "Julia Reed"}, "image": "https://static01.nyt.com/images/2014/05/12/dining/Peach-Ice-Cream/Peach-Ice-Cream-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "About 1 1/2 quarts, 6 to 8 servings", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, gluten-free, heavy cream, lemon juice, peach, sugar, vanilla bean, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 252}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 623, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "45 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "27 grams", "sodiumContent": "82 milligrams", "sugarContent": "54 grams", "transFatContent": null}, "recipeIngredient": ["4 pounds ripe peaches", "1 1/4 cups sugar (or more, as needed)", "1/8 teaspoon salt", "2 teaspoons lemon juice", "1 quart (4 cups) heavy cream", "1 2-inch piece of vanilla bean (or 2 teaspoons vanilla extract)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel peaches over a large bowl to catch the juice. Halve and pit them and chop roughly. Place in the bowl and sprinkle with 1/2 cup of sugar, the salt and lemon juice and let them sit for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While peaches macerate, put cream and remaining sugar in saucepan with vanilla bean or vanilla. Heat over medium-low heat, stirring frequently to keep from scorching, until the sugar is dissolved. Remove from heat and cool. Discard vanilla bean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour cream over peaches and mix thoroughly. Taste to see if it needs more sugar. (This will depend on the peaches.) Refrigerate until chilled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the mixture into an ice-cream machine and freeze according to the manufacturer's directions until set but not quite hard. (If serving immediately, freeze harder.) Pack the ice cream into a bowl or mold to completely solidify. When it has hardened, dip mold into hot water or wrap in a hot towel and invert onto a serving platter. Or, simply scoop and serve."}]}