{"@context": "http://schema.org", "@type": "Recipe", "name": "Scallops Of Salmon With Dill Sauce, New Potatoes And Sugar Snap Peas", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT25M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "buttermilk, dill, dry white wine, fish, new potatoes, olive oil, salmon, sugar snap peas, low calorie, low-fat, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 457, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "7 grams", "proteinContent": "30 grams", "saturatedFatContent": "4 grams", "sodiumContent": "981 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["12 very small new potatoes", "3 cups sugar snap peas, stemmed and strung", "1 teaspoon olive oil", "4 4-ounce pieces of salmon fillet", "1/2 cup white wine", "2 tablespoons chopped fresh dill", "2 tablespoons buttermilk", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a medium-size saucepan and cover with cold water. Cook over medium heat until tender, about 12 minutes. Drain and keep warm. Meanwhile, bring a medium-size saucepan of salted water to a boil. Add the sugar snaps and blanch for 3 minutes. Drain. Toss with the potatoes and keep warm while preparing the salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy-bottomed nonstick skillet over medium heat until hot. Add the olive oil. Add the salmon and saute until just cooked through, about 2 1/2 minutes per side. Transfer the salmon to the center of a serving platter and keep warm. Add the wine to the pan and cook, stirring, until reduced to about 2 tablespoons. Stir in the dill. Pour the liquid into a small bowl. Whisk in the buttermilk and season with salt and pepper. Pour the sauce over the salmon. Place the potatoes and sugar snaps in a ring around the salmon and serve immediately."}]}