{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Apricots", "description": "Chicken with dried apricots is hardly a new idea, but I had issues with its most common interpretations. For one thing, they were almost always cloying; the routine addition of cinnamon and cloves does nothing to offset the apricots' sweetness and makes the dish taste more like dessert than dinner. For another, they were usually stewed rather than braised, turning the chicken skin sodden.\n\nI brown the chicken in a nonstick skillet with no fat, and that works well. A tablespoon or two of butter, stirred in at the end, will make the sauce richer. Or you can render some bacon, remove it, and brown the chicken in the bacon fat, then crumble the bacon and stir it in at the end of cooking.\n\nFinally, any dried fruit can be used, or a combination; with the short cooking time, even prunes will remain intact. But be aware that fruit dried with sulfur (the common method) becomes tender much faster than fruit dried organically, which needs a couple of hours of soaking before cooking.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/27/dining/Chicken-With-Apricots/Chicken-With-Apricots-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday", "keywords": "chicken, dried apricots, dry red wine, poultry, red wine vinegar, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 172}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 613, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "3 grams", "proteinContent": "44 grams", "saturatedFatContent": "10 grams", "sodiumContent": "777 milligrams", "sugarContent": "19 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup dried apricots", "1/4 cup red wine vinegar", "1/2 cup red wine", "1 chicken, cut into serving pieces", "1 medium onion, chopped", "Salt and freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine apricots in a bowl with vinegar, wine and 1/4 cup water. Let soak while you brown the chicken."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to medium high under a 12-inch nonstick skillet, and add chicken pieces, skin side down. Cook, rotating but not turning pieces so they brown evenly. When they are nicely browned — take your time — turn them so they are skin side up. Make a little space to add the onion, and cook, stirring the onion occasionally until it has softened a bit, a minute or two."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add apricot mixture and bring to a boil; cook for a minute, then turn heat to low and cover. Cook until chicken is done, 15 to 20 minutes. Uncover, raise heat and season chicken well with salt and pepper. Boil away any excess liquid; sauce should not be too watery. Serve with white rice or any other cooked grain, or bread."}]}