{"@context": "http://schema.org", "@type": "Recipe", "name": "Carrot Loaf", "description": "", "author": {"@type": "Person", "name": "Julia Reed"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "8 servings", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "appetizer, carrot, eggs, gruyère, mushroom, spinach, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 316, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "25 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "15 grams", "sodiumContent": "473 milligrams", "sugarContent": "6 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 ounces unsalted butter", "2 pounds carrots, peeled and cut into 1/4-inch slices", "1/4 pound mushrooms, cut into 1/4-inch slices", "1 pound fresh spinach, rinsed well and dried (if you are not using baby spinach, remove stems)", "6 eggs", "1 cup grated Gruyère or Swiss cheese (4 ounces)", "1 teaspoon salt", "1 teaspoon freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 2 ounces of the butter in a large skillet over medium heat. Add the carrots and sauté slowly until tender, about 25 minutes. Chop coarsely and place in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Increase heat to high and melt 1 ounce of the butter in the same skillet. Add the mushrooms and sauté for 2 minutes. Chop coarsely and add to carrots. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 2 ounces butter over medium-high heat in the same skillet, add the spinach and sauté until wilted, about 2 minutes. Chop coarsely, place in a separate bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 8 1/2-by-4 1/2-by-2 1/2-inch loaf pan with aluminum foil. Butter foil with the remaining butter. Beat together 4 eggs, the cheese, salt and pepper in a medium bowl, add to the carrot mixture and mix well. Add the remaining eggs to the spinach and mix well. Spread half the carrot mixture over the bottom of the pan, cover with the spinach mixture and top with the remaining carrot mixture. Cover with plastic wrap and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Remove the plastic wrap, cover the loaf pan loosely with foil and place in a roasting pan. Add enough boiling water to come halfway up the sides of the loaf pan. Bake 1 hour or until a knife plunged in the center comes out clean. Uncover, invert the loaf onto a serving platter and remove foil. Slice and serve immediately."}]}