{"@context": "http://schema.org", "@type": "Recipe", "name": "Grapefruit-and-Meyer-Lemon Marmalade", "description": "This recipe came to The Times from June Taylor, the impresario of preserving whose jams and jellies, made in her workshop in Berkeley, Calif., are esoteric works of art. For this sweet-tart concoction, you’ll need a jelly bag, used to draw pectin from the fruit, which can be found online or at your local kitchen supply store (you can also make your own out of muslin.) The recipe is for marmalade devotees who want a surprise: you’ll cut the Meyer lemon into chunks, so when you eat the marmalade, you get a burst of lemon, a bit of culinary sunshine.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/22/dining/Marmalade/Marmalade-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Makes 6 8-ounce jars of marmalade", "recipeCuisine": "", "recipeCategory": "condiments, dips and spreads, project", "keywords": "grapefruit, lemon juice, meyer lemon, sugar, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 51}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 871, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "226 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "218 grams", "transFatContent": null}, "recipeIngredient": ["5 pounds grapefruit, rinsed", "5 Meyer lemons or small regular lemons, rinsed", "1/2 cup lemon juice (from 2 to 3 additional lemons)", "2 1/2 pounds sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the grapefruit skin with a vegetable peeler. Cut the peel into 1/8-inch slivers; stop when you have 3/4 cup. Discard the rest. Slice off the ends of the grapefruit and the remaining grapefruit peel and pith. Remove grapefruit segments, reserving membrane. Stop when you have 5 cups of segments."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the ends off the Meyer lemons, deep enough so you can see the flesh. Leaving the peel on, remove the segments of lemon and reserve the membrane. Cut the segments crosswise into 1/4-inch pieces. Put membranes from the grapefruit and Meyer lemons in a jelly bag and tie closed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide and deep pot, combine the grapefruit segments, grapefruit peel, lemon pieces and jelly bag. Add lemon juice and 2 1/2 cups water. Simmer until the grapefruit peel is tender, 25 to 30 minutes. Let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 225 degrees. Working over a bowl in your sink, squeeze the liquid from the jelly bag; keep squeezing and wringing it out until you extract 1/3 to 1/2 cup of pectin. Add pectin and sugar to the pot. Place over high heat and boil, stirring now and then, until marmalade is between 222 and 225 degrees and passes the plate test. (Spoon a little onto a plate and put in the fridge for 3 minutes. If it thickens like jam, it is done.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put 6 sterilized 8-ounce canning jars and lids on a baking sheet and place in the oven. When jam is done, remove jars from the oven. Ladle jam into the jars, filling them as high as possible. Wipe the rims. Fasten the lid tightly. Let cool. If you don't get a vacuum seal, refrigerate the jam."}]}