{"@context": "http://schema.org", "@type": "Recipe", "name": "Georgian Cheese-Filled Flatbread", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 small filled flatbreads", "recipeCuisine": "eastern european", "recipeCategory": "", "keywords": "appetizer, side dish, bread, cheddar, feta, flour, yogurt, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 330, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "1 gram", "proteinContent": "13 grams", "saturatedFatContent": "5 grams", "sodiumContent": "349 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 ounces mild Cheddar or mozzarella cheese, grated and then finely chopped", "2 ounces feta cheese, well crumbled", "2 tablespoons plain yogurt", "1 large egg", "3 to 4 cups unbleached all-purpose flour", "1 1/2 teaspoons baking powder", "1 1/2 teaspoons sea or kosher salt", "2 cups plain yogurt", "Oil for baking sheets"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place an oven rack at the lowest position. Preheat to 450 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cheese filling, blend all the ingredients in a bowl. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix together 1 cup of the flour, the baking powder and salt. Add the yogurt, and stir well. Continue stirring in more flour until the dough has lost its stickiness and can be worked with your hands. Turn out onto a lightly floured surface and knead for 3 to 4 minutes, until soft and slightly elastic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough into 8 equal pieces. (Keep the remaining pieces covered with a cloth while you work with one piece of dough at a time.) Flatten a piece of dough with the lightly floured palm of your hand. Then, either stretching the dough or using a small rolling pin, flatten it out to a round 6 to 8 inches in diameter. Place 1 heaping tablespoon of the cheese filling in the center."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pinch the edges of the dough between your thumb and forefinger. Fold each side in, still leaving the center of the filling uncovered. Then, pinch around the new outer edge of the dough. Stretch the flaps inward so that the filling is covered completely, pleating excess dough as necessary. Pinch the pleats closed, and then, with the lightly floured palm of your hand, gently press down on the top of the mound to flatten it. Turn the bread over, and gently press down again on the bottom. This will push the filling out into the edges of the bread; it should be 1/4 to 1/2-inch thick and 7 to 8 inches in diameter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly oil the baking sheets. Place a filled bread on a prepared sheet, and continue making breads until the first baking sheet is full. Bake the breads for 5 to 6 minutes, then remove from the oven, slide into a basket lined with a cloth, and cover to keep warm. Prepare the remainder of the breads while the first batch bakes, and then bake in the same fashion."}]}