{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Ribs of Beef With Horseradish Dumplings", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "4 servings", "recipeCuisine": "jewish", "recipeCategory": "dinner", "keywords": "beef, beef short ribs, carrot, dark beer, dry red wine, egg, horseradish, matzo meal, turnip, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 19}, "recipeIngredient": ["2 tablespoons canola oil", "6 pounds of short ribs, separated", "Salt and freshly ground pepper", "2 medium carrots, peeled and cut into small cubes", "5 medium white turnips, peeled and cut into small cubes", "1 large Spanish onion, peeled and chopped", "4 shallots, peeled and sliced", "10 ounces dry red wine", "1 12-ounce bottle dark beer", "2 cups chicken stock", "1/3 cup carrots, peeled and cut into one-inch pieces", "1/3 cup parsnips, peeled and cut into one-inch pieces", "1/3 cup turnips, peeled and cut into one-inch pieces", "2 cups kale, escarole, spinach or swiss chard (or a combination) coarsely shredded"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 250 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a 12-inch saucepot over medium-high setting. Season ribs and brown on both sides, about 10 minutes. Remove meat from pan, and set aside. Pour excess fat from pan, and add carrots, turnips, onion and shallots. Cook, stirring occasionally, until vegetables brown, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add red wine; stir and reduce by half, about 15 minutes. Add beer and place ribs back in pan. Cover with chicken stock. Cover, and place in a 250-degree oven for three to four hours, or until meat can be shredded with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While meat is cooking, make dumplings <a href=\"https://cooking.nytimes.com/recipes/7098-horseradish-dumplings\">(see recipe)</a>. Before serving, boil one quart of salted water. Cook carrots, parsnips and turnips about 15 minutes. At the same time, in another deep pan, braise kale (or vegetable of choice) in lightly salted water, about 5 minutes. When the root vegetables are done, add them to pot holding winter greens, and cook another minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When meat is cooked, remove it from the pan, and set aside. Strain the braising broth through a fine sieve, and discard vegetables. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place braised ribs and reserved meat juices in a large saucepan with dumplings. Warm over medium heat. When warm, place on warmed serving plates, and surround with well-drained winter greens and root vegetables."}]}