{"@context": "http://schema.org", "@type": "Recipe", "name": "Shad Fillets Braised With Wild Mushrooms And Tomatoes", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H15M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "dried porcini, dry white wine, fish, lemon, morels, mushroom, plum tomato, shad fillet, shiitake, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["2 shad fillets, about 2 pounds each", "1 cup white wine", "1 cup lemon juice", "1 clove garlic, peeled and minced", "1 small onion, peeled and minced", "1 bay leaf", "3 black peppercorns, cracked", "1/4 pound fresh porcini mushrooms, cleaned and cut into 1/2-inch slices", "1/4 pound fresh shiitake mushrooms, cleaned and cut into 1/2-slices", "1/2 pound fresh morels", "4 plum tomatoes, peeled, seeded, cored and quartered", "2 ounces dried porcini", "5 cups water", "1 teaspoon salt", "Pinch sugar", "1 tablespoon soy sauce", "1 scallion, trimmed and thinly sliced"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the fish, skin side down, in a glass or ceramic baking dish. Cover with the wine, lemon juice, garlic, onion, bay leaf and peppercorns. Marinate for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Transfer the fish to a clean baking dish. Sprinkle 2 tablespoons of the marinade over the fish. Arrange the fresh mushrooms over the top. Add the tomatoes. Cover tightly with foil and bake until the small bones dissolve, about 3 to 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the dried mushrooms and water in a sauce pan and bring to a boil. Reduce the heat and simmer gently for 30 minutes. Stir in the salt, sugar and soy sauce. Add the scallion and simmer until reduced to 1 cup, about 25 minutes. Strain. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fish from the oven. Cut the fillets in half and divide among 4 plates, with the mushrooms over the fish. Spoon the sauce over the shad and serve immediately."}]}