{"@context": "http://schema.org", "@type": "Recipe", "name": "Yearly Surplus", "description": "Gish Jen, the author of “Mona in the Promised Land,” shared this recipe with The Times in the late 1990s. Growing up in Scarsdale, N.Y., she was “suspicious” of her mother’s cooking. “I mean, I never ate the kind of Chinese food they serve in restaurants.” But she came to love her mother’s family-style Shanghai cooking. This dish is an adaptation of a dish served at the traditional Chinese New Year feast (her mother made it with steamed carp), along with Step-by-Step Higher (rice and cabbage), High Achievement (pork and hard-boiled eggs) and Safety in All Seasons (chicken with chestnuts and ginger). To derive the maximum benefit from the feast, the author said, you have to eat absolutely everything — the sweet and the sour.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, project", "keywords": "carp, fish, ginger, hunan chili pepper oil, peanut oil, preserved horse beans, scallion, sherry, main course", "aggregateRating": null, "recipeIngredient": ["1 whole carp or sea bass, weighing about 2 pounds, gutted, head and tail intact", "1 tablespoon white wine", "2 teaspoons white vinegar", "1 teaspoon salt", "1/2 teaspoon white pepper", "6 cups peanut oil", "1 egg, beaten", "3/4 cup cornstarch", "1 small onion, minced", "1 1/2-inch piece of fresh ginger, peeled and minced", "1 clove garlic, minced", "1 tablespoon white vinegar", "1 teaspoon dry sherry", "1 teaspoon sugar", "1/4 teaspoon salt", "1 teaspoon dark soy sauce", "2 teaspoons Hunan or other chili-pepper oil", "3/4 cup chicken broth", "1/2 teaspoon preserved horse beans or lima beans, plus additional for garnish (all optional)", "1 tablespoon cornstarch", "1/2 cup chopped scallions", "Cilantro for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse the fish and pat it dry. Use a sharp knife to make 1-inch diagonal slashes on each side of the fish. Combine all the marinade ingredients. Place the fish in a shallow pan, rub the marinade into it and marinate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wok or skillet large enough to accommodate the fish, heat the peanut oil over medium-high heat. Dip the fish in the beaten egg and then coat with cornstarch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the fish, sliding it gently into the oil to avoid splattering. If the fish is too large, you can dip the head in for 30 seconds, then, holding the head with tongs, dip the tail in for 30 seconds, then slide the entire fish in and use a ladle to pour the hot oil over the fish. A 2-pound fish will require approximately 6 minutes per side. The fish is done when the coating is deep gold in color. Remove immediately and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard all but 1 tablespoon of oil from the wok or skillet. Add the onion, ginger and garlic and cook for about 4 minutes to soften."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the vinegar, sherry, sugar, salt, soy sauce, chili-pepper oil, chicken broth and horse beans. Whisk the cornstarch into this mixture. Add to the wok, along with the chopped scallions. Bring to a boil and then reduce heat to a simmer, stirring constantly until the sauce has the consistency of a thick syrup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently place the fish on a serving platter, cover with sauce, garnish with cilantro and beans and serve."}]}