{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared And Steamed Chicken", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, weekday", "keywords": "black olives, capers, chicken breast, dry white wine, poultry, tomatoes, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 199, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "20 grams", "saturatedFatContent": "2 grams", "sodiumContent": "440 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil or butter, or a combination", "4 plump boneless, skinless chicken breast halves, 1 1/2 to 2 pounds", "Salt and freshly ground black pepper", "1/3 cup dry white wine, chicken stock or water", "1 cup peeled, seeded and diced tomatoes (canned are fine; drain them first)", "2 tablespoons bottled capers", "2 tablespoons chopped pitted black olives, preferably imported", "1/2 cup chopped parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 200 degrees. Place the oil or butter in a 12-inch skillet, and turn the heat to medium-high. After about 2 minutes, when the oil is hot or the foaming from the butter has subsided, season the chicken breasts well with salt and pepper and place them in the skillet, smooth (skin) side down. Turn the heat to high, and cook about a minute, until the chicken begins to brown. Turn the heat to medium, and cover the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, undisturbed, until the chicken is firm and nearly cooked through, 6 to 8 minutes. To minimize the spattering, quickly uncover the skillet, and remove the chicken to a plate. Place the plate in the warm oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Over high heat, add the wine, stock or water to the pan, and stir and scrape to release any bits of chicken that have stuck to the pan. When the liquid has reduced by about half, add the tomatoes, and cook, stirring occasionally, for about a minute. Add the capers, olives and all but 1 tablespoon of the parsley, and cook a minute more, stirring occasionally. Return the chicken to the sauce and turn once or twice. Sprinkle with the remaining parsley, and serve."}]}