{"@context": "http://schema.org", "@type": "Recipe", "name": "Sour Cream Cheesecake With Vanilla Bean", "description": "This elegant cheesecake is based on Amanda Hesser's mother's simple recipe. The crust is made of Nabisco chocolate wafers and butter. The bottom layer is a fluffy pool of cream cheese, eggs and sugar. The top is a thin layer of sour cream and sugar. Her recipe called for vanilla extract, but this one uses the seeds of one whole vanilla bean, which has a way of elevating all the other subtle flavors – cinnamon, chocolate and the tang of the sour cream and cream cheese – in a magical way.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2016/05/27/dining/sour-cream-cheesecake/sour-cream-cheesecake-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "chocolate wafers, cream cheese, egg, sour cream, sugar, vanilla bean, dessert, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 240}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 324, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "0 grams", "proteinContent": "4 grams", "saturatedFatContent": "14 grams", "sodiumContent": "215 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["18 Nabisco chocolate wafers, finely crushed", "1/4 teaspoon cinnamon", "1/4 cup butter, melted", "1 pound cream cheese, room temperature", "2 eggs at room temperature, lightly beaten", "2/3 cup plus 3 tablespoons sugar", "1 vanilla bean, split in half lengthwise and seeds scraped", "1 1/2 cups sour cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl stir together crushed wafers and cinnamon with a fork. Pour in butter, and stir until mixture is moist. Press mixture into a 9-inch springform pan, forming a crust just over 1 inch high around the sides. You might think you need more wafers, but you don't. Press patiently until a tight, thin layer forms. Chill until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees with baking sheet on center rack. In an electric mixer, beat cream cheese until creamy and fluffy. Add eggs, 2/3 cup sugar and seeds from vanilla bean, and beat until very smooth. Scrape bowl with a spatula to break up lumps. Pour into crust, and place on baking sheet. Bake 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, blend sour cream with 3 tablespoons sugar. After 25 minutes, remove cake from oven, and let sit 5 minutes. Increase oven heat to 450 degrees. Gently spoon sour cream mixture on top, and spread evenly. Return cake to oven, and bake 7 minutes. Cool on a wire rack."}]}