{"@context": "http://schema.org", "@type": "Recipe", "name": "Pepper Fried Rice", "description": "I was once amazed to find I could use frozen red and yellow bell pepper strips straight from the package. (I am aware that this is not a revelation to everyone; call me stupid.) The peppers are great in a simple quick dish of fried rice. If frozen vegetables are handled expeditiously, they are often better than buying 'fresh' at the store.\"\n\nIt's true. Freezing, especially after blanching (which is almost always a part of the process), locks in both flavor and nutrients. And the use of I.Q.F. (individually quick frozen) technology has become routine, and the results are profoundly better than freezing vegetables in solid blocks. (These products are almost always sold in plastic bags, not boxes, and as a rule you should buy frozen vegetables in plastic bags.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/28/dining/pepperrice1/pepperrice1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "cooked rice, frozen peppers, sesame oil, soy sauce, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 112}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "681 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons peanut or neutral oil, like grapeseed or corn", "1 pound frozen bell pepper strips, preferably a mixture of red and yellow", "Salt and pepper", "4 cups cooked rice, preferably long grain", "2 tablespoons good soy sauce, or to taste", "1 tablespoon dark sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put peanut oil in a large skillet, preferably nonstick, and turn heat to medium high. A minute later, add peppers and raise heat to high. Sprinkle with salt and pepper, and cook, stirring occasionally, until they begin to brown, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rice, separating it with your hands as you do so. Cook, stirring and breaking up the rice lumps, until it is hot and begins to brown, about 10 minutes. Stir in the soy sauce and sesame oil, taste and adjust seasoning, and serve."}]}