{"@context": "http://schema.org", "@type": "Recipe", "name": "Chickpeas and Handmade Pasta", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H30M", "recipeYield": "Four servings", "recipeCuisine": "italian", "recipeCategory": "dinner, lunch, one pot", "keywords": "appetizer, main course, dried chickpeas, semolina flour, vegan, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 722, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "126 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "16 grams", "proteinContent": "31 grams", "saturatedFatContent": "1 gram", "sodiumContent": "607 milligrams", "sugarContent": "12 grams", "transFatContent": null}, "recipeIngredient": ["2 cups dried chickpeas", "2 cloves garlic, crushed", "1 small yellow onion, cut into quarters", "2 bay leaves", "1 stalk celery, chopped", "1 teaspoon salt", "3/4 cup warm water", "2 cups semolina flour for pasta", "Extra-virgin olive oil for deep frying", "1 small dried hot red chili pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the chickpeas in a bowl, cover with cool water and soak overnight. The next day, drain the water, place the chickpeas in a deep saucepan and cover with 1 inch of fresh water. Add 1 of the garlic cloves, the onion, bay leaves and celery and bring to a boil over medium heat. Cover the pan and simmer for 1 to 2 hours, or until the chickpeas are very tender -- the time depends on the age and size of the peas. Add boiling water from time to time so that an inch of water remains over them as they cook. The liquid will become thicker and soupier."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the pasta, dissolve the teaspoon of salt in about cup of very warm water. Put the semolina in a mixing bowl and add the salted water a little at a time, gradually mixing until most of the water has been incorporated. You may need a little more water, or semolina, depending on humidity."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Knead the pasta in the bowl for a few minutes. As you knead, you will feel the semolina granules begin to soften and relax. Once the dough is well amalgamated, turn it out on a board. If the dough feels stiff, brush a little water on the board with your fingers; if the dough feels loose and wet, scatter a tablespoon more of semolina on the boards and continue kneading until the texture is soft and silky. Then set the dough aside for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using half the pasta at a time, roll it out on a very lightly floured board into the thinest possible sheet. Cut the sheet into long noodles about 1/2-inch wide and drape the noodles over the back of a chair to dry for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a pot about 10 inches in diameter, add the oil to a depth of 1 inch. Add the remaining garlic and the chili pepper, broken in two. Cook at medium heat until the garlic starts to brown. Discard the garlic and add a few pasta strips at a time, about of it, frying until the noodles are crisp and brown. Remove and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the chickpeas are very soft, remove the bay leaf and raise the heat to medium-high, adding more boiling water if necessary to keep them covered to a depth of 1 inch. Gently stir the remaining, un-fried pasta into the chickpeas and let cook for 5 minutes. When the pasta is al dente, garnish 4 bowls with a handful of fried pasta and serve immediately."}]}