{"@context": "http://schema.org", "@type": "Recipe", "name": "Piadina", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "8 appetizers or 4 main courses", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "all-purpose flour, arugula, goat cheese, appetizer, main course, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 321, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "288 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["3 1/2 cups unbleached all-purpose flour", "1 teaspoon salt", "1/2 teaspoon baking powder", "1 cup warm water (105 to 115 degrees)", "1/4 cup olive oil", "1 cup soft fresh goat cheese", "8 handfuls arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor or heavy-duty mixer, combine the flour, salt and baking powder. Add the water and oil. Process or mix until the dough is smooth and elastic, about 1 minute. Remove from the machine, and knead briefly by hand on a lightly floured surface. Shape the dough into a ball. Cover with a bowl, and let rest 20 minutes to 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the dough into 8 pieces. Cover all but 1 piece with a bowl. On a lightly floured surface, shape the piece into a ball. With a rolling pin, roll out the dough to an 8-inch circle. Place a piece of wax paper on a large dinner plate, and put the circle of dough on it. Roll out the remaining dough, stacking the circles on the plate with wax paper in between."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 175 degrees. Heat a nonstick skillet over medium-high heat. Test the temperature by flicking some droplets of water onto the surface; if the water sizzles and evaporates quickly, the griddle is ready. Place a circle of dough in the skillet. Cook 30 seconds, or until the dough begins to stiffen and turns golden brown. Flip the piadina, and brown the other side. Place the piadina on a piece of foil in the oven, and keep warm until serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, on each piadina, spread about 2 tablespoons of cheese over half the circle. Place a handful of arugula on top, and then fold the piadina in half and serve."}]}