{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Sour Cream Streusel Cake", "description": "This strawberry streusel cake is the perfect end to a summer meal. But here's the interesting thing: Eat it slightly warm and it's dessert; let it get cold, and it makes a great coffee cake for breakfast the next day. The cake is slightly tricky to assemble, and at some point it may look like a mess. But everything comes together in the pan as it bakes, resulting in a tender, fragrant cake. This isn’t a recipe to embark on at the end of a long workday. Save it for the weekend.", "author": {"@type": "Person", "name": "Nigella Lawson"}, "image": "https://static01.nyt.com/images/2016/04/18/dining/18COOKING-STREUSELCAKE1/18COOKING-STREUSELCAKE1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "One 9-inch cake", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "all-purpose flour, sour cream, strawberry, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 512}, "recipeIngredient": ["8 ounces strawberries", "3 tablespoons strawberry jam", "2 teaspoons cornstarch", "2 teaspoons vanilla extract", "Vegetable oil, for pan", "3/4 cup sugar", "2 cups plus 2 tablespoons flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "12 tablespoons (1 1/2 sticks) cold butter, cut into 1/2-inch cubes", "1 cup sour cream", "1 large egg", "1 tablespoon vanilla extract", "2 teaspoons Demerara or turbinado sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare strawberry purée: In a blender, combine strawberries and jam. Make a paste of cornstarch and vanilla, and add to blender. Purée until smooth.Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare cake: Heat oven to 375 degrees. Oil a 9-inch springform pan and set aside. In a large bowl, combine sugar, flour, baking powder and baking soda. Sprinkle in butter cubes and rub them in by hand until mixture resembles large coarse crumbs. Remove 1/2 cup and set it aside. To large bowl, add sour cream,egg and vanilla. Mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a little over half the cake batter, drop dollops of batter into pan. Pat batter across bottom of pan and about 1 inch up sides; mixture will be very sticky and somewhat uneven. Add strawberry purée, making an even layer across bottom of pan and leaving a rim of dough above it. Cover with remaining cake mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare crumble topping: In a medium bowl, combine reserved 1/2 cup dough and Demerara sugar. Stir with a fork to mix. Sprinkle evenly over cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake cake until lightly golden, about 45 minutes. Cool completely before serving."}]}