{"@context": "http://schema.org", "@type": "Recipe", "name": "Pompano With Black-Eyed Peas and Citrus Salsa", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "black-eyed peas, pink grapefruit, pompano, main course", "aggregateRating": null, "recipeIngredient": ["1 cup dried black-eyed peas", "4 cups water", "1 medium-sized red onion, peeled and diced", "1 pink grapefruit, peeled and cut into sections between the membranes", "2 oranges, peeled and cut into sections between the membranes", "2 jalapenos, seeded and minced", "4 tablespoons chopped fresh cilantro", "1 tablespoon fresh lime juice", "1 teaspoon olive oil", "2 teaspoons salt", "Freshly ground pepper to taste", "1/2 cup yellow cornmeal", "1/2 teaspoon salt, plus more to taste", "Freshly ground pepper to taste", "4 pompano fillets (if unavailable, red snapper can be substituted)", "Olive oil spray", "1 avocado"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salsa, combine the peas and water in a medium-size saucepan. Bring to a boil over medium-high heat. Reduce the heat and simmer, uncovered, until the peas are tender, adding more water if needed to keep them covered, about 1 hour. Drain and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the peas in a bowl and add the onion, grapefruit, oranges, jalapenos and cilantro and toss lightly. Add the lime juice, olive oil, 2 teaspoons salt and pepper and toss. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the fish, combine the cornmeal, 1/2 teaspoon salt and pepper in a shallow dish. Coat the fillets in the cornmeal. Spray both sides lightly with the olive oil. Heat a large nonstick skillet over medium-high heat until hot. Add the fillets and cook until just cooked through, about 3 minutes per side."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish is cooking, cut the avocado in half lengthwise and remove the pit. Cut the flesh lengthwise into thin slices and carefully scoop them out of the skin. Season the fish with salt and pepper to taste. Place 1 fillet on each of 4 plates. Spoon some of the salsa across each fillet. Fan the avocado slices over the salsa and serve immediately."}]}