{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon Baked in Salt With Spring Vegetables", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "12 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fennel, red beets, salmon, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 595, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "2 grams", "proteinContent": "50 grams", "saturatedFatContent": "8 grams", "sodiumContent": "806 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 whole salmon, about 6 pounds, scaled and cleaned", "1 teaspoon salt", "Branches and leaves from 4 fennel bulbs, chopped and left whole (bulbs reserved for another use)", "4 pounds kosher salt", "8 egg whites", "3/4 cup fresh beets, peeled and diced", "3 medium carrots, peeled and diced", "1 cup sliced scallions, white part only", "3/4 cup fresh shelled peas", "12 handfuls mixed young lettuces", "1/2 cup edible blossoms, for garnish", "1 large shallot, peeled and minced", "3 tablespoons Champagne vinegar or lemon juice", "1/2 cup extra-virgin olive oil", "1 teaspoon salt", "Freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Season the inside cavity of the fish with 1 teaspoon of salt and stuff it with the whole fennel branches and leaves. In a large bowl, mix together the kosher salt, egg whites and chopped fennel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a piece of baking parchment over a sheet pan and with a spatula spread out the salt mixture to make a bed big enough for the fish, about 1/2-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay the fish on the bed of salt. Using your hands, encase the fish in the remaining salt and smooth it to an even thickness with a spatula. Bake the fish for 50 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the vegetables, cover the beets with cold water and cook over high heat, covered, for 10 minutes. Drain immediately and immerse in cold water to stop the cooking process. Prepare the carrots the same way, but cook for 5 minutes. Bring 1 1/2 cups of water to a boil, cook the scallions for 3 minutes, drain and immerse in cold water. Add the peas to 1 cup of boiling water and cook for 2 minutes. Drain and cool under cold water. Set the vegetables aside in separate bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the vinaigrette, combine the shallot, vinegar, olive oil, salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the fish is done, remove from the oven and let cool slightly. Meanwhile, combine the parboiled vegetables in one bowl and the lettuces in another and dress each with some of the vinaigrette."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve the fish, insert a knife along the edge of the salt crust. Carefully lift off the crust and pull the skin away from the fish. Work from the dorsal and ventral sides into the center to cut serving-size fillets. Remove the bones and continue to cut out the bottom pieces, removing skin as necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a fillet alongside a mound of lettuce topped with vegetables on individual plates, garnish with the blossoms and serve."}]}