{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoked Mashed Potatoes", "description": "", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": null, "totalTime": "PT1H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "gold potatoes, heavy cream, russet potatoes, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 6}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 358, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "6 grams", "proteinContent": "7 grams", "saturatedFatContent": "8 grams", "sodiumContent": "768 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon plus 1 teaspoon kosher salt, more to taste", "2 pounds russet potatoes, peeled and quartered", "2 pounds Yukon Gold potatoes, peeled and quartered", "3 tablespoons unsalted butter, cut into pieces", "1/2 cup heavy cream, half-and-half or whole milk", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 1 gallon of water in six-quart stockpot, add 1 tablespoon salt and bring to a boil over high heat. Add potatoes and cook until fork-tender, about 25 minutes. Drain, reserving 1 cup cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Smoke potatoes to taste in a smoker, according to manufacturer's instructions. If you do not have a smoker, set a 13-by-16-inch aluminum roasting pan with a rack on the stove top so that it spans 2 burners. Scatter 2 tablespoons ground hickory, apple or cherry wood chips (designed for stove-top smokers) evenly in pan. Lay a double thickness of aluminum foil over rack, and crimp any overhanging foil around edges. Arrange potatoes in a single layer on foil. Cover pan tightly with 2 sheets of aluminum foil laid side by side, if necessary. Turn both burners to medium-low, and smoke potatoes for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer potatoes to a large bowl, and mash them with a fork or pass them through a ricer or food mill. Add 1 teaspoon salt, butter, cream and 1/2 cup potato cooking water, whip until thoroughly combined. Add more cooking water, 2 tablespoons at a time, until potatoes reach a smooth, fluffy consistency. Season with salt and ground pepper to taste."}]}