{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon on a Bed Of Creamy Cabbage", "description": "", "author": {"@type": "Person", "name": "Moira Hodgson"}, "image": null, "totalTime": "PT45M", "recipeYield": "8 first-course or 4 main-course servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, main course, fish, salmon", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 368, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "3 grams", "proteinContent": "19 grams", "saturatedFatContent": "13 grams", "sodiumContent": "512 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 head green cabbage (about 1 1/2 pounds)", "Sea salt", "8 tablespoons unsalted butter", "Freshly ground white pepper to taste", "6 tablespoons heavy cream", "1 shallot, minced", "1/4 cup dry white wine, like chardonnay", "1/4 cup best quality sherry vinegar", "1 1/2 pounds fresh salmon fillet, skin attached but scaled, cut into 4 or 8 equal portions", "1 tablespoon extra-virgin olive oil", "Fresh chives, snipped with scissors, for garnish", "Handful of whole chervil or flat-leaf parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the cabbage, discarding any tough outer leaves and the inner core. Slice by hand into thin slivers. Bring a large pot of salted water to a boil and blanch the cabbage (cook for one minute). Remove and drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, combine the cabbage with two tablespoons of the butter and cook over low heat for two to three minutes. Season, cover and cook until slightly wilted but still crunchy, about five minutes. Stir in five tablespoons of the cream and continue cooking until warmed through, one to two minutes. Set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the sauce. In a small saucepan combine the shallot with a tablespoon of butter and a pinch of salt. Cook over low heat until soft and translucent, three to four minutes. Add the wine and vinegar and bring to a boil. Cook until reduced by two-thirds, about two to three minutes. Remove from the heat. Gradually whisk in the remaining tablespoon of cream and five tablespoons of butter. Whisk until all the butter is incorporated and the sauce is smooth and creamy. Taste for seasoning. Transfer to the top of a double boiler set over gently simmering water. Cover loosely and keep warm over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the salmon with a sharp knife. Score the salmon in a crisscross pattern, cutting through the skin and just slightly into the flesh. Generously season both sides of the salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick skillet, heat the oil over moderately high heat. When hot, put the salmon fillets skin side down in the skillet. Cook without turning until the skin is very crisp, two to three minutes (cooking time will depend on the thickness of the salmon). With a wide spatula, turn the salmon over and cook it barely 30 seconds. Leave the salmon in the pan and remove it from the heat. The salmon will continue the cooking process as you dress the plates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the cabbage into the center of four to eight warmed dinner plates. Top with a slice of salmon, skin side up, and spoon the warm sauce around the cabbage. Garnish with the herbs and serve immediately."}]}