{"@context": "http://schema.org", "@type": "Recipe", "name": "Cold Cauliflower Soup With Aioli and Clams", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Six servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, main course, side dish, cauliflower, clams", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 580, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "46 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "9 grams", "sodiumContent": "933 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["24 tiny littleneck clams, scrubbed well", "1 cup white wine", "1 clove garlic, peeled and smashed", "4 teaspoons sweet butter", "1 cup coarsely chopped white onions", "1/4 cup uncooked white rice", "3 to 5 cups milk", "1 head cauliflower", "Kosher salt and freshly ground black pepper to taste", "1 tablespoon minced parsley, for garnish", "4 large cloves garlic, peeled", "1 egg yolk", "1/2 teaspoon kosher salt", "1/8 teaspoon white pepper", "1/8 teaspoon fresh lemon juice", "1/2 cup vegetable oil", "1/2 cup extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the soup, place the clams, white wine, garlic and 1 teaspoon of butter in a large pot over high heat. Cover and steam for 5 to 7 minutes, until the clams are open but still very tender. Strain the mixture. Reserve the clam broth, which should equal about 1 1/2 cups. Pick the meat from the clams, set aside and discard the shells and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large pot over medium heat, saute the onions in the remaining butter until soft, about 3 minutes. Add the rice, 2 cups of the milk and the reserved clam broth and simmer for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, using a sharp knife, remove 2 cups of the smallest florets from the cauliflower and set aside. Remove the coarse stems from the cauliflower and discard. Chop the remaining cauliflower and add to the rice mixture, along with another cup of milk, after the rice has cooked for 15 minutes. Cover and cook until the cauliflower is tender, about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the rice and cauliflower mixture in a food processor and return to a saucepan. Add the remaining milk and stir until a velvety, souplike consistency has been achieved. Season to taste with salt and pepper. Add the small cauliflower florets, stir, cover and simmer until soft, about 10 minutes. Stir to avoid sticking and add more milk if necessary to keep the consistency of the soup constant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, to make the aioli sauce, place the garlic cloves, egg yolk, salt, pepper and lemon juice in a blender and pulverize completely. Combine the oils and, while the blender is on, slowly drizzle the oil into the yolk mixture. Blend until the mixture has the texture of mayonnaise. Transfer to a small bowl and season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the soup into 6 bowls. Place a dollop of aioli in the center of each, arrange 6 cooked clams in a circle around the aioli, garnish with parsley and serve immediately."}]}