{"@context": "http://schema.org", "@type": "Recipe", "name": "Pastiera", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT5H", "recipeYield": "Two 9 1/2-inch tarts", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, eggs, lemon, ricotta, spring", "aggregateRating": null, "recipeIngredient": ["1 1/4 cups soft, spring whole-wheat berries (see note)", "1 teaspoon lard", "2 1/2 cups milk", "1 cup granulated sugar", "2 1/2 cups all-purpose flour", "1/2 cup granulated sugar", "1/2 teaspoon salt", "Zest of 1 lemon, grated (optional)", "1/2 cup sweet butter at room temperature", "4 to 5 tablespoons ice water", "12 ounces ricotta", "Zest of 2 lemons, grated or slivered", "1 tablespoon orange-flower water", "1 teaspoon vanilla", "1/3 cup candied orange peel, finely slivered", "5 large egg yolks", "3 large egg whites", "A little butter and flour for the tart pans", "1 additional egg, lightly beaten, for brushing dough", "Granulated sugar for sprinkling on top"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the wheat berries in plenty of cold water for at least 3 days, or until they soft and not rubbery, changing the water daily. Drain well. Put the wheat, lard and milk in the top of a double boiler and cook, covered, over boiling water for about 2 1/2 hours. Be sure to add boiling water to the botton pan every 20 to 30 minutes. (The wheat should be soft and in separate grains, like rice. If the wheat seems dry, add about Y cup more hot milk and stir well. Timing will vary depending on the age of the wheat berries.) Add the sugar and continue cooking another 30 minutes. Set aside to cool. The milk will continue to be absorbed as wheat cools."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pastry dough, combine the flour, sugar, salt and lemon rind in a bowl. Add the butter, cut into little pieces, and mix quickly, using your hands or a pastry blender. Mix in the ice water just until the dough holds together. Knead briefly to combine thoroughly, wrap in plastic wrap or foil and set aside to rest in a cool place for about 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the ricotta with the lemon zest, orange-flower water, vanilla, candied orange peel and egg yolks. Mix well and fold in the wheat. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly butter and flour the bottoms and sides of two 9 1/2-inch tart or quiche pans with removable bottoms. Set aside about a third of the pastry, enough to make lattice tops for the two tarts. Roll out the pastry into thin circles and line the bottoms and sides of the tart pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Beat the egg whites until they are fairly stiff. Stir about a quarter of the egg whites into the ricotta mixture to soften, then fold in the remaining egg whites. Fill the tarts with the mixture. Roll out the reserved dough and cut into lattice strips to fit the tops of the tarts. Paint the tops of the tarts with the beaten egg and sprinkle with granulated sugar. Bake in the oven for 45 minutes, or until the crust is just golden. Cool on a rack and serve at room temperature or just barely warm."}]}