{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin Creme Brulee", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne With Pierre Franey"}, "image": null, "totalTime": "PT1H", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, fall, pumpkin", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 427, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "9 grams", "sodiumContent": "92 milligrams", "sugarContent": "57 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 5-pound pumpkin", "2 1/2 cups milk", "1 cup heavy cream", "1/2 cup dark molasses", "1 teaspoon cinnamon", "6 whole eggs", "9 egg yolks", "3/4 cup granulated white sugar", "1 1/2 cups brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the pumpkin lengthwise into quarters. Scrape out the seeds and membranes from each quarter. Arrange the pumpkin quarters cut-side down on a baking dish. Cover closely with foil. Place in the oven and bake for one hour. Remove the pumpkin pieces and let stand, covered, 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape the flesh of each quartered pumpkin into the sieve of a food mill or ricer. Press to make a fine puree. There should be about five cups. Of this, you will need one cup for this recipe. The remainder may be frozen or refrigerated to be used later in soups, pies and so on."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put one cup of the puree into a saucepan and add the milk, cream, molasses and cinnamon. Stir to blend and bring slowly to the simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Select a mixing bowl, preferably of stainless steel, that will sit neatly and compactly inside a larger basin of simmering water. Into the mixing bowl put the whole eggs, egg yolks and white sugar. Beat until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the hot pumpkin mixture into the egg mixture. Sit the custard mixture inside the kettle over barely simmering water and start stirring immediately and constantly with a wire whisk. At this point, great care and caution must be taken to not overheat the mixture, because excess heat will cause it to curdle. Stir rapidly over and around the curves of the mixing bowl. Cook for about 12 minutes, only until the mixture achieves a fairly thick, custardlike texture, then remove the bowl from the bottom basin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon equal portions (about five ounces) of the custard into 10 individual six-ounce, heatproof, decorative baking dishes or custard cups. Wipe any spillage off the outside of the baking dishes. Cover with clear plastic wrap, and chill thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a small sieve with the brown sugar. Hold the sieve over each of the dishes and sprinkle with brown sugar. Wipe around the rim of each dish to remove excess sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a broiler to high. Arrange the small dishes in a metal pan filled with ice. Place under the broiler until the sugar has formed a nice crust on top. Serve immediately."}]}