{"@context": "http://schema.org", "@type": "Recipe", "name": "Taillevent's Chocolate Cake With Pistachio Sauce", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "P1DT30M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "butter, chocolate, pistachio, dessert, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 740, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "82 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "22 grams", "sodiumContent": "107 milligrams", "sugarContent": "75 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 1/2 ounces best-quality bittersweet chocolate", "1/4 cup, plus 2 tablespoons, confectioners' sugar", "6 tablespoons unsalted butter, at room temperature", "2 eggs, separated", "1/2 cup shelled, roasted pistachios", "1 cup sugar", "1 egg white", "2 cups milk", "4 egg yolks"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the cake, melt the chocolate in a small saucepan over very low heat. Add 1/4 cup of sugar and the butter and stir until melted. Whisk in the egg yolks. Cook, stirring constantly, until mixture reaches 160 degrees on a candy thermometer. Set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, beat the egg whites until stiff. Add the remaining sugar and beat until glossy. Whisk 1/3 of the egg whites into the chocolate mixture. Fold in the remaining whites. Rinse 4 4-ounce heart-shaped molds or ramekins with water; do not dry. Divide the chocolate mixture among the molds. Refrigerate for 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, remove as much skin as possible from the pistachios. Rinse quickly with boiling water, drain and then remove as much of the remaining skin as possible. Place the nuts in a food processor and pulse until ground. Add 1/3 cup of sugar and the egg white and process until mixture forms a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 3 tablespoons of the pistachio paste in a medium-size saucepan (save the rest for another use). Add the milk and bring the mixture to a boil over medium heat. Remove from the heat and let steep for 5 minutes. Strain through a fine-mesh sieve into another medium-size saucepan. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the egg yolks and the remaining sugar until thick and light. Whisk in half the strained milk; then whisk the mixture back into the remaining milk. Cook the sauce over low heat, stirring constantly, until thick enough to coat the back of a spoon; do not let the mixture come to a boil. Refrigerate for 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spoon a pool of the sauce onto the center of each of 4 plates. Run the tip of a small knife around the inside edge of the molds. Dip them briefly in a bowl of hot water and invert them onto the plates. Serve."}]}