{"@context": "http://schema.org", "@type": "Recipe", "name": "Berbere-and-Mulberry-Glazed Duck", "description": "", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project, roasts", "keywords": "duckling, mulberries, rice vinegar, main course, spring", "aggregateRating": null, "recipeIngredient": ["15-pound duckling", "1 tablespoon berbere spice mix", "2 teaspoons salt", "1 teaspoon freshly ground pepper", "5 tablespoons mulberry syrup", "1 teaspoon rice vinegar", "1 teaspoon soy sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 275 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the duck of any excess skin around the neck cavity. Rinse the duck inside and out with cold running water and dry thoroughly, inside and out, with two changes of paper towels. With a sharp paring knife, cut 6 1/4-inch vents in the skin of the breast and 2 in the skin of each leg to allow excess fat to drain during roasting. Mix the berbere spice with the salt and pepper, and sprinkle the breast, legs and cavity with 1 tablespoon of the mixture. Position the duck breast-side down on a rack in a roasting pan, and season the back of the duck with another teaspoon of the spice mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the duck for 1 hour and remove it from the oven. With a sharp paring knife cut 5 or 6 vents in the skin of the back, turn the duck breast-side up and return to oven. Roast the duck for another hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the duck from the oven, and increase the oven temperature to 375 degrees. Lift the duck (still breast-side up on the rack) from the pan and place on a baking sheet. Pour off the fat from the roasting pan, and return the duck (still on the rack) to the pan. Pour the mulberry syrup in a small bowl and whisk in the rice vinegar and soy sauce until blended. Baste the breast and legs with the syrup mixture and sprinkle with a few generous pinches of the berbere seasoning. Roast the duck for another hour, basting every 15 minutes with the syrup mixture, and following each basting with a couple pinches of the spice mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the roasting pan from the oven and let duck rest 15 minutes before serving."}]}