{"@context": "http://schema.org", "@type": "Recipe", "name": "Pan-Seared Halibut Steaks With Snap-Pea Sauce and Garnish", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, weekday", "keywords": "halibut, heavy cream, snap peas, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 417, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "4 grams", "proteinContent": "47 grams", "saturatedFatContent": "8 grams", "sodiumContent": "1040 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound (about 4 1/2 cups) snap peas", "2 tablespoons unsalted butter", "2 shallots, halved and thinly sliced", "3/4 cup homemade or low-sodium chicken stock", "1/4 cup heavy cream", "Kosher salt and freshly ground white pepper", "4 halibut steaks, about 8 ounces each", "1 tablespoon peanut oil", "1/2 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large saucepan that is 2/3 full of salted water to a boil. Add the snap peas and cook until just tender, 3 to 4 minutes. Drain and immediately plunge the peas into cold water in order to halt the cooking. Cool, drain again and set the peas aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, melt 1 tablespoon of butter over medium heat and add the shallots. Cook, stirring, until the shallots soften, about 3 minutes. Remove from heat and transfer shallots to the container of a blender. Add the stock, cream and 1/2 of the cooked peas and process until very smooth, about 2 to 3 minutes. Pass the mixture through a fine-mesh sieve, pressing to push as much of the solids through the sieve as possible. Return the sauce to the pan and then set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the halibut with salt and pepper. Place a nonstick skillet large enough to hold the halibut in a single layer over high heat. Add the oil. When very hot, add the halibut fillets and cook, turning once, until they are just opaque in the middle, about 10 minutes. (Lower the heat if they seem to cook too quickly.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish is cooking, melt the remaining tablespoon of butter in a small skillet set over medium heat and add the remaining snap peas. Cook, tossing, until just warmed through. Season with salt and pepper and set aside. Rewarm the sauce, season it with salt and pepper and divide it among 4 plates. Top each plate with a halibut steak, squeeze a little lemon over each steak and arrange the snap peas around the steak. Serve immediately."}]}