{"@context": "http://schema.org", "@type": "Recipe", "name": "Snap Peas and Shiitake Mushrooms In Scallion Crepes With Lemon Zest", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "About 4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, project", "keywords": "main course, mushroom, scallion crepes, snap peas, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 403, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "7 grams", "sodiumContent": "676 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 whole scallions, plus 1 scallion sliced as thinly as possible", "1/2 cup milk", "2 large eggs, lightly beaten", "1 cup sifted all-purpose flour", "1/4 teaspoon salt", "2 tablespoons melted unsalted butter", "Grated zest of 1 lemon", "1/4 cup extra-virgin olive oil", "1/2 pound sugar snap peas, trimmed and strings removed, cut on bias into 1/2-inch pieces (about 2 cups)", "1/2 pound shiitake mushrooms, stems discarded, tops cut into 1/4-inch slices", "Juice of 1 lemon", "Zest of 1/2 lemon, cut into very thin strips", "Kosher salt to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the crepes, pass the 8 whole scallions one at a time through a juicer, then run the milk through the juicer to extract all the juice. Whisk the eggs into the mixture. Combine the flour and salt in a medium bowl. Pouring in a thin, steady stream, slowly whisk the scallion-and-milk mixture into the flour, and keep on whisking until the batter is very smooth. Whisk in the butter, the lemon zest, the thinly sliced scallion and 5 tablespoons of water. Allow the batter to rest at room temperature for at least half an hour and preferably for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, heat the olive oil in a medium skillet set over high heat until it just starts to smoke. Add the peas and quickly saute them until lightly browned, 1 to 2 minutes. With a slotted spoon, transfer the peas to a bowl. Add the mushrooms to the skillet, reduce the heat to medium and cook, stirring occasionally, until they are soft and lightly browned, about 8 minutes. Transfer to the bowl with the peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the skillet to high heat and then add 1/4cup water, the lemon juice and lemon zest to the pan. Cook, scraping the bottom of the pan, until the liquid is reduced to about 2 tablespoons. Pour the liquid over the mushrooms and peas, toss them and season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, heat an 8-inch crepe or omelet pan over medium high heat. Brush the bottom of the pan with a little olive oil and coat it with crepe batter (tilt the pan to make the crepes as thin as possible). Turn the crepe almost immediately and cook the other side until lightly browned. Then transfer to a plate and repeat until all the batter is used, placing the cooked crepes between layers of wax paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place about 1/4 cup of the mushroom-pea mixture (rewarm it if necessary) on each crepe and carefully roll them up. Serve immediately."}]}