{"@context": "http://schema.org", "@type": "Recipe", "name": "Lobster Fricassee With Artichoke Coulis And Tarragon", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "artichoke, lobster, white wine, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 940, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "8 grams", "proteinContent": "118 grams", "saturatedFatContent": "9 grams", "sodiumContent": "2968 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 fresh halved artichoke bottoms", "1 lemon, halved", "4 cloves garlic, peeled", "5 sprigs fresh tarragon", "3 sprigs fresh lemon thyme", "1 cup white wine", "1/2 cup olive oil", "Salt and freshly ground black pepper to taste", "Salt", "8 stalks asparagus", "1/4 pound haricots verts", "2 lobsters, 3 pounds each", "2 tablespoons unsalted butter", "Tarragon leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the coulis, preheat the oven to 200 degrees. Place all the ingredients in a nonreactive roasting pan and cover tightly with aluminum foil. Roast for 3 hours. Remove from the oven and allow to cool. Remove the lemon and herb sprigs and puree the remainder in a blender. Season to taste with salt and pepper. Reheat over low heat just before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the lobster and vegetables, fill a saucepan 2/3 full of salted water and bring to a boil. Cut each asparagus stalk into thirds and add the asparagus and haricots verts to the pan. Cook until the vegetables are al dente, about 4 minutes. Drain and immediately plunge vegetables into a bowl of cold water to stop the cooking. When cool, drain well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large lobster kettle 2/3 full of water and bring to a boil. Place the lobsters, headfirst, into the boiling water and quickly cover the pot. Wait 5 minutes. Remove the lobsters from the pot and immediately hold them under cold running water. When cool, remove the meat from the tail and claws. (It will still be somewhat raw.) Slice each tail into 6 medallions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter in a large saute pan set over medium-high heat. Sprinkle the lobster meat with salt and add to the pan. Cook, shaking the pan, until the meat is just heated through, about 3 minutes. Divide among 4 warmed dinner plates and set aside. Return the pan to the heat and add the asparagus and haricots verts. Cook, shaking, until the vegetables are just heated through, about 2 minutes. Season with salt and pepper and divide among the plates. Spoon some of the reheated artichoke coulis around the lobster, garnish with tarragon leaves and serve immediately with wild rice and orzo (recipe follows)."}]}