{"@context": "http://schema.org", "@type": "Recipe", "name": "Brioche Tarts With Blue Cheese, Walnuts And Quince", "description": "", "author": {"@type": "Person", "name": "Charlie Trotter"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "brioche, quince, walnut, fall", "aggregateRating": null, "recipeIngredient": ["3 teaspoons active dry yeast", "6 tablespoons warm milk", "1 cup plus 1 1/2 tablespoons all-purpose flour", "2 1/2 cups plus 2 tablespoons bread flour", "6 tablespoons plus 1 teaspoon sugar", "1 teaspoon plus 2 tablespoons coarsely chopped rosemary leaves", "1 teaspoon finely chopped orange, lemon or lime zest", "1 1/2 teaspoons salt", "3 large eggs", "1 cup (2 sticks) plus 5 tablespoons butter, at room temperature", "2 cups peeled and cubed quince, pear, apple or persimmon", "2 tablespoons brown sugar", "1 cup crumbled Maytag blue cheese", "1 large egg beaten with 2 teaspoons milk", "1 cup raw walnuts or pecans", "Honey, for reheating tarts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "To prepare dough:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place yeast in a small bowl, and pour in milk. Stir, and allow to sit several minutes. In bowl of mixer, combine all-purpose flour, bread flour, 3 tablespoons plus 1 teaspoon sugar, 1 teaspoon rosemary and zest. Add yeast mixture, salt and 3 eggs. Mix with dough hook on low speed until mixture is cohesive. Add 1 cup plus 2 tablespoons butter. Continue mixing, scraping bowl frequently, until dough is smooth and pulls away from sides of bowl, about 20 minutes. Cover; refrigerate at least 5 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide into 4 equal balls. Pat into flat rounds 4 inches across. Cover with plastic wrap; keep in a warm place for 45 minutes."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "While dough rises, prepare quince:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a small saut&eacute; pan over medium-low heat, and melt remaining 3 tablespoons butter. Add quince, and saut&eacute; until just tender. Sprinkle with brown sugar and cool."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To assemble:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Place dough rounds on a baking sheet. With fingertips, press each to create a well in center and a rim on edge. Divide quince among tarts. Layer on blue cheese, letting it fill where it may. Brush tart edges with egg-milk mixture. Crush nuts in your hand over tarts, letting some fall onto edges. Sprinkle with remaining 2 tablespoons rosemary. Dust generously with remaining 3 tablespoons sugar, especially over edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until edges and bottoms are golden brown (lift to check), rotating pan halfway for even baking, 20 to 25 minutes. Serve warm or at room temperature. To reheat, drizzle with honey to give a little sheen."}]}]}