{"@context": "http://schema.org", "@type": "Recipe", "name": "Beer-Can Chicken", "description": "", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "beer, chicken, dairy-free, main course", "aggregateRating": null, "recipeIngredient": ["2 cups hickory or oak chips, soaked in beer or water to cover for 1 hour and then drained", "2 12-ounce cans beer", "1/2 cup of your favorite barbecue rub", "2 3 1/2- to 4-pound chickens, fat removed, washed and blotted dry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place wood chips in bowl. Pop tab of each beer can, and make 2 additional holes in each top, using a church-key opener. Pour half the beer from each can over the chips. Add additional beer or water to cover chips, soak them for 1 hour, and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set up grill for indirect grilling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle 1 teaspoon barbecue rub in neck cavity and 2 teaspoons in main cavity of each chicken. Add 1 tablespoon rub to each open, half-full can of beer. (Don't worry if it foams up.) Season outside of each bird with 2 tablespoons rub."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stand beer cans on work surface. Holding each chicken upright, lower it over can so that can goes into main cavity. Pull chicken legs forward to form a sort of tripod: the chicken should sit upright over can. Carefully transfer chickens to grill in this position, placing them in center over drip pan, away from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using charcoal, toss half the wood chips on each mound of coals. If using gas, place chips in smoker box. Barbecue chickens until nicely browned and cooked through, about 1 1/2 hours, keeping temperature about 350 degrees. (If using charcoal, replenish coals as needed.) The internal temperature of the birds (taken in thickest part of thigh) should be at least 165 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully transfer birds to platter in same position. To carve, lift bird off can, and discard can."}]}