{"@context": "http://schema.org", "@type": "Recipe", "name": "Tom Colicchio's Summer Minestrone", "description": "This soup is flexible because the list of ingredients isn't fixed. If you can't find an ingredient, skip that item or substitute something similar. It is important to include the escarole, however. It adds a certain bitterness and gives character to the mixture. Once the soup is done, you could refrigerate it overnight (or up to a few days) and serve it cold. In that case, it's best to wait to cook and chill the fava beans, peas, green beans and wax beans, and add them, along with basil and olive oil, and even some tomato if you like, just before serving.", "author": {"@type": "Person", "name": "Tom Colicchio"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 or more servings", "recipeCuisine": "italian", "recipeCategory": "lunch", "keywords": "beans, summer vegetables, vegetable stock, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 23}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 432, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "20 grams", "proteinContent": "16 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1745 milligrams", "sugarContent": "18 grams", "transFatContent": null}, "recipeIngredient": ["1 pound cranberry beans, shelled", "1 small red bell pepper", "Salt", "1/2 pound fava beans, shelled and peeled", "1 pound peas, shelled", "1/2 pound green beans, trimmed and cut in 1-inch lengths", "1/2 pound wax beans, trimmed and cut in 1-inch lengths", "1 stalk celery, trimmed", "2 leeks, rinsed and trimmed", "1 medium onion, peeled", "1 small bulb fennel, trimmed", "3 medium carrots, peeled", "2 medium zucchini", "1/2 medium eggplant", "1/2 cup extra virgin olive oil", "3 large cloves garlic, peeled and sliced", "Freshly ground black pepper", "1 tablespoon tomato paste", "5 to 6 cups vegetable stock", "1 medium head escarole, trimmed and coarsely chopped", "3 sprigs fresh thyme", "1 cup fresh basil leaves, loosely packed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place cranberry beans in a saucepan, add cold water to cover generously and simmer until tender, about 30 minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, blacken skin of pepper over open flame, peel, core, rinse, pat dry and cut in small dice. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with water and plenty of ice. Bring a pot of salted water to a boil, add fava beans and peas and boil 6 minutes. Add green beans and wax beans, and cook 3 minutes longer. Drain vegetables, and place in ice water. When cold, drain again and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut celery, leeks, onion, fennel, carrots, zucchini and eggplant in uniform small dice, keeping vegetables separate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons olive oil in an 8- to 10-quart pot. Add garlic and about a third of the celery, leeks, onion, fennel and carrots, taking care to maintain oil at a slow sizzle. Season with salt and pepper. Continue adding these vegetables gradually so oil keeps sizzling, seasoning as you go. When all have been added, continue cooking 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add zucchini, eggplant and reserved red pepper gradually, so slow cooking in pot is maintained. Keep seasoning with salt and pepper. When all these vegetables have been added, stir in tomato paste and enough stock to cover vegetables. Bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add escarole, and cook about 6 minutes, until tender. Stir in cranberry beans and thyme. If serving immediately, add fava beans, peas, green beans, wax beans, basil and remaining olive oil. Taste for seasoning, and add more salt and pepper if needed. To serve later, fill sink to depth of six inches with cold water and ice, and place pot in sink to stop cooking. When cool, set aside or refrigerate. When ready to serve, add fava beans, peas, green beans and wax beans, basil and remaining olive oil, and reheat to simmer before serving."}]}