{"@context": "http://schema.org", "@type": "Recipe", "name": "Papaya Tart", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, low cholesterol, nut-free, papaya, puff pastry", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 308, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "4 grams", "sodiumContent": "114 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["1 sheet frozen puff pastry (8 1/2 ounces)", "2 teaspoons milk", "3 tablespoons dark brown sugar", "2 medium papayas, peeled and cut lengthwise into 1/4-inch-thick slices (any left over can be used for the sorbet)", "Juice of 2 or 3 limes (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow 1 piece of puff pastry dough to defrost at room temperature (about 30 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack in the middle of oven, and heat to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open out the sheet of puff pastry. On a lightly floured surface, roll it out until it is about 1/8 inch thick. Cut out a 9-inch circle. Place on a parchment-covered baking sheet (or a baking sheet covered with greased aluminum foil). Leaving a 1/4-inch rim, prick the center of the dough all over with the tines of a fork. With a pastry brush, lightly coat the center of the dough with the milk. Push 1 tablespoon of the sugar through a coarse sieve to distribute evenly over the center of the dough. Bake for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently toss the papaya with the lime juice. Remove the tart shell from the oven, and lay the papaya slices in a spoke pattern on the shell. Push the remaining 2 tablespoons of sugar through a coarse sieve evenly over the top of the fruit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return to the oven for 15 minutes, until the crust is golden and the sugar is caramelized. Remove from the oven, and slide off the baking pan onto a rack. Cool slightly and serve, or cool completely and reheat slightly just before serving. Cut into wedges with large kitchen scissors."}]}