{"@context": "http://schema.org", "@type": "Recipe", "name": "Grapefruit Tart", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT4H30M", "recipeYield": "10 to 12 slices", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, grapefruit, grapefruit juice, tart shell, nut-free, spring, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 85, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["3 to 4 large pink grapefruits, peeled (peels from 1 or 2 reserved, white pith removed and chopped fine to equal 3/4 cup) and separated into sections", "1 10-inch pate sucree tart shell, partially baked (recipe below)", "3 tablespoons cornstarch", "1/2 cup plus 2 tablespoons granulated brown sugar", "1/2 cup grapefruit juice (from the bowl holding the sections)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a rack in the middle of the oven and one in the top (if using an electric oven). Heat to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the grapefruit sections in the crust in a pinwheel design. In a small bowl, combine the cornstarch, 1/2 cup brown sugar, grapefruit rind and grapefruit juice. Stir to mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the mixture over the grapefruit sections, being careful not to disturb the design and not to allow any of the juice to seep over the edge of the crust. Place on the middle rack of the oven, and bake for 30 minutes. Remove from the oven, and turn the oven to broil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle the remaining 2 tablespoons of brown sugar over the top of the tart; if there isn't enough liquid in the tart to cause the brown sugar to bubble under the broiler, sprinkle 1/2 to 1 tablespoon of grapefruit juice over the sugar before broiling. Return to the oven, and broil for 4 minutes, or until bubbly. Remove from oven, and cool on a rack."}]}