{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese Pepper Steak", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT50M", "recipeYield": "6 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, weekday", "keywords": "beef, oyster sauce, pepper, dairy-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 62}, "recipeIngredient": ["2 teaspoons oyster sauce (see note)", "1 teaspoon sesame oil", "1/2 teaspoon peeled, minced ginger", "1 1/2 teaspoons Shao-Hsing wine (see note) or dry sherry", "3/4 teaspoon dark soy sauce", "1/2 teaspoon kosher salt", "1 teaspoon sugar", "1 1/2 teaspoons cornstarch", "Pinch freshly ground white pepper", "3/4 pound London broil, cut into 1-inch cubes", "2 teaspoons oyster sauce", "1 teaspoon sesame oil", "1 teaspoon dark soy sauce", "1 teaspoon sugar", "2 teaspoons cornstarch", "Pinch freshly ground white pepper", "1/2 cup chicken stock", "2 large garlic cloves, smashed with the flat side of a cleaver and peeled", "2 tablespoons fermented black beans (see note), washed and rinsed", "3 tablespoons peanut oil", "1 tablespoon peeled, minced ginger", "1 medium green bell pepper, seeded and cut into 1-inch pieces", "1 medium red bell pepper, seeded and cut into 1-inch pieces", "Cooked rice for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the marinade. In a large bowl, whisk together all the marinade ingredients except the London broil. Then add the London broil and set aside at room temperature for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce. In a small bowl, whisk together the sauce ingredients and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the bean paste. In a large bowl, combine the garlic and black beans. Carefully grip the back of a cleaver and, using the handle like a pestle, work the garlic and beans into a smooth paste. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the stir-fry. In large wok, over high heat, heat 1 tablespoon oil. When the oil is smoking, add ginger and cook, stirring, until light brown, about 20 seconds. Add peppers and cook, stirring, until slightly tender, about 1 minute more. Transfer peppers to a bowl and set aside. Wipe out the wok, add the 2 remaining tablespoons oil and return it to the heat. When the oil is smoking, add the bean paste and cook, stirring, until light brown, about 20 seconds. Add the beef with the marinade, spread into an even layer and cook, tipping the wok back and forth, 1 minute. Turn the beef over and cook until brown, about 30 seconds more. Add the peppers and cook, stirring, until very tender, about 2 minutes. Push beef and peppers to the sides of the wok to form a well in the center. Pour the sauce mixture into the well and cook, stirring, until the liquid thickens and turns dark brown, about 2 minutes. Transfer to a platter and serve with rice."}]}