{"@context": "http://schema.org", "@type": "Recipe", "name": "Rack of Lamb With Fava Beans And Roasted Garlic Custard", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT8H20M", "recipeYield": "Six servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, project", "keywords": "garlic, lamb, red wine, main course, nut-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1176, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "71 grams", "fiberContent": "13 grams", "proteinContent": "51 grams", "saturatedFatContent": "33 grams", "sodiumContent": "1405 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 racks of lamb, trimmed and Frenched (ask your butcher to do this), trimmings reserved", "2 1/2 pounds meaty lamb bones (like shoulder)", "3 tablespoons extra virgin olive oil", "1 large onion, peeled and coarsely chopped", "1 bottle dry red wine", "1 head of garlic, halved", "1 teaspoon whole black peppercorns", "1 sprig fresh thyme", "1 sprig fresh rosemary", "1 bay leaf", "1/2 teaspoon caraway seeds", "2 teaspoons kosher salt", "Freshly ground pepper to taste", "1 tablespoon canola oil", "2 cups cooked fresh fava or white beans", "2 medium heads of garlic, halved lengthwise", "1 tablespoon extra virgin olive oil", "1 1/4 teaspoons kosher salt, plus more to taste", "Freshly ground pepper", "1 tablespoon water", "5 eggs", "2 cups heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 1 day before serving, make the lamb sauce: Preheat the oven to 400 degrees. Place the lamb trimmings and bones in a large roasting pan and roast, turning twice, until lightly browned, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat 2 tablespoons of the olive oil in a large stockpot over medium heat. Add the onion and saute until browned, about 8 minutes. Add the bones, the wine and enough water to cover the bones by 2 inches. Bring to a boil, skim and add the garlic, peppercorns, thyme, rosemary, bay leaf and caraway seeds. Reduce the heat and simmer 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain broth and refrigerate overnight. Scrape off and discard the fat. Place the broth in a medium saucepan over medium-high heat and boil until reduced to 1 cup, about 45 minutes. Season with 1/2 teaspoon of salt and pepper. Reheat before serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the custard, preheat the oven to 325 degrees. Place the garlic in a small baking dish, drizzle with the olive oil and season with a little salt to taste and pepper. Add the water to the pan, cover tightly with aluminum foil and bake until soft, about 1 hour. When the garlic cloves are cool enough to handle, squeeze them from the skin and place in a food processor with the eggs and the cream. Process until smooth, stopping to scrape the sides of the bowl. Season with the 1 1/4 teaspoons of salt and the pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the garlic mixture into 6 6-ounce ramekins and place the ramekins in a roasting pan. Pour in enough hot water to reach halfway up the sides of the ramekins and bake until set, about 50 minutes. Reheat before serving. (Custards can be made a day ahead and refrigerated.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the lamb, preheat oven to 400 degrees. Use 1 teaspoon of salt and pepper to season both racks. Heat the canola oil in an ovenproof skillet over medium-high heat, place the racks in the skillet fat side down and sear for 6 minutes. Turn the racks over and roast in the oven until medium-rare, about 30 minutes. Meanwhile, toss the fava beans with 1 tablespoon of olive oil and1/2 teaspoon of salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut the racks into double chops and divide among 6 plates. Loosen the custards by running the tip of a small knife around the edge of the ramekins and unmold 1 onto each plate. Scatter the beans around the plates and drizzle some of the sauce over each chop. Serve immediately."}]}