{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato and Chickpea Soup With Yogurt", "description": "", "author": {"@type": "Person", "name": "Paula Wolfert"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "6 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, soups and stews", "keywords": "chickpea, lamb, yogurt, fall, winter, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 434, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "5 grams", "proteinContent": "25 grams", "saturatedFatContent": "6 grams", "sodiumContent": "977 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 ounces boneless shoulder of lamb, trimmed of all fat", "2/3 cup dried chickpeas, soaked overnight", "4 large boiling potatoes (1 1/2 pounds)", "1 teaspoon coarse salt, plus salt to taste", "6 cups plain low-fat yogurt, drained to make 3 cups", "1 egg", "1 tablespoon all-purpose flour", "2 tablespoons olive oil or butter", "1 teaspoon freshly ground black pepper", "1 rounded tablespoon safflower threads"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the meat into 1/2-inch cubes. In a 4-quart saucepan, combine the meat and 8 cups water. Bring to a boil and skim carefully. Add the drained chickpeas, reduce heat, cover and simmer for 1 hour. Up to this point, the soup can be prepared one day in advance."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 1 hour before serving, peel potatoes and cut into 1/2-inch cubes. Add potatoes and 1 teaspoon salt to the soup base, and cook until tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a second saucepan, whisk the yogurt with the egg, flour and 1 tablespoon of the oil or butter, until completely smooth. Set yogurt mixture over low heat, and turn off heat under the soup. Gradually stir 2 cups of the hot soup base into the yogurt mixture in order to raise its temperature. When the temperature of the yogurt is hotter than the temperature of the soup (test by touching), pour the yogurt mixture back into the soup, stirring constantly over low heat, until it just comes to a boil, about 15 minutes. Correct the seasoning with salt. Transfer to a soup tureen."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the black pepper and safflower threads through a fine sieve. Place the powdered spices in the center of the soup. Heat the remaining tablespoon of oil or butter in a small pan or skillet; bring to a sizzle, pour over the spices and stir gently to create swirls. Cover the soup and wait 5 minutes before serving."}]}