{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Roasted Duck With Orange-Sherry Sauce", "description": "The New Orleans raconteur Pableaux Johnson scored this recipe from Greg Sonnier of Gabrielle restaurant in the Mid-City neighborhood back in 2004, calling it a reflection \"of the dual nature of New Orleans cookery.\" Inspired by the haute cuisine of K-Paul's Louisiana Kitchen, where Mr. Sonnier got his start, it also takes more than a bow toward the city's legendary street food tradition of gravy-soaked po' boys laden with French fries. At the restaurant, Mr. Sonnier served the dish over shoestring potatoes. Home cooks can substitute mock frites or hash browns. Either way, the interplay between the moist meat, luscious sauce and crisp potatoes is nonpareil. (Sam Sifton)", "author": {"@type": "Person", "name": "Pableaux Johnson"}, "image": "https://static01.nyt.com/images/2014/05/13/dining/orangeduck-still/orangeduck-still-articleLarge.jpg", "totalTime": "PT5H45M", "recipeYield": "2 to 3 servings", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "duck, orange, sherry, fall, winter, gluten-free, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 52}, "recipeIngredient": ["1 pound yellow onions, peeled and coarsely chopped", "1/2 stick unsalted butter, melted", "1 5-pound duck, rinsed and patted dry", "Salt", "Freshly ground pepper", "2 large rosemary sprigs", "2 cups fresh orange juice", "1 cup dry sherry", "1/2 cup soy sauce", "2 medium carrots, peeled and julienned", "4 ounces cremini or white button mushrooms, trimmed and sliced thin", "2 tablespoons unsalted butter", "1 7-ounce jar roasted red peppers, rinsed, drained and cut into strips", "2 fresh chives, cut into 1-inch lengths", "Hash browns (<a href=\"http://cooking.nytimes.com/recipes/7929-hash-browns\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 500 degrees. In a large bowl, toss onions with melted butter. Season duck inside and out with salt and pepper. Place rosemary sprigs inside duck's cavity and then tightly pack with buttered onion mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place duck in medium-size roasting pan, and roast for 10 minutes. Reduce oven temperature to 300 degrees and cover pan loosely with foil. Roast for about 4 1/2 hours, draining fat every hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pan from oven and carefully discard as much fat as possible with a ladle. Add orange juice, sherry and soy sauce. Return pan to oven and roast uncovered for 30 minutes. Transfer duck to a platter and let cool slightly. Pour pan juices (about 4 cups) into a saucepan, discarding any pieces of skin. Skim off fat and bring to a boil over medium-high heat. Add carrots and reduce to 1 1/2 cups, strain and keep on the side. In same pan, sauté mushrooms with 2 tablespoons butter until brown. Add red peppers and briefly sauté, then add reduced sauce. Season to taste with salt and pepper. Keep warm over low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove onions and rosemary from duck's cavity. Remove meat from bones. Place skin from duck breasts onto cookie sheet and bake at 400 degrees until skin starts to foam, about 5 to 10 minutes. Lower oven temperature to 200 degrees and place meat in oven to keep warm until serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover bottoms of individual plates with sauce and top with either pasta, shoestring fries, hash browns or unsalted potato chips. Place a generous amount of duck meat on top, then garnish with crispy skin, vegetables and chives."}]}