{"@context": "http://schema.org", "@type": "Recipe", "name": "Alfred Portale's Spring-Pea Soup", "description": "", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, side dish, gluten-free, nut-free, heavy cream, morels, peas, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 474, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "44 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "9 grams", "proteinContent": "17 grams", "saturatedFatContent": "12 grams", "sodiumContent": "1160 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 ounce dried morel mushrooms", "3/4 cup heavy cream", "1 teaspoon white truffle oil", "2 egg yolks", "1/4 teaspoon kosher salt", "1/8 teaspoon fresh ground white pepper", "1 tablespoon olive oil", "1 onion, chopped", "1 half rib celery, chopped", "4 cups chicken stock", "4 cups shelled fresh peas", "Salt and freshly ground white pepper to taste", "1 to 2 tablespoons sugar", "White truffle oil for garnish", "Chervil sprigs (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the custard, preheat oven to 300 degrees. Rinse morels well under cold water. In a medium saucepan, bring morels, cream and truffle oil to a boil, then reduce heat and simmer until the mixture thickens, about 12 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Purée the mixture in a blender. Whisk the purée into the yolks and stir in salt and white pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place four lightly buttered two-ounce ramekins in a large baking dish. Pour the morel mixture into the ramekins. Add enough hot water to the baking dish to come 1/2 inch up the sides of the ramekins. Cover with foil and bake until the custards are set, 1 to 1 1/4 hours. Remove from the water bath, run a paring knife around the edges of the ramekins and turn each custard upside down into the center of a soup bowl. If not serving immediately, cool, cover with plastic wrap and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stockpot, heat the oil over medium heat and add the onion and celery, stirring, until softened, 3 to 4 minutes. Add the stock, bring to a boil and add peas. When boiling, reduce heat and simmer for about 12 minutes, or until the peas are very tender. Remove from heat and season with salt and white pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the peas, reserving the stock. Purée the vegetables in a blender, adding stock slowly. Place a large bowl in an ice bath, add the soup and stir. Season with salt, white pepper and sugar, and either serve at once or refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, have the soup at room temperature or slightly warm. Spoon enough soup around each custard to come up 3/4 of the height of the custard. Drizzle each serving with white truffle oil and garnish with a chervil sprig."}]}