{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Roasted Heirloom Tomatoes With Fresh Thyme", "description": "Like any other tomato recipe, this dish lives or dies with the perfectly ripened tomato. Commercial growers breed for size, shape and hardiness of shipping, but you should put your emphasis on taste rather than appearance. I'm a willing taker for tomatoes that are not so stunning-looking because I know how good they taste.''", "author": {"@type": "Person", "name": "William Norwich"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "6 servings", "recipeCuisine": "american", "recipeCategory": "project", "keywords": "appetizer, side dish, fall, garlic, heirloom tomatoes, thyme, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 187, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "3 grams", "sodiumContent": "344 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["6 medium heirloom perfectly ripened tomatoes, preferably a mix of red, yellow and green", "2 cloves garlic, finely chopped", "6 sprigs of thyme, leaves removed and finely chopped", "Salt and freshly ground pepper", "1/2 cup extra-virgin olive oil", "1 tablespoon sherry vinegar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat your oven to 250 degrees. In a large saucepan of boiling water, blanch the tomatoes for 30 seconds. Remove with a slotted spoon or strainer and immediately chill in a bowl of ice water or rinse under cold running water to stop the cooking. The skins will slip right off. Cut the tomatoes in half, crosswise. Gently squeeze each half to remove seeds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a 12-by-8-inch or 14-inch oval baking dish and sprinkle with half of the garlic and thyme. Season liberally with salt and pepper. Now arrange the tomato halves, cut sides up, in the dish and baste with the remaining oil. Season generously with salt and pepper and sprinkle with the remaining garlic, thyme and vinegar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake the tomatoes for 2 1/2 to 3 hours. When done, they will be soft and just starting to caramelize but still hold their shape. Spoon the pan juices up over the tomatoes and serve from the baking dish."}]}