{"@context": "http://schema.org", "@type": "Recipe", "name": "Almond Cake", "description": "This exquisite recipe came to The Times in a 2001 article by Amanda Hesser about the first meal her now mother-in-law, Elizabeth Friend, prepared for her. The meal ended with this simple almond cake. Ms. Hesser wrote: “It had a crust, fragile like a dry leaf, that led to a moist, downy layer of ground almonds and sugar. It was a perfect dessert. And it punctuated one of the great meals of my life.” It's not the prettiest cake in the world – Ms. Friend called it “the Shar-Pei of cakes” because it crumbles on the edges and falls in the middle – but it is flawless otherwise. If you care about looks, dust it with confectioners’ sugar and top it with fresh berries as we've done in the picture. It also improves with age and can be made 1 to 2 weeks ahead. Store it covered in or out of the fridge. Finally, this recipe makes two 8-inch cakes, so give one away or freeze one for a rainy day.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2018/02/20/dining/20COOKING-ALMOND-CAKE1/20COOKING-ALMOND-CAKE1-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "2 8-inch cakes, 8 servings each", "recipeCuisine": "american", "recipeCategory": "cakes", "keywords": "almond extract, butter, flour, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 507}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 661, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "76 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "19 grams", "sodiumContent": "326 milligrams", "sugarContent": "49 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 sticks butter, softened, more for buttering pan", "2 cups sifted all-purpose flour (measured after sifting)", "1/2 teaspoon salt", "1 1/2 cups granulated sugar", "7-ounce tube almond paste", "4 egg yolks, room temperature", "1 teaspoon almond extract", "1 cup sour cream", "1 teaspoon baking soda", "Confectioners’ sugar, for sifting over cake"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Butter sides and bottoms of 2 8-inch cake or springform pans; line sides and bottoms with parchment paper. Butter paper. Place pans in freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift flour and salt into a small bowl. Set aside. In a mixer fitted with a paddle, beat butter and granulated sugar at high speed until fluffy, about 5 minutes. Add almond paste, a little at a time at medium speed, and beat 8 minutes. Beat in egg yolks, one at a time, and almond extract. Mix sour cream and baking soda and add to butter mixture. Reduce mixer speed to low and gradually add flour mixture, just until blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide batter between prepared pans and spread evenly. Bake about 40 minutes to an hour, until tops are golden and spring back when lightly pressed and cakes shrink from sides of the pans. Cool in pans on wire rack. Remove sides of pans and remove paper. When ready to serve, sift confectioners’ sugar on top and slice like pie."}]}