{"@context": "http://schema.org", "@type": "Recipe", "name": "Striped Bass Poached In Spicy Soy Sauce", "description": "Poaching fish in a mixture of soy sauce and water is a simple, fast method that adds gorgeous flavor to fillets, which emerge moist and succulent. It is also flexible and forgiving, with a cooking liquid that can accommodate a host of seasonings. Here those seasonings are sugar (to cut the saltiness of the soy sauce), scallions and an optional fresh or dried chile pepper (either minced or put in whole), but you could experiment with ginger, garlic, lime juice or other flavors. Combine all the ingredients, except the bass, in a skillet. Bring to a boil, add the fish flesh-side-down, and adjust the heat so that the mixture does not bubble too aggressively. The fish cooks in 8 to 10 minutes, until its flesh is mahogany-colored and doesn’t resist when you slice in with a thin-bladed knife. Serve on top of rice, garnished with the cooking liquid and the scallions, which are now limp and tender. Other fish, like cod, halibut, monkfish and salmon, also work, but keep an eye on it as it poaches — you will likely need to adjust the cooking time slightly.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/03/25/dining/video-spicybass/video-spicybass-mediumThreeByTwo440.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, quick, project", "keywords": "main course, soy sauce, striped bass, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 348}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 205, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "33 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1585 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1/3 to 1/2 cup good soy sauce", "2 teaspoons sugar", "About 15 scallions, trimmed and cut into 2-inch lengths, or 2 or 3 spring onions or 1 large onion, peeled and sliced", "1 dried or fresh chile pepper (optional)", "About 1 1/2 pounds striped bass fillet, about 1 inch thick"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the soy sauce, water, sugar, scallions, chile (if using) and 1/2 to 2/3 cup water in a skillet just large enough to hold the fish. Turn the heat to medium high, and bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the fish, and adjust the heat so the mixture bubbles but not furiously. Cook 8 to 10 minutes, turning once or twice, until the fish is coated with a brown glaze and cooked through. Serve with white rice, spooning the sauce over all and garnishing with the scallions."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Striped Bass Poached in Spicy Soy Sauce", "description": "Mark Bittman poaches a filet in soy sauce and scallions.", "thumbnailUrl": "https://static01.nyt.com/images/2017/03/25/dining/video-spicybass/video-spicybass-mediumThreeByTwo440.jpg", "uploadDate": "2011-10-14T18:25:41.000Z", "duration": "PT3M39S"}}