{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea Bass in Black Bean Sauce", "description": "Do not be alarmed by this list of ingredients. This dish is much simpler to prepare than it may seem.", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT25M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, weekday", "keywords": "black beans, sea bass, shiitake, main course, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 841, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "5 grams", "proteinContent": "87 grams", "saturatedFatContent": "6 grams", "sodiumContent": "949 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 sea bass, about 1 1/2 to 2 pounds each, filleted, skin left on", "8 ounces fresh Hong Kong-style egg noodles (available in Asian markets)", "2 tablespoons light soy sauce, or more to taste", "2 tablespoons dark sesame oil, or more to taste", "2 tablespoons fermented black beans with garlic (available in jars in Asian markets)", "3 tablespoons peanut oil, or more as needed", "2 cups fresh mung bean sprouts", "1/2 red bell pepper, finely diced", "1/2 green bell pepper, finely diced", "4 medium fresh shiitake mushrooms, stems discarded, caps thinly sliced", "4 green onions, white part and some green, trimmed, thinly sliced", "1/2 tablespoon peeled, thinly sliced fresh ginger root", "1 cup chicken broth, or more as needed", "1 tablespoon cornstarch or arrowroot"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently cut 2 X's through the skin of each fillet without cutting the meat, to keep them from curling. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak noodles in warm water for 1 minute, drain and toss with 1 tablespoon soy sauce and 1 tablespoon sesame oil, or more to taste. The flavor should be noticeable but not overpowering. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the black beans with 1 tablespoon soy sauce and 1 tablespoon sesame oil. In a wok heat 1 tablespoon of peanut oil until smoking. Add the bean sprouts, bell peppers, mushrooms, green onions and ginger. Stir-fry for 1 minute. Add the bean-sauce mixture and stir-fry 1 minute. Add 1 cup chicken broth and stir-fry 1 minute more. Mix the cornstarch or arrowroot with a bit of water until smooth and add to the sauce. Heat to boiling, stirring gently, until the sauce is clear and thickened. If too thick, thin with more chicken stock. Set aside and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a nonstick 10-inch skillet heat 1 tablespoon peanut oil until almost smoking, add the noodles and flatten into a pancake. Fry gently until crisp, turn over, adding more oil if needed, and brown other side. Place on a platter and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining 1 tablespoon peanut oil in a nonstick 10-inch skillet over medium-high heat until it shimmers. Add the bass fillets, skin side down, and move the fillets gently to prevent sticking. Reduce heat to medium and cook until the skin is crisp, about 2 minutes. Turn over and cook until a sharp knife meets almost no resistance, 1 to 2 minutes, and fish is browned slightly. Do not overcook!"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Spoon the sauce over the noodles and top with the fillets."}]}