{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilled Cucumber Soup With Warm Salmon", "description": "", "author": {"@type": "Person", "name": "Richard Sax"}, "image": null, "totalTime": "PT2H25M", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, cucumber, low-fat yogurt, salmon, low calorie, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 222, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "13 grams", "saturatedFatContent": "6 grams", "sodiumContent": "552 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["2 medium-sized cucumbers", "8 ounces plain low-fat yogurt", "2 or 3 sprigs fresh dill, plus more for garnish", "1/4 cup heavy cream", "Salt and cayenne pepper", "Olive oil, as needed", "6 ounces salmon fillet, skin removed, cut into 12 thin 1-inch squares"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the cucumbers, halve them lengthwise and scrape out the seeds with a teaspoon, reserving seeds. Cut up the cucumbers, setting aside a one-and-one-half-inch length for garnish if desired, and place in a food processor with the yogurt and dill. Puree until smooth. Transfer the puree to a mixing bowl; whisk in the cream. Place the reserved cucumber seeds in the food processor and process briefly. Strain the liquid from the seeds into the puree (this adds more cucumber flavor); discard the seeds. Season the soup with salt and cayenne; cover and chill at least two hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At serving time, cut the reserved cucumber into quarter-inch cubes; salt lightly and set aside. Heat a thin film of olive oil in a heavy skillet, preferably nonstick. Pat the squares of salmon dry; season lightly with salt, if desired. Add the salmon to the skillet and saute quickly over medium heat, turning once, until lightly golden, about two minutes total. Place three pieces of salmon in each soup bowl; place diced cucumber and a sprig of dill in the center. Pour the cold soup gently over the warm salmon and serve immediately."}]}