{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Cod and Potatoes", "description": "When one of my daughters, Emma, was young, there was a time when her main passion in life was potatoes, especially crispy ones. For one special occasion, I produced a classic French dish, potatoes Anna, in which potatoes are thin-sliced, drenched in butter, carefully layered and roasted until golden. This was an error, of course; potatoes Anna is a pain to make. Naturally, the demand was unrelenting thereafter.\n\nSo, in an attempt to make the effort more rational, I cut down on the butter, cut short the preparation time by enlisting the aid of the broiler during the last few minutes of cooking, and decided to turn this one dish into something approaching an entire meal. In the last few minutes, before the potatoes were cooked through, I placed a thick fillet of fish on top of the potatoes. The result is a simple weeknight dish that I now make routinely, and one that even seems to impress the occasional guest.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/11/01/dining/01COOKING-EMMAS-COD1/01EMMAS-COD1-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "american", "recipeCategory": "dinner, weekday", "keywords": "black pepper, cod, potato, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1008}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 453, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "4 grams", "proteinContent": "34 grams", "saturatedFatContent": "3 grams", "sodiumContent": "973 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["4 or 5 medium potatoes, 2 pounds or more", "6 tablespoons extra-virgin olive oil or melted butter", "Salt and freshly ground black pepper to taste", "1 1/2 pounds cod or other fillets, about 1-inch thick (skinned), in 2 or more pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Peel potatoes, and cut them into slices about 1/8-inch thick (a mandoline comes in handy here). Toss the potatoes in an 8-by-12-inch or similar size baking pan with 4 tablespoons of the oil or butter. Season the potatoes liberally, spread them evenly and place the pan in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook for about 40 minutes, checking once or twice, until the potatoes are tender when pierced with a thin-bladed knife and have begun to brown on top. Remove the potatoes from the oven. Turn on the broiler, and adjust the rack so that it is 4 to 6 inches from the heat source."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top the potatoes with the fish, drizzle with the remaining oil or butter and sprinkle with some more salt and pepper. Broil until the fish is done, 6 to 10 minutes, depending on its thickness (a thin-bladed knife will pass through it easily). If at any point the top of the potatoes begins to burn, move the pan a couple of inches farther away from the heat source."}]}