{"@context": "http://schema.org", "@type": "Recipe", "name": "Salmon With Pea Sauce And Herb Salad", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "herbs, peas, salmon, main course, summer", "aggregateRating": null, "recipeIngredient": ["2 tablespoons peanut oil", "1 shallot, peeled and thinly sliced", "1/2 onion, peeled and thinly sliced", "Kosher salt to taste", "1 cup chicken stock", "1 cup heavy cream", "1 pound snap peas, coarsely chopped", "1 cup pea shoots", "4 tablespoons unsalted butter", "1/2 cup frisee lettuce, torn into small pieces", "1/4 cup chervil leaves", "1/4 cup dill leaves", "1/2 cup chives cut into 1-inch lengths", "1 teaspoon olive oil", "1 tablespoon peanut oil", "Freshly ground black pepper to taste", "4 salmon fillets with skin, 5 to 6 ounces each"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, heat the peanut oil in a saucepan set over medium heat, add the shallot and onion and season lightly with salt. Cook, stirring, until soft (do not allow the shallot and onion to brown), about 10 minutes. Add the stock and cream and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a kettle of very salty water to a boil. Add the peas and cook for 3 minutes. Add the pea shoots and cook for 1 minute more. Drain and plunge into cold water to cool. Drain again and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the peas and pea shoots to the saucepan and bring the sauce just to a simmer. Puree the mixture in small batches in a blender until very smooth. Pass through a fine-mesh sieve, pressing on the solids to extract as much liquid as possible. Discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the herb salad, combine the frisee, chervil, dill and chives in a small bowl. Toss with the olive oil and salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the salmon, heat a large heavy skillet over high heat. Add the peanut oil and heat until hot. Season the salmon fillets with salt and pepper and cook, turning once, until lightly browned on both sides and still somewhat pink in the middle, about 6 minutes. Set aside, covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, finish the sauce by combining the butter and 1 tablespoon of water in a saucepan over medium heat. Whisk until the butter is melted. Add the sauce. Heat until very warm but not boiling and season to taste with salt and pepper. Using a hand-held immersion blender, blend until very foamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Skim the foam off the top of the sauce with a spoon and ladle the sauce over the bottom of 4 dinner plates or shallow soup plates. Place a salmon fillet on each plate and top with 1/4 of the herb salad. Serve immediately."}]}