{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Fish With Fried Ginger", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, project", "keywords": "corn oil, ginger, snapper, fall, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 906, "unsaturatedFatContent": "49 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "3 grams", "proteinContent": "31 grams", "saturatedFatContent": "6 grams", "sodiumContent": "830 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["Neutral oil, like grapeseed or corn, as needed", "1/2 pound ginger, preferably thin-skinned", "1 1/2 pounds snapper, sea bass, catfish or other firm, white-fleshed fillet, cut into large chunks", "Salt and freshly ground black pepper", "1 cup flour", "1 cup cornstarch", "4 scallions, trimmed and cut into 2-inch lengths", "1 tablespoon good soy sauce or fish sauce (nam pla)", "Cilantro leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Choose a pot that will accommodate the fish chunks in one layer. Add 2 to 3 inches of oil, turn heat to medium-high, and bring to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, peel ginger (if skin is thin, this is best accomplished with a spoon) and julienne it, slice it thinly, or peel strips with a vegetable peeler. When oil is hot, fry ginger until lightly browned, about 10 minutes, adjusting heat as necessary so the temperature remains nearly constant. Meanwhile, season the fish with salt and pepper, and combine flour and cornstarch in bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove ginger with slotted spoon and set aside. Dredge fish lightly in the cornstarch-flour mixture, tapping to remove excess, and slowly add pieces to oil, again adjusting heat as necessary so temperature remains nearly constant. Fry, turning once or twice, until fish is lightly browned and cooked through (a skewer or a thin-blade knife will pass through each chunk with little resistance). Remove with slotted spoon, and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry scallions for 15 seconds and remove with a slotted spoon; drain. Refry the ginger for about 30 seconds, then remove and drain. Put fish on plate and garnish with ginger and scallions; drizzle with soy sauce or fish sauce, top with cilantro, and serve."}]}