{"@context": "http://schema.org", "@type": "Recipe", "name": "Roulade Of Rainbow Trout With Morel Mushroom Duxelles", "description": "", "author": {"@type": "Person", "name": "Jennifer Lang"}, "image": null, "totalTime": "PT2H", "recipeYield": "Four appetizer servings or two main-course servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, main course, fall, morels, rainbow trout, white mushrooms", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 493, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "1 gram", "proteinContent": "24 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1047 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 ounce dried morels", "2 tablespoons unsalted butter", "6 tablespoons chopped shallots", "2 cups chopped fresh white button mushrooms", "1/2 teaspoon soy sauce", "Salt to taste", "4 fillets, taken from 2 8-ounce boned rainbow trout, skin left on", "4 cups warm fish stock", "1/4 cup Sherry vinegar", "1/4 cup dry white wine", "1/4 cup heavy cream", "1/4 pound (1 stick) cold unsalted butter, cut into small cubes", "Freshly ground white pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the mushrooms into a small saucepan with two cups of water and bring to a boil. Turn off the heat and let the mushrooms steep in the hot water for one hour. Drain the mushrooms, reserving the soaking liquid, and rinse under running water to remove all residual sand and dirt. Chop the reconstituted mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the two tablespoons of butter in a medium-size skillet over medium heat. Saute three tablespoons of the chopped shallots until they are limp, about four minutes. Add the chopped morels, the chopped button mushrooms and the reserved mushroom-soaking liquid. Cook over medium heat until nearly all of the liquid is evaporated from the skillet. Season with soy sauce and salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make each trout fillet into a figure eight: place the fillet skin-side-down on a cutting board and cut almost completely in half lengthwise, leaving the two long pieces attached by a half inch at one end. Curl one side of the fillet into a circle, skin side out, and the other side of the fillet into a circle, flesh-side out; the two circles will be attached in the middle and the fish will look something like a pair of glasses - two circles with a bridge in the middle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a metal spatula, carefully place each of these formed fillets into a buttered deep skillet. Fill each of the circles of fish with a mound of the chopped mushroom mixture. Place the skillet on the burner and carefully pour fish stock into the skillet, almost (but not quite) up to the top of the fish. Turn the heat to medium, cover the skillet and poach the fish for 10 minutes, or until the fish is cooked through; the fillets will look opaque. Watch the liquid so that it barely simmers. Remove the fish with a slotted spatula to a warm serving platter or warm individual appetizer or dinner plates. Keep warm until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish is poaching, make the beurre blanc sauce. In a heavy medium-size saucepan, simmer the vinegar and wine with the remaining three tablespoons of shallots over a medium-low heat until nearly all of the liquid is evaporated. Add the cream and heat, stirring, for one minute. Whisk in the butter cubes, a few at a time, until all of the butter is incorporated and the sauce has the consistency of light cream. Season with salt and pepper and a dash of Sherry vinegar, if desired. Strain the sauce, if desired. If not using this sauce right away, it will keep warm in a thermos for up to two hours without separating."}]}