{"@context": "http://schema.org", "@type": "Recipe", "name": "Frito Misto Of Artichokes And Fennel", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT50M", "recipeYield": "4 appetizer servings", "recipeCuisine": "italian", "recipeCategory": "project", "keywords": "appetizer, artichoke, fennel, lemon juice, fall", "aggregateRating": null, "recipeIngredient": ["Juice of 1 lemon", "12 small artichokes", "1 bulb fennel, trimmed", "1/4 cup thinly shaved Parmesan cheese", "1 clove garlic, crushed and finely chopped", "2 tablespoons finely chopped flat-leaf parsley", "2 quarts vegetable or canola oil", "1 cup milk", "1/2 cup flour", "Olive oil, for sprinkling", "1 lemon, cut into quarters", "Kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large bowl with water, and add lemon juice. Peel away outer leaves of artichokes, leaving tender pale green leaves. Peel stems, and cut off spiny tops of leaves. Cut lengthwise into quarters. Immediately add artichokes to water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice fennel bulb in half through the root. Slice each half crosswise, about 1/4 inch thick. Slices should be half-moon shapes. Place fennel in a medium bowl, and set aside. In a small bowl, combine cheese, garlic and parsley. Toss gently to mix."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large deep pan, heat oil over medium-low heat to 275 degrees. Drain artichokes, and dry completely with a dish towel. Add artichokes to oil, and cook until they begin to open and brown. Remove from pan, and let drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise heat to medium-high or 350 degrees. Pour milk over fennel, and place flour in a medium bowl. Strain fennel, then toss lightly in flour to coat. Drop fennel and artichokes into oil, and fry until golden brown and crispy. Using a strainer, remove from oil and place on a plate lined with paper towels. Let drain for 30 seconds, then transfer to a large bowl. Sprinkle parsley mixture and a little olive oil over artichoke mixture. Season with salt. Toss briefly to combine ingredients. Transfer to a serving bowl or platter, with lemon wedges."}]}