{"@context": "http://schema.org", "@type": "Recipe", "name": "Chilaquiles", "description": "", "author": {"@type": "Person", "name": "Regina Schrambling"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "Four servings", "recipeCuisine": "mexican", "recipeCategory": "dinner", "keywords": "green chili, tomatillo, tortilla, main course, summer", "aggregateRating": null, "recipeIngredient": ["1 pound mild to hot green chilies (Anaheim or poblano)", "1 pound fresh tomatillos", "3 tablespoons olive oil", "1 medium onion, peeled and finely diced", "3 cloves garlic, peeled and minced", "1 cup chicken or beef broth, homemade if possible", "1 1/2 teaspoons ground cumin", "1 teaspoon oregano", "Salt and freshly ground black pepper to taste", "2 cups corn oil", "12 corn tortillas", "8 eggs", "Dash of Tabasco", "2 tablespoons sour cream, plus sour cream for garnish", "2 tablespoons butter", "1/4 cup chopped fresh cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on the broiler. Line a broiler pan with foil. Arrange the chilies in a single layer on the pan. Place under the flame and roast, turning frequently, until the peppers are charred and blistered on all sides. Transfer to a brown paper bag, seal and let stand until cooled. Slide off the skins and remove the seeds. Dice the pulp."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lower the oven temperature to 200 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tomatillos in a heavy skillet large enough to hold them all in a single layer. Toast over medium heat, turning often, until they start to soften and turn brown. Cool, then remove the husks and chop the pulp. (For esthetic reasons, you may want to scrape off the black parts of both the chilies and the tomatillos, although they won't affect the taste.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large heavy skillet over a medium-low flame. Add the onions and garlic and saute, stirring occasionally, until very tender, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the tomatillos, chilies, broth, cumin and oregano. Blend well and simmer for 20 to 30 minutes, stirring occasionally. Season with salt and pepper to taste and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the corn oil in a small heavy skillet or saucepan until a thermometer registers 165 degrees. Cut the tortillas in half, then into strips about 1-inch across. Add the strips to the hot oil in batches and fry until crisp. Drain well on paper towels and hold in the oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Break the eggs into a mixing bowl and add the Tabasco, salt and pepper and the 2 tablespoons of sour cream. Beat until completely blended. Melt the butter in a skillet and pour in the eggs. Cook, stirring, until the eggs are fluffy but set."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, lay a handful of tortilla strips on each of 4 serving plates. Top with a generous spoonful of chili sauce, then another layer of strips and another spoonful of sauce (you should have more sauce than tortillas). Arrange a portion of scrambled eggs either alongside or on top. Garnish with a little sour cream and a sprinkling of cilantro and serve at once, with refried beans if you like."}]}