{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Fish on Kale", "description": "Many home cooks are comfortable with spinach but are intimidated by the unfamiliar variety of other cooking greens: chard, mustard, turnips, collards, kale and more. But it doesn't matter much which you include in a given dish: they're all good, and they all cook quickly. This preparation is dead easy. You first steam the kale with butter (you could use olive oil, but here it just isn't the same), white wine (water is almost as good) and garlic, until it's just about done. At that point you top the greens with a fillet or two of white fish and continue to steam until the fish is cooked through. Timed correctly, the greens will be tender and bright green and the fish moist. The juices from both will have combined with the butter, wine and garlic to produce a sauce that is great with rice or bread.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2016/12/20/dining/20COOKING-STEAMEDFISH1/20COOKING-STEAMEDFISH1-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, seafood", "keywords": "cod, extra virgin olive oil, kale, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 258}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 258, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "2 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "1 gram", "proteinContent": "31 grams", "saturatedFatContent": "2 grams", "sodiumContent": "510 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 medium bunch kale, collards or other greens, about a pound", "1/2 cup dry white wine (or water)", "1 or 2 cloves garlic, peeled and lightly smashed", "3 tablespoons butter or extra virgin olive oil", "Salt and pepper", "1 1/2 pounds skinless white fillet, like cod, halibut, hake, whiting, red snapper or sea bass"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash greens and shake dry, allowing some water to cling to leaves. Cut into rough sections, 3 or 4 inches long; cut off and discard any stems thicker than 1/4-inch."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put greens in a deep skillet that can be covered, along with wine, garlic, half the butter, and some salt and pepper. Turn heat to medium-high, cover and cook, checking occasionally to make sure mixture does not dry out, until greens are just about tender, 10 minutes or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put fish on top of greens, season with salt and pepper, and dot with remaining butter. Re-cover, and cook until fish is done and greens fully tender, 5 to 10 minutes more."}]}