{"@context": "http://schema.org", "@type": "Recipe", "name": "Classic Strawberry Tart", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT6H", "recipeYield": "6 servings", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "dessert, side dish, pastry cream, strawberry, tart pastry, spring", "aggregateRating": null, "recipeIngredient": ["Pastry cream (<a href=\"http://cooking.nytimes.com/recipes/8473-florence-fabricants-pastry-cream\">see recipe</a>)", "Sweet tart pastry (<a href=\"http://cooking.nytimes.com/recipes/8474-sweet-tart-pastry\">see recipe</a>)", "1 1/2 to 2 pints ripe strawberries, as uniform in size as possible", "1/3 cup heavy cream", "1/3 cup red currant jelly", "1 tablespoon kirsch"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the pastry cream, and refrigerate it for at least 4 hours, until cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pastry cream is chilling, prepare and bake the tart pastry, setting it aside, at room temperature, to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sort the strawberries. You will need about 1 1/2 pints, or 20 ounces, to cover the tart. Rinse the berries, remove the hulls, then place them, cut-side down and not touching, on a layer of paper towel on a tray so they can dry completely. If needed, use a hair dryer on a gentle cool setting to make sure the berries are dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Whip the heavy cream until stiff. When the pastry cream is thoroughly chilled, remove it from the refrigerator and fold in the whipped cream until completely incorporated. Spread this mixture over the bottom of the baked tart shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the berries on the cream in concentric circles as close to each other as possible. The berries should sit on top of the cream, so don't push them down into it. Refrigerate the tart."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the jelly and the kirsch in a small saucepan, and cook over medium heat until the jelly has melted and starts to bubble. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the tart from the refrigerator, and using a pastry brush, glaze the berries with the warm jelly mixture, giving them a thin but complete coating. Serve at once, or refrigerate -- but not more than a couple of hours, to prevent the pastry from becoming soggy -- until ready to serve. Remove the ring from the pan before serving."}]}