{"@context": "http://schema.org", "@type": "Recipe", "name": "Crescents With Pecorino Romano Cheese", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "About 30 crescents", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "appetizer, side dish, citrus, pecorino romano, roll dough, winter", "aggregateRating": null, "recipeIngredient": ["2 1/2 cups all-purpose flour", "1/2 teaspoon kosher salt", "3 tablespoons sugar", "1 cup cold unsalted butter, cut into small pieces", "2 egg yolks", "2 tablespoons ice water", "1 tablespoon brandy", "2 tablespoons white wine", "1/2 cup freshly grated pecorino Romano cheese", "Grated rind of 1 orange", "Grated rind of 1 lemon", "Small pinch grated nutmeg", "1 tablespoon brandy", "2 egg whites", "2 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. To make the dough, place the flour, salt and sugar in a food processor and pulse to combine. Add the butter and pulse until mixture resembles coarse meal. Whisk together the egg yolks, water, brandy and wine. Add to the flour mixture and pulse until dough begins to come together. Press the dough together, flatten into a disk, wrap in plastic and chill for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the filling, place the cheese in a medium bowl and stir in the orange and lemon rinds, the nutmeg and brandy. Whip the egg whites until they hold soft peaks. Gradually add the sugar and whip until stiff. Stir half of the egg whites into the cheese mixture. Fold in the remaining whites. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the dough in half. Roll out 1 piece of dough on a lightly floured surface to the thickness of a coin. With a 3-inch-round cookie cutter or glass, cut out as many rounds as possible. Brush the rim of each round with water and place a rounded teaspoon of filling in the center of each. Fold the dough around the filling to form a crescent and pinch the edges to seal them tight. Divide between 2 lightly floured baking sheets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Repeat with the remaining dough and filling, rerolling the scraps if necessary to use up all the filling. Bake until the crescents turn a pale blond color, about 8 minutes. Let cool. Serve with a chilled dry white wine."}]}