{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Pot-au-Feu", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Four servings", "recipeCuisine": "french", "recipeCategory": "dinner, project", "keywords": "lobster, red snapper, white fish, main course, summer", "aggregateRating": null, "recipeIngredient": ["8 cups water", "2 1 1/2-pound lobsters", "2 cups white wine", "2 stalks fresh lemon grass, smashed and cut into 2-inch pieces", "6 medium red potatoes", "3 medium carrots, peeled", "2 teaspoons Vietnamese fish sauce (nuoc mam)", "3 small scallions, halved lengthwise and cut crosswise into thirds", "4 red snapper fillets, skinned and cut into 1 1/2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 2 cups of water to a boil in a large, wide pot. Add the lobsters, cover and steam for 10 minutes. When cool enough to handle, remove the tail and claw meat and set aside. Place the shells back in the pot. Add 6 cups of water, the wine and lemon grass and bring to a boil. Reduce heat and simmer for 30 minutes. Strain through a fine-mesh sieve and place in a large saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, quarter the potatoes. Turn each potato quarter by carving it with a paring knife into a football shape about 1 1/4-inches long, ideally with 7 sides. As you finish each one, drop them into a bowl of water. Use a channel knife to cut 4 evenly spaced grooves down each carrot. Cut the carrots across into 1/8-inch-thick slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the broth to a boil and stir in the fish sauce. Drain the potatoes and add them to the broth with the carrots. Reduce the heat and simmer until tender, about 10 minutes. Add the scallions and snapper, adjust the heat so the broth is at a slow simmer and cook until the fish is just cooked, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Split the lobster tails in half. Ladle the soup among 4 bowls. Garnish each with half a lobster tail and 1 claw and serve immediately."}]}