{"@context": "http://schema.org", "@type": "Recipe", "name": "Kaffir Lime Meringue Cakes With Lime-Scented Papaya", "description": "Meringue has long been a byproduct of other desserts, an economical way to use up leftover egg whites. This recipe comes from Pichet Ong, the former pastry chef at Spice Market. \n\nMr. Ong whipped egg whites with a small amount of confectioners’ sugar and powdered kaffir lime leaves (made by drying them in the microwave, then mashing them through a sieve). He opted for small, loose piles of meringue and used a spoon to form a well at the center, as you would for mashed potatoes, and baked them using the same method as the torte. Into the well he spooned a tart lime custard (which he also makes in the microwave — he likes the microwave) and a papaya salad seasoned with Thai chilies and crunchy flakes of Maldon sea salt. “The sweetness is not a problem when your palate is pulled in different directions,” he added.\n\nThe meringue cushions all of the strong flavors, and the leftover egg yolks are used in the custard. Home economists, you may sleep soundly.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/05/29/dining/Kaffir-Lime-Meringue/Kaffir-Lime-Meringue-articleLarge.jpg", "totalTime": "PT4H15M", "recipeYield": "Serves 6", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "dessert, lime, meringue, papaya, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 355, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "8 grams", "sodiumContent": "482 milligrams", "sugarContent": "48 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup confectioners' sugar", "4 large eggs, separated", "1/4 teaspoon cream of tartar", "1 cup sugar", "3/4 teaspoon vanilla extract", "1/2 cup plus 1 1/2 tablespoons lime juice", "1/2 cup heavy cream", "1/2 teaspoon salt", "2 tablespoons butter", "1 1/2 cups finely diced (1/4 inch) papaya", "1 teaspoon lime zest", "1/4 teaspoon minced Thai chili", "Maldon sea salt", "4 fresh kaffir lime leaves or the finely grated zest of 1 lime"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Line a baking sheet with parchment paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the kaffir lime leaves or lime zest in a bowl, and microwave for 30 seconds. Repeat until the leaves are curled and brittle or the zest is dry and crumbly. Finely chop the leaves, if using. Set aside a large pinch of chopped leaves or zest, then sift the remaining leaves or zest with the confectioners' sugar, pushing them through the sifter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixer, whisk the egg whites on medium speed until they form soft peaks. Add the cream of tartar, then gradually add 1/2 cup of the sugar and continue whisking until the peaks are firm and glossy. By hand, fold in 1/4 teaspoon of the vanilla and the confectioners'-sugar mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop 6 grapefruit-size dollops of meringue onto the baking sheet. Create a well in the center of each mound. Press the remaining kaffir lime leaves (or lime zest) through a sifter to dust the meringue tops. Put the baking sheet in the oven, close the door and turn off the heat. Leave for 4 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the top of a double boiler set over simmering water, whisk together 1/2 cup lime juice, 1/2 cup sugar, cream, egg yolks, salt and 1/2 teaspoon vanilla until the mixture is thick enough to coat the back of a spoon. Remove from heat, and whisk in the butter. Cover and cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, mix the papaya, remaining lime juice, 1 teaspoon lime zest and chili. Place a meringue on each of 6 plates. Spoon about 1 1/2 tablespoons custard into the well of each meringue, and top with papaya. Sprinkle with a pinch of Maldon sea salt."}]}