{"@context": "http://schema.org", "@type": "Recipe", "name": "Thomas and Cheryl Etheredge's Beef Brisket", "description": "This recipe requires an oven with a top broiler.", "author": {"@type": "Person", "name": "Sandra Ballentine"}, "image": null, "totalTime": "P1DT22H30M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "beef brisket, cider vinegar, salt, main course, winter", "aggregateRating": null, "recipeIngredient": ["3 tablespoons cider vinegar", "3 tablespoons liquid smoke", "1 5- to 6-pound brisket", "2 tablespoons seasoned salt", "Your favorite barbecue sauce"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the vinegar and liquid smoke in a cup and pour into a large, shallow glass baking dish. Add the brisket and turn to coat with the seasoning liquid. Sprinkle the brisket with the salt and rub it into the meat on all sides. Cover the dish tightly with foil and marinate the brisket in the refrigerator for 12 hours, turning it every 4 hours or so."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Line a large, shallow roasting pan with foil; place the brisket in the pan along with the marinade. Place the covered pan of brisket on the center rack of the oven and roast for 2 1/2 hours, turning the brisket every 20 to 30 minutes using tongs with rounded edges (not spiked edges), and not a fork. You may need to have help turning the brisket as it becomes more tender and juicy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pan from the oven. Transfer the brisket to a plate; pour the cooking liquid into a glass measure."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, shallow roasting pan on the bottom oven rack to catch drippings, and position another oven rack directly above it. Remove any other oven racks. Pour enough water in the roasting pan to cover the bottom so that the drippings won't smoke."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the broiler (the heat source should be about 8 inches above the brisket). Carefully lift the brisket from its roasting pan, and place it directly on the oven rack above the shallow roasting pan. Broil the brisket for 1 hour, turning it and basting with the cooking liquid every 10 to 15 minutes. The meat should be very tender at this point, and you will need to reach well into the brisket to turn it; do not just grab it at the edges."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the brisket back in the glass baking dish, and let it cool. Cover the brisket and the remaining basting liquid tightly with plastic wrap and refrigerate for 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. Slice the brisket and return it to the baking dish. Pour remaining liquid over the meat and cover with foil. Bake for 20 to 30 minutes, until hot. Serve with your favorite barbecue sauce."}]}