{"@context": "http://schema.org", "@type": "Recipe", "name": "Schrafft's Lobster Thermidor", "description": "In this French dish, the meat of the lobster is cooked in a creamy mustard sauce then returned to its shell for baking. This recipe is adapted from the version that was served at Schrafft's, an upscale chain of restaurants popular in the northeast in the first half of the twentieth century.\n\nFrank G. Shattuck opened its first location on Broadway in 1898.\n\n''It was a much more genteel time then,'' his great-grandson Frank M. Shattuck said. ''Everyone wore hats and hand-made suits. And if you were a lady, it was safe to sit at the soda fountain and drink gin from a teacup.''\n\nFrank M. has never been in the restaurant business; he is an actor and a tailor specializing in dashing $5,000 suits. One day in 1980 he went into the last remaining Schrafft's -- ''It wasn't really a Schrafft's, just a pizza place with a dirty old sign'' -- and made off with 2,500 recipes from the safe. ''I asked the guy if it was O.K. to take them, and he said yes, and a week later I sent him a bottle of Jack Daniel's.''", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "chicken stock, lobster, mushroom, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 865, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "2 grams", "proteinContent": "105 grams", "saturatedFatContent": "24 grams", "sodiumContent": "2761 milligrams", "sugarContent": "5 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 cooked lobsters, about 1 1/4 pounds each", "6 tablespoons butter", "1 minced shallot", "1 tablespoon lemon juice, plus more to taste", "3/4 teaspoons paprika", "Pinch cayenne", "Salt and pepper to taste", "6 ounces small white button mushrooms, sliced", "3 tablespoons flour", "1 1/4 teaspoons powdered mustard", "1 1/2 cups chicken stock or mild seafood stock, or a combination", "2/3 cup heavy cream", "1/2 cup grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 450 degrees. Split lobsters down the middle and remove and reserve meat from tail and claws. Discard everything from the head and remove the front legs, without detaching the cartilage that holds the head and tail together. Rinse and dry shells and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut reserved meat into 1/2-inch dice. Sauté in 2 tablespoons butter, add shallot, lemon juice, paprika and cayenne until warmed through. Season with salt and pepper. In another pan, sauté mushrooms in 2 tablespoons butter until tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside mushrooms and lobster meat. Melt the remaining butter in the pan the lobster was cooked in. Stir in the flour and mustard and cook for 2 minutes. Slowly whisk in the stock, then the cream, stirring constantly, until thickened, about 5 minutes. Add the lobster and mushrooms and cook 2 more minutes. Season with salt, pepper and lemon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon mixture into the shells, sprinkle with cheese and bake until the cheese is lightly browned, 10 to 12 minutes. Serve immediately."}]}