{"@context": "http://schema.org", "@type": "Recipe", "name": "The Silver Palate’s Chocolate Cake", "description": "This recipe is adapted from “The Silver Palate Cookbook,” written by Sheila Lukins and Julee Rosso, who through their store in Manhattan, the Silver Palate, introduced bisteeya and poppy-seed dressing to the Upper West Side. For many, their cookbook, originally published in 1982, was a book of revelations: even if you hadn’t mastered the art of French cooking, a meal of chicken Marbella and an indulgent dessert, cooked with confidence, was not beyond your grasp. Enter this decadent chocolate cake, whose title belies its incredible simplicity. The ingredients take hardly any time to whip together, and it bakes in a tube pan for under an hour. Gild it with a gooey chocolate frosting, and feed it to those you love with good cheer.", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/01/23/dining/recipes-decadentchocolatecake/recipes-decadentchocolatecake-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "chocolate, vanilla, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1657}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 472, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "66 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "13 grams", "sodiumContent": "158 milligrams", "sugarContent": "48 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup (1 stick) unsalted butter, plus extra for greasing pan", "1 3/4 cups plus 2 tablespoons unbleached all-purpose flour, plus extra for flouring the pan", "3 ounces unsweetened chocolate", "1 teaspoon vanilla extract", "2 cups sugar", "2 eggs, separated", "1 teaspoon baking soda", "1/2 cup sour cream", "1 teaspoon baking powder", "2 tablespoons unsalted butter", "3/4 cup semisweet chocolate chips", "6 tablespoons heavy cream", "1 cup sifted confectioners' sugar", "1 teaspoon vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Butter and flour a 10-inch tube pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the chocolate and butter into small pieces and place in a large bowl. Pour 1 cup boiling water over them; let stand until melted. Stir in the vanilla and sugar, then whisk in the egg yolks, one at a time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix the baking soda and sour cream and whisk into the chocolate mixture. Sift the flour and baking powder and add to the batter, mixing thoroughly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the egg whites until stiff but not too dry. Stir a quarter of the egg whites thoroughly into the batter. Gently fold in the remaining whites."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan. Set on the center rack of the oven and bake until a cake tester inserted into the center comes out clean, 40 to 50 minutes. Cool in the pan for 10 minutes, unmold and cool completely before frosting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the frosting: Place all the ingredients in a heavy saucepan over low heat and whisk until smooth. Spread on the cake while the frosting is still warm."}]}