{"@context": "http://schema.org", "@type": "Recipe", "name": "Pho Bo", "description": "During the Vietnam War, the Vietcong's unsporting habit of cutting the roads that connected Saigon with the countryside meant that only a pathetic trickle of first-class produce reached the capital, and that, in turn, meant that the sophisticated Vietnamese dishes that you eat today, there or elsewhere in the world, were out of reach. Somehow, though, there was always plenty of pho, the restorative, anise-scented beef or chicken noodle soup, delivered to your door for breakfast by frail-looking vendors, and that was ample compensation.", "author": {"@type": "Person", "name": "R. W. Apple Jr."}, "image": null, "totalTime": "PT2H30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, project, soups and stews", "keywords": "beef chuck roll, beef marrow, ginger, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 516, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "4 grams", "proteinContent": "14 grams", "saturatedFatContent": "2 grams", "sodiumContent": "239 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["5 pounds beef marrow or knuckle bones", "2 pounds beef chuck, cut into 2 pieces", "2 3-inch pieces ginger, halved lengthwise and lightly bruised with the flat side of a knife", "2 yellow onions, peeled", "1/4 cup fish sauce, plus more to taste", "3 ounces rock sugar or 3 tablespoons sugar", "10 whole star anise, lightly toasted in a dry pan", "6 whole cloves, lightly toasted in a dry pan", "1 tablespoon sea salt", "1 pound dried rice sticks, 1/16 inch wide", "1/3 pound beef sirloin, slightly frozen, then sliced paper thin across the grain", "1/2 yellow onion, thinly sliced", "3 scallions, thinly sliced", "1/3 cup chopped cilantro", "1 pound bean sprouts", "10 sprigs Thai basil", "1 dozen saw-leaf herb leaves (optional)", "6 Thai bird chiles or 1 Serrano chili, very thinly sliced", "1 lime, cut into 6 wedges", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare the broth:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large stockpot, bring 6 quarts water to a boil. Place the bones and beef in a second large pot, and cover with water. Bring to a boil. Char the ginger by holding each piece with tongs directly over the stove burner on high heat. Char until lightly blackened and fragrant, 3 to 4 minutes. Char the onions in the same way. Peel and discard the blackened skins of the ginger and onions, then rinse and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Vigorously boil the meat for 5 minutes, then transfer the bones and beef to the other pot of boiling water. Discard the water in which the meat first cooked. (This cleans the bones and meat and reduces the impurities that can cloud the broth.) When the water returns to a boil, reduce the heat to a simmer. Add the ginger, onions, fish sauce and sugar. Simmer until the beef is tender, about 40 minutes; occasionally skim the surface of any foam and fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove one piece of beef and submerge in cool water for 10 minutes (to prevent the meat from darkening and drying out). Drain, then cut into thin slices and set aside. Simmer the broth for another 50 minutes, then place the star anise and cloves in a spice bag, add to the broth and simmer for 30 minutes more. Remove and discard the spice bag and onions. Add the salt, and continue to simmer, skimming from time to time."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare the soup:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the noodles in cold water for 30 minutes. Bring a large pot of water to a boil and, working in batches, dip the noodles into the boiling water for 10 to 20 seconds, stirring to keep them from tangling. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, season the broth to taste with fish sauce, then bring to a rolling boil. Place about 2 cups of cooked noodles in each of six large preheated bowls. (If the noodles are not hot, dip them briefly in the simmering broth.) Place a few slices of the cooked and raw beef on the noodles, then ladle 2 to 3 cups broth into each bowl. The broth will cook the raw beef instantly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At the table, garnish with onions, scallions and cilantro. Invite guests to top the soup with bean sprouts, herbs, chilies, lime juice and black pepper."}]}]}