{"@context": "http://schema.org", "@type": "Recipe", "name": "Basic Chicken Soup", "description": "This recipe is adapted from “The Whole World Loves Chicken Soup” by our old colleague Mimi Sheraton. It was published in 1995. Practical and pragmatic in the technical aspects of soup making, Ms. Sheraton is an unabashed hedonist when it comes to serving and consuming it. \"Chicken soup must be very, very hot,\" she counsels. \"You want to have to inhale it, to take tiny sips at first and build, as the soup cools, to larger and larger bites. Near the end, you are racing to finish. Tepid soup is dead.\"        \n", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT3H", "recipeYield": "6 - 8 servings", "recipeCuisine": "", "recipeCategory": "one pot, soups and stews", "keywords": "chicken, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 60}, "recipeIngredient": ["1 5- to 6-pound chicken, with neck and all giblets except liver", "12 cups water, plus more as needed", "2 medium carrots, peeled and quartered", "3 stalks celery with leaves, cut in half", "1 medium yellow onion, with peel, cut in half", "3 sprigs Italian parsley", "10 black peppercorns", "2 small leeks, green and white parts, split and washed well, optional", "2 sprigs fresh thyme or 1/2 teaspoon dried, optional", "1 small bay leaf, optional", "5 whole cloves, optional", "2 to 3 teaspoons kosher salt", "Chopped fresh parsley or dill, for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken in a 6- to 7-quart soup pot and add the water (it should cover chicken). Cover the pot and bring to a boil. Uncover, reduce to a bare simmer and skim foam as it rises to the surface. When foam subsides, add remaining ingredients, using only 1 teaspoon of salt. Cook chicken, turning 2 or 3 times, until meat loosens from bone, about 2 1/2 hours. Add more water during cooking if chicken is not 7/8 covered. Add salt gradually, tasting the soup from time to time."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken, giblets and bones and set aside. Strain the soup through a fine sieve and discard vegetables. Either skim fat from soup if serving immediately or let cool thoroughly, then cover, refrigerate and skim fat when the soup is cold. Chicken can be pulled from the bones and reheated in the soup. Garnish with parsley or dill if desired."}]}