{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-Baked Whole Pompano With Parsley Oil", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "garlic, parsley, pompano, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "recipeIngredient": ["2 lightly packed cups parsley leaves", "3/4 cup extra-virgin olive oil", "1 whole pompano, about 2 pounds, cleaned and scaled, gills removed", "Freshly ground black pepper", "2 large sprigs rosemary", "1 clove garlic, peeled and smashed", "8 cups (3 pounds) kosher salt or coarse sea salt", "2 large egg whites", "Lemon slices for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the parsley oil, bring a saucepan 1/4 full of water to a boil and add the parsley. Cook just until the leaves turn bright green, about 30 seconds. Immediately drain and plunge the leaves into cold water to stop the cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the leaves again and wring out as much water as possible. Transfer parsley to a blender and add the olive oil. Blend until pureed. Transfer to bowl and refrigerate for at least 1 hour and up to 1 day. Strain the oil through a fine-mesh sieve, pressing on the solids to extract as much oil as possible. Discard solids and refrigerate the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the fish, preheat the oven to 400 degrees. Rinse and pat the pompano dry and season it inside and out with pepper. Place the rosemary and garlic inside the cavity. Place the salt in a large bowl. Whisk the egg whites together with 1/4cup water and pour it over the salt. Using your hands, distribute the liquid evenly through the salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Choose a baking dish just slightly larger than the fish and pour a half-inch layer of the salt into the bottom. Place the fish over it and pour the remainder of the salt over and around it, making sure that a good layer covers the fish on all sides. Bake the fish for 35 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fish from the oven. Wrap the head of a hammer in cloth and use the flat side to break the salt. Pull the salt away to expose the fish and gently lift it from the salt, brushing away any that adheres to the skin. Place the fish on a platter and peel back and discard the skin. Pour parsley oil over the fish, surround it with lemon slices and serve."}]}