{"@context": "http://schema.org", "@type": "Recipe", "name": "Sopa de Fideos (Mexican Chicken Noodle Soup)", "description": "This Mexican version of chicken noodle soup uses fideos, vermicelli or capellini for the noodles. It’s garnished with cilantro, green chiles, avocado and cheese.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "10 servings", "recipeCuisine": "mexican", "recipeCategory": "soups and stews", "keywords": "chicken, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "recipeIngredient": ["2 medium onions, peeled and chopped", "2 cloves garlic, peeled", "8 fresh tomatoes, peeled and seeded, or 6 large canned tomatoes, drained", "6 tablespoons melted lard or light olive oil", "Pinch powdered saffron, optional", "Pinch chili powder, optional", "1 recipe Basic Chicken Soup (<a href=\"http://cooking.nytimes.com/recipes/879-basic-chicken-soup\">see recipe</a>)", "Kosher salt and freshly ground pepper to taste", "1 1/2 cups diced cooked chicken breast meat", "1/4 pound Mexican fideos, vermicelli or cappellini, broken into 2-inch lengths", "Fresh cilantro sprigs", "Minced seeded hot green chilies", "Diced avocado", "Slivered Monterey Jack and/or grated Parmesan chees"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the onions, garlic and tomatoes in a food processor, adding a little water if needed. Heat 3 tablespoons of melted lard or oil in a large saucepan over medium heat. Slowly pour in the vegetable liquid, being careful to avoid spattering."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add saffron and chili powder, if using them. Simmer gently, partly covered, for 10 minutes. Add the chicken soup and simmer gently, partly covered, for about 20 minutes more. Season with salt and pepper and add the chicken, keeping the soup warm over very low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining oil in an 8-inch skillet over medium heat. When hot, add the noodles and saute, turning them gently, until golden brown. Remove with a slotted spatula and drain on paper towels. The soup can be prepared to this point up to 30 minutes before finishing and serving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the soup to a simmer. Add the noodles and cook until tender, about 7 to 8 minutes. Serve immediately, garnishing each portion with a sprig of cilantro. Pass the other garnishes at the table."}]}