{"@context": "http://schema.org", "@type": "Recipe", "name": "Coconut Poached Black Bass", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/05/29/dining/Coconut-Poached-Black-Bass/Coconut-Poached-Black-Bass-articleLarge.jpg", "totalTime": "PT1H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, project", "keywords": "black bass, coconut, lemongrass, main course, spring", "aggregateRating": null, "recipeIngredient": ["4 whole black bass, about 1 1/2 pounds each, cleaned and filleted, heads and bones reserved", "1 tablespoon extra virgin olive oil", "8 shallots, sliced", "10 Thai chilies, 6 sliced, 4 halved lengthwise", "5 garlic cloves, sliced", "2 lemon grass stalks, outer stems removed, cores halved and pounded", "1 cup ikan bilis", "6 pieces assam skin, rinsed well in cold water", "6 kaffir lime leaves", "5 Thai basil stems, leaves reserved for garnish", "5 Vietnamese coriander (rau ram) stems, leaves reserved for garnish", "4 cilantro roots, cleaned and trimmed", "3 tablespoons coriander seeds", "6-13 1/2-ounce cans coconut milk", "2 teaspoons salt, plus additional, to taste", "Freshly squeezed juice and grated zest of 1 lime, plus additional juice and zest to taste", "2 torch ginger petals, julienned, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse fillets, fish heads and fish bones well (there should be no blood) and pat dry. Refrigerate fillets until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In stock pot or Dutch oven, heat oil over medium heat. Add shallots, sliced chilies, garlic and lemon grass, and cook, stirring, until softened, about 5 minutes. Add fish heads and bones, ikan bilis, assam skins, 4 lime leaves, Thai basil stems, Vietnamese coriander stems, cilantro roots and coriander seeds and cook 2 to 3 minutes more. Stir in coconut milk and salt. Simmer, covered, for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain liquid into a bowl, wiping out pot. Add lime juice and zest to coconut mixture; taste and adjust seasoning if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange fillets back in the pot and cover with coconut milk mixture. Cook, covered, over low heat, until fish is opaque and just cooked through, 5 to 7 minutes. Meanwhile, remove stem and spine from remaining lime leaves and discard. Julienne leaves. Tear up reserved basil and coriander leaves. Divide fish among shallow bowls and ladle some coconut mixture on top. Garnish with halved chilies, julienned lime leaves, torn herbs and ginger, if desired."}]}