{"@context": "http://schema.org", "@type": "Recipe", "name": "Florence Fabricant's Penne With Artichokes And Mushrooms", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "artichoke, penne, shiitake, main course, spring", "aggregateRating": null, "recipeIngredient": ["6 large artichokes", "Juice of 1 lemon", "8 ounces shiitake mushrooms", "3 tablespoons extra-virgin olive oil", "3 cloves garlic, minced", "1 teaspoon fresh rosemary leaves", "Salt and freshly ground black pepper", "1 pound penne", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove and discard all the leaves of the artichokes and slice off the fuzzy choke, leaving only the thick, round fleshy bottom of each artichoke. Place the bottoms in a bowl and toss with the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bottoms from the lemon juice one at a time and with a sharp knife, cut each into slices a half-inch thick. Return the slices to the lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a saucepan of water to a boil, add the artichoke slices and simmer about five minutes, to blanch them. Drain and pat them dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the stems off the mushrooms and cut the mushrooms into slices a half-inch thick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy skillet. Add the garlic, cook for a few seconds, then add the mushroom and artichoke slices. Cook over medium-high heat about 10 minutes, until the vegetables are lightly browned. Stir in the rosemary and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to a boil, cook the penne until al dente, about seven minutes. Drain well, then add to the skillet with the vegetables. Toss, check seasonings and serve at once with Parmesan cheese."}]}