{"@context": "http://schema.org", "@type": "Recipe", "name": "Fennel Confit With Kalijira Rice And Olives", "description": "", "author": {"@type": "Person", "name": "Charlie Trotter"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fennel, olives, rice, side dish, spring", "aggregateRating": null, "recipeIngredient": ["3 shallots", "2 3/4 cups plus 1 tablespoon extra virgin olive oil", "2 small bulbs fennel, trimmed", "3 cloves garlic", "2 bay leaves", "2 sprigs thyme", "2 teaspoons red wine vinegar", "1 teaspoon sugar", "1 cup kalijira, jasmine or Basmati rice", "Salt and freshly ground black pepper", "1 tablespoon butter", "1/4 cup pitted calamata olives, slivered lengthwise", "1 tablespoon whole-grain mustard", "1 1/2 teaspoons Dijon mustard", "1 teaspoon white-wine vinegar", "1 tablespoon balsamic vinegar", "2 tablespoons vegetable broth"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 250 degrees. Peel 2 shallots and place in a small baking dish. Add 1/2 cup olive oil and set aside. In a small deep baking dish, combine fennel, 2 unpeeled garlic cloves, bay leaves, thyme and 2 cups oil. Cover both dishes. Bake shallots until tender, about 1 hour. Bake fennel until very tender, about 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When shallots are baked, drain on paper towels and transfer to baking sheet. Sprinkle with red-wine vinegar and sugar, and return to oven until dry, 2 to 3 minutes. When fennel has baked, remove from heat and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel and mince remaining shallot and remaining clove garlic. Place a saucepan over medium-low heat. Heat 1 tablespoon oil, and add minced shallot and garlic. Saut&#233; until translucent, about 3 minutes. Rinse and drain rice and add to pan. Stir until thoroughly coated with oil. Add 1 1/4 cups water and a pinch of salt. Bring to a boil. Cover and reduce heat to low. Simmer until water is absorbed, 10 to 15 minutes. Remove from heat and let stand covered for a few minutes. Chop roasted shallots. Fluff rice with a fork, and fold in roasted shallots, butter and olives. Keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While rice cooks, prepare vinaigrette: In a small bowl, whisk together whole-grain mustard, Dijon mustard, white-wine vinegar, balsamic vinegar and broth. Slowly whisk in remaining 1/4 cup oil. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, cut each fennel bulb into quarters. Divide rice among four plates, and place two pieces of fennel on each plate. Drizzle vinaigrette over and serve."}]}