{"@context": "http://schema.org", "@type": "Recipe", "name": "Pumpkin, Sage, Chestnut And Bacon Risotto", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H50M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "fall, main course, pumpkin, rice, sage", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 703, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "5 grams", "proteinContent": "21 grams", "saturatedFatContent": "17 grams", "sodiumContent": "1025 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 small sweet cooking pumpkin or butternut squash, peeled, about 2 1/2 pounds", "Olive oil", "1 tablespoon coriander seeds", "Sea salt and ground black pepper", "12 slices bacon or pancetta", "2 ounces shelled chestnuts (vacuum packed are fine)", "15 fresh sage leaves", "4 cups chicken stock or canned broth", "3 shallots, peeled and finely chopped", "5 small stalks celery, finely chopped", "1 cup arborio rice", "1/2 cup dry white wine or dry white vermouth", "4 tablespoons butter", "3/4 cup freshly grated Parmesan cheese, plus more for serving", "About 1 cup mascarpone, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Halve pumpkin lengthwise, and remove seeds; rinse seeds, drain, and reserve. Cut pumpkin lengthwise into thick slices, and spread in a layer across a large baking sheet. (If using squash, cut into quarters.) Sprinkle pumpkin with olive oil, and set aside. Using a mortar and pestle, pound the coriander seeds until crushed. Sprinkle over pumpkin along with salt and pepper, and bake until soft, about 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pumpkin from oven (leave oven on), and spread bacon over it. In a small bowl, combine reserved seeds, chestnuts, sage and salt and pepper to taste. Add tablespoon olive oil, and mix well. Sprinkle over pumpkin and bacon. Place back in oven until bacon is crisp, 10 to 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pumpkin from oven. Scrape bacon, chestnuts, sage and pumpkin seeds onto a small plate; reserve. Finely chop about half the pumpkin. Chop other half so that it is slightly chunky; reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken stock in a small pan over medium-low heat. Bring to a simmer, then reduce heat to very low to keep warm. Place a large saucepan over medium heat, and add tablespoon olive oil, shallots, celery and a pinch of salt. Stir, cover, and cook for 3 minutes. Increase heat to medium-high, and add rice. Stir constantly until rice is translucent, 2 to 3 minutes. Stir in wine until it is absorbed, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin adding broth to rice, a ladleful at a time, stirring constantly. Allow each ladleful to be absorbed before adding next; process will take about 20 minutes. When ready, rice will be soft with a slight bite. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove rice from heat. Add chopped pumpkin, and stir vigorously until mixed; fold in pumpkin chunks. Mix in butter and Parmesan. Place a lid over the saucepan, and let sit for 2 minutes. To serve, place a portion on each of 6 serving plates. Top each portion with crumbled bacon, and sprinkle with mixture of chestnuts, sage and pumpkin seeds. Add a dash more cheese. Garnish each plate with a dollop of mascarpone if desired, and serve immediately."}]}