{"@context": "http://schema.org", "@type": "Recipe", "name": "Postrio's Lobster With Curry Risotto", "description": "", "author": {"@type": "Person", "name": "Linda Wells"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "Four servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "curry, lobster, rice, fall, main course", "aggregateRating": null, "recipeIngredient": ["2 1 1/2-pound lobsters", "8 tablespoons olive oil", "1 cup chopped green onions", "5 large cloves garlic, sliced", "1 cup sliced ginger root", "1/4 cup curry powder", "1 teaspoon red chili flakes", "1 cup plum wine", "1 cup Port", "14 ounces, plus 4 cups, chicken stock, preferably homemade", "1 cup heavy cream", "Salt and freshly ground pepper to taste", "1 small carrot, diced fine", "1 stalk celery, diced fine", "1 small onion, diced fine", "Pinch of saffron", "1 1/2 cup white wine", "2 cups Arborio rice", "4 tablespoons butter", "1/2 cup Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a pot large enough to hold two lobsters with water and bring to a boil. Add the lobsters and cook for 5 minutes. Drain and remove the lobsters, letting them cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate the claws and the tail from the body. Remove the intestines. Chop the body into quarters and cut the tail into 4 medallions, leaving it in the shell."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large sauce pot, heat 4 tablespoons of the olive oil over medium heat. Add the lobster bodies and saute for 4 minutes until lightly browned on all sides. Add the green onions, garlic and ginger and saute until the onion is wilted. Add the curry powder and chili flakes and stir for 2 minutes. Pour in the plum wine and Port, stirring to disloge any bits that stick to the pan. Cook over high heat until the liquid reduces by half. Add the 14 ounces of chicken stock and reduce by half again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Press the sauce through a strainer, getting all the juices from the lobster and vegetables. Discard the lobster and vegetables. Pour the sauce into a medium-sized pot and heat over medium heat. Add the cream and reduce until it coats the back of a spoon. Season the sauce with salt and pepper to taste. Keep the sauce warm while making the risotto."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 2-quart saucepan, heat 2 tablespoons of the olive oil over medium heat. Add the vegetables and saute over until medium-tender. Add the saffron and wine and reduce by half. Add the rice and 1/4 cup of the chicken stock. Stir constantly until the liquid is absorbed. Repeat the procedure, adding 1/4 cup of chicken stock at a time, until all the liquid is absorbed. The rice should be al dente. If you prefer the rice cooked more, just add more liquid. Finish by stirring in the butter and Parmesan cheese."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a pan large enough to saute all the lobster. Add 2 tablespoons of olive oil and the lobster. Cook only long enough to reheat the lobster, about three minutes. Add the sauce to the pan and stir in 2 tablespoons of butter. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, divide the risotto among four serving plates and arrange the lobster around the risotto. Pour the sauce over the lobster."}]}