{"@context": "http://schema.org", "@type": "Recipe", "name": "Frankies Spuntino Pork Braciole", "description": "Frank Castronovo and Frank Falcinelli, who own the Frankies Spuntino restaurants in New York, prefer to keep it mellow. \"I cooked on the line for 18 years,\" Mr. Falcinelli told The Times. Mr. Castronovo, equally low-key, said, \"We like to take the easy approach.\" That means many of their dishes, like vegetable antipasti, grilled meats and wine-stewed prunes, are cooked well ahead and assembled to order or served at room temperature. In this version of braciola, the meat rolls are covered with canned tomatoes that become sauce as the meat cooks. \"My grandfather calls it gravy,\" Mr. Falcinelli said. \"For the Sunday sauce, you do spareribs, sausage, meatballs, braciola.\" The Franks’ version is lighter, meant to be eaten with salad and bread, not steaming pasta. Leftovers are good for sandwiches the following day.", "author": {"@type": "Person", "name": "Dana Bowen"}, "image": "https://static01.nyt.com/images/2014/05/29/dining/Pork-Braciola/Pork-Braciola-articleLarge-v2.jpg", "totalTime": "PT4H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "fall, garlic, pork, tomato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 115}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 825, "unsaturatedFatContent": "35 grams", "carbohydrateContent": "15 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "6 grams", "proteinContent": "60 grams", "saturatedFatContent": "19 grams", "sodiumContent": "1393 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["3 pounds pork braciola cutlets (sliced from the shoulder and pounded into six 6-by-8-inch pieces about 1/4 inch thick)", "Salt and white pepper to taste", "2 tablespoons minced garlic, plus 8 to 10 large whole cloves", "2/3 cup chopped flat-leaf parsley", "1 cup grated Parmigiano-Reggiano cheese (more for serving)", "1 cup grated aged provolone", "2 28-ounce cans whole peeled San Marzano tomatoes, plus an extra can in case more sauce is needed", "1/4 cup olive oil", "1/4 cup grape seed oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Line cutlets up on a clean work surface with the shorter sides on top and bottom (seam side up, if made from a butterflied cut). Season with salt and pepper, and sprinkle with minced garlic, parsley and cheeses. Roll a cutlet into a tight log. Stretch butcher's twine along the length of the roll; wrap string tightly around one end and continue wrapping to the other end, each turn an inch from the previous one; tie loose ends. Repeat with remaining braciola."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Empty two cans of tomatoes into a mixing bowl. Use your fingers to break tomatoes apart, and discard firm cores and tops. Pour half the sauce into a deep-sided roasting pan. Season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large skillet over medium-high heat, and add oils. When oils are hot but not smoking add braciola and sear, rotating every minute or so, until browned all over. Reduce heat to medium, add whole garlic cloves and sauté 2 to 3 minutes. Transfer braciola to roasting pan, allowing garlic to continue cooking until golden. Add a cup of remaining sauce to skillet, and scrape browned bits from bottom; shut off heat, and pour over braciola. Add remaining sauce to braciola, completely covering braciola. (If there isn't enough sauce, use another can of tomatoes.) Cover tightly with foil, and bake until tender, from 1 to 3 hours. Check frequently for doneness."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Snip twine off braciola. Arrange, whole or sliced, on a platter, drizzle with some sauce and transfer remaining sauce to a serving bowl. Serve hot or at room temperature. Garnish with Parmigiano-Reggiano."}]}