{"@context": "http://schema.org", "@type": "Recipe", "name": "Icelandic Lamb Loins", "description": "Icelanders eat lamb at an impressive annual rate, as Jason Epstein noted in his 2002 Times magazine article. While there, he and his friends prepared a few pounds of lamb loin, browning them in butter and finishing them in the oven. “It was an evening I shall never forget,” he wrote, “and one that I have since recreated many times, omitting the sugary potatoes and adding a dab of rosemary-infused demi-glace in a red-wine reduction to the lamb.” He shares that recipe here, and while he recommends the delicate Icelandic variety, domestic lamb will also suffice.", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "6 servings", "recipeCuisine": "icelandic", "recipeCategory": "dinner, project", "keywords": "carrot, lamb, onion, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 866, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "59 grams", "fiberContent": "1 gram", "proteinContent": "49 grams", "saturatedFatContent": "22 grams", "sodiumContent": "997 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds boned Icelandic lamb loins (about 3 ounces each) and tenderloins (1 to 2 ounces each); see note", "1 bottle pinot noir or other full-bodied red wine", "1 medium carrot, trimmed, peeled and chopped coarsely", "1 medium onion, peeled and chopped coarsely", "1 celery rib, trimmed and chopped coarsely", "2 cloves garlic, peeled and crushed", "1 6 1/2-ounce container D'Artagnan Rich Duck and Veal Stock", "Demi-Glace (see note)", "2 large sprigs fresh rosemary", "2 tablespoons peanut or corn oil", "Salt and freshly ground black pepper to taste", "1 tablespoon unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "One hour before you are ready to cook the lamb, remove it from the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a 3-quart nonreactive shallow saucepan, bring the wine to a boil. With a long match, ignite the wine and boil for 2 to 3 minutes, or until the flame subsides and the alcohol evaporates. Add the carrot, onion, celery and garlic; cook at a low boil for about 10 minutes, or until reduced by half. Add the demi-glace and simmer about 15 minutes, or until reduced by half. Remove the pan from the heat; add the rosemary to steep and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees. Heat a large skillet (preferably cast iron) over high heat. Add 1 tablespoon of the oil. When the oil begins to shimmer, add about half the loins and brown about 1 minute on each side. (Do not overcrowd the meat.) Season with salt and pepper and set aside. Repeat with the remaining loins."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return all the loins to the skillet and transfer it to the oven. Roast the loins for 4 to 5 minutes, or until the meat is firm to the touch and an instant-read thermometer in the thickest part registers 120 degrees. Transfer the loins to a platter, cover loosely with foil and let stand 5 minutes. (The temperature will reach 125 to 130 degrees for medium rare.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out the skillet. Brown the tenderloins in batches with the remaining tablespoon of oil for 1 to 1 1/2 minutes per side for medium rare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add any juices from the meat to the reserved sauce. Strain it into a bowl through a fine sieve, pressing the vegetables with the back of a spoon to extract as much liquid as possible. Wipe out the saucepan, add the strained sauce and return to a simmer. Whisk in the butter until melted. Remove from the heat and season with salt and pepper. (Makes about 1 cup.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the loins on the bias and the tenderloins into thirds. Divide among 6 plates, nap with sauce and serve with Roasted Tomatoes and Summer Peas (see recipes)."}]}