{"@context": "http://schema.org", "@type": "Recipe", "name": "Veal Milanese", "description": "On a cold night in the winter of 2000, the formidable food reporter Amanda Hesser went with friends to Caffe Rosso in Greenwich Village. “I was in the mood for veal and red wine,” she wrote in The Times a year later. “When the main courses came, the waiter set down my veal Milanese: a pounded chop as large as a frying pan, crusted with bread crumbs and smothered with a glistening mess of arugula and tomatoes. I squeezed lemon over the veal and set about carving. It was just what I was after: the tender meat was pounded paper-thin with fat on the edges and a thin, pebbly coating of bread crumbs. The peppery salad and lemon offered steady relief. But it left me with a single thought: to come back in the summer when arugula and tomatoes are in season.” Then she gave us a recipe for the dish, perfect for summer, when arugula and tomatoes are in season. Go to!", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, project", "keywords": "bread crumbs, eggs, veal, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 46}, "recipeIngredient": ["3 eggs", "2 tablespoons finely grated Parmesan cheese", "1 1/2 tablespoons chopped parsley", "Salt", "Freshly ground black pepper", "1 cup flour", "1 to 2 cups fine bread crumbs, made with stale, not toasted, country bread, crusts on", "4 large handfuls arugula", "2 small or 1 large very ripe tomatoes, roughly chopped", "1/2 small red onion, very thinly sliced", "Extra virgin olive oil", "Juice of a lemon", "4 veal chops with bones, pounded very thin, almost transparent (no thicker than a pie crust)", "Corn oil", "1 lemon, cut into wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, whisk together eggs, cheese and parsley. Season generously with salt and pepper. Pour into a large, shallow bowl or tray. Spread flour in a second shallow bowl and bread crumbs in a third. Set aside near stove."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large mixing bowl, combine arugula, tomatoes and onion. Sprinkle with olive oil and lemon juice. Season with salt, and toss until leaves are coated. Dressing should be assertive and lemony. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Working one at a time, press each veal chop into flour on each side, then pat it off so that there is just a fine dust on veal. Dip chop into egg, coating both sides, and letting as much drain off as possible. Lay chop in bread crumbs, tapping it gently to make sure it gets coated, but ever so thinly. Flip it over, and coat the other side. Layer chops between waxed paper or parchment as you go."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 175 degrees, and place a baking sheet on middle rack. Place a sauté pan large enough to fit 2 chops over medium-high heat. Pour in enough corn oil to generously cover base of pan. When oil shimmers (it should be very hot so the veal seizes immediately), add a chop and sauté until browned, 2 to 3 minutes. Turn and brown other side. Transfer to baking sheet, and keep warm in oven. Repeat with other chops."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, place chops on each of four large plates. Place a large handful of salad on top of each, making sure each gets enough tomatoes and onion. Serve with a wedge of lemon, for squeezing over the meat."}]}