{"@context": "http://schema.org", "@type": "Recipe", "name": "Semifreddo With Nutmeg and Mace", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT45M", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "project", "keywords": "almond, heavy cream, sugar, dessert, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 299, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "4 grams", "saturatedFatContent": "12 grams", "sodiumContent": "39 milligrams", "sugarContent": "20 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 cup sugar", "1/4 cup sliced almonds", "1 1/2 cups heavy cream", "2 tablespoons light rum", "2 large eggs", "4 large egg yolks", "1 1/2 teaspoons nutmeg", "1 1/2 teaspoons mace"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small, heavy saucepan, combine 1/4 cup of the sugar and 1 tablespoon water and place over medium heat. Cook until the sugar is melted and then add the almonds. Continue to cook, stirring occasionally, until the sugar turns a light caramel color. Immediately pour the mixture out onto a buttered pan. Allow to cool and harden. When cool, use a heavy knife to chop finely. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the cream and rum and whip until the mixture forms soft peaks. Set aside in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium-size ovenproof bowl, whisk together the eggs, yolks and remaining 1/2 cup sugar. Place the bowl over a small pot of barely simmering water (make sure the water does not touch the bottom of the bowl) and cook, whisking continually, until the mixture is very hot and increased in volume, about 5 to 7 minutes. Immediately transfer the mixture to the bowl of an electric mixer, add the nutmeg and mace and whip on high speed until the mixture is completely cooled, about 5 to 7 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, line a 2-quart loaf pan with plastic wrap. When the egg mixture is cooled, fold in the whipped cream. Fold in the chopped almond mixture. Scrape the mixture into the loaf pan, cover with plastic wrap and freeze overnight or until set. When ready to serve, remove the plastic from the top of the pan, invert the pan onto a serving platter, remove the rest of the plastic wrap and slice the semifreddo into serving pieces with a sharp knife."}]}