{"@context": "http://schema.org", "@type": "Recipe", "name": "Double Veal Chops With Braised Spring Vegetables", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "fall, main course, pancetta, veal, vegetables", "aggregateRating": null, "recipeIngredient": ["4 tablespoons olive oil", "2 tablespoons butter", "1/2 pound lean veal trimmings for stew, cubed", "2 thick loin veal chops, 1 1/2 pounds each", "10 garlic cloves, unpeeled", "Sea salt and freshly ground pepper to taste", "1 1/2 cups homemade chicken broth, or canned", "4 ounces pancetta, cut into 4 pieces", "1 pound small new potatoes, halved", "4 large carrots, 1/2 pound, peeled and trimmed, halved on a bias", "20 pearl onions, peeled", "4 stalks salsify, peeled and cut into the same length as carrots", "4 scallions, cleaned and trimmed", "8 asparagus spears, peeled and trimmed", "2 cups sugar snap peas, trimmed", "1 bunch broccoli rabe, hard stems removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a heavy skillet large enough to hold the veal chops in one layer, add 2 tablespoons of olive oil and 1 tablespoon butter. Add the veal trimmings. Over medium-high heat, brown for 5 minutes, stirring. Add the veal chops and garlic. Season well with sea salt and pepper. Cook the veal chops for about 10 minutes a side, moving the chops around the pan periodically. Remove the veal chops, leaving the garlic and the veal trimming in the pan. Drain all fat from the skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the chicken broth to the pan. Deglaze over high heat, reducing by half. Check seasonings. Return the veal chops to the pan with any of their accumulated juices. Remove from the heat, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large skillet, preferably cast iron, brown the pancetta over medium heat in 2 tablespoons olive oil. Cook for 2 minutes, stirring, and add the potatoes, carrots, onions, salsify and scallions. Reduce heat to medium-low. Cook, stirring, for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 4 cups of salted water to a boil. Add the asparagus, sugar snap peas and broccoli rabe. Return to a boil, and cook for 1 minute. Drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining butter to the vegetable skillet. Add the drained vegetables. Check for seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the veal thinly and serve with vegetables and reduced pan juices. Include garlic cloves if desired."}]}