{"@context": "http://schema.org", "@type": "Recipe", "name": "Prince Edward Island Lobster With Muscat Beaumes-De-Venise Sauce", "description": "The chef Wayne Nish shared this recipe with The New York Times in 1999 to accompany a story about baby cilantro. A bottle of Muscat Beaumes-de-Venise provides the base for this sauce. Mr. Nish said he liked to use baby cilantro \"in places where fully grown cilantro would overwhelm everything else.\" For a flavor as delicate as lobster's, he said, \"it adds a spike of brightness.\"", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT1H50M", "recipeYield": "6 large appetizers", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, garlic, lobster, muscat wine, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1260, "unsaturatedFatContent": "31 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "95 grams", "fiberContent": "3 grams", "proteinContent": "58 grams", "saturatedFatContent": "58 grams", "sodiumContent": "1396 milligrams", "sugarContent": "9 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 large bottle Muscat Beaumes-de-Venise (750 milliliters)", "1 5-inch piece thinly sliced ginger", "5 shallots, halved", "5 cloves garlic, halved", "1/2 teaspoon ground cumin", "1 quart plus 2 tablespoons heavy cream (40 percent, if possible)", "1 cup sea salt, plus extra to season", "Juice of 1/2 lime, or to taste", "3 lobsters, 1 1/4 to 1 1/2 pounds each", "1/2 pound (2 sticks) unsalted butter", "6 tablespoons baby cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the sauce, combine Beaumes-de-Venise, ginger, shallots and garlic, and cook to reduce to 1 cup. Whisk in cumin and 1 quart cream; return to heat, and reduce to 3 cups. Remove from heat, and strain to remove solids. Season with salt and lime juice to taste, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In large stockpot, combine 3 quarts water with 1/2 cup sea salt. Place over high heat, and bring to a boil. Meanwhile, fill a large bowl with 3 quarts water and ice, and add 1/2 cup sea salt. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Kill each lobster by placing the tip of sharp knife on top of the head behind the eyes and striking it down with a kitchen mallet. Twist off the tails, and break off the claws (with knuckles) at the bodies."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add claws to pot. After 4 minutes, add tails, and continue to boil 6 minutes longer. Using tongs or slotted spoon, transfer claws and tails to ice water to stop the cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove meat from shells, and cut meat into bite-size pieces. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan over low heat, melt butter. Add remaining cream, and mix well. Season with sea salt to taste. Bring to a bare simmer, and then add lobster to heat through. To serve, remove lobster from butter-cream mixture, and place an equal portion of lobster on each of four plates. Spoon Beaumes-de-Venise sauce around, and garnish with baby cilantro."}]}