{"@context": "http://schema.org", "@type": "Recipe", "name": "Lois Dodd's Fresh Corn And Blueberry Pancakes", "description": "", "author": {"@type": "Person", "name": "Leslie Land"}, "image": null, "totalTime": "PT45M", "recipeYield": "Four to six servings, about 20 three-and-one-half-inch cakes", "recipeCuisine": "american", "recipeCategory": "", "keywords": "appetizer, dessert, blueberries, corn, eggs, spring", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 203, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "5 grams", "sodiumContent": "250 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup stone-ground yellow cornmeal", "1 cup milk", "1/4 to 1/2 cup all-purpose flour", "1 teaspoon Bakewell Cream (see note)", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "2 ears fresh corn, enough to make 1 1/2 to 2 cups prepared", "2 eggs", "2 tablespoons melted butter, plus butter for the griddle", "1 heaping cup fresh wild blueberries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the cornmeal and milk and set aside. In a large bowl, combine a quarter cup of flour with the remaining dry ingredients and stir with a wire whisk until thoroughly blended. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the corn kernels from the cobs, keeping the knife perpendicular so only the tips are removed. Then scrape the cobs with the back of the knife to get all the juice and kernel hearts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grind the corn in a blender until it is the texture of lumpy slush, then add the eggs and melted butter. Blend in the cornmeal and milk mixture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the griddle over low heat, then gradually increase the temperature until the heat is medium-high and the griddle is very hot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the griddle is heating, add the blender contents to the flour mixture and stir just enough to barely blend. Stir in the blueberries."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly grease the griddle and ladle out a test cake, using about two tablespoons of batter and holding it close to the pan as you pour. It should spread without running around loose. Cook a bit longer than a conventional pancake, until the surface is moist but not wet, about three minutes. Then turn and cook the other side. If the cake is runny or impossible to turn, stir a bit more flour into the batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the remaining cakes, using a scant quarter cup of batter for each. Stir with the ladle as you dip into the batter to keep the berries in suspension. Serve at once with maple syrup and butter or as an accompaniment to smoked or grilled chicken."}]}