{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken and Parsnip Salad With Roasted Shallot Dressing", "description": "", "author": {"@type": "Person", "name": "Celia Barbour"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "chicken, parsnip, shallot", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 209, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "404 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound parsnips", "1 pound boiling or all-purpose potatoes, such as Yukon Gold", "3 small shallots (unpeeled)", "1/4 cup plus 1 tablespoon olive oil, plus more for roasting", "Salt and freshly ground black pepper", "Meat from 1 roasted chicken or scraps of leftover chicken, torn into bite-size pieces", "2 tablespoons red-wine vinegar", "1 teaspoon Dijon mustard", "1 tablespoon chopped mixed herbs, such as parsley, tarragon, thyme and chervil", "1 bunch lettuce, cored and torn into pieces", "1 handful arugula"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Peel parsnips and quarter lengthwise, cutting out core. Cut parsnips into pieces about size of long French fries. Place in a bowl. Cut unpeeled potatoes into 1-inch chunks, and add to bowl. Add shallots and enough olive oil to coat (about 1 tablespoon) and sprinkle generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread on a baking sheet and roast until soft, about 35 minutes, turning once midway through roasting. Be careful not to overcook, removing shallots when very soft and smaller pieces of parsnip as soon as they are browned and tender. Set shallots aside. Combine parsnips, potatoes and chicken in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel shallots and chop very finely. Transfer to a bowl and combine with 1/4 cup plus 1 tablespoon olive oil, vinegar, mustard and herbs. Season with salt and pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss chicken and parsnip mixture with about half the dressing. Toss lettuce and arugula with remaining dressing. Arrange greens on plates with chicken mixture on top and serve."}]}