{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Halibut In Borscht With Warm Chive-Horseradish Sauce", "description": "This steamed halibut in borscht with warm chive-horseradish sauce from Le Bernardin hits the correct flavor notes for a Passover menu. One could chill the sauce and, instead of the halibut, substitute ovals of gefilte fish, which is often served with beet horseradish. To conform to kosher dietary laws, mayonnaise can be used instead of crème fraîche for a meal that contains meat.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cabbage, halibut, red beets, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 555, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "4 grams", "proteinContent": "81 grams", "saturatedFatContent": "5 grams", "sodiumContent": "1602 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons olive oil or corn oil", "1 medium onion, julienned", "1 cup julienned fennel", "2 tablespoons sliced garlic", "2 sprigs fresh thyme", "2 sprigs flat-leaf parsley", "1 cup chopped savoy cabbage, plus 3 of the darker outer leaves, finely julienned", "1 quart well-seasoned chicken or vegetable stock", "4 cups peeled and julienned fresh beets (about 1 1/2 bunches)", "Salt and freshly ground white pepper to taste", "1 cup creme fraiche, sour cream or mayonnaise", "1/4 cup prepared white horseradish", "1/2 teaspoon sugar", "1 tablespoon minced chives", "8 halibut steaks or fillets, each 4 to 6 ounces, or 8 portions chilled gefilte fish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a heavy 3-quart saucepan. Add onions and fennel, and cook slowly about 5 minutes, until softened. Tie garlic, thyme, parsley and chopped cabbage in a double thickness of cheesecloth, and add it to saucepan along with stock and beets. Simmer 15 minutes. Season to taste with salt and pepper. Remove from heat. Discard cheesecloth and its contents. To serve the dish chilled, refrigerate beet mixture at least 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 3 cups water to a boil in a small saucepan. Add julienned cabbage leaves, cook just until bright green, then drain. Set leaves aside, covered, to keep warm; for a cold dish, refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix creme fraiche, sour cream or mayonnaise with horseradish, sugar and chives. If using mayonnaise, thin it beforehand with 2 tablespoons water. This sauce can be gently warmed in a small saucepan or chilled to serve cold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, steam halibut until fully cooked outside and just warm inside, 6 to 8 minutes. Keep warm. Reheat beet mixture, spoon into warmed shallow soup plates, sprinkle with julienned cabbage and top with fish. Or spoon chilled beet mixture into shallow soup plates, add cabbage, and top with gefilte fish. Serve horseradish sauce, warm or chilled, on the side."}]}