{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta Kerchief With Poached Egg, French Ham And Brown Butter", "description": "Gabrielle Hamilton, the chef at Prune in the East Village, layers pasta kerchiefs with a poached egg, blanched bitter greens and a slice of French ham, then pours over a river of browned butter, a dozen or so toasted pine nuts and a few drops of balsamic vinegar. It can be done all in one pot, perhaps two. She poaches the egg and holds it on the side. The pasta is cooked in boiling water, and then a handful of watercress and arugula rolled in a slice of French ham and clamped between tongs is dipped in. Hardly a second and the greens are wilted and warmed.\n\nAs it's assembled, a small pool of pasta water collects at the bottom of the bowl. So does a little vinegar water from poaching the eggs. And the brown butter slides down through the layers so that as you dig your spoon into it you splash into a salty, nourishing broth.", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "all-purpose flour, eggs, ham, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 641, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "2 grams", "proteinContent": "23 grams", "saturatedFatContent": "19 grams", "sodiumContent": "595 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["1 2/3 cups plus 1/4 cup all-purpose flour", "2 egg yolks", "1 egg", "1/2 tablespoon kosher salt", "1/2 tablespoon extra virgin olive oil", "1 teaspoon cider vinegar", "4 eggs", "8 tablespoons unsalted butter", "4 handfuls arugula and watercress, mixed", "4 slices smoked cured jambon de Paris or other lightly smoked, dry cured ham", "1/4 cup inch-long shavings Parmigiano-Reggiano cheese", "3 tablespoons pine nuts, toasted", "Best quality balsamic vinegar, for sprinkling", "Kosher salt", "Coarsely ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place flour in a food processor, turn it on and add 2 egg yolks and 1 egg one at a time through feed tube. Mixture should have consistency of moist cornmeal. Transfer to a large mixing bowl. Have 1/2 cup cold water ready. Add salt and olive oil; mix with your hands, squeezing dough through your fingers. Add cold water a little at a time, until a smooth dough forms; it should be between soft and stiff. Knead 10 minutes, then let rest, dusted with flour and covered with an overturned bowl, for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a pasta machine, roll dough, first on largest setting, folding it in half after each run through. Run it through at least twice on each setting, working your way down to thinnest setting, so that the sheets are 5 to 6 inches wide. It should get soft and silky without shredding on edges. Cut sheets about 10 inches long. Reroll any scraps. (This will make about 8 sheets, but you will only need 4; reserve extra for another use.) Layer sheets between pieces of wax paper or parchment. Cover with plastic wrap, and keep in refrigerator until needed."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Assemble dish:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Meanwhile, fill a medium pan with 2 inches of water and vinegar; bring to a simmer. Gently crack 4 eggs into it, and poach until whites are just set. Using a slotted spoon, remove to a plate, and set aside in a warm place. Discard egg cooking water; add butter to same pan. Cook over medium heat until it begins to smell nutty and turn brown. Set aside. Warm 4 large serving bowls in a 175-degree oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 4 pasta sheets to boiling water, and cook for about 90 seconds. Using tongs, gently transfer each to a serving bowl, laying it across so that ends hang over edge of bowl. Roll each handful of greens in a slice of ham; using tongs, dip package in boiling pasta water for 2 or 3 seconds. Shake off excess water, and place on top of pasta. Repeat with remaining ham and greens. Place an egg on top of each, and fold pasta over. Quickly reheat butter, and pour a little over each bowl of pasta. Sprinkle with shavings of cheese, pine nuts and a little balsamic vinegar. Season with salt and pepper."}]}]}