{"@context": "http://schema.org", "@type": "Recipe", "name": "Romesco Sauce", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "About 2 cups sauce", "recipeCuisine": "spanish", "recipeCategory": "condiments", "keywords": "almond, ancho chili, tomato, vegan, vegetarian", "aggregateRating": null, "recipeIngredient": ["5 ripe baseball-size tomatoes, cored and halved", "8 large cloves garlic", "Olive oil, preferably from arbequina olives (see note)", "Sea salt", "1/3 cup blanched almonds", "10 blanched hazelnuts", "1 dried ancho chili pepper (soaked in very hot tap water for 20 minutes)", "2 fire-roasted piquillo peppers", "Aged sherry vinegar", "Red wine, preferably from Priorat or Rioja"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Lay tomatoes, cut side up, and garlic cloves in a medium roasting pan. Sprinkle with olive oil and season with salt. Roast for 15 minutes and then reduce the heat to 350 degrees. Roast another 60 to 75 minutes. (The garlic should be soft after 20 minutes; remove it and let cool.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, coat a small sauté pan with 1/8-inch olive oil. Place over medium heat. When the oil shimmers, add the almonds and hazelnuts and cook until toasted a golden brown, about 2 minutes. Remove and cool on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the seeds from the ancho chili and discard. Scrape the thin layer of flesh from the skin. Place this pulp, along with the tomatoes, nuts and piquillo peppers, in the bowl of a food processor. Squeeze the garlic from its skin and add it. Pulse a few times to blend it and then, leaving the processor on, pour olive oil through the feed tube in a thin stream. The sauce should become thick and creamy, like a mayonnaise. About 1 cup of oil should be enough. To sharpen it, season with salt and add a tablespoon or two of vinegar and red wine. Serve with grilled scallions. (Brush with olive oil, season with salt and grill until charred and soft or roast in a 350-degree oven; peel to tender part, then serve.)."}]}