{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Gnocchi With Lobster And Walnut Butter", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H", "recipeYield": "Four servings", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "all-purpose flour, lobster, potato, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1148, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "41 grams", "fiberContent": "5 grams", "proteinContent": "126 grams", "saturatedFatContent": "19 grams", "sodiumContent": "2994 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 1/2 cups all-purpose flour", "2 russet potatoes, peeled, cut into 3/4-inch chunks, boiled until tender, drained and passed through a ricer", "3 egg yolks", "1/2 to 2/3 cup water", "Salt and freshly ground pepper to taste", "4 1 1/2-pound lobsters, tail and claws separated from the body by your fish store within a few hours of using", "1 tablespoon olive oil", "1/2 cup unsalted butter", "1 cup toasted walnuts, finely chopped", "Rind of 1 lemon, julienned", "Salt and freshly ground black pepper to taste", "3 tablespoons fresh lemon juice", "1/4 cup grated Parmesan", "2 tablespoons chopped fresh Italian parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the gnocchi, place the potatoes on a work surface dusted with a little flour. Add the egg yolks, water and salt and pepper to taste and mix lightly with your hands. Add all but about 3 tablespoons of the flour a little at a time, kneading very gently, just until incorporated. Divide the dough into quarters and form each piece into a log 1/2 inch in diameter. Cut each log across into 3/4-inch pieces and roll each piece into a ball. Place 1 ball on a lightly floured fork, just above the tines. Press your thumb into the center of the ball and then roll the ball from the top down the tines of the fork, forming a grooved cylinder. Repeat with the remaining balls. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a grill, preferably using hardwood. Blanch the lobster claws in a large pot of boiling water for 6 minutes. Crack the claws and remove the meat. Rub the lobster tails with olive oil and place on the grill, shell side down. Grill until almost fully cooked, about 8 minutes. Pull the meat from the shell and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drop the gnocchi in a large pot of boiling salted water and cook for 4 minutes after they float to the surface. Meanwhile, for the sauce, place the butter in a large skillet over medium heat. Cook until almost brown. Stir in the walnuts and lemon strips and cook 5 minutes. Stir in the lobster meat and gnocchi and cook 2 minutes. Stir in salt and pepper to taste and the lemon juice. Remove from the heat and stir in the Parmesan. Divide among 4 plates, sprinkle with parsley and serve."}]}