{"@context": "http://schema.org", "@type": "Recipe", "name": "Provencal Eggplant And Scallop Pie", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "Six servings", "recipeCuisine": "french", "recipeCategory": "dinner, casseroles", "keywords": "eggplant, scallops, zucchini, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 396, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "7 grams", "proteinContent": "16 grams", "saturatedFatContent": "3 grams", "sodiumContent": "888 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 medium eggplant, trimmed", "1 teaspoon salt, plus more to taste", "1/2 cup olive oil", "1 medium zucchini, cut into small dice", "1 medium yellow squash, cut into small dice", "1/2 cup chopped onion", "2 cloves garlic, peeled and chopped", "1 1/2 cups coarsely chopped canned plum tomatoes with 1/2 cup juice reserved", "2 tablespoons chopped fresh basil", "1 1/2 teaspoons chopped fresh rosemary", "2 tablespoons water", "2 tablespoons chopped fresh Italian parsley", "Salt and freshly ground black pepper to taste", "1 cup lightly toasted bread crumbs", "6 thin slices hearty country-style bread, toasted", "1 pound fresh jumbo sea scallops, rinsed, muscle removed and each sliced horizontally into 3 thin rounds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut 6 rounds, 1/2 inch thick, from the eggplant. Place on paper towels and sprinkle with 1 teaspoon salt. Let stand for 1 hour. Peel the remaining eggplant and cut into small dice. In a large, heavy skillet, heat 1 tablespoon of the olive oil over medium-high heat. Add the diced eggplant and cook until the edges begin to brown. Remove from the pan and place on a baking sheet to cool. Repeat with the zucchini and then the yellow squash, adding oil as needed. Remove from the pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons olive oil to the pan. Add the onions and garlic and cook for 2 minutes. Add the tomatoes and reserved juice. Lower the heat and add the herbs. Cook 5 minutes. Transfer the sauce to a bowl and wipe the pan dry. Add 2 tablespoons of oil to the pan and heat over medium heat. Place the eggplant rounds and water in the oil and brown evenly, about 3 to 5 minutes per side. Remove from the pan and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Stir the diced vegetables and 1 tablespoon of parsley into the tomato mixture. Season to taste with salt and pepper. Stir the remaining parsley into the bread crumbs. Place the bread slices on a baking sheet and top each one with an eggplant round. Spoon the vegetable mixture over the eggplant slices. Place the scallop slices over the sauce, overlapping them slightly. Top with the bread crumbs. Bake until the scallops contract and the bread crumbs are brown, about 15 to 20 minutes. Divide among 6 plates and serve."}]}