{"@context": "http://schema.org", "@type": "Recipe", "name": "Pears With Caramelized Onions", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "salads and dressings", "keywords": "onion, pear, walnut, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 777, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "102 grams", "cholesterolContent": null, "fatContent": "40 grams", "fiberContent": "18 grams", "proteinContent": "13 grams", "saturatedFatContent": "6 grams", "sodiumContent": "1239 milligrams", "sugarContent": "35 grams", "transFatContent": null}, "recipeIngredient": ["3/4 cup walnuts", "1/2 cup loosely packed basil leaves, stemmed, washed and dried", "1/2 ounce Parmesan cheese, grated", "10 tablespoons extra virgin olive oil", "2 tablespoons red wine vinegar", "3 tablespoons red raspberry vinegar", "2 teaspoons salt, plus more to taste", "Freshly ground black pepper to taste", "1 1/2 cups wheat berries", "1/2 cup dried currants", "4 medium onions (about 1 1/2 pounds), peeled and thinly sliced", "1 teaspoon lemon juice", "4 medium pears (about 1 1/2 pounds)", "1/2 pound arugula, stemmed, washed and dried"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Place walnuts on a baking sheet, and toast in the oven 10 minutes. Remove from oven, and let cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor, process 1/2 cup of the walnuts 10 seconds, until finely chopped. Remove to a bowl, and set aside. Place the remaining walnuts, basil leaves, Parmesan cheese and 2 tablespoons olive oil in the food processor. Process 15 seconds. Scrape down sides of bowl, and process 15 seconds more. Add 4 tablespoons olive oil, red wine vinegar and 1 tablespoon raspberry vinegar, and process 15 seconds. Transfer to a bowl, season to taste with salt and pepper, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 5-quart saucepan, bring to a boil 2 quarts water seasoned with 2 teaspoons salt. Add wheat berries and simmer 1 hour, until they are cooked but still quite crunchy. Drain, and transfer to a large bowl. Add the currants, 2 tablespoons olive oil and 2 tablespoons raspberry vinegar; stir to combine. Season to taste with salt and pepper. Let cool 30 minutes, then stir in the reserved chopped walnuts. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large nonstick saute pan, heat 2 tablespoons olive oil over medium heat. Add onions, and season lightly with salt and pepper. Cook 30 to 40 minutes, until golden and caramelized, stirring occasionally to prevent onions from sticking to the pan. Add 1/2 cup water to the caramelized onions, bring to a boil and then transfer onions and liquid to a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the onions are cooking, combine lemon juice with 4 cups cold water in a medium bowl. Core and quarter the pears. Slice each quarter lengthwise into 1/4-inch-thick slices, and place in the lemon water. Set aside until onions are done."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain pears in a colander, rinse under cold water and shake dry. Add pears to the onions, and stir gently to combine. Season to taste with salt. Cover with plastic wrap, and set aside for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To assemble, place equal amounts of the wheat berry mixture in a ring shape on the outer edges of 4 plates. Place equal amounts of arugula inside each ring of wheat berries. Dress arugula and wheat berries with 2 tablespoons dressing. Place equal amounts of the pear-onion mixture on the arugula, then sprinkle pears and onions with 1 more tablespoon of dressing. Serve immediately."}]}