{"@context": "http://schema.org", "@type": "Recipe", "name": "Pot-Au-Feu Of Spring Vegetables With Chive Popovers", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "Four servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken broth, fava beans, vegetables, main course, spring", "aggregateRating": null, "recipeIngredient": ["2 tablespoons unsalted butter: 1 tablespoon melted, plus 1 tablespoon to grease tin", "1 egg", "1/2 cup low-fat yogurt", "1 cup low-fat milk", "1 cup all-purpose flour", "1/2 teaspoon salt", "1 teaspoon fresh ground pepper", "1/2 cup minced chives", "1 large lemon, thinly sliced", "2 teaspoons salt", "2 tablespoons sugar", "1 cup water", "3 cloves garlic, roasted, peeled, smashed into a paste", "1 tablespoon olive oil", "1/4 teaspoon salt", "1 teaspoon fresh ground pepper", "2 quarts chicken broth (homemade or low-sodium canned)", "8 new potatoes, scrubbed, cut into quarters", "4 small leeks, rinsed, trimmed, split lengthwise, white parts only", "1/2 pound fresh cranberry beans, hulled", "8 small carrots, peeled, cut into 2-inch pieces", "2 pounds fava beans, peeled twice", "2 cups steamed spinach", "1/2 cup minced parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the popovers, grease an eight-cup muffin tin with 1 tablespoon of butter. Put the egg, yogurt, milk, melted butter, flour, salt and pepper in a mixing bowl. Mix until combined. Fill each tin 1/4 full and sprinkle with 1 tablespoon minced chives. Add more batter until each cup is half full."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the muffin tin in a cold oven and set the heat to 450 degrees. Bake for 15 minutes, then reduce heat to 350 degrees. Continue to bake until the popovers are lightly golden, about 15 to 20 more minutes. Take popovers out of tins immediately. Cool on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the pot-au-feu, put the lemon slices in a skillet, add salt, sugar and water. Simmer until tender, about 15 minutes. Set aside to cool. Mince when cool. Put the minced lemon in a food processor or blender, add the roasted garlic and olive oil and puree until smooth. Season with salt and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, pour the chicken broth in a large pot and bring to a simmer over medium-high heat. Add the potatoes, leeks and cranberry beans. Lower the heat and simmer gently for 10 minutes. Add the carrots and simmer gently until tender, about an additional 10 minutes. Add the fava beans and simmer for 1 minute more. Using a slotted spoon, take all of the vegetables out of the pot. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the broth to a boil. Lower heat and simmer until it reduces to 4 cups, about 10 to 15 minutes. Wreath the inside of 4 bowls with spinach and add the vegetables. Set aside. Remove saucepan from heat and whisk in the pureed lemon and garlic. Strain through a sieve lined with cheesecloth. Season with salt and pepper. Ladle broth into bowls and garnish with parsley. Serve with popovers."}]}