{"@context": "http://schema.org", "@type": "Recipe", "name": "German Potato Salad", "description": "The reassurance of potato salad, its portability, conviviality and – depending on the cook – blank slate for creativity have been appealing to Americans since the last half of the 19th century. Immigrants and travelers to America introduced many styles, including variations of salade Nicoise (the French salad of potatoes, olives, green beans and tuna, dressed with vinaigrette), and salade Russe (cubed potatoes, peas and carrots bound with mayonnaise). German settlers brought hot potato salad, and that savory combination of warm potatoes lightly dressed with hot bacon fat and vinegar became entrenched in Pennsylvania and throughout the Midwest. This is an adaptation of a classic version that was first published in the 1931 edition of “The Joy of Cooking.”", "author": {"@type": "Person", "name": "Suzanne Hamlin"}, "image": "https://static01.nyt.com/images/2017/06/05/dining/05COOKING-GERMAN-POTATO-SALAD1/05COOKING-GERMAN-POTATO-SALAD1-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "german", "recipeCategory": "salads and dressings", "keywords": "bacon, potato, scallion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 665}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 211, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "3 grams", "sodiumContent": "342 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds boiling potatoes, scrubbed but not peeled", "4 strips bacon", "1 bunch scallions, trimmed and cut into thin slices, including some of the green", "1/2 cup minced celery, including some leaves", "1/2 cup cider vinegar", "1/2 teaspoon sugar", "1/2 teaspoon salt", "1/8 teaspoon paprika", "1/4 teaspoon dry mustard"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the potatoes in half if they are large, put them in a pot and add enough lightly salted water to cover them by 2 inches. Bring to a boil, and boil gently, uncovered, for about 15 minutes, until just tender. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes are still warm, peel and slice, or cube them, into a large serving bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet, cook the bacon until crisp. Drain. Pour out all but 2 tablespoons of bacon fat. Add scallions and celery, and cook until soft, about 2 minutes. Mix with potato pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same skillet, mix 1/4 cup of water with cider vinegar, sugar, salt, paprika and dry mustard. Stirring with a whisk, bring to a boil and pour over salad. Crumble bacon over the top, and serve warm."}]}