{"@context": "http://schema.org", "@type": "Recipe", "name": "Wild Boar Sausage And Goop", "description": "", "author": {"@type": "Person", "name": "Amy M. Spindler"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chilies, edamame, wild boar sausage, main course", "aggregateRating": null, "recipeIngredient": ["Assorted dried whole or powdered California and Mexican chilies like anchos (dried poblanos), moritas (smoked serranos), habaneros", "Sea salt", "Cayenne pepper", "Paprika", "3 tablespoons olive oil", "2 Maui, Vidalia or other sweet onions, coarsely chopped", "2 red bell peppers, seeded, sliced into thin rings", "8 ounces okra, trimmed, cut crosswise in half", "6 ounces portobello or other mushroom caps, coarsely chopped", "1 16-ounce package fresh or frozen blanched, shelled soybeans (edamame)", "1 pound wild-boar or other lean sausage seasoned with fennel or garlic and parsley, removed from casings", "Tips from 1 bunch asparagus (optional)", "Mashed purple Peruvian potatoes seasoned with butter, salt and pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make spice mix: grind chilies in a mortar and pestle and mix according to taste with salt, cayenne and paprika. (To make a medium-hot mix, combine about 2 tablespoons each powdered anchos and moritas, 1 tablespoon each paprika and salt and 1/2 teaspoon each powdered habeneros and cayenne.) Store in a saltshaker."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make goop: heat the oil in a 4-quart dutch oven over medium-high heat and sauté onions until translucent, about 10 minutes. Stir in about 1 tablespoon spice mix and cook 1 minute. Stir in bell peppers, okra, mushrooms and soybeans, cover and cook about 15 minutes, stirring occasionally."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, brown the sausage in a large nonstick skillet over medium heat, breaking up into small pieces with a wooden spoon. Stir into the goop. Cover and simmer about 40 minutes, stirring occasionally. Season to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in asparagus, cover and cook about 5 minutes longer. Serve with mashed potatoes."}]}