{"@context": "http://schema.org", "@type": "Recipe", "name": "Roasted Cod With Tangerine Sauce", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "cod, tangerine juice, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 15}, "recipeIngredient": ["1 1/4 cups tangerine juice (from at least 1 1/2 pounds tangerines) and zest of the fruit", "1 tablespoon olive oil", "1 1/2 pounds cod or other mild white fish", "Salt to taste", "Cayenne pepper to taste", "1 teaspoon coriander seeds, optional", "2 tablespoons butter (preferred) or olive oil", "Minced parsley, cilantro or dill for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees; if you have a baking stone, use it. Finely grate the zest of the tangerines, without grating any of the bitter white part. (On a good grater, you should be able to get away with one swipe per section of skin, rather than rubbing over and over.) Set aside. Juice the tangerines, and measure 1 1/4 cups of the juice. Set the juice in a small saucepan over medium-high heat, bring to a boil and reduce, stirring occasionally, to about 1/2 cup; this will take at least 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large ovenproof skillet, preferably nonstick, over high heat, and add the tablespoon of olive oil. If necessary, cut the cod into serving pieces so it will fit into the skillet. When the oil smokes, pour out any excess. (You need only a film.) Add the fish and put the skillet in the oven; set a timer for 6 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The fish is done when it offers little or no resistance when a thin-bladed knife passes through it and when the flesh is opaque, or nearly so, throughout. Unless unusually thick, it will be done in about 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the fish is cooking, season the tangerine sauce with salt and cayenne; it should have something of a bite. Add the coriander, if you choose. Whisk in the butter or oil a little at a time, until the sauce is smooth and thick. Taste, adjust seasoning and add the grated zest; cook 15 seconds longer. Serve the fish with the sauce spooned over it, and garnish with the herb."}]}