{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Potpie", "description": "", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken breast, pearl onions, pie dough, fall, winter, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1034, "unsaturatedFatContent": "36 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "64 grams", "fiberContent": "4 grams", "proteinContent": "49 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1507 milligrams", "sugarContent": "11 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["3 tablespoons vegetable oil", "4 8-ounce skinless and boneless chicken-breast halves, cut into 1-inch cubes", "8 tablespoons butter, plus extra for greasing parchment", "20 pearl onions, blanched and peeled", "3 carrots, cut in 1/2-inch rounds", "1 celery heart in 1/2-inch dice", "20 button mushroom caps or 1/2 pound porcini mushrooms, stems cut off, cut into 1-inch pieces", "4 cups strong homemade chicken stock or 5 cups of organic chicken broth from a carton, reduced to 4, plus extra if needed", "1/2 cup all-purpose flour", "1 1/2 cups half-and-half or heavy cream", "1 sprig fresh rosemary, leaves finely chopped, plus extra for garnish", "1 tablespoon chopped thyme leaves", "1 tablespoon chopped Italian parsley", "3 tablespoons dry sherry", "Salt and freshly ground black pepper to taste", "3 tablespoons lemon juice", "1 pound homemade puff pastry (or Dufour brand ready made)", "Egg wash (1 egg yolk beaten with 2 teaspoons heavy cream)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a Dutch oven, heat oil over medium heat and sauté the chicken, in batches, until lightly golden but not cooked through. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the same, cleaned pan, melt 2 tablespoons butter. Sauté the onions until golden brown, about 5 minutes. Remove to bowl with the chicken. Repeat with carrots and celery and then mushrooms. In a separate pan, heat stock to boiling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean Dutch oven again. Melt remaining butter over medium heat. Whisk in flour and cook until pale gold, 2 minutes. Whisk in boiling stock, half-and-half, herbs, sherry and salt and pepper and heat to a slow boil. Reduce heat and simmer 5 minutes or until thick enough to coat a spoon. (If too thick, add more stock.) Stir in 2 tablespoons lemon juice, the chicken and vegetables. Cover with buttered parchment. (Pie can be prepared ahead to this point and refrigerated until 1 hour before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Roll out the pastry into a square just less than 1/2 inch thick and, using a very sharp knife, cut a round the size of the pot. Line a rimmed baking sheet with parchment and invert the round on top. (Sprinkle the scraps with sugar, twist them into corkscrew shapes and bake them as cookies.) If using Dufour, follow package directions."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush pastry with egg wash, without letting any drip down the sides, which will prevent it from rising evenly. Prick all over with a fork. (For a flatter, denser crust, omit the wash, cover pastry with a second sheet of parchment paper and a second sheet pan on top, forming a sandwich. This keeps the puff pastry from rising and provides a crunchy, buttery pastry.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake pastry until puffed, browned and crisp, 15 to 20 minutes. Reduce heat to 350 degrees and bake until cooked through, 15 to 20 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reduce oven temperature to 275 degrees. Bake chicken mixture until sauce is bubbly around edges and chicken is just cooked through, about 30 minutes. Place baking sheet with pastry in oven to reheat the last 10 minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve: Remove parchment from Dutch oven and taste sauce. Adjust seasoning and stir in remaining lemon juice if needed. Slide pastry onto chicken mixture and display your pie. Back in the kitchen, cut the crust into wedges with a serrated knife. Spoon chicken onto warmed plates, stick a corner of a wedge into each serving and garnish with rosemary."}]}