{"@context": "http://schema.org", "@type": "Recipe", "name": "Chestnut Soup With Armagnac Prunes And Cappuccino Foam", "description": "", "author": {"@type": "Person", "name": "Suzanne Hamlin"}, "image": null, "totalTime": "PT40M", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "soups and stews", "keywords": "appetizer, armagnac, chestnut, prune", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 430, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "9 grams", "saturatedFatContent": "11 grams", "sodiumContent": "864 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup Armagnac or Cognac", "8 whole pitted prunes", "12 ounces button mushrooms", "2 dried porcini mushrooms or other flavorful dried mushrooms", "1 pound fresh chestnuts", "4 tablespoons unsalted butter", "1 medium-size celery root, peeled and diced", "Salt and pepper to taste", "1 tablespoon sugar", "1/4 cup Armagnac or Cognac", "4 cups chicken stock", "1 cup heavy cream", "2 cups skim milk", "1/8 teaspoon nutmeg", "1 fresh black truffle, optional", "8 parsley leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the Armagnac prunes, start early in the day or the night before. In a saucepan, mix 1/2 cup of water and the 1/2 cup of Armagnac or Cognac. Add prunes, and bring to a simmer. Remove from heat, cover and let steep 6 hours or overnight. Prunes can be kept in an airtight jar at room temperature until ready for use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the mushroom juice, wash the mushrooms, put them in a saucepan, cover with water and simmer for one hour. Strain, and then discard mushrooms. There should be a cup or more of mushroom juice. Refrigerate if not using immediately."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the porcini powder, place dried mushrooms in a blender or coffee grinder, and pulverize. Store in an airtight container until ready for use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the soup, preheat oven to 375 degrees. With a sharp paring knife, score each chestnut by making an &quot;X&quot; on the round side. Place chestnuts in a single layer on a baking tray, and roast on middle level of the oven for 10 to 12 minutes, until the shell skin curls. Remove from oven, and let rest until cool enough to handle. Peel off and discard the shells, and reserve the chestnuts."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, heavy saucepan, melt butter over low heat. Add diced celery root, and cook gently for 5 minutes without browning. Add peeled chestnuts, seasoning with salt and pepper. Stir in the sugar, raise the heat and cook a few minutes, until mixture caramelizes. Add the 1/4 cup of Armagnac or Cognac, and cook a minute. Add the mushroom juice and the chicken stock, lower heat and cook slowly for 15 minutes. Add heavy cream, and cook 5 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove mixture from the heat, and let cool about 5 minutes. Transfer to a food processor or blender, making sure the lid is on tightly. Working in two batches if necessary, puree the soup. Adjust salt and pepper to taste. Strain through a fine sieve. (The soup can be made up to this point a day in advance. Cover, and refrigerate.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return soup to a saucepan, and reheat. Put one drained prune in each of 8 soup bowls or cups. Put skim milk in a tall, slender container, and add 1/4 teaspoon of the porcini powder and the nutmeg. Using the nozzle on an espresso machine or a separate foaming device, foam the hot milk."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour equal amounts of the soup into the soup bowls, top with a scoop of the milk foam, a shaving of optional black truffle, and a parsley leaf. Serve immediately."}]}