{"@context": "http://schema.org", "@type": "Recipe", "name": "Presidential Birthday Cake", "description": "This is a classic butter layer cake based on a recipe from Seth Greenberg, the master cake maker and the son of the founder of William Greenberg Jr. Desserts and Cafes, in Washington. He spent two days baking a $4,000 version of this cake for President Clinton's birthday in 1996. \n\nThe recipe calls for a raspberry preserve filling, but use your favorite, then slather the cake with Mr. Greenberg's <a href=\"http://cooking.nytimes.com/recipes/9548-buttercream-frosting\">buttercream icing</a>. The best part is that the cake improves with age, just as a birthday cake should.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT2H", "recipeYield": "12 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "all-purpose flour, eggs, raspberry preserves, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 41}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 441, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "1 gram", "proteinContent": "5 grams", "saturatedFatContent": "10 grams", "sodiumContent": "175 milligrams", "sugarContent": "45 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 pound lightly salted butter", "1 1/2 cups sugar", "1 teaspoon pure vanilla extract", "5 large eggs", "1 3/4 cups all purpose flour", "1/3 teaspoon baking powder", "1 tablespoon whole milk", "1 1/2 cups raspberry preserves, preferably a not-too-sweet kind"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees, and place the rack in the middle of the oven. Line the bottoms of two nine-inch cake pans with wax paper or parchment paper, and grease the sides of the pans."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cream the butter and sugar until the mixture turns white, scraping the sides often. This takes about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vanilla and the eggs, one at a time, beating between additions, until thoroughly blended."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the flour and baking powder, and slowly mix into the batter with the milk, just until incorporated. Spoon equal amounts of batter into the prepared pans, and bake about 20 minutes. If necessary, switch the pans after the first 15 minutes so that they brown evenly. The layers are ready when a cake tester or toothpick inserted into their centers comes out clean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pans from the oven, and cool on racks for about 30 minutes. Then flip them over, and remove paper from the bottoms. Cool completely. If the layers are higher in the middle than on the sides, slice off the domes to make them flat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place one layer on a serving plate, and spread evenly with the raspberry preserves. Top with second layer, and spread the top and sides with <a href=\"http://cooking.nytimes.com/recipes/9548-buttercream-frosting\">buttercream frosting</a>. Other decorations can be added. Refrigerate until serving time. The cake can be made a day ahead."}]}