{"@context": "http://schema.org", "@type": "Recipe", "name": "Spanish Olive Oil Cake With Kumquats And Toasted Almonds", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "spanish", "recipeCategory": "", "keywords": "almonds, kumquats, olive oil, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 515, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "64 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "170 milligrams", "sugarContent": "47 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 kumquats, cut in half", "2/3 cup Spanish (or other) olive oil, plus more for oiling pan", "1 orange", "1 lemon", "1 mango, peeled, pitted and finely diced", "1 cup flour", "1 tablespoon baking powder", "4 eggs", "1 1/2 cups sugar", "3/4 cup almonds, blanched, toasted and finely ground"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine kumquats and olive oil, and place over medium heat. Simmer 3 minutes, then remove from heat. Steep 1 hour. Strain the fruit from the oil, discard the fruit and reserve the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the uncut orange and lemon in a medium saucepan, and cover with water. Bring to a boil, then reduce the heat and simmer 30 minutes. Drain and cool. Cut off the stem end of the citrus fruits, and then cut in half. Scoop the pulp and seeds from the lemon, and discard. Finely mince the lemon rind. Squeeze out as much of the orange juice as possible, and discard along with the seeds. Chop the orange skin and pulp very finely, mix with the lemon and mango and reserve. Discard any part of the rinds that have not softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Lightly oil a 9-inch springform pan. In a small bowl, sift together the flour and baking powder. In the bowl of an electric mixer, beat the eggs until thick and pale, 4 to 5 minutes. Continue beating, and slowly add the sugar. Stir in the flour mixture, just until blended. Fold in the reserved fruit, almonds and infused oil. Pour the batter into the oiled pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake about 50 minutes, or until a knife inserted comes out clean. Remove from the oven, and place on a wire rack. Run a knife around the inside edge of the pan, and let cool for 15 minutes. Release the springform, and allow to cool completely. Cut the cake into wedges, and serve."}]}