{"@context": "http://schema.org", "@type": "Recipe", "name": "Sylvia's Fruitcake", "description": "This cake is especially appealing to those who do not care for even the best quality candied fruit. It is more dried fruits and nuts than cake.", "author": {"@type": "Person", "name": "Marian Burros"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "1 six-pound cake", "recipeCuisine": "", "recipeCategory": "", "keywords": "brandy, candied fruit, nuts, dessert, winter", "aggregateRating": null, "recipeIngredient": ["8 ounces walnut halves", "8 ounces pecan halves", "8 ounces brazil nuts", "16 ounces pitted dates", "16 ounces dried apricots", "12 pitted prunes, halved", "4 ounces mixed candied fruits", "1/2 cup raisins", "1 cup maraschino cherries", "1 1/2 cup sifted unbleached flour", "1 teaspoon baking powder", "1 teaspoon salt", "6 eggs", "1 cup sugar", "2 teaspoons vanilla", "3/4 cup brandy", "Additional brandy for soaking"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grease the bottom and sides of an eight-cup souffle dish or a 9-by-5-by-3-inch loaf pan. Line with brown paper; grease the paper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the walnuts, pecans, brazil nuts, dates, apricots, prunes, candied fruits, raisins and cherries in a large bowl. Sift the flour, baking powder and salt over the nuts and fruits. Toss lightly until well coated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs, sugar and vanilla in a medium-size bowl with an electric mixer until the mixture is fluffy and light. Pour over the nut mixture. Stir gently to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill the prepared dish or pan, pressing the cake mixture firmly. Bake at 275 degrees for about two hours. (If the top is browning too quickly, cover with buttered foil.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the cake to a wire rack. Spoon one-quarter cup of brandy over the cake. Let stand one hour. Invert the cake and peel off the paper. Turn it right side up and let it stand on the wire rack until it is completely cooled. Place the wire rack in a shallow pan and spoon the remaining one-half cup of brandy over the cake."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To store, wrap the cake in cheesecloth that has been soaked in brandy. Wrap in heavy-duty aluminum foil or store in tightly covered container."}]}