{"@context": "http://schema.org", "@type": "Recipe", "name": "Herb Polenta With Red Bell Pepper Sauce", "description": "When I was a child in the Champagne region, my mother served us a dessert called gateau de semoule. It may sound exotic, but it's really just a cake made of semolina, the same as the American breakfast cereal Cream of Wheat. Its grainy, creamy texture was so soothing. Years later, I was working in Paris for Gaston Lenotre, the great pastry chef; he mixed semolina with olive oil and Parmesan to make gnocchi alla Romana. They were tender and light, and I much preferred them to regular gnocchi, which I find too gummy. I suppose those two memories are the reason I make my polenta with Cream of Wheat instead of cornmeal. I prefer the smoother texture of Cream of Wheat to the rougher texture of cornmeal, probably because it reminds me of my childhood, and Lenotre.", "author": {"@type": "Person", "name": "Michel Richard"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles", "keywords": "cream of wheat, red bell pepper, spinach, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 295, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "9 grams", "saturatedFatContent": "5 grams", "sodiumContent": "328 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons extra virgin olive oil", "1 cup milk", "1 clove garlic, finely chopped", "1/2 cup regular (10 minute) Cream of Wheat", "2 large eggs", "1/4 cup plus 2 tablespoons finely grated Parmigiano-Reggiano", "1 well-packed cup thinly shredded spinach leaves", "12 large basil leaves, thinly shredded", "2 tablespoons finely chopped parsley or chervil", "Salt and freshly ground black pepper", "Sprigs of fresh oregano, for garnish", "1 large red bell pepper", "1/2 anchovy, chopped, or 1/2 teaspoon anchovy paste, optional", "2 cloves garlic, chopped", "2 tablespoons extra virgin olive oil", "1/4 cup chicken stock or broth, or as needed", "1/2 teaspoon sugar", "Salt and freshly ground black pepper", "Vegetable oil for baking sheet"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Prepare herb polenta:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Line an 8-by-8-inch pan with plastic wrap, and set aside. In a medium saucepan, combine olive oil, milk and 1 clove chopped garlic. Place over high heat to bring to a boil, then remove from heat. Whisk in Cream of Wheat until well blended. Return to high heat, and whisk until thickened but still pourable. Remove from heat, and whisk in eggs. Return to heat, and stir in 1/4 cup cheese, the spinach, basil, parsley, and salt and pepper to taste. Stir the mixture until thickened and no longer pourable."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately spoon mixture into plastic-lined pan, smoothing with a piece of plastic wrap to make a flat, even surface. Cover and refrigerate until chilled and solid, 2 to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While polenta is chilling, prepare red bell pepper sauce. Preheat a broiler. Place red bell pepper under broiler, turning occasionally until blackened on all sides. Allow to cool. Peel and seed pepper, cut into pieces and place in a blender. Add anchovy, garlic and olive oil, and process until smooth. Add just enough chicken stock to make a thick but fluid sauce. Transfer mixture to a small saucepan over medium-low heat. Season with sugar and salt and pepper to taste. Bring to a simmer, remove from heat and keep warm."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To serve:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat a broiler. Remove polenta from plastic, and cut into 12 rectangles. Place on an oiled baking sheet and allow to return to room temperature. Sprinkle with remaining 2 tablespoons cheese. Broil until polenta is heated and cheese is lightly browned. Place 2 pieces of polenta on each of 6 plates, and top with a portion of sauce. Garnish with oregano sprigs, and serve immediately."}]}]}