{"@context": "http://schema.org", "@type": "Recipe", "name": "Fast, Creamy Chicken Curry", "description": "A blended curry powder is one of the original convenience foods, a venerable spice rub that can improve the flavor of almost anything. Even a good chicken breast is about as bland as meat can get, but spiced with a little curry, its flavor comes alive. In this dish, season sliced onions and chicken breast with the spice and finish the sauce with sour cream. The process is streamlined so that it takes no more than 25 minutes. Begin cooking white rice, the natural accompaniment, before cutting the onion.\n\n(After reading some of the reader comments on the original recipe, we decided to retest it, and we've made some changes and clarifications to the below recipe.)", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2017/04/25/dining/25COOKING-CHICKENBREASTS1/25COOKING-CHICKENBREASTS1-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, poultry", "keywords": "chicken breast, curry powder, yogurt, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 580}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 324, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "27 grams", "saturatedFatContent": "8 grams", "sodiumContent": "481 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons canola, corn or other neutral-flavored oil, plus more as needed", "1 medium onion, peeled and sliced", "Kosher salt and freshly ground black pepper to taste", "1 1/2 teaspoons curry powder, or to taste", "1 pound boneless, skinless chicken breasts, sliced diagonally ½ -inch thick", "1 cup sour cream", "Minced cilantro or parsley leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place oil in a large skillet and turn heat to medium high. A minute later, add onion. Sprinkle with salt and pepper and cook, stirring occasionally, until translucent, about 5 minutes. Reduce heat to medium; sprinkle with about half the curry powder and continue to cook for a minute or two."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, season both sides of the chicken slices with salt and pepper and sprinkle it with the remaining curry powder. Remove onions to a plate, add a bit more oil to the pan and add the chicken in one layer. Cook about 2 minutes per side over medium heat; remove to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return onions to the pan and add sour cream. Stir into the onions and cook, stirring constantly over low heat, until the mixture is hot. Return chicken to skillet and cook for 2 minutes, or until cooked through, turning once. Garnish and serve with white rice."}]}