{"@context": "http://schema.org", "@type": "Recipe", "name": "Amana Stuffing", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "9 cups", "recipeCuisine": "", "recipeCategory": "casseroles", "keywords": "fall, giblets, lean chuck, stale bread, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "1 gram", "proteinContent": "28 grams", "saturatedFatContent": "5 grams", "sodiumContent": "434 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds of boneless lean chuck, cubed", "1 teaspoon salt", "8 whole peppercorns", "2 bay leaves", "4 1-inch thick slices day-old, firm white bread (use a European-style white bread with a dense grain)", "Giblets from 3 chickens or from 1 turkey and 1 chicken", "1 medium potato, peeled and coarsely chopped", "2 ribs celery, leaves included, coarsely chopped", "1 medium onion, peeled and coarsely chopped", "1/2 cup strong broth", "1 1/2 teaspoons salt", "1 teaspoon dried leaf sage (do not use powdered sage) or five leaves of fresh sage, chopped", "1 teaspoon freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place beef, salt, peppercorns and bay leaves in a medium saucepan. Add water to a depth of 1 1/2 inches, cover and place over medium heat. Bring to a boil, lower heat and simmer gently for approximately 1 hour, or until the beef is tender. Remove beef cubes from broth and set aside. Do not discard the broth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While beef is cooking, preheat oven to 350 degrees. Cut 2 slices of bread into 1/4-inch cubes. Place in a pan in the oven, and toast until they are golden brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add giblets to beef broth, return to heat, and simmer gently for 15 to 20 minutes, or until cooked through. Remove from broth and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the peppercorns and bay leaves from the broth. Taste the broth. If it has a good, strong, meaty flavor, use as is. Otherwise, intensify the flavor by reducing until you have 1/2 cup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a food processor (see note), place the beef cubes, a few at a time, in the bowl and process briefly until meat is coarsely chopped. Do not overprocess. The meat should not be finely minced or pasty in texture but should have the consistency of cooked hamburger. Place chopped beef in a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat from necks and add it, together with the other giblets, to the processor bowl. Process in a similar manner as the beef. Add to the beef."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add potato, celery and onion to food processor bowl, and process to chop and mix well. Add to the meats."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the remaining 2 slices of bread in a little water, squeeze dry, tear into pieces, and add to the meats. Add 1/2 cup of broth, the salt and sage to the meats, and mix very well, using your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before stuffing the turkey, add toasted bread cubes to the mixture. Mix well. Do not stuff the turkey until you are ready to put it in the oven. If you wish, the stuffing may be made a day ahead of time, but it must be kept refrigerated until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If you have more than enough stuffing, place the remainder in a well-greased loaf or brownie pan, cover with foil, and bake for 1 hour. Remove foil for last 15 minutes of cooking to crisp the top."}]}