{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Duck With Green Beans, Thai Style", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, duck leg, green beans, onion", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 7}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1011, "unsaturatedFatContent": "54 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "89 grams", "fiberContent": "6 grams", "proteinContent": "31 grams", "saturatedFatContent": "30 grams", "sodiumContent": "1096 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["4 duck legs or 1 duck, cut into quarters", "Salt and pepper", "1 large onion, sliced", "1 tablespoon minced ginger", "1 tablespoon minced garlic", "1 or 2 small chilies, seeded and minced, or crushed red chili flakes to taste", "1 1/2 pounds green beans, trimmed", "1 tablespoon sugar, or to taste", "2 tablespoons nam pla or soy sauce", "2 tablespoons lime juice, or to taste", "Coarsely chopped fresh cilantro leaves for garnish, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove excess fat from duck or duck legs. Season with salt and pepper, and put in a skillet that will fit it comfortably; turn heat to medium, and cover. Check once you hear sizzling: duck should be simmering in its own fat and exuding liquid. Adjust heat to create a steady simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once bottom browns, turn. Eventually liquid will evaporate and duck will cook in fat only; at this point, lower heat and continue to cook duck, turning once in a while, until it becomes tender, about an hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer duck to a plate. Pour off all but a couple of tablespoons of fat. Turn heat to medium high, and add onion; cook, stirring occasionally, until it softens, about 5 minutes. Add ginger, garlic and chilies and cook, stirring, for 30 seconds. Add beans and sugar and turn heat to high; cook, stirring occasionally, until beans begin to brown, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons water and nam pla or soy sauce. Put duck on top of bean mixture and bring to a simmer. Cover and cook until both beans and duck are very tender, 15 to 30 more minutes, adding a little more water if necessary to keep mixture moist. (You can prepare dish in advance up to this point; cover and set aside until ready to eat, then reheat.) Uncover and stir in lime juice; taste and adjust seasoning, then sprinkle with cilantro and serve."}]}