{"@context": "http://schema.org", "@type": "Recipe", "name": "Roast Duck, With Cranberries", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H45M", "recipeYield": "2 to 4 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cranberry, dry red wine, duck, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "recipeIngredient": ["1 4- to 5-pound duckling", "Salt and freshly ground black pepper", "1/2 cup chopped onion", "1/2 cup chopped celery", "1 clove garlic, minced", "1 cup dry red wine", "1 cup water", "Pinch of thyme", "1 1/2 cups fresh cranberries", "1 tablespoon red wine vinegar", "5 tablespoons sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve the gizzard, heart and neck of the duck and pull off as much fat as possible from the cavity. Reserve the fat. The liver of the duck will not be used in this recipe but it can be diced and sauteed with mushrooms as an hors d'ouevre or frozen for later use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Lightly season the duck with salt and pepper and place it on a rack in a roasting pan. Prick the skin lightly all over and roast for one hour and 15 minutes. Prick the skin lightly from time to time while the duck is roasting."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "During the roasting time, heat one tablespoon of the duck fat in a heavy saucepan. Mince the gizzard and heart and add it to the pan along with the onion and celery. Saute the vegetables and duck innards until they are lightly browned. Add the garlic, one-half cup of the wine and stir to loosen any brown particles in the pan. Add the water, the neck of the duck and salt and pepper to taste. Simmer covered for 45 minutes. Strain this stock into a clean saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cranberries to the strained stock in the saucepan along with the vinegar and sugar. Cook over medium low heat until the cranberries soften and pop. Lower heat and simmer until the sauce has thickened somewhat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the duck has finished roasting, remove it to a platter. Pour the fat out of the roasting pan (it can be reserved for another cooking purpose). Add the remaining 1/2 cup of red wine to the pan. Stir to scrape up any brown particles and pour this mixture into the sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Re-heat the sauce and season to taste with salt and pepper. Carve or quarter the duck and serve with the sauce."}]}