{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom And Roasted Squash Cannelloni", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, casseroles, pastas, project", "keywords": "butternut squash, mushroom, pasta, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "recipeIngredient": ["1 pound butternut squash, peeled and cut into 1/2-inch dice", "1/4 cup olive oil", "15 sprigs thyme", "Salt and pepper", "1/4 pound black trumpet mushrooms, rinsed", "1/4 pound chanterelle mushrooms, rinsed", "1/4 pound oyster mushrooms, rinsed", "2 sticks butter (1/2 pound)", "1 1/4 cups all-purpose flour", "2 1/2 cups whole milk, warmed", "8 ounces mascarpone", "1/4 cup olive oil", "2 pounds chard, washed, stems removed and coarsely shredded", "1 stick butter", "8 sheets of pasta (<a href=\"http://cooking.nytimes.com/recipes/9847-pasta-for-cannelloni\">see recipe</a>)", "1 cup grated Parmesan, or more"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Combine squash, 1/4 cup olive oil, 5 sprigs thyme, salt and pepper, and spread in one layer on a baking sheet. Bake until squash is soft, about 45 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim and chop mushrooms. Heat one stick of butter in a wide saucepan over low heat. When it melts, add mushrooms, a big pinch of salt, some pepper and remaining thyme. Cook, stirring occasionally, for at least 30 minutes, until mushrooms give up their liquid and begin to brown. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While squash and mushrooms cook, make béchamel sauce. Heat remaining stick of butter in a saucepan over medium heat. When it melts, gradually whisk in the flour until it is incorporated. Cook, whisking continually, until flour browns a bit, about 5 minutes. Stir in some salt and pepper. Add milk 1/2 cup at a time, whisking after each addition until smooth. Cook over low heat, stirring frequently, for about 15 minutes. Whisk in mascarpone. Refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 1/4 cup olive oil in large skillet over medium high heat. Add half the chard and a large pinch of salt. Cook, stirring occasionally, until chard wilts. Remove with a slotted spoon. Repeat with remaining chard. Remove, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until hot, about 30 minutes. Serve on a small bed of chard, with pan juices, passing remaining Parmesan at the table."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "To assemble:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Use 1/2 stick of butter to grease a large baking pan generously. Heat oven to 350 degrees. Work with 2 or 3 pasta sheets at a time. Put them on a work surface, long end facing you. Smear a layer of béchamel along that end. Top with a portion of mushrooms and squash. Roll up the long way, enclosing ingredients. As you finish each roll (you should have 8), place it in a baking pan. When all cannelloni are made, dot with remaining butter and pour reserved pasta cooking water into the pan. Sprinkle with half the Parmesan."}]}]}