{"@context": "http://schema.org", "@type": "Recipe", "name": "Turbot Poached in Tarragon Broth", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT4H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "leek, tarragon, turbot, main course", "aggregateRating": null, "recipeIngredient": ["2 whole turbot, 3 pounds each, or other firm, white-fleshed fish", "1 medium onion, peeled", "4 shallots, peeled", "3 medium carrots, peeled", "3 leeks, well washed, outer greens and coarse green ends removed", "2 stalks celery", "2 medium tomatoes", "2 cloves garlic, peeled and crushed", "15 white peppercorns", "Pinch cayenne", "1 cup dry white wine", "1/2 cup white vinegar", "2 bunches tarragon", "1 sprig rosemary", "1 sprig basil", "1 sprig mint", "6 tablespoons unsalted butter", "Kosher salt and freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Have a fishmonger fillet and skin the turbot, then save and chop the bones for you. Rinse bones for 1 hour under cold running water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roughly chop half of the onion, shallots, carrots, leeks, celery and tomatoes. Julienne the remaining onions, shallots and leeks. Thinly slice the remaining carrots and celery. Peel, seed and dice the remaining tomato."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a stockpot halfway with water and bring to a boil. Add the fish bones and blanch for 2 minutes. Drain, rinse and return them to the pot with 2 quarts water. Boil, lower the heat and simmer, uncovered, 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the stock through a fine-mesh sieve, discard the bones and return stock to the pot. Add the roughly chopped vegetables, garlic, white peppercorns and cayenne and bring to a boil. Simmer for 45 minutes, skimming the foam off the top. Add the wine and vinegar; simmer 15 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the stock, discarding solids. Return stock to the pan and add 1 1/2 bunches of the tarragon and the rosemary, basil and mint. Cover the pot and set aside to infuse for at least a half-hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a pot of salted water to a boil and add the remaining vegetables. Cook until just tender, about 3 minutes, then plunge them into cold water to stop the cooking. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reserve 4 small sprigs of tarragon for garnish and chop the rest. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fish with salt and pepper. Strain the stock, discarding the herbs. In a deep skillet, heat the broth. When just simmering, add the fillets. Cook for 3 minutes; turn and cook until opaque throughout, about 3 more minutes. Remove the fillets and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cooked vegetables to the hot broth and heat them. Swirl in the butter and add the chopped tarragon. Season to taste with salt and pepper. Place the fillets in four soup bowls and spoon the tarragon broth and vegetables over them. Add the tarragon sprigs and serve."}]}