{"@context": "http://schema.org", "@type": "Recipe", "name": "Madeline Sorel Bread Pudding From Nancy Silverton At Maxwell's Plum", "description": "", "author": {"@type": "Person", "name": "Bryan Miller"}, "image": null, "totalTime": "PT2H35M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "bread, dessert", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1284, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "205 grams", "cholesterolContent": null, "fatContent": "33 grams", "fiberContent": "8 grams", "proteinContent": "42 grams", "saturatedFatContent": "17 grams", "sodiumContent": "2247 milligrams", "sugarContent": "31 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 cup milk", "1 cup heavy cream", "1 cinnamon stick", "1/2 teaspoon grated nutmeg", "1 vanilla bean, split and scraped", "25 to 28 3/8-inch-thick slices of 3 1/2-inch-diameter French baguette or sourdough bread", "6 ounces (3/4 cup) clarified unsalted butter, melted", "5 tablespoons granulated sugar", "1 teaspoon ground cinnamon", "1/4 cup sugar", "2 tablespoons water", "2 egg yolks", "1 egg", "2 tablespoons sugar Caramelized applesauce (<a href=\"http://cooking.nytimes.com/recipes/989-caramelized-applesauce\">see recipe</a>)", "Creme fraiche or sour cream for topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Scald the milk, cream, cinnamon stick, nutmeg and vanilla bean, including pod. Remove from heat, cover and let stand at least 30 minutes; remove pod and cinnamon stick."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread the bread slices on a baking sheet and toast at 350 degrees for about 10 minutes, until hard but not colored."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix clarified butter with five tablespoons of sugar and one teaspoon of ground cinnamon. Using a pastry brush, paint a thin, even layer of butter on both sides of the bread, coating but not saturating. Keep the sugar and cinnamon mixed with the butter by stirring before coating each bread slice. Lay buttered slices in a single layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In small saucepan, heat one-quarter cup of sugar and two tablespoons of water over high heat. As the mixture boils, brush down the sides of the pan with a pastry brush to dissolve sugar. Boil until the mixture is deep amber. Immediately pour hot caramel mixture over the bottom of a two-quart straight-sided porcelain souffle dish that is three inches deep and seven inches in diameter. Set dish aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a wire whisk, beat the yolks and whole egg with two tablespoons of sugar until the sugar dissolves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the cream mixture to scalding and pour over the beaten yolks, whisking constantly. Strain to remove bits of cinnamon stick and vanilla bean; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place four to six slices of bread on the bottom of the souffle dish. With a serrated knife, cut another slice of bread into pieces to completely fill all gaps. Pour in enough custard just to cover the bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread with half of the applesauce and moisten lightly with custard. Put on another layer of bread, filling in gaps and covering with custard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread with the remaining applesauce and moisten with custard again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the pudding with two layers of bread, pouring on remaining custard. Press down a bit to make sure the custard saturates the entire pudding."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for one hour at 350 degrees on a rack in the upper third of the oven. The pudding will swell up, and when it is done, it will be brown, crusty and set. Cool for 30 minutes, unmold on serving platter and serve warm with creme fraiche or sour cream."}]}