{"@context": "http://schema.org", "@type": "Recipe", "name": "Zuppa di Pesce (Adriatic Fish Soup)", "description": "", "author": {"@type": "Person", "name": "Linda Richardson"}, "image": null, "totalTime": "PT2H", "recipeYield": "About 5 cups", "recipeCuisine": "italian", "recipeCategory": "dinner, project, soups and stews", "keywords": "fall, winter, fish, onion, tomato, main course", "aggregateRating": null, "recipeIngredient": ["3 pounds fresh fish meat, heads, bones and trimmings, washed and drained. Red perch, whiting and a mixture of other flavorful, but not strong-tasting, fish should be used. (See note.)", "1 leek (white and tender green parts), split, washed and cut in half", "1 medium onion, peeled and cut in half", "2 large carrots, peeled and cut into large pieces", "2 stalks celery, with leaves, cut into large pieces", "2 medium tomatoes, coarsely chopped", "1 strip lemon rind, about 1 inch by 3 inches", "7 cups cold water", "1 cup dry white wine", "1 large bay leaf", "6 to 8 sprigs fresh thyme or 1/2 heaping teaspoon dried leaves", "2 teaspoons fresh marjoram leaves or 1/2 teaspoon dried", "3 pounds fresh fish, boned and skinned, if desired. Ideally, use a mixture of monk, blackfish, sea bass, tile and other mild, firm-fleshed fish. Avoid strong-tasting varieties, such as blue fish or halibut, and soft, quick-cooking fish, such as sole or fl", "5 to 6 tablespoons olive oil", "1 large garlic clove, peeled and minced", "2 cups finely chopped onion", "1 cup finely chopped carrots", "1 cup finely chopped celery", "5 cups fish stock", "1/2 teaspoon loosely packed saffron stems or 1/4 teaspoon powdered saffron Reserved cooked fish, if any (see Stock, above)", "5 to 6 tablespoons butter", "3 tablespoons all-purpose flour", "Salt, if desired", "Freshly ground white pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "Stock:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place all ingredients in an 8-quart stockpot, preferably stainless steel. Cover and bring to a boil. Adjust heat so that the mixture is cooking at a medium boil. Cover loosely and cook for 30 minutes, gently stirring once or twice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the stock cool slightly. Remove all solid ingredients with a slotted spoon. Strain the stock carefully through two layers of dampened cheesecloth. (Rinse and wring out the cheesecloth as necessary.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If time permits, pick through the cooked fish and extract as many meaty bits as possible. Discard all bones and skin. Depending on the type and parts of fish used, this will yield 1 to 2 cups of flaked fish. Reserve this for the soup."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let the strained stock cool to room temperature. It may then be refrigerated for up to 3 days or frozen in airtight containers for up to 2 months."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "Soup:", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash and drain the fresh fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 3 tablespoons of olive oil in a skillet and gently saute the garlic, onion, carrots and celery until they begin to soften, about 10 minutes. Do not allow them to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the fish stock into a 4-quart saucepan and add the sauteed vegetables, saffron and reserved cooked fish. Cover and bring to a boil. Lower the heat to a simmer and keep covered."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, melt 3 tablespoons of butter and add the 3 tablespoons of flour to make a roux. Cook over gentle heat, stirring constantly for 2 to 3 minutes. Ladle one cup of hot soup liquid into the roux, stirring rapidly. Add more hot soup until the mixture is smooth and liquid. Pour this into the simmering soup pot and stir until well mixed. Cover the saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pat the fish pieces dry with paper towels. Cut thick pieces into 1-inch cubes. Slice thinner fillets into pieces about 1 1/2 inches long."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a clean skillet, heat 1 tablespoon olive oil and 1 tablespoon butter. When the oil is hot, but not smoking, quickly add as many pieces of fish as will fit into one layer. Saute briefly on all sides, using a spatula to gently turn the fish. The fish should not be allowed to brown or cook through. Remove the fish from the skillet and keep warm. Repeat with the remaining fish, heating the oil and butter before adding the fish pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Immediately add all the sauteed fish, juices and any oil left in the skillet to the soup. Simmer for about 10 minutes, or until the fish can be easily flaked with a fork. Add salt and pepper to taste. Serve in heated soup plates."}]}]}