{"@context": "http://schema.org", "@type": "Recipe", "name": "Spiced Roast Chicken", "description": "", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "chicken, dried red chili, split yellow peas, main course, winter", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 741, "unsaturatedFatContent": "37 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "55 grams", "fiberContent": "3 grams", "proteinContent": "52 grams", "saturatedFatContent": "13 grams", "sodiumContent": "983 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon vegetable oil", "2 tablespoons dried yellow split peas", "3 dried red chilies", "1 teaspoon coriander seeds", "1 teaspoon cumin seeds", "1/2 teaspoon black peppercorns", "1/2 teaspoon fenugreek seeds", "1/2 teaspoon mustard seeds", "1 tablespoon ground turmeric", "3 tablespoons olive oil", "1 whole chicken (about 3 1/2 pounds)", "Kosher salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 500 degrees. In a medium skillet over medium-high heat, heat the vegetable oil. Add the split peas and cook, stirring frequently, until lightly browned, about 40 seconds. Transfer to a bowl. Wipe the skillet clean and return it to medium heat. Add the chilies, coriander, cumin, peppercorns, fenugreek and mustard and cook, stirring, until toasted and fragrant, about 1 1/2 minutes. Add the turmeric and cook, stirring, 10 seconds more. Add to the split peas. When cool, transfer the mixture, in small batches, to a clean coffee grinder and pulse until finely ground. Place in a small bowl and stir in 2 tablespoons of the olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Loosen the skin of the chicken over the breast and down to the thighs. Using your hands, spread all but 1 teaspoon of the spice paste evenly under the skin. Coat the outside of the chicken with the remaining teaspoon of paste and brush with the remaining tablespoon of olive oil. Season generously with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the chicken to a roasting pan fitted with a rack and bake until very brown, about 20 minutes. Lower the temperature to 350 degrees and bake until a thermometer inserted into the thickest part of the inside of the thigh reads 170 degrees, or until the juices run clear when the chicken is pierced there with a knife, about 40 minutes more. Remove from the oven and set aside to rest for 10 minutes. Carve and serve."}]}