{"@context": "http://schema.org", "@type": "Recipe", "name": "Shiitake-Crusted Chicken With Spinach Sauce", "description": "For decades, chicken has been America's most familiar culinary canvas - and its popularity continues to grow. This recipe is adapted from Michel Richard, the chef of the French-California restaurant, Citrus, in Los Angeles, and his three less-ambitious French-California restaurants in Santa Barbara, Calif., Washington and Baltimore -- all called Citronelle.", "author": {"@type": "Person", "name": "Molly O'Neill"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken breast, shiitake, spinach, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 344, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "20 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "6 grams", "proteinContent": "24 grams", "saturatedFatContent": "6 grams", "sodiumContent": "809 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 cups stemmed and coarsely chopped spinach (about 10 ounces)", "2 tablespoons unsalted butter", "1 small Spanish onion, chopped", "2 cloves garlic, finely chopped", "1 tablespoon Champagne vinegar", "1 cup homemade or low-sodium chicken broth", "1 teaspoon granulated sugar", "1/4 teaspoon curry powder", "Kosher salt and freshly ground pepper to taste", "3 tablespoons olive oil", "1 1/2 pounds shiitake mushrooms", "2 large shallots, coarsely chopped", "2 large cloves garlic, finely chopped", "Kosher salt and pepper to taste", "6 large boned and skinned chicken breast halves, tenderloins removed and reserved (about 2 1/4 pounds)", "2 tablespoons plain bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the sauce, in a large pot of salted boiling water, cook the spinach until deep green, about 45 seconds. Drain it and transfer to a plate to cool. When cool enough to handle, squeeze out the excess liquid and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan over medium heat, heat the butter. Add the onion and cook, stirring occasionally, until soft, about 5 minutes. Add the garlic, vinegar, broth, sugar and curry and bring to a boil. Boil until reduced by a third, about 1 1/2 minutes. Stir in the spinach and return to a boil. Remove from the heat and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the spinach mixture has cooled, transfer to a blender and puree until smooth. Season with salt and pepper and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the chicken, in a large skillet over high heat, heat 2 tablespoons of the oil. Add the mushrooms, shallots and garlic and cook, stirring occasionally, until lightly browned and soft, about 6 minutes. Season with salt and pepper. Transfer the mushroom mixture to a baking sheet in an even layer and set aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. When the mushroom mixture is cool, transfer to a food processor with the chicken tenderloins and pulse until a paste forms. Divide the paste into 6 equal portions. Season the chicken breasts with salt and pepper. On a work surface, lay out a 12-inch length of heavy-duty plastic wrap and place 1 portion of the paste in the center. Fold the plastic in half and, using a rolling pin, flatten the paste until slightly larger than half a chicken breast. Unfold the plastic and place a piece of chicken, smooth-side down, on the paste and gather the plastic up and around the breast. Cut the excess plastic and discard. Transfer the wrapped chicken, paste-side up, to a parchment-lined baking sheet. Repeat with the remaining paste and chicken breasts. Bake until firm and cooked through, about 25 minutes. (The plastic will not melt.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the chicken from the oven and preheat the broiler. Carefully unwrap the plastic and return the breasts, paste-side up, to the baking sheet relined with foil. Brush with the remaining tablespoon of oil and lightly sprinkle with bread crumbs. Broil until golden brown, about 3 minutes. Set aside for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat the sauce. Slice the breast halves on the diagonal and arrange each one on a plate, fanning out the slices. Ladle the sauce alongside each breast and serve."}]}