{"@context": "http://schema.org", "@type": "Recipe", "name": "Sea Bass and Arugola Soup", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "lunch, soups and stews", "keywords": "appetizer, arugula, potato, sea bass, summer", "aggregateRating": null, "recipeIngredient": ["1 sea bass, weighing approximately 2 1/2 pounds (see note)", "1 cup dry white wine", "2 cups water", "1 bay leaf", "6 black peppercorns", "1 teaspoon sea salt", "3 tablespoons olive oil", "1 large leek, thinly sliced", "1 bunch arugola, chopped", "1 to 2 cups chicken stock", "2 medium potatoes, peeled and diced", "1/2 cup buttermilk", "Salt and pepper to taste, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse fish carefully to remove blood. Place in a soup or fish kettle and add wine, water, bay leaf, peppercorns and salt. Place over medium-low heat and bring slowly to a simmer. Simmer very gently about 10 minutes, or until fish is cooked through but still firm. Remove from heat. When cool enough to handle, remove fish from broth. (Do not discard broth.) Skin and bone fish, break into small chunks and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another pot, add olive oil and, over medium heat, saute sliced leek until softened. Add about 2 1/2 cups of the arugola, reserving the rest for garnish. Stir to mix well with the leek and let simmer gently several minutes until arugola has softened."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain the fish broth through a cheesecloth. There should be about 3 cups of broth. Add enough chicken stock to make total of 4 cups, and add this to arugola mixture. Add diced potatoes. Bring to a simmer, then cover and cook gently about 40 minutes, until potatoes are very soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove soup from heat. Add reserved fish and buttermilk. Stir to mix. Taste, adding salt if necessary and freshly ground black pepper if desired. Serve immediately."}]}