{"@context": "http://schema.org", "@type": "Recipe", "name": "Minestrone Fredda", "description": "", "author": {"@type": "Person", "name": "Nancy Harmon Jenkins"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "lunch, one pot, soups and stews", "keywords": "appetizer, main course, peas, potato, tomato, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 365, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "11 grams", "proteinContent": "17 grams", "saturatedFatContent": "3 grams", "sodiumContent": "740 milligrams", "sugarContent": "8 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 clove garlic", "1 small bunch parsley", "1 small onion", "2 fresh sage leaves", "2 ounces bacon, if desired", "2 tablespoons good-quality olive oil", "2 medium-size carrots", "1 stalk celery", "2 small zucchini", "3 medium potatoes", "12 or more fresh basil leaves", "1 pound ripe red plum tomatoes", "1/2 pound fresh borlotti beans, or soaked dried beans", "1 pound fresh peas", "1/4 cabbage", "1/2 cup rice", "Salt to taste, if desired", "1/2 cup freshly grated Parmesan cheese", "Freshly ground black pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a battuto by mashing garlic and chopping finely, together with parsley, onion, sage and, if used, bacon. In a soup kettle, saute the battuto in olive oil over medium heat until onion starts to brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While battuto is cooking, scrape and thinly slice carrots. Thinly slice celery stalk. Cut zucchini into strips approximately one inch long and half an inch wide. Scrape potatoes and cut into large dice. Shred 8 leaves of basil, reserving the rest for garnish. Cut tomatoes into chunks. Shell beans, if using fresh ones. Place all these vegetables in the kettle with battuto and stir to mix well. Add about 10 cups water. Bring to a boil. Cover and simmer gently 40 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Test beans to see if they are done. They should be tender, but not falling apart. If potatoes have not disintegrated in the broth, mash them coarsely with a fork against the side of the kettle to thicken the soup. Add shelled peas, cover and cook 15 minutes over medium-low heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate cabbage leaves, cut out the thick central ribs and discard. Shred cabbage. Add to kettle with rice and a pinch of salt, if desired. Stir and continue cooking until rice starts to soften but still has bite to it - al dente."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat. Soup may be served immediately, sprinkled with fresh Parmesan, freshly ground black pepper and remaining basil, minced. Or serve it as the Milanese do in the summer: Fill soup plates and sprinkle each portion with grated parmesan, pepper and basil. Then cover each plate with a cloth and set aside to cool. Do not refrigerate, and do not cover with plastic or foil - the hot soup will sweat and the moisture will drip back into it."}]}