{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese Chicken in the Pot (Variation on Shabu Shabu)", "description": "", "author": {"@type": "Person", "name": "Barbara Kafka"}, "image": null, "totalTime": "PT1H", "recipeYield": "8 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner, one pot", "keywords": "chicken, shiitake, water chestnuts, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 931, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "48 grams", "fiberContent": "4 grams", "proteinContent": "66 grams", "saturatedFatContent": "13 grams", "sodiumContent": "2026 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 cups canned chicken broth", "1 ounce (2 packages) dried shiitake mushrooms", "8 cloves garlic, smashed and peeled", "1 1/2-inch-thick slice of peeled fresh ginger, cut across into 1/8-inch-thick slices and then into thin strips", "2 bunches scallions, root end trimmed, with white part cut into 2-inch lengths and half of the greens cut into 2-inch lengths to equal 1 cup greens", "6 ounces snow pea pods, tipped and tailed", "2 8-ounce cans peeled and sliced water chestnuts, drained and rinsed well under cold water", "2 4-pound chickens, each cut into 8 serving pieces and skinned, with any excess visible fat removed (backs, necks and wing tips reserved for another use)", "2 whole star anise or 1 heaping tablespoon star anise pieces", "1/2 cup soy sauce", "6 cups cooked white rice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 cups of the broth until warm, and soak the mushrooms in the warm broth for 15 minutes. While the mushrooms are soaking, prepare the garlic, ginger, scallions, snow peas and water chestnuts, and skin the chicken, if necessary. After 15 minutes, drain the mushrooms, straining the liquid through a coffee filter, and reserve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chicken, the 6 remaining cups of stock, the garlic, ginger and star anise in a large wide pot. Cover. Bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the mushroom liquid and soy sauce. When it returns to a moderate boil, add the scallion whites and mushrooms. Continue cooking, uncovered, at a moderate boil for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sliced water chestnuts and scallion greens, poking them down into the liquid. Place the snow peas on top. Cover, and return to a moderate boil. Uncover, and adjust the heat to remain at a moderate boil for 3 to 4 minutes or until the snow peas are cooked thoroughly but still crunchy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove chicken pieces to a platter with tongs. Skim the vegetables out with a slotted spoon, and scatter them over the top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve 1/2 to 2/3 cup of cooked rice in bottom of each bowl. Divide the chicken and vegetables evenly among the bowls, and top each with 1 cup broth."}]}