{"@context": "http://schema.org", "@type": "Recipe", "name": "Lucas Schoormans’s Lemon Tart", "description": "Lucas Schoorman, a Chelsea art dealer and hobbyist baker, introduced this elegant lemon tart to the Times in 2004. It's a showstopper dessert featuring two distinct, delicious layers: one of frangipani, an almond-rich custard, and another of shimmering lemon confit scattered with slices of lemon. It is mellow and barely sweet, rich and deep, with none of the attack of so many lemon desserts.\n\nBegin steeping the lemon slices the night before you're planning on baking the tart. This softens the rinds and coaxes out their bitterness.", "author": {"@type": "Person", "name": "Jonathan Reynolds"}, "image": "https://static01.nyt.com/images/2018/01/31/dining/Lemon-Tart/Lemon-Tart-articleLarge-v2.jpg", "totalTime": "PT10H", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "project", "keywords": "almonds, frangipani, lemon, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 102}, "recipeIngredient": ["4 lemons, thinly sliced, ends and seeds discarded", "1 cup sugar", "1 vanilla bean, split and seeds scraped", "2 cups all-purpose flour", "9 tablespoons sugar", "1/4 teaspoon salt", "6 tablespoons cold, unsalted butter", "3 large egg yolks", "11 tablespoons softened, unsalted butter", "2/3 cup ground almonds", "2 tablespoons flour", "1/2 cup sugar", "Grated zest from 1 lemon", "2 large eggs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the confit: place sliced lemons in a bowl and cover with boiling water. Steep 4 to 8 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain lemons, place in a saucepan and cover with cold water. Simmer gently until lemon rind is just softened, about 5 minutes. Let cool, then drain the lemons again, reserving 1 cup of the cooking liquid. Return lemon slices and reserved liquid to the pan and add sugar and vanilla bean and seeds. Simmer 5 minutes. Use tongs or a slotted spoon to transfer slices to a wire rack to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan with the liquid to the stove. Bring to a boil and cook until thick and reduced to about 2/3 cup. Discard the vanilla bean. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the pastry dough: pulse together the flour, sugar and salt in a food processor. Add butter and pulse until pieces are no larger than peas. Add yolks and pulse until you have a dough that just pulls away from the sides of the bowl; add a tablespoon or two of water if necessary. Form dough into a disc, wrap in plastic and refrigerate 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the bottom from an 11-inch tart pan and place it on a work surface."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put two-thirds of the dough on top, and using a floured rolling pin, roll dough over the tart-pan bottom to cover. Using a knife, trim the excess dough. Lift and place bottom back in the tart ring. Using your fingers, break off bits of the remaining dough and press them onto the sides of the pan to cover. Roll the pin over the top of the pan to trim. Refrigerate 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 400 degrees. Cover the dough with parchment paper, weigh down with rice or beans and bake until edges are just browned, 10 to 15 minutes. Take out of the oven and remove parchment and rice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the filling: in the bowl of a mixer, cream the butter. Beat in almonds and flour. Beat in sugar and zest. Beat in eggs one at a time. Scrape into the baked crust and return to the oven. Bake until filling is browned and firm to the touch, about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay lemon slices over top of tart. Gently reheat lemon syrup and pour over tart. Tart may be served chilled or at room temperature."}]}