{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Lamb With Garlic And Cinnamon", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "cinnamon stick, garlic, lamb, main course", "aggregateRating": null, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "2 pounds lamb, preferably from the shoulder, cut into 1- to 2-inch chunks", "Salt and pepper to taste", "5 or 6 cloves garlic, peeled and slivered", "6 3-inch pieces of cinnamon", "1 cup dry white wine, stock or water", "4 plum tomatoes (canned are fine), chopped", "1 lemon, quartered"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put oil in a large, deep skillet over medium-high heat. A minute later, add as many chunks of lamb as will fit without crowding (cook in batches, if necessary). When meat browns (3 to 4 minutes) turn chunks and sprinkle them with salt and pepper. Adjust heat so pieces brown as rapidly as possible without burning. After each has browned on 2 sides, remove from pan and add another piece or two until all meat has been browned (10 to 15 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all meat has been removed from pan, turn off heat and allow the pan to cool a bit. Turn heat back to medium and add garlic and cinnamon. Cook for about 30 seconds, then add the wine; raise heat to high and let wine bubble away for a minute. Add the tomatoes and cook, stirring occasionally, for about a minute. Return meat to pan and cover; adjust heat so mixture bubbles very gently. (If it cooks too quickly, you may have to add a little water.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, undisturbed, until meat is very tender, about 1 1/2 hours. Taste and adjust seasoning, then serve over rice or buttered noodles, with lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/10050-braised-lamb-with-garlic-and-cinnamon"}