{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Bread Crumbs and Anchovies, Sicilian Style", "description": "Here's a delightfully simple yet deeply flavorful Sicilian-style pasta sauce from Paula Wolfert, the prolific Mediterranean cookbook author. As you wait for your pasta to cook, sauté a garlic clove in a good bit of olive oil, then discard the clove. Toss in two cans of anchovy fillets and mash them with the back of your spoon until they dissolve into a fragrant sauce. Drain the pasta, then combine it with the anchovy sauce and serve. Sprinkle with chopped fresh parsley for color and toasted bread crumbs for crunch. If you're serving this as a main course, double the recipe, for four generous servings.", "author": {"@type": "Person", "name": "Paula Wolfert"}, "image": "https://static01.nyt.com/images/2017/03/07/dining/07COOKING-PASTA-BREADCRUMBS-ANCHOVIES1/07COOKING-PASTA-BREADCRUMBS-ANCHOVIES1-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "4 appetizer servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, pastas", "keywords": "anchovy, bread crumbs, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 260}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 542, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "9 grams", "proteinContent": "19 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1290 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1/3 cup Sicilian olive oil or substitute a good fruity, green olive oil", "1 garlic clove, peeled and halved", "2 pinches of red-pepper flakes", "2 2-ounce cans flat fillets of anchovy, drained, rinsed, dried and cut small", "1/2 pound spaghettini, preferably imported, made of 100 percent durum wheat", "2 tablespoons roughly chopped fresh Italian parsley", "1 1/4 cups coarse fresh bread crumbs, toasted (see notes)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place olive oil and garlic in a heavy skillet and gently cook the garlic over medium heat until golden. Discard garlic. Add the red-pepper flakes and anchovies and mash to a puree with the back of a wooden spoon over very low heat, about one minute. Remove from heat. Do not allow oil to get very hot. Can be prepared in advance to this point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the spaghettini in boiling, salted water until cooked al dente. While the pasta is cooking, transfer three tablespoons of the pasta cooking water to the anchovy-oil mixture in order to stretch the sauce; reheat carefully. Drain pasta, then transfer it to the skillet and toss with the hot sauce. Divide evenly on four heated dishes, sprinkle with parsley and serve at once. Pass the bread crumbs."}], "link": "https://cooking.nytimes.com/recipes/1006-pasta-with-bread-crumbs-and-anchovies-sicilian-style"}