{"@context": "http://schema.org", "@type": "Recipe", "name": "Coq au Vin With Roasted Vegetables", "description": "", "author": {"@type": "Person", "name": "Peter Mcquaid"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "carrot, chicken legs, onion, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 39}, "recipeIngredient": ["4 whole chicken legs with skin on", "Salt and pepper", "2 tablespoons olive oil", "8 ounces smoked slab bacon, cut in 1/4-inch dice or lardons", "2 large carrots, peeled and coarsely chopped", "2 large onions, peeled and coarsely chopped", "1 small celery stalk, coarsely chopped", "2 garlic cloves, unpeeled, crushed", "3 tablespoons all-purpose flour", "3 cups red wine", "1 small bunch parsley", "1/2 bunch fresh thyme, plus additional for garnish", "1 bay leaf", "1 to 2 cups chicken stock", "1 tablespoon olive oil", "1 tablespoon butter", "12 baby carrots, trimmed and peeled", "12 cipollini onions, trimmed and peeled", "Salt and pepper", "12 crimini mushrooms, cleaned, trimmed and cut vertically in half"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 325 degrees. Season chicken with salt and pepper. Heat 2 tablespoons oil in a 5-quart Dutch oven over medium-high heat, add chicken and brown. Place chicken in a bowl and spoon out fat from pan. Sauté two-thirds of the bacon in the pan until bacon is lightly browned and fat is rendered, about 5 minutes. Put bacon in a bowl and add vegetables and garlic to the pan. Sprinkle with 1 teaspoon salt and 1/2 teaspoon pepper. Sauté until vegetables start to soften, about 5 minutes. Sprinkle with the flour and stir to coat. Cook, stirring, 2 minutes. Add wine and stir to blend. Add chicken, herbs and enough stock to cover. Heat just to boiling, cover and place in oven. Bake for 1 1/2 to 2 hours or until the meat begins to come off the bone."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While chicken cooks, sauté remaining diced bacon in a 12-inch nonstick skillet over medium heat until crisp. Remove and set aside. Reserve drippings in skillet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the vegetables, add 1 tablespoon each olive oil and butter to bacon drippings in skillet. Add carrots and cipollini onions and sprinkle with salt and pepper. Sauté until nicely browned, about 5 minutes. (Brown vegetables separately if using a smaller skillet.) Remove to a roasting pan with a slotted spoon and set aside. Brown mushrooms in drippings, about 3 minutes, and place in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When chicken is done, put in a large bowl with a slotted spoon. Raise oven temperature to 350 degrees. Strain braising liquid into a 3-quart saucepan and spoon off fat. Boil until liquid is reduced to 2 cups, about 15 minutes. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, roast the carrots and onions in the oven until tender, about 10 minutes, adding mushrooms the last 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, top each chicken leg with braising liquid, roasted vegetables, mushrooms and bacon. Garnish with thyme sprigs."}]}