{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Saddle of Lamb With Champagne Sauce", "description": "", "author": {"@type": "Person", "name": "Craig Claiborne"}, "image": null, "totalTime": "PT2H", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, roasts", "keywords": "champagne, chicken breast, lamb, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 958, "unsaturatedFatContent": "24 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "74 grams", "fiberContent": "0 grams", "proteinContent": "66 grams", "saturatedFatContent": "35 grams", "sodiumContent": "1114 milligrams", "sugarContent": "2 grams", "transFatContent": "3 grams"}, "recipeIngredient": ["1 saddle of lamb, 5 1/2 to 6 pounds, boned (have butcher do this)", "2 or 3 skinless, boneless chicken breast halves, about 2/3 pound", "6 ounces fresh chicken livers", "2 large egg whites, about 1/4 cup", "3/4 cup creme fraiche or heavy cream", "Salt to taste if desired", "Freshly ground pepper to taste", "2/3 cup dry champagne", "1 1/2 cups heavy cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place saddle of lamb, boned side up, on flat surface. Fold over each filet, horseshoe fashion, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut chicken breast halves into 1-inch cubes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away and discard connecting membranes and tissues of livers. Cut away and discard any dark spots."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put chicken and livers into container of food processor or blender and blend as finely as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour and scrape the mixture into a mixing bowl and add egg whites. Beat thoroughly with wire whisk. If creme fraiche is used, add it to bowl. If 3/4 cup of heavy cream is used, beat it until it is half whipped. Do not beat the cream until stiff. Add it to bowl and blend well. Add salt and pepper and blend. Chill thoroughly in refrigerator or in freezer until mixture is quite cold. This is essential."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 500 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle opened-up saddle of lamb with salt and pepper. Spoon cold chicken and liver mixture up and down the center of the saddle. Place one folded-over filet of lamb at each end of the chicken and liver mixture to prevent an overflow. Fold over the flaps of the lamb to completely enclose the filling. Tie lamb with string in both directions to contain filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place lamb, fat side down, on heatproof baking dish and let brown on one side. Turn and brown on other side. Place in oven and bake 15 minutes. Turn and continue cooking 30 minutes. Remove from oven and discard strings. Let stand 15 minutes before carving."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare sauce. Remove lamb from roasting pan and pour off excess fat. Discard any bits of filling that have fallen out. Put roasting pan on stove and add champagne, stirring to dissolve brown particles that cling to bottom of pan. Cook until reduced by half and add 1 1/2 cups heavy cream. Add salt and pepper and cook over high heat about 5 minutes. Put sauce through strainer and reheat. Serve hot."}]}