{"@context": "http://schema.org", "@type": "Recipe", "name": "Meal in a Bowl With Chicken, Rice Noodles and Spinach", "description": "This comforting soup is a simplified version of a Vietnamese phô or a Japanese ramen (using rice sticks instead of somen).", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/01/13/health/nutrition/13recipe.health.ready/13recipe.health.ready-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4 to 6 (you’ll have some chicken left over)", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, chicken, rice noodles, dairy-free, gluten-free, halal, healthy, kosher, low sugar, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 77}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 495, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "2 grams", "proteinContent": "32 grams", "saturatedFatContent": "7 grams", "sodiumContent": "663 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 smallish chicken, about 3 to 3 1/2 pounds, cut up and skinned, or the equivalent of chicken pieces, skinned", "1 onion, quartered", "1 piece ginger root, about 2 inches long, peeled and sliced", "4 garlic cloves, peeled", "1 teaspoon peppercorns", "Salt to taste", "2 tablespoons Vietnamese or Thai fish sauce (you can substitute soy sauce if you don’t have fish sauce)", "1/2 pound dried rice noodles (rice sticks)", "1 5- or 6-ounce bag baby spinach", "1 cup chopped cilantro", "2 limes, cut into wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If possible, do this step a day ahead: Combine the chicken and 3 quarts water in a large, heavy soup pot and bring to a simmer. Skim off foam and add the onion, ginger root, garlic cloves, peppercorns and 1 teaspoon salt. Reduce the heat, cover partially, and simmer 40 minutes. Skim occasionally. Remove the chicken pieces from the broth and allow to cool. Line a strainer with cheesecloth and strain the broth into a bowl. When the chicken is cool enough to handle, shred and refrigerate in a covered container until ready to serve the soup. Refrigerate the broth for at least 3 hours or, preferably, overnight. Lift off the fat from the surface and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 30 minutes before you wish to serve the meal, remove the chicken and broth from the refrigerator. Bring the broth to a simmer and add the fish sauce (or soy sauce) and salt to taste. Taste and adjust seasonings. Place the rice noodles in a bowl and cover with hot water. Let sit for 20 minutes, then drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Add the noodles and cook just until tender, 30 seconds to a minute. Drain and rinse with cold water. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, add the spinach to the simmering soup. To serve the soup, distribute the noodles among 4 to 6 large bowls. Top with shredded chicken and a handful of chopped cilantro. Ladle the simmering broth, with some of the spinach, into each bowl over the chicken and noodles. Serve at once, passing the limes for guests to squeeze on as they wish."}]}