{"@context": "http://schema.org", "@type": "Recipe", "name": "Rice Balls Stuffed With Mozzarella and Beef (Supplì al Telefono)", "description": "Supplì al telefono are rice balls stuffed with ground meat and mozzarella, then breaded and fried. They are a classic Roman snack. Serve them as an appetizer, and pair them with an aperitif like Prosecco or Campari.", "author": {"@type": "Person", "name": "Alex Witchel"}, "image": "https://static01.nyt.com/images/2014/06/06/dining/Rice-Balls/Rice-Balls-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "12 to 14 rice balls (about 4 servings)", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "appetizer, arborio rice, ground beef, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 9}, "recipeIngredient": ["3 tablespoons olive oil", "1/3 cup finely chopped onion", "7 ounces ground beef", "7 ounces crushed peeled tomatoes (one scant cup)", "Salt", "ground black pepper", "3 cups vegetable broth (canned or homemade)", "10 ounces (about 1 1/3 cup) carnaroli or other arborio rice", "2 tablespoons grated Parmigiano-Reggiano", "Flour, for dredging", "2 eggs, lightly beaten", "1 cup fine, dry bread crumbs", "3 ounces mozzarella, cut into 12 to 14 cubes", "Corn oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large saucepan over medium-low heat, heat olive oil and add onion. Sauté until soft and golden, about 10 minutes. Add beef and sauté until browned. Add tomatoes and season to taste with salt and pepper. Simmer for 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 cups vegetable broth and bring to a boil. Add rice and simmer, stirring constantly, until mixture is very thick and rice has no crunch but is still firm, about 15 minutes. If pan becomes dry during cooking, add more broth as needed. Remove from heat and stir in Parmigiano-Reggiano. Spread in a flat container or pan and allow to cool. Rice may be covered and refrigerated for up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once rice has cooled, roughly divide it into 12 to 14 mounds. Line up the flour, eggs and bread crumbs in three shallow bowls. Scoop about two-thirds of a mound of rice and hold it in your hand. Press a cube of mozzarella into middle, top with remaining third of mound, and shape rice around it to form a ball, making sure mozzarella is securely closed in center. Roll rice ball in flour, then eggs, then bread crumbs; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a large skillet with about 1 inch of oil. Place over medium heat and allow to become very hot but not smoking. Add all the rice balls and allow to sit until golden brown underneath, 1 to 2 minutes, then turn to brown other sides. Drain on paper towels and serve immediately."}]}