{"@context": "http://schema.org", "@type": "Recipe", "name": "Collard Greens Stuffed With Raisins, Nuts and Rice", "description": "If greens, raisins, nuts and grains of rice all symbolize prosperity, then you’ll do well to make this recipe for your New Year’s Eve party. Collard greens are great stuffing leaves; they are large and easy to work with, and they can stand up to long simmering. The filling is a typical Greek dolmades filling.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/01/01/health/nutrition/01recipehealth-collardgreens/01recipehealth-collardgreens-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "About two dozen stuffed leaves", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "collard greens, rice, dairy-free, gluten-free, healthy, high fiber, low cholesterol, low-sodium, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 65, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "176 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 large bunch collard greens (about 1 1/2 pounds), stemmed", "1/4 cup extra virgin olive oil", "1 large red or yellow onion, finely chopped", "4 garlic cloves, green shoots removed, minced", "Salt to taste", "1 teaspoon sugar", "3/4 cup rice, either medium-grain or basmati, rinsed well in several changes of water", "2 tablespoons to 1/4 cup lightly toasted pine nuts (to taste)", "1 14-ounce can chopped tomatoes, drained (retain juice)", "2 tablespoons to 1/4 cup currants or dark raisins (to taste)", "3/4 teaspoon cinnamon", "3/4 teaspoon freshly ground allspice berries", "1/2 teaspoon freshly ground black pepper", "1 1/4 cups water", "2 tablespoons chopped fresh mint", "1/4 cup chopped fresh dill", "Juice of 1 lemon", "1 lemon, sliced thin (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil while you carefully stem the collard greens, trying to keep the leaves intact. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the collard leaves in batches. Blanch two minutes and transfer to the ice water. Drain, gently squeeze out excess water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the oil over medium heat in a large lidded skillet, and add the onion. Cook, stirring, until tender, about 5 minutes. Add the garlic, salt and sugar, and cook, stirring, until the garlic is fragrant, about a minute. Add the rice and pine nuts, and stir together until the rice is coated with oil. Stir in the tomatoes, currants, cinnamon, allspice and salt and pepper to taste. Stir together, and add 1 cup water or enough to barely cover the rice. Bring to a boil, reduce the heat, cover and simmer until all of the liquid has been absorbed, about 20 minutes. Remove from the heat. Allow to sit for 10 minutes without disturbing. Stir in the mint and dill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Oil a wide, deep, lidded sauté pan or saucepan with olive oil. To fill the leaves, place one on your work surface, vein side up and with the stem end facing you. The leaf may have a big space in the middle where you stemmed it; if so, pull the two sides of the leaf in towards each other and overlap them slightly. Place about 1 level tablespoon of filling on the bottom center of each leaf. Fold the sides over, then roll up tightly, tucking in the sides as you go. Place seam side down in the pan, fitting the stuffed leaves in snug layers. Drizzle on the remaining 2 tablespoons olive oil, and pour on the lemon juice. Barely cover with water, and top with a layer of lemon slices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the stuffed leaves with a round of parchment paper, and place a plate over the paper to weight them during cooking. This will keep them from opening. Bring to a simmer, cover and simmer over low heat for 45 minutes to an hour until the leaves are tender. Remove from the heat, and carefully remove the dolmades from the water with a slotted spoon or tongs. Allow to drain on a rack set over a sheet pan. Serve warm or cold."}], "link": "https://cooking.nytimes.com/recipes/1012959-collard-greens-stuffed-with-raisins-nuts-and-rice"}