{"@context": "http://schema.org", "@type": "Recipe", "name": "A Plain Pizza Pie", "description": "Don't ever listen to the deadbeats who tell you that it’s hard to cook pizza, that it can’t be done at home. They're wrong. Your pizza may look a little funny. It may be ovoid, crackly in parts. It may have soft spots. But it will still be pizza, and it will still be delicious, and it is cheap to boot. “You are cooking a flatbread,” the great home-cook pizzaiola Jeffrey Steingarten told me in 2009. “You are cooking a flatbread on a rock, part of a continuum that goes back thousands and thousands of years.”", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2009/04/19/magazine/19food-600.jpg", "totalTime": "PT1H", "recipeYield": "Serves 2", "recipeCuisine": "italian", "recipeCategory": "dinner, pizza and calzones", "keywords": "main course, mozzarella, pizza dough, tomato, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 257}, "recipeIngredient": ["1 28-ounce can San Marzano tomatoes", "1 ball <a href=\"http://cooking.nytimes.com/recipes/1016230-robertas-pizza-dough\">pizza dough</a>", "8 ounces fresh mozzarella, cut into 1-inch cubes", "2 tablespoons basil leaves, thinly sliced", "Extra-virgin olive oil, to drizzle", "Kosher salt", "Freshly cracked black pepper", "Grated Parmesan, to sprinkle"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 45 minutes before cooking, preheat the oven and pizza stone to 550 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the tomatoes over a fine-mesh strainer, reserving the liquid for another use. Break up the tomatoes and drain the juices, pressing them with a wooden spoon. The tomatoes should be fairly dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough on a heavily floured surface and stretch and pull, using your hands or a rolling pin, into about a 14-inch round. Place on a lightly floured pizza peel or rimless baking sheet. Cover with the toppings, being careful not to press on the dough and weigh it down: the crushed tomatoes first, then the cheese, leaving roughly a 1/2-inch border. Shake the pizza peel slightly to make sure the dough is not sticking. (Gently lift any sections that are sticking and sprinkle the peel with flour.) Carefully slide the pizza directly onto the baking stone in one quick, forward-and-back motion. Cook until the crust has browned on the bottom and the top is bubbling and browning in spots, about 7 minutes. Top with the basil, and season with olive oil, salt, pepper and Parmesan. Serve hot. Makes 1 pizza."}], "link": "https://cooking.nytimes.com/recipes/1012498-a-plain-pizza-pie"}