{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti Squash With Garlic, Parsley and Breadcrumbs", "description": "Spaghetti squash gets its name from the fact that once it is cooked, the flesh breaks down into long spaghettilike strands. I find spaghetti squash a bit dull on its own, as it does not have the sweetness and depth of many other winter squash. But it is hard to resist substituting spaghetti squash for pasta every once in a while, and the squash will pick up other robust flavors in the dish. Most spaghetti squash are pretty large; you will need only half of a 3 to 3 1/2-pound squash for this recipe. You can toss the leftovers with tomato sauce the next day.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/10/health/nutrition/10recipehealth/10recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "dairy-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, summer, spaghetti squash", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 361}, "recipeIngredient": ["1 spaghetti squash, about 3 pounds", "2 tablespoons extra virgin olive oil", "3 to 4 large garlic cloves, green shoots removed, minced", "2 tablespoons breadcrumbs", "2 tablespoons finely chopped flat-leaf parsley", "Salt", "freshly ground pepper to taste", "Freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Pierce the squash in several places with a sharp knife. Cover a baking sheet with foil, and place the squash on top. Bake for one hour, until the squash is soft and easy to cut with a knife. Remove from the heat, and allow to cool until you can handle it. Cut in half lengthwise, and allow to cool some more. Remove the seeds and discard. Scoop out the flesh from half of the squash, and place in a bowl. Run a fork through the flesh to separate the spaghettilike strands. You should have about 4 cups of squash. (Use some squash from the other half if necessary). Set aside the other half for another dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy nonstick skillet over medium heat, and add the garlic and bread crumbs. When they begin to sizzle and smell fragrant and the breadcrumbs are crisp — that is, after about a minute — stir in the squash and parsley, and season to taste with salt and pepper. Toss together over medium heat until the squash is infused with the garlic and oil and heated through, 6 to 8 minutes. Remove to a warm serving dish, top with freshly grated Parmesan and serve."}], "link": "https://cooking.nytimes.com/recipes/1012871-spaghetti-squash-with-garlic-parsley-and-breadcrumbs"}