{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan Cooked Carrot Salad", "description": "There are many versions of this cooked carrot salad throughout the Middle East and North Africa. This one, seasoned with lemon juice, cumin, garlic and olive oil, is always a crowd pleaser. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/01/21/health/nutrition/21recipe.health.ready/21recipe.health.ready-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves 4", "recipeCuisine": "moroccan", "recipeCategory": "easy, quick, salads and dressings", "keywords": "carrot, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 149}, "recipeIngredient": ["1 pound carrots, peeled and thinly sliced", "3 to 4 tablespoons extra virgin olive oil (to taste)", "2 large garlic cloves, minced or pureed in a mortar and pestle with 1/4 teaspoon salt", "Salt to taste", "1/2 teaspoon freshly ground pepper", "1 teaspoon cumin seeds, lightly toasted and ground", "2 to 3 tablespoons fresh lemon juice (to taste)", "1/4 cup chopped flat-leaf parsley", "Imported black olives", "2 hard boiled eggs, cut in wedges (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the carrots in a steamer above 1 inch of boiling water, cover and steam 5 to 8 minutes, until tender. Remove from the heat, rinse with cold water, and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil in a large, heavy skillet and add the garlic and cumin. Cook, stirring, for about 30 seconds, until the garlic smells fragrant, and stir in the carrots, pepper, and salt to taste. Stir together for a few minutes, until the carrots are nicely seasoned. Remove from the heat and stir in the lemon juice, remaining olive oil, and the parsley. Taste and adjust salt and lemon juice as desired. Transfer to a platter, and decorate with olives and hard-boiled eggs if desired. Serve at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1012651-moroccan-cooked-carrot-salad"}