{"@context": "http://schema.org", "@type": "Recipe", "name": "Fergus Henderson’s Trotter Gear", "description": "Trotter gear? The British chef Fergus Henderson calls it that – an unctuous and shockingly delicious jellied broth made from pigs’ feet, vegetables and Madeira that imparts an intensely flavorful, lip-sticking quality to any stew or soup to which it is added. He gave The Times the recipe in 2009. It is project cooking at its most exciting and slightly ridiculous – a four- or five-hour process that yields 6 or so cups of glory to punch up any recipe for beans that you have on hand, elevate a beef-and-Guinness pie to extraordinary heights, make fantastic an otherwise benign casserole of baked chicken thighs. Friends and family will ask: What’s the secret ingredient? Say nothing until well after all the plates are cleared.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/03/05/dining/ss-trotter-gear/merlin_150673191_7722d1b3-2c97-4805-808b-00ca9e209c5a-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "Makes about 6 cups", "recipeCuisine": "british", "recipeCategory": "soups and stews", "keywords": "dairy-free, gluten-free, pigs feet, red wine, vegetables, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 165}, "recipeIngredient": ["3 trotters (pigs’ feet)", "2 red onions, halved", "2 ribs celery, chopped", "2 carrots, peeled and chopped", "2 leeks, cleaned and chopped", "1 head garlic", "2 bay leaves", "12 black peppercorns", "2 sprigs thyme", "1 cup Madeira or other sweet wine, or one bottle red wine", "About 1 quart chicken stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place everything but the liquids in a large pot. Pour in the wine and enough chicken stock to cover. Bring to a boil over high heat, reduce to a simmer and cook for 3 hours, until the meat falls off the bone and, in Henderson’s words, the trotters are “very wobbly.”"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the trotters from the pot. Strain the stock. Pluck the meat, flesh and skin from the bones and chop. (There are a lot of bones.) Discard the bones. Stir the meat, flesh and skin back into the stock, then serve."}]}