{"@context": "http://schema.org", "@type": "Recipe", "name": "Pizza With Shrimp, Bacon and Artichoke Hearts", "description": "Homemade pizza is meant to be imperfect, Sam Sifton argued in 2009, in bringing this recipe to The Times. “Your pizza may look a little funny,” he wrote. “It may be ovoid, crackly in parts. It may have soft spots. But it will still be pizza, and it will still be delicious, and in these parlous times, it is cheap to boot.” But, still, it’s worth making — and topping as you please. Do as Chris Schlesinger, formerly of the East Coast Grill in Cambridge, Mass., does, and add shrimp and artichoke hearts to a flatbread. This recipe takes that idea one step further, studding the flatbreads with Asiago cheese for richness and depth. It may not be a perfect pie, but who needs perfection when you have deliciousness?", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "Serves 2", "recipeCuisine": "", "recipeCategory": "dinner, pizza and calzones", "keywords": "bacon, pizza dough, shrimp, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1103, "unsaturatedFatContent": "30 grams", "carbohydrateContent": "80 grams", "cholesterolContent": null, "fatContent": "60 grams", "fiberContent": "13 grams", "proteinContent": "63 grams", "saturatedFatContent": "25 grams", "sodiumContent": "2824 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon butter", "8 ounces fresh shrimp, peeled and deveined", "1 teaspoon minced garlic", "Kosher salt", "4 thick slices bacon, cut into 1/4-inch-thick matchsticks", "1 ball pizza dough (see above)", "Flour, for dusting", "6 cooked artichoke hearts, quartered", "4 to 6 ounces sliced semisoft Asiago cheese", "2 tablespoons fresh oregano, roughly chopped", "Extra-virgin olive oil, to drizzle", "Freshly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 45 minutes before cooking, preheat the oven and pizza stone to 550 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a small sauté pan over high heat until it foams. Add the shrimp and garlic, season with salt and cook for about a minute, shaking the pan, until the shrimp just start to color. Transfer to a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bacon in the pan and set over high heat. Cook, stirring occasionally, until brown and crispy. Using a slotted spoon, transfer the bacon to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough on a heavily floured surface and stretch and pull, using your hands or a rolling pin, into about a 14-inch round. Place on a lightly floured pizza peel or rimless baking sheet. Cover with the toppings, being careful not to press on the dough and weigh it down: the bacon first, then the artichoke hearts, the shrimp, the cheese and finally the oregano, leaving roughly a 1/2-inch border. Shake the pizza peel slightly to make sure the dough is not sticking. (Gently lift any sections that are sticking and sprinkle the peel with flour.) Slide the pizza directly onto the baking stone in one quick, forward-and-back motion. Cook until the crust has browned on the bottom and the top is bubbling and browning in spots, about 7 minutes. Drizzle the pie with a little olive oil and some pepper. Serve hot."}], "link": "https://cooking.nytimes.com/recipes/1012487-pizza-with-shrimp-bacon-and-artichoke-hearts"}