{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Fish Stew With Mediterranean Flavors", "description": "This is a typical fisherman’s stew. No need to make a fish stock; water, aromatics and anchovies will suffice. Use anchovies even if you don’t like them, as they add great depth of flavor, not to mention omega-3 fats. And don’t worry: the dish won’t taste like anchovies.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/fish-stew-mediterranean/fish-stew-mediterranean-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves four", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, soups and stews", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, nut-free, fall, winter, main course, potato, tomato, whitefish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1008}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 352, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "8 grams", "proteinContent": "33 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1793 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["4 large garlic cloves, cut in half, green shoots removed", "4 anchovy fillets, soaked in water for 4 minutes, drained and rinsed", "2 tablespoons extra virgin olive oil", "1 large onion, chopped", "1 celery rib, chopped", "1 medium carrot, chopped", "Salt, preferably kosher salt, to taste", "1 (28-ounce) can chopped tomatoes, with liquid", "1 quart water", "1 pound small new potatoes, scrubbed and quartered or sliced", "A bouquet garni made with a bay leaf, a strip of orange zest, a couple of sprigs each thyme and parsley, and a dried red chile if desired, tied together with a string", "Freshly ground pepper", "1 to 1 1/2 pounds firm white-fleshed fish such as halibut, tilapia, Pacific cod or black cod, cut in 2-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic cloves and 1/4 teaspoon salt in a mortar and pestle, and mash to a paste. Add the anchovy fillets and mash with the garlic. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or Dutch oven, and add the onion, celery and carrot with 1/2 teaspoon salt. Cook, stirring, until the onion is tender, about five minutes. Add the pureed garlic and anchovy. Cook, stirring, until the mixture is very fragrant, about one minute, and then add the tomatoes. Cook, stirring often, until the tomatoes have cooked down a bit and the mixture smells aromatic, about 10 to 15 minutes. Add the water, potatoes, salt (to taste) and the bouquet garni. Bring to a simmer. Turn the heat to low, cover partially and simmer 30 minutes. Taste, adjust salt and add pepper to taste. Remove the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fish with salt and pepper, and stir into the soup. The soup should not be boiling. Simmer five to 10 minutes (depending on the thickness of the fillets) or just until it flakes easily when poked. Remove from the heat, stir in the parsley, taste once more, adjust seasonings and serve."}], "link": "https://cooking.nytimes.com/recipes/1012535-easy-fish-stew-with-mediterranean-flavors"}