{"@context": "http://schema.org", "@type": "Recipe", "name": "Artichoke, Mushroom and Potato Ragoût", "description": "This robust Provençal ragout is more of a cool weather recipe than Tuesday’s ragout with peppers and tomatoes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/04/08/health/08recipehealth_600/08recipehealth_600-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves four to six", "recipeCuisine": "french", "recipeCategory": "", "keywords": "artichoke, dried porcini mushrooms, potato, dairy-free, gluten-free, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, spring, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 29}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 291, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "20 grams", "proteinContent": "13 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1022 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce (about 1 cup) dried porcini mushrooms", "1 lemon, for trimming the artichokes, plus fresh lemon juice for seasoning", "12 baby artichokes, or 6 medium or large artichokes", "2 tablespoons extra virgin olive oil", "1 large onion, thinly sliced", "4 to 5 large garlic cloves, sliced", "1 tablespoon tomato paste", "1/2 cup dry white wine", "1 bay leaf", "A generous sprig of thyme", "Salt", "freshly ground pepper", "1 pound small potatoes, scrubbed and quartered", "1/4 cup chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the mushrooms in a bowl or large Pyrex measuring cup. Bring 2 cups water to a boil, and pour over the mushrooms. Let sit 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare the artichokes. If small, cut in half; quarter if large."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a strainer lined with cheesecloth or paper towels over a bowl, and drain the mushrooms. Squeeze the mushrooms over the strainer to extract liquid, then rinse in several changes of water to rid them of grit. Set aside. Add enough water to the bowl to make 3 cups of soaking liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy casserole or lidded nonstick skillet. Add the onion, and cook, stirring, until tender, about five minutes. Stir in the garlic and mushrooms, and cook together, stirring, until fragrant, about one minute. Add the tomato paste and cook, stirring, until it darkens and begins to caramelize in three to five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the artichokes, and add with the potatoes. Stir together for another minute, then stir in the wine. Bring to a boil, and cook until most of the liquid is gone. Add the soaking liquid from the mushrooms, the bay leaf, thyme, salt and pepper. Bring to a simmer, reduce the heat, cover and simmer 40 minutes, until the potatoes and artichokes are tender. Uncover, turn up the heat, and reduce the liquid in the pan to thicken. Remove from the heat, taste and adjust salt and pepper. Stir in a teaspoon or more of fresh lemon juice, if desired, and the parsley. Serve hot or at room temperature."}]}