{"@context": "http://schema.org", "@type": "Recipe", "name": "Black Beans With Amaranth", "description": "Throughout Mexico, wild and cultivated greens of all kinds are added to beans and to meat dishes. Amaranth is a favorite choice. The pretty leaves are red, or green with red veins. While they’re a bit tough and bitter when uncooked, they’re sweet and tender after blanching.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/09/health/09recipehealth_600/09recipehealth_600-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "amaranth greens, black beans, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, low sugar, nut-free, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 481, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "87 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "16 grams", "proteinContent": "24 grams", "saturatedFatContent": "1 gram", "sodiumContent": "374 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound black beans, washed, picked over and soaked for six hours or overnight in 2 quarts water", "1 large onion, chopped", "4 garlic cloves, minced", "Salt to taste", "2 to 4 tablespoons roughly chopped cilantro, or a few sprigs fresh epazote", "3/4 pound amaranth, stemmed (stems discarded)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the beans and their soaking water in a large, heavy soup pot or Dutch oven. If necessary, add water to cover by two inches. Bring to a boil and skim off foam. Add the onion and half the garlic, and reduce the heat to low. Add salt, cover and simmer one hour. Add the remaining garlic, the epazote (optional) and more salt if desired. Simmer for another 30 minutes. Add the cilantro, and simmer for another 30 minutes, until the beans are tender and the broth aromatic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the beans are simmering, wash the amaranth leaves in two changes of water. Bring a large pot of water to a boil, and fill a bowl with ice water. When the water comes to a boil, salt generously and add the amaranth. Blanch for two minutes, and transfer to the ice water. Drain, squeeze out excess water (it will be a beautiful plum color) and chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About five minutes before serving, taste the beans and adjust seasoning. Stir in the amaranth, simmer very gently for five to 10 minutes, and serve."}]}