{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pacific Halibut With Mango Salsa", "description": "This sweet and spicy salsa goes beautifully with a firm, white fish like halibut. Make sure your mango is very ripe. Mangos are a good source of potassium, vitamin A and beta-carotene. You would think that such a sweet fruit would be high in calories, but because of all the water in a juicy mango, the caloric content is relatively low — about 135 calories in a whole mango, according to nutritionist and author Jonny Bowden.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/23/health/23recipehealth_600/23recipehealth_600-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves four", "recipeCuisine": "mexican", "recipeCategory": "dinner, easy, quick", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low-sodium, nut-free, fish, halibut, mango, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 108}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 422, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "27 grams", "saturatedFatContent": "10 grams", "sodiumContent": "705 milligrams", "sugarContent": "15 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 large, ripe mango", "2 serrano chiles, minced", "1 tablespoon finely chopped cilantro", "1 tablespoon finely chopped fresh mint", "1/4 cup finely diced jicama", "2 tablespoons freshly squeezed lime juice", "Salt", "freshly ground pepper to taste", "4 6-ounce Pacific halibut fillets or steaks", "2 tablespoons extra virgin olive oil", "2 limes, cut in wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely dice the mango. Cut down the broad side of the mango, slightly off center, from the stem end to the tip end. The knife should scrape against the side of the pit. Repeat on the other side, cutting as close to the pit as possible. Cut the flesh from the sides of the pit, following the curve of the pit. Lay each half on your cutting surface, and score with the tip of your knife in a cross-hatch pattern, down to the skin but not through it. Turn the mango half inside out, and slice the cubes away from the skin. Then cut the cubes into very small dice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the mango in a bowl with the chiles, cilantro, mint, jicama and lime juice. Season with salt if desired. Cover the bowl, and allow to sit for an hour while you prepare your grill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a medium-hot grill (or heat an indoor griddle or grill pan). Season the halibut fillets or steaks with salt and pepper, and toss with the olive oil in a bowl. Place the fish directly over the coals, and grill for four to five minutes per side, depending on the thickness. The fish should be opaque all the way through, and you should be able to pull it apart with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the fish to a plate or a platter. Serve with the salsa spooned partially over the fish and partially on the side. Alternately, spoon the salsa onto plates and set the fish on top. Garnish with lime wedges and serve."}], "link": "https://cooking.nytimes.com/recipes/1012684-grilled-pacific-halibut-with-mango-salsa"}