{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Winter Squash and Tofu With Soba", "description": " Winter squash is a nutrient-dense vegetable, with lots of vitamin A in the form of beta carotene (the more orange the flesh, generally the more vitamin A in the squash), vitamin C, potassium and dietary fiber. Winter squash goes well with ginger, and this stir-fry makes a delicious vegetarian main course. Use a sweet, dense squash like butternut for this dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/09/health/09recipehealth_600/09recipehealth_600-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "Serves four", "recipeCuisine": "asian", "recipeCategory": "dinner, lunch, one pot", "keywords": "dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, winter, soba noodles, tofu, winter squash", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 377, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "13 grams", "saturatedFatContent": "2 grams", "sodiumContent": "460 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["6 ounces tofu, sliced about 1/2 inch thick", "2 tablespoons canola or peanut oil", "1/2 red onion, sliced", "2 garlic cloves, minced", "2 teaspoons minced ginger", "1 tablespoon sesame seeds", "1 small butternut squash, diced (about 4 cups)", "1 tablespoon sherry", "1/4 cup water", "Soy sauce to taste", "1/2 pound buckwheat noodles (soba)", "1 tablespoon dark Chinese sesame oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap the tofu in clean kitchen towels or paper towels, and place under a cutting board for 10 minutes. Cut in 1-inch wide dominoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil in a large nonstick skillet or wok, and stir-fry the tofu until lightly colored, about three minutes. Using tongs or a slotted spatula, remove from the pan and set aside on a plate. Add the onion to the pan, and stir-fry until it softens, about three minutes. Add the remaining tablespoon of oil and the squash. Cook, stirring often, for 10 minutes. Add the garlic, ginger and sesame seeds, and stir-fry for one minute, until fragrant. Return the tofu to the pan, stir in the sherry and 1/4 cup water, cover and reduce the heat to medium. Simmer five minutes or until the squash is tender. Uncover and add soy sauce to taste. Keep warm while you cook the soba."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 3 or 4 quarts of water to a boil in a large pot. Add the noodles gradually, so that the water remains at a boil, and stir once with a long-handled spoon so that they don’t stick together. Wait for the water to come back up to a rolling boil — it will bubble up so don’t fill the pot all the way — and add 1 cup of cold water. Allow the water to come back to a rolling boil, and add another cup of cold water. Allow the water to come to a boil one more time, and add a third cup of water. When the water comes to a boil again, the noodles should be cooked through. Drain and toss with the sesame oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange the noodles on a platter, top with the tofu and vegetables, and serve."}]}