{"@context": "http://schema.org", "@type": "Recipe", "name": "Artichoke Heart Frittata", "description": "You can make this easy Italian frittata with the fresh, tiny artichokes that arrive with spring or, more quickly, with frozen artichoke hearts.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/04/09/health/09recipehealth1.ready/09recipehealth1.ready-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves four to six", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "artichoke hearts, eggs, gluten-free, halal, healthy, high fiber, kosher, low sugar, nut-free, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 172, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "345 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound baby artichokes, trimmed, or one 12-ounce package frozen artichoke hearts", "8 eggs", "2 tablespoons low-fat milk", "Salt, preferably kosher salt", "freshly ground pepper", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "3 tablespoons minced Italian parsley, dill, fennel fronds or wild fennel", "1 tablespoon freshly grated Parmesan or pecorino"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If using fresh artichokes, steam until tender or boil gently in a pot of generously salted water, 10 to 15 minutes. Drain, refresh with cold water and quarter the artichokes. Thaw frozen artichokes as directed, and drain off any liquid in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a medium bowl. Whisk in the milk, about 1/2 teaspoon salt and freshly ground pepper to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium-high heat in a 10-inch, heavy nonstick skillet, and add the artichokes. Cook, stirring often, until golden brown, about five to eight minutes. Add the garlic, and cook for another 30 seconds to a minute until fragrant. Stir in the herbs, and season with salt and pepper. Pour in the egg mixture. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with a spatula in your other hand, so that the eggs run underneath during the few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to low, cover (use a pizza pan if you don’t have a lid that will fit your skillet) and cook 10 minutes, shaking the pan gently every once in a while. From time to time, remove the lid and loosen the bottom of the omelet with a wooden spatula, tilting the pan so that the bottom doesn’t burn. Instead it should turn a deep golden brown. Meanwhile, heat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish the omelet under the broiler for one to two minutes, watching very carefully to make sure the top doesn’t burn. (It should brown slightly, and it will puff under the broiler.) Remove from the heat and immediately sprinkle on the Parmesan or pecorino. Serve hot, warm or room temperature."}]}