{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken With Morcilla and Peppers", "description": "As I tasted the reds from Bierzo, I wanted food that was dark, rich and earthy. Why not morcilla — Spanish blood sausage? A plate of nicely seared morcilla, or French boudin noir, would be enough alongside these wines.But in this dish of chicken on a bed of cannellini beans, the morcilla provides just an accent, albeit forceful, like a spoonful of horseradish on boiled beef. Another kind of sausage — or none at all — could be used, though it would change the dish’s character and color.I cooked the beans separately to guarantee their tenderness. Canned beans provide an acceptable shortcut. For six servings, I used chicken breasts, thighs and wings, briefly seared. With one chicken cut up, double the amount of sausage. Some guests may be delighted.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, casseroles", "keywords": "cannellini beans, chicken, morcilla (spanish blood sausage), dairy-free, gluten-free, fall, winter, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 775, "unsaturatedFatContent": "33 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "53 grams", "fiberContent": "5 grams", "proteinContent": "45 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1239 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 chicken breast halves, with wings, skin and bones", "6 chicken thighs with skin", "2 tablespoons extra virgin olive oil", "1 teaspoon smoked paprika", "Salt", "freshly ground black pepper", "4 cups cooked cannellini beans, starting with 1 1/2 cups dry beans, or 2 cans, rinsed", "1 tablespoon sliced garlic", "3 red bell peppers, cored, seeded, in half-inch-wide vertical strips", "2 medium-size sweet onions, in eighths", "12 ounces morcilla (Spanish blood sausage) or boudin noir, sliced 1 inch thick", "1 cup dry red wine", "2 stems fresh rosemary, leaves only"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate wings from breasts. Cut each breast in half. Dry all chicken pieces. Heat 1 tablespoon oil in a 12-inch skillet. Add chicken, skin side down, and cook over medium-high heat, just until skin is golden. Do not turn pieces; cook in stages if they do not all fit in pan at once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken in a bowl and rub with paprika, salt and pepper. Toss beans with garlic, season with salt and pepper, and spread in a large, shallow casserole that can hold chicken in a single layer. Place chicken, skin side up, on bed of beans. Heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat remaining oil in skillet, add peppers and onion chunks and sauté until starting to brown. Scatter around chicken. Add sausage to skillet, sauté, stirring, a couple of minutes until just starting to sizzle. Tuck sausage pieces into casserole. Pour wine in skillet, deglaze pan and pour over ingredients in casserole. Scatter rosemary on top. Place in oven and bake 45 minutes, basting chicken with juices once or twice. Serve."}]}