{"@context": "http://schema.org", "@type": "Recipe", "name": "Salt-and-Pepper Beef Ribs", "description": "These beef ribs are an adaptation of the ones the chef Kenny Callaghan used to serve at the restaurant Blue Smoke, in Manhattan. For best results, order the ribs ahead of time from a butcher. (Pre-packaged ribs are generally too well-trimmed of meat for good barbecue purpose.) Ask for two back-rib racks trimmed from the prime rib, keeping as much meat on the ribs as possible, each rack approximately 6 ribs wide. That will do you brilliantly. Cook for a while in a bath of hickory smoke, then finish in the oven. Beef, salt, pepper, smoke, fat. You'll need napkins.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Salt-and-Pepper-Beef-Ribs/Salt-and-Pepper-Beef-Ribs-articleLarge.jpg", "totalTime": "PT8H30M", "recipeYield": "4 servings", "recipeCuisine": "southern", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "recipeIngredient": ["2 racks beef ribs, 5 to 7 pounds total (see note)", "3 tablespoons kosher salt", "2 tablespoons freshly cracked black pepper", "2 tablespoons brown sugar", "1 tablespoon paprika", "Red-pepper flakes, to taste", "2 cups hickory chips, soaked in water for at least 30 minutes", "Barbecue sauce (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On one-half of a grill fitted with a cover, build a small charcoal fire, about the size of a loaf of commercial sandwich bread, making sure all the charcoal becomes engulfed in flame."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the ribs meat-side down on a baking sheet or cutting board and remove the papery membrane from the back of the rack by inserting a small knife beneath it and levering it up to give you enough to gain purchase with a dish towel. Peel off the membrane and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the salt, pepper, brown sugar, paprika and, if you choose, red-pepper flakes in a bowl, breaking up the brown sugar with a fork. Using your hands, cover the meat entirely in this rub."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the flames begin to die down, leaving flickering coals, place the rib racks meat-side up on the half of the grill without the burning charcoal. Do not let the flames touch the meat at any time. Add a handful of the hickory chips to the fire. Cover the grill, vent slightly and cook, adding a handful of hickory chips every 30 minutes and a bit more fuel as necessary, until the meat is crusty, soft to the touch and well browned, about two and a half hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 200 degrees. Set the ribs on a rimmed baking sheet and bake for around 5 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut into individual portions. Serve with extra napkins and, if you choose, barbecue sauce."}], "link": "https://cooking.nytimes.com/recipes/1012540-salt-and-pepper-beef-ribs"}