{"@context": "http://schema.org", "@type": "Recipe", "name": "Barley Risotto With Cauliflower and Red Wine", "description": "The Italians make a risotto-like dish called orzotto with barley. It has a chewier, more robust texture than risotto made with rice and considerably more fiber. I like to use red wine in this dish, both for its flavor and because I like the way it tints the cauliflower.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/barley-risoto-cauliflower-red-wine/barley-risoto-cauliflower-red-wine-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "fall, winter, healthy, high fiber, kosher, low cholesterol, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 418, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "11 grams", "proteinContent": "19 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1207 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["7 to 8 cups vegetable or chicken stock, as needed", "Salt", "2 tablespoons extra virgin olive oil", "1 small or 1/2 medium onion, minced", "2 large garlic cloves, minced or pressed", "1 1/2 cups barley", "1 medium cauliflower, separated into small florets or sliced 1/2 inch thick", "1 cup robust red wine, such as a Côtes du Rhône", "3 tablespoons chopped flat-leaf parsley", "2 ounces Parmesan cheese, grated (1/2 cup)", "Freshly ground pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the stock well with salt and bring to a simmer in a medium saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy nonstick frying pan or a wide, heavy saucepan. Add the onion. Cook, stirring, until the onion begins to soften, about three minutes. Add the garlic, cauliflower and barley. Cook, stirring, for a couple of minutes, until the grains of barley are separate and beginning to crackle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the red wine and cook, stirring, until there is no more wine visible in the pan. Stir in enough of the simmering stock to just cover the barley. The stock should bubble slowly. Cook, stirring often, until it is just about absorbed. Add more stock and continue to cook in this fashion, not too fast and not too slowly, adding more stock when the barley is almost dry, until the barley is tender but still chewy. Taste and add salt if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another ladleful of stock to the barley. Stir in the parsley and Parmesan, and immediately remove from the heat. Add freshly ground pepper, taste one last time and adjust salt. Serve at once."}]}