{"@context": "http://schema.org", "@type": "Recipe", "name": "Fettuccine With Braised Mushrooms and Baby Broccoli", "description": "I buy baby broccoli at my local Trader Joe’s. The stalks are thin, like broccoli raab’s, and the flowers are delicate. If you really want an intense mushroom experience, seek out the fabulous mushroom fettuccine made by Al Dente Pasta. You can find it in gourmet markets, in catalogues such as Zingerman’s, and online.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/12/14/health/nutrition/16recipehealth_600/16recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "dinner, pastas", "keywords": "broccoli, dried porcini mushrooms, pasta, dairy-free, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 310, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "453 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 ounce (about 1/2 cup) dried porcini mushrooms", "2 tablespoons extra virgin olive oil", "1 small shallot, minced", "1 pound mushrooms, cleaned, trimmed and sliced 1/2 inch thick", "Salt to taste", "2 garlic cloves, minced", "1/4 cup dry white wine or red wine", "1 teaspoon chopped fresh rosemary or fresh thyme leaves", "1/2 pound baby broccoli, cut in 1-inch pieces", "Freshly ground pepper", "3/4 pound fettuccine or egg noodles", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried mushrooms in a Pyrex measuring cup and pour on 2 cups boiling water. Let soak 30 minutes while you prepare the other ingredients. Place a strainer over a bowl; line it with cheesecloth, a coffee filter or paper towels; and drain the mushrooms. Squeeze the mushrooms over the strainer to extract all the flavorful juices, and measure out 1 1/2 cups of the broth. Rinse the mushrooms, away from the bowl with the broth, until they are free of sand. Squeeze dry and set aside. If very large, chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water for the pasta. Heat the olive oil in a large, heavy nonstick skillet or saucepan over medium heat, and add the shallot. Cook, stirring for a few minutes, until tender, and add the fresh mushrooms and salt to taste. Cook, stirring often, until the mushrooms begin to soften and to sweat, about five minutes. Add the garlic, and continue to cook the mushrooms, stirring often, until they have softened a little more, about two minutes. Add the reconstituted dried mushrooms, the wine and rosemary (or thyme), and turn the heat to high. Cook, stirring often, until the wine evaporates and the pan is almost dry, five to 10 minutes. Stir in the mushroom broth. Bring to a simmer, and cook over medium heat, stirring often, until the mushrooms are thoroughly tender and fragrant and the surrounding broth is thick and gravy-like, about 20 minutes. Taste and adjust salt and pepper. Remove from the heat, and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta water comes to a boil, salt generously and add the baby broccoli. Blanch for five minutes, until tender but still bright. With a slotted spoon or skimmer, transfer to the pan with the mushrooms."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the pasta to the boiling water. Cook al dente, until firm to the bite, following the directions on the package but checking a minute or two before the end of the designated cooking time. (Note that some egg noodles, such as Al Dente Pasta, take only three to four minutes). Add a ladleful of pasta cooking water to the mushrooms and baby broccoli, drain the pasta, and toss with the mushrooms and broccoli in a large pasta bowl or in the pan. Serve at once, passing Parmesan at the table."}], "link": "https://cooking.nytimes.com/recipes/1012936-fettuccine-with-braised-mushrooms-and-baby-broccoli"}