{"@context": "http://schema.org", "@type": "Recipe", "name": "Stone Fruit Patchwork Bake", "description": "You can use any stone fruit or berries you like; just adjust the amount of sugar and lemon juice to get a mixture that’s sweet but not cloying, and with enough acidity to taste a bit sharp. (Many plums and berries won’t need any lemon juice.)\n\nYou can make it in a baking dish, as I do, a pie plate or even a cast-iron skillet. In any case, the result will be a rustic but delicious pie-like dessert.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2015/02/24/dining/stonefruit/stonefruit-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "cherries, peach, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 74}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 349, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "148 milligrams", "sugarContent": "38 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 tablespoons (1 stick) cold unsalted butter, cut into about 8 pieces, more for dish", "1 1/2 cups all-purpose flour, more for rolling", "1/2 teaspoon salt", "3/4 cup plus 2 tablespoons sugar", "3 pounds peaches, seeded and sliced (about 5 large)", "1 cup cherries, stones in or pitted", "1 tablespoon freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees and butter a 9-by-13-inch or similar-size baking dish; set aside. In a food processor, combine 1 cup plus 2 tablespoons flour, the salt and 1 tablespoon sugar; pulse once or twice. Add butter and turn on machine; process until butter and flour are blended and mixture looks like coarse cornmeal, about 15 to 20 seconds. Slowly add 1/4 cup ice water through feed tube and process until just combined. Form dough into a flat disk, wrap in plastic and freeze for 10 minutes or refrigerate for at least 30 minutes. (You can refrigerate dough for up to a couple of days, or freeze it, tightly wrapped, for up to a couple of weeks.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a large bowl toss fruit with remaining flour, 3/4 cup sugar and lemon juice; place in baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put dough on a floured board or countertop and sprinkle with more flour. Roll dough into a 12-inch round, adding flour and rotating and turning dough as needed. Cut dough into 3-inch-wide strips, then cut again crosswise into 4-inch-long pieces. Scatter pieces over fruit in an overlapping patchwork pattern."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush top of dough lightly with water and sprinkle with remaining tablespoon sugar. Transfer to oven and bake until top is golden brown and juices bubble, 35 to 45 minutes. Transfer to a rack to cool; serve warm or at room temperature."}]}