{"@context": "http://schema.org", "@type": "Recipe", "name": "Persian Jeweled Rice", "description": "This dish is called jeweled rice because it is golden and glistening, laced with butter and spices and piled with gem-colored fruits. Some of the ingredients called for may require some effort to find, but you can make substitutions. If you cannot get dried barberries (imported from Iran), you will need dried cherries or goji berries or dried cranberries. You will also need some extra-fancy Basmati rice. One goal in making this dish is to achieve the crisp buttery layer on the bottom of the pot. The technique is not difficult, but it takes a little practice. After the rice is rinsed well, it is parboiled for about 5 minutes and drained. The half-cooked rice is layered into a well-buttered pot along with the chopped dried fruits. Over a moderate flame, it is allowed to brown gently before being splashed with a small amount of saffron-infused water. Then the lid goes on the pot and the heat is turned very low so the rice steams gently. With a little luck and experience, the crisp tah dig, or crust, is formed.", "author": {"@type": "Person", "name": "Harvey Araton"}, "image": "https://static01.nyt.com/images/2014/04/17/dining/Persian-Jeweled-Rice/Persian-Jeweled-Rice-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 servings", "recipeCuisine": "middle eastern", "recipeCategory": "one pot", "keywords": "gluten-free, potato, rice, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 70}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 586, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "111 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "7 grams", "proteinContent": "12 grams", "saturatedFatContent": "2 grams", "sodiumContent": "546 milligrams", "sugarContent": "15 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 cups high-quality basmati rice", "Salt", "black pepper", "Pinch of high-quality saffron threads", "Pinch of sugar", "1 tablespoon butter plus 4 ounces (1 stick) butter, melted", "1 tablespoon vegetable oil", "3 to 4 waxy potatoes, peeled and cut into 1/2 -inch slices", "1 1/2 cups barberries (see note)", "1/2 cup slivered almonds", "1/2 cup slivered pistachio nuts", "1/2 cup chopped candied orange zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse basmati rice until water runs clear. Place in a bowl, cover with water and add 1 tablespoon salt. Allow to soak for at least 4 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a mortar and pestle, grind together saffron and sugar. Combine with a scant 1/3 cup boiling water, and set aside to steep. Bring a stockpot of lightly salted water to a rolling boil. Drain rice and add to pot; cook exactly 6 minutes, then drain into fine-meshed colander."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a round Dutch oven or other wide pan with a lid over medium heat. Add 1 tablespoon butter and vegetable oil. When butter has melted, add potato slices in a single layer. Season to taste with salt and pepper. Spread potatoes evenly with a layer of rice about 1 inch thick. Sprinkle 1 cup barberries in stages over rice. Continue to add rice in smaller and smaller layers, sprinkling barberries between each layer, to make a pyramid of rice with no berries on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using the handle of a round wooden spoon, poke 3 holes into top of rice until spoon touches potato layer. Combine melted butter with saffron mixture, and pour all over rice. Cover underside of pot lid with a large dry cotton kitchen towel. Place on pan, making sure no ends dangle near source of heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook rice mixture over medium-high heat for 5 minutes, then reduce heat to low. Cook 40 to 45 minutes. To serve, spoon rice onto a heated serving platter. Top with rows of almonds, pistachios, candied orange zest and remaining 1/2 cup barberries. Arrange potatoes from bottom of pan in another dish, and serve alongside rice."}], "link": "https://cooking.nytimes.com/recipes/1012950-persian-jeweled-rice"}