{"@context": "http://schema.org", "@type": "Recipe", "name": "Sun-Cooked Strawberry Preserves", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/23/dining/strawberrypreserve-still/strawberrypreserve-still-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "About 2 pints", "recipeCuisine": "american", "recipeCategory": "quick, condiments, project", "keywords": "dairy-free, gluten-free, halal, nut-free, vegan, vegetarian, strawberries, sugar, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 302, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "77 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "5 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "70 grams", "transFatContent": null}, "recipeIngredient": ["2 quarts ripe, unblemished strawberries, rinsed (or raspberries, blackberries or blueberries)", "1 1/2 to 2 cups sugar", "1 teaspoon freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Watch the weather: sun-cooking requires two or three full days of sunshine and temperatures above 80 degrees. Trim stems or leaves off berries and taste; if they are very sweet, use smaller amount of sugar. Toss berries and sugar in a glass or ceramic bowl. Let sit for at least 6 hours or overnight. Stir occasionally to distribute sugar as it dissolves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer berries to a nonstick or stainless steel pot and add lemon juice. Gradually bring mixture to a boil, then immediately reduce to a high simmer and cook for 5 minutes. Pour into a large stainless steel or plastic tray (or several, depending on size) into a layer 1 to 1 1/2 inches deep."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set in direct sun and cover with netting or cheesecloth to keep bugs out and to allow evaporation. Stir gently every few hours. Leave out all day, or at least eight hours; bring indoors (or cover securely) at dusk, set out again in the morning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Watch for syrup under berries to thicken. Depending on weather, this will take two to four days. Mixture may bubble as it heats, but if it starts to foam, can it immediately and use as syrup. (Foam indicates the beginning of fermentation; syrup  will still be safe and delicious.) If weather changes, or if mixture does not seem to be cooking, proceed with slow-cooking, below."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When all syrup thickens, pour it and fruit  into a pot and gently bring to a boil. Pour into sterilized glass jars; tighten lids. Place jars in a deep pot with water to cover. Boil jars for 10 minutes, then remove from pot with jar lifter or tongs. Let cool on counter, untouched, 4 to 6 hours. After 12 to 24 hours, check seals: lift each jar up by the lid, and press the lid to make sure the center is sucked down tight. Store in a dry dark place for up to one year. Refrigerate after opening."}]}