{"@context": "http://schema.org", "@type": "Recipe", "name": "Oyster Pan Roast With Sea Urchin Butter", "description": "", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": null, "totalTime": "PT40M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "gluten-free, main course, oyster, sea urchin", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 6}, "recipeIngredient": ["About 1 1/4 ounces sea urchin (1/2 small tray), see note", "1/4 teaspoon kosher salt, more to taste", "1 lemon, juiced", "1/4 pound (one stick) sweet butter, at room temperature", "1 tablespoon extra virgin olive oil", "4 medium shallots, finely diced", "1 clove of garlic, minced", "1 cup dry vermouth, or a dry white wine", "4 cups best-quality fish stock", "4 cups heavy cream", "24 oysters, shucked, with their liquor", "Good-quality peasant bread, toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a sieve over a large mixing bowl. Using a rubber spatula, pass sea urchin through sieve. Season with salt and one-quarter of the lemon juice, then purée in a food processor. Add butter gradually until compound is creamy and still tastes strongly of uni. (You may find that you do not need full amount of butter.) Check seasoning, adding salt and lemon juice to taste, then transfer to small bowl and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a heavy pan over medium heat and add olive oil. When it shimmers, add shallots and cook gently until soft. Add garlic and continue to cook for 5 minutes, until garlic is soft as well. Add vermouth and reduce until slightly dry. Add fish stock and reduce by a third."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add cream and reduce until it is thick enough to coat the back of a spoon. Stir frequently so that onions do not stick to bottom of pot. Add oysters and their liquor and cook until meat slightly curls at edges, about 3 minutes. Season to taste with salt and lemon juice. Place in warmed bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread a layer of sea-urchin butter across pieces of toast and serve alongside pan roast."}], "link": "https://cooking.nytimes.com/recipes/1012968-oyster-pan-roast-with-sea-urchin-butter"}