{"@context": "http://schema.org", "@type": "Recipe", "name": "Vegetable Pad Thai", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT45M", "recipeYield": "2 servings", "recipeCuisine": "asian, thai", "recipeCategory": "dinner, one pot", "keywords": "main course, pad thai rice noodles", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "recipeIngredient": ["5 1/3 ounces dried pad Thai rice noodles (see note)", "2 tablespoons freshly squeezed lime juice", "2 lime wedges for garnish", "1 tablespoon light brown sugar", "1/2 teaspoon ground red Thai chilies or cayenne pepper", "1/2 teaspoon paprika", "2 tablespoons sweet Thai chili sauce", "2 tablespoons soy sauce", "1 cup peanut oil", "8 green beans, trimmed", "1 large egg", "1/4 cup finely diced red onion", "2 baby bok choy, quartered lengthwise", "1/4 large red bell pepper, cut into julienne", "1 cup (lightly packed) thinly sliced Napa cabbage", "2 scallions, halved crosswise and quartered lengthwise", "1/2 cup finely diced firm tofu", "1/4 cup plus 1 tablespoon pad Thai sauce (see note)", "1/4 cup mixed chopped fresh basil and cilantro leaves", "1/2 to 3/4 cup fresh bean sprouts", "2 to 4 tablespoons coarsely chopped roasted salted peanuts"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place noodles in a bowl and cover with very hot tap water. Allow to sit for 30 minutes. Meanwhile, in a small bowl combine the lime juice, brown sugar, ground chilies, paprika, Thai chili sauce and soy sauce; reserve. Drain noodles well, rinse with cold water and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place oil in a wok over medium-high heat, and heat to 325 degrees. Add green beans and fry until wrinkled, about 1 1/2 minutes. Transfer beans to a plate, and discard all but 3 tablespoons of oil. Return to medium-high heat and add egg, stirring quickly to set it and scramble it slightly. Transfer to a plate and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To the wok add red onion, bok choy, red bell pepper, Napa cabbage and scallions, tossing for 1 to 2 minutes. Add noodles and toss until coated with oil and almost softened. Add tofu, wrinkled beans and pad Thai sauce; toss until thoroughly heated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drizzle in reserved lime juice mixture and toss for 5 seconds. Remove pan from heat immediately, then add scrambled egg, basil and cilantro mixture, and bean sprouts. Transfer to a heated serving platter, and garnish with peanuts and lime wedges. Serve immediately."}], "link": "https://cooking.nytimes.com/recipes/1012704-vegetable-pad-thai"}