{"@context": "http://schema.org", "@type": "Recipe", "name": "Dipped Chocolate Anything", "description": "Tempering chocolate is not hard, but it’s a little bit tricky. You definitely need a candy thermometer (old-fashioned or digital) to measure three or four temperatures: roughly 115 degrees Fahrenheit and 91 and 88 degrees. Melt the chocolate slowly in a double boiler  to about 115 degrees. Then to bring the temperature to dipping perfection (91 degrees), add more unmelted chocolate to the pot until the temperature is 91. At that point you can start dipping — fruit, graham crackers, cookies — whatever. When the chocolate reaches 88 degrees, if it lasts that long, the dipping must stop. But don’t worry, you can reheat the chocolate.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/05/01/dining/dippingchocolate/dippingchocolate-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "Enough for 20 to 30 dips", "recipeCuisine": "", "recipeCategory": "dips and spreads", "keywords": "bittersweet chocolate, chocolate, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "recipeIngredient": ["2 pounds good-quality bittersweet chocolate, chopped into bean-size pieces (by hand or in a food processor)", "Pretzels, graham crackers, dried fruit or anything for dipping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt 1 1/2 pounds chocolate in top of a double boiler (or clean metal bowl set over simmering water). Remove chocolate from heat when it reaches between 110 and 115 degrees on a candy thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To bring into tempering range, add remaining chocolate to the mixture and stir constantly with a rubber spatula until the thermometer registers 82 to 84 degrees. Put chocolate back over the hot water and bring temperature to between 88 and 91 degrees. Be careful not to let the temperature fall too far or you will have to gently re-warm the mixture; if the temperature rises above 91 degrees in the tempering step, you will have to start the process over."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once tempered, use immediately for dipping. Store tempered chocolate at room temperature."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Dipping Chocolate", "description": "Everything from pretzels to slices of mango can be dipped in chocolate. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/05/01/dining/dippingchocolate/dippingchocolate-mediumThreeByTwo440.jpg", "uploadDate": "2009-12-10T22:05:20.000Z", "duration": "PT4M13S"}, "link": "https://cooking.nytimes.com/recipes/1012931-dipped-chocolate-anything"}