{"@context": "http://schema.org", "@type": "Recipe", "name": "Pureed Potato and Broccoli Soup With Parmesan Croutons", "description": "The broccoli is added to this classic potato soup towards the end of the cooking time, so that it maintains its bright color and sweet flavor. The soup will have a silkier texture if you take the time to strain it after pureeing.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/02/04/health/nutrition/04recipehealth.ready/04recipehealth.ready-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner, lunch, one pot, soups and stews", "keywords": "appetizer, main course, broccoli, potato, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 66}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 183, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1029 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large onion, chopped", "2 leeks, white and light green parts only, sliced and cleaned (optional)", "3 garlic cloves, chopped, plus 1 small clove, cut in half", "Salt, preferably kosher salt, to taste", "2 pounds starchy potatoes (russets or Yukon golds), peeled and cut in large dice", "A bouquet garni made with a bay leaf and 2 sprigs each parsley and thyme", "2 quarts water, chicken stock, or vegetable stock", "1 pound broccoli crowns, coarsely chopped", "Freshly ground pepper to taste", "12 thin slices baguette or country bread", "1/4 cup freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy soup pot over medium heat and add the onion and optional leeks. Cook, stirring, until tender, about 5 minutes. Add 1/2 teaspoon salt and the chopped garlic and cook, stirring, for another minute, until fragrant. Add the potatoes, bouquet garni, water, and salt to taste. Bring to a boil, reduce the heat, cover and simmer 30 minutes. Add the broccoli, turn the heat up slightly to bring back to a boil, then reduce the heat again and simmer, uncovered, for 10 minutes, until the broccoli is thoroughly tender but still bright. Remove the bouquet garni."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the soup either with a hand blender, in batches in a blender (cover the top with a towel and hold it down to avoid hot splashes), or through a food mill fitted with the fine blade. For a silky texture, strain through a medium strainer set over a bowl, using a pestle or the bottom of a ladle to push the soup through. Return to the pot, taste and adjust salt, add a generous amount of freshly ground pepper, and heat through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly toast the bread and rub with a cut clove of garlic. Top each slice with a spoonful of Parmesan and heat through in a toaster oven or under a broiler, being careful to watch closely, until the cheese melts. Serve the soup, topping each bowl with 2 croutons."}], "link": "https://cooking.nytimes.com/recipes/1012668-pureed-potato-and-broccoli-soup-with-parmesan-croutons"}