{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkey and Vegetable Burgers", "description": "The vegetables in this turkey burger mixture not only contribute lots of vitamins A and C and micronutrients like the carotenoids lutein and zeaxanthin, which have been linked to eye health, but they also help to moisten burgers that can otherwise be quite dry. Make sure to buy lean ground turkey breast.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/01/15/health/15recipehealth_600/15recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "6 burgers", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, burgers", "keywords": "carrot, ground turkey, dairy-free, halal, healthy, kosher, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 197}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1/2 cup finely diced onion", "1/2 cup finely diced red bell pepper", "Salt to taste", "1 large garlic clove, green shoot removed, minced", "2/3 cup finely grated carrot (1 large carrot)", "1 1/4 pounds lean ground turkey breast, preferably organic, from humanely raised turkeys", "1 tablespoon prepared barbecue sauce", "1 tablespoon ketchup", "Freshly ground pepper to taste", "Canola oil for the skillet", "Whole grain hamburger buns", "condiments of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a medium skillet and add the onion. Cook, stirring, until it begins to soften, about 3 minutes, and add the diced red pepper and a generous pinch of salt. Cook, stirring often, until the vegetables are tender, about 5 minutes. Stir in the garlic and the grated carrot and cook, stirring, for another minute or two, until the carrots have softened slightly and the mixture is fragrant. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mash the ground turkey with a fork. Add about ¾ teaspoon kosher salt if desired, and mix in the barbecue sauce, ketchup, and freshly ground pepper to taste. Add the sautéed vegetables and mix together well. Shape into 6 patties, about ¾-inch thick. Chill for 1 hour if possible to facilitate handling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a nonstick griddle or a large nonstick frying pan over medium-high heat and brush with a small amount of canola oil, or prepare a medium-hot grill. When you can feel the heat when you hold your hand above it, cook the patties for 4 minutes on each side. Serve on whole grain buns, with the condiments of your choice."}], "link": "https://cooking.nytimes.com/recipes/1012991-turkey-and-vegetable-burgers"}