{"@context": "http://schema.org", "@type": "Recipe", "name": "Shell Beans and Potato Ragout With Swiss Chard", "description": "One of my favorite ways to serve shell beans is to cook them in a small amount of liquid with other vegetables. Serve this comforting ragout in wide soup bowls with crusty bread.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/22/health/22recipehealth_600/22recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, fall, winter, main course, shell beans, swiss chard", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 184, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "7 grams", "proteinContent": "8 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1001 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds Swiss chard or red chard (1 large bunch or 2 medium bunches)", "Salt to taste", "2 tablespoons extra virgin olive oil", "1/2 medium onion, sliced in half moons across the grain", "2 large garlic cloves, minced", "1 pound shell beans, such as cannelini, borlotti, or purple runners, shelled (about 1 3/4 cups shelled)", "1 pound potatoes, preferably fingerlings or Yukon golds, cut in 1-inch pieces", "3 1/2 to 4 cups water", "A bouquet garni made with a sprig each thyme and parsley (or basil), a bay leaf and a Parmesan rind", "Freshly ground pepper to taste", "2 tablespoons chopped flat-leaf parsley", "1 to 2 teaspoons fresh marjoram leaves (optional)", "Freshly grated Parmesan for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. Stem the chard, setting aside the stems, and wash the leaves thoroughly in two changes of water. Wash the stems, trim away the ends and dice. Set aside. When the pot of water comes to a boil, salt generously and add the chard leaves. Blanch for one to two minutes, until tender but still bright, and transfer to the bowl of ice water. Drain, squeeze out excess water and chop coarsely. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a large, heavy casserole or Dutch oven over medium heat. Add the onion. Cook, stirring, until it begins to soften, about two minutes, and add the diced chard stems. Cook, stirring often, for about two minutes, until the stems begin to soften, and add the garlic. Stir together for a minute, and add the beans, potatoes, water (just enough to cover everything) and bouquet garni. Bring to a simmer. Add salt to taste. Cover and simmer 40 to 45 minutes, until the beans are tender. Add the blanched chard, and simmer for another two to three minutes. Add pepper, and then taste and adjust salt. Remove the bouquet garni. Stir in the parsley and marjoram, and serve, passing Parmesan at the table for sprinkling."}], "link": "https://cooking.nytimes.com/recipes/1012792-shell-beans-and-potato-ragout-with-swiss-chard"}