{"@context": "http://schema.org", "@type": "Recipe", "name": "Apple-Beet Chutney", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT1H30M", "recipeYield": "Makes 1 quart", "recipeCuisine": "", "recipeCategory": "condiments, dips and spreads", "keywords": "apple, beet, fall", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 65, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "238 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces small to medium Chioggia beets (see note), as close in size as possible", "8 ounces small to medium golden beets, as close in size as possible", "2 tablespoons canola oil", "4 Fuji apples (about 2 pounds), peeled, cored and cut into 1/2-inch dice", "1/2 cup apple juice", "1/2 cup apple-cider vinegar", "1/2 teaspoon Dijon mustard", "1/2 teaspoon whole-grain mustard", "4 large mint leaves", "Maldon salt or other flaky sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wash the beets, cut off the stems and trim away any roots. Place each type of beet on a separate sheet of aluminum foil. Drizzle with the oil. Fold up the edges and crimp each to create a packet. Put the packets on a baking sheet. Cook until tender when pierced with a knife, about 50 minutes for smaller beets and 60 to 75 minutes for larger beets. Remove from the oven and let cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Once the beets are cool enough to handle, cut off the tops and use a paper towel to lightly rub the beet from the cut end toward the root to remove the skin. Cut the beets into 1/2-inch dice and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the apples, apple juice and vinegar in a medium saucepan. Cover and bring to a boil, then simmer, uncovered, over medium heat for 10 minutes, or until the apples are crisp-tender. Remove from the heat and stir in the beets and mustards."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, transfer the apples and beets to a 1 1/2-quart canning jar or other storage container, interspersing the mint leaves as you spoon in the fruit. Press down slightly on the compote and top with enough liquid to cover. Cover with the lid and cool to room temperature, then refrigerate for up to 1 week (it may discolor if stored any longer). Serve sprinkled with Maldon salt."}]}