{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Chicken Breasts With Tarragon", "description": "As the owner of the French Laundry, Per Se and Bouchon, restaurateur Thomas Keller is best known for haute cuisine, but he can do weeknight cooking, too. Case in point: this elegant and easy chicken dish that can be ready in about 20 minutes.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2016/08/22/dining/22COOKING-SAUTEED-CHIX-BREAST1/22COOKING-SAUTEED-CHIX-BREAST1-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "chicken, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 798}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 122, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "3 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "0 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "207 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 teaspoon sweet paprika", "1 teaspoon Madras curry powder", "6 large (about 6 ounces each) or 12 small (about 3 ounces each) boneless, skinless chicken breasts", "Kosher salt", "Canola oil", "3 tablespoons unsalted butter", "1 tablespoon minced shallot", "1/4 cup dry white wine", "1 cup chicken stock", "1 tablespoon coarsely chopped tarragon plus 1 tablespoon whole tarragon leaves", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl mix together paprika and curry powder, and sprinkle on both sides of chicken breasts; cover and refrigerate for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 2 breasts on large sheet of plastic wrap, cover with more plastic and pound with a mallet until they are about 1/4-inch thick. Repeat with remaining breasts. (Chicken may be wrapped and refrigerated for up to 12 hours.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 200 degrees. Season chicken on both sides with salt. In a large skillet over medium-high heat, add enough canola oil to film the bottom of pan. Working in batches, without crowding, place breasts smooth side down and let cook until golden brown, 1 to 1 1/2 minutes. Turn and cook for another 1 to 1 1/2 minutes. Transfer to a baking sheet and keep warm in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out skillet and return to medium heat. Add 1 tablespoon of butter and shallot, and sauté for 30 seconds, swirling pan to coat shallot with butter. Add wine, raise heat to medium-high, and cook until wine is reduced by half, about 1 minute. Add stock, bring to boil, and cook until reduced and slightly thickened, 1 to 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in chopped tarragon, remaining 2 tablespoons butter, and any juices that have accumulated on baking sheet. Swirl to melt butter, and season to taste with salt and pepper. Arrange chicken on a warmed platter, pour sauce over it, and garnish with whole tarragon leaves."}], "link": "https://cooking.nytimes.com/recipes/1012849-sauteed-chicken-breasts-with-tarragon"}