{"@context": "http://schema.org", "@type": "Recipe", "name": "Cauliflower Gratin With Goat Cheese Topping", "description": "Cauliflower is at its peak now, from December through March, when produce markets often are otherwise spare, particularly if you happen to live in a northern climate. Like other cruciferous vegetables, cauliflower is an abundant source of phytonutrients and enzymes that may help neutralize toxins damaging to the body’s cells. It’s an excellent source of vitamins C and K, folate and dietary fiber, and a very good source of vitamins B5 and B6, tryptophan, omega-3 fatty acids and manganese. All are good reasons to include it in your diet. \n\nOne more thing: if you have trouble persuading your kids to eat dishes with cooked cauliflower, try serving the florets raw. Even some of the most vegetable-averse kids seem to like it uncooked. Of all of the gratins that I make, this is the easiest to throw together. It works as a vegetarian main dish or as a side.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/Cauliflower-gratin-goat-cheese/Cauliflower-gratin-goat-cheese-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "american", "recipeCategory": "weekday", "keywords": "cauliflower, goat cheese, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, side dish, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 408}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 263, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "8 grams", "sodiumContent": "714 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 large or 2 smaller cauliflowers (about 2 pounds), broken into florets", "3 tablespoons extra virgin olive oil", "Salt", "freshly ground pepper", "6 ounces fresh goat cheese", "1 plump garlic clove, halved, green shoot removed", "5 tablespoons low-fat milk", "1 teaspoon chopped fresh thyme leaves or 1/2 teaspoon dried thyme", "1/4 cup dry, fine breadcrumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Oil a two-quart gratin dish with olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cauliflower in a steaming basket above one inch of boiling water. Cover and steam for one minute. Lift the lid and allow steam to escape for 15 seconds, then cover again and steam for six to eight minutes, until the cauliflower is tender. Remove from the heat and refresh with cold water. Drain on paper towels, then transfer to the gratin dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the cauliflower generously with salt and pepper, then toss with 2 tablespoons of the olive oil and half of the thyme. Spread in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic in a mortar and pestle with a quarter-teaspoon salt, and mash to a paste. Combine with the goat cheese and milk in a food processor fitted with the steel blade, and blend until smooth. Add the remaining thyme and freshly ground pepper to taste, and pulse together. Spread this mixture over the cauliflower in an even layer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before baking, sprinkle on the breadcrumbs and drizzle on the remaining tablespoon of olive oil. Bake 15 to 20 minutes, until the top is lightly browned and the dish is sizzling. Serve at once."}], "link": "https://cooking.nytimes.com/recipes/1012426-cauliflower-gratin-with-goat-cheese-topping"}