{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Spaghettini With Sea Urchin and Tomatoes", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/06/06/dining/Spicy-Spaghettini/Spicy-Spaghettini-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 first-course servings", "recipeCuisine": "italian", "recipeCategory": "quick, pastas", "keywords": "appetizer, cherry tomatoes, sea urchin, spaghettini, dairy-free, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 196, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "10 grams", "saturatedFatContent": "0 grams", "sodiumContent": "372 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["8 ounces dry spaghettini or spaghetti, or long fresh pasta such as tagliolini", "3 tablespoons extra virgin olive oil, more for drizzling", "6 cloves garlic, peeled", "1/4 to 1/2 teaspoon crushed red chili flakes", "10 to 12 ounces grape or cherry tomatoes, preferably organic, halved", "Sea salt", "About 2 1/2 ounces (1 small standard-size tray with about 20 pieces) sea urchin (see note)", "Freshly grated zest of half an organic lemon (optional)", "Small handful flat-leaf parsley leaves, freshly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of water to a boil over high heat. Break or cut pasta in half to help it cook evenly. Meanwhile, in a skillet large enough to hold pasta later on, heat olive oil over medium heat. Add garlic, reduce heat to low, and slowly cook on all sides, turning often, until cloves are lightly browned and caramelized, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Raise heat under skillet to medium, add chili flakes and cook, stirring, until toasted, about 2 minutes. Add tomatoes and cook, turning gently, just until wilted."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When water boils, add a couple of tablespoons of salt and pasta. Stir well and bring back to boil. Cook, stirring often. When pasta is cooked through but still firm, drain, reserving 1 cup cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat under skillet to low. Add about 3/4 of the sea urchin to skillet with a sprinkle of salt and a splash of pasta cooking water. Add pasta to skillet and toss thoroughly but gently over low heat, adding pasta cooking water and more oil to taste if mixture is dry. Taste for salt and toss in lemon zest, if using, and parsley. Serve hot, decorating each serving with remaining sea urchin."}], "link": "https://cooking.nytimes.com/recipes/1012533-spicy-spaghettini-with-sea-urchin-and-tomatoes"}