{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken-Liver Mousse", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": null, "totalTime": "PT30M", "recipeYield": "Makes 3 half-pint jars", "recipeCuisine": "", "recipeCategory": "condiments, dips and spreads", "keywords": "appetizer, butter, chicken livers, onion", "aggregateRating": null, "recipeIngredient": ["3 (1-cup) canning jars", "1 pound chicken livers", "Olive oil", "Kosher salt", "Freshly ground black pepper", "1 cup thinly sliced sweet white onions", "2 medium shallots, thinly sliced", "4 cloves garlic, thinly sliced", "1 tablespoon thyme leaves", "1 star anise", "1 teaspoon sherry vinegar, plus more to taste", "1 tablespoon Cognac or aged rum", "1/4 pound butter, cool but not cold, cut into medium chunks", "Sliced and toasted bread", "Pickled cherries"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry the canning jars."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim the sinew and any green patches from the livers. Rinse and dry them on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a 12-inch skillet, heat 2 tablespoons olive oil until very hot. Sauté the livers, letting them caramelize on one side before flipping them. (If the pan threatens to smoke or blacken, immediately lower the heat; otherwise the juices will become too bitter to use.) When the livers are well browned but medium-rare inside, about 4 minutes, turn off the heat and transfer them to the bowl of a food processor. Season with 1 teaspoon kosher salt and 1?8 teaspoon pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add another tablespoon of oil to the pan and sweat the onions, shallots, garlic, thyme and star anise over low heat, covered, until soft, about 10 minutes. Raise the heat and deglaze the pan with the vinegar and Cognac or rum until evaporated. Discard the star anise and transfer the onion mixture to the food processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the onions are still warm, purée with the livers and butter until smooth. Taste, adding more salt, pepper or vinegar as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to the jars. Wipe the inside lip of the jars clean with a damp cloth. Slowly pour enough olive oil over the mousse to just cover. Screw on the lids. Let cool before moving the jars to the refrigerator, where they can keep for a few days. Serve chilled with toasted, sliced bread and sweet-and-sour cherries."}], "link": "https://cooking.nytimes.com/recipes/1012624-chicken-liver-mousse"}