{"@context": "http://schema.org", "@type": "Recipe", "name": "Provençal Onion Pizza", "description": "Pissaladière is a signature Provençal dish from Nice and environs, a pizza spread with a thick, sweet layer of onions that have been cooked slowly until they caramelize and garnished with olives and anchovies.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/05/29/health/29recipehealth_600/29recipehealth_600-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "One 12- to 14 inch pizza", "recipeCuisine": "french", "recipeCategory": "dinner, pizza and calzones", "keywords": "anchovy, sweet onions, whole wheat pizza dough, dairy-free, halal, healthy, kosher, low cholesterol, nut-free, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 48}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 189, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "503 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["3 tablespoons olive oil", "2 pounds sweet onions, finely chopped", "Salt", "freshly ground pepper", "3 garlic cloves, minced", "1/2 bay leaf", "2 teaspoons fresh thyme leaves, or 1 teaspoon dried thyme", "1 tablespoon capers, drained, rinsed and mashed in a mortar and pestle or finely chopped", "1/2 recipe whole wheat pizza dough (<a href=\"https://cooking.nytimes.com/recipes/1014328-pizza-with-green-garlic-potatoes-and-herbs\">see recipe</a>)", "12 anchovy fillets, soaked in water for five minutes, drained, rinsed and dried on paper towels", "12 Niçoise olives"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees, preferably with a pizza stone inside. Heat 2 tablespoons of the olive oil in a large, heavy nonstick skillet over medium-low heat. Add the onions and cook, stirring, until they begin to sizzle and soften, about three minutes. Add a generous pinch of salt and the garlic, bay leaf, thyme and pepper. Stir everything together, turn the heat to low, cover and cook slowly for 45 minutes, stirring often. The onions should melt down to a golden brown puree. If they begin to stick, add a few tablespoons of water. Stir in the capers, then taste and adjust seasonings. If there is liquid in the pan, cook over medium heat, uncovered, until it evaporates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out the pizza dough and line a 12- to 14-inch pan. Brush the remaining tablespoon of oil over the bottom but not the rim of the crust. Spread the onions over the crust in an even layer. Cut the anchovies in half, and decorate the top of the crust with them, making twelve small X’s and placing an olive in the middle of each X. Place on top of the pizza stone, and bake 15 to 20 minutes, until the edges of the crust are brown and the onions are beginning to brown. Remove from the heat. Serve hot, warm or room temperature."}]}