{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Tofu in Caramel Sauce", "description": "This is a vegetarian take on a classic of Vietnamese restaurants, ca kho, or fish braised in caramel sauce. Here, tofu, firm and rich, takes on the character of savory Asian panna cotta, absorbing the velvety sauce and somehow heightening its flavor.\n\nVietnamese caramel sauce — nuoc mau — is easier to make than you might think, though it can be a dramatic process. In essence what you’re doing is melting sugar in a pan, then allowing it nearly to burn and finally adding water and soy sauce in order to arrest the process at a dark and golden bittersweet flavor that is at the heart of Vietnamese cooking.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Braised-Tofu/Braised-Tofu-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "main course, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 328}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 431, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "6 grams", "proteinContent": "21 grams", "saturatedFatContent": "1 gram", "sodiumContent": "688 milligrams", "sugarContent": "56 grams", "transFatContent": null}, "recipeIngredient": ["1 1-pound block firm tofu", "1 cup white sugar", "5 shallots, peeled and minced", "4 cloves garlic, peeled and minced", "2 tablespoons peeled and minced ginger", "3 tablespoons soy sauce", "1/2 bunch scallions, white and light-green parts only, thinly sliced", "Freshly ground black pepper", "Cooked jasmine rice, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice the tofu in half along its length and then each portion into two thick slices. Place the slices between paper towels to drain, replacing towels as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, dissolve the sugar in 1/4 cup water and cook in a small saucepan over medium-low heat until small bubbles begin to appear around the edges of the pan. Carefully swirl the solution, but do not stir. Continue to heat, as bubbles move inward toward the center of the pan and the solution turns darker, 20 to 35 minutes, until the syrup has become a deep, golden caramel color. Carefully add 1/2 cup water to this mixture. (It will sputter violently. If some sugar crystallizes at this point, carefully stir the mixture with a metal spoon. The sugar will remelt.) Turn off the heat and allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the caramel sauce to a wide saucepan, turn the heat to medium and add the shallots, cooking for about 2 minutes. Add the garlic and ginger and stir again, cooking for about 1 minute. Now stir in the soy sauce. Simmer and stir until the mixture is viscous and the vegetables are well coated, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the tofu in the sauce in a single layer and simmer uncovered for 7 minutes. Using a spatula, turn the pieces over. Simmer for 3 or 4 minutes more and then transfer to a warmed platter. Pour the sauce over the tofu and sprinkle with scallions and black pepper. Serve with white rice."}], "link": "https://cooking.nytimes.com/recipes/1012938-braised-tofu-in-caramel-sauce"}