{"@context": "http://schema.org", "@type": "Recipe", "name": "Rock Fish and Spinach Gratin", "description": "This recipe is based on a traditional Provençal salt cod and spinach gratin. I use fresh rock fish, like snapper or cod. Fish symbolizes good luck in many cultures, and the greens represent money. The dish tastes rich and creamy, but there is no cream or butter in it.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/rockfish-still/rockfish-still-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves four to six", "recipeCuisine": "french", "recipeCategory": "casseroles, one pot", "keywords": "halal, healthy, kosher, nut-free, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 234, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "23 grams", "saturatedFatContent": "2 grams", "sodiumContent": "760 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds spinach, stemmed and washed thoroughly, or 1 pound baby spinach, rinsed", "3 tablespoons extra virgin olive oil", "2 tablespoons finely chopped shallot or onion", "2 tablespoons all-purpose flour, sifted", "2 cups low-fat milk", "Salt", "freshly ground pepper to taste", "1 garlic clove, green shoot removed, finely minced or pureed", "Pinch of nutmeg", "1 pound snapper or other rock fish fillets", "1/4 cup fresh or dried bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil, and add the spinach. Blanch for 30 seconds, and transfer to a bowl of ice water. Drain and squeeze dry, taking the spinach up by the handful. Chop finely, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil in a medium saucepan over medium heat, and add the shallot. Cook, stirring, until tender, about 3 minutes, and stir in the flour. Cook, stirring, for several minutes, until the mixture begins to color slightly. Remove from the heat. Whisk in the milk all at once. Return to the heat, and cook, stirring constantly, until the mixture simmers and thickens. Turn the heat to low, and simmer, stirring or whisking often, for 15 minutes. There should be no floury taste. Add salt and freshly ground pepper to taste, and stir in the garlic and a touch of nutmeg if desired. Stir in the chopped spinach. Taste, and add more salt and pepper as desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees. Oil a 2-quart gratin or baking dish. Place the fish fillets in a steamer above 1 inch of boiling water and steam for 5 minutes. Remove from the heat. The fillets should be opaque. Break the fish into small pieces, and remove any bones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon a thin layer of the creamed spinach over the bottom of the dish, and top with the fish in one layer. Season the fish with salt and pepper. Spoon the remaining creamed spinach over the fish. Top with the breadcrumbs. Drizzle on the remaining tablespoon of olive oil. Place in the oven, and bake for 20 minutes until it is sizzling and beginning to brown."}], "link": "https://cooking.nytimes.com/recipes/1012958-rock-fish-and-spinach-gratin"}