{"@context": "http://schema.org", "@type": "Recipe", "name": "Dandelion Tart", "description": "This tart tastes rich and creamy, though there is no cream in it. When you blanch the dandelion greens, they lose some of their bitterness.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/08/health/08recipehealth_600/08recipehealth_600-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "breakfast, brunch", "keywords": "appetizer, main course, side dish, dandelion greens, eggs, gruyère, halal, healthy, kosher, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 66}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 178, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "281 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 generous bunch dandelion greens, about 12 ounces", "Salt to taste", "2 tablespoons extra virgin olive oil", "1 small onion, chopped", "6 mushrooms, sliced (about 1 cup sliced mushrooms)", "1 or 2 garlic cloves (to taste), green shoots removed, minced", "4 large or extra large eggs", "3/4 cup low-fat milk", "Freshly ground pepper", "3/4 cup Gruyère cheese, grated (3 ounces)", "1 yeasted olive oil crust"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the tough stems from the dandelion greens, about 1 inch from the bottom, and wash in two changes of water. Bring a large pot of water to a boil, and fill a bowl with ice water. When the water comes to a boil, salt generously and add the dandelion greens. Blanch four minutes and transfer to the ice water. Drain, squeeze out excess water and chop."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Heat the olive oil in a large nonstick skillet over medium heat, and add the onion. Cook, stirring, until tender, about five minutes, and add a pinch of salt and the mushrooms. Cook, stirring, for four to five minutes, until the mushrooms have softened and the onions are golden. Add the garlic and cook for another minute, then stir in the dandelion greens. Stir together for a minute, and remove from the heat. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Brush the bottom of the pastry shell, and place in the preheated oven for five minutes. Remove from the oven. Whisk the milk into the eggs, add 1/2 teaspoon salt, freshly ground pepper to taste and stir in the cooked vegetables and cheese. Turn into the crust. Bake 35 to 40 minutes, until set and the top is lightly browned. Remove from the heat and allow to sit for 15 minutes before serving. Serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/1012812-dandelion-tart"}