{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Pork Porterhouse With an Apple-Maple-Ginger Sauce", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Grilled-Pork-Porterhouse/Grilled-Pork-Porterhouse-articleLarge.jpg", "totalTime": "P1DT30M", "recipeYield": "Serves 6", "recipeCuisine": "american", "recipeCategory": "dinner", "keywords": "apple juice, maple syrup, pork loin chops, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "recipeIngredient": ["1/4 cup maple syrup", "5 tablespoons kosher salt", "3 tablespoons peeled, sliced ginger", "3 tablespoons crushed garlic", "1 sprig fresh sage", "3/4 cup onion slices, cut into 1/4 -inch rings", "5 bay leaves", "2 teaspoons peppercorns", "6 1 1/4-inch-thick pork loin chops (also known as pork porterhouses), preferably Berkshire organic (see note)", "1 tablespoon coriander seeds", "1 bay leaf", "1 tablespoon peppercorns", "2 tablespoons minced shallot", "1 teaspoon minced fresh thyme", "1 teaspoon minced fresh rosemary", "1/2 cup vegetable oil", "2 tablespoons butter", "1/4 cup minced shallot", "1 tablespoon minced garlic", "2 cups apple juice", "1/2 cup chicken stock", "3 star anise", "2 tablespoons minced ginger", "1/2 cup maple syrup", "1/2 vanilla bean, seeds scraped", "1 tablespoon agar (see note)", "Salt", "freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Twenty-four hours before cooking, stir all of the brine ingredients except the pork into 1 quart of water in a large pot and bring to a boil. Let cool to room temperature. Submerge the pork chops in the brine, cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next morning, prepare the infused oil: grind the coriander, bay leaf and peppercorns in a spice mill or a clean coffee grinder and combine with the remaining ingredients in a medium bowl. Let sit at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the sauce: In a saucepan, melt the butter over medium-low heat. Add the shallots and sauté until caramelized, about 4 minutes. Add the garlic and cook for 1 minute. Add the apple juice, chicken stock, star anise and ginger. Bring to a boil, lower the heat and simmer until reduced by one-quarter. Add the maple syrup, vanilla pod and seeds and agar and simmer for 3 minutes. Remove from the heat. Discard the star anise and vanilla pod. Purée the mixture in a blender or food processor, then pass through a fine-mesh sieve into a pan. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a charcoal or gas grill to medium-high heat. Rinse the meat and pat dry with paper towels. Brush the chops with the infused oil, then sprinkle lightly with salt. Grill to medium doneness, or until the internal temperature reads 135 to 140 degrees on a thermometer and the middle is light pink, about 6 minutes per side. Let sit for 5 minutes before serving. Drizzle with warm sauce and serve."}]}