{"@context": "http://schema.org", "@type": "Recipe", "name": "Thai Larb Gai (Chicken With Lime, Chili and Fresh Herbs)", "description": "Larb gai is a dish of browned ground chicken, mint, basil and red onions dressed with lime juice and ground red chiles that's popular in Laos and Isan, neighboring rural sections of Thailand. (The dish is sometimes spelled laab, lob or lop.) It's perfect hot weather food: spicy, crunchy and light, but rich in flavors and contrasts. Traditionally, this dish is made with a roasted rice powder that's prepared by toasting raw rice in a wok, then grounding it to a powder, but you can find premade roasted rice powder at Asian markets. Whatever you do, don't skip it — it adds a nuttiness that's essential to the authentic flavor of the dish.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2017/05/11/dining/larb/larb-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "thai", "recipeCategory": "dinner, quick, salads and dressings", "keywords": "chicken, mint, rice, dairy-free, gluten-free, halal, kosher, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 220}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 199, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "0 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "375 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup raw sticky rice (see Note) or 2 tablespoons roasted rice powder (available at Asian markets)", "16 ounces coarsely ground or finely chopped white- or dark-meat chicken (lean beef, such as sirloin, can be substituted)", "1/2 teaspoon hot chile powder, preferably Thai or Lao", "4 teaspoons fish sauce (nam pla)", "5 teaspoons freshly squeezed lime juice", "1/4 cup slivered red onions", "2 tablespoons chopped cilantro", "2 tablespoons sliced scallions", "10 whole mint leaves, more for serving", "Lettuce leaves", "cucumber spears, for serving", "4 cups cooked sticky or jasmine rice, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make roasted rice powder, heat a wok or skillet over high heat. Add raw rice and cook, stirring often, until rice is toasted and dark brown, but not black, 3 to 5 minutes. Remove from wok and set aside to cool. Grind to a coarse powder in a mortar, blender or coffee grinder; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To cook chicken, heat a wok or skillet over medium-high heat. When very hot, add 2 tablespoons water, then add chicken, stirring constantly to break up any lumps. Cook just until cooked through, about two minutes, then transfer to mixing bowl. While chicken is just warm, add remaining ingredients (except for garnishes) and roasted rice powder. Mix gently but thoroughly. Taste and adjust seasonings. Mixture should be tangy, salty and lightly spicy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon onto serving plate and surround with mint, lettuce and cucumber. Serve with rice. If serving with sticky rice, pinch some off, mold into a small ball and dip into larb, scooping up a little of each ingredient. Or scoop larb into lettuce leaves."}]}