{"@context": "http://schema.org", "@type": "Recipe", "name": "Chickpeas and Pita Casserole", "description": "There are a number of Middle Eastern preparations made with stale pita or flat bread, also known as fatta. They are comforting dishes, especially this layered casserole made with pita, chickpeas and broth, and garlicky thickened yogurt.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/04/health/04recipehealth_600/04recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT2H45M", "recipeYield": "Serves six", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, casseroles", "keywords": "chickpea, garbanzo beans, pita, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 11}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 390, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "49 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "8 grams", "proteinContent": "19 grams", "saturatedFatContent": "4 grams", "sodiumContent": "392 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups dried chickpeas, washed, picked over and soaked overnight or for six hours", "Salt to taste", "3 pita breads, white or whole wheat", "4 garlic cloves, split in half, green shoots removed", "1 teaspoon cumin seeds, lightly toasted and ground", "5 tablespoons freshly squeezed lemon juice (more to taste)", "2 tablespoons extra-virgin olive oil", "1 1/2 cups drained yogurt", "2 tablespoons sesame tahini", "1 to 2 teaspoons dried mint, or 1 to 2 tablespoons chopped fresh mint"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans, and combine in a large pot with 6 cups of water. Bring to a boil, reduce the heat, cover and simmer one hour. Add salt to taste, and continue to simmer for another hour, until the beans are very tender. Drain through a colander set over a bowl. Add 2 tablespoons lemon juice to the broth, taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Open the pita breads, and toast in the oven until crisp, about 10 minutes. Oil a 3-quart baking dish. Break the pitas into pieces, and line the dish with the bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the garlic with 1/4 teaspoon of salt in a mortar and pestle, and mash to a paste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree half the chickpeas with half the garlic and the cumin in a food processor fitted with the steel blade. With the machine running, add 3 tablespoons of the lemon juice, the olive oil and 3/4 cup of the cooking liquid from the beans. Add salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Douse the pita bread with 1 cup of the chickpea broth. Scrape the pureed chickpeas over the pita bread in an even layer. Top with the remaining chickpeas. Stir the remaining garlic, the tahini and the remaining lemon juice into the yogurt. Add salt to taste. Spread in an even layer over the chickpeas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Warm for 15 minutes in the preheated oven, sprinkle on the mint and serve."}], "link": "https://cooking.nytimes.com/recipes/1012857-chickpeas-and-pita-casserole"}