{"@context": "http://schema.org", "@type": "Recipe", "name": "Two-Way Chanterelle and Pear Bread Stuffing", "description": "", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/10/24/dining/pear-mushroom-stuffing/pear-mushroom-stuffing-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "18 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, winter, mushroom, pear, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 70}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 209, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "3 grams", "proteinContent": "5 grams", "saturatedFatContent": "5 grams", "sodiumContent": "325 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 large loaf Pullman or other firm white bread", "1 pound chanterelle mushrooms", "1/3 pound pancetta, diced small", "10 tablespoons butter, more for greasing muffin tins", "1 large chopped onion", "1/4 cup minced shallots (about three)", "Salt", "Freshly ground black pepper", "1/3 cup white wine", "3 1/2 cups diced pears (about four or five firm, ripe varieties like Bartlett or Anjou) plus one whole pear", "1 teaspoon sugar", "1 1/2 tablespoons finely chopped fresh thyme, or 1 1/2 teaspoons dried thyme", "1/4 cup minced chives", "1/3 cup chopped Italian parsley", "2 cups turkey stock"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Tear bread into small pieces (you should have about 16 cups) and set in roasting pan or bowl. To dry bread, cover with paper towels and leave out overnight. Or, place on a baking sheet in batches and lightly toast. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe mushrooms with a clean, damp towel. Trim tough ends. Slice some thickly, chop others. Set aside. Place pancetta in a large skillet over medium heat. Cook slowly until fat is rendered, about 7 minutes. Remove to a large plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons butter to fat in pan and turn heat to medium high. Add onion and shallots, season with salt and pepper, and cook, stirring occasionally, until just soft. Do not brown. Remove to plate holding pancetta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 3 tablespoons butter to pan. Add mushrooms, season with salt and pepper and quickly sauté until starting to brown. Remove and add to plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add wine to pan and deglaze over medium high heat, cooking until wine reduces by about half. Pour remaining liquid over mushrooms. Wipe out pan and add remaining butter. Add pears and sugar and season with salt and pepper. Sauté pears, in batches if necessary, over medium high heat until they begin to brown slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl or roasting pan, add sautéed ingredients to bread. Toss lightly to combine. Add herbs and toss again. Slowly pour one cup stock over mixture and toss. Add more broth to make a very moist stuffing. Taste and adjust for salt and pepper. If you are stuffing a brined turkey, remember that the bird will add a bit more salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before roasting turkey, place some room-temperature stuffing lightly inside a prepared bird. Place whole pear in opening of cavity to help hold stuffing in the bird."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 375 degrees. Generously butter muffin tins and fill each with stuffing, pressing down so each cup is well filled. Top each with one tablespoon stock. Bake for about 20 to 30 minutes, until a golden crust forms on bottom. To serve, use a butter knife to remove each stuffing muffin and invert onto the plate."}], "link": "https://cooking.nytimes.com/recipes/1012870-two-way-chanterelle-and-pear-bread-stuffing"}