{"@context": "http://schema.org", "@type": "Recipe", "name": "A Meal in a Bowl: Salmon, Shiitakes and Peas", "description": "Dried shiitake mushrooms bring a hearty flavor, not to mention wonderful nutrients, to this dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/04/28/health/28recipehealth_600/28recipehealth_600-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "Serves four", "recipeCuisine": "asian", "recipeCategory": "dinner, soups and stews", "keywords": "dairy-free, halal, healthy, high fiber, kosher, nut-free, english peas, salmon fillet, shiitake, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 44}, "recipeIngredient": ["1 ounce (about 10) dried shiitake mushrooms", "6 cups kombu stock, chicken stock or vegetable stock", "Soy sauce to taste", "1 pound fresh English peas, shelled", "6 ounces Japanese soba noodles, cooked and tossed with 2 teaspoons sesame oil or canola oil", "12 to 16 ounces salmon fillet without skin, trimmed of fat and cut in four equal pieces", "1 bunch scallions, thinly sliced, light and dark green parts kept separate"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dried mushrooms in a large bowl. Bring the stock to a simmer, and pour over the mushrooms. Let sit for 30 minutes. Drain through a cheesecloth-lined strainer set over a bowl, and squeeze the mushrooms over the strainer. Slice the mushroom caps, discarding the hard stems. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the stock to the saucepan, and bring to a simmer. Taste and adjust seasoning, adding soy sauce or salt as desired. Add the peas, and simmer five minutes. If the noodles have been refrigerated, warm them by placing them in a strainer and dipping the strainer into the simmering broth. Then distribute the noodles among four deep soup bowls."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sliced mushroom caps, the salmon fillets and the white and light green parts of the scallions to the simmering stock. Cover and turn off the heat. Allow to sit for five minutes without removing the cover. The salmon should be just cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a piece of salmon on top of the noodles in each bowl. Ladle in the soup, taking care to evenly distribute the peas, mushrooms and scallions. Sprinkle on the dark green part of the scallions, and serve."}], "link": "https://cooking.nytimes.com/recipes/1012513-a-meal-in-a-bowl-salmon-shiitakes-and-peas"}