{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy Gazpacho", "description": "This silky, salmon-colored puree is called salmorejo in Cordoba, Spain, where it originated. It’s thicker than gazpacho Andaluz, just a simple mixture of tomatoes, bread, garlic and olive oil. Its success depends entirely on the quality of the tomatoes and oil. Authentic salmorejo has about three times as much olive oil as this version and can be thicker, doubling as a sauce or a dip. Traditionally, the soup is garnished with Ibérico or Serrano ham and diced hard-boiled eggs, but I like to garnish mine with diced green pepper or, for some spice, diced poblano pepper.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/08/06/health/06recipehealth_600/06recipehealth_600-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "Four servings", "recipeCuisine": "spanish", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "appetizer, main course, side dish, bread, tomato, dairy-free, halal, healthy, kosher, low cholesterol, nut-free, vegan, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 45}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 117, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "612 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds ripe red tomatoes, peeled", "4 ounces stale French baguette, crusts removed and diced or torn into pieces (about 2 1/2 cups diced or torn up bread)", "2 garlic cloves, halved, green shoots removed, coarsely chopped", "3 tablespoons extra virgin olive oil (more to taste), plus additional for drizzling", "1 1/2 to 2 tablespoons sherry vinegar (to taste)", "Salt to taste", "For garnish: diced green pepper or, for a spicy twist, diced poblano pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bread in a bowl, and cover with cold water. Allow to sit for a few minutes, then drain and squeeze the water from the bread. Return the bread to the bowl, and place a strainer over the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the peeled tomatoes in half across the equator, and squeeze out the seeds over the strainer. Rub the seed pods against the strainer to extract as much juice as you can. Discard the seeds. Chop the tomatoes coarsely, and add to the bowl with the bread and tomato juice. Add the garlic, 2 tablespoons of the olive oil, the vinegar and salt to taste. Toss together and leave to marinate for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a blender, and blend at high speed until homogenized (you will probably have to do this in two batches). While the blender is running, drizzle in the remaining tablespoon of olive oil. Pour into the bowl, taste and adjust seasoning, adding more salt if desired. Cover and chill for at least two hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve, garnishing each bowl with diced green or poblano pepper and a drizzle of olive oil."}], "link": "https://cooking.nytimes.com/recipes/1012717-creamy-gazpacho"}