{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Orzo With Tomatoes, Roasted Peppers and Zucchini", "description": "Orzo is a type of pasta that looks like rice. It’s popular in Greece, where it is baked in casseroles like this one. If you like comforting dishes like macaroni and cheese, you’ll like this.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/08/13/health/nutrition/13recipehealth.ready/13recipehealth.ready-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves six", "recipeCuisine": "greek", "recipeCategory": "dinner, pastas", "keywords": "halal, healthy, kosher, low cholesterol, nut-free, vegetarian, main course, side dish, orzo, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 362}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 192, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "3 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "478 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound orzo (about 1 1/8 cups)", "Salt to taste", "1 large red pepper, roasted and diced", "3 tablespoons extra virgin olive oil", "2 medium zucchini, sliced about 1/4 inch thick", "Freshly ground pepper to taste", "1 pound tomatoes, peeled, seeded and diced; or 1 14-ounce can diced tomatoes, with juice", "1 or 2 plump garlic cloves (to taste), minced", "2 ounces freshly grated Parmesan or 2 ounces crumbled goat cheese (1/2 cup, tightly packed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of generously salted water to a boil, and add the orzo. Cook eight minutes, or until it is cooked through but still firm to the bite. Drain and transfer to a large bowl. Toss with the diced roasted pepper and 1 tablespoon of the olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Oil a 2-quart baking dish. Heat another tablespoon of olive oil over medium-high heat in a large, wide skillet. Add the zucchini and cook — stirring and turning over the slices, or tossing them in the pan — until just cooked through and lightly colored, about five minutes. Scrape into the bowl with the orzo."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan to the heat, add the final tablespoon of oil and the garlic. Cook just until fragrant, 20 to 30 seconds, and add the tomatoes and salt to taste. Cook, stirring from time to time, until the tomatoes have cooked down slightly and smell fragrant. Taste and adjust seasoning. Scrape into the bowl with the orzo, add the Parmesan or goat cheese, and mix everything together. Add freshly ground pepper to taste, and adjust salt. Transfer to the baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 30 to 40 minutes, until the top is just beginning to color. Serve hot or warm."}]}