{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear and Apple Soufflé", "description": "Fruit soufflés are dramatic and impressive yet so easy to make. This one will impress everyone at your table. Make the fruit puree well in advance, and beat the egg whites before you sit down to dinner. Then, when you’re too full to eat anything more, fold the two together and put the soufflés in the oven. Just when you’re beginning to think you could eat a little dessert, they’ll be ready.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/24/health/24recipehealth_600/24recipehealth_600-articleLarge-v3.jpg", "totalTime": "PT1H45M", "recipeYield": "Serves six", "recipeCuisine": "french", "recipeCategory": "", "keywords": "apple, pear, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegetarian, dessert, fall", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 198, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "2 grams", "sodiumContent": "76 milligrams", "sugarContent": "31 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Juice of 1/2 lemon", "1 pound apples, peeled, cored and diced", "1 1/2 pounds ripe, juicy pears, peeled, cored and diced", "1/3 cup sugar", "1 teaspoon vanilla extract", "1/4 teaspoon powdered ginger", "Butter for the ramekin (or ramekins)", "8 large egg whites", "1/8 teaspoon cream of tartar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a bowl with water, and add the juice of 1/2 lemon. Place the fruit in the water as you prepare it. When all of the fruit is prepared, drain and transfer to a large, heavy saucepan. Add 1 tablespoon of the sugar, the vanilla and ginger, and 2 tablespoons water. Bring to a simmer over medium heat. Stir, and then turn the heat down to low, cover and simmer, stirring often, for 20 minutes. Uncover and continue to simmer for another 30 to 40 minutes, stirring often, until the fruit is very soft and beginning to stick to the pan. It may or may not look like applesauce, depending on the texture of the apples and pears that you used (Granny Smith apples, for example, will break down, whereas Galas will not). Remove from the heat, and transfer to a food processor fitted with the steel blade. Puree until smooth. Transfer to a large bowl, and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees with the rack adjusted to the lowest position. Butter one 2-quart soufflé dish or six 6-ounce ramekins and dust with sugar (use about 1 1/2 tablespoons of the sugar)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer fitted with the whisk attachment, or in a large bowl with a hand mixer, beat the egg whites on low speed for one minute or until they foam. Add the cream of tartar, and continue to beat on low speed for one minute. Turn the speed to medium, and slowly stream in the remaining sugar while you continue to beat until there are firm, satiny peaks. Be careful not to overbeat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fold one third of the egg whites into the apple-pear puree to lighten it. Fold in the rest. Gently spoon into the ramekins or the soufflé dish, mounding it up over the top. Put the ramekins on a baking sheet, and place in the oven. Bake individual soufflés for about 10 minutes, until puffed and golden. They should still be runny on the inside. Bake a large soufflé for 15 to 20 minutes. Serve at once."}]}