{"@context": "http://schema.org", "@type": "Recipe", "name": "Black-Eyed Peas With Collard Greens", "description": "Black-eyed peas with collard greens sounds like a Southern dish, and indeed it would be if you threw in a ham hock and took away the dill. But this recipe actually is inspired by a Greek dish that combines black-eyed peas with wild greens.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/27/health/27recipelhealth_600/27recipelhealth_600-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves six", "recipeCuisine": "greek, southern", "recipeCategory": "one pot", "keywords": "black-eyed peas, collard greens, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 306}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 156, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "8 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "491 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound black-eyed peas, rinsed", "3 tablespoons extra virgin olive oil", "1 large onion, chopped", "3 large garlic cloves, minced", "1 bay leaf", "Salt to taste", "1 large bunch collard greens (1 1/2 to 2 pounds), stemmed, washed well and chopped or cut in ribbons", "2 tablespoons tomato paste dissolved in 1/2 cup water", "1/4 to 1/2 cup chopped fresh dill (to taste)", "Freshly ground pepper to taste", "For topping (optional): crumbled feta or fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the black-eyed peas in a large saucepan, cover with water by two inches, bring to a boil and then drain. Combine with half the onion and one of the garlic cloves in the saucepan. Add water to cover by two inches, and bring back to a simmer. Add the bay leaf, and reduce the heat. Add salt to taste, cover and simmer 30 minutes, until the beans are just tender. Drain through a strainer set over a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, preheat the oven to 350 degrees. In a large, ovenproof lidded skillet or Dutch oven, heat 2 tablespoons of the olive oil over medium heat and add the remaining onion. Cook, stirring, until tender, about five minutes, and add the remaining garlic. Stir together for 30 seconds to a minute, until fragrant. A handful at a time, stir in the greens. As the greens wilt, stir in another handful, until all the greens have been added and have collapsed in the pan. Add the dissolved tomato paste and stir together. Add salt to taste. Add the beans and enough cooking liquid to barely cover everything, cover and place in the oven for 30 minutes, until the collards are tender and the beans very soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the pot, and add a bit of liquid if the beans are dry. Stir in the remaining tablespoon of olive oil and the dill, cover and continue to simmer for another 10 minutes. Add salt and freshly ground pepper to taste. Serve warm or hot. If you wish, top with crumbled feta or a squeeze of lemon."}]}