{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Broccoli Rabe, Toasted Garlic and Bread Crumbs", "description": "Broccoli rabe can take whatever you throw at it and still shine. Its mild but distinctive bitterness dominates almost anything you cook it with — but what’s wrong with that? So a pasta sauce that features it teamed with garlic and chili flakes is a natural. Add bread crumbs for crunch and the dish is a real winner. You can use the same pot for cooking the broccoli and the pasta; you can use the same skillet for toasting the bread crumbs and finishing the dish. The whole thing will be done within 20 or 30 minutes, and it will showcase broccoli rabe beautifully, as it deserves.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/06/05/dining/Spaghetti-With-Broccoli-Rabe/Spaghetti-With-Broccoli-Rabe-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, weekday, pastas", "keywords": "bread crumbs, broccoli rabe, spaghetti, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 400}, "recipeIngredient": ["Salt", "1/2 cup extra virgin olive oil, more as needed", "3 or 4 cloves of garlic, peeled and slivered", "1 cup bread crumbs, preferably homemade", "1/4 teaspoon red pepper flakes, or to taste", "About 1 pound broccoli rabe, trimmed and washed", "1 pound spaghetti, linguine or other long pasta", "Freshly ground black pepper", "Freshly grated Parmesan cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt it. Put 1/4 cup olive oil in a large skillet over medium-low heat. When oil is warm, cook garlic just until fragrant, 1 to 2 minutes. Add bread crumbs and red pepper flakes and cook until bread crumbs are golden, 5 minutes or so. Remove and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook broccoli rabe in boiling water until it is soft, about 5 minutes. Remove with a slotted spoon, drain well and chop. Cook pasta in same pot."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, add remaining oil to skillet over medium-low heat. Add broccoli rabe and toss well; sprinkle with salt and pepper. When it is warm add garlic and bread crumbs and mix well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When pasta is done, drain it, reserving a little cooking water. Toss pasta in skillet with broccoli rabe mixture, moistening with a little reserved water if necessary. Adjust seasonings and serve with freshly grated Parmesan."}], "link": "https://cooking.nytimes.com/recipes/1012419-spaghetti-with-broccoli-rabe-toasted-garlic-and-bread-crumbs"}