{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramel Yogurt", "description": "", "author": {"@type": "Person", "name": "Harold Mcgee"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "4 half-cup servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, gluten-free, nut-free, vegetarian, plain whole-fat yogurt, sugar, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": null, "proteinContent": "9 grams", "saturatedFatContent": "5 grams", "sodiumContent": "186 milligrams", "sugarContent": "36 grams", "transFatContent": null}, "recipeIngredient": ["1 quart plain whole-fat yogurt, homemade or manufactured with milk and cultures only (do not use yogurt with stabilizers or Greek yogurt, which is already drained)", "1/2 cup sugar", "Pinch of salt", "Ground cardamom, cinnamon or grated lemon zest for garnish (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place yogurt in a fine-meshed strainer or colander lined with cheesecloth. Place strainer over a bowl and drain for at least 3 hours, or overnight. Reserve all liquid in bowl: this is whey. There should be about 2 cups firm drained yogurt. If necessary, return enough whey to yogurt to make 2 cups."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, place sugar, salt and 1 cup whey. Bring to a boil, reduce heat to medium and cook, stirring frequently; adjust heat as needed so mixture does not boil over. Cook until liquid boils off and remaining syrup becomes deep brown, 20 to 30 minutes. Remove from heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add 2 tablespoons whey to pot and stir to blend well. If mixture is too thick to stir, add another tablespoon of whey. Allow caramel to cool slightly, stirring frequently to make sure it remains fluid. (If caramel stiffens too much to stir, place over a pot of hot water and stir until fluid again.) Add 1/4 cup yogurt to pot and stir vigorously to blend. Add remaining yogurt and stir to blend fully."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a covered container and refrigerate until chilled, at least 30 minutes. If desired, serve garnished with a sprinkling of cardamom, cinnamon or grated lemon zest."}]}