{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Ragout ‘Gravy’", "description": "I never make gravy. Some people find that perplexing, but I don’t like it — there’s just too much fat involved. Instead, I make this mushroom ragout and spoon it over the turkey and on the side.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/18/health/18recipehealth_600/18recipehealth_600-articleLarge-v3.jpg", "totalTime": "PT1H30M", "recipeYield": "6 to 8 side dish servings, more as gravy", "recipeCuisine": "", "recipeCategory": "sauces and gravies", "keywords": "dairy-free, healthy, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, fall, mushroom, red wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 96}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 112, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "4 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "409 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1 ounce (about 1 cup) dried porcini mushrooms", "2 tablespoons extra-virgin olive oil", "1 medium onion or 2 shallots, chopped", "4 garlic cloves, minced", "1 pound mushrooms, cleaned, trimmed, and sliced 1/2 inch thick", "1 pound wild mushrooms or oyster mushrooms, cleaned, trimmed and sliced thick or torn into pieces", "Salt to taste", "1 tablespoon all-purpose flour", "1/2 cup fruity red wine, such as a Côtes du Rhone", "2 teaspoons chopped fresh rosemary or 1 teaspoon crumbled dried", "2 teaspoons chopped fresh sage or thyme leaves", "1 cup chicken stock or vegetable stock", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dried mushrooms in a bowl or tempered glass measuring cup, and pour on 2 cups boiling water. Let soak 30 minutes while you prepare the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a strainer over a bowl, line it with cheesecloth or paper towels, and drain mushrooms. Squeeze the mushrooms over the strainer to extract all the flavorful juices, and set aside the liquid in the bowl. Then rinse the mushrooms, away from the bowl with the soaking liquid, until they are free of sand. Squeeze dry and set aside. If very large, chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil in a large, heavy nonstick skillet or saucepan over medium heat, and add onion or shallots. Cook, stirring often, until tender, about 5 minutes. Add the garlic, stir together for about 30 seconds, and then add in all the mushrooms except the reconstituted porcini mushrooms and salt to taste. Cook, stirring often, until mushrooms begin to soften and to sweat, about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the flour and continue to cook mushrooms, stirring, until they have softened a little more and you can no longer see the flour, about 2 minutes. Add the reconstituted dried mushrooms and the wine, and turn the heat to high. Cook, stirring, until the liquid boils down and glazes the mushrooms, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add rosemary and sage or thyme, stir together, and stir in mushroom soaking liquid and stock. Bring to a simmer, add salt to taste, and cook over medium-high heat, stirring often, until mushrooms are thoroughly tender and fragrant and the surrounding broth is thick and gravy-like, about 20 minutes. If you want a thicker “gravy,” remove a cup and blend until smooth in a blender or a food processor fitted with the steel blade. Stir back into the ragout."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from the heat, stir in some freshly ground pepper, taste and adjust salt. Set aside in the refrigerator overnight."}], "link": "https://cooking.nytimes.com/recipes/1012883-mushroom-ragout-gravy"}