{"@context": "http://schema.org", "@type": "Recipe", "name": "Provençal Artichoke Ragout", "description": "This is the way my friend Christine Picasso prepares artichokes. Her touch is the inclusion of sweet red peppers, a nutritious complement to the bitter artichokes. She calls this Artichauts à la barigoule, a dish every French cook makes differently, each claiming his or hers to be the authentic version.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/04/07/health/07recipehealth_600/07recipehealth_600-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "baby artichokes, bell pepper, tomato, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 113, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "19 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "9 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "643 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds baby artichokes or globe artichokes if baby artichokes aren’t available, trimmed (see below)", "1 lemon, cut in half", "2 tablespoons olive oil", "1 large sweet onion, such as Vidalia or Maui, chopped, or 1 bunch of spring onions, chopped", "2 celery stalks, from the inner hart, sliced", "1 large or 2 small red bell peppers, diced", "4 large garlic cloves, minced or pressed", "Salt", "1 28-ounce can chopped tomatoes with juice, peeled, seeded and chopped", "3/4 to 1 cup water, as needed", "Freshly ground pepper", "1 teaspoon fresh thyme leaves, or 1/2 teaspoon dried thyme", "1 bay leaf", "2 to 4 tablespoons chopped fresh basil or parsley", "2 to 3 teaspoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "How to trim artichokes: Fill a bowl with water, and add the juice of 1/2 lemon. Cut the stems off the artichokes, and with a sharp knife, cut away the tops — about 1/2 inch from the top for baby artichokes, 1 inch for larger artichokes. Rub the cut parts with the other half of the lemon. Break off the tough outer leaves until you reach the lighter green leaves near the middle. With a paring knife, trim the bottom of the bulb right above the stem by holding the knife at an angle and cutting around the artichoke, until you reach the light flesh beneath the tough bottoms of the leaves. Cut small baby artichokes in half, or large artichokes into quarters, and cut away the chokes if the artichokes are mature. Immediately place in the bowl of acidulated water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large, heavy nonstick skillet or casserole over medium heat, and add the onion and celery. Cook, stirring, until tender, about three to five minutes. Add the red pepper and about 1/4 teaspoon salt, and stir together for three to five minutes until the pepper begins to soften. Add the garlic, and stir together for another minute, until the garlic is fragrant. Add the tomatoes and a little more salt, and cook, stirring from time to time, for 10 minutes, until the tomatoes have cooked down and smell fragrant. Add the artichokes, thyme, bay leaf and enough water to cover the artichokes halfway, and bring to a simmer. Add salt and pepper, then cover and simmer 30 to 40 minutes, until the artichokes are tender and the sauce fragrant. Check from time to time and add water if necessary. Add the lemon juice, taste and adjust salt and pepper."}], "link": "https://cooking.nytimes.com/recipes/1012483-provencal-artichoke-ragout"}