{"@context": "http://schema.org", "@type": "Recipe", "name": "Fancy Meatloaf", "description": "“I was invited to cook dinner for Nora Ephron.” As was wont to happen at one point in New York. Back in 2009, Sam Sifton was invited to a potluck in which “guests were meant to bring food inspired by Ephron’s career or by the woman herself.” He drew meatloaf, a dish she was known for. Here, in this recipe adapted from Gourmet, he pairs beef, veal, pancetta and Parmesan. The end result, he described, as “luxurious.” And what did Ms. Ephron think? She called it “remarkable.”", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2009/07/26/magazine/26food-600.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "beef, veal, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 420}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 586, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "1 gram", "proteinContent": "31 grams", "saturatedFatContent": "17 grams", "sodiumContent": "586 milligrams", "sugarContent": "2 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 loaf Italian bread, crust removed, torn into small pieces (about 2 cups)", "1 cup whole milk", "1 pound ground beef", "1 pound ground veal", "2 large eggs, scrambled", "4 ounces thinly sliced pancetta, chopped", "3/4 cup grated Parmesan", "1 bunch parsley, cleaned and finely chopped (about 1 cup)", "2 teaspoons grated lemon zest", "Kosher salt", "Freshly ground black pepper", "1/4 cup extra-virgin olive oil", "1/4 cup butter", "1 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. Soak bread in milk for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix beef, veal, eggs, pancetta, Parmesan, parsley and lemon zest in a large bowl. Season liberally with salt and pepper. Squeeze the bread to remove excess milk, then chop and add it to the meat. Mix gently until well combined, but do not overmix. Transfer onto a board and shape into a fine meatloaf, shy of a foot in length and 4 inches across. Loosely cover and refrigerate for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oil and butter in a large, ovenproof skillet over medium-high heat. Add meatloaf and sear without moving it until it is browned, about 5 minutes. Carefully slide a spatula under the meatloaf, then gently use another spatula to help turn it and brown the second side, again without moving it for 5 minutes. Transfer to a plate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour out all but 2 tablespoons of the fat, return skillet to the stove and raise heat to high. Add wine and deglaze pan, scraping up browned bits stuck to it with a wooden spoon. Return meatloaf to the skillet and then transfer to the oven, basting occasionally with the pan juices, until a meat thermometer inserted into the center of the loaf reads 150 degrees, about 25 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the meatloaf to a platter and let stand, tented with foil, 10 minutes. Slice, pour the pan juices over the top and serve."}], "link": "https://cooking.nytimes.com/recipes/1012686-fancy-meatloaf"}