{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta ‘Pizza’ With Pancetta and Spinach", "description": "Everything is fair game at breakfast — and long has been, of course — but to most Americans it doesn’t seem appropriate to start making what amounts to dinner at 7 in the morning. This pizza could be considered dinner or lunch fare, but it makes a hearty first meal of the day.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/polentapizza/polentapizza-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, pizza and calzones", "keywords": "appetizer, cornmeal, pancetta, spinach, fall, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 151}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 586, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "39 grams", "fiberContent": "5 grams", "proteinContent": "20 grams", "saturatedFatContent": "14 grams", "sodiumContent": "778 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup extra virgin olive oil, more for pan", "1/2 cup milk, preferably whole", "Salt", "1 cup coarse cornmeal", "Freshly ground black pepper", "1 small onion, chopped", "1/2 cup (about 4 ounces) chopped pancetta", "1 pound spinach, washed, trimmed and dried", "1 to 1 1/2 cups Gorgonzola cheese, crumbled"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees; brush a layer of olive oil on a pizza pan or cookie sheet. In a medium saucepan over medium-high heat, combine milk with 2 1/2 cups water and a large pinch of salt. Bring just about to a boil, reduce heat to medium, and add cornmeal in a steady stream, whisking all the while to prevent lumps from forming. Turn heat to low and simmer, whisking frequently, until thick, 10 or 15 minutes. If mixture becomes too thick, whisk in a bit more water; you want a consistency approaching thick oatmeal."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir 1 tablespoon oil into cooked cornmeal (polenta). Spoon it onto prepared pan, working quickly so polenta does not stiffen; spread it evenly to a thickness of about 1/2 inch all over. Sprinkle with salt and pepper, cover baking sheet with plastic wrap and put it in refrigerator until it is firm, an hour or more (you can refrigerate polenta overnight if you prefer)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put polenta in oven and bake for 25 to 30 minutes, or until it begins to brown and crisp on edges. Meanwhile, put two tablespoons oil in a large skillet over medium heat. Add onion and pancetta and cook, stirring occasionally, until onion is soft and pancetta is nicely browned, about 10 minutes. Use a slotted spoon to take onion and pancetta out of pan; set aside. Add spinach to skillet and sauté until it releases its water and pan becomes dry; sprinkle with salt and lots of pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take polenta out of oven, sprinkle with Gorgonzola, then spread onion-pancetta mixture and spinach evenly on top of cheese; drizzle with another tablespoon olive oil. Put pizza back in oven for two minutes, or until cheese begins to melt and pancetta and vegetables are warmed through. Cut into slices and serve hot or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1012403-polenta-pizza-with-pancetta-and-spinach"}