{"@context": "http://schema.org", "@type": "Recipe", "name": "Holiday Stollen", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2018/12/11/dining/mc-stollen/merlin_147141411_40688c87-e3ba-4caf-870f-670607d45347-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "2 loaves, each about 1 1/2 pounds", "recipeCuisine": "german", "recipeCategory": "", "keywords": "dessert, dried cherries, raisins, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 120}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 346, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "9 grams", "sodiumContent": "83 milligrams", "sugarContent": "27 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2/3 cup black raisins", "2/3 cup golden raisins", "1/2 cup dried cherries", "1/3 cup dark rum", "1 cup slivered almonds, lightly toasted", "1 package active dry yeast (1/4 ounce)", "1/2 cup milk, at room temperature", "4 cups all-purpose flour", "3/4 cup plus 3 tablespoons sugar", "2 3/4 teaspoons ground ginger", "1 teaspoon kosher salt", "1 teaspoon ground cinnamon", "1 teaspoon ground cardamom", "1 teaspoon freshly grated nutmeg", "1 teaspoon freshly grated lemon zest", "1/2 vanilla bean, seeds scraped and reserved", "2 cups (4 sticks) unsalted butter, melted", "1 large egg yolk", "1/2 cup chopped candied ginger", "1/2 cup mixed candied citrus peel (optional, see note)", "2 cups confectioners’ sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The night before baking, mix raisins, cherries and rum in a small container. Mix almonds with 1/4 cup water in another container. Cover both and let sit overnight at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, in an electric mixer with paddle, set on low speed, mix yeast with milk until dissolved. Add 1 cup flour and mix until a soft, sticky dough forms, about 2 minutes. This is the “starter.” Transfer starter to a lightly greased bowl, cover with greased plastic, and let rest for 40 minutes at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an electric mixer with paddle and set on low speed, mix remaining 3 cups of flour, 3 tablespoons of sugar, 1/2 teaspoon ginger, salt, cinnamon, cardamom, nutmeg, lemon zest and vanilla seeds. With motor running, pour in 1 cup melted butter. Mix on slow for 1 minute, then add egg yolk. Mix until liquid is absorbed, about 1 minute more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide starter dough into 3 pieces. Add starter to mixture in bowl, 1 piece at a time, mixing on slow until each addition is thoroughly combined, 2 to 3 minutes after each addition. After starter is absorbed, mix dough on a medium speed until glossy, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add almonds, candied ginger and citrus peel if using, and mix on slow until combined, 2 to 3 minutes. Add raisins, cherries, and rum and mix on slow until combined, 2 to 3 minutes more."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn dough out onto a lightly floured surface and knead until fruit and nuts are inside dough rather than stuck on surface, and dough is smooth and glossy, about 5 minutes. Place dough in a medium bowl and cover with plastic. Rest for 1 hour to let rise slightly. Then knead it once or twice, cover with plastic and let rest for another hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide into 2 equal pieces and shape each into an oval loaf about 8 inches long. Stack 2 rimmed baking sheets on top of each other, lining top pan with parchment. Place loaves on doubled pans and cover with plastic. Allow loaves to rest 1 more hour at room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 20 minutes before this rise is completed, preheat oven to 350 degrees. Remove plastic covering loaves and bake for about 1 hour. Loaves should look uniformly dark golden brown and internal temperature taken from middle of each loaf should be 190 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, whisk together the remaining 3/4 cup sugar and 2 1/4 teaspoons ground ginger. When stollen is done, transfer top pan holding loaves to a wire rack (leave stollen on pan). While still hot, brush stollen with remaining 1 cup of melted butter, letting butter soak into loaves. Sprinkle ginger sugar on tops and sides of loaves. When loaves are completely cool, cover loosely with waxed or parchment paper or foil and let sit at room temperature for 8 hours or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, sift 1 1/2 cups confectioners’ sugar over loaves, rolling to coat bottom and sides evenly with sugar. Wrap each loaf in plastic and let sit at room temperature for at least 2 days before sifting remaining 1/2 cup confectioners’ sugar over loaves and serving."}]}