{"@context": "http://schema.org", "@type": "Recipe", "name": "Orange Jelly", "description": "Sam Bompas and Harry Parr call what they do “contemporary food design,” among other things. Their projects include building painstakingly correct models of St. Paul’s Cathedral in London and a Madrid airport terminal out of jelly. This recipe was used as part of the pair’s first job in the United States. It was paired with Campari jelly, and the dessert they made for a 2009 dinner in New York tasted something like a Campari and soda in jelly form.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "quick", "keywords": "dairy-free, nut-free, dessert, orange juice, sugar, unflavored gelatin", "aggregateRating": null, "recipeIngredient": ["1/4 cup sugar", "3/4 cup orange juice, at room temperature", "1 packet unflavored gelatin", "1 orange, skin and membrane removed, flesh diced", "Campari jellies ( <a href=\"http://cooking.nytimes.com/recipes/1012475-campari-jelly\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make simple syrup: Place sugar in a saucepan, add 1/2 cup water, bring to a simmer and cook just until sugar dissolves. Allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, mix orange juice and simple syrup. Place gelatin in a small metal bowl or 1-cup metal measuring cup and pour 1/4-cup orange juice mixture over it to soften. When gelatin is soft, place bowl or cup in a shallow pan with simmering water below rim of bowl or cup. Let water simmer until gelatin mixture liquefies. Slowly whisk liquid gelatin into rest of orange juice mixture. Stir in  1/2 cup water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide orange pieces among 4 4-ounce or 6 3-ounce metal or silicone molds. Pour orange juice mixture into molds. Refrigerate until firm, at least 4 hours. Unmold onto a flat surface, like a baking sheet, by first dipping molds in hot water for count of 20. Return to refrigerator for at least 1 hour before serving. Serve with Campari jellies."}], "link": "https://cooking.nytimes.com/recipes/1012476-orange-jelly"}