{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa With Corn and Zucchini", "description": "Sweet corn and nutty-tasting quinoa make a nice combination that is also nutritionally rich. Quinoa has more iron than any other grain, and it’s a good source of manganese, magnesium, phosphorus and copper. It’s also a good source of protein.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/07/health/07recipehealth/07recipehealth-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves six to eight", "recipeCuisine": "", "recipeCategory": "", "keywords": "corn, quinoa, zucchini, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low sugar, nut-free, vegan, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 185}, "recipeIngredient": ["1 cup regular or red quinoa", "3 cups water, chicken stock or vegetable stock", "1/2 teaspoon salt, or to taste", "1 tablespoon extra virgin olive oil", "1/2 small onion, finely chopped", "1 to 2 garlic cloves (to taste), minced", "Kernels from 1 ear corn", "1 medium zucchini, cut in small dice", "2 to 4 tablespoon chopped fresh cilantro", "1/4 to 1/2 cup crumbled queso fresco or feta (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the quinoa in a bowl, and cover with cold water. Let sit five minutes. Drain through a strainer, and rinse until the water runs clear."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water or stock to a simmer in a medium saucepan. Heat another medium saucepan or lidded skillet over medium-high heat, and add the quinoa. Toast, stirring, until the grains have separated and begin to smell fragrant. Add the water or stock and salt. It should come to a boil quickly. Reduce the heat to low, cover and simmer 15 to 20 minutes, until the quinoa is tender and translucent and each grain displays a little thread. Drain and return to the pan. Cover the pan with a clean dish towel, replace the lid and allow to sit undisturbed for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the olive oil in a large, heavy skillet over medium heat, and add the onion. Cook, stirring, until tender, about five minutes, and add the garlic, corn and zucchini. Season with salt and pepper, and cook, stirring, until the zucchini is tender and translucent and the corn tender, five to eight minutes. Stir in the quinoa and toss together. Heat through, add the herbs and serve with a little crumbled queso fresco or feta sprinkled on top if desired."}]}