{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato and Collard Green Hash", "description": "Potatoes and greens are a classic, rustic combination, and a very comforting one. The greens are blanched, and then cooked with onion and garlic. After a while, cooked potatoes are added and crushed into the greens. The dish isn’t like mashed potatoes, more like a hash. Serve it as a side dish with fish or chicken, or with other vegetable dishes.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/27/health/29recipehealth_600/29recipehealth_600-articleLarge.jpg", "totalTime": "PT2H", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "dinner, one pot", "keywords": "collard greens, potato, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegan, vegetarian, fall, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 66}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 115, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "13 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "215 milligrams", "sugarContent": "1 gram", "transFatContent": null}, "recipeIngredient": ["1 large bunch collard greens, about 1 1/2 pounds, stemmed and washed in 2 changes of water", "Salt to taste", "3 tablespoons extra virgin olive oil", "1 onion, sliced very thin in half-moons", "2 to 4 garlic cloves, green shoots removed, sliced thin", "1/4 to 1/2 teaspoon crushed red pepper flakes (optional)", "3/4 pound yellow-fleshed potatoes, such as Yukon gold"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the collard greens. Blanch for four minutes, and transfer to the ice water with a slotted spoon or skimmer. Drain and squeeze out extra water. Chop coarsely. Set aside the cooking water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the oil over medium heat in a wide, lidded skillet or Dutch oven, and add the onion. Cook, stirring often, until it begins to soften, about three minutes. Add a generous pinch of salt, the garlic and crushed red pepper flakes. Continue to cook, stirring often, until the onion is tender, about five minutes. Stir in the collard greens. Mix together for a few minutes, and then add 1 cup of the cooking water and salt to taste. Bring to a simmer, cover partially, and simmer over low heat for 45 minutes to 1 hour, stirring often and adding more cooking water from time to time, so that the greens are always simmering in a small amount of liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the greens are cooking, scrub the potatoes and add to the pot with the cooking water. Bring back to a boil, lower the heat and simmer until the potatoes are tender, about 25 minutes. Remove the potatoes from the cooking water, and allow to cool slightly so that you can peel them if you wish. Cut them into large chunks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the greens, and add the potatoes. Using a fork or the back of a wooden spoon, crush the potatoes and stir into the greens. Add a tablespoon of olive oil and salt and pepper to taste, and stir over low heat until the greens and potatoes are well combined. The potatoes should not be like mashed potatoes, just crushed and intermingled with the greens, like hash. Taste, adjust seasonings and serve."}], "link": "https://cooking.nytimes.com/recipes/1012847-potato-and-collard-green-hash"}