{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberries With Brown Butter Shortcake", "description": "This recipe came to The Times from David Guas, a New Orleans chef. He substitutes a spongecake enriched with browned butter for crumbly shortcake. And instead of simply seasoning raw berries with sugar, he cooks them lightly over steaming water with orange zest, which fills the kitchen with the smell of warm, simmering fruit.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/browncake-still/browncake-still-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "8 servings", "recipeCuisine": "american", "recipeCategory": "", "keywords": "dessert, eggs, strawberries, unsalted butter, nut-free, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 107}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 436, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "3 grams", "proteinContent": "7 grams", "saturatedFatContent": "13 grams", "sodiumContent": "187 milligrams", "sugarContent": "39 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 pounds (6 cups) strawberries, hulled, quartered if large", "Zest of 1 orange", "1 1/4 cups sugar", "1 1/2 sticks plus 1 tablespoon unsalted butter", "1 cup plus 2 tablespoons all-purpose flour", "4 large eggs", "1 teaspoon baking powder", "1/4 teaspoon salt", "1/2 cup buttermilk", "Whipped cream for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour an inch of water into a large pot and simmer over medium-high heat. Stir strawberries, orange zest and 1/4 cup sugar in a large stainless steel mixing bowl, cover with plastic wrap and place on pot so bowl does not touch water. Reduce heat to low and let strawberries cook for 20 minutes. Remove bowl and refrigerate until chilled. (Strawberry sauce, which will be chunky, can be made up to one day ahead.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Place a 10-inch cake pan on parchment paper; trace and cut out a circle. Grease pan’s bottom and sides with one tablespoon butter, press parchment into pan, then flip paper over, buttered side up. Sprinkle 2 tablespoons flour on parchment and tap to coat bottom and sides of pan; discard excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt remaining butter over medium-high heat. Simmer, whisking often to incorporate any solids that sink to bottom, until butter is a golden-amber color and smells nutty, about 4 to 6 minutes. If it sputters, reduce heat. Set butter aside to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the large pot with an inch of water in it to a simmer again over medium-high heat. Whisk eggs and remaining one cup sugar together in a large heatproof bowl and place over pot of water. Again, bottom of bowl should not touch water. Reduce heat to low and whisk mixture until it has tripled in volume, 4 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer to a mixing bowl and, using a hand mixer or a stand mixer, whip on high speed until mixture is thick and pale, 2 to 3 minutes. Reduce speed of mixer to low and slowly drizzle in warm butter (adding it too quickly will cause batter to separate), using a rubber spatula to scrape browned bits into batter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift remaining 1 cup flour, baking powder and salt together. Using a whisk, gently fold one-third of dry ingredients into batter, then half the buttermilk. Repeat, ending with last third of dry mixture. Transfer batter to cake pan and bake until cake sides pull away from pan and center resists light pressure, about 20 minutes. Remove from oven and let it rest for 10 minutes before running a paring knife around edge of pan to release cake. Invert onto a rack to cool completely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Slice into wedges and serve topped with the strawberry sauce and a dollop of whipped cream."}]}