{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Corn on the Cob With Chipotle Mayonnaise", "description": "The spicy dip that I serve with grilled corn (as well as with steamed or boiled corn) is sort of like a Mexican aïoli, pungent with garlic, smoky and spicy with chipotle chiles. You can also serve it as a dip with vegetables or chips, or use it as a flavorful spread for sandwiches and panini. The recipe makes more than you’ll need for six ears of corn — if you’re having a crowd for a barbecue, you’ll have enough.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/09/health/09recipehealth/09recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Makes 1 cup of dip", "recipeCuisine": "mexican", "recipeCategory": "", "keywords": "corn, mayonnaise, plain low-fat yogurt, gluten-free, halal, healthy, kosher, low cholesterol, nut-free, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 647, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "93 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "10 grams", "proteinContent": "19 grams", "saturatedFatContent": "5 grams", "sodiumContent": "891 milligrams", "sugarContent": "34 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 to 12 ears corn", "2 large garlic cloves, cut in half, green shoots removed", "1/4 teaspoon salt", "1 large or 2 small chipotle peppers in adobo, seeded", "1 teaspoon sauce from the canned adobo chile", "1/4 cup mayonnaise, preferably Hellman’s or Best Foods", "1/2 cup thick plain low-fat yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a medium-hot grill while you prepare your corn. Remove the outer leaves of the husk, leaving two layers. Gently pull down the remaining leaves, pull off the silk and fold the husks back up, covering the corn. Cut 12 to 24 pieces of butcher’s string about six inches long, and moisten them with water. Tie the cobs at the top and midway down with the wet string. Place in a bowl or a sink full of cold water, and soak for 15 to 30 minutes while you prepare the chipotle dip."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic in a mortar and pestle with 1/4 teaspoon salt, and mash to a smooth paste. Add the chipotle, and mash together with the garlic. Stir in the chipotle sauce, mayonnaise and yogurt, and mix together well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the coals of your grill are medium-hot, remove the corn from the water and pat dry. Place on the grill, and grill until the corn is uniformly charred, turning the ears often. This could take anywhere from 10 to 20 minutes, depending on the heat. Remove from the grill and, holding onto the ears with a kitchen towel, cut away the strings and remove the leaves. Wrap the corn in a kitchen towel to keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with the chipotle dip. Place a generous spoonful on a plate, and roll the corn in it or spread it on the corn with a knife."}], "link": "https://cooking.nytimes.com/recipes/1012619-grilled-corn-on-the-cob-with-chipotle-mayonnaise"}