{"@context": "http://schema.org", "@type": "Recipe", "name": "Garlic and Thyme Roasted Chicken With Crispy Drippings Croutons", "description": "This roast chicken recipe puts all of the juices that normally collect at the bottom of the roasting pan (only to be discarded) to gloriously good use. The bird, which is stuffed with garlic, lemon and herbs, is placed on top of a pile of stale bread (all different kinds of breads work, including baguettes, country loaves and even pita) that's been drizzled with olive oil. As the chicken cooks, the juices are absorbed by the bread, resulting in arguably the most delicious jumbo-sized croutons in the history of the world.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2016/05/23/dining/thyme-roast-chicken/thyme-roast-chicken-articleLarge.jpg", "totalTime": "PT1H25M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "chicken, country bread, dairy-free, fall, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 290}, "recipeIngredient": ["Country bread, ciabatta or other sturdy bread, preferably stale, sliced at least 1/2-inch thick", "1 tablespoon extra virgin olive oil, more as needed", "2 teaspoons kosher salt, more as needed", "1/2 teaspoon freshly ground black pepper, more as needed", "1 4- to 5-pound chicken, patted dry", "1 garlic head, sliced in half horizontally, through the cloves", "1 bay leaf", "1/2 lemon", "1/2 bunch thyme sprigs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 425 degrees. Arrange oven rack so that it is in center of oven. Lay bread slices in a thick, heavy-duty metal roasting pan in one layer. (Try not to use a thin or dark colored pan, which may cause bread to burn: see note.) Drizzle liberally with olive oil and sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rub 1 teaspoon salt and 1/4 teaspoon pepper inside cavity of chicken. Stuff cavity with garlic, bay leaf, lemon and thyme. Rub outside of chicken with 1 tablespoon of olive oil and sprinkle all over with remaining salt and pepper. Place it breast side up on bread."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast chicken until it is deeply browned and juices run clear when thigh is pricked with a knife, about 1 hour 15 minutes. Let rest for 10 minutes before carving. Serve chicken with bread from pan."}], "link": "https://cooking.nytimes.com/recipes/1012437-garlic-and-thyme-roasted-chicken-with-crispy-drippings-croutons"}