{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Tofu and Peppers", "description": "This attractive stir-fry is inspired by a traditional Chinese dish called rainbow beef. The vegetarian version works well, and it’s also easier to make. If you prefer a very firm tofu, take the extra time to weight it as directed in step 1. I am happy to skip this step and use firm tofu that hasn’t been weighted.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/16/health/16recipehealth_600/16recipehealth_600-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, one pot", "keywords": "dairy-free, halal, healthy, kosher, vegan, vegetarian, main course, red bell pepper, tofu, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 621}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 200, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "1 gram", "sodiumContent": "496 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound firm tofu", "2 tablespoons soy sauce", "1 1/2 teaspoons brown sugar", "2 tablespoons vegetable, peanut or canola oil", "2 teaspoons hoisin sauce", "1 teaspoon sesame oil", "2 red bell peppers, seeded and cut in 1-inch squares", "1 green bell pepper, seeded and cut in 1-inch squares", "1 tablespoon minced fresh ginger", "2 large garlic cloves, green shoots removed, minced", "1/4 to 1/2 teaspoon dried red pepper flakes (to taste)", "2 scallions, white and green parts, cut on the diagonal into 1-inch lengths", "Cooked rice or noodles for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Optional step for firmer tofu: Blot the tofu dry, wrap in a clean kitchen towel and place a cutting board on top. Let sit for about 15 minutes. Whether weighted or not, slice the tofu about 1/2 inch thick into 1- x 2-inch dominoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together 1 tablespoon of the soy sauce, 1 teaspoon of the brown sugar and 1 tablespoon of the oil in a medium bowl. Toss with the tofu, and stir to make sure all of the pieces are coated. Let sit for five to 10 minutes while you prepare the other ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, stir together the remaining soy sauce and sugar, hoisin sauce and sesame oil. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large nonstick skillet or wok over high heat until a drop of water evaporates on contact. Add the oil, turn the heat to medium-high and add the peppers. Stir-fry for a couple of minutes, until the peppers begin to soften, and add the garlic and ginger. Stir-fry for 20 seconds, until the garlic and ginger begin to smell fragrant, and add the tofu, dried red pepper flakes and green onions. Stir-fry two minutes, give the sauce a stir and add to the pan. Cover and cook for three minutes. Remove the lid, stir the ingredients in the pan, and taste and adjust seasonings. Serve with rice or noodles."}]}