{"@context": "http://schema.org", "@type": "Recipe", "name": "White Beans With Celery", "description": "This dish is inspired by a Greek recipe from Diane Kochilas’s “The Glorious Foods of Greece” that calls for giant white beans and about three times as much olive oil. I had regular white beans in my pantry and a bunch of celery left over from a recipe that called for only a couple of stalks (which happens so often). I love the textures here. The celery retains a little crunch, which contrasts nicely with the soft beans.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/16/health/16recipehealth_600/16recipehealth_600-articleLarge.jpg", "totalTime": "PT2H20M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, lunch, soups and stews", "keywords": "celery, white beans, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 197}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 377, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "13 grams", "proteinContent": "17 grams", "saturatedFatContent": "2 grams", "sodiumContent": "602 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": [" 1/2 pound (about 1 1/8 cups) white beans, rinsed, picked over and soaked for six hours or overnight in 1 quart water", "Salt to taste", "1/4 cup extra virgin olive oil", "4 to 5 cups chopped celery, including the leaves", "4 large garlic cloves, minced", "1 8-ounce can tomato sauce, or 2 tablespoons tomato paste diluted in 1 cup water", "1/4 to 1/2 cup finely chopped parsley (to taste)", "Juice of 1 to 2 lemons, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the beans, and combine in a large saucepan with enough water to cover by 2 inches. Bring to a boil, reduce the heat to low, add salt to taste, cover and simmer until the beans are just tender, about 45 minutes to an hour. Do not let the beans boil hard or they’ll fall apart before they’re cooked through."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil over medium heat in a large skillet, and add the celery and a generous pinch of salt. Cook, stirring often, until it just begins to soften, about three minutes, and add the garlic. Stir together for a minute, until the garlic is fragrant, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Drain the beans over a bowl. Place in a large baking dish, preferably earthenware, and toss with the celery and garlic, the remaining olive oil and the tomato sauce or diluted tomato paste. Add enough of the drained broth to cover by an inch, and stir in the remaining olive oil. Cover the dish tightly with foil, and place in the oven. Bake one hour, or until the beans are soft and creamy."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Uncover the beans, stir, and add salt and pepper to taste. Add a tablespoon or 2 of lemon juice, or more if desired, and adjust salt and pepper. Serve hot, warm or room temperature, with a little more olive oil drizzled over the top if desired."}]}