{"@context": "http://schema.org", "@type": "Recipe", "name": "Pickled Asparagus", "description": "Preserving food cannot be considered new and trendy, no matter how vigorously it’s rubbed with organic rosemary sprigs. But the recent revival of attention to it fits neatly into the modern renaissance of handcrafted food, heirloom agriculture, and using food in its season. Like baking bread or making a slow-cooked tomato sauce, preserving offers primal satisfactions and practical results.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/pickledasparagus/pickledasparagus-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 or 4 pint jars", "recipeCuisine": "american", "recipeCategory": "condiments", "keywords": "asparagus, white wine vinegar, dairy-free, gluten-free, halal, kosher, vegan, vegetarian, side dish, spring, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 19}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 140, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "23 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "12 grams", "proteinContent": "13 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1634 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["About 5 pounds asparagus, thin to medium-thick", "2 1/4 cups distilled white or white wine vinegar (labeled at least 5 percent acidity)", "4 tablespoons salt", "2 garlic cloves, slivered", "1 teaspoon dill seed (optional)", "1/4 teaspoon hot pepper flakes", "1/4 teaspoon whole allspice (optional)", "1/4 teaspoon cumin seed (optional)", "1/4 teaspoon coriander seed (optional)", "Hard-boiled eggs for serving", "extra virgin olive oil for serving", "freshly ground black pepper, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut bottoms off asparagus to make them fit upright in a pint jar. Asparagus tips should be at least 1/2 inch below lid. (Reserve bottoms for another use.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour about 2 inches water into a skillet large enough to hold asparagus lying down; bring to a boil. In batches, blanch asparagus: place in skillet, bring water back to a boil, and then immediately remove and run under very cold water or dunk in ice water. Set aside to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine remaining ingredients in a saucepan with 2 1/4 cups vinegar and bring to a boil. Stir occasionally and cook just until salt dissolves; turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare 4 clean, hot pint jars and bands, and new lids. (Dip in boiling water, or run through dishwasher.) When jars are dry but still hot, pack asparagus into them, wedging spears in tightly. There should be enough for 3 or 4 full jars: do not half-fill jars."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour in vinegar solution, just to barely cover tips of asparagus. Make sure to leave 1/2 inch air space above vinegar solution. Distribute garlic slivers and spices evenly among jars. Wipe rims with a clean paper towel dipped in hot water, place lids on top and screw on bands. (Not too tight, just firmly closed.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a boiling-water bath in a deep pot with a rack. Place jars on rack and pour water over them, making sure water covers jars by 2 to 3 inches. Bring water back to a rolling boil over high heat, start a timer for 10 minutes, then reduce heat and gently boil. When timer goes off, turn off heat and wait 5 minutes before removing jars with jar lifter or tongs. Let cool on counter, untouched, 4 to 6 hours. After 12 to 24 hours, check seals: lift each jar up by the lid, and press the lid to make sure the center is sucked down tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Store in a cool, dark, dry place (not refrigerator) for 4 weeks before using, or up to 1 year. Refrigerate after opening. To serve, drain off pickling liquid and arrange asparagus on plates. Add hard-boiled egg, drizzle with oil and shower with black pepper."}], "link": "https://cooking.nytimes.com/recipes/1012559-pickled-asparagus"}