{"@context": "http://schema.org", "@type": "Recipe", "name": "Mushroom Burgers With Almonds and Spinach", "description": "These delicious vegetarian patties have a great texture because of the almonds and bulgur. Like other vegetarian patties, they can be a little tricky to turn when you brown them. If they break apart, just patch them together.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/01/14/health/14recipehealth_600/14recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "4 to 6 patties, depending on the size", "recipeCuisine": "", "recipeCategory": "dinner, weekday, burgers", "keywords": "almonds, bulgur, mushroom, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 74}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 155, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "11 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "298 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/4 cup fine bulgur", "1/2 cup roasted almonds", "2 tablespoons extra virgin olive oil", "1 pound fresh mushrooms, trimmed and quartered", "2 large garlic cloves, green shoots removed, minced", "1 teaspoon fresh thyme leaves", "Salt", "freshly ground pepper to taste", "2 tablespoons dry white wine (optional)", "1 6-ounce bag baby spinach, rinsed, or a 12-ounce bunch of spinach, stemmed and washed", "1 egg, beaten (optional)", "Whole grain buns and condiments of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bulgur in a bowl with a little salt if desired. Cover with ½ cup hot water and leave for 20 to 25 minutes, until most of the water has been absorbed and the bulgur is soft. Drain through a strainer and squeeze out the water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, in a food processor fitted with the steel blade, grind the almonds coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large, heavy skillet over medium-high heat and add the mushrooms. When they begin to soften and sweat, turn the heat to medium and cook, stirring often, for 5 minutes, until the mushrooms have softened. Add the garlic, thyme, salt, pepper and white wine, and continue to cook, stirring, until there is no more liquid in the pan, about 5 minutes. Remove from the heat, transfer to the food processor and process until very finely chopped."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the pan to the heat and add the spinach, a handful at a time. Cook just until it wilts and remove from the heat. Transfer to a strainer and, with the back of a spoon, press out excess water. Add spinach to the food processor and process with the mushrooms and almonds until the ingredients are well blended. Scrape the mixture into a bowl, stir in the bulgur and egg (if using), and season to taste with salt and pepper. Form into patties. If there is time, cover and chill for 1 to 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the remaining oil in a large, heavy skillet or on a griddle over medium heat, and brown the patties for 3 minutes on each side, being very careful when you turn them over. Don’t worry if they fall apart; just patch them together. An offset spatula works well for turning them, and when you remove the patties from the pan, it helps if you place the bottom bun over the patty, slide the spatula underneath the patty and, with your hand on the bun, flip it over. Serve with the condiments of your choice."}], "link": "https://cooking.nytimes.com/recipes/1012990-mushroom-burgers-with-almonds-and-spinach"}