{"@context": "http://schema.org", "@type": "Recipe", "name": "Creamy One-Pot Pasta With Chicken and Mushrooms", "description": "Cooking pasta the way you would make risotto may sound new and hip. But it’s at least old enough to have been demonstrated to me in Rome in 1976, and I imagine as old as pasta itself. In this method, the liquid is minimized: there’s no need for a gallon per pound of pasta. The liquid is added gradually to the pasta, which absorbs it completely and thereby retains its starch. This makes the pasta creamy and rich; it also gains the flavor of the stock. You can use pretty much any pasta shape you like, but timing will vary depending on size. This approach may seem like more work than making pasta in the ordinary way. But as the making of the “sauce” is integrated into the pasta-cooking, it really becomes a one-dish meal — as interesting as risotto, and even a bit quicker. Here is a combination of gemelli with mushrooms and chicken to get you started.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2018/12/01/dining/mb-pasta-with-chicken-and-mushrooms/merlin_147141321_b4c21206-fd33-4da0-a0d3-05faa52589f5-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, one pot, pastas", "keywords": "chicken, mushroom, pasta, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1238}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 558, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "56 grams", "cholesterolContent": null, "fatContent": "23 grams", "fiberContent": "3 grams", "proteinContent": "27 grams", "saturatedFatContent": "5 grams", "sodiumContent": "999 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons olive oil, more as needed", "1 shallot or small onion, chopped", "1 tablespoon minced garlic", "2 cups crimini, shiitake or button mushrooms, cleaned, trimmed and sliced", "1/2 pound cut pasta like gemelli or penne, or long pasta broken into bits", "Salt and freshly ground black pepper", "1/2 cup dry white wine or water", "3 to 4 cups chicken or vegetable stock", "2 boneless chicken thighs, diced", "Chopped fresh parsley, optional", "Freshly grated Parmesan, optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons olive oil in a large, deep skillet over medium heat. When hot, add shallot, garlic and mushrooms. Cook, stirring occasionally, until mushrooms soften and begin to brown on edges, about 10 minutes. Add pasta and cook, stirring occasionally, until it is glossy and coated with oil, 2 to 3 minutes. Add a little salt and pepper, then wine. Stir and let liquid bubble away."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle stock into skillet 1/2 cup or so at a time, stirring after each addition and every minute or so. When liquid is just about evaporated, add more. Mixture should be neither soupy nor dry. Keep heat at medium and stir frequently."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin tasting pasta 10 minutes after you add it; you want it to be tender but with a tiny bit of crunch. When pasta is about 3 to 4 minutes away from being done, add chicken and stir to combine. Continue to cook until chicken is done — it will be white on inside when cut — and pasta is how you like it. Taste, adjust seasoning, garnish with parsley and Parmesan if using, and serve."}], "link": "https://cooking.nytimes.com/recipes/1012898-creamy-one-pot-pasta-with-chicken-and-mushrooms"}