{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Artichokes With Lemon Zest, Rosemary and Garlic", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/Stuffed-Artichokes/Stuffed-Artichokes-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner", "keywords": "appetizer, artichoke, bread crumbs, garlic, spring, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 18}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 415, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "71 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "14 grams", "proteinContent": "18 grams", "saturatedFatContent": "2 grams", "sodiumContent": "830 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 lemons, zested, then halved", "4 large globe artichokes (about 12 ounces each before trimming)", "2 1/4 cups plain bread crumbs", "1/3 cup grated Parmesan cheese", "1/3 cup chopped fresh parsley, plus 4 whole sprigs", "1 tablespoon finely chopped fresh rosemary", "8 garlic cloves, smashed and peeled", "2 carrots, peeled", "1 1/2 tablespoons chopped capers", "1 1/2 teaspoons kosher salt", "1/2 teaspoon ground black pepper", "1 small onion, thinly sliced", "1/3 cup extra virgin olive oil, for drizzling", "1/2 cup dry white wine"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 400 degrees. Fill a large bowl with water and squeeze juice from two lemon halves into water. Cut off artichoke stems, peel them with a vegetable peeler, rub them all over with remaining lemon half (this prevents browning) and drop them into water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a heavy, sharp knife to cut top 1 1/2 inches off an artichoke. Pull out pale inner leaves from center. At the bottom, where leaves were, is a furry bed, the choke. Use a spoon (a grapefruit spoon works wonderfully) to scoop out choke. Next, using kitchen shears or a pair of scissors, trim pointy ends from outer leaves of artichoke. As you work, rub lemon half over cut parts of artichoke. When you are finished trimming, drop artichoke into bowl of lemon water. Repeat with remaining artichokes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To prepare stuffing, in a large bowl combine lemon zest, bread crumbs, Parmesan, chopped parsley and rosemary. Mince 6 garlic cloves and add to bowl. Finely chop one carrot and add to bowl along with capers, 1 teaspoon salt and 1/4 teaspoon pepper. Toss."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small roasting pan or baking pan large enough to hold artichokes, scatter onion slices. Add reserved artichoke stems, 4 sprigs parsley and remaining garlic cloves. Slice remaining carrot into rounds and add to pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Holding artichokes over stuffing bowl, stuff choke cavity and in between the leaves with bread crumb mixture. Stand stuffed artichokes upright in pan and generously drizzle olive oil over center of each artichoke."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill pan with water until it reaches 1/4 way up the artichokes. Add wine and remaining salt and pepper to water. Cover pan with foil and poke several holes in foil. Bake artichokes for about 1 1/2 hours, or until tender; when done, a knife should be easily inserted into artichoke and a leaf should be easily pulled out."}], "link": "https://cooking.nytimes.com/recipes/1012497-stuffed-artichokes-with-lemon-zest-rosemary-and-garlic"}