{"@context": "http://schema.org", "@type": "Recipe", "name": "Monterey Bay Abalone, Meunière-Style", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/06/06/dining/Monterey-Bay-Abalone/Monterey-Bay-Abalone-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4 as an appetizer, 2 as an entree", "recipeCuisine": "french", "recipeCategory": "project", "keywords": "abalone, appetizer, gluten-free", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 244, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "0 grams", "proteinContent": "7 grams", "saturatedFatContent": "11 grams", "sodiumContent": "170 milligrams", "sugarContent": "0 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["4 small abalones, 4 to 5 ounces each in shell weight (see note)", "1/2 cup flour", "6 tablespoons butter", "1 tablespoon packed, finely chopped flat-leaf parsley", "1 tablespoon Meyer lemon or lemon juice", "Fleur de sel"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The day before serving, force a large tablespoon between the abalone and its shell, sliding the spoon against the shell to dislodge the shell muscle. (The side not attached to the shell is called the foot.) Using your hands, peel off the narrow flap (a k a the mantle) near the head — the area with two black prongs — then remove the innards that surround the central, round shell muscle. If you cannot grab the mantle, slice it slightly to allow you to grip it better, trying not to pierce the innards, which are attached to the abalone at the head. Cut out the innards and the head in one small chunk and discard. Put the abalone on a plate, cover with plastic wrap and refrigerate overnight. (This step is necessary to relax the abalone and prevent it from splitting when pounded.) Repeat with the remaining abalones."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next morning, make crisscross incisions about 1?4 inch apart and 1?4 inch deep on the bottom of the round shell muscle of each abalone. Place the abalone, foot-side down, on a dish towel. Fold the other edge of the towel over the abalone to completely cover. Pound two to three times gently but firmly with the even side of a meat pounder, slightly flattening the abalone without disfiguring it. (Do not use a tenderizer or the cubed side of a meat pounder. Use only a flat surface.) Repeat with the remaining abalones. Return them to a plate, cover with plastic wrap and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss the abalones in flour, shaking off excess. Heat the butter in a large sauté pan over medium-high heat. When it foams, place the abalones in the pan, foot-side up. While gently shaking the pan, allow the butter to slowly turn to a hazelnut brown with a nutty aroma. After about 2 minutes, turn the abalones and cook for 1 minute more. Both the abalones and the butter should be golden brown. Add the parsley and lemon juice and shake the pan to coat with the juices. Place the abalones on a plate and spoon over a bit of the juices. If you choose, top with a pinch of fleur de sel."}], "link": "https://cooking.nytimes.com/recipes/1012700-monterey-bay-abalone-meuniere-style"}