{"@context": "http://schema.org", "@type": "Recipe", "name": "Stir-Fried Chicken and Eggplant With Asian Basil", "description": "This dish has Thai overtones. It was inspired by a large bunch of Asian basil that a friend brought me from his garden. You can find the herb in Asian produce markets and some farmers’ markets.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/09/15/health/15recipehealth_600/15recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves four", "recipeCuisine": "asian", "recipeCategory": "dinner, one pot", "keywords": "chicken, eggplant, dairy-free, gluten-free, halal, healthy, kosher, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 142}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 210, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "4 grams", "proteinContent": "21 grams", "saturatedFatContent": "1 gram", "sodiumContent": "541 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound eggplant, preferably long Asian eggplants, diced", "Salt to taste", "3 large garlic cloves, peeled, halved, green shoots removed", "2 serrano chiles, stemmed and minced", "1 tablespoon minced ginger", "1 tablespoon fish sauce", "2 teaspoons soy sauce", "1 teaspoon sugar", "Freshly ground black pepper to taste", "2 tablespoons peanut or vegetable oil", "3/4 pound boneless, skinless chicken breasts, rinsed and dried, cut into small dice or minced", "1 cup Asian basil leaves, roughly chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Salt the eggplant generously and leave in a colander to sweat for 15 to 30 minutes, while you prepare the remaining ingredients. Rinse and drain on a clean kitchen towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic in a mortar with 1/4 teaspoon salt and mash to a paste. Add the ginger and chiles, and continue to mash with the garlic. In another small bowl, mix together the fish sauce, soy sauce, sugar and pepper. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a large, heavy skillet or wok over high heat, until a drop of water evaporates immediately upon contact. Add 1 tablespoon oil, turn the heat down to medium-high, and add the garlic paste. Stir-fry for 30 seconds, and add the chicken. Stir-fry for three to four minutes, until the chicken is cooked through and no traces of pink remain. Transfer from the pan or wok to a plate or bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the remaining tablespoon of oil to the pan. Add the eggplant. Cook, stirring, until the eggplant is lightly browned and almost cooked through, about 10 minutes. Stir the chicken back into the pan, and add the fish and soy sauce mixture. Add 1/4 cup water, cover the wok or pan, turn the heat down to medium and steam for five minutes. Uncover, and stir in the basil leaves. Stir for 30 seconds to a minute, remove from the heat and serve with rice."}], "link": "https://cooking.nytimes.com/recipes/1012781-stir-fried-chicken-and-eggplant-with-asian-basil"}