{"@context": "http://schema.org", "@type": "Recipe", "name": "Portobello Mushroom Cheeseburgers", "description": "Large portobello mushrooms are perfect burger material, just the right size for a meaty and satisfying meal. I like them best with Gruyère cheese on top.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/01/13/health/13recipehealth_600/13recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, burgers", "keywords": "cheese, portobello, halal, healthy, high fiber, kosher, nut-free, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 116}, "recipeIngredient": ["1 tablespoon red wine vinegar or sherry vinegar", "Salt", "freshly ground pepper to taste", "1 garlic clove, green shoot removed, minced or pureed", "3 tablespoons extra virgin olive oil", "4 large portobello mushrooms, stems removed", "1 6-ounce bag baby spinach", "4 1/2-ounce slices cheddar or Gruyère cheese", "Whole grain hamburger buns and the condiments of your choice", "condiments of your choice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Whisk together the vinegar, salt, pepper, garlic and olive oil. Toss with the mushroom caps in a wide bowl. Rub the marinade over the tops of the mushroom caps and place them on a baking sheet, rounded side up. Let sit for 15 minutes. Don’t rinse the bowl, because you’ll use any oil and vinegar residue to dress the spinach."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, salt generously and blanch the spinach for 20 seconds. Transfer to a bowl of ice water, drain and squeeze dry. Chop coarsely and toss in the bowl with the residue of the marinade. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare a medium-hot grill, heat a heavy skillet over medium-high heat, or preheat an electric grill or panini pan on medium-high. Season the mushrooms as desired with salt and pepper. Place the mushrooms on the hot grill or pan, rounded side down. Cook them for about 6 to 8 minutes, depending on the thickness, until lightly browned, and moist. Turn over and cook for another 6 minutes. Turn over for a minute to reheat the top, then flip back over and place the cheese on top. Continue to cook until the cheese melts. If using a panini grill, cook 6 to 8 minutes. Open the grill and place the cheese on top. Wait for it to melt. Place a mound of spinach on the bottom half of each hamburger bun and place the mushrooms, rounded side up, on top of the spinach. Top with your choice of condiments and serve."}]}