{"@context": "http://schema.org", "@type": "Recipe", "name": "Flan With Tea", "description": "", "author": {"@type": "Person", "name": "David Leite"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, eggs, milk, tea", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 291, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "53 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": null, "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "81 milligrams", "sugarContent": "53 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups whole milk", "2 tablespoons strong-flavored tea leaves, like Lapsang souchong", "2 cups sugar", "6 large eggs, at room temperature", "1 large egg yolk, at room temperature"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 325 degrees. Fill a kettle of water to bring to a boil. In a small saucepan, combine milk and tea leaves. Place over medium-low heat and bring to a bare simmer; remove from heat and allow to steep until deeply infused, about 10 minutes. Strain into a bowl, discard solids, and allow to cool until just warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, combine 1 cup sugar and 2 tablespoons water. Place over medium heat without stirring until sugar melts and begins to take on a bit of color. Do not stir; instead, swirl pan occasionally. Continue to cook until mixture is dark maple-syrup brown and has an aroma of caramel, 10 to 15 minutes. Carefully pour into a 1 1/2-quart flan mold or metal baking dish (such as an 8-inch square baking pan), tilting pan to coat sides and bottom. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl, combine eggs, yolk and remaining 1 cup sugar. Stir until sugar is dissolved, about 3 minutes. Slowly stir in the milk mixture until blended. Pour into flan mold, and set mold in a small roasting pan. Place in oven and pour enough boiling water into roasting pan to come halfway up mold."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake flan until set around edges but slightly jiggly in middle, 45 minutes to 1 hour 15 minutes, depending on oven, and size and depth of mold. Remove from water bath and place on a work surface to cool to room temperature. Refrigerate until well chilled, about 3 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, run a sharp knife around inside edge of pan. Place a deep plate on top and flip. Remove mold, and serve."}], "link": "https://cooking.nytimes.com/recipes/1012481-flan-with-tea"}