{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Steamed Salmon With Lentils and Sun-Dried Tomatoes", "description": "Lentils and salmon are a classic combination, a popular French bistro dish. The black \"beluga\" lentils are a nice choice because they stay intact and the color contrasts nicely with the salmon. In the classic dish the lentils might be cooked with bacon or a little sausage. In this recipe, sun-dried tomatoes add a savory layer of flavor to the lentils.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT1H15M", "recipeYield": "Serves 4", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "beluga lentils, lentils, salmon, dairy-free, halal, healthy, high fiber, kosher, low-sodium, nut-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 36}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 656, "unsaturatedFatContent": "19 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "8 grams", "proteinContent": "51 grams", "saturatedFatContent": "6 grams", "sodiumContent": "639 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 medium onion, finely chopped", "2 garlic cloves, minced", "1/2 pound beluga lentils (1 1/8 cup), rinsed", "2 ounces sun-dried tomatoes", "1 bay leaf", "Salt, preferably kosher salt", "freshly ground pepper", "1 1/2 pounds salmon fillets, either in 1 piece or cut up", "Chopped fresh herbs, such as parsley, chervil, thyme for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a heavy saucepan or soup pot over medium heat and add the onion. Cook, stirring, until tender, about 5 minutes, and add 1/2 teaspoon salt and the garlic. Stir together for a minute, until fragrant, and add the lentils, sun-dried tomatoes, bay leaf, and enough water to cover by an inch. Bring to a simmer, cover and simmer 25 minutes. Add salt and pepper to taste and simmer another 5 to 10 minutes, until the lentils are tender and aromatic. Taste and adjust seasoning. Remove the bay leaf and the sun-dried tomatoes. Keep warm while you cook the salmon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the lentils are cooking, preheat the oven to 300ºF. Cover a baking sheet with foil and lightly oil the foil. Place the salmon on top. Season with salt and pepper. Fill a roasting pan with boiling water and place it on the oven floor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the salmon in the oven and bake until the fish flakes and white bubbles of protein appear on the surface, 10 to 20 minutes, depending on the size of the fillets. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a slotted spoon, spoon the lentils onto 4 dinner plates and place a serving of salmon on top. Sprinkle with herbs, and serve."}]}