{"@context": "http://schema.org", "@type": "Recipe", "name": "Hungarian Cabbage Strudel", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 servings", "recipeCuisine": "eastern european", "recipeCategory": "dinner", "keywords": "cabbage, phyllo, fall, winter, side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 594, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "49 grams", "fiberContent": "5 grams", "proteinContent": "6 grams", "saturatedFatContent": "30 grams", "sodiumContent": "559 milligrams", "sugarContent": "6 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["8 ounces (2 sticks) unsalted butter, more for greasing pan", "1 very small head cabbage or half a medium cabbage (about 1 pound), cored and shredded", "1/2 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "10 sheets phyllo dough, defrosted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Lightly butter a large baking pan and spread cabbage evenly in pan. Sprinkle with salt and pepper. Cut up 4 ounces (1 stick) butter into small pieces, and sprinkle over cabbage. Cover with foil, sealing edges. Bake until tender and golden, 45 minutes to 60 minutes, occasionally lifting foil and mixing cabbage, then resealing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove from heat, uncover and allow to cool to room temperature. (May be stored, covered and refrigerated, for up to 24 hours; use chilled.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set oven temperature to 400 degrees. In a small saucepan, melt remaining 4 ounces butter. Place a sheet of parchment paper on a work surface with the narrow end closest to you, and top with a sheet of phyllo dough. Brush lengthwise (up and down) with a little butter. Top with another sheet of phyllo, and brush again with butter. Repeat until all 10 sheets are buttered and stacked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange cabbage on top sheet, at end closest to you, in a thick layer 2 inches deep. Spread evenly to side edges. With the help of the parchment paper (and rolling as if for sushi in a bamboo roller), roll phyllo starting at the end with the cabbage. As you work, adjust parchment paper so that phyllo is rolled, enclosing cabbage, without the paper. Brush top of roll with butter, place on baking sheet and bake until golden, about 40 minutes. Serve hot or warm."}], "link": "https://cooking.nytimes.com/recipes/1012848-hungarian-cabbage-strudel"}