{"@context": "http://schema.org", "@type": "Recipe", "name": "Malaysian Stir-Fried Noodles With Shrimp", "description": "These spicy noodles are based on a classic Malaysian noodle dish, Mee Goreng, but I’ve reduced the number of ingredients. With origins in North India, the dish lends itself well to the Indian Papadini bean flour noodles, which have more protein, ounce for ounce, than steak. If you can’t find this type of noodle, use wide dried rice noodles: soak them for 20 minutes in warm water, then cook 1 minute in boiling water, drain and toss with 1 tablespoon oil as directed.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "asian", "recipeCategory": "dinner", "keywords": "cabbage, noodles, shrimp, dairy-free, halal, healthy, high fiber, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 429, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "8 grams", "proteinContent": "19 grams", "saturatedFatContent": "1 gram", "sodiumContent": "917 milligrams", "sugarContent": "10 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound turnip greens or mustard greens, cleaned, thick stems discarded", "Salt to taste", "1/2 pound cabbage, cut in 3/4-inch cubes", "1/2 pound papadini (lentil/bean pasta)", "3 tablespoons plus 1 teaspoon peanut or canola oil", "1 1/2 tablespoons soy sauce", "3/4 teaspoon salt", "1 1/2 teaspoons sugar", "1 1/2 teaspoons Asian red chile paste or sauce, such as sambal oelek", "2 large garlic cloves, minced", "1 tablespoon minced fresh ginger", "1 (14-ounce) can chopped tomatoes, drained", "1/2 pound medium shrimp, shelled, cut in half lengthwise and deveined", "6 ounces bean sprouts (about 2 generous handfuls)", "1/4 cup cilantro", "1 lime, cut in wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring 3 or 4 quarts water to a boil in a large pot, add about a tablespoon of salt and the greens. Cook 30 seconds only, and immediately transfer to a bowl of ice water, using a slotted spoon or deep-fry skimmer. Drain, squeeze out water and chop coarsely. Set aside. Bring the water back to a boil, add the cabbage, blanch 30 seconds and transfer to the ice water. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the water back to a boil and add the noodles. Cook 2 minutes, drain, shake off excess water, toss with a tablespoon of the oil, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, mix together the soy sauce, salt, sugar, and the chile paste. Stir to dissolve the sugar and salt and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok or large, heavy nonstick skillet over medium-high heat and add the remaining oil and garlic and ginger. Cook, stirring, for about 30 seconds or until the garlic and ginger are fragrant. Add the tomatoes and increase heat slightly. Stir until the tomatoes begin to break down and stick to the pan, about 3 minutes. Add the shrimp and blanched greens and cabbage and cook, stirring, until the shrimp curl and turn pink, and the cabbage is crisp-tender, 4 to 5 minutes. Add the noodles and soy sauce mixture and stir together until the noodles are heated through and coated with the sauce. Add the bean sprouts and cilantro, toss together quickly and remove from the heat. Serve, with lime wedges on the side."}], "link": "https://cooking.nytimes.com/recipes/1012642-malaysian-stir-fried-noodles-with-shrimp"}