{"@context": "http://schema.org", "@type": "Recipe", "name": "Rustic Rancho Gordo ‘Yellow Eye’ Bean Soup", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT1H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "american", "recipeCategory": "dinner, soups and stews", "keywords": "gluten-free, high fiber, vegan, vegetarian, main course, parsley, vegetables, yellow eye or yellow indian woman beans, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 88}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 198, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "455 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["3 cups yellow eye or yellow Indian woman beans, soaked 4 to 6 hours (see note)", "1 carrot, peeled", "2 ribs celery, halved", "1 onion, quartered", "1 head garlic, halved across the equator", "Stems from 1 bunch Italian parsley, tied in a cheesecloth sachet", "2 tablespoons kosher salt", "1 tablespoon freshly ground black pepper", "1/4 cup extra-virgin olive oil", "1/4 cup extra-virgin olive oil, plus more for drizzling", "3 large carrots, peeled and diced", "5 ribs celery, diced", "2 leeks, white and light green parts only, diced", "1 head garlic, cloves peeled and finely grated", "1 1/2 teaspoons red chili flakes, plus more to taste", "2 tablespoons chopped fresh rosemary", "1 cup canned whole San Marzano tomatoes, drained and chopped", "1/2 cup chopped Italian parsley", "Rustic bread, sliced", "1 clove garlic, halved"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the beans: Drain the beans and place them in a large pot. Add 3 quarts cold water, the carrot, celery, onion, garlic and parsley stem sachet. Bring to a boil, skimming off any foam that rises to the top. Reduce the heat to a gentle simmer and cook until the beans are soft and creamy, but not falling apart. (Start checking after 25 minutes; the fresher the beans, the shorter the cooking time.) Add the salt, pepper and olive oil. Discard the sachet and vegetables. Let the beans cool in the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the soup: Pour the olive oil into a large pot set over medium heat. Add the carrots, celery, leeks, garlic, chili and rosemary. Cook until the rawness of the vegetables is just gone, 3 to 4 minutes. Add the tomatoes and cook until slightly caramelized, about 3 minutes more. Add the beans and their cooking liquid, bring to a boil and simmer until the vegetables are tender, 5 to 10 minutes. Season to taste with salt and pepper. Just before serving, add the parsley. Toast the bread slices. While still hot, rub them with the garlic halves, then tear into large pieces. Ladle the soup into bowls and top each with a few toasts, then drizzle with olive oil."}]}