{"@context": "http://schema.org", "@type": "Recipe", "name": "Chinese Fried Rice With Shrimp and Peas", "description": "This is a more subdued version of fried rice than the spicier Thai fried rice. It’s a great dish to make if you have cooked rice on hand and a great vehicle for whatever vegetables may be in your refrigerator. Feel free to add other cooked vegetables, meat or seafood.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/30/health/30recipehealth_600/30recipehealth_600-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves four to six", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, quick, one pot", "keywords": "dairy-free, gluten-free, halal, healthy, nut-free, main course, side dish, rice, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 296}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "45 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "14 grams", "saturatedFatContent": "1 gram", "sodiumContent": "560 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["3 large eggs", "2 tablespoons vegetable or canola oil", "2 garlic cloves, minced", "2 teaspoons minced fresh ginger", "1/2 pound medium shrimp, peeled, deveined and cut in 3/4-inch pieces", "1 tablespoon dry sherry", "5 to 6 cups cooked and cooled basmati or long-grain rice", "1 bunch scallions, thinly sliced, white and green parts separated", "1/2 cup cooked fresh or thawed frozen peas", "2 tablespoons soy sauce", "1/4 cup chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat one of the eggs in a small bowl and salt lightly. Heat 1 teaspoon of the oil over medium-high heat in a small nonstick frying pan, and add the beaten egg. Swirl in the pan until the egg forms an even coat, like a thin pancake. When the egg is cooked through, roll up and slide onto a plate. Cut in thin strips (you can use a scissors or a knife). Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a wok or large, heavy nonstick skillet over medium-high heat until a drop of water evaporates upon contact. Add the remaining oil and swirl around the pan, then add the shrimp and cook about one minute, stirring and tossing with a spatula or wok scoop until just about cooked through and pink. Add the garlic and ginger, and stir-fry for 30 seconds. Add the sherry, and stir everything together. When the sizzling stops, pour in the remaining beaten egg. Stir-fry until scrambled, and add the rice. Cook the rice — scooping it up, then pressing it into the pan and scooping it up again — for about two minutes. Stir in white and lighter green parts of the scallions, the peas and the soy sauce. Stir together for about half a minute, and transfer to a warm serving platter. Sprinkle the egg strips, scallion greens and cilantro over the top. Serve hot."}]}