{"@context": "http://schema.org", "@type": "Recipe", "name": "Puree of Chickpea Soup", "description": "Most chickpea soups, whether savory minestrones or spicy North African stews, are rustic and hearty. This one is delicate, a puree that will have a particularly velvety texture if you take the time to strain it after you puree it.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/11/06/health/nutrition/chickpeapuree/chickpeapuree-articleLarge-v2.jpg", "totalTime": "PT8H30M", "recipeYield": "Serves four", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, lunch, one pot, soups and stews", "keywords": "chickpea, garbanzo beans, dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 50}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "38 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "7 grams", "proteinContent": "12 grams", "saturatedFatContent": "1 gram", "sodiumContent": "187 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound chickpeas (about 1 1/8 cups), washed and picked over", "2 tablespoons extra virgin olive oil", "1/2 medium size red onion, chopped", "2 to 3 large garlic cloves, green shoots removed, minced", "1 teaspoon cumin seeds, ground", "1/2 teaspoon coriander seeds, ground", "Salt to taste", "2 tablespoons freshly squeezed lemon juice, plus additional for drizzling", "Chopped fresh mint for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the chickpeas in 1 quart water for six hours or overnight. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil over medium heat in a large, heavy soup pot or Dutch oven. Add the onion. Cook, stirring, until tender, about five minutes. Stir in the garlic, spices and a generous pinch of salt. Cook, stirring, for about a minute, until the mixture is fragrant. Add the chickpeas and 6 cups water. Bring to a boil, reduce the heat and simmer one hour. Add salt to taste (about 1 teaspoon) and continue to simmer for another 30 minutes to an hour. The beans should be very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Puree the soup in a blender (in small batches, covering the top with a dish towel to avoid hot splashes) or with an immersion blender until smooth. Put through a strainer for a very smooth texture, pushing it through with the bottom of a ladle or a spatula. Return to the pot, and heat through, stirring the bottom and sides of the pot so that the puree doesn’t stick. Stir in the remaining tablespoon of olive oil and the lemon juice. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve, garnishing each bowl with a few drops of olive oil or lemon juice if desired and a sprinkle of chopped fresh mint."}], "link": "https://cooking.nytimes.com/recipes/1012859-puree-of-chickpea-soup"}