{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Goat Cheese With Garden Lettuces", "description": "There is perhaps no better salad to represent the coming of age of California cuisine than this one, which began at Chez Panisse in Berkeley, where Alice Waters was looking  for something to do with what was then a new ingredient  on the American plate: goat cheese. It’s best with little gem or other, delicate and young lettuces.", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT50M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 865, "unsaturatedFatContent": "60 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "81 grams", "fiberContent": "2 grams", "proteinContent": "16 grams", "saturatedFatContent": "17 grams", "sodiumContent": "530 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["8 ounces fresh goat cheese (1 log, 2 by 5 inches)", "1 cup extra-virgin olive oil", "3 to 4 sprigs fresh thyme, chopped", "1 small sprig rosemary, chopped", "Half of a sour baguette, preferably a day old", "1 tablespoon red-wine vinegar", "1 teaspoon sherry vinegar", "Salt", "freshly ground black pepper", "1/4 cup extra-virgin olive or walnut oil, or a combination", "1/2 pound mixed lettuces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully slice the goat cheese into 8 discs about ½-inch thick. Pour 1 cup olive oil over the discs and sprinkle with the chopped herbs. Cover and store in a cool place for several hours or up to one week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Cut the baguette in half lengthwise and put it in the oven for 20 minutes or so, until dry and lightly colored. Grate into fine crumbs on a box grater or in a food processor. If the crumbs are still soft, place them back in the oven for a few minutes until dry. The crumbs can be made in advance and stored until needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. (A toaster oven works well, too.) Remove the cheese discs from the marinade and roll them in the bread crumbs, coating them thoroughly. Place the discs on a small baking sheet and cook for about 6 minutes, until the cheese is warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Measure the vinegars into a small bowl and add a big pinch of salt. Whisk in ¼ cup oil and a little pepper. Taste for seasoning and adjust. Toss the lettuces lightly with just enough vinaigrette to coat and arrange on salad plates. With a metal spatula, carefully place 2 discs of the baked cheese on each plate."}]}