{"@context": "http://schema.org", "@type": "Recipe", "name": "Whole Rainbow Trout Baked in Foil", "description": "It’s easy to find farmed rainbow trout these days. They’re usually boned and “butterflied” — opened up, with the halves still attached. I bake them in foil packets and moisten them with the savory juice that accumulates inside as they bake.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/03/31/dining/rainbow-trout-baked-foil/rainbow-trout-baked-foil-articleLarge.jpg", "totalTime": "PT15M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low-carb, low-sodium, low sugar, nut-free, fresh herbs, lemon, rainbow trout, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 213}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 549, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "27 grams", "fiberContent": "3 grams", "proteinContent": "69 grams", "saturatedFatContent": "6 grams", "sodiumContent": "895 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["Extra virgin olive oil", "4 small rainbow trout, boned", "Salt", "freshly ground pepper", "2 lemons, one sliced, one cut in wedges", "8 fresh tarragon or dill sprigs, or 4 rosemary sprigs", "Chopped fresh tarragon, dill or parsley for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Cut four sheets of heavy duty aluminum foil or eight sheets of lighter foil into squares that are three inches longer than your fish. If using lighter foil, make four double-thick squares. Oil the dull side of the foil with olive oil, and place a trout, skin side down, on each square. Season both sides with salt and pepper, and open them out flat. Place two tarragon or dill sprigs (or one rosemary sprig) and two lemon slices down the middle of each, and fold the two sides together. Drizzle 1/2 teaspoon olive oil over each fish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Making sure that the trout are in the middle of each square, fold up the foil loosely, grabbing at the edges and crimping together tightly to make a packet. Place on a baking sheet, and bake for 10 to 15 minutes, checking one of the packets after 10 minutes. The flesh should be opaque and pull apart easily when tested with a fork."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each packet on a plate. Carefully cut across the top to open it, taking care not to let the steam from inside the packet burn you. Gently remove the fish from the packet, and pour the juices over it. Sprinkle with fresh tarragon, dill or parsley. Serve, passing the lemon wedges."}], "link": "https://cooking.nytimes.com/recipes/1012536-whole-rainbow-trout-baked-in-foil"}