{"@context": "http://schema.org", "@type": "Recipe", "name": "Brandied Peaches", "description": "This recipe appeared in an article in The Times by Jane Nickerson. Updated canning instructions were added by Eugenia Bone. You will need two pint-size wide-mouthed Ball or Kerr jars with bands and new lids, available at many hardware stores or at freundcontainer.com.", "author": {"@type": "Person", "name": "The New York Times"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Brandied-Peaches/Brandied-Peaches-articleLarge.jpg", "totalTime": "PT7H", "recipeYield": "Makes 2 pints", "recipeCuisine": "", "recipeCategory": "project", "keywords": "brandy, peach, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 60}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 389, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "91 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "3 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1 milligram", "sugarContent": "89 grams", "transFatContent": null}, "recipeIngredient": ["3 pounds ripe peaches", "3 cups sugar", "About 1/2 cup brandy"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Using the tip of a paring knife, make a shallow “X” in the bottom of each peach. Add the peaches, one at a time, to the boiling water and cook for 1 minute. Remove the peach from the water and plunge into a bowl of ice water. Repeat with the remaining peaches. Peel off the skins, then pit the fruit and quarter the flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In another large pot, combine 3 cups water and the sugar and bring to a boil. Add the peaches and simmer until just soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Have the jars, bands and new lids scalded and ready. (To scald, dip the jars and rims in boiling water. You don’t need to sterilize the jars, as you will be processing them for more than 10 minutes.) Simmer the lids in hot water to soften the rubberized flange. Gently pack the peaches into the jars."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the leftover syrup until it thickens slightly, then spoon it over the fruit, filling the jars ¾ full. Use a butter knife to release any air bubbles caught in the jars. Pour in enough brandy to fill the jars, leaving ¼ inch of headroom. Wipe the rims, cover with the lids and screw on the bands fingertip-tight. Place the jars on a rack in a big pot and cover with 2 to 3 inches of water. Cover the pot and bring to a boil over high heat, then lower the heat to medium and gently boil for 20 minutes. Remove the cover and then, after about 5 minutes, remove the jars. Allow them to cool, untouched, for 4 to 6 hours. Check the seals and store in a cool, dark place for up to a year. Refrigerate after opening."}], "link": "https://cooking.nytimes.com/recipes/1012720-brandied-peaches"}