{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek Zucchini and Herb Pie", "description": "This is a typical Greek summer pie, filled with fragrant herbs and grated zucchini. I like to make it with phyllo dough, but it’s also delicious in a yeasted olive oil crust.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/06/25/health/25recipehealth_600/25recipehealth_600-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "One 10- inch pie, serving eight to ten", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "dill, phyllo, zucchini, halal, healthy, kosher, nut-free, vegetarian, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 137}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 167, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "3 grams", "sodiumContent": "432 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 1/4 to 2 1/2 pounds zucchini, ends trimmed", "Salt to taste", "2 tablespoons extra virgin olive oil, plus additional for brushing the phyllo dough", "1 large onion, finely chopped", "2 garlic cloves, minced", "1 cup finely chopped dill", "1/2 cup chopped fresh mint, or a combination of mint and parsley", "1 cup crumbled feta", "3 eggs, beaten", "Freshly ground pepper", "12 sheets phyllo dough or 1 recipe whole wheat yeasted olive oil pie pastry"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Grate the zucchini using a food processor or a hand grater. Place in a large colander, salt generously, and let drain for 1 hour, pressing down on it occasionally to squeeze out liquid. After an hour, take up handfuls and squeeze out moisture (or wrap in a kitchen towel and twist the towel to squeeze out the moisture). Place in a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil over medium heat in a large, heavy nonstick skillet over medium heat, and add the onion. Cook, stirring, until tender, about five minutes, then add the garlic. Cook, stirring, until the garlic is fragrant, about one minute. Transfer to the bowl with the zucchini. Stir in the herbs, feta, eggs and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a 10-inch pie or cake pan. If using phyllo, line the pie dish with seven pieces of phyllo, lightly brushing each piece with oil and turning the dish after each addition so that the edges of the phyllo drape evenly over the pan. Fill with the zucchini mixture. Fold the draped edges in over the filling, lightly brushing the folded in sheets of phyllo, then layer the remaining five pieces on top, brushing each piece with olive oil. Stuff the edges into the sides of the pan. If using the olive oil pastry, divide the dough into two equal pieces. Roll out the first ball to a circle 2 inches wider than the pan. Line the pan with the pastry, and brush with olive oil. Top with the filling. Roll out the remaining dough. Place over the filling. Press the edges of the top and bottom layers of dough together, and pinch to form an attractive lip around the edge."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make a few slashes in the top crust so that steam can escape as the pie bakes. Score in a few places with the tip of a knife, and brush with olive oil. Bake 50 to 60 minutes, until the pastry is golden brown. Remove from the heat, and allow to cool 15 to 30 minutes or to room temperature. Slice in wedges and serve."}]}