{"@context": "http://schema.org", "@type": "Recipe", "name": "Pizza With Caramelized Onions, Figs, Bacon and Blue Cheese", "description": "Here is a recipe for pizza that calls to mind — at least this mind — the joys of car travel through southeastern France, where pizzas such as this are available at all the imaginary cafes in small towns near the Italian border. It certainly tastes as if it comes from that region and, if you close your eyes as you eat it, you can almost imagine yourself halfway through a drive from Aix to Turin. The time spent caramelizing the onions is more than worth it, so do it the day before you intend to make the pie. Which is when, as it happens, you should make the dough as well. And we have a <a href='http://cooking.nytimes.com/recipes/1016230'>recipe</a> for that as well — a version adapted from the team behind the magical Roberta’s Pizza in Brooklyn.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/01/10/dining/recipes-pizzabaconbluecheese/recipes-pizzabaconbluecheese-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 2", "recipeCuisine": "italian", "recipeCategory": "dinner, pizza and calzones, times classics", "keywords": "bacon, figs, gorgonzola, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 237}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1193, "unsaturatedFatContent": "32 grams", "carbohydrateContent": "131 grams", "cholesterolContent": null, "fatContent": "63 grams", "fiberContent": "14 grams", "proteinContent": "32 grams", "saturatedFatContent": "27 grams", "sodiumContent": "1671 milligrams", "sugarContent": "55 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["2 tablespoons butter", "1 large Spanish onion", "2 teaspoons fresh thyme leaves", "2 bay leaves", "Kosher salt", "4 thick slices bacon, cut into 1/4-inch thick batons", "1 ball pizza dough", "Flour, for dusting surface", "12 dried mission figs, stems trimmed, cut into quarters or small pieces", "3/4 cup crumbled Gorgonzola", "Extra-virgin olive oil, to drizzle", "Freshly cracked black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "At least 45 minutes before cooking, preheat the oven and pizza stone to 550 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt the butter in a large sauté pan over high heat. Add the onions, thyme and bay leaves. Cook for 5 minutes, stirring often, until the onions begin to wilt. Reduce the heat to medium-low and cook, stirring occasionally, until the onions have softened and turn a deep, golden brown, about 25 minutes. Season to taste with salt and pepper. Remove the bay leaves and transfer the onions to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the bacon in the pan and set over high heat. Cook, stirring occasionally, until brown and crispy. Using a slotted spoon, transfer the bacon to a small bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the <a href=\"http://www.nytimes.com/recipes/1012488/pizza-dough.html\">pizza dough</a> on a heavily floured surface and stretch and pull, using your hands or a rolling pin, into about a 14-inch round. Place on a lightly floured pizza peel or rimless baking sheet. Cover with the toppings, careful not to press on the dough and weigh it down: the caramelized onions first, then the figs and bacon, and finally the Gorgonzola, leaving roughly a 1/2 inch border. Shake the pizza peel slightly to make sure the dough is not sticking. Carefully slide the pizza directly onto the baking stone in one quick, forward-and-back motion. Cook until the crust has browned on the bottom and the top is bubbling and browning in spots, about 7 minutes. Drizzle with a little olive oil and some cracked black pepper. Serve hot. Makes 1 pizza."}]}