{"@context": "http://schema.org", "@type": "Recipe", "name": "Guinness Pie", "description": "Beef in dark, silky gravy composed of fat and reduced stout, flecked with tender vegetables, covered in pastry: This is a dish that delivers good cheer and contentment in equal measure. We built it out of advice and instruction from the British chefs Jamie Oliver (the stew) and Fergus Henderson (the pastry). Eating it — salty and rich, buttoned with sweetness — will occasion thoughts of a coming walk or a nap on the couch with the dog. You’ll want some red wine to drink. It's awesome.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2019/03/05/dining/ss-guinness-pie/merlin_150673182_afa6f84f-5993-4f0c-b53c-2ac0b44d01f6-articleLarge.jpg", "totalTime": "PT6H", "recipeYield": "6 servings", "recipeCuisine": "british", "recipeCategory": "dinner, casseroles", "keywords": "brisket, guinness stout, pastry, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 1040}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 820, "unsaturatedFatContent": "16 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "3 grams", "proteinContent": "61 grams", "saturatedFatContent": "23 grams", "sodiumContent": "1369 milligrams", "sugarContent": "4 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["4 tablespoons butter", "2 large red onions, chopped", "4 cloves garlic, minced", "2 carrots, peeled and chopped", "2 ribs celery, chopped", "10 mushrooms, trimmed and sliced", "3 pounds brisket (preferably second-cut) or stew meat, chopped into bite-size pieces", "Kosher salt", "Freshly ground black pepper", "2 tablespoons flour", "1 sprig rosemary", "About 4 cups (2 cans) Guinness or other stout", "1 cup trotter gear (<a href=\"http://cooking.nytimes.com/recipes/1012399-fergus-hendersons-trotter-gear\" target=\"_blank\">recipe here</a>) or 8 ounces freshly grated Cheddar", "1 1/2 cups all-purpose flour", "2 1/4 teaspoons baking powder", "3/4 teaspoon salt", "1/2 cup (1 stick) very cold unsalted butter, diced", "1 egg yolk, lightly beaten"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large, ovenproof pan fitted with a lid, heat 2 tablespoons of the butter over medium-low heat. Add the onions and garlic and cook, stirring frequently, until soft, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the carrots, celery, mushrooms and remaining 2 tablespoons butter and cook over medium heat, stirring frequently, until the mushrooms are dark in color and the moisture released by them has evaporated, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the beef pieces all over with salt and pepper. Add the beef, flour and rosemary to the pan and cook over high heat, stirring often, for about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add enough Guinness to just cover the beef. Cover the pan and put it in the oven for 1 1/2 hours. Remove from the oven and stir. If using trotter gear, stir it in now. Return to the oven and cook for 1 hour more. If it remains thin, set the pan over medium-low heat, remove the lid and reduce the liquid. Season to taste with salt and pepper. If using Cheddar, fold in about half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the stew is cooking, prepare the pastry: sift together the flour, baking powder and salt into a bowl. Using a pastry cutter or your hands, quickly work the butter into the dough until it is the texture of coarse meal. Add ice water, a splash at a time, until a firm dough forms. Wrap the dough in plastic and refrigerate for at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the dough between two sheets of plastic wrap and, using a rolling pin, roll to the thickness of a computer mouse pad. Pour the stew into an 8-inch-square, 2-inch-high Pyrex dish or a deep 9-inch pie pan. If using Cheddar, scatter the remaining cheese across the top. Place the dough on top of the pie and pinch it closed around the edges using the tines of a fork, then slash the center lightly with a knife. Brush with the egg yolk, place on a baking sheet and bake for 45 minutes, or until the pastry is puffy and golden."}], "link": "https://cooking.nytimes.com/recipes/1012397-guinness-pie"}