{"@context": "http://schema.org", "@type": "Recipe", "name": "Serious Potato Skins", "description": "There’s no trick to these loaded potato skins, and making them is a breeze. Pile them high with toppings and broil until they look like something you may have eaten at an Irish bar in the bad part of town during college, the game playing on a big screen above the bathroom doors. That bar was pretty good, you know.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/Potato-Skins/Potato-Skins-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, gluten-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 196}, "recipeIngredient": ["4 Idaho baking potatoes", "Extra-virgin olive oil", "8 ounces thick-cut bacon, diced", "6 ounces cheddar cheese", "1 bunch scallions", "Kosher salt", "freshly ground black pepper", "1 cup sour cream", "Hot sauce, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Rub the potatoes lightly with olive oil and bake them on a foil-lined baking sheet until their skins are crisp and a fork easily slides into their flesh, about 1 hour. Transfer the potatoes to a wire rack and let cool for 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes are cooking, assemble the toppings. Cook the bacon in a large skillet over medium heat until crisp, then transfer to a small bowl. Reserve the bacon fat. Grate the cheese into a small bowl; you should have about 2 cups. Trim and thinly slice the scallions. (Feeling frisky? Caramelize some onions. Shred some ham or grate some Gruyère.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an oven mitt or a folded kitchen towel to handle the hot potatoes, cut each into quarters lengthwise to create four wedges. Using a small spoon, scoop the flesh from each wedge, leaving 1/4 inch or more of the flesh. (Save the scooped potatoes for another use, like potato pancakes or soup.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the oven to broil. Return the wedges to the foil-lined baking sheet. Paint a bit of bacon fat on each, then top with cheese and bacon. Place under the broiler until the cheese is bubbling. Place the skins on a serving plate. Season with salt and pepper. Spoon a teaspoon or so of sour cream on each and scatter the scallions over the plate. Serve with hot sauce."}], "link": "https://cooking.nytimes.com/recipes/1012831-serious-potato-skins"}