{"@context": "http://schema.org", "@type": "Recipe", "name": "Orecchiette With Raw and Cooked Tomatoes", "description": "Here’s a great destination for the last of your summer tomatoes. The sauce is a great blend of concentrated, sweet cooked tomatoes and vibrant fresh tomatoes with garlic.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/15/health/15recipehealth_600/15recipehealth_600-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "Serves four", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, lunch, pastas", "keywords": "appetizer, main course, side dish, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low-sodium, nut-free, vegan, vegetarian, pasta, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 9}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 427, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "75 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "6 grams", "proteinContent": "13 grams", "saturatedFatContent": "1 gram", "sodiumContent": "789 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 small onion, chopped", "2 large garlic cloves, green shoots removed, minced or thinly sliced, plus 1 small clove, green shoots removed, minced or pureed", "1/4 teaspoon crushed red pepper flakes (optional; more to taste)", "2 pounds ripe tomatoes", "Pinch of sugar", "A few sprigs of fresh basil", "Salt to taste", "3/4 pound orecchiette", "Parmesan, Pecorino or ricotta salata for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Set aside 1/2 pound of the tomatoes. Quarter the remaining tomatoes, or cut into wedges if very large. Heat 1 tablespoon of the olive oil in a wide, nonstick frying pan or in a 3-quart saucepan over medium heat. Add the onion. Cook, stirring often, until the onion is tender and golden, about eight minutes. Add the two large garlic cloves. Cook, stirring, until fragrant, 30 seconds to a minute. Add the quartered tomatoes, the sugar, basil sprigs and salt, and bring to a simmer. Simmer, stirring often, until the tomatoes have cooked down and the sauce is thick. Taste and adjust seasonings. Remove the basil sprigs, and put through the medium blade of a food mill. Return to the pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, finely chop the tomatoes you set aside. Add the remaining small clove of garlic, salt to taste, 1 tablespoon extra virgin olive oil and a couple of leaves of basil, chopped or slivered. Allow to sit for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil, and salt generously. Add the pasta, and cook al dente, 10 to 12 minutes, following the cooking time suggestion on the package. If desired, stir 1/4 to 1/2 cup of the cooking water into the tomato sauce. Drain the pasta, and toss with both the warm tomato sauce and the uncooked tomato concassée. Serve with Parmesan, Pecorino or ricotta salata."}], "link": "https://cooking.nytimes.com/recipes/1012826-orecchiette-with-raw-and-cooked-tomatoes"}