{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish Tarator Sauce With Beets and Beet Greens", "description": "This pungent sauce is traditionally served with beets and their greens, but makes a wonderful accompaniment to other cooked vegetables, as well.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/01/health/01recipehealth_600/01recipehealth_600-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings (about 1 1/2 cups of sauce).", "recipeCuisine": "turkish", "recipeCategory": "dips and spreads", "keywords": "appetizer, halal, healthy, kosher, low cholesterol, vegetarian, red beets, walnut, spring, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 230, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "246 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 large or 2 small bunches beets, with their greens (see note)", "3/4 cup coarsely chopped walnuts (about 2 1/2 ounces)", "2 garlic cloves, halved, green shoots removed", "1/2 teaspoon salt (or to taste)", "2 ounces baguette (about 4 thick slices), crusts removed, soaked briefly in water and squeezed dry", "1/4 cup extra virgin olive oil", "2 tablespoons walnut oil", "1/4 cup thick plain low-fat yogurt (more to taste)", "2 tablespoons freshly squeezed lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast the beets. Preheat the oven to 425 degrees. Cut the greens off of the beets, leaving about 1/2 inch of the stems attached. Scrub the beets, and place in a baking dish or oven-proof casserole. Add about 1/4 inch water to the pot. Cover tightly with a lid or foil, and bake 35 to 45 minutes, depending on the size of the beets, until tender. Remove from the heat, and allow to cool. If not using right away, refrigerate in a covered bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While you stem and wash the greens, bring a large pot of water to a boil. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the greens. Blanch one or two minutes, just until tender. Transfer to the ice water, then drain and squeeze out the water. Chop coarsely."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the garlic and salt in a mortar and pestle, and mash to a paste. Place the walnuts in a food processor fitted with the steel blade, and process until finely ground. Add the bread and mashed garlic, and process to a paste. With the machine running, drizzle in the olive and walnut oils. Add the yogurt and lemon juice, and pulse to thin and smooth out the sauce. It should be thick, like a dip. Allow to sit for at least 30 minutes. If you want a creamier sauce, add more yogurt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beets are cool enough to handle, trim off the ends, slip off their skins, cut in half and then slice into half-moon shapes or wedges. Arrange the beets and greens on a platter. Spoon the tarator on the side or over the top, and serve."}], "link": "https://cooking.nytimes.com/recipes/1012803-turkish-tarator-sauce-with-beets-and-beet-greens"}