{"@context": "http://schema.org", "@type": "Recipe", "name": "Olive Oil Chicken Confit With Anchovy-Parmesan Dressing", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": null, "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "anchovy fillets, chicken, gluten-free, main course", "aggregateRating": null, "recipeIngredient": ["1 1/2 pounds boneless, skinless chicken cutlets", "Kosher salt to taste", "Freshly ground black pepper to taste", "3 cups extra virgin olive oil, more if needed", "4 garlic cloves, coarsely chopped", "2 shallots, thinly sliced", "3 rosemary sprigs", "1/2 bunch thyme", "1/4 teaspoon crushed red pepper flakes", "5 anchovy fillets", "3 tablespoons grated parmesan cheese", "2 tablespoons fresh lemon juice, more to taste", "Salad greens, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken well with salt and pepper. In a very large skillet or stock pot with a lid, heat oil over medium heat with half the garlic and all the shallots, rosemary, thyme and crushed red pepper flakes until oil reaches 175 degrees. There will be small bubbles on surface and around garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When oil comes up to temperature, carefully slip in the chicken cutlets, making sure they are submerged in oil (add more oil if necessary and heat until it comes up to 175 degrees). Cover skillet or pot and turn heat off."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let chicken rest for 10 minutes. Make a small cut into middle of a cutlet. If chicken is not done, turn heat back on and let temperature rise to 175 degrees. Turn heat off, cover pot and let rest for another minute or so until meat is cooked through. Drain chicken on paper towels; remove cooked garlic, shallots, herbs and red pepper flakes from oil and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare dressing by mincing anchovies and remaining garlic and mixing them together with a large pinch of salt until you get a rough paste. Put paste in bowl and whisk in the parmesan, lemon juice and another pinch of salt and pepper. Slowly drizzle in 7 tablespoons olive oil from pan. Taste and add more lemon juice or salt, or both, if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve chicken over a bed of greens drizzled with anchovy dressing."}]}