{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato and Chouriço Soup With Crunchy Kale", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2014/05/20/dining/SoupwithKale/SoupwithKale-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6 to 8", "recipeCuisine": "portuguese", "recipeCategory": "dinner, lunch, one pot, soups and stews", "keywords": "appetizer, main course, fall, winter, gluten-free, portuguese chouriço, potato, spanish chorizo", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 283, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "17 grams", "fiberContent": "4 grams", "proteinContent": "10 grams", "saturatedFatContent": "5 grams", "sodiumContent": "453 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extra-virgin olive oil, plus more for the kale and serving", "2 medium onions, diced", "2 to 3 cloves garlic, minced", "6 to 8 ounces spicy, dried Portuguese chouriço or Spanish chorizo, cut into 1/4-inch dice", "2 pounds waxy potatoes, like white or creamer, peeled and cut into chunks", "1 bay leaf", "Kosher salt", "6 ounces (about half a bunch) Tuscan kale, stems removed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Put the olive oil in a soup pot set over medium heat. Add the onions and cook, stirring, until soft, about 5 minutes. Stir in the garlic and cook for 2 more minutes, then add half the sausage, potatoes, bay leaf and 4 cups water. Bring to a boil, then reduce the heat and gently boil until the potatoes are soft, 20 to 30 minutes. Discard the bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the soup has cooled slightly, purée it with a food processor, blender or immersion blender. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stack about six kale leaves on top of one another. Starting along a long edge, roll the stack tightly, like a cigar, then cut the roll into very fine ribbons, about 1/8-inch thick. Repeat with the remaining kale. Toss the ribbons with a little olive oil and spread them on a baking sheet covered with a lightly oiled piece of parchment paper or a silicone pad. Give them some breathing room, but don’t worry if they overlap; they will be impossible to untangle in any case. Salt them lightly and roast them in the oven until they are crisp, about 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While reheating the soup, set a small sauté pan over medium heat and brown the remaining sausage. For each serving of soup, spoon some browned sausage into the bottom of the bowl, ladle in some soup, float some good olive oil on the surface and top with a tangle of crisp kale."}]}