{"@context": "http://schema.org", "@type": "Recipe", "name": "Baked Meat-Filled Empanadas (Empanadas al Horno)", "description": "To Chileans, empanadas mostly mean empanadas al horno, which are frequently baked in a wood-burning oven. The classic versions are filled with seasoned minced (not ground) meat and onions and garnished with hard-cooked egg, olives and raisins. They can be made either in the half-moon shape that they usually take throughout Latin America and the Caribbean, or in a distinctively Chilean squared-off form made by folding all but the straight side of the semicircular turnover to make a package that is often four inches across. The dough is made with lard.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/Empanadas/Empanadas-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 to 10 large empanadas", "recipeCuisine": "latin american", "recipeCategory": "", "keywords": "beef, black olives, raisins, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 119}, "recipeIngredient": ["1 1/2 tablespoons lard", "1 cup fine-chopped onion", "1/2 pound lean beef, minced", "Salt", "fresh black pepper", "1/2 teaspoon ground cumin", "1/2 teaspoon smoked paprika", "Tabasco or other hot sauce to taste", "Empanada dough (<a href=\"http://cooking.nytimes.com/recipes/1012490-empanada-dough\" target=\"_blank\">see recipe</a>)", "2 hard-cooked eggs, sliced", "12 pitted cured black olives, sliced", "30 raisins", "1 large egg, lightly beaten with 1 tablespoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Melt lard in a 10- to 12-inch skillet. Add onion and sauté on medium until it barely starts to color. Add beef. Cook until ingredients are lightly browned. Add salt and pepper to taste, cumin, paprika and hot sauce. Set aside. Heat oven to 400 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll dough as thin as possible. Cut 6-inch circles. Scraps can be re-rolled one time. Place some meat mixture on one half of each circle, leaving a 1/2-inch border around filling. Top with a slice of egg, some olive pieces and a few raisins. Brush egg on empty side of circle, fold dough over to make a half-circle and crimp edges. Traditional squared empanadas can be made by folding an inch or so of each of the pointed ends of the half-circle over to make straight sides, then folding up the rounded bottom to square off the empanada."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Arrange empanadas on a baking sheet. Squared empanadas should be placed with folded side down. Bake 10 minutes. Turn empanadas over, bake 5 minutes longer, until lightly browned on both sides. Allow to cool briefly before serving."}], "link": "https://cooking.nytimes.com/recipes/1012491-baked-meat-filled-empanadas-empanadas-al-horno"}