{"@context": "http://schema.org", "@type": "Recipe", "name": "Skordalia", "description": "This Balkan version of Skordalia is a pungent puree made with garlic, potato, walnuts and olive oil. It’s very closely related to the Turkish tarator sauce. Serve it with cooked vegetables (traditionally it’s served with beets and beet greens), with warm pita bread, or with fish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/02/12/health/nutrition/12recipeb.health.ready/12recipeb.health.ready-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "Makes about 1 1/2 cups", "recipeCuisine": "eastern european", "recipeCategory": "condiments, dips and spreads", "keywords": "appetizer, dairy-free, gluten-free, halal, healthy, kosher, low cholesterol, low sugar, vegan, vegetarian, fall, winter, garlic, potato, walnut", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 14}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 223, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "1 gram", "proteinContent": "2 grams", "saturatedFatContent": "3 grams", "sodiumContent": "162 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1/2 pound russet or Yukon gold potatoes, peeled", "Salt, preferably kosher salt", "3 to 4 garlic cloves (to taste), halved, green shoots removed", "1 cup walnuts", "1/2 cup olive oil", "3 tablespoons fresh lemon juice or 1/4 cup red wine vinegar (to taste)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the potatoes in a saucepan and cover with water. Add 1/2 teaspoon salt and bring slowly to a boil over medium heat. Cover partially, reduce the heat and simmer until the potatoes are tender all the way through when pierced with a skewer. Drain, return the potatoes to the pot, and cover tightly. Set aside for 5 minutes. Mash the potatoes through a potato ricer, a food mill, or in a standing mixer fitted with the paddle attachment. Do not use a food processor."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the garlic in a mortar and pestle with 1/4 teaspoon salt and mash to a paste. Add the nuts and pound together (you can also do this in a food processor, but do not add the potatoes to the food processor). Stir the ground nuts and garlic into the potatoes. Gradually add the olive oil, stirring all the while with a fork or a pestle. Add the lemon juice or vinegar, and salt to taste. The mixture should be like loose mashed potatoes. Taste and adjust lemon juice, vinegar, and salt. Transfer to a bowl and chill until ready to serve. If the mixture stiffens up, thin out with a little olive oil or water."}]}