{"@context": "http://schema.org", "@type": "Recipe", "name": "Ligurian Kale Pie (Torta di Verdura)", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT2H", "recipeYield": "Serves 12", "recipeCuisine": "italian", "recipeCategory": "dinner", "keywords": "halal, kosher, nut-free, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 69}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 252, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "4 grams", "sodiumContent": "188 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["3 bunches mixed dark greens (like kale, chard, dandelion greens, collards), washed, stalks trimmed by 2 inches", "1 1/2 cups all-purpose flour", "1 cup whole-wheat flour", "Salt", "1/4 cup plus 5 tablespoons olive oil", "1 bunch scallions, white and light-green parts only", "1 cup mixed fresh herbs (like thyme, parsley, marjoram)", "Salt", "2 eggs", "1 cup grated hard cheese (Parmesan or Asiago)", "1/2 cup fresh cheese (ricotta, farmer's cheese or queso fresco)", "1/2 nutmeg, grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the greens in a large pot. Add 3 cups of water, cover and set over medium heat. Bring to a boil and cook for 12 minutes, stirring occasionally, until wilted. Transfer to a colander. Once cool, wring out the greens to remove as much water as possible."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a standing mixer fitted with a dough hook, mix the flours and 2 teaspoons salt until combined. Add 1 cup cold water and 1/4 cup olive oil and mix on medium speed for 8 minutes. (You can also mix by hand: Using a wooden spoon, combine the dry ingredients in a large bowl, then stir in the wet ingredients until combined. Transfer to a floured board and knead for 10 minutes.) Divide the dough into 2 equal pieces and let rest for at least 10 minutes. (The dough can be refrigerated for up to 1 day.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Place half of the greens in a food processor and pulse until the pieces are about the size of a grain of rice. Transfer to a large mixing bowl. Repeat with the remaining greens. Process the scallions and herbs to a rough paste and mix into the greens. Stir in the egg, cheeses, 3 tablespoons olive oil and nutmeg. Season to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Line a large cookie sheet with parchment paper and set aside. Flour a flat surface and roll one of dough balls into a circle about 16 inches in diameter, 1/8- to 1/16-inch thick, and lay it on the cookie sheet. Scoop the filling onto the dough and spread it evenly to 3/4 inch from the edge. Add more flour to the surface, roll out the second ball of dough and drape it across the filling. Trim the top layer so it hangs over the filling by 1/2 inch. Pinch together the layers. (If the dough doesn't stick, moisten the edges with a little water.) Slash two vents into the top of the pie and brush with the remaining 2 tablespoons olive oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until the pie is slightly puffy in the center and the filling has set, 40 to 50 minutes. If the top crust browns too quickly, cover it with foil. Cool before eating. It will keep 3 to 4 days at room temperature. If refrigerated, warm the slices in a skillet before eating."}]}