{"@context": "http://schema.org", "@type": "Recipe", "name": "Whoopie Pies", "description": "The whoopie pie from Zingerman’s Bakehouse, in Ann Arbor, Mich., sports a chocolate glaze on its dense chocolate cake and is filled with Swiss buttercream filling.", "author": {"@type": "Person", "name": "Micheline Maynard"}, "image": "https://static01.nyt.com/images/2014/04/17/dining/whoopiepies/whoopiepies-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "6 pies", "recipeCuisine": "american", "recipeCategory": "", "keywords": "butter, buttermilk, cocoa powder, dessert, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 248}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 602, "unsaturatedFatContent": "11 grams", "carbohydrateContent": "65 grams", "cholesterolContent": null, "fatContent": "36 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "23 grams", "sodiumContent": "388 milligrams", "sugarContent": "38 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/4 pound (1 stick) butter, at room temperature", "1 cup light brown sugar", "1 large egg", "1 teaspoon vanilla extract", "1 1/4 teaspoons baking soda", "1 teaspoon sea salt", "2 cups all-purpose flour", "1/2 cup cocoa", "1 cup buttermilk", "3 large egg whites", "3/4 cup sugar", "1/2 pound butter (2 sticks), at room temperature", "3/4 teaspoon vanilla", "1/4 teaspoon sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the cakes: Preheat oven to 350 degrees. In a mixing bowl, cream together the butter and brown sugar. Add the egg and vanilla extract and beat until light and creamy. In a separate bowl, whisk together the baking soda, salt, flour and cocoa. Add dry ingredients to butter mixture in three parts, alternating with buttermilk, and combining well after each addition."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using an ice cream scoop or a spoon, scoop out 12 1/4-cup mounds of batter and place about 6 inches apart on a parchment-lined baking sheet. Bake until tops are puffed and cakes spring back when touched, 12 to 14 minutes. Remove from oven and cool completely before filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For the buttercream filling: For best results, follow directions carefully, paying attention to required temperatures. Fill bottom half of a double boiler (or a medium saucepan) with an inch or two of water, and bring to a boil over high heat. In top half of double boiler (or a metal bowl), combine egg whites and sugar. Place over simmering water and whisk just until sugar is dissolved and temperature reaches 180 degrees on an instant-read thermometer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a whisk attachment on a heavy-duty mixer, whisk egg whites and sugar on high until they double in volume and become thick and shiny. Continue to whisk until cool. Reduce speed to medium and begin to add butter about 1/2 tablespoon at a time, until all the butter is incorporated. Add vanilla and salt. If mixture looks curdled, continue to whisk until it is smooth. Increase speed to high and whisk for 1 more minute. Use immediately or place in an airtight container and chill for up to 3 days, whisking buttercream again before using."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "For assembly: Using an ice cream scoop or spoon, place 1/4 cup buttercream on flat side of each of 6 cakes, spreading it to edges. Top filled half with another cake to sandwich the buttercream. Store in an airtight container at room temperature for up to 3 days, or wrap individually and freeze for up to 3 months."}], "link": "https://cooking.nytimes.com/recipes/1012447-whoopie-pies"}