{"@context": "http://schema.org", "@type": "Recipe", "name": "Sonia’s Phyllo and Feta Torte With Dill and Nutmeg", "description": "Here is a recipe for a torte, appropriate for a springtime lunch, that looks daunting, but really is not. The only challenge is finding the right Greek feta, by which we mean something not too salty but not too mild. Think of the layering of the phyllo sheets as a meditative exercise, clearing the clutter of the week and preparing you for something delicious. Gild it with Greek honey for a welcome touch of sweetness.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/fetatorte-still/fetatorte-still-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "10 to 12 servings", "recipeCuisine": "mediterranean", "recipeCategory": "dinner", "keywords": "fall, main course, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 501, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "38 grams", "fiberContent": "1 gram", "proteinContent": "17 grams", "saturatedFatContent": "23 grams", "sodiumContent": "794 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1 pound Greek feta cheese, crumbled", "3 cups cottage cheese", "3 large eggs", "1/3 cup chopped fresh dill", "1/4 cup grated Romano cheese", "1/2 teaspoon freshly grated nutmeg", "1/2 teaspoon freshly ground black pepper", "1 1-pound box phyllo dough, thawed overnight in refrigerator if necessary", "1 1/2 cups (3 sticks) unsalted butter, melted", "Greek honey, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 375 degrees. In a food processor, combine feta, cottage cheese, eggs, dill, 2 tablespoons Romano, the nutmeg and pepper and pulse just to combine (you can also use a large bowl and a fork). Mixture should be well combined, but still chunky, not smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle remaining 2 tablespoons Romano into a Bundt pan. Drape a sheet of phyllo on top of Bundt pan, poke a hole into phyllo where center tube is and push phyllo into pan to line it. Do this with another phyllo sheet, but place it perpendicular to first sheet. Continue adding phyllo sheets in this crisscross manner until all sheets are used. Edges of phyllo should hang over edges of pan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape cheese filling into pan, and fold edges of phyllo over filling. Using a sharp knife, poke many holes (at least 20) in dough that reach all the way to bottom of pan. Slowly pour melted butter over torte; some butter will seep through holes and some will remain on top of dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place Bundt pan on a baking sheet and bake for about 1 hour 15 minutes, or until torte is puffy and golden brown. Allow torte to cool in pan for 1 to 2 hours before inverting onto a plate and slicing. Serve warm or at room temperature, with honey if desired."}], "link": "https://cooking.nytimes.com/recipes/1012409-sonias-phyllo-and-feta-torte-with-dill-and-nutmeg"}