{"@context": "http://schema.org", "@type": "Recipe", "name": "Campari Jelly", "description": "Shimmering, brightly colored gelatin is the chosen medium of Sam Bompas and Harry Parr, who have built painstakingly correct models of London’s St. Paul’s Cathedral and Millennium Bridge, and a Madrid airport terminal complete with tiny airplane out of the stuff. The Campari jelly used here was part of the duo’s first job in the United States, a dessert for a dinner in New York in 2009. This jelly was an outer layer, molded over a jelly  made with orange juice, and the result was something like a Campari and soda, but in jelly form.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "quick", "keywords": "campari, sugar, unflavored gelatin, dairy-free, nut-free, dessert", "aggregateRating": null, "recipeIngredient": ["1/2 cup sugar", "1/2 cup Campari, at room temperature", "1 packet unflavored gelatin", "3/4 cup sparkling water", "1 teaspoon silver mini dragées, optional", "Orange jellies (<a href=\"http://cooking.nytimes.com/recipes/1012476-orange-jelly\">see recipe</a>)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make simple syrup: Place sugar in a saucepan, add 2/3 cup water, bring to a simmer and cook just until sugar dissolves. Allow to cool to room temperature."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, mix Campari and simple syrup. Place gelatin in a small metal bowl or 1-cup metal measuring cup and pour 1/4 cup Campari mixture over it to soften it. When gelatin is soft, place bowl or cup in a shallow pan with simmering water below rim of bowl or cup. Simmer until gelatin mixture liquefies. Slowly whisk liquid gelatin into rest of Campari mixture. Stir in sparkling water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using candies, divide them among 4 4-ounce or 6 3-ounce metal or silicon molds. Strain Campari mixture into molds. Refrigerate until firm, at least 4 hours. Unmold onto dessert plates by first dipping molds in hot water for count of 20. Return plates to refrigerator for at least 1 hour before serving. Serve with orange jellies."}], "link": "https://cooking.nytimes.com/recipes/1012475-campari-jelly"}