{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Tunisian Carrot Frittata", "description": "Tunisian frittatas are sometimes baked in an earthenware dish in the oven, sometimes on top of the stove. This one, adapted from a recipe by Clifford Wright, is made like an Italian frittata, but the spices are unmistakably Tunisian.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/01/20/health/nutrition/20recipe.health.ready/20recipe.health.ready-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves 6", "recipeCuisine": "african", "recipeCategory": "dinner", "keywords": "carrot, eggs, dairy-free, gluten-free, halal, healthy, kosher, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 157, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "3 grams", "proteinContent": "10 grams", "saturatedFatContent": "2 grams", "sodiumContent": "361 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound carrots, peeled and sliced", "1 tablespoon caraway seeds, ground", "1 to 2 tablespoon harissa, to taste (see note)", "4 large garlic cloves, minced", "1 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "1/4 cup finely chopped flat leaf parsley", "8 large eggs", "1 tablespoon extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Either boil the carrots in salted water, or steam until thoroughly tender, about 15 minutes. Drain and mash with a fork, or puree in a food processor fitted with the steel blade. Add the caraway, harissa, and garlic, and blend together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl. Beat in the salt and pepper, and add the carrot mixture and the parsley. Mix together well. Heat the olive oil over medium-high heat in a heavy 10-inch nonstick skillet. Hold your hand above it; it should feel hot. Drop a bit of egg into the pan and if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Swirl the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the omelet with a spatula, to let the eggs run underneath during the first few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pan, turn the heat down to low and cook 15 minutes, shaking the pan gently every once in a while, until the frittata is almost set. From time to time remove the lid and loosen the bottom of the omelet with a spatula, tilting the pan, so that the bottom doesn’t burn. Meanwhile, preheat the broiler."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Finish under the broiler for 1 to 3 minutes, watching very carefully to make sure the top doesn’t burn (it should brown slightly, and it will puff under the broiler). Remove from the heat, shake the pan to make sure the frittata isn’t sticking, and allow to cool for at least 5 minutes and up to 15. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Serve warm or room temperature."}], "link": "https://cooking.nytimes.com/recipes/1012649-spicy-tunisian-carrot-frittata"}