{"@context": "http://schema.org", "@type": "Recipe", "name": "Mexican Chocolate Tofu Pudding", "description": "Tofu is not solely the stuff of stir-fries. For example, I can almost guarantee you will be impressed by this dessert, a pudding that takes about as much time to make as hot chocolate. But there are a few qualifiers. Without chocolate, the flavor is unimpressive; it tastes like sweetened tofu. Add chocolate and a few Mexican spices, however, and you have a real winner. And certainly no one I've fed it to had any inkling that it was dairy free. The texture of the pudding, which must be made with silken tofu, is almost unbelievably good. The brand of chocolate you buy is of utmost importance. Without mentioning names, let me just suggest that you use the highest quality chocolate — semisweet or bittersweet, please — you can lay your hands on. After all, it's the flavor of the chocolate, not of the tofu, that will dominate.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/09/dining/Mexican-Chocolate-Tofu-Pudding/Mexican-Chocolate-Tofu-Pudding-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "chocolate, tofu, dairy-free, gluten-free, nut-free, vegetarian, dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 644}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 335, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "51 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "7 grams", "sodiumContent": "20 milligrams", "sugarContent": "46 grams", "transFatContent": null}, "recipeIngredient": ["3/4 cup sugar", "1 pound silken tofu", "8 ounces high-quality bittersweet or semisweet chocolate, melted", "1 teaspoon vanilla extract", "1 1/2 teaspoons ground cinnamon", "1/2 teaspoon chili powder, or more to taste", "Chocolate shavings (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small pot, combine sugar with 3/4 cup water; bring to a boil and cook until sugar is dissolved, stirring occasionally. Cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put all ingredients except for chocolate shavings in a blender and purée until completely smooth, stopping machine to scrape down its sides if necessary. Divide among 4 to 6 ramekins and chill for at least 30 minutes. If you like, garnish with chocolate shavings before serving."}]}