{"@context": "http://schema.org", "@type": "Recipe", "name": "Polenta With Zucchini and Tomatoes", "description": "Though I think of this Greek-inspired ragout as a summer topping, zucchini is available year-‘round in the supermarket, so you can make this dish through next winter.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/06/11/health/11recipehealth_600/11recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves four to six", "recipeCuisine": "greek", "recipeCategory": "dinner", "keywords": "gluten-free, halal, healthy, high fiber, kosher, low cholesterol, nut-free, vegetarian, main course, polenta, tomato, zucchini, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 82}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 77, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "448 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 recipe Easy Oven-Baked Polenta, with Parmesan if desired", "1 tablespoon extra virgin olive oil", "1 small onion, chopped", "2 large garlic cloves, minced", "1 1/4 to 1 1/2 pounds zucchini, cut in half lengthwise if thick, and sliced about 1/4 inch thick", "Salt, preferably kosher salt, to taste", "1 pound tomatoes, peeled, seeded and chopped, or 1 (14-ounce) can, chopped (see note)", "Pinch of sugar", "1 tablespoon chopped fresh parsley", "1 tablespoon chopped fresh mint", "Freshly ground black pepper", "Freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin making the polenta. While it’s in the oven, cook the squash. Heat the oil over medium heat in a large, heavy nonstick skillet, and add the onion. Cook, stirring often, until just about tender, about five minutes. Add the garlic and cook, stirring, for a minute or two, until fragrant. Stir in the squash and 1/2 teaspoon salt, and toss together for five to eight minutes, until it is coated with oil and beginning to soften. Add the tomatoes and their juice, the sugar and salt to taste. Turn the heat to medium-high. Cook, stirring often, for five to 10 minutes, until the tomatoes have cooked down slightly. Turn the heat back down to medium and cook, uncovered, for 20 minutes, until the vegetables are soft and aromatic. If they begin to dry and stick to the pan before the end of the cooking time (if you’re using fresh tomatoes, this may happen because there isn’t as much juice as with canned tomatoes), add up to 1/4 cup water. Stir in the parsley and mint, and simmer for a few more minutes. Remove from the heat, taste, adjust the salt and add pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the polenta is ready, remove from the oven. If adding Parmesan, stir it in. Spoon onto plates, and make a depression in the center. Top with the zucchini. Garnish with additional Parmesan, and serve."}]}