{"@context": "http://schema.org", "@type": "Recipe", "name": "Sautéed Salmon With Brown Butter Cucumbers", "description": "A gorgeous salmon fillet needs little more than a sprinkling of salt and pepper and a few minutes of gentle sautéeing in melted butter. You could stop there and serve the fish with salad and a crusty piece of bread. Or you could go one quick step further and add minced garlic, chopped cucumber and dill to the pan. The cucumber turns nutty in the pan’s brown butter, with a tender exterior that remains crunchy in the middle — a nice contrast to the silky salmon. Wild salmon, which is costlier than farmed fish, is worth the price for its sweet, smooth texture and brilliant color. Be sure not to overcook the fillets, which should be soft and barely opaque. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/02/20/dining/recipes-salmonwithbrownbuttercukes/recipes-salmonwithbrownbuttercukes-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "cucumber, salmon, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 484}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 443, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "2 grams", "proteinContent": "45 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1217 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons unsalted butter", "2 thick, wild salmon fillets (6 to 8 ounces each)", "Kosher salt or freshly ground black pepper", "2 Kirby cucumbers, peeled and diced into 1/4-inch cubes", "2 garlic cloves, minced", "2 tablespoons chopped fresh dill or cilantro", "1 to 2 teaspoons fresh lemon juice, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large skillet, melt butter over medium high heat and cook until foam subsides and turns deep gold in color, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season salmon with salt and pepper and add to pan, skin side up. Cook without turning for 3 minutes. Add cucumbers and a pinch of salt to pan around salmon and stir to coat with butter. Continue to cook, stirring cucumbers around in pan, until fish turns deep brown, about 3 minutes longer. Flip fish (move cucumbers to the side to assure fish skin makes contact with pan). Add garlic to cucumbers and stir. Cook fish until done to taste, 2 to 4 minutes longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer salmon to plates. Stir dill and lemon juice into cucumbers in pan and cook for 20 seconds longer. Taste and add more salt, pepper and lemon juice if necessary. Serve cucumbers and butter sauce over fish."}]}