{"@context": "http://schema.org", "@type": "Recipe", "name": "Morning Couscous With Oranges and Dates", "description": "This is a delicious way to enjoy couscous. You can reconstitute the couscous the night before and keep it in the refrigerator overnight. All it will need in the morning is a steam in the microwave and the addition of the oranges.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/12/07/health/1recipehealth_600/1recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, easy, one pot", "keywords": "couscous, dates, orange, dairy-free, halal, healthy, high fiber, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegan, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 34}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 231, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "55 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "8 milligrams", "sugarContent": "28 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 cups water", "2 to 3 tablespoons brown sugar or honey (to taste)", "1 teaspoon orange flower water (optional; available at Middle Eastern markets)", "3 tablespoons chopped dried apricots", "2 tablespoons currants or raisins", "1 tablespoon unsalted butter (optional)", "1 cup couscous", "1/4 to 1/2 teaspoon cinnamon, to taste", "1/4 teaspoon salt (optional)", "2 navel oranges", "6 dates, pitted and cut in quarters lengthwise", "Pomegranate seeds for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the water and brown sugar or honey in a saucepan, and bring to a boil. Turn the heat to medium, and boil gently until the sugar has dissolved. Stir in the optional orange flower water, the chopped apricots and the raisins or currants, and set aside for five minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the couscous in a 2-quart bowl, and add the cinnamon and salt. Stir together. Pour on the hot syrup. Mix together with a fork, spatula or wooden spoon, and set aside for 20 minutes, stirring occasionally. At this point, if not eating right away, cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shortly before serving, steam the couscous in one of two ways. Line a strainer with a double layer of cheesecloth, and dump the couscous into the strainer. Then set above a pot with 1 inch of boiling water. Cover and steam for 15 minutes, making sure that the water is well below the couscous. Transfer to a bowl, add the butter, and toss together until the butter melts. Alternatively, place the couscous in a microwave and cover tightly with plastic wrap. Microwave for two minutes. Carefully uncover, stir in the butter and cover again. Microwave for another two minutes. Remove the plastic, being careful of the steam in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "With a paring knife, peel away the skin and pith from the orange, holding it over the couscous so that any juice drips onto the couscous. Still holding the orange over the couscous, cut out the sections from between the membranes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pile the couscous into a mound on a platter, or spoon into individual serving bowls. Decorate with orange sections, date slices and pomegranate seeds, and serve."}], "link": "https://cooking.nytimes.com/recipes/1012919-morning-couscous-with-oranges-and-dates"}