{"@context": "http://schema.org", "@type": "Recipe", "name": "Manchurian Cauliflower", "description": "Here is the Manchurian cauliflower that Suvir Saran and Hemant Mathur, the co-owners and chefs at Devi — perhaps Manhattan’s finest Indian restaurant — serve. It is, Saran has said, a staple of the Chinatown in Calcutta, where the fried florets, coated in a mysterious and spicy red sauce, are sold punctured by toothpicks: piquant lollipops, divine street food.\n\nThe mystery ingredient is ketchup, a fact discovered and first promulgated by my colleague Mark Bittman on a television program I caught early one morning in a hotel room. Caramelized in a wide pan and made fiery with a touch of cayenne, the ketchup cloaks the fried cauliflower in a blanket of deep, pungent flavor.\n\nDo not recoil at the process of deep-frying the florets. A heavy pot with sides of four inches or so will almost completely eliminate spatters and mess, and a full head of cauliflower can be fried in as little as two batches.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/04/dining/Manchurian-Cauliflower/Manchurian-Cauliflower-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "asian, chinese", "recipeCategory": "quick, one pot", "keywords": "side dish, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 103}, "recipeIngredient": ["About 2 quarts corn or canola oil, for frying", "3 eggs", "2/3 cup cornstarch", "Kosher salt", "freshly ground black pepper", "1 large or 2 small heads cauliflower, trimmed and cut into florets", "2 cloves garlic, peeled and minced", "1 cup ketchup", "Cayenne pepper, to taste", "Cooked white rice, for serving (optional)", "Steamed greens, for serving (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put at least 2 inches of oil into a deep-sided, heavy-bottomed pot and bring to 350 degrees on a candy thermometer. (In a bind, put a pinch of flour into the pot; at 350 it will sizzle but won’t burn.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl large enough to accommodate the cauliflower, whisk together the eggs and cornstarch. Season with a large pinch of salt and pepper and add the cauliflower. Toss to coat the florets evenly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fry the cauliflower in batches, so as not to crowd the pan, making sure that the oil is hot each time you add fresh florets. Cook until the cauliflower begins to mottle, about 4 minutes, then transfer to paper towels to drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Now take a tablespoon of the hot oil from the frying pot and place it in a large pan over medium heat, swirling to coat the pan. Add the garlic and fry until fragrant, then add the ketchup, stirring occasionally, until it begins to bubble and caramelize around the edges. Add cayenne pinch by pinch to taste and then the cauliflower. Toss until hot and coated. Serve with white rice and steamed greens, if desired."}], "link": "https://cooking.nytimes.com/recipes/1012937-manchurian-cauliflower"}