{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttery Spiced Sous-Vide Apples", "description": "", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT2H", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "", "keywords": "apple, dessert, fall, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 22}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 228, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "6 grams", "proteinContent": "1 gram", "saturatedFatContent": "7 grams", "sodiumContent": "198 milligrams", "sugarContent": "25 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 lemon, yellow zest grated", "6 small or 4 large apples, peeled and cored", "6 tablespoons unsalted butter, softened", "1/2 teaspoon salt", "1/2 teaspoon ground cinnamon, or any combination of cinnamon, ground ginger and ground cardamom", "1/4 teaspoon ground nutmeg", "1 heaping teaspoon dark brown sugar", "1 heaping tablespoon dark or golden raisins, or a combination", "Dollops of crème fraîche, whipped cream or ice cream (such as vanilla or dulce de leche) for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill sous-vide cooker with hot water and heat to 170 degrees. Place lemon zest in a bowl. In another bowl, place apples. If using large apples, cut in half. Cut lemon and squeeze juice over apples, turning to coat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To bowl with lemon zest, add butter, salt, spices, sugar and raisins; mix together. Divide mixture among apples, packing it into hollowed core. If using apple halves, rub mixture all over them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place two apples in a sealable plastic bag, and seal it after removing as much air as possible; try squeezing most of it out and then carefully sucking out the rest with a straw as you seal the bag. Or, seal apples in plastic with a FoodSaver or similar vacuum device. Repeat with remaining apples. (For sous-vide cooking at home, a complete vacuum seal is not necessary if food will be served immediately after cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place plastic bags in sous-vide chamber, making sure they are submerged in hot water. Cook at least 2 hours. Food may remain in cooker for up to 2 additional hours; it will not cook any further. When opening bags, be careful as juices will be hot. Serve apples in bowls, topped with crème fraîche, whipped cream or ice cream."}], "link": "https://cooking.nytimes.com/recipes/1012930-buttery-spiced-sous-vide-apples"}