{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweetbreads With Mushrooms and Cherries", "description": "Hearth Restaurant recently held a dinner featuring modestly priced Burgundy wines. Among the dishes paired with them were sautéed sweetbreads served on scrambled eggs seasoned with black truffles.Sweetbreads are a superb choice with red Burgundies. I wanted to pick up the cherry flavors that showed up in the Côte Chalonnaise wines we tasted, so I skipped the eggs and instead added dried cherries.There is a certain amount of preliminary preparation — soaking, peeling and poaching — required before sweetbreads are ready to cook. Some recipes also call for pressing them, but I think that just makes them dry, which they certainly are not in this pinot noir-friendly dish.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/03/28/dining/sweetbreads-still/sweetbreads-still-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 first-course, 3 main-dish servings", "recipeCuisine": "", "recipeCategory": "dinner, quick", "keywords": "cherries, mushroom, sweetbreads, fall, winter, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 598, "unsaturatedFatContent": "21 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "2 grams", "proteinContent": "24 grams", "saturatedFatContent": "16 grams", "sodiumContent": "799 milligrams", "sugarContent": "16 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/3 pounds sweetbreads", "Salt", "1 lemon", "1/2 cup dried cherries", "1/3 cup dry red wine", "3 tablespoons flour", "Freshly ground black pepper", "2 tablespoons unsalted butter", "1 1/2 ounces pancetta, in one slice, diced", "1/2 cup finely chopped onion", "24 very small cremini mushrooms, stems removed", "2/3 cup chicken stock", "1 tablespoon minced tarragon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Rinse sweetbreads under cold running water. Dissolve 1 tablespoon salt in 2 cups cold water in a 2-quart bowl. Add juice of 1/2 lemon. Add sweetbreads; water should cover them. Soak 1 to 2 hours. Place cherries in a dish, add wine and set aside at least 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove sweetbreads from water and use a sharp knife to peel off translucent membrane and remove any bits of fat. If sweetbreads separate into sections, that is fine. Place sweetbreads in a saucepan, cover with cold water, add almost all remaining lemon juice, bring to a slow simmer and poach 15 minutes. Allow to cool in liquid, then refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove sweetbreads from liquid. Separate into 1- to 2-inch nuggets. Pat dry. Season flour with salt and pepper and dust sweetbreads. Melt butter in a 12-inch skillet or sauté pan with a cover. Very lightly brown sweetbreads. Remove to a dish. Add pancetta and onion to skillet. Sauté on medium-low until starting to color. Add mushrooms and sauté until softened. Add cherries with wine, and stock. Stir to deglaze pan. Bring to a simmer, add sweetbreads, baste with sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover and simmer gently 10 minutes. Season sauce with remaining juice of lemon and salt and pepper. Baste sweetbreads again, add tarragon and serve."}]}