{"@context": "http://schema.org", "@type": "Recipe", "name": "Green Pipian", "description": "This classic Mexican pumpkin seed sauce, also known as green mole, is tangy, herbal and spicy all at the same time. Serve it with poached or pan-cooked chicken breasts, fish (it’s very pretty with salmon), or shrimp. You can bathe grilled vegetables with it, or serve it with white beans and steamed or poached vegetables. Hulled untoasted pumpkin seeds are available in many whole foods stores and Mexican markets.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT40M", "recipeYield": "Makes about 1 3/4 cups", "recipeCuisine": "mexican", "recipeCategory": "dips and spreads, one pot", "keywords": "dairy-free, gluten-free, halal, healthy, kosher, low-carb, low cholesterol, low-sodium, low sugar, nut-free, pepitas, pumpkin seeds, tomatillo", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 17}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 176, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "2 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "416 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 cup hulled untoasted pumpkin seeds", "1/2 pound tomatillos, husked, rinsed, and coarsely chopped, or 2 13-ounce cans, drained", "1 serrano chile or 1/2 jalapeño (more to taste), stemmed and roughly chopped", "3 romaine lettuce leaves, torn into pieces", "1/4 small white onion, coarsely chopped, soaked for 5 minutes in cold water, drained and rinsed", "2 garlic cloves, halved, green shoots removed", "1/4 cup loosely packed chopped cilantro", "1 1/2 cups chicken stock", "1 tablespoon canola or extra virgin olive oil", "Salt, preferably kosher salt, to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a heavy Dutch oven or saucepan over medium heat and add the pumpkin seeds. Wait until you hear one pop, then stir constantly until they have puffed and popped, and smell toasty. They should not get any darker than golden or they will taste bitter. Transfer to a bowl and allow to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the cooled pumpkin seeds in a blender and add the tomatillos, chiles, lettuce, onion, garlic, cilantro, and 1/2 cup of the chicken stock. Cover the blender and blend the mixture until smooth, stopping the blender to stir if necessary."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in the Dutch oven or heavy saucepan over medium-high heat. Drizzle in a bit of the pumpkin seed mixture and if it sizzles, add the rest. Cook, stirring, until the mixture darkens and thickens, 8 to 10 minutes. It will splutter, so be careful. Hold the lid of the pot above the pot to shield you and your stove from the splutters. Add the remaining chicken stock, bring to a simmer, reduce the heat to medium-low and simmer uncovered, stirring often, until the sauce is thick and creamy, 15 to 20 minutes. Season to taste with salt. For a silkier sauce, blend again in batches."}]}