{"@context": "http://schema.org", "@type": "Recipe", "name": "Collard Greens With Farro", "description": "Farro with anything is comfort food, and the combination of farro and collard greens is particularly hearty and nutritious. The time required to cook the farro will depend on how long it has been sitting on your shelf. When it’s less than a year old, farro softens nicely. The older it is, the longer it will need to cook.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/10/27/health/28recipehealth_600/28recipehealth_600-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "dinner, lunch, one pot", "keywords": "collard greens, farro, fall, winter, halal, healthy, high fiber, low cholesterol, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 72}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 361, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "50 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "9 grams", "proteinContent": "18 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1195 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 large bunch collard greens (about 1 1/2 pounds), stemmed, leaves washed", "Salt to taste", "2 tablespoons extra virgin olive oil", "1/2 medium onion, chopped", "2 large garlic cloves, minced", "1 teaspoon chopped fresh rosemary", "1 1/2 cups farro", "1/2 cup dry white wine", "2 quarts chicken stock, vegetable stock, or water, or 1 quart each", "1/4 cup finely chopped flat-leaf parsley", "Crumbled feta for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the collard greens. Blanch for four minutes, and transfer to the ice water with a slotted spoon or skimmer. Drain and squeeze out extra water. Cut the greens into ribbons about _-inch wide."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy saucepan or Dutch oven, and add the onion. Cook, stirring, until tender, about five minutes. Add a generous pinch of salt, the garlic and the rosemary, and continue to cook for another minute, until the garlic is fragrant. Stir in the farro, and mix for a couple of minutes. Add the white wine, and stir until it has reduced by half. Add the stock and/or water and salt, and bring to a boil. Reduce the heat, stir in the collard greens, cover and simmer 45 minutes, or until the farro is tender. Drain any water remaining, and return the mixture to the pan. Taste and adjust seasonings. Sprinkle a little feta over each serving if desired."}]}