{"@context": "http://schema.org", "@type": "Recipe", "name": "Bibimbap", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "korean", "recipeCategory": "dinner", "keywords": "dairy-free, gluten-free, halal, vegan, vegetarian, main course, rice, shiitake, vegetables", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 24}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 271, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "46 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "6 grams", "saturatedFatContent": "1 gram", "sodiumContent": "460 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup short-grain rice, rinsed well and drained", "1 medium zucchini, julienned, in 2-inch lengths", "Salt", "4 1/2 teaspoons dark sesame oil", "1/2 teaspoon minced garlic", "1/2 teaspoon sugar, plus a pinch", "1 teaspoon toasted sesame seeds, plus a pinch", "1 cup thinly sliced shiitake caps", "1/2 teaspoon soy sauce", "1 cup bean sprouts", "1 cup packed spinach leaves", "1 cup peeled and julienned daikon radish, in 2-inch lengths", "1 teaspoon dried hot chili flakes", "1 teaspoon vegetable oil", "1/4 cup peeled and julienned carrot, in 2-inch lengths", "1 tablespoon Korean red chili sauce (gochujang) or other hot chili sauce, more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place rice in a medium saucepan and add 2 cups water. Place over high heat to bring to a boil, then reduce heat to low. Cover and cook until water is absorbed, about 25 minutes. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While rice cooks, place another medium pot of water over high heat to bring to a boil. Place zucchini in a colander and sprinkle with 1 teaspoon salt; set aside to drain for 10 minutes. Rinse and pat dry with paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a medium skillet over medium heat, and add 1 teaspoon sesame oil and 1/4 teaspoon garlic. Add zucchini, a pinch of sugar and 1/2 teaspoon sesame seeds. Sauté 2 minutes, then transfer to a plate; set aside. Wipe out pan and return to medium heat. Add 1 teaspoon sesame oil and remaining 1/4 teaspoon garlic. Add shiitakes, pinch of salt and soy sauce. Sauté 2 minutes, then transfer to a plate; set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place bean sprouts in the boiling water until wilted, about 20 seconds. Using a slotted spoon, transfer to the colander to drain. Place sprouts in a bowl, and add 1/2 teaspoon sesame oil, pinch of salt and pinch of sesame seeds; set aside. Add spinach to the pot of boiling water and blanch until it wilts and turns bright green, about 30 seconds. Drain into the colander, rinse well with cold water until chilled, then drain, squeezing out excess water. Transfer to a bowl and add 1/4 teaspoon salt, 1/2 teaspoon sesame oil and 1/2 teaspoon sesame seeds. Mix well and set aside. Place daikon in a bowl, and add hot chili flakes, 1/2 teaspoon sugar, 1/2 teaspoon sesame oil and a pinch of salt. Mix well and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 9-inch well-seasoned cast-iron or nonstick skillet over medium heat. Add 1 teaspoon vegetable oil. Add 1 cup cooked rice and flatten it to form a pancake covering bottom of pan, about 1/3-inch thick. Cook until it is crisp and golden on underside, about 5 minutes. Use a large spatula to flip it over, and cook again until crisp, another 5 minutes. Break crusty rice into several pieces. Add remaining rice. Arrange vegetables on top in wedge-shaped piles (like pizza slices), topping with julienned carrots. Cook uncovered until well-heated through, 10 to 15 minutes. Bring skillet to table, add chili sauce and toss mixture gently to combine ingredients. Serve hot."}]}