{"@context": "http://schema.org", "@type": "Recipe", "name": "Corn and Vegetable Gratin With Cumin", "description": "This pretty gratin is not as rich as it tastes. I blend the kernels from one of the ears of corn with eggs and milk for a sweet, rich custard that holds it all together. Cumin seeds accent the mixture and give it a Southwestern twist.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/07/08/health/08recipehealth_600/08recipehealth_600-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves six", "recipeCuisine": "southwestern", "recipeCategory": "casseroles", "keywords": "eggs, sweet corn, zucchini, gluten-free, halal, healthy, kosher, low-sodium, nut-free, vegetarian, side dish, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 149}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 131, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "1 gram", "proteinContent": "8 grams", "saturatedFatContent": "3 grams", "sodiumContent": "313 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, finely chopped", "1 medium red bell pepper, diced", "Salt to taste", "1 large garlic clove, minced", "1/2 pound zucchini, thinly sliced or diced", "Freshly ground pepper to taste", "Kernels from 2 ears sweet corn (about 2 cups)", "3 large eggs", "1/2 cup milk", "1 teaspoon cumin seeds, lightly toasted and coarsely ground in a spice mill, or slightly crushed in a mortar and pestle", "2 ounces Gruyère cheese, grated (1/2 cup, tightly packed)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Oil a 2-quart gratin or baking dish. Set aside the kernels from one of the ears of corn. Heat the olive oil in a large, nonstick skillet over medium heat and add the onion. Cook, stirring often, until it begins to soften, about three minutes, and add the red pepper and a generous pinch of salt. Cook, stirring often, until the onions and peppers are tender, about five minutes. Add the garlic and the zucchini, stir together and add another generous pinch of salt and some pepper. Cook, stirring often, until the zucchini is just beginning to look bright green and some of the slices are translucent. Stir in the kernels from one of the ears of corn. Stir together for a minute or two, and remove from the heat. Scrape into a large bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining corn kernels in a blender jar, and add the eggs, milk and 1/2 teaspoon salt. Blend until smooth. Pour into the bowl with the vegetables. Add the cumin and the cheese, and stir everything together. Scrape into the gratin dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 35 to 40 minutes, until the top is browned and the gratin is firm to the touch. Serve hot or warm."}]}