{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken-Fried Steak", "description": "Through good times and bad, the cube steak has remained a wallflower among meat cuts. Old-fashioned and a little mysterious, it’s a steak without pretension, or maybe a hamburger with humble aspirations.\n\nThe term “cube” can be a little murky. It doesn’t refer to the shape of the meat, which is usually beef but is sometimes made from pork, elk or other animals. Rather, it refers to both the shape of the dimples that checkerboard the surface of cube steak and the process that puts the dimples there. \n\nThose dimples provide more surface area for flour to cling to, which makes for crisper cutlets in recipes like this simply-prepared (no batter, just a generous dusting of flour) chicken-fried steak.", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2019/03/15/dining/ks-chicken-fried-steak/merlin_150673200_ceab6f73-72f3-498b-b14d-e6564f9b1f33-articleLarge.jpg", "totalTime": "PT25M", "recipeYield": "6 servings", "recipeCuisine": "southern", "recipeCategory": "dinner, quick", "keywords": "cube steak, milk, fall, winter, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 154}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 862, "unsaturatedFatContent": "44 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "58 grams", "fiberContent": "2 grams", "proteinContent": "48 grams", "saturatedFatContent": "9 grams", "sodiumContent": "739 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["Vegetable oil for frying", "2 cups flour", "1 1/2 tablespoons salt", "1 1/2 tablespoons pepper", "2 cups milk", "2 pounds cube steak, cut into 6 pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 200 degrees. Pour a half-inch of oil into a cast-iron or other large, heavy skillet and place over medium-high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put flour, salt and pepper in a large zip-top bag or in a large baking dish and mix well. Pour milk into a large bowl. Dip each piece of steak in milk, shake off excess and then shake in bag of flour or press into dish of flour, making sure both sides are well coated. Shake off excess."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lay steaks into hot oil until skillet is full, but not crowded. Cook for about 3 minutes a side, or until a good crust is formed. You may need to do this in batches, moving steaks to a platter in the warm oven as they cook. When done, pour off all but about 4 tablespoons of fat from pan, leaving in as many browned bits as possible, and turn off heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour milk into a saucepan and add enough water to make 3 cups. Heat over medium heat until just before boiling point."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn heat under frying pan to medium. When oil is hot, sprinkle in 3 tablespoons of flour mixture, 1 tablespoon at a time, quickly stirring until flour starts to brown, 1 to 2 minutes. Gradually add liquid, stirring constantly to remove lumps and cook until thickened. Adjust seasoning."}], "link": "https://cooking.nytimes.com/recipes/1012433-chicken-fried-steak"}