{"@context": "http://schema.org", "@type": "Recipe", "name": "Strawberry Soup", "description": "In France they might call this a soup a concassée. The strawberries are crushed rather than pureed, so the soup has lots of texture. Strawberries, like other red fruits and berries, are a great source of anthocyanins and ellagitannens, which have been shown to have antioxidant and anti-inflammatory properties.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2009/08/18/health/18recipehealth_600/18recipehealth_600-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "easy, soups and stews", "keywords": "dairy-free, gluten-free, halal, healthy, high fiber, kosher, low cholesterol, low-fat, low-sodium, nut-free, vegan, vegetarian, dessert, orange juice, strawberry, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 98}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 125, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "5 grams", "proteinContent": "2 grams", "saturatedFatContent": "0 grams", "sodiumContent": "3 milligrams", "sugarContent": "23 grams", "transFatContent": null}, "recipeIngredient": ["2 1/4 pounds ripe strawberries (2 very generous pints), hulled", "2 tablespoons fresh lemon juice", "1 tablespoon sugar", "1 tablespoon mild flavored honey, such as clover or acacia (more to taste)", "1 teaspoon rose water (available in Middle Eastern markets)", "1/2 cup freshly squeezed orange juice", "Chopped or slivered fresh mint for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Separate out a fourth of the prettiest strawberries. Quarter or slice them and toss in a large bowl with 1 tablespoon of the lemon juice and the sugar. Cover and refrigerate for 1 hour or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the remaining strawberries in the bowl of a standing mixer fitted with the paddle, or in a food processor fitted with the steel blade. If using the mixer, turn on at medium-low speed and crush the berries to a coarse puree. If using a food processor pulse to a coarse puree. Add the remaining lemon juice, the orange juice, the honey and the rose water and beat together. Taste and add more honey if desired. Chill until ready to serve."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, stir the quartered strawberries with the juice that has accumulated in the bowl into the crushed strawberries. Ladle into bowls, top with chopped or slivered mint, and serve."}], "link": "https://cooking.nytimes.com/recipes/1012735-strawberry-soup"}