{"@context": "http://schema.org", "@type": "Recipe", "name": "Wheat Berries With Broccoli", "description": "I thought what I had in my pantry was farro, a strain of wheat that is slightly softer than our North American wheat berries, but when I tried to make a farro risotto and the grains took forever to become tender, I figured the grains must be wheat berries. So I used what remained to make this dish, which is more like a pilaf.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT1H40M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, lunch", "keywords": "broccoli, wheat berries, halal, healthy, high fiber, low cholesterol, low sugar, nut-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 282, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "8 grams", "proteinContent": "11 grams", "saturatedFatContent": "3 grams", "sodiumContent": "1204 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 cup wheat berries", "6 cups water, vegetable stock or chicken stock", "Salt to taste", "2 broccoli crowns, broken into florets", "2 tablespoons olive oil", "1/2 cup minced onion", "2 garlic cloves, minced", "2 teaspoons chopped fresh rosemary", "freshly ground pepper", "1 to 2 ounces Parmesan cheese, grated (1/4 to 1/2 cup, to taste)", "1/4 cup chopped fresh parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the wheat berries in a bowl, and pour on enough hot water to cover by an inch. Soak for at least one hour, preferably overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the wheat berries, retaining the soaking water. Add the soaking water to the stock. Add salt to taste. Place in a large saucepan, and bring to a boil. Add the broccoli, blanch for three minutes and transfer to a bowl of ice water. Allow to cool for a few minutes, then drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring the liquid in the pan back to a boil, and add the wheat berries. Reduce the heat, cover and simmer one hour, until the wheat berries are tender. Remove from the heat, allow the grains to swell in the cooking water for 10 minutes and then drain over a bowl. You will need some of the liquid later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy nonstick skillet, and add the onion. Cook, stirring, until tender, about five minutes, and add the garlic and rosemary. Cook, stirring, until fragrant, about one minute, then stir in the wheat berries and the broccoli and heat through. Add freshly ground pepper, taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scoop 1/4 of the cooking liquid you set aside from the bottom of the bowl, where the starch has settled. Stir into the wheat berries, along with the Parmesan and parsley. Heat through, stirring until the cheese melts, and serve."}], "link": "https://cooking.nytimes.com/recipes/1012633-wheat-berries-with-broccoli"}