{"@context": "http://schema.org", "@type": "Recipe", "name": "Quinoa With Roasted Winter Vegetables and Pesto", "description": "This combination of sweet vegetables with pungent pesto is great for a simple grain and vegetable bowl.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/10/18/science/20recipehealth/20recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves 6", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "fall, gluten-free, healthy, high fiber, low cholesterol, low-sodium, vegetarian, main course, pesto, quinoa, winter vegetables", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 80}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 258, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "36 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "7 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "548 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 pound winter squash, peeled and cut in 1 1/2-inch chunks", "1/2 pound carrots, peeled, quartered and cut in 2-inch lengths", "1/2 pound brussels sprouts, trimmed and cut in half through the stem", "1/2 pound turnips, peeled and cut in wedges", "2 tablespoons extra virgin olive oil", "Salt", "freshly ground pepper", "1 cup quinoa", "1/4 to 1/3 cup pesto or pistou"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 425 degrees Fahrenheit. Oil one or two sheet pans or baking dishes large enough to fit all of the vegetables in a single layer. Place the vegetables in a large bowl and toss with the olive oil and salt and pepper to taste.  Spread the vegetables in an even layer on the prepared pan. Place in the top third of the oven and bake 20 minutes, stirring halfway through. Turn the heat down to 375 degrees and continue to bake until the vegetables are lightly browned and tender all the way through when pierced with a knife, 10 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the vegetables are in the oven, cook the quinoa. Rinse thoroughly with cold water. Bring 3 cups water or stock to a boil in a medium saucepan. Add salt to taste (1/2 to 3/4 teaspoon) and the quinoa. Bring back to a boil, reduce the heat to low, cover and simmer 15 minutes, or until the quinoa is tender and translucent, and each grain displays a little thread. Drain through a strainer and return the quinoa to the pan. Cover the pan with a clean dish towel, replace the lid and allow the quinoa to sit undisturbed for 10 minutes or longer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the vegetables are tender, remove from the heat and transfer back to the bowl. Add the pesto or pistou and stir together. Serve over quinoa."}]}