{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Paillard With Parmesan Bread Crumbs", "description": "This recipe doesn’t take long to get on the table, and you can get some aggression out at the start of the process by pounding down the chicken breasts. Then dredge the chicken in bread crumbs and Parmesan and sauté it in butter. At the end, you’ll spoon brown butter over the top and add a sprinkling of capers for a very simple meal that looks very fancy indeed.", "author": {"@type": "Person", "name": "Jennifer Steinhauer"}, "image": "https://static01.nyt.com/images/2014/04/25/dining/jidorichicken-still/jidorichicken-still-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, weekday, one pot", "keywords": "chicken, parmigiano-reggiano, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 86}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 920, "unsaturatedFatContent": "25 grams", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "52 grams", "fiberContent": "3 grams", "proteinContent": "77 grams", "saturatedFatContent": "22 grams", "sodiumContent": "1033 milligrams", "sugarContent": "3 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["6 boneless, skinless chicken breasts", "3/4 cup all-purpose flour", "3 large eggs", "4 1/2 cups fresh, soft bread crumbs", "1 cup finely grated Parmigiano-Reggiano", "6 tablespoons finely chopped flat-leaf parsley", "Kosher salt", "black pepper", "6 tablespoons extra virgin olive oil", "12 tablespoons (1 1/2 sticks) unsalted butter", "1 rosemary sprig, broken in half", "1 dried chile d’arbol, broken in half", "2 cloves garlic, sliced", "2 heads escarole, core removed, leaves separated and cleaned", "Lemon wedge, for seasoning", "2 tablespoons chopped capers", "Finely grated zest of 1 lemon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place chicken breasts between 2 pieces of plastic wrap, and pound to an even thickness of 1/3 inch. Spread flour in a wide shallow bowl or pie pan. Beat eggs in another wide shallow bowl. In a third such bowl or dish, combine bread crumbs, Parmigiano-Reggiano and 3 tablespoons parsley."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season chicken with salt and pepper. Dredge in flour, then in egg, then in bread crumbs, pressing to help crumbs adhere. Place 2 large sauté pans or skillets over high heat for 2 minutes. Place 2 tablespoons olive oil in each pan and swirl pans so oil spreads. Heat until shimmering, 30 to 60 seconds."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully place 3 chicken breasts in each pan. Cook 3 minutes, then add one tablespoon butter to each pan. Continue to cook until undersides are golden brown, about one more minute. Reduce heat to medium, turn chicken and cook again until golden brown and chicken is opaque in center, 2 to 3 minutes. Transfer chicken to a baking sheet, cover with foil and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return unwashed pans to medium heat and swirl one tablespoon olive oil into each. Divide rosemary and chili between pans and let sizzle for 30 seconds. Add half the garlic to each pan, stir a few seconds, then add escarole to each pan. Season with salt and pepper and sauté gently until greens have just wilted, 2 to 3 minutes. Season with a squeeze of lemon and transfer to a large warmed platter. Top with chicken, cover with foil and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe out one pan and return to medium heat. Add remaining 10 tablespoons butter and cook until it is browned and has a nutty fragrance. Remove from heat, wait a few seconds and add capers, lemon zest and remaining 3 tablespoons parsley. Adjust salt and pepper as needed. Spoon brown butter and capers over chicken and greens."}], "link": "https://cooking.nytimes.com/recipes/1013124-chicken-paillard-with-parmesan-bread-crumbs"}