{"@context": "http://schema.org", "@type": "Recipe", "name": "Yucatan Shrimp", "description": "This is a dinner to evoke deep summer, when the heat lies heavy even at dusk and humidity wraps you like a blanket: shrimp tossed in garlic butter made fiery with Indonesian sambal and jalapeño, cut by lime, fragrant with cilantro. It is a kind of scampi for the sun-kissed and sun-desirous alike, a vacation on a plate. Add a mojito and a couple of beers. The recipe comes out of southwest Florida, from Doc Ford’s Sanibel Rum Bar and Grille, a restaurant that sits off the road that runs slow and sultry along Sanibel Island toward Captiva, past the placid, russet waters of Tarpon Bay. Randy Wayne White, one of the owners, named the place after the fictional protagonist of his mystery novels. The air smells of salt and mangrove there, of tropical rot and fresh-cut grass. He graciously sent along a recipe, which we adapted for use at home, in 2010.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/Yucatan-Shrimp/Yucatan-Shrimp-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "easy, quick", "keywords": "appetizer, gluten-free, lime juice, shrimp", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 768}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 199, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "1 gram", "proteinContent": "16 grams", "saturatedFatContent": "8 grams", "sodiumContent": "687 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons unsalted butter", "1 large clove garlic, minced", "Juice of two large limes", "1 tablespoon Indonesian sambal (preferably sambal oelek, by Huy Fong, though sriracha will work as well)", "Kosher salt", "freshly ground black pepper to taste", "1 pound large, fresh, shell-on shrimp", "1 teaspoon jalapeño, seeded and chopped (optional)", "2 tablespoons chopped cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan set over low heat, melt 1 tablespoon of butter. Add the garlic and cook, stirring for 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add remaining 3 tablespoons butter to saucepan. When it melts, stir in the lime juice, chili sauce, salt and pepper. Turn off the heat and allow the sauce to rest."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of well-salted water to a boil. Add the shrimp and cook for 2 minutes or until they are just firm and pink. Do not overcook. Drain into a colander and shake over the sink to remove excess moisture."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, toss the shrimp and chili sauce. Add jalapeño, if desired, sprinkle with cilantro and toss again."}]}