{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet Greens, Green Garlic and Barley Gratin", "description": "I use a certain formula for Provençal gratins combining grains and vegetables. I cook the greens and garlic, and then toss them with a cup of cooked grains, three eggs, a half cup of milk and some Gruyère cheese. I happened to have purple barley in my freezer when trying out this recipe, but you can use any type of barley, brown rice or arborio rice.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/05/10/science/13recipehealth/13recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "dinner, weekday, casseroles", "keywords": "barley, beet greens, green garlic, healthy, vegetarian, main course, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 271, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "2 grams", "proteinContent": "11 grams", "saturatedFatContent": "4 grams", "sodiumContent": "310 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 generous bunch beet greens, stemmed and washed", "2 tablespoons extra virgin olive oil", "1 medium onion, chopped", "4 large cloves green garlic, peeled and sliced, or one small head that has not separated into cloves, chopped", "Salt to taste", "1 teaspoon fresh thyme leaves or 1/2 teaspoon dried thyme", "3 eggs", "1/2 cup 2 percent milk", "Freshly ground pepper", "1 cup cooked barley (regular pearled or purple), brown rice or arborio rice", "1/2 cup grated Gruyère cheese (2 ounces)", "2 tablespoons freshly grated Parmesan"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Oil a 2-quart gratin dish with olive oil. Blanch the beet greens for one minute in a large pot of generously salted boiling water, or steam over 1 inch of boiling water for two to five minutes until wilted and tender. Rinse with cold water, squeeze out water and chop medium-fine. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large, heavy skillet. Add the onion, and cook, stirring, until tender, about five minutes. Add the garlic and a generous pinch of salt. Continue to cook for another minute or two until the garlic is fragrant. Stir in the cooked greens and the thyme, and toss together. Season to taste with salt and pepper. Remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, beat together the eggs and milk. Add 1/2 teaspoon salt and freshly ground pepper to taste. Stir in the greens mixture, the barley or rice, and the cheeses. Mix together well. Scrape into the oiled baking dish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake 35 to 40 minutes until sizzling and lightly browned on the top and sides. Remove from the heat, and allow to sit for at least 10 minutes before serving."}]}