{"@context": "http://schema.org", "@type": "Recipe", "name": "Lentil Soup With Chipotles", "description": "Chipotles in adobo add a wonderful smoky-spicy element to this lentil soup. Lentils combine well with smoky flavors — that’s why they’re so often cooked with sausage or bacon.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/11/16/science/19recipehealth/19recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "dinner, easy, lunch, weekday, soups and stews", "keywords": "appetizer, main course, chipotle, lentils, gluten-free, healthy, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 359}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 187, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "5 grams", "proteinContent": "11 grams", "saturatedFatContent": "0 grams", "sodiumContent": "737 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 tablespoon canola oil", "1 small onion or 1/2 medium, chopped", "2 large garlic cloves, minced", "2 teaspoons cumin seeds, lightly toasted and ground", "1 tablespoon tomato paste", "1 1/3 cups brown lentils, rinsed and picked over", "6 cups water", "Salt to taste", "1 to 2 canned chipotles in adobo, to taste, rinsed, seeded and sliced, plus a teaspoon of the adobo sauce", "Croutons or toasted tortilla chips for garnish optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the canola oil over medium heat in a large, heavy soup pot. Add the onion. Cook, stirring, until tender, about five minutes. Add the garlic, cumin and tomato paste. Cook, stirring, until the mixture is fragrant, 30 seconds to a minute. Stir in the lentils and water, add salt to taste (1 to 2 teaspoons) and bring to a boil. Reduce the heat to low, cover and simmer until the lentils are very tender, about 50 minutes. Taste and adjust seasoning."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using a hand blender, coarsely purée the soup, or purée half the soup in batches in a blender. (Make sure to remove the stopper from the blender lid and hold a towel tightly down over the top to avoid hot splashes.) Stir the blended soup back into the pot, and combine well. Add the chipotles, and heat through. Taste and adjust seasonings. Garnish each serving with croutons or toasted tortilla chips if desired."}], "link": "https://cooking.nytimes.com/recipes/1013356-lentil-soup-with-chipotles"}