{"@context": "http://schema.org", "@type": "Recipe", "name": "Rustic Plum Crostata With Lemon Thyme", "description": "Whether you call it a crostata, a galette or a rustic fruit tart, this juicy, messy confection has a charm that lies with its flavors rather than its looks. It hits the same luscious, buttery, jammy notes as a fruit pie, but instead of being neatly trimmed, crimped and latticed, it features hasty folds and raggedy edges: perfectly acceptable points of style. Unlike jewel-like tarts crowned with perfect fruits, crostatas do just as well with weeping, bruised specimens, as long as you cut out any obviously funky bits. And crostatas are easy to improvise. You can use whatever fruit you have, making this a handy recipe to pull out when the result of your farmers’ market shopping exuberance begins to wrinkle and fade.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/15/dining/plumcrostata/plumcrostata-articleLarge.jpg", "totalTime": "PT1H20M", "recipeYield": "8 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dessert, flour, heavy cream, sugar plum", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 74}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 270, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "7 grams", "sodiumContent": "146 milligrams", "sugarContent": "21 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup (130 grams) all-purpose flour", "1/3 cup (40 grams) whole-wheat flour", "1/2 cup (100 grams) plus 1 tablespoon (15 grams) sugar", "1/2 teaspoon (2 grams) plus a pinch fine sea salt", "1 large egg", "Heavy cream", "6 tablespoons (85 grams) unsalted butter, cut into small pieces", "3 cups sliced and pitted ripe sugar plums or mix of other plums about 1 1/2 pounds before pitting", "1 1/2 tablespoons (22 grams) cornstarch", "1 small bunch lemon thyme (or use 1 teaspoon lemon thyme leaves)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a food processor fitted with a steel blade, pulse together the flours, 1 tablespoon sugar and 1/2 teaspoon salt until blended. In a measuring cup, lightly beat the egg, and add just enough cream to get to 1/3 cup. Lightly whisk the egg and cream together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the butter to the flour mixture and pulse to break up the butter. Do not over-process; you need lima-bean-size chunks of butter. Drizzle the egg mixture over the dough and pulse until it just starts to come together but is still mostly large crumbs."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the dough on the counter and knead to make one uniform piece. Flatten into a disk, wrap in plastic and chill for 2 hours or up to 3 days."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees. Roll the dough out to a 12-inch round (it can be ragged). Transfer to a rimmed baking sheet and chill while preparing the filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss together the plums, all but a tablespoon of the remaining sugar, a pinch of salt and the cornstarch. Pile fruit on the dough circle, leaving a 1 1/2-inch border. Gently fold the pastry over the fruit, pleating to hold it in (sloppy is fine). Brush pastry with cream. Sprinkle remaining sugar on top, with the thyme."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 30 to 40 minutes, until the crust is golden and the fruit is tender. Cool for 5 minutes, then transfer to a wire rack. Remove the thyme branches (some leaves will cling; you want this). Serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1013828-rustic-plum-crostata-with-lemon-thyme"}