{"@context": "http://schema.org", "@type": "Recipe", "name": "Cherry Cobbler With Almond-Buttermilk Topping", "description": "The topping for this almond-scented cobbler is a buttermilk biscuit batter made with a mixture of flours. Cornmeal contributes texture, and whole-wheat and almond flours add nuttiness. For a gluten-free version, substitute almond meal or rice flour for the whole-wheat flour. ", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/07/13/science/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves eight", "recipeCuisine": "", "recipeCategory": "", "keywords": "almond flour, buttermilk, cherries, dessert, healthy, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 58}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 269, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "40 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "5 grams", "sodiumContent": "283 milligrams", "sugarContent": "22 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 1/2 pounds cherries, stemmed and pitted about 5 cups", "2 tablespoons sugar", "1 tablespoon fresh lemon juice", "1 tablespoon sifted all-purpose flour", "1/4 teaspoon almond extract", "1/2 cup whole-wheat pastry flour", "1/2 cup almond meal, also called almond flour or almond powder 1 1/2 ounces", "1/2 cup fine cornmeal", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/4 cup sugar", "1/4 teaspoon salt", "5 tablespoons cold unsalted butter, cut into 1/2-inch pieces", "2/3 cup buttermilk"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 400 degrees. Butter a 2-quart baking dish. Place the cherries in a large bowl, and add the sugar, lemon juice and all-purpose flour. Carefully mix them together with a rubber spatula or a large spoon until the sugar and flour have dissolved into the liquids. Transfer to the baking dish, making sure to scrape out all of the liquid in the bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sift all of the dry ingredients for the topping. If some of the cornmeal and almond flour remain in the sifter, just dump it into the bowl with the sifted flours. Place in the bowl of a food processor fitted with the steel blade, and pulse a few times. Add the butter, and pulse to cut in the butter until the mixture looks like coarse cornmeal. Turn on the food processor, and pour in the buttermilk with the machine running. As soon as the dough comes together, stop the machine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the topping over the cherries by the heaped tablespoon. The cherries should be just about covered but may peek out here and there. Place in the oven, and bake 35 to 40 minutes until the top is nicely browned and the cherries are bubbling. Remove from the heat, and allow to cool to warm before serving. Serve warm (heat in a low oven for 15 minutes if necessary before serving)."}], "link": "https://cooking.nytimes.com/recipes/1013697-cherry-cobbler-with-almond-buttermilk-topping"}