{"@context": "http://schema.org", "@type": "Recipe", "name": "Moroccan-Style Cornish Hens with Couscous", "description": "Couscous with onions and raisins and seasoned with cumin delivers many levels of flavor with rich little Cornish hens, massaged with spices. How many birds you need for four guests will be determined by their size (the birds’ and perhaps the guests’, too). Whether you grill or roast them depends on your mood, your kitchen and the weather. The couscous could even be stuffing for smaller hens, one per person, roasted at 375 degrees for about 50 minutes.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/moroccan-cornish-hen-couscous/moroccan-cornish-hen-couscous-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "moroccan", "recipeCategory": "dinner", "keywords": "cornish hen, couscous, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 48}, "recipeIngredient": ["5 tablespoons extra virgin olive oil", "1 teaspoon paprika", "2 teaspoons ground cumin", "Salt", "pepper", "4 small (less than 1 1/2 pounds) or 2 large Cornish hens, split in half", "Juice of 2 lemons", "1 1/2 cups medium-grain couscous, cooked in chicken stock according to package directions", "1 large onion, sliced thin", "1/2 cup golden raisins", "1 tablespoon minced cilantro leaves"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix 3 tablespoons of the oil with the paprika, 1 1/2 teaspoons cumin, 1/2 teaspoon salt and 1/4 teaspoon pepper. Rub inside surfaces of hens with 1 tablespoon of the lemon juice, then smear them, inside and out, with the spice paste. Set aside 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sauté onions in remaining oil in a skillet over medium heat until golden. Stir in raisins and remaining cumin and cook until onions are lightly browned. Fold in cooked couscous and season with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat grill or heat oven to 375 degrees. If grilling, sear hens on the skin side over medium heat, then turn them over, basting a couple of times with remaining lemon juice, until cooked through, about 35 minutes. If using oven, roast hen halves skin side up in a roasting pan until cooked through, 35 to 40 minutes, basting a couple of times with remaining lemon juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Reheat couscous, fold in cilantro, and mound on a platter. Arrange hen halves around couscous and serve hot or warm."}]}