{"@context": "http://schema.org", "@type": "Recipe", "name": "Smoky Oven Spareribs", "description": "", "author": {"@type": "Person", "name": "Harold Mcgee"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, quick, project", "keywords": "main course, spare ribs", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 40}, "recipeIngredient": ["1 cup brown sugar", "2 tablespoons ancho chili powder or paprika", "2 teaspoons salt", "2 teaspoons garlic powder", "1/4 teaspoon ground cloves", "1/2 teaspoon ground cinnamon", "5 pounds spareribs, cut into 4 slabs, rinsed and patted dry", "2 teaspoons mild or hot pimentón (smoked Spanish paprika)", "1 tablespoon cider vinegar or red or white vinegar", "1 to 2 teaspoons vanilla extract"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 200 degrees. In a mixing bowl, combine the brown sugar, ancho chili powder or paprika, salt, garlic powder, cloves and cinnamon."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place each slab of ribs on a piece of foil large enough to fold into a packet. Sprinkle spice rub over the ribs, rubbing in thoroughly on all sides. With the ribs meat-side down, tightly fold the foil to form sealed packets."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a rack on a baking sheet, place packets on the rack and put in oven. Bake for 4 hours, then reduce heat to 175 degrees and bake for 2 more hours, or until a fork easily penetrates the meat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Open each packet and pour the accumulated juices into a saucepan, then refold the packets. Bring juices to a simmer over medium heat and reduce by about half, until they cling to a spoon. Remove from the heat and stir in the pimentón, vinegar and vanilla extract."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove ribs from foil, coat with the sauce and serve. The ribs can also be finished for 2 to 3 minutes on an open hot grill or smoky closed one, or under the broiler, then coated with sauce."}], "link": "https://cooking.nytimes.com/recipes/1013188-smoky-oven-spareribs"}