{"@context": "http://schema.org", "@type": "Recipe", "name": "Butterflied Chicken With Cracked Spices", "description": "Somewhere in “The Zuni Cafe Cookbook” is a recipe for a standing rib roast of pork with variations. I’m sure of that. I’m less sure, because I can’t find it online, that the book gives a variation that calls for rubbing the meat with fennel and coriander seeds, among other spices. I wanted to try some version of that on a chicken and came up with the idea of grafting those seasonings, as I remembered them, onto a classic Marcella Hazan recipe for chicken alla diavola. Hazan has you <a href=\"http://www.nytimes.com/video/dining/100000003069750/cooking-techniques-spatchcocking.html\">butterfly the chicken</a> and rub it with cracked black pepper before grilling or broiling it. Just by faking and misremembering, I stumbled on a weeknight dinner that’s faster than roast chicken and fragrant with mysteriously harmonious spices. It may not be the devil’s chicken, but it could be the work of one of his minor demons.", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2016/06/13/dining/13COOKING-BUTTERFLIED-CHICKEN2/13COOKING-BUTTERFLIED-CHICKEN2-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 to 4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday, times classics", "keywords": "gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 562, "unsaturatedFatContent": "28 grams", "carbohydrateContent": "1 gram", "cholesterolContent": null, "fatContent": "42 grams", "fiberContent": "1 gram", "proteinContent": "43 grams", "saturatedFatContent": "11 grams", "sodiumContent": "560 milligrams", "sugarContent": "0 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 chicken, around 3 pounds", "2 tablespoons olive oil", "2 teaspoons fennel seed", "1 teaspoon coriander seed", "1/2 teaspoon black peppercorns", "1/4 teaspoon cumin seed", "2 teaspoons coarse sea salt", "1/2 teaspoon hot paprika or pimentón", "Lemon halves or fat wedges"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Light a grill or set your broiler on high and give it a 15-minute head start."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "<a href=\"http://www.nytimes.com/video/dining/100000003069750/cooking-techniques-spatchcocking.html\">Butterfly (or spatchcock) the chicken</a>: Cut out the chicken’s backbone with poultry shears, a cleaver or a sharp, heavy chef’s knife (or ask a butcher to do this). If you think you will make stock at some point, by all means tightly wrap the backbone in plastic and put it in the freezer. Place the chicken skin side up in a roasting pan and press firmly on the breast with the heels of your hands until it cracks and flattens. Position the legs so they lie flat and the drumsticks point out. Tuck the wingtips over the tops of the wings to hold them in place, or cut them off. Rub the bird with the oil. (Don’t worry about any extra oil that may fall onto the pan.) Now wash your hands."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely grind the fennel, coriander, peppercorns and cumin with a mortar and pestle or with 8 or 9 pulses in a spice grinder. Mix in the salt and paprika or pimentón and sprinkle this rub on both sides of the bird, with the emphasis on the skin."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set the chicken skin side down on a grill or skin side up on a broiler rack positioned so the highest point of the bird is about 10 inches from the flame. When the skin begins to brown after 6 or 7 minutes, flip the chicken over. (The easiest way is to grab the knobby ends of both drumsticks with several layers of paper towels if you are in the kitchen, or with clean oven mitts if you are grilling.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "After about 10 minutes, when the bony side is browned, lower the heat to medium-high (400 if you're using an oven), flip the chicken again and cook another 10 minutes, or until the skin is very crisp and brown and the thickest part of the thigh reaches 165 degrees when checked with a meat thermometer. Let it rest about 5 minutes before carving. (If you are grilling, set it on a platter.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon any juices that have collected in the broiler pan or the platter over the chicken. Serve with lemon. In springtime, try to serve this with tender young bitter greens — like arugula, watercress or baby dandelions — tossed in a sharp vinaigrette."}], "link": "https://cooking.nytimes.com/recipes/1013156-butterflied-chicken-with-cracked-spices"}