{"@context": "http://schema.org", "@type": "Recipe", "name": "Red Coconut Rice Pudding With Mango", "description": "This dish is inspired by a classic Thai sweet made with sticky rice. The red Bhutanese rice has a very nice chewy texture, and the pudding has a light purple-red hue.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/Red-Coconut-Rice-Pudding-With-Mango/Red-Coconut-Rice-Pudding-With-Mango-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "Serves four", "recipeCuisine": "asian, thai", "recipeCategory": "easy", "keywords": "bhutanese red rice, mango, dessert, gluten-free, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 33}, "recipeIngredient": ["3/4 cup red Bhutanese rice", "1 1/2 cups water", "1/4 teaspoon salt", "1 cup milk (can use 2 percent) or rice beverage", "1 cup unsweetened low-fat coconut milk", "Seeds from 1 split vanilla bean, or 1 teaspoon vanilla extract", "1/2 cup raw brown sugar, preferably fair-trade organic", "1/2 teaspoon rose water (optional)", "1 ripe mango, peeled, seeded and cut in thin slices", "Fresh lime juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the rice, water and salt in a saucepan, and bring to a boil. Reduce the heat, cover and simmer 30 minutes or until all of the water is absorbed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the milk, coconut milk, vanilla and sugar to the rice, and stir together. Bring to a boil while stirring. Reduce the heat and simmer uncovered, stirring often, for 10 to 20 minutes until creamy. Stir in the rose water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Scrape into a bowl or into individual serving dishes, and allow to cool. Serve warm, if you prefer. If serving chilled, cover and cool for at least two hours before serving. Spoon into wide serving bowls or plates, and arrange slices of mango atop or alongside each serving. Squeeze a little lime juice over the mango slices, and serve."}], "link": "https://cooking.nytimes.com/recipes/1013580-red-coconut-rice-pudding-with-mango"}