{"@context": "http://schema.org", "@type": "Recipe", "name": "Summer Berry Ice Cream", "description": "Egg-free ice cream, often called Philadelphia-style or American-style, is a traditional method that can yield phenomenal results if superior ingredients are used and if the ice cream is not pumped full of air (as many cheap store-bought brands are). From the perspective of a home cook, egg-free ice creams are simpler than custard-based ones, and more foolproof. You don’t have to worry about tempering the yolks, or fear curdling.  To soften the texture of egg-free ice creams, which otherwise freeze rock solid, David Lebovitz, author of “The Perfect Scoop,” advised adding a few spoonfuls of alcohol or a liquid sweetener like honey or maple syrup. Adding more sugar also helps the texture, said Nick Morgenstern of Morgenstern’s Finest Ice Cream, but so does simply leaving the ice cream at room temperature — or better, in the refrigerator — until soft enough to scoop.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2015/06/11/dining/berry-ice-cream/berry-ice-cream-articleLarge.jpg", "totalTime": "PT10M", "recipeYield": "About a quart", "recipeCuisine": "", "recipeCategory": "quick, ice creams and sorbets", "keywords": "berries, heavy cream, dessert, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 168}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 271, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "14 grams", "sodiumContent": "52 milligrams", "sugarContent": "15 grams", "transFatContent": null}, "recipeIngredient": ["1 1/4 cups berries (blueberries, raspberries, strawberries, blackberries combined)", "2 cups heavy cream", "1/3 cup sugar, plus 2 tablespoons, as needed", "1/8 teaspoon kosher salt", "2 tablespoons vodka"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a bowl, mash berries with a fork or potato masher until just slightly chunky."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan over medium-low heat, bring cream to a simmer with 1/3 cup sugar and the salt. Taste berries and if they are very tart, add 2 tablespoons sugar to saucepan. Simmer, stirring occasionally, until sugar dissolves. Transfer to a bowl, stir in vodka and place in refrigerator or in an ice bath to chill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When cold, pour mixture into ice cream machine. Add berries and churn according to manufacturer’s directions. Transfer to a container and freeze until solid, at least 2 hours. Let sit at room temperature for 5 to 10 minutes before serving, or in refrigerator for 15 to 30."}], "link": "https://cooking.nytimes.com/recipes/1013221-summer-berry-ice-cream"}