{"@context": "http://schema.org", "@type": "Recipe", "name": "Goat Crudo with Porcini Mushrooms and Arugula", "description": "", "author": {"@type": "Person", "name": "Anthony Tassinello"}, "image": null, "totalTime": "PT50M", "recipeYield": "Serves 4", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "appetizer, goat tenderloin, porcini, rustic italian bread", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 328, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "19 grams", "fiberContent": "2 grams", "proteinContent": "22 grams", "saturatedFatContent": "7 grams", "sodiumContent": "444 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["12 ounces lean goat tenderloin (lamb or beef can be substituted)", "Arugula, a generous handful, washed and dried", "Extra-virgin olive oil", "1 Meyer lemon", "Kosher salt", "8 ounces fresh porcini mushrooms (button mushrooms can be substituted)", "Freshly ground black pepper", "Pinch of cayenne pepper", "8 thin slices rustic bread, toasted over a fire if possible"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the meat in the freezer for about 30 minutes. This will allow for easier slicing. Carefully slice ¼-inch pieces from the very cold meat, discarding any connective tissue or sinewy bits. Chop the sliced meat finely. Transfer to a bowl, cover and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, dress the arugula with olive oil, a squeeze of Meyer lemon juice and a pinch of salt. Make a bed of arugula on a small platter. Clean the mushrooms and slice them paper-thin. Scatter the mushroom slices over the arugula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the prepared meat from the refrigerator. Season generously with salt, pepper, a generous pinch of cayenne pepper and 1 tablespoon of the olive oil. Stir, taste and adjust seasoning. Place the seasoned meat in the center of the bed of mushrooms and arugula, flattening it slightly into a disk shape. Carefully top the crudo with the raw egg yolk and garnish with a generous grind of black pepper and a squeeze of lemon. Line the platter with the toasted bread. Drizzle the entire dish with more olive oil if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, evenly mix the egg yolk into the goat crudo. To build a toast, top it with the crudo, then the arugula and porcini."}]}