{"@context": "http://schema.org", "@type": "Recipe", "name": "Stewed Greens With Tomatoes and Mint", "description": "This is inspired by a Greek recipe from the island of Corfu, from Diane Kochilas’s book “The Greek Vegetarian.” I love the way the greens and tomatoes are infused with mint. If you want to try more unusual greens from your farmers’ market, like amaranth or purslane, they will work in this dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/21/science/21recipehealth/21recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves 4 to 6", "recipeCuisine": "greek", "recipeCategory": "weekday", "keywords": "fall, greens, mint, tomato, healthy, vegan, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 15}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 83, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "6 grams", "proteinContent": "5 grams", "saturatedFatContent": "0 grams", "sodiumContent": "816 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds Swiss chard or kale, stemmed and washed, or a 1-pound bag of stemmed, washed Southern greens", "Salt", "2 tablespoons extra virgin olive oil, plus additional if desired for drizzling", "1 large onion, chopped", "2 to 4 garlic cloves to taste, minced", "2 teaspoons sweet paprika", "1/4 to 1/2 teaspoon cayenne", "2 pounds fresh tomatoes, seeded and grated, or peeled, seeded and chopped, or a 28-ounce can chopped tomatoes with juice", "1/2 cup chopped fresh mint", "1/2 cup chopped fresh fennel or dill", "2 tablespoons tomato paste, diluted in 1/2 cup water", "Freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil. Fill a bowl with ice water. When the water comes to a boil, salt generously and add the greens. Blanch chard for 1 minute, Southern greens or kale for 2 minutes. Transfer to the ice water, then drain and squeeze out water. Coarsely chop and set aside. Alternatively, steam the greens in a large steamer – 2 minutes for chard, 3 to 4 minutes for kale. Rinse and squeeze dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, heavy skillet or Dutch oven, heat the oil over medium heat and add the onion. Cook until the onion is tender and beginning to color, 5 to 8 minutes, and add the garlic, paprika and cayenne. Cook, stirring, for about a minute, until fragrant, and add the tomatoes and salt to taste. Bring to a simmer, and simmer until the tomatoes have cooked down slightly, about 10 minutes. Add the greens, herbs and diluted tomato paste, and bring to a simmer. Cover and simmer until the greens are very tender, about 20 minutes. Add salt and pepper to taste. Serve with rice, bulgur or just some good, crusty bread."}], "link": "https://cooking.nytimes.com/recipes/1013847-stewed-greens-with-tomatoes-and-mint"}