{"@context": "http://schema.org", "@type": "Recipe", "name": "Caramelized Onion Dip With Frizzled Leeks", "description": "Though onion-powder dip does give me a teenage memory buzz, I remember equally well the time I first slow-cooked a batch of onions, watching them easily turn from white to pale yellow to walnut (at which point you have to start minding them with care). These caramelized babies form the basis of scores of top-notch dishes, from onion soup to real Indian stews and sauces, but nowhere are they better used than as the basis for a dip: stir them, along with some lemon juice and thyme leaves, into yogurt or sour cream, and you’re on your way to dip nirvana. And just as your mother — or at least mine — made onion-sour-cream dip better with (French’s) canned fried onions, you can also take that idea back a hundred years and improve it: fry some leeks or shallots until they’re crisp. If you can manage to not eat those as you remove them from the pan, they enhance the dip even more.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT2H", "recipeYield": "8 servings", "recipeCuisine": "", "recipeCategory": "easy, condiments, dips and spreads", "keywords": "gluten-free, leek, onion, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 200}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 178, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "16 grams", "cholesterolContent": null, "fatContent": "12 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "2 grams", "sodiumContent": "445 milligrams", "sugarContent": "8 grams", "transFatContent": null}, "recipeIngredient": ["2 pounds onions (6 to 8 medium), chopped (5 to 6 cups)", "6 tablespoons extra virgin olive oil, plus more as needed", "Salt", "freshly ground black pepper", "1 tablespoon fresh thyme leaves", "1 1/2 cups whole-milk yogurt", "1 tablespoon freshly squeezed lemon juice, or more to taste", "2 leeks, trimmed, cleaned and julienned or thinly sliced", "Crudités or crackers for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the onions in a large skillet over medium heat. Cover and cook, stirring infrequently, until the onions are dry and almost sticking to the pan, about 20 minutes. Stir in 2 tablespoons of the oil and a large pinch of salt and turn the heat down to medium-low. Cook, stirring occasionally and adding just enough additional oil to keep them from sticking without getting greasy. The onions are ready when they’re dark, sweet and jammy, 40 minutes to 1 hour later."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle with black pepper, stir in the thyme and remove the onions from the heat. When they’re cool, fold them into the yogurt and stir in the lemon juice. Taste and adjust the seasoning, then transfer the mixture to a serving bowl. (At this point, you can cover the dip with plastic wrap and refrigerate for up to 2 days.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe or wash out the skillet and put it over medium-high heat. When it’s hot, add the remaining 4 tablespoons oil. A few seconds later, add half the leeks, turn the heat up to high and sprinkle with salt and pepper. Use a spatula to turn the leeks over as they cook. Be careful: they will go from not-browned to burnt pretty quickly, and you want to catch them in between those stages, when they’re browned and crisp. Transfer the leeks to paper towels to drain and repeat with the remaining leeks, adding more oil to the pan if necessary to keep them from sticking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Garnish the onion dip with the crisp leeks and serve immediately with crudités or crackers."}], "link": "https://cooking.nytimes.com/recipes/1013518-caramelized-onion-dip-with-frizzled-leeks"}