{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Spring Carrots and Leeks With Tarragon", "description": "Serve this sweet springtime dish as a starter or side dish, or as part of a vegetarian main dish with grains.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/05/18/science/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "easy, quick, weekday", "keywords": "carrot, leek, dairy-free, gluten-free, halal, healthy, kosher, vegan, vegetarian, side dish, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 179, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "28 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "622 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 pound leeks or (preferably) baby leeks, white and light green part only, root ends cut away, halved lengthwise, cleaned and sliced", "2 garlic cloves, minced", "1 pound carrots, peeled, halved or quartered lengthwise if thick, then cut in 2-inch lengths", "1/2 cup water", "Salt to taste", "2 teaspoons fresh lemon juice", "1 tablespoon chopped fresh tarragon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil in a medium saucepan or lidded skillet over medium heat. Add the leeks and a generous pinch of salt. Cook gently until just about tender, about three minutes. Do not allow the leeks to color. Add the garlic, and cook, stirring, until fragrant, 30 seconds to a minute. Add the carrots, water and salt to taste, and bring to a simmer. Cover and simmer 10 to 15 minutes until the carrots are tender when pierced with a knife. Stir in the lemon juice and tarragon. Taste and adjust salt. Transfer to a platter if desired, making sure to scrape out the tasty residue from the bottom of the pan with a wooden spoon or spatula. Serve hot, or allow to cool and serve at room temperature. If serving at room temperature, sprinkle with additional fresh tarragon just before serving."}]}