{"@context": "http://schema.org", "@type": "Recipe", "name": "Lavash Pizza With Onions and Anchovies", "description": "This is inspired by the Provençal onion pizza called pissaladière. Omit the anchovies if you’re watching your sodium intake or you’re just not a fan.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/10/26/science/27recipehealth/27recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H20M", "recipeYield": "Serves two", "recipeCuisine": "french", "recipeCategory": "easy, weekday", "keywords": "anchovy, lavash, onion, appetizer, healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 285, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "649 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 pound onions (2 medium onions), cut in half and sliced very thin across the grain", "Salt", "freshly ground pepper", "2 garlic cloves, minced", "1/2 bay leaf", "1 teaspoon fresh thyme leaves, or 1/2 teaspoon dried thyme", "1 1/2 teaspoons capers, drained, rinsed and finely chopped or puréed in a mortar and pestle", "1 9-by-12-inch lavash", "6 anchovy fillets, soaked in water for five minutes, drained, rinsed and dried on paper towels"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the olive oil in a large, heavy nonstick skillet over medium heat. Add the onions. Cook, stirring, until they begin to sizzle and soften, about three minutes. Add a generous pinch of salt and the garlic, bay leaf, thyme and pepper. Stir everything together, turn the heat to low, cover and cook slowly for 45 minutes to an hour, stirring often. The onions should melt down to a thick, golden brown, almost jammy consistency. Stir in the capers, and taste and adjust seasonings. If there is liquid in the pan, cook over medium heat, uncovered, until it evaporates."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 375 degrees, preferably with a baking stone in it. Place the lavash on a baking sheet. Spread the onions over the lavash in a thin, even layer. Cut the anchovies in half and arrange in X’s on top of the onions. Drizzle the remaining olive oil over the onions, and place the pizza in the oven. Bake 15 minutes until the edges of the crust are crisp and brown. Remove from the heat. Serve hot, warm or room temperature."}]}