{"@context": "http://schema.org", "@type": "Recipe", "name": "Warm Chickpea and Broccoli Salad", "description": "Serve this comforting salad as a main dish or as a side. The chick peas contribute a considerable amount of protein, manganese and folate to the dish.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": null, "totalTime": "PT2H15M", "recipeYield": "Serves 4 as a main dish, 6 as a side", "recipeCuisine": "", "recipeCategory": "dinner, weekday, salads and dressings", "keywords": "broccoli, dried chickpeas, red onion, healthy, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 175}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 261, "unsaturatedFatContent": "18 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "2 grams", "proteinContent": "7 grams", "saturatedFatContent": "5 grams", "sodiumContent": "391 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1/2 pound dried chickpeas (1 heaped cup), soaked for 6 hours or overnight in 1 quart water", "Salt, preferably kosher, to taste", "1/2 pound broccoli crowns, broken into florets", "1/2 small red onion, sliced (optional)", "1/4 cup chopped fresh parsley, or a combination of parsley and dill", "2 ounces shaved Parmesan", "1 tablespoon fresh lemon juice", "1 tablespoon red=wine vinegar, champagne vinegar or sherry vinegar", "1 teaspoon Dijon mustard", "1 small garlic clove, minced or put through a press", "Salt, preferably kosher, and freshly ground pepper", "6 tablespoons extra-virgin olive oil, or 4 tablespoons olive oil and 2 tablespoons buttermilk or plain low-fat or nonfat yogurt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the chick peas and their soaking liquid in a large saucepan and add enough water to cover by 2 inches. Add the bay leaf and bring to a boil. Reduce the heat, cover and simmer 1 hour. Add salt to taste and continue to simmer until the chick peas are tender, 30 minutes to an hour. Remove the bay leaf."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, place the red onions in a bowl and cover with cold water. Soak 5 minutes, then drain and rinse. Dry on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Make the dressing. Mix together the lemon juice, vinegar, mustard, garlic, salt, and pepper. Whisk in the olive oil (or the oil and buttermilk or yogurt). Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the beans are tender, add the broccoli. Turn up the heat, cover and simmer or steam (depending on how much water is left in the pan) 5 minutes, until the broccoli is tender but still bright. Drain the beans and broccoli and toss with the dressing. Add the herbs and the Parmesan, toss again, and serve warm."}], "link": "https://cooking.nytimes.com/recipes/1013994-warm-chickpea-and-broccoli-salad"}