{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet Greens Bruschetta With Poached Egg and Fontina", "description": "You’d think I’d get tired of greens. But this week while I was buying a nice bunch of beets at the market and another customer asked the vendor to cut off the greens from her beets, I jumped at the chance to get two bunches of free greens. I brought them home, stemmed and cleaned them thoroughly, then blanched them for a minute in salted boiling water. I enjoyed them all week. I made this bruschetta for dinner one night when I was home alone.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/10/25/science/28recipehealth/28recipehealth-articleLarge-v2.jpg", "totalTime": "PT15M", "recipeYield": "1 serving", "recipeCuisine": "", "recipeCategory": "dinner, for one", "keywords": "beet greens, country bread, eggs, healthy, high fiber, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 25}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 386, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "18 grams", "saturatedFatContent": "6 grams", "sodiumContent": "537 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 or 2 eggs", "1 thick slice (1 inch) or 2 thinner slices whole-grain country bread (about 2 ounces)", "1 garlic clove, cut in half", "2 teaspoons extra virgin olive oil", "1/2 cup blanched or steamed beet greens, coarsely chopped about 2 1/2 ounces", "Chopped fresh chives (optional)", "1/2 ounce fontina or Gruyère, thinly sliced or grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Poach the eggs first and set aside in a bowl of warm water."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly toast the bread, and rub with the cut side of the garlic clove. Finely chop or purée the remaining garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a small skillet and add the garlic. As soon as it smells fragrant, in about 30 seconds, stir in the beet greens. Stir together for about a minute, until greens are infused with the garlic and olive oil. Season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Top the toasted bread with the greens. Top the greens with the cheese. Place in a warm oven or a microwave and heat just until the cheese begins to melt. Remove from the heat. Blot the eggs dry if they are in warm water and place on top of the greens. Sprinkle with salt, pepper and chives, and enjoy."}]}