{"@context": "http://schema.org", "@type": "Recipe", "name": "Greek-Style Fish With Marinated Tomatoes", "description": "In summer I want a dish that tampers with the tomato-fish formula as little as possible. So instead of cooking the tomatoes, I marinate them, and instead of braising the fish, I grill or roast it. Neither fish nor tomatoes need much help.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/03/05/dining/greekfish-still/greekfish-still-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "greek", "recipeCategory": "dinner, easy, weekday", "keywords": "cherry tomatoes, fish, gluten-free, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 180}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 315, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "8 grams", "cholesterolContent": null, "fatContent": "21 grams", "fiberContent": "3 grams", "proteinContent": "24 grams", "saturatedFatContent": "4 grams", "sodiumContent": "573 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 cups cherry tomatoes, preferably Sun Gold, halved", "1/4 cup olive oil, or more as needed", "2 tablespoons white wine vinegar", "1 tablespoon minced fresh hot chili, like jalapeño, or more to taste", "1 tablespoon chopped fresh oregano, or 1 teaspoon dried", "4 cloves garlic, sliced, or more to taste", "Salt", "freshly ground black pepper", "1 large whole fish or 2 smaller ones (2 to 3 pounds total), like striped bass, rockfish or trout; preferably butterflied and boned, or simply gutted", "1 lemon, sliced", "4 to 6 sprigs fresh thyme"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 450 degrees or prepare grill; heat should be medium-high and rack about 4 inches from fire. Combine tomatoes, 2 tablespoons olive oil, vinegar, chili, oregano, a few slices of garlic, and a sprinkle of salt and pepper in a large bowl; let sit at room temperature for 20 to 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, using a sharp knife, make three or four diagonal, parallel slashes on each side of fish, just about down to the bone. Sprinkle inside of fish with salt and pepper, then stuff with remaining garlic, a layer of lemon slices and thyme sprigs. Rub outside of fish with remaining 2 tablespoons oil and sprinkle with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To roast, put fish in roasting pan and cook for about 20 minutes (cooking time will depend on fish size). If grilling, cook until firm enough to turn, 5 to 8 minutes. Turn and cook second side for 5 to 8 minutes. Whether roasting or grilling, fish is done when exterior is crisp and a thin-bladed knife passes easily through the flesh."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste tomato mixture and adjust seasoning, adding more oil if needed. Serve fish topped with tomatoes and their liquid."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Greek-Style Fish", "description": "Mark Bittman roasts a whole fish, a perfect Mediterranean-style, mid-summer dish.", "thumbnailUrl": "https://static01.nyt.com/images/2014/03/05/dining/greekfish-still/greekfish-still-mediumThreeByTwo440.jpg", "uploadDate": "2010-07-02T16:31:39.000Z", "duration": "PT3M39S"}}