{"@context": "http://schema.org", "@type": "Recipe", "name": "Grilled Mushrooms in Foil Packets", "description": "If you like to grill foods at a picnic, here&rsquo;s a great vegetarian option. Prepare these packets at home, then pack them, ready to grill, in your picnic basket. The recipe is inspired by one in Patricia Wells&rsquo;s cookbook &ldquo;Vegetable Harvest.” You can make this with cultivated or wild mushrooms.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/09/02/health/02recipehealth_600/02recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT25M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "gluten-free, healthy, vegan, vegetarian, herbs, mushroom, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 49}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 93, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "6 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "4 grams", "saturatedFatContent": "1 gram", "sodiumContent": "294 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["1 pound large mushrooms (regular, portobello, wild, oyster or a combination), cleaned, trimmed and sliced 1/2 inch thick", "2 tablespoons chopped fresh thyme, mint, sage, rosemary or marjoram", "2 to 4 garlic cloves, thinly sliced or chopped", "Salt", "freshly ground pepper to taste", "2 tablespoons extra virgin olive oil, plus additional for brushing foil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut four 12-by-12-inch squares of heavy aluminum foil, or eight squares of regular aluminum foil (stack two sheets each of the lighter foil to make four squares)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, combine the mushrooms, herbs, garlic, salt and pepper, and olive oil. Use a large spoon to blend the ingredients."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the dull side of the aluminum squares with olive oil, and divide the mushrooms among the four squares. Fold the squares over and crimp the edges together to form well-sealed packets. Place on a hot grill, and grill 20 to 25 minutes. Remove one packet from the grill, and place on a plate. Carefully open it to check for doneness. The mushrooms should be tender and juicy. Either transfer to plates or bowls (there will be lots of juice), or cut the packets and eat the mushrooms directly from them. Have lots of crusty bread on hand to sop up the juices."}], "link": "https://cooking.nytimes.com/recipes/1013237-grilled-mushrooms-in-foil-packets"}