{"@context": "http://schema.org", "@type": "Recipe", "name": "Majorcan Bread and Vegetable Soup", "description": "This thick soup is traditionally made with day-old bread, which soaks up much of the broth. Add a poached egg if you want an even more substantial meal.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/04/19/science/19recipehealth/19recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves six", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, one pot, soups and stews", "keywords": "country bread, vegetable stock, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 42}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 270, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "41 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "7 grams", "proteinContent": "9 grams", "saturatedFatContent": "1 gram", "sodiumContent": "1091 milligrams", "sugarContent": "9 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 tablespoons extra virgin olive oil", "1 bunch scallions, white and light green parts only, chopped", "1 small onion, chopped", "4 garlic cloves, minced, plus 1 additional clove, cut in half", "1 green pepper, cored, seeded and finely chopped", "2 tablespoons minced parsley", "1 (14-ounce) can chopped tomatoes with juice", "3/4 pound green cabbage, coarsely chopped", "Salt", "freshly ground pepper to taste", "5 cups water or vegetable stock", "1/2 pound spinach or Swiss chard, stemmed, washed and coarsely chopped", "12 slices country bread about 1/2 pound, stale or lightly toasted"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the oil over medium heat in a large ovenproof casserole. Add the scallions and onion. When they begin to soften, after about three minutes, stir in the minced garlic, green pepper and parsley. Stir together for a minute or two, then cover and turn heat to low. Cook for 15 minutes, stirring occasionally. Add the tomatoes, turn heat to medium-high and cook, stirring often, for five minutes. Add the cabbage, salt to taste and pepper. Cover, turn heat to low and cook slowly for 15 minutes. Add the water or stock, bring to a boil, reduce the heat, cover and simmer for 15 minutes. Stir in the spinach or chard, and bring back to a simmer. Cover and simmer for five to 10 minutes until the greens are very tender and the broth is fragrant. Taste and adjust seasonings."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Rub both sides of the bread with a cut clove of garlic. Place a layer of bread slices in a large earthenware casserole, and ladle on soup to cover. Make another layer of bread, and ladle on more soup to cover. Repeat with the remaining bread, and add the remaining soup. Drizzle with the remaining olive oil, transfer to the oven and bake 10 minutes, uncovered. Serve hot or warm."}]}