{"@context": "http://schema.org", "@type": "Recipe", "name": "Joël Robuchon's Lobster in Sauternes", "description": "The great Joël Robuchon had interesting things to say about lobsters, some of which may be taken with a grain of sel, for example his preference for Brittany lobsters, especially those from Finistère, over the American variety. But his tender description of their lovemaking when the female has molted while the male is still in his armor is touching, as is his account of the lobster's suicidal affection for the conger eel. This recipe for lobster in Sauternes is divine.", "author": {"@type": "Person", "name": "Jason Epstein"}, "image": null, "totalTime": "PT1H", "recipeYield": "2 main-course servings, 4 first-course", "recipeCuisine": "french", "recipeCategory": "", "keywords": "appetizer, main course, lobster, saffron, white wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "recipeIngredient": ["Salt", "2 lobsters, about 1 1/2 pounds each", "6 tablespoons unsalted butter", "8 miniature carrots, washed and trimmed", "3 cipollini onions, peeled and cut into thin half-rounds", "3 cups Sauternes", "1 cup orange juice", "1 thin slice of fresh ginger, peeled and julienned", "10 threads of saffron", "Freshly ground pepper", "2 tablespoons Italian parsley leaves, chopped", "Sea salt"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a stockpot just large enough to hold the lobsters, add 3 inches of water and 1 tablespoon of salt. When the water boils, add the lobster bodies, return water to a boil and poach for 3 minutes. Remove lobsters and twist off the legs and discard. Remove the large claws and knuckles and return them to the pot. Boil for 2 minutes, remove, rinse under cold water and when cool enough to handle crack the claws and knuckles and remove the meat. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a cocotte or a casserole with a lid just large enough to hold the lobsters snugly, melt 2 tablespoons of butter over medium-high heat. Cut the carrots into thin rounds and sauté them. Melt 2 more tablespoons of butter in the pan with the carrots. Add the onions and a pinch of salt and sauté until the onions are soft but not brown. Add the Sauternes, orange juice, the remaining butter, the ginger, the saffron, a pinch of salt and a few grinds of pepper. Bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lobster bodies, return the liquid to a boil, cover and boil for 4 minutes. Remove the pan from the heat and let it sit, covered, for 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the lobsters and split them in half lengthwise using a heavy chef's knife. Remove the meat and discard the shells."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the claw meat to the liquid and warm it over a low flame. Arrange the tail meat on plates, and distribute the claw meat equally. If necessary, reduce the liquid, season with sea salt and pepper and stir in parsley. Divide the reduction evenly among the lobsters."}]}