{"@context": "http://schema.org", "@type": "Recipe", "name": "Spicy Braised Sweet Potatoes", "description": "This recipe is adapted from one in “The Glorious Foods of Greece,” by Diane Kochilas. The sweet potatoes, seasoned with lots of paprika and cayenne, are simmered with onions on top of the stove.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/01/25/science/27recipehealth/27recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "", "keywords": "fall, gluten-free, healthy, vegan, vegetarian, red onion, sweet potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 52}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 169, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "4 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "383 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 large red onion, halved and sliced thin across the grain", "Salt", "2 garlic cloves, minced", "1 tablespoon plus 1 teaspoon sweet paprika", "1/2 teaspoon cayenne (more to taste)", "2 tablespoons tomato paste", "4 large sweet potatoes about 3 pounds, peeled and quartered or cut in sixths if fat", "1/2 cup dry white wine", "Water as needed"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy lidded skillet or Dutch oven. Add the onion and a generous pinch of salt. Cook, stirring, until tender, about 5 minutes. Add the garlic and cook, stirring, until fragrant, 30 seconds to a minute. Stir in the paprika, cayenne and tomato paste, and cook, stirring, until the tomato paste turns a rusty color, about one minute."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the sweet potatoes, and stir for about a minute until coated with the onion and spice mixture. Add the white wine, enough water to cover the sweet potatoes halfway (1 1/2 to 2 cups), and salt to taste. Bring to a boil, lower the heat to medium-low, cover and simmer 30 to 40 minutes until the potatoes are tender and the sauce thick. Taste and adjust salt. If the sauce is still watery once the sweet potatoes are thoroughly cooked, do not adjust salt right away. Carefully remove the sweet potatoes to a platter using tongs. Turn up the heat, and reduce the sauce until thick. Adjust salt, and pour the sauce over the sweet potatoes. Remove from the heat, and let stand for 5 to 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1013448-spicy-braised-sweet-potatoes"}