{"@context": "http://schema.org", "@type": "Recipe", "name": "Fresh Fava Bean and Shrimp Risotto", "description": "This luxurious risotto is a cinch to make. Use the plumpest, juiciest shrimp you can find.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/06/14/science/16recipehealth/16recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves four generously", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday", "keywords": "appetizer, main course, fava beans, shrimp, gluten-free, healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 736, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "114 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "20 grams", "proteinContent": "45 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1667 milligrams", "sugarContent": "26 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds fava beans, shelled and skinned", "1 pound medium shrimp, in the shell large shrimp wil work, but not giant ones", "1 quart chicken stock, vegetable stock or water", "Salt to taste", "2 tablespoons extra virgin olive oil, or 1 tablespoon unsalted butter and 1 tablespoon extra virgin olive oil", "1/2 cup finely chopped onion or leek", "1 1/2 cups arborio or carnaroli rice", "2 large garlic cloves, green shoots removed, minced", "1/2 cup dry white wine", "2 tablespoons chopped fresh flat-leaf parsley", "Freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Prepare the fava beans, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Shell the shrimp and de-vein if necessary. Retain the shells. Salt the shrimp lightly, and set aside in a bowl (in the refrigerator, if you won’t be making and serving the risotto right away). Rinse the shells, and combine them with five cups water in a medium saucepan. Bring to a boil, skim off foam, reduce the heat to low and simmer partially covered for 30 minutes. Strain and add to the chicken stock or water. Taste and add enough salt to make a well-seasoned broth. Bring to a simmer in a saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large nonstick frying pan or a large, wide saucepan. Add the onion (or leek). Cook, stirring, until it softens, three to five minutes. Add the rice and the garlic. Cook, stirring, until the grains of rice are separate and beginning to crackle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine, and cook, stirring, over medium heat. The wine should bubble but not too quickly. When it has just about evaporated, stir in a ladleful or two of the simmering stock, just enough to cover the rice. The stock should bubble slowly. Cook, stirring often, until it is almost absorbed. Add another couple of ladles of the stock. Continue to cook for 20 minutes, stirring not too fast and not too slowly, and adding more stock whenever the rice is almost dry."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste a bit of the rice. It should be slightly al dente. Stir in more stock to cover, and add the favas and the shrimp. Cook, stirring, for another five to 10 minutes until the shrimp are pink and cooked through but still moist (this will depend on the size of the shrimp) and the favas are bright. Stir in the parsley and another small ladle of stock. Remove from the heat, add pepper, stir for a few seconds and serve."}], "link": "https://cooking.nytimes.com/recipes/1013639-fresh-fava-bean-and-shrimp-risotto"}