{"@context": "http://schema.org", "@type": "Recipe", "name": "Frittata With Zucchini, Goat Cheese and Dill", "description": "Goat cheese adds creaminess and rich flavor to this delicate frittata.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/03/22/health/22healthyrecipe1/22healthyrecipe1-articleLarge-v2.jpg", "totalTime": "PT40M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "breakfast, brunch, dinner, easy, weekday", "keywords": "eggs, zucchini, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 307}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 178, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "1 gram", "proteinContent": "11 grams", "saturatedFatContent": "5 grams", "sodiumContent": "375 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 tablespoons extra virgin olive oil", "1 pound zucchini, grated (about 4 cups)", "2 garlic cloves, minced", "Salt", "freshly ground pepper to taste", "8 eggs", "2 ounces goat cheese, crumbled (about 1/2 cup)", "1/4 cup chopped fresh dill"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 1 tablespoon of the oil over medium heat in a 10-inch heavy nonstick skillet. Add the zucchini. Cook, stirring, until the zucchini begins to wilt, about two minutes. Stir in the garlic. Cook for another minute or until the zucchini has just wilted — it should still be bright green. Season to taste with salt and pepper, and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Beat the eggs in a large bowl with the goat cheese. Add salt and pepper, and stir in the zucchini and the dill."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Clean and dry the pan, and return to the burner, set on medium-high. Heat the remaining tablespoon of olive oil in the skillet. Drop a bit of egg into the pan; if it sizzles and cooks at once, the pan is ready. Pour in the egg mixture. Tilt the pan to distribute the eggs and filling evenly over the surface. Shake the pan gently, tilting it slightly with one hand while lifting up the edges of the frittata with the spatula in your other hand, to let the eggs run underneath during the first few minutes of cooking."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat to low, cover and cook 10 minutes, shaking the pan gently every once in a while. From time to time, remove the lid, tilt the pan and loosen the bottom of the frittata with a wooden spatula so that it doesn’t burn. The bottom should have a golden color. The eggs should be just about set; cook a few minutes longer if they’re not."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat the broiler. Uncover the pan and place under the broiler, not too close to the heat, for one to three minutes, watching very carefully to make sure the top doesn’t burn (at most, it should brown very slightly and puff under the broiler). Remove from the heat, and shake the pan to make sure the frittata isn’t sticking. Allow it to cool for at least five minutes and for as long as 15 minutes. Loosen the edges with a wooden or plastic spatula. Carefully slide from the pan onto a large round platter. Cut into wedges or into smaller bite-size diamonds. Serve hot, warm, at room temperature or cold."}]}