{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Albacore and Peaches With Quinoa, Haricots Verts and Pistou", "description": "", "author": {"@type": "Person", "name": "Laura M. Holson"}, "image": null, "totalTime": "PT45M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "albacore tuna, fish, peach, gluten-free, main course, summer", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 915, "unsaturatedFatContent": "56 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "67 grams", "fiberContent": "5 grams", "proteinContent": "51 grams", "saturatedFatContent": "8 grams", "sodiumContent": "961 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup quinoa", "2 tablespoons extra virgin olive oil", "Salt", "2 cups haricots verts", "2 cups firmly packed fresh basil leaves", "1 cup firmly packed fresh parsley leaves", "1/4 cup firmly packed fresh tarragon leaves", "2 cloves garlic, minced", "3/4 cup plus 1 tablespoon grapeseed oil", "3 to 4 tablespoons fresh lemon juice, or as needed", "2 peaches, halved and pitted", "1 1/2 pounds fresh albacore tuna", "Black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium saucepan, combine quinoa with 2 cups water. Bring to a boil, then reduce heat to low and simmer, covered, until all the water is absorbed, 10 to 15 minutes. Remove from heat, add olive oil, and toss to mix. Cover and keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large pot of lightly salted water over high heat to bring to a boil. Set aside a large bowl filled with water and ice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add haricots verts to boiling water and blanch just until bright green, about 30 seconds. Using a slotted spoon, scoop out beans (reserving boiling water) and transfer to ice water to chill. Using the slotted spoon, transfer beans to a colander (reserving ice water) and drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add basil, parsley and tarragon to boiling water. Blanch 2 minutes, then drain and transfer to ice water to chill. Drain again. Place herbs in a kitchen towel and roll gently to remove excess water. Chop coarsely and place in a blender. Add garlic and 1/2 cup grapeseed oil. Blend until very smooth. Place haricot verts in a bowl, and toss with 2 tablespoons of the herb purée (known as pistou) and lemon juice to taste, reserving remaining pistou and juice."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large sauté pan over medium heat, and add 1/4 cup grapeseed oil. Sear peaches, cut sides down, until caramelized and golden brown, about 3 minutes, then remove from heat and set aside. Clean pan and return to high heat. Add remaining 1 tablespoon grapeseed oil. Season tuna with salt and pepper to taste. Add to pan and sear sides and edges so the center remains raw, 30 seconds to 1 minute each side, pressing tuna against side of pan to sear edges. Remove from heat, slice thinly, and season with lemon juice and salt to taste."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, spread quinoa across 4 serving plates. Top with haricot verts mixture. Arrange peach halves on top. Fan the sliced tuna on the plates, and garnish with pistou as desired."}], "link": "https://cooking.nytimes.com/recipes/1013272-seared-albacore-and-peaches-with-quinoa-haricots-verts-and-pistou"}