{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Walnuts and Anchovies", "description": "This is a pared-down version of a recipe that I came across in Nancy Jenkins’s informative book on Southern Italian food, “Cucina del Sole.” The dish is traditionally part of a meatless Christmas Eve dinner. If you can find freshly harvested walnuts, they’ll make this pasta even better.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/12/07/science/07recipehealth/07recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "Serves four", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "anchovy fillets, spaghetti, walnut, healthy, main course, winter", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 39}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 542, "unsaturatedFatContent": "20 grams", "carbohydrateContent": "67 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "4 grams", "proteinContent": "15 grams", "saturatedFatContent": "3 grams", "sodiumContent": "155 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/2 cup shelled walnuts (2 ounces)", "1/4 cup extra virgin olive oil", "3 garlic cloves, minced", "4 anchovy fillets, coarsely chopped", "3/4 pound spaghetti", "1/4 cup minced flat-leaf parsley", "freshly ground pepper", "1/4 cup freshly grated pecorino (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Begin heating a large pot of water over high heat. Meanwhile, lightly toast the walnuts on a baking sheet in a 375-degree oven for just a few minutes until fragrant, or in a pan over medium-high heat, stirring constantly. When the walnuts smell like they’re beginning to toast, remove them from the heat and transfer to a clean dish towel. Wrap them in the towel, and rub between your hands to remove some of the papery shells. Chop the nuts medium-fine, and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, heavy skillet or saucepan large enough to accommodate the cooked spaghetti, heat the oil over medium heat and add the garlic. Cook, stirring, until it begins to sizzle, and add the anchovies. Cook, mashing the anchovies with the back of your spoon or with a fork, for about 30 seconds until they begin to fall apart and melt into the oil. Add the walnuts, stir together for about a minute and remove from the heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the water comes to a boil, salt generously and add the spaghetti. Cook al dente, following the timing recommendations on the package but checking about a minute before the indicated time. When the pasta is almost done, add 1/4 cup of the pasta water to the pan with the walnuts and anchovies, and reheat over medium heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the pasta is ready, drain and toss with the walnut and anchovy mixture. Add the parsley, adjust salt if necessary and add pepper. Serve, passing the pecorino at the table."}]}