{"@context": "http://schema.org", "@type": "Recipe", "name": "Buttermilk-Brined Fried Chicken With Sage", "description": "There is no true definition of buttermilk, according to Anne Mendelson, the author of “Milk.” Originally it was the liquid that separated from churned butter. In warm climates, like the American South or India, it refers to sour milk, since unrefrigerated milk turns within hours. Today most buttermilk is made from milk to which cultures of lactic-acid bacteria are added.", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "P1DT10M", "recipeYield": "Serves 8", "recipeCuisine": "southern", "recipeCategory": "dinner, quick", "keywords": "buttermilk, chicken, sage, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 3, "ratingCount": 5}, "recipeIngredient": ["3 cups cultured buttermilk (see note)", "1/4 cup kosher salt", "1/4 cup hot sauce, like Frank's", "1/4 cup Worcestershire sauce", "10 sage leaves, thinly sliced", "2 chickens, each cut into 8 pieces", "4 cups flour", "Kosher salt", "3 eggs", "4 cups buttermilk", "3 cups finely ground white or yellow cornmeal", "20 leaves sage, minced", "1/4 cup dry mustard", "2 tablespoons paprika", "1/2 cup dried thyme", "About 2 quarts vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Twenty-four hours before cooking, prepare the brine: In a large bowl, whisk 1/4 cup plus 2 tablespoons water with the remaining brine ingredients until the salt has dissolved. Submerge the chicken pieces in the brine. Cover and refrigerate. (To save space, you can also put the chicken and brine in a large sealable bag.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to cook, prepare the breading by whisking together 2 cups of the flour and 2 teaspoons kosher salt in a medium bowl. In a separate medium bowl, whisk the eggs to break them up, then whisk in the buttermilk. In a large bowl, whisk together the remaining 2 cups of flour, the cornmeal, sage, mustard, paprika, thyme and 1 tablespoon kosher salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dredge the chicken in the plain flour, then in the buttermilk, then in the cornmeal mixture, taking care not to let the breading get too thick. Let sit at room temperature for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, set a large 12-to-14-inch cast-iron skillet over medium-high heat and fill with oil to 11/2 inches below the top. Heat until the oil reaches 325 degrees. Working in batches, fry the chicken pieces, turning them 3 or 4 times to create an even, dark-golden crust. Cook until the internal temperature reaches 160 degrees, about 10 minutes. (Place a splatter guard over the pan as you fry.)"}]}