{"@context": "http://schema.org", "@type": "Recipe", "name": "Purée of Winter Vegetable Soup", "description": "Living in France, I was always impressed by the bags of mixed vegetables, called soupe, sold in farmers’ markets and supermarkets alike. The bags usually included an onion, carrots and celery, a leek, a turnip or two and a bouquet garni consisting of a bay leaf, a sprig of thyme and another of parsley. I’ve added root vegetables to this ginger-scented soup, which is inspired by the many simple suppers I enjoyed in the homes of French friends.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/01/19/science/18recipehealth/18recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves six", "recipeCuisine": "", "recipeCategory": "dinner, weekday, soups and stews", "keywords": "carrot, leek, fall, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 56}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 131, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "26 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "6 grams", "proteinContent": "3 grams", "saturatedFatContent": "0 grams", "sodiumContent": "1070 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["1 tablespoon extra virgin olive oil", "1 medium onion, chopped", "1/2 pound leeks 1 large or 2 small, white and light green parts only, cleaned well and sliced", "1/2 pound carrots 2 large, peeled and sliced", "1/2 pound kohlrabi, trimmed, peeled and diced", "1/2 pound turnips, peeled and diced", "6 ounces potatoes 2 medium, peeled and diced", "1 1/2 quarts water, chicken stock or vegetable stock (see note)", "2 fat slices ginger, peeled", "1 bay leaf", "A couple of sprigs each thyme and parsley", "12 peppercorns", "Salt", "freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy soup pot or Dutch oven. Add the onion. Cook, stirring, until it begins to soften, about three minutes. Add the leeks and a generous pinch of salt. Cook, stirring often, until tender but not browned, about five more minutes. Add the carrots, kohlrabi, turnips, potatoes and water or stock. Bring to a boil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, wrap the ginger, bay leaf, thyme, parsley and peppercorns in cheesecloth. Tie them up to make a bouquet garni, and add to the pot. Add salt to taste (about 2 teaspoons), reduce the heat, cover and simmer one hour. Remove the cheesecloth bag, and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blend the soup until smooth with an immersion blender or in batches in a regular blender. (Do not put the top on tight; cover the top with a towel to prevent hot splashes.) Pour the soup through a strainer into a bowl; press the soup through the strainer with the back of a ladle or with a pestle. Return to the pot and heat through. Add lots of freshly ground pepper, taste and adjust salt, and serve."}], "link": "https://cooking.nytimes.com/recipes/1013441-puree-of-winter-vegetable-soup"}