{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp Risotto With Peas", "description": "Shrimp shells are used here to make a subtle shellfish broth for the risotto. Make sure you don’t overcook the shrimp; they will take only four to five minutes to cook, and the contrast of their succulent texture against the chewy rice will be lost if the shrimp become rubbery.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/01/20/health/20recipehealth_600/20recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 4", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, one pot", "keywords": "appetizer, main course, arborio rice, peas, shrimp, dairy-free, gluten-free, healthy, low sugar, nut-free", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 195}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 560, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "78 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "29 grams", "saturatedFatContent": "2 grams", "sodiumContent": "1216 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound medium shrimp, in the shell", "1 quart chicken stock or water", "Salt to taste", "2 tablespoons extra virgin olive oil", "1/2 cup finely chopped onion", "1 1/2 cups arborio or carnaroli rice", "2 large garlic cloves, green shoots removed, minced", "1/2 cup dry white wine", "A generous pinch of saffron (optional)", "1 cup thawed frozen peas, or fresh peas steamed for five minutes", "2 tablespoons chopped fresh flat-leaf parsley", "Freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Shell the shrimp and de-vein if necessary. Salt them lightly, and set aside in a bowl (in the refrigerator, if you won’t be making and serving the risotto right away). Rinse the shells, and combine them with 5 cups of water in a medium saucepan. Bring to a boil, skim off foam, reduce the heat to low and simmer partly covered for 30 minutes. Strain and add to the chicken stock or water. Taste, add enough salt to make a well seasoned broth and bring to a simmer in a saucepan."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium heat in a large nonstick frying pan or a large, wide saucepan. Add the onion. Cook, stirring, until the onion softens, three to five minutes, and then add the rice and the garlic. Cook, stirring, until the grains of rice are separate and beginning to crackle."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in the wine, and cook over medium heat, stirring. The wine should bubble, but not too quickly. You want some of the flavor to cook into the rice before it evaporates. When the wine has just about evaporated, stir in a ladleful or two of the simmering stock, enough to just cover the rice. The stock should bubble slowly. Cook, stirring often, until it is almost absorbed. Add another couple of ladles of the stock. Crush the saffron threads between your fingers and stir in. Continue to cook, stirring often — not too fast and not too slowly, adding more stock when the rice is almost dry — for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Taste a bit of the rice. It should taste chewy but not hard in the middle. Continue adding simmering stock and stirring until the rice reaches this al dente stage. Stir in more stock to cover, and add the peas and the shrimp. Cook, stirring, for another four to five minutes, until the shrimp are pink and cooked through but still moist and the peas are bright. Stir in the parsley and another small ladle of stock, remove from the heat, add pepper, stir for a few seconds and serve."}]}