{"@context": "http://schema.org", "@type": "Recipe", "name": "Broiled Sardines With Lemon and Thyme", "description": "This is a dish that is both humble and elegant, full of flavor, with the glistening silver skin of the sardines crisping in the heat. It’s also not fussy in the slightest, which means it could easily serve as the centerpiece of a light weeknight meal, with a large bowl of greens and crusty bread. First, heat the broiler (and with it, a sturdy pan), then stuff the sardines with whole thyme sprigs and sliced lemon. (Seasoned bread crumbs would be another sound addition.) Place the sardines in the pan with a generous slick of olive oil and run them under the broiler for about 5 minutes, without flipping, until the flesh is opaque and the skin is browned. Serve them whole, laid out on a platter, garnished with extra thyme branches and other chopped herbs if you have them. To eat, use a fork to tease away the white meat from the top of the skeleton, then carefully remove the intact skeleton to reveal the bottom filet. ", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/02/24/dining/recipes-broiledsardines/recipes-broiledsardines-mediumThreeByTwo440.jpg", "totalTime": "PT20M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "appetizer, main course, gluten-free, lemon, sardines, thyme", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 141}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 314, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "0 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "0 grams", "proteinContent": "35 grams", "saturatedFatContent": "4 grams", "sodiumContent": "420 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["1 lemon, thinly sliced, plus lemon wedges for serving", "12 or more fresh thyme sprigs, plus chopped fresh thyme for garnish", "1 1/2 pounds sardines 8 to 12 large, gutted, with heads on", "Salt", "Black pepper", "3 tablespoons extra virgin olive oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the broiler until hot. Move the oven rack as close to the heat source as possible (four to two inches away). Heat a sturdy pan for about 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wrap a lemon slice around each thyme sprig and stuff inside the sardines; sprinkle with salt and pepper. When the pan is hot, remove it from the oven and pour in half of the olive oil, then put the sardines in the pan and drizzle with the remaining oil. Broil for 4 to 5 minutes, then check the sardines; they’re ready when they’re opaque, the tip of a knife flakes the thickest part easily, and the outside is nicely browned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, carefully remove the sardines with a spatula, sprinkle with more herbs if you like, and pour the pan juices over all. Serve with lemon wedges."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Broiled Sardines With Lemon and Thyme", "description": "Mark Bittman makes fresh sardines, restaurant-style, with crisp skin and smoky flavor. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/02/24/dining/recipes-broiledsardines/recipes-broiledsardines-mediumThreeByTwo440.jpg", "uploadDate": "2010-12-24T16:54:13.000Z", "duration": "PT2M6S"}, "link": "https://cooking.nytimes.com/recipes/1013405-broiled-sardines-with-lemon-and-thyme"}