{"@context": "http://schema.org", "@type": "Recipe", "name": "Butternut Squash and Mushroom Wellington", "description": "Butternut squash coated in maple syrup, and soft, earthy mushrooms are sautéed then wrapped in a crisp, flaky puff pastry in this recipe. It's softly sweet and bursting with autumnal flavors, with goat cheese providing some soft, tangy creaminess. Try it on a chilly night, paired with a glass of white wine.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/18/dining/Butternut-Squash-and-Mushroom-Wellington/Butternut-Squash-and-Mushroom-Wellington--articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "6 to 8 servings", "recipeCuisine": "british", "recipeCategory": "dinner", "keywords": "butternut squash, mushroom, puff pastry, main course, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 209}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 473, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "31 grams", "fiberContent": "3 grams", "proteinContent": "11 grams", "saturatedFatContent": "12 grams", "sodiumContent": "369 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["4 tablespoons butter", "1 small butternut squash (1 1/4 pounds), peeled, seeded and cut into 1/2-inch cubes", "1 teaspoon maple syrup", "1/2 teaspoon chopped fresh thyme", "1/8 teaspoon smoked sweet paprika or regular paprika", "1/2 teaspoon kosher salt, or more to taste", "2 garlic cloves, finely chopped", "1 large shallot, finely chopped", "3/4 pound cremini mushrooms, trimmed and roughly chopped", "1/3 cup dry white wine", "1/4 teaspoon ground black pepper", "2 tablespoons chopped parsley", "Flour", "1 (14-to-16-ounce) package puff pastry", "1 cup crumbled goat cheese", "1 egg, whisked with 1/2 teaspoon water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 400 degrees and line a large baking sheet with parchment."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a very large skillet over high heat, melt 2 tablespoons butter. Add the squash in a single layer and cook, undisturbed, for 4 minutes. (If squash won’t fit in a single layer, cook it in batches). Stir and continue to cook until squash is golden, 7 to 10 minutes more. Stir in the syrup, thyme, paprika and 1/4 teaspoon salt; cook one minute. Scrape mixture into a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn the heat down to medium and melt the remaining butter in the skillet. Stir in garlic and shallot; cook 1 to 2 minutes. Add the mushrooms and remaining salt. Cook until mushrooms are soft and their juices evaporate, about 10 minutes. Stir in the wine and cook until the mixture is dry, about 5 minutes. Stir in the pepper and parsley. Taste and add more salt if needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "On a lightly floured surface, unwrap the puff pastry. Cut into 2 5-by-15-inch rectangles. Spread mushrooms on each pastry rectangle leaving 1/4-inch border. Spoon the cheese crumbles over the mushrooms. Then spoon the squash over the cheese, leaving a 1 1/2-inch border (it will look like a stripe of squash lying on a bed of cheese and mushrooms)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Brush the exposed borders of dough on each rectangle with the egg wash. Fold the long sides up to meet in the middle and pinch together to seal; pinch the ends, too. Transfer the pastries to the baking sheet and turn them over so that the seam is face down. Brush the tops with more egg wash. Bake until they are puffed golden, and firm to the touch, about 30 minutes. Let cool for 10 minutes, slice and serve."}], "link": "https://cooking.nytimes.com/recipes/1013339-butternut-squash-and-mushroom-wellington"}