{"@context": "http://schema.org", "@type": "Recipe", "name": "Pear and Red Wine Sorbet", "description": "This sorbet might sound unusual, but it's a sophisticated (and delicious) twist on the standard one-note fruit sorbet: the sweetness of the pears and the acidity of the red wine balance each another out, a sprinkle of black pepper adds bite and a baseline of cinnamon and vanilla warm it all up. It couldn't be easier to make (sauté, blend and freeze) and it's gorgeous to boot.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/04/05/business/08recipehealth/08recipehealth-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "One quart", "recipeCuisine": "", "recipeCategory": "ice creams and sorbets", "keywords": "dessert, fall, winter, gluten-free, healthy, vegan, vegetarian, pear, red wine", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 38}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 67, "unsaturatedFatContent": "0 grams", "carbohydrateContent": "14 grams", "cholesterolContent": null, "fatContent": "0 grams", "fiberContent": "2 grams", "proteinContent": "0 grams", "saturatedFatContent": "0 grams", "sodiumContent": "2 milligrams", "sugarContent": "11 grams", "transFatContent": null}, "recipeIngredient": ["2 1/2 pounds ripe pears (4 medium to large pears, like Bartlett pears)", "1/2 cup sugar, preferably organic fair-trade", "1 1/2 cups red wine", "1 1/2 cups water", "1 2- or 3-inch cinnamon stick", "1/2 teaspoon vanilla extract", "Pinch of freshly ground black pepper", "2 tablespoons fresh lemon juice"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel, core and quarter the pears. Place them in a medium saucepan with the sugar, red wine, water, cinnamon stick and vanilla extract. Bring to a boil, reduce the heat and simmer, uncovered, until the pears are soft and translucent. This will take 15 to 20 minutes if the pears are ripe and soft to begin with, or about 30 minutes if they’re somewhat hard. Add the pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Using tongs, remove the pears to a bowl. Remove the cinnamon stick from the poaching liquid, and discard. Turn up the heat, and reduce until the mixture has the consistency of a thin syrup. (This step may be unnecessary, depending on how long you cooked the pears and how juicy they were.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the pears, in batches, in a blender, or place all of them in a food processor fitted with the steel blade. Purée until smooth. Slowly add the poaching liquid and the lemon juice, and blend together. Transfer to a bowl, and chill. Meanwhile, place a 1-quart container in the freezer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Freeze in an ice cream maker following the manufacturer’s instructions. Transfer to the chilled container, and freeze for at least two hours before serving. If frozen solid, allow to soften in the refrigerator for 15 to 30 minutes."}], "link": "https://cooking.nytimes.com/recipes/1013546-pear-and-red-wine-sorbet"}