{"@context": "http://schema.org", "@type": "Recipe", "name": "Lamb and Rice Stuffed Cabbage With Tomato Sauce", "description": "", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/02/27/dining/recipes-stuffedcabbagewithlamb/recipes-stuffedcabbagewithlamb-mediumThreeByTwo440.jpg", "totalTime": "PT1H30M", "recipeYield": "4 to 6 servings", "recipeCuisine": "", "recipeCategory": "dinner, project", "keywords": "cabbage, ground lamb, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 68}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 417, "unsaturatedFatContent": "14 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "22 grams", "fiberContent": "6 grams", "proteinContent": "15 grams", "saturatedFatContent": "7 grams", "sodiumContent": "784 milligrams", "sugarContent": "10 grams", "transFatContent": null}, "recipeIngredient": ["Salt", "1 large head Savoy cabbage, separated into leaves", "4 tablespoons olive oil", "2 medium onions, chopped", "3 tablespoons minced garlic", "1 medium carrot, shredded", "1 medium parsnip, shredded", "2/3 to 3/4 pound ground lamb", "3/4 cup short-grain rice", "Salt", "freshly ground black pepper", "One 28-ounce can crushed tomatoes", "1/4 to 1/2 teaspoon crushed red pepper, or more to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil and salt it. Add the cabbage leaves to the boiling water a few at a time and cook for 30 seconds to one minute, or until they’re just pliable. Carefully remove the leaves from the water with a slotted spoon and transfer to a colander; rinse with cold water. Repeat with the remaining leaves. Gently squeeze the leaves to remove most of the excess water, leaving them just damp enough so they will stick together when rolled."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put 2 tablespoons of the olive oil in a large pot or Dutch oven over medium-high heat; when hot, add half the chopped onion and one tablespoon of the garlic, along with the carrot and the parsnip, and cook until soft, about 5 minutes. Sprinkle with salt and pepper and transfer to a bowl along with the lamb and rice. Mix until just combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Wipe the pan, add the remaining 2 tablespoons olive oil and turn the heat to medium-high. When the oil is hot, add the remaining onion and garlic and cook until soft, 1 to 2 minutes. Add the tomatoes, red pepper and a good sprinkling of salt; cook over medium-low heat while you prepare the cabbage leaves."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut the cabbage leaves in half by running a sharp knife along each side of the stem, removing the stem in the process; trim the top and bottom so you’re left with a large rectangle. Lay a leaf on a work surface with the wide edge facing you. Put a couple tablespoons of the meat mixture in the middle of the leaf, fold in the two sides of the leaf and roll it up as you would a burrito. Repeat with the remaining leaves and filling."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the cabbage rolls, seam side down, to the pot of sauce. Cover and cook over medium-low heat, stirring the sauce occasionally and adding a tablespoon or two of water if the sauce becomes too thick, until the meat and rice are both fully cooked (cut into a roll to check; the rice should be tender and the meat no longer pink), 30 to 45 minutes. Serve immediately."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Lamb and Rice Stuffed Cabbage", "description": "Mark Bittman rolls cabbage leaves with lamb and rice, and serves it with tomato sauce. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/02/27/dining/recipes-stuffedcabbagewithlamb/recipes-stuffedcabbagewithlamb-mediumThreeByTwo440.jpg", "uploadDate": "2010-11-11T16:48:39.000Z", "duration": "PT4M18S"}}