{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Cooked Goat Shoulder Moorish Style", "description": "This recipe adapts beautifully to lamb shoulder.", "author": {"@type": "Person", "name": "Mike Emanuel"}, "image": null, "totalTime": "PT5H30M", "recipeYield": "Serves 4", "recipeCuisine": "moroccan", "recipeCategory": "dinner", "keywords": "goat shoulder, harissa, vegetables, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 663, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "18 grams", "cholesterolContent": null, "fatContent": "18 grams", "fiberContent": "3 grams", "proteinContent": "97 grams", "saturatedFatContent": "4 grams", "sodiumContent": "1691 milligrams", "sugarContent": "9 grams", "transFatContent": null}, "recipeIngredient": ["1 bone-in goat shoulder, about 4 pounds look for the meaty Boer breed", "Salt", "freshly ground black pepper", "½ cup harissa (<a href=\"http://cooking.nytimes.com/recipes/1013723-harissa\">see recipe</a>, or use store-bought)", "1 large onion, peeled and sliced", "2 carrots, peeled and sliced", "4 garlic cloves, smashed", "2 bay leaves", "1 teaspoon coriander seeds or a few sprigs fresh cilantro", "1 cinnamon stick", "2 tablespoons extra-virgin olive oil", "2 cups low-sodium chicken stock or water", "½ cup white wine", "1 tablespoon honey", "½ Moroccan preserved lemon, rinsed and inner flesh removed, finely chopped", "2 sprigs mint leaves, roughly torn"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "The evening before you plan to cook the shoulder, season it generously with salt, pepper and ¼ cup of the harissa. Refrigerate overnight and start to bring it to room temperature two hours before you plan to cook it."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat oven to 350 degrees. In a large Dutch oven set over medium heat, cook the onion, carrots, garlic and spices for a few minutes in the olive oil until fragrant and slightly browned. If using cilantro sprigs, tuck them into the vegetables after they’ve cooked. Lay the shoulder over the vegetables."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, bring the stock, wine and honey to a simmer and pour it over the goat. Cook uncovered in the oven for about 1 hour, adjusting the temperature so the juices maintain a very gentle simmer. Add a little more broth or water if it gets too low. Carefully turn the shoulder over and return to the oven. After 30 minutes, turn again and repeat every 30 minutes until the meat is very tender and nearly falling off the bone. Total cooking time will be 2½ to 3 hours. The slower it cooks, the more meltingly tender it will be. Cool in its juices."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the shoulder and strain the liquid into a bowl, pushing some of the solids through the strainer. Let the liquid settle for a few minutes, then skim off all of the fat. This is made easier if you refrigerate the juices for a half hour or so, partially solidifying the fat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To serve, gently reheat the meat in the juices and stir in the preserved lemon and sprinkle with mint. Serve with more harissa, yogurt and aromatic baked rice (recipe follows)."}], "link": "https://cooking.nytimes.com/recipes/1013722-slow-cooked-goat-shoulder-moorish-style"}