{"@context": "http://schema.org", "@type": "Recipe", "name": "Turkish Bean and Herb Salad", "description": "The authentic version of this sweet, fragrant bean salad requires about three times as much olive oil. In Turkey, borlotti beans or red beans would be used; I prefer pink beans, available in many supermarkets. The salad is adapted from a recipe by the cookbook author Clifford Wright.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/09/01/health/01recipehealth_600/01recipehealth_600-articleLarge-v3.jpg", "totalTime": "PT2H30M", "recipeYield": "Serves eight", "recipeCuisine": "turkish", "recipeCategory": "salads and dressings", "keywords": "gluten-free, healthy, high fiber, vegan, vegetarian, pink beans, tomato", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 12}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 282, "unsaturatedFatContent": "6 grams", "carbohydrateContent": "42 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "16 grams", "proteinContent": "15 grams", "saturatedFatContent": "1 gram", "sodiumContent": "386 milligrams", "sugarContent": "5 grams", "transFatContent": null}, "recipeIngredient": ["1 pound pink beans, borlotti beans, cranberry beans, kidney beans or pintos, washed, picked over, and soaked for at least four hours in 2 quarts water", "1 yellow onion, cut in half across the equator", "8 garlic cloves, 2 lightly crushed, the rest coarsely chopped or sliced", "1 bay leaf", "Salt to taste", "1/4 cup extra virgin olive oil", "1 large red onion, cut in half lengthwise, then in thin slices across the grain", "1 teaspoon sugar", "1 pound tomatoes", "1 bunch fresh dill, stemmed and coarsely chopped (about 1/2 cup)", "Leaves from 1 bunch flat-leaf parsley, finely chopped (about 1 cup)", "2 tablespoons fresh lemon juice (optional), plus 2 lemons, cut into wedges, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the beans and their soaking water with the two crushed garlic cloves, the halved yellow onion and the bay leaf. Bring to a boil. Reduce the heat, cover and simmer one hour. Add salt to taste, and continue to simmer until tender but intact, about 30 minutes. Remove from the heat. Discard the onion halves, garlic cloves and bay leaf, and carefully drain the beans through a colander or strainer set over a bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, cut the tomatoes in half across the equator. Set a strainer over a bowl, and squeeze out the seeds from the tomatoes into the strainer. Rub the gelatinous seed sacs against the strainer to extract the juice, and discard the seeds. Grate the tomatoes against the large holes of a box grater set in a wide bowl, and discard the skins. Add the juice from the strained seeds to the grated tomatoes, and stir together."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil in a large, heavy casserole or Dutch oven over medium heat, and add the onion. Cook, stirring often, until very soft but not browned, 8 to 10 minutes. Add a generous pinch of salt and the garlic, and continue to cook, stirring, until the garlic is fragrant, 30 seconds to a minute. Stir in the sugar, half the tomatoes and half the herbs. Reduce the heat to low, and cook, stirring often, until the mixture has cooked down to a fragrant sauce, about 15 minutes. Stir in the beans, 1/2 cup of broth and the remaining tomatoes. Cover and simmer for another 25 minutes, stirring often. Remove from the heat, stir in the remaining herbs and olive oil, and season to taste with salt and pepper. Cover and allow to cool. Stir in the lemon juice if desired, and serve with lemon wedges. If the beans seem dry, add more of the bean broth to taste."}], "link": "https://cooking.nytimes.com/recipes/1013235-turkish-bean-and-herb-salad"}