{"@context": "http://schema.org", "@type": "Recipe", "name": "Stuffed Yellow Peppers With Israeli Couscous and Pesto", "description": "The large spherical couscous that we know as Israeli couscous actually has its origins in North Africa, where it is called muhamma. In Middle Eastern markets, you may find it labeled maghribiyya.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/08/30/health/30recipehealth/30recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves six", "recipeCuisine": "mediterranean", "recipeCategory": "dinner, weekday", "keywords": "healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 102}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 281, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "4 grams", "proteinContent": "8 grams", "saturatedFatContent": "2 grams", "sodiumContent": "521 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["5 tablespoons extra virgin olive oil", "1 cup Israeli couscous", "Salt to taste", "1 large garlic clove (more to taste)", "1 cup fresh basil leaves", "1/4 cup freshly grated Parmesan", "3 large yellow peppers, cut in half lengthwise and seeded", "2 cups tomato purée or homemade tomato sauce", "Freshly ground pepper to taste", "Fresh basil leaves for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat one tablespoon of the olive oil over medium-high heat in a medium saucepan. Add the couscous. Stir until the couscous begins to color and smell toasty. Add 2 cups water and salt to taste. Bring to a boil. Reduce the heat, cover and simmer 15 minutes or until the couscous is tender. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn on a blender or a food processor fitted with the steel blade. Drop in the garlic. When it is chopped and adhering to the sides of the blender jar or food processor bowl, stop the machine and scrape down the sides. Add the basil leaves and salt to taste. Turn on the machine, and add the remaining olive oil. Process until smooth. Add the cheese, and blend until incorporated."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Oil a lidded casserole large enough to accommodate all of the peppers. Combine the couscous and pesto. Stir together. Taste and adjust seasonings, adding salt and pepper to taste. Fill the halved peppers with this mixture, and arrange in the casserole. Pour the tomato sauce or purée into the dish. Cover and bake 45 minutes to an hour until the peppers are soft but still hold their shape. Remove from the heat, and serve hot or at room temperature, with some of the tomato sauce spooned over the top. Garnish with basil leaves."}], "link": "https://cooking.nytimes.com/recipes/1013814-stuffed-yellow-peppers-with-israeli-couscous-and-pesto"}