{"@context": "http://schema.org", "@type": "Recipe", "name": "Milk and Honey Ribs", "description": "", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, weekday", "keywords": "baby back ribs, milk, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 41}, "recipeIngredient": ["2 baby back rib racks (4 to 5 pounds total)", "1/4 cup extra-virgin olive oil", "3/4 cup chopped rosemary leaves", "3/4 cup chopped sage leaves", "3 garlic cloves, peeled and chopped", "Coarse sea salt", "pepper", "1/2 Vidalia or other sweet onion, thinly sliced", "2 bay leaves", "2 tablespoons red wine vinegar", "1/2 cup honey", "2 cups whole milk", "1 cup heavy cream", "1/2 pound fresh porcini or cremini mushrooms (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If the butcher has not removed the membrane on the back of each rib rack, gently pry it up by sliding a sharp implement (like the tip of an instant-read thermometer) under it, then lifting gently. Grab the membrane with a paper towel and peel it off. Place the ribs in a baking dish and rub them on both sides with 2 tablespoons of the oil. Sprinkle both sides with the rosemary, sage, garlic and generous amounts of salt and pepper. Arrange the onion under and over the ribs, top each rack with a bay leaf, and drizzle with the vinegar. Refrigerate, covered, 6 to 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 350 degrees. Pour the remaining oil into a roasting pan large enough to hold the ribs side by side. Put the pan in the oven for 5 minutes. Add the ribs, rounded side up, along with the seasonings, onions and garlic. Roast for 30 minutes. Drizzle with the honey and roast 10 more minutes. Turn the ribs over and pour the milk and cream over them. Roast for 1 more hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "At this point, if using the mushrooms, wipe with a damp paper towel and trim off the stem ends. Cut into 1/4-inch slices. Turn the ribs over, rounded side up again. Arrange the mushrooms on top. Spoon any pan juices over the top and continue roasting, basting occasionally, 30 minutes to 1 hour more. If the meat starts to brown too much, press a sheet of parchment paper or aluminum foil on top."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the ribs are cooked, the meat will have shrunk back from the ends of the bones by 1/4 to 1/2 inch and the ribs should be tender enough to pull apart with your fingers. Cut the ribs into 1- or 2-bone sections and serve at once with the optional roasted mushrooms."}], "link": "https://cooking.nytimes.com/recipes/1013554-milk-and-honey-ribs"}