{"@context": "http://schema.org", "@type": "Recipe", "name": "Beet Greens and Potato Hash", "description": "This recipe begins as if you were making hash brown potatoes, but then you add beets and their greens and end up with a much more nutritious, and decidedly pink, dish. If you have leftovers and want to do something different with them, warm and toss this hash with a vinaigrette for a delicious potato salad.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/02/16/science/17recipehealth/17recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves four to six", "recipeCuisine": "", "recipeCategory": "brunch, dinner, easy, quick, weekday", "keywords": "beet, potato, gluten-free, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 35}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 138, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "22 grams", "cholesterolContent": null, "fatContent": "5 grams", "fiberContent": "5 grams", "proteinContent": "3 grams", "saturatedFatContent": "1 gram", "sodiumContent": "410 milligrams", "sugarContent": "6 grams", "transFatContent": null}, "recipeIngredient": ["1 pound red boiling potatoes or baby Yukon golds, cut in small dice about 1/2 inch", "1 bunch beets, roasted, peeled and cut in small dice about 1/2 inch", "1 generous bunch of beet greens, stemmed and cleaned in 2 changes of water", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "1 teaspoon fresh thyme leaves", "Salt", "freshly ground pepper", "1 tablespoon vinegar — sherry, red wine or Champagne (optional)", "Poached eggs, if desired, for serving optional"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the diced potatoes in a steamer above an inch of boiling water. Cover and steam for 10 minutes. Add the beet greens to the steamer, and steam for five minutes until wilted; turn them halfway through so they cook evenly. Turn off the heat underneath the steamer. With tongs, remove the greens to a bowl, and rinse them with cold water. Drain, squeeze out excess water and chop. Set the potatoes aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a large, heavy nonstick skillet. Add the potatoes, turn the heat to medium-high, and cook, stirring from time to time, until the potatoes are lightly browned, about five minutes. Stir in the garlic, beets, greens, thyme, salt and pepper. Cook, stirring often, for another five minutes, pressing the mixture down into the pan so the edges brown. Taste, and adjust salt and pepper. Stir in the vinegar if using. Serve, topped with a poached egg if desired."}], "link": "https://cooking.nytimes.com/recipes/1013480-beet-greens-and-potato-hash"}