{"@context": "http://schema.org", "@type": "Recipe", "name": "Easy Duck Confit", "description": "The name of this recipe may seem laughable. Isn’t confit meant to be an arduous, messy, not-really-easy thing to make at home? Doesn’t it involve large quantities of hot liquid fat and even larger reserves of patience? Surely chefs have a trick to getting those duck legs to be so rich, so luxurious? This version is not traditional, and it is still a time investment for home cooks (the legs are cured for 24 hours, and then cooked for about 3 ½ hours more). But by allowing the duck legs to cook in their own rendered fat, rather than adding quarts of extra fat to the pan, you have a recipe that is far less of a pain to both prepare and clean up. And the method is truly simple, with results that are just as outrageously good. The duck lasts for at least 5 days in the refrigerator, and should be reheated in a 350-oven until warm. Then run the legs under the broiler until crisp.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/duck-confit/duck-confit-articleLarge.jpg", "totalTime": "PT3H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy", "keywords": "duck, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 270}, "recipeIngredient": ["1 1/2 teaspoons kosher salt", "1 teaspoon freshly ground black pepper", "1/2 teaspoon dried thyme", "1 bay leaf, crumbled", "8 moulard duck legs (about 4 pounds total), rinsed and patted dry but not trimmed", "Roasted potatoes, noodles or sturdy salad greens for serving", "Bitter salad greens such as arugula, chicory and/or radicchio, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine salt, pepper, thyme and bay leaf pieces. Sprinkle duck generously with mixture. Place duck legs in a pan in one layer. Cover tightly with plastic wrap and refrigerate for 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "The next day, heat oven to 325 degrees.Place duck legs, fat side down, in a large ovenproof skillet, with legs fitting snugly in a single layer (you may have to use two skillets or cook them in batches). Heat duck legs over medium-high heat until fat starts to render. When there is about 1/4 inch of rendered fat in pan, about 20 minutes, flip duck legs, cover pan with foil, and place it in oven. If you have used two pans, transfer duck and fat to a roasting pan, cover with foil and place in oven."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roast legs for 2 hours, then remove foil and continue roasting until duck is golden brown, about 1 hour more. Remove duck from fat; reserve fat for other uses."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve duck hot or warm, over roasted potatoes or noodles or sturdy salad greens."}], "link": "https://cooking.nytimes.com/recipes/1013002-easy-duck-confit"}