{"@context": "http://schema.org", "@type": "Recipe", "name": "Arctic Char With Soba Noodles, Pine Nuts and Lemon", "description": "Soba, the slender buckwheat noodles from Japan, are pale brown in color, earthy in flavor and springy in the bite. Pair them with a silky, pink piece of fish to create a simple, elegant study in contrasts. The fish here, Arctic char, is reminiscent of salmon but has a more delicate texture. It’s seasoned with cumin seeds that, in a clever move, are briefly toasted in a pan then steeped in oil. The deeply scented oil and seeds are then spooned over the fish for a rich coating of flavor. The fish is roasted about 10 minutes, to desired doneness, while the noodles are tossed in a dressing of finely ground pine nuts, garlic, lemon zest and juice, along with a ribbon of olive oil. The recipe calls for Meyer lemons, which are smooth-skinned, sweet, fragrant and juicy, without the acidic tartness of more commonplace lemons. Meyers are easier to find than they used to be, but are still something of a delicacy in the produce aisle. Regular lemons will do fine. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/11/dining/11char/11char-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "4 servings", "recipeCuisine": "asian", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "fish, pine nuts, soba noodles, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 176}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 1211, "unsaturatedFatContent": "52 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "80 grams", "fiberContent": "1 gram", "proteinContent": "89 grams", "saturatedFatContent": "15 grams", "sodiumContent": "1044 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["6 ounces soba noodles", "1/4 cup pine nuts", "2 garlic cloves, minced", "1 teaspoon kosher salt", "1/4 teaspoon pepper, plus more for seasoning", "1/2 teaspoon finely grated Meyer lemon zest", "2 teaspoons fresh Meyer lemon juice", "6 tablespoons extra virgin olive oil", "1 tablespoon cumin seeds", "4 arctic char fillets, about 8 ounces each, preferably center-cut pieces, skin removed", "Meyer lemon wedges, for serving", "Chopped fresh cilantro or mint, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the noodles according to the package instructions. Rinse under cold water; drain well."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pulse the pine nuts in a food processor until finely ground. Scrape them into a large bowl. Add the garlic, 1/2 teaspoon salt, pepper and lemon zest. Whisk in the lemon juice. Slowly whisk in 3 tablespoons oil. Toss noodles with the dressing."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 450 degrees. Line a large baking sheet with foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Set a small skillet over medium-high heat and allow to heat up, about 1 minute. Add the cumin seeds and sizzle until fragrant, about 30 seconds. Turn off the heat and add remaining oil. Allow to cool slightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season both sides of the fish with remaining salt and a pinch of pepper and place on the baking sheet. Spoon the cumin and oil evenly over the fillets. Roast to desired doneness, about 10 minutes for medium rare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Divide the noodles among four plates and place the fish over the noodles. Garnish with the lemon wedges and cilantro or mint."}]}