{"@context": "http://schema.org", "@type": "Recipe", "name": "House-Made Buns", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": null, "totalTime": "PT3H15M", "recipeYield": "Makes 7 buns", "recipeCuisine": "", "recipeCategory": "", "keywords": "side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 33}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 314, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "54 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "3 grams", "sodiumContent": "274 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup plus 2 tablespoons whole milk", "1 1/2 tablespoons active dry yeast", "2 tablespoons unsalted butter, softened, plus extra for coating the bowl", "3 1/4 cups plus 2 tablespoons all-purpose flour, plus extra for dusting", "2 1/2 tablespoons sugar", "2 teaspoons kosher salt", "1 egg", "1 tablespoon sesame seeds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the milk in a small saucepan and warm it over very low heat until lukewarm (110-115 degrees). Remove the pan from the heat. Sprinkle the yeast over the milk, stir and set aside for 5 minutes to activate. Butter a large bowl and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In an electric mixer fitted with a dough hook attachment, combine the yeast mixture with half the flour on low speed. Over a 1-minute period, add the remaining flour along with the sugar, salt, egg and 2 tablespoons butter. Increase the speed to medium and mix for 2 minutes, then mix on high speed for 2 minutes. Transfer the dough to the prepared bowl, cover it loosely with plastic wrap and set it aside in a warm area for 45 minutes to 1 hour, until the dough has doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out the dough onto a floured surface. Divide it into 7 equal pieces. Keeping the other portions covered with a kitchen towel so they don’t dry out, roll each piece into a ball. Cover and let rest for 10 minutes. Using a rolling pin, flatten the balls into rounds that are 3½ to 4 inches in diameter. Place the buns on a baking sheet lined with parchment paper; put the sheet inside a large plastic bag and tie the open end closed. Leave the pan in a warm area until the buns have doubled in size, 30 to 45 minutes. Meanwhile, preheat the oven to 375 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the sheet from the bag, brush each bun with water and sprinkle the sesame seeds on top. Bake until golden brown, 20 to 25 minutes. Let cool at least 10 minutes. Slice in half and serve."}]}