{"@context": "http://schema.org", "@type": "Recipe", "name": "Endive Cheese Tart", "description": "", "author": {"@type": "Person", "name": "Elaine Louie"}, "image": null, "totalTime": "PT2H45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "french", "recipeCategory": "dinner, weekday", "keywords": "all-purpose flour, endive, époisses cheese, dessert, vegetarian", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 446, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "39 grams", "cholesterolContent": null, "fatContent": "29 grams", "fiberContent": "6 grams", "proteinContent": "11 grams", "saturatedFatContent": "17 grams", "sodiumContent": "234 milligrams", "sugarContent": "20 grams", "transFatContent": "1 gram"}, "recipeIngredient": ["1/2 cup confectioners’ sugar", "1 cup all-purpose flour", "Pinch of salt", "4 1/2 tablespoons unsalted butter, at room temperature, cut into small pieces", "1 large egg", "3 pounds small Belgian endives, trimmed of brown edges", "8 tablespoons unsalted butter", "1/2 cup granulated sugar", "1/2 pound Époisses cheese"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToSection", "name": "For the dough", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "For the dough: In a mixing bowl, combine sugar, flour and salt. Add butter and mix with a pastry cutter or two knives until it resembles large crumbs. Add egg and mix with a fork until it forms a mass. Shape into a disk and cover with plastic wrap. Refrigerate for 2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, prepare filling: Fill bottom of a steamer with 1 1/2 inches of water, place over high heat and bring to a boil. Add endives and steam until just tender, about 20 minutes depending on size. Transfer to a colander and allow to drain for 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a 9 1/2-inch flameproof baking dish or cast-iron skillet over medium heat. Melt butter and add sugar, stirring until dissolved. Reduce heat to low and add endives in circular pattern, tips meeting in the center, or other attractive pattern (which will be visible when pie is finished)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Allow endives to cook over low heat until liquid is reduced to a caramel on bottom of dish and endives are golden brown (but not burned) on underside, 45 minutes to 1 hour. Meanwhile, preheat oven to 350 degrees."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When endives are cooked, remove pan from heat. Cover endives evenly with slices of Époisses. Remove dough from refrigerator and roll out into a circle large enough to cover and slightly overhang top of pan. Place dough on top of Époisses; do not try to adjust it once placed."}]}, {"@context": "http://schema.org", "@type": "HowToSection", "name": "For the filling", "itemListElement": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim excess dough from sides. Perforate in a few places with a sharp knife and bake until dough is golden brown, 20 to 30 minutes. Remove from oven. Place a large plate on top of pan. Invert, gently removing pan. Serve hot or warm."}]}]}