{"@context": "http://schema.org", "@type": "Recipe", "name": "Cruze Farm Buttermilk Poundcake", "description": "Strictly traditional poundcakes don’t include any leavening – just one pound each of eggs, sugar, flour, and butter – which explains why they are often leaden and crumbly. This recipe has a touch of baking soda and a shot of buttermilk, which work together to lighten the crumb and give it moisture and tang. It’s the perfect foil for summer berries and superb plain on its own. Buttermilk you can buy from local dairy farms may not be “real” buttermilk – which is the leftover liquid from churning cream into butter – but it will certainly be fresher and richer-tasting than supermarket brands. ", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Buttermilk-Poundcake/Buttermilk-Poundcake-articleLarge.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 10 to 12", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 46}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 567, "unsaturatedFatContent": "13 grams", "carbohydrateContent": "77 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "1 gram", "proteinContent": "7 grams", "saturatedFatContent": "11 grams", "sodiumContent": "215 milligrams", "sugarContent": "48 grams", "transFatContent": "2 grams"}, "recipeIngredient": ["3/4 cup butter, plus more for greasing the pan", "3 1/2 cups sifted all-purpose flour, plus more for flouring the pan", "1/2 teaspoon salt", "1/2 teaspoon baking soda", "2 1/2 cups granulated sugar", "3/4 cup solid shortening", "4 large eggs", "2 teaspoons vanilla extract", "1 cup cultured buttermilk (see note)", "Juice of 1 lemon, strained", "2/3 cup sifted confectioners' sugar", "2 tablespoons lemon juice", "1 teaspoon grated lemon zest"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring all the ingredients to room temperature. Preheat the oven to 300 degrees. Grease and flour a bundt pan, tapping out excess flour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a medium bowl, whisk together the flour, salt and baking soda. In another medium bowl, whisk the sugar to break up clumps."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In the bowl of a standing mixer fitted with a paddle attachment, cream the butter and shortening, stopping to scrape down the sides. Slowly drizzle in the sugar; cream the mixture well. Beat in the eggs one at a time, adding the next when the last has been incorporated. Mix in the vanilla. On low speed, mix in a third of the flour mixture until just combined. Add a third of the buttermilk, mixing until just combined. Repeat with the remaining flour and buttermilk. Add the lemon juice and mix to combine."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the batter into the prepared pan. Bake until a cake tester inserted comes out clean, about 75 minutes. The top of the cake will be lightly browned, and the sides will shrink slightly from the pan. Cool for 20 minutes before inverting onto a cake platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Before serving, stir together the glaze ingredients and spoon over the top and sides of the cake. It’s even better the next day."}], "link": "https://cooking.nytimes.com/recipes/1013961-cruze-farm-buttermilk-poundcake"}