{"@context": "http://schema.org", "@type": "Recipe", "name": "Chicken Soup With Lemon", "description": "Bulgur is just one grain you can add to this lemony soup; quinoa or rice, which is traditional, work equally well. If you use all of the shredded chicken called for in this recipe (you don’t have to), the soup becomes much like a stew. Make the broth the day before; after it chills overnight in the refrigerator, skim the fat from the surface.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/01/11/science/14recipehealth/14recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H45M", "recipeYield": "Serves six generously", "recipeCuisine": "", "recipeCategory": "dinner, lunch, project, soups and stews", "keywords": "bulgur, chicken, healthy, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 205}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 619, "unsaturatedFatContent": "22 grams", "carbohydrateContent": "31 grams", "cholesterolContent": null, "fatContent": "35 grams", "fiberContent": "5 grams", "proteinContent": "46 grams", "saturatedFatContent": "10 grams", "sodiumContent": "1820 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds chicken, cut up", "2 medium carrots, sliced", "1 medium onion, quartered", "6 large garlic cloves, 4 peeled and crushed, 2 minced or sliced", "A bouquet garni made with 1 bay leaf, a couple of sprigs of thyme and a couple of sprigs of parsley", "2 1/2 quarts water", "10 peppercorns", "Salt to taste", "1 pound leeks (3 medium or 2 large), white and light green parts only, cleaned and sliced thin", "2/3 cup bulgur", "Juice of 2 large lemons", "3 tablespoons finely chopped fresh herbs, such as parsley, tarragon, chives or cilantro"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "If possible, do this step a day ahead. Combine the chicken, carrots, onion, crushed garlic cloves, bouquet garni, water and peppercorns in a large soup pot or Dutch oven. Bring to a simmer. Skim off any foam, add salt to taste, cover partially and simmer over low heat for 30 minutes. Using tongs, remove the chicken breasts and wings and place in a bowl. Simmer the legs and thighs for another 10 minutes and remove. When cool enough to handle, remove the meat from the bones, discard the skin and return the bones to the pot. Continue to simmer the bones for another 30 minutes. Shred the chicken, and refrigerate it in a covered bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the broth through a cheesecloth-lined strainer into a large bowl. Refrigerate overnight. The next day, skim off the fat that has congealed on the surface of the broth and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the broth to the soup pot. Add the remaining garlic and leeks, bulgur and salt to taste. Bring to a boil. Reduce the heat, cover and simmer 20 minutes until the grains are tender. Taste and adjust salt. Shortly before serving, stir as much of the chicken as you’d like into the soup (use the remaining chicken for salads). Stir in the lemon juice and herbs, and serve."}], "link": "https://cooking.nytimes.com/recipes/1013425-chicken-soup-with-lemon"}