{"@context": "http://schema.org", "@type": "Recipe", "name": "Marilyn Monroe’s Stuffing", "description": "In the 1950s, a Hollywood starlet was not expected to squander her talents (or risk her manicure) chopping onions. But this recipe, scrawled by Marilyn Monroe on letterhead from an insurance company, suggested that she not only cooked, but cooked confidently and with flair. It bears the mark of the Bay Area and influences of Italian cooking, possibly picked up from her marriage to Joe DiMaggio at San Francisco City Hall in 1954. It is also a fussy, complicated affair -- but do not let that stop you. The result (almost 20 cups' worth!) is handsome, balanced and delicious.", "author": {"@type": "Person", "name": "Matt Lee And Ted Lee"}, "image": "https://static01.nyt.com/images/2010/11/10/dining/10marilyn-span/10marilyn-span-articleLarge-v2.jpg", "totalTime": "PT2H", "recipeYield": "About 20 cups", "recipeCuisine": "", "recipeCategory": "", "keywords": "chicken liver, sourdough, turkey liver, fall, winter, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 117}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 293, "unsaturatedFatContent": "10 grams", "carbohydrateContent": "27 grams", "cholesterolContent": null, "fatContent": "15 grams", "fiberContent": "3 grams", "proteinContent": "14 grams", "saturatedFatContent": "4 grams", "sodiumContent": "292 milligrams", "sugarContent": "11 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["A 10-ounce loaf sourdough bread", "1/2 pound chicken or turkey livers or hearts", "1/2 pound ground round or other beef", "1 tablespoon cooking oil", "4 stalks celery, chopped", "1 large onion, chopped", "2 cups chopped curly parsley", "2 eggs, hard boiled, chopped", "1 1/2 cups raisins", "1 cup grated Parmesan", "1 1/4 cups chopped walnuts, pine nuts or roasted chestnuts, or a combination", "2 teaspoons dried crushed rosemary", "2 teaspoons dried crushed oregano", "2 teaspoons dried crushed thyme", "3 bay leaves", "1 tablespoon salt-free, garlic-free poultry seasoning (or 1 teaspoon dried sage, 1 teaspoon marjoram, 1/2 teaspoon ground ginger and 1/2 teaspoon ground nutmeg)", "1 tablespoon kosher salt, plus more to taste", "1 tablespoon pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Split the bread loaf in half and soak it in a large bowl of cold water for 15 minutes. Wring out excess water over a colander and shred into pieces."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Boil the livers or hearts for 8 minutes in salted water, then chop until no piece is larger than a coffee bean."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet over medium-high heat, brown the ground beef in the oil, stirring occasionally and breaking up the meat, so no piece is larger than a pistachio."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In your largest mixing bowl, combine the sourdough, livers, ground beef, celery, onion, parsley, eggs, raisins, Parmesan and nuts, tossing gently with your hands to combine. Whisk the rosemary, oregano, thyme, bay leaves, poultry seasoning, salt and pepper together in a bowl, scatter over the stuffing and toss again with your hands. Taste and adjust for salt. Refrigerate, covered, until ready to use as a stuffing or to bake separately as dressing. To serve as a dressing, pile about two quarts of the mixture into a 9-inch square baking dish and bake at 350 degrees until the top is evenly browned, about 1 hour."}], "link": "https://cooking.nytimes.com/recipes/1013344-marilyn-monroes-stuffing"}