{"@context": "http://schema.org", "@type": "Recipe", "name": "Fish Fillets in Pickle Wine Sauce", "description": "", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2011/01/26/dining/26NIXON-3/26NIXON-3-articleLarge.jpg", "totalTime": "PT40M", "recipeYield": "2 to 4 servings", "recipeCuisine": "chinese", "recipeCategory": "dinner", "keywords": "chinese pickle wine sauce, fish, main course", "aggregateRating": null, "recipeIngredient": ["6 dried tree ear mushrooms", "1 large egg white", "4 teaspoons cornstarch", "1/2 pound small fillets of flounder, fluke or sole", "2 tablespoons sugar", "1/8 teaspoon salt", "2/3 cup chicken stock", "1/4 cup Chinese pickle wine sauce (sometimes known as pickle sauce; amontillado sherry with a pinch each of cinnamon and ground fennel can be substituted)", "3 cups peanut or vegetable oil, for deep-frying", "3 garlic cloves, sliced thin"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Soak the tree ears in warm water to cover for 20 minutes. Drain, trim off any hard parts and cut very large ones in half."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix the egg white and 2 teaspoons cornstarch in a medium bowl. Cut the fish into pieces about 1 1/2 inches square. Add to the bowl and coat with the egg white mixture. Let rest 5 minutes. In another bowl, combine the sugar, salt and remaining cornstarch. Whisk in the stock and pickle wine until smooth."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil in a large wok or deep skillet to 350 degrees. Set a colander over a bowl. Drain the fish pieces well and add a third of the fish pieces to the oil. Cook just until fish is opaque but not browned, about 30 seconds. Scoop them out with a spider, a shallow strainer or a large slotted spoon and transfer to the colander. Repeat until all the fish is cooked."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour off all but 1 tablespoon of the oil. Return pan to a high heat. Add the garlic and cook 10 seconds, until soft. Add the tree ears and cook 15 seconds. Stir the stock and pickle wine mixture and add, stirring. Bring to a boil. Return the fish to the wok, toss to coat with the sauce, and transfer everything to a serving platter."}], "link": "https://cooking.nytimes.com/recipes/1013453-fish-fillets-in-pickle-wine-sauce"}