{"@context": "http://schema.org", "@type": "Recipe", "name": "Triggerfish With Pistou and Garden Vegetables", "description": "", "author": {"@type": "Person", "name": "Christine Muhlke"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Triggerfish/Triggerfish-articleLarge.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "gluten-free, main course, spring", "aggregateRating": null, "recipeIngredient": ["4 cups water", "1 large carrot, peeled and chopped", "1/2 medium onion, peeled and chopped", "1 small shallot, peeled and chopped", "1 leek, cleaned and chopped", "1/4 medium fennel bulb, whole with fronds", "1 fresh bay leaf", "1/2 bunch fresh parsley", "2 teaspoons sugar, plus more to taste", "2 small garlic cloves, peeled", "1/4 cup white wine", "Various seasonal market vegetables", "2 bunches basil, leaves removed", "1 clove garlic, peeled and chopped", "Salt", "freshly ground pepper", "4 tablespoons olive oil", "4 triggerfish fillets (see note)", "Cayenne pepper", "Canola oil", "Juice of 1 lemon", "Various seasonal herbs", "greens", "edible flowers (flowers optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the first 11 ingredients in a large pot. Simmer for 25 minutes. If using right away, strain and move on to Step 2. Otherwise, the broth can be cooled and stored, unstrained, in the refrigerator for up to 1 week."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 300 degrees. Wash the vegetables and peel, if necessary. They can be prepared in any or all of the following ways: cooked in the broth until tender and left whole; cooked in the broth until tender and then puréed with broth; or left raw and shaved with a mandoline or peeler. Utilizing all three of these methods makes for a beautiful presentation."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a medium pot of salted water to a boil. Have a bowl of ice water ready. Blanch the basil for 2 seconds. Quickly remove and immerse in the ice water. Strain and put in a blender with the garlic clove, salt, pepper and sugar to taste; add plenty of broth to keep the purée spinning. When it’s smooth, slowly drizzle in 2 tablespoons of the olive oil to emulsify. Strain, reserving the bright green broth. Discard the solids."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fish fillets with salt and cayenne. Heat a large sauté pan over high heat. Add enough canola oil to cover the bottom. When the oil shimmers, add 2 fillets to the pan, skin side up, and do not disturb. Cook until golden brown, 3 to 5 minutes. Place on a baking sheet, skin side down. Repeat with the remaining 2 fillets. When all the fillets are seared on one side, drizzle with 2 tablespoons olive oil and a little lemon juice. Place the baking sheet in the oven and cook until the fish is opaque throughout, 6 to 8 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Ladle the pistou into 4 warm bowls. Divide the vegetables among them, reserving some of the shaved ones. Place the warm fish on top of the vegetables. Garnish with herbs, greens, edible flowers (if desired) and remaining shaved vegetables."}]}