{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow Roast Pork Shoulder With Herb Rub", "description": "", "author": {"@type": "Person", "name": "Alice Hart"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Slow-Roast-Pork-Shoulder/Slow-Roast-Pork-Shoulder-articleLarge.jpg", "totalTime": "PT12H", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "brown sugar, herbs, pork shoulder, main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 99}, "recipeIngredient": ["6 tablespoons mixed finely chopped robust herbs (like thyme, rosemary, sage and parsley)", "3 garlic cloves, finely chopped", "3/4 cup brown sugar", "1/2 cup, plus 1 tablespoon sea salt", "1 tablespoon crushed black peppercorns", "A 7-pound pork shoulder, skin on, boned", "5 bay leaves", "Rosemary applesauce", "Crusty bread rolls, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together herbs, garlic, 1/4 cup brown sugar, 1 tablespoon sea salt and crushed peppercorns."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Untie the pork if rolled. In a large bowl, thoroughly dissolve 1/2 cup salt and 1/2 cup brown sugar in 2 quarts of cold water. Add bay leaves and 2 tablespoons of herb mixture. Place pork in a container or strong sealable bag and add this brine to completely cover. Cover or seal well and chill for from 8 hours to overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the pork from the brine (discard the brine) and dry thoroughly. Cover with the remaining herb mixture, patting it in all over, then use kitchen twine to roll up pork and secure it tightly."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 225 degrees. Prepare a triple layer of aluminum foil large enough to comfortably enclose the pork. Put the rolled pork on the foil, skin/fatty side up. Gather the foil, scrunching it over to form a loose but well-sealed parcel. Place in a roasting pan in the oven. Take the first check for the internal temperature after 8 hours. For very tender meat that can be sliced, it should be 160 degrees and will probably take 10 hours. Check more often if needed. For a “pulled pork” consistency, the internal temperature should be 200 degrees and it will take about 12 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Rest the meat 20 minutes before unwrapping completely. Warm the applesauce and the rolls. Slice the pork not too thin (removing the twine as you go) and put in the sliced rolls with some of the cooking juices and lots of applesauce."}], "link": "https://cooking.nytimes.com/recipes/1013772-slow-roast-pork-shoulder-with-herb-rub"}