{"@context": "http://schema.org", "@type": "Recipe", "name": "Henrietta’s Hash Browns", "description": "The secret to perfect hash browns, the chef Peter Davis of Henrietta's Table in Cambridge, Massachusetts, told The Times in 2010, is to take a few moments at night to clarify the butter you will use to make the dish in the morning, removing the milk solids that would otherwise burn as you cook. As a corollary, something to do as the butter melts and you strain out the solids, boil off some potatoes, then let them dry in the refrigerator over night. Grate them in the morning, and cook in the clarified butter. When you've got a good crust going, place a plate over the pan, put your hand on it and quickly invert the whole. Then slide the new bottom, until recently the unfinished top, back into the pan to continue cooking. Serve with eggs, naturally.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Henriettas-Hash-Browns/Henriettas-Hash-Browns-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "breakfast", "keywords": "gluten-free, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 91}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 229, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "25 grams", "cholesterolContent": null, "fatContent": "14 grams", "fiberContent": "3 grams", "proteinContent": "3 grams", "saturatedFatContent": "9 grams", "sodiumContent": "370 milligrams", "sugarContent": "1 gram", "transFatContent": "1 gram"}, "recipeIngredient": ["4 medium Yukon Gold potatoes", "7 tablespoons unsalted butter", "Kosher salt", "freshly ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel the potatoes and place them in a large pot of cold water. Set over high heat and bring to a boil. Reduce heat to medium high and cook until you can poke a bamboo skewer through a potato, 40 to 50 minutes, being careful not to overcook. Drain and set aside to cool and dry completely, preferably overnight in the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, clarify the butter by melting it in a small saucepan over medium heat. When foam forms, use a spoon to remove and discard it. Cook, skimming, until the butter stops bubbling. Take care not to brown it. Strain through a fine sieve or cheesecloth and reserve. You should have about 5 tablespoons."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a cast-iron or heavy-bottomed pan over medium-high heat. Grate the potatoes on the large side of a box grater into a medium bowl. Season with salt and pepper and mix lightly. Add 3 tablespoons butter to pan, swirl until it begins to melt and add the shredded potatoes. Cook until golden brown and crusted on the bottom, almost (but not quite) burned in parts, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Use a wide spatula to flip the potatoes, or quickly invert the pan onto a dinner plate and gently slide them back into the pan. Add remaining butter around the sides of the potatoes and cook the second side until golden brown, about 10 minutes. Cut into wedges or spoon onto plates. Serve with eggs, grilled meats, toast and plenty of jam."}], "link": "https://cooking.nytimes.com/recipes/1013081-henriettas-hash-browns"}