{"@context": "http://schema.org", "@type": "Recipe", "name": "Profiteroles With Raspberries", "description": "This dessert is on menus of many fancy restaurants, but this isn’t a fancy dessert. It is a dessert that looks good enough, though, that you could fool a few people. Profiteroles are a lot like popovers, and you bake them the same way, at 425 degrees for about 20 or 25 minutes until they are nicely browned. They’re light and crisp. Here they’re served with ice cream and raspberry purée.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/02/27/dining/recipes-raspberryprofiterole/recipes-raspberryprofiterole-mediumThreeByTwo440.jpg", "totalTime": "PT45M", "recipeYield": "12 to 15 profiteroles", "recipeCuisine": "", "recipeCategory": "", "keywords": "dessert, ice cream, raspberries, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 31}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 134, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "12 grams", "cholesterolContent": null, "fatContent": "8 grams", "fiberContent": "2 grams", "proteinContent": "3 grams", "saturatedFatContent": "5 grams", "sodiumContent": "52 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons unsalted butter, cut into pieces", "1/8 teaspoon salt", "3/4 cup all-purpose flour", "3 large eggs", "1 pint raspberries", "1 pint ice cream or sorbet"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees; line a baking sheet with parchment paper. Put the butter in a saucepan with the salt and 3/4 cup water; bring it to a boil over medium-high heat and stir until the butter is melted. Reduce the heat to medium and add the flour; continue to cook, stirring constantly, until the mixture pulls away from side of pan and forms a ball, about 30 seconds. Remove from the heat and let cool for 3 to 4 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the eggs to the slightly cooled flour mixture one at a time, beating well after each addition — the batter will come apart after each egg is added but will reunite as you stir. Transfer the batter to a resealable plastic bag or pastry bag and make a 1/2 -inch cut in one corner. Pipe mounds about 1 inch high and 1 to 2 inches in diameter onto the prepared baking sheet, leaving about an inch of space between."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until puffed and golden, 20 to 25 minutes. Remove the profiteroles from the oven and pierce the bottom of each profiterole once with a skewer, to keep them from getting soggy. Return to the oven; prop the oven door open with a wooden spoon and let the profiteroles crisp up for about 3 minutes. Cool on sheet on a rack."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, put the raspberries in a food processor along with 1 to 2 tablespoons water. Purée the berries, adding a little more water through the feed tube if needed, to create a pourable drizzle. To serve, use a serrated knife to slice each profiterole in half around the equator, fill with a scoop of ice cream or sorbet, and drizzle with the raspberry purée."}], "video": {"@context": "http://schema.org", "@type": "VideoObject", "name": "Profiteroles With Raspberries", "description": "Mark Bittman makes an easy and impressive pastry for dessert and tops it with raspberry purée. ", "thumbnailUrl": "https://static01.nyt.com/images/2014/02/27/dining/recipes-raspberryprofiterole/recipes-raspberryprofiterole-mediumThreeByTwo440.jpg", "uploadDate": "2010-10-29T21:40:08.000Z", "duration": "PT2M56S"}, "link": "https://cooking.nytimes.com/recipes/1013328-profiteroles-with-raspberries"}