{"@context": "http://schema.org", "@type": "Recipe", "name": "Braised Sauerkraut With Lots of Pork", "description": "Two classic mixed braises always come to mind at this time of year. One is cassoulet, based on white beans and a blend of goose, duck and pork. The better alternative for my purposes was choucroute garnie, a vat of simmering sauerkraut that serves as a nice bed on which to mix and match a variety of pig parts.\n\nThe beauty of a choucroute is that it lets you use whatever pork products you like or have on hand. A couple of hours later, the meat is cooked through while the sauerkraut has absorbed all the porky, smoky flavors, utterly transforming from pickled and puckery into something brawny in flavor and meltingly soft, especially if you add a couple of apples to bring out the cabbage’s sweeter nature.\n\nPigs’ feet are not necessarily traditional in choucroute, but they add excellent flavor and body to the mix. If you are like my husband and prefer to eat your meat with a knife and fork (and I know that he is not alone in that department), you can always leave them out.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/braised-sauerkrait-pork/braised-sauerkrait-pork-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "country rib, sauerkraut, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 67}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 738, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "24 grams", "cholesterolContent": null, "fatContent": "43 grams", "fiberContent": "8 grams", "proteinContent": "53 grams", "saturatedFatContent": "16 grams", "sodiumContent": "1625 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds pork rib tips or country ribs, rinsed and patted dry", "2 teaspoons kosher salt", "1 teaspoon ground black pepper", "2 pigs’ feet, halved lengthwise (have your butcher do the cutting), rinsed and patted dry", "2 cups not-too-dry white wine", "2 bay leaves", "1 1/2 teaspoons coriander seeds", "1 tablespoon olive oil", "4 bratwurst, smoked or unsmoked", "4 tablespoons unsalted butter", "2 medium onions, halved and thinly sliced", "3 tart apples, peeled, cored and sliced 1/4-inch thick", "1 fat garlic clove, finely chopped", "3 pounds sauerkraut, rinsed and drained", "2 large carrots, peeled and thinly sliced", "1 large smoked pork chop", "Boiled potatoes, for serving", "Chopped fresh parsley, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 325 degrees. In a large bowl, toss the ribs with 1 teaspoon salt and 1/2 teaspoon black pepper. Set a medium saucepan on high heat and add the pigs’ feet, wine and bay leaves. Bring to a boil, then reduce heat, cover and simmer for 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, set a large Dutch oven over medium heat and add the coriander seeds, toasting them until fragrant, about 2 minutes. Using a mortar and pestle or the side of a knife, lightly crush the seeds. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return the Dutch oven to the heat and add the olive oil. Increase heat to medium-high. Add the bratwurst and cook, turning occasionally, until brown, about 5 minutes. Transfer to a plate. Turn down the heat to medium and melt the butter in the pot. Toss in the onions and cook until soft, about 5 minutes. Add the apples and cook until the apples and onions are golden, about 10 minutes. Add the garlic and cook 2 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the wine and pigs’ feet. Simmer for about 2 minutes, scraping up any browned bits from the bottom of the pot. Add the sauerkraut, rib tips, 3/4 cup water, carrots, coriander seeds, remaining teaspoon salt and 1/2 teaspoon pepper. Mix well, then nestle the pork chop in the sauerkraut."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the pot and bake in the oven for 1 hour. Turn the pork chop and add the bratwurst. Cover and cook 30 minutes longer. Simmer, uncovered, until the juices have thickened and the meat is tender, another 30 to 45 minutes. Serve with boiled potatoes and chopped parsley."}], "link": "https://cooking.nytimes.com/recipes/1013471-braised-sauerkraut-with-lots-of-pork"}