{"@context": "http://schema.org", "@type": "Recipe", "name": "Rabbit Loin With Bitter Greens", "description": "", "author": {"@type": "Person", "name": "Kim Severson"}, "image": "https://static01.nyt.com/images/2014/04/01/dining/rabbit-loin-green/rabbit-loin-green-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, one pot", "keywords": "main course, rabbit", "aggregateRating": null, "recipeIngredient": ["2 large bone-in rabbit saddles (bodies from 3- to 4-pound rabbits, all legs removed)", "Salt", "Black pepper", "2 tablespoons whole grain mustard", "2 tablespoons white-wine vinegar or cider vinegar", "1/4 cup plus 2 tablespoons extra virgin olive oil", "1/4 cup dried cranberries, prunes or other dried fruit", "1/2 cup dry white wine or Armagnac, or as needed", "1 head frisée or 8 ounces dandelion or mustard greens", "1/4 cup almonds, toasted and chopped"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle rabbit saddles with salt and pepper. If possible, do this the night before cooking and refrigerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine mustard and vinegar. Whisk in 1/4 cup olive oil and season with salt and pepper. May be covered and refrigerated up to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dried fruit in a small saucepan with a pinch of salt and pepper, and add enough wine or Armagnac to just cover. Bring to a boil and immediately remove from heat. Drain when cool, remove any pits and cut larger fruits into chunks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large, heavy sauté pan with a lid over high heat with remaining 2 tablespoons olive oil until oil shimmers. Add rabbit saddles and sear well on all sides. Reduce heat to medium low, cover, and cook until interior is slightly pink, 145 degrees on an instant-read thermometer (about 20 minutes). Allow to rest several minutes, then use a sharp knife to remove loins and tenderloins from bone. Slice meat thinly on the bias while still warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a wide, shallow serving bowl, combine frisée or other greens, almonds and fruit. Add mustard dressing to taste, warmed slightly or at room temperature, season with salt and pepper, and toss well. Add rabbit and toss again."}], "link": "https://cooking.nytimes.com/recipes/1013068-rabbit-loin-with-bitter-greens"}