{"@context": "http://schema.org", "@type": "Recipe", "name": "Fruit Crumble With Quinoa-Oat Topping", "description": "Peaches or nectarines and blueberries make a beautiful color combination and a nice package of nutrients. The peaches contain vitamin C, vitamin A, vitamin K, beta-carotene and potassium, while the blueberries have anthocyanins, compounds that some scientists believe may have antioxidant and anti-inflammatory properties.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/10/05/science/07recipehealth600/07recipehealth600-articleLarge-v2.jpg", "totalTime": "PT3H", "recipeYield": "Serves eight", "recipeCuisine": "", "recipeCategory": "", "keywords": "blueberries, oats, peach, quinoa, dessert, healthy", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 27}, "recipeIngredient": ["2 1/2 pounds peaches or nectarines, sliced (about 2 quarts sliced fruit)", "1 cup blueberries", "2 tablespoons mild honey or dark agave nectar", "1/2 teaspoon cinnamon", "1 teaspoon vanilla extract", "1/4 teaspoon almond extract", "1 batch quinoa-oat crumble topping"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a large bowl, mix together the peaches or nectarines, blueberries, honey or agave nectar, cinnamon, vanilla and almond extract. Cover and let sit for one to two hours, in or out of the refrigerator."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees. Butter a two-quart baking dish. Scrape the fruit and all of the juice in the bowl into the baking dish. Set the baking dish on a baking sheet for easier handling, and place in the oven. Bake 20 to 25 minutes until the fruit is bubbling and the liquid syrupy. Remove from the oven, and allow to cool if desired."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 30 minutes before serving, spread the crumble topping over the fruit mixture in an even layer. Bake 20 minutes or until the fruit is bubbling and the topping is nicely browned. Remove from the heat, and allow to cool for at least 10 minutes before serving."}], "link": "https://cooking.nytimes.com/recipes/1013291-fruit-crumble-with-quinoa-oat-topping"}