{"@context": "http://schema.org", "@type": "Recipe", "name": "Seared Blackfish With Tomato Water, Herbs and Olives", "description": "", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Seared-Blackfish/Seared-Blackfish-articleLarge.jpg", "totalTime": "PT20M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, quick, weekday", "keywords": "black olives, blackfish, tomato, main course", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 364, "unsaturatedFatContent": "15 grams", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "20 grams", "fiberContent": "3 grams", "proteinContent": "38 grams", "saturatedFatContent": "3 grams", "sodiumContent": "400 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 1/2 pounds very ripe tomatoes, coarsely chopped 3 cups", "1 small, bushy rosemary sprig, leaves and stem roughly chopped", "1/4 teaspoon fine sea salt, more as needed", "4 blackfish fillets, or other firm white fish, 6 to 8 ounces each, pin bones removed", "Black pepper", "Pinch ground Turkish or Syrian chile pepper (like Urfa or Aleppo, available at most good spice or Middle Eastern food shops)", "1/4 cup extra virgin olive oil, more for serving", "1/2 cup pitted, chopped black olives", "Mint leaves, torn, for garnish", "Basil leaves, torn, for garnish", "Flaky sea salt or fleur de sel, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the tomato water, line a colander with a thin dish towel and place it over a bowl. Put the tomatoes, rosemary and 1/4 teaspoon salt in the colander and mix and squash the mixture gently with your hands (the less you squash, the clearer the liquid will be). Refrigerate for 8 hours or leave it in a cool room for 4 hours. Cover and refrigerate the tomato water until ready to use, and reserve the tomatoes for making sauce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Season the fish with salt, black pepper and chili pepper. Heat a large nonstick skillet over medium-low heat. Add the oil. After 1 minute, place the fillets in the skillet. Scatter the olives around the pan. Cook the fish, without moving it, for 5 minutes. Gently flip the fillets and cook until just opaque, 3 to 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer the fillets and olives to a platter. Spoon a little of the tomato water over the fish and sprinkle with mint and basil. Top with a drizzle of olive oil and some flaky salt."}], "link": "https://cooking.nytimes.com/recipes/1013803-seared-blackfish-with-tomato-water-herbs-and-olives"}