{"@context": "http://schema.org", "@type": "Recipe", "name": "Eggs Poached in Buttery Sorrel Sauce", "description": "Here's a delightful brunch number that takes great advantage of the first sorrel of spring, with the zesty leaves folded into a sauce made of scallions and loads of butter. Add eggs and cook until just set, then scoop everything up with toast. ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2013/12/12/dining/recipes-eggssorrel/recipes-eggssorrel-articleLarge.jpg", "totalTime": "PT30M", "recipeYield": "2 servings", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "eggs, sorrel, gluten-free, vegetarian, main course, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "recipeIngredient": ["2 fat scallions, trimmed", "2 tablespoons unsalted butter", "1 large bunch sorrel (about 4 ounces), stems trimmed", "1/4 teaspoon kosher salt, more to taste", "Ground black pepper", "1/4 cup heavy cream", "4 large eggs", "Chile flakes, like Aleppo, Turkish or crushed red pepper", "Flaky salt, like Maldon, for serving", "Buttered toast, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Thinly slice scallions, separating darker green parts for garnish."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a skillet over medium heat, melt butter. Add light green and white parts of scallion and sauté until wilted, 2 minutes. Add sorrel leaves, salt and pepper. Cook, stirring, until sorrel wilts and starts to break down, turning olive-green in color, about 3 minutes. Stir in cream and let simmer for 1 minute to thicken a bit."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully crack eggs into skillet; they should fit in one layer. Lower heat to medium-low and sprinkle eggs with salt and pepper. Cover pan and let cook for 2 minutes, then turn off heat and let eggs rest, covered, until done to taste, about another 30 seconds for very runny yolks (the whites should cook through)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Carefully scoop eggs and sorrel sauce into two bowls. Season with chile and flaky salt; garnish with scallion greens. Serve with toast."}], "link": "https://cooking.nytimes.com/recipes/1013133-eggs-poached-in-buttery-sorrel-sauce"}