{"@context": "http://schema.org", "@type": "Recipe", "name": "Orecchiette With Broccoli Rabe and Red Pepper", "description": "Orecchiette with broccoli rabe, also known as rapini, is a classic dish from Apulia, the region of Italy that makes up the heel of the country’s boot shape. To make the dish more colorful, I added red bell pepper to the traditional mix. The sweetness of the peppers makes a nice contrast to the bitter greens.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/09/21/science/20recipehealth/20recipehealth-articleLarge-v2.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, pastas", "keywords": "broccoli rabe, orecchiette, red pepper flakes, fall, healthy, vegetarian, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 32}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 467, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "70 grams", "cholesterolContent": null, "fatContent": "13 grams", "fiberContent": "6 grams", "proteinContent": "20 grams", "saturatedFatContent": "4 grams", "sodiumContent": "583 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound broccoli rabe", "2 tablespoons extra virgin olive oil", "2 garlic cloves, minced", "1/4 to 1/2 teaspoon red pepper flakes", "1 red bell pepper, finely diced", "Salt", "3/4 pound orecchiette", "2 ounces ricotta salata, pecorino, or a mix of pecorino and Parmesan, grated approximately 1/2 cup grated"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cut away the tough stem ends of the broccoli rabe and wash well. Meanwhile, bring a large pot of water to a boil. Season generously with salt and add the broccoli rabe. Cook for 5 minutes, until tender, and transfer using a spider or a slotted spoon to a bowl of ice cold water. Let sit for a few minutes and drain. Squeeze out water and chop very fine. Bring the water back to a boil and add the orecchiette. Cook al dente, following the timing instructions on the package (usually 9 to 10 minutes)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the pasta is cooking, heat 1 tablespoon of the oil over medium heat in a large, heavy nonstick skillet and add the garlic and red pepper flakes. Cook until the garlic is fragrant, 30 seconds to a minute, and add the diced red bell pepper. Cook, stirring, until tender, 3 to 5 minutes, and add the remaining tablespoon of oil and the broccoli rabe. Toss together for a minute, season to taste with salt, and remove from the heat but keep warm."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir 1/4 to 1/2 cup of the pasta cooking water into the greens. Drain the pasta and toss it with the greens, peppers, and cheese. Serve at once."}], "link": "https://cooking.nytimes.com/recipes/1013846-orecchiette-with-broccoli-rabe-and-red-pepper"}