{"@context": "http://schema.org", "@type": "Recipe", "name": "White House Fruit and Oat Bars", "description": "This recipe came to The Times in an article about Bill Yosse, the White House pastry chef under President Obama. \n\n\"Mr. Yosses’ most recent mission is changing the White House tradition of the bottomless cookie plate. (Among White House journalists, President Clinton was known for going straight from a grueling run into the pastry kitchen. Only part of it is visible through a window, but reporters outside recognized him by his sneakers.)\n\nTo edge out the cookies, Mr. Yosses decided to create a child-pleasing crunchy granola bar without nuts, chocolate or white sugar. “We went through many tastings on this one,” he said in his skinny galley kitchen, patting the final result, a mix of toasted oats, sesame seeds and chewy dried fruits into a sheet pan.\"", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/white-house-pastry/white-house-pastry-articleLarge.jpg", "totalTime": "PT50M", "recipeYield": "2 dozen bars", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "dessert, side dish, mixed seeds, rolled oats", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 63}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 102, "unsaturatedFatContent": "3 grams", "carbohydrateContent": "17 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "1 gram", "proteinContent": "1 gram", "saturatedFatContent": "0 grams", "sodiumContent": "14 milligrams", "sugarContent": "12 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["6 tablespoons grapeseed oil, or other neutral oil, plus extra for brushing pan", "2 cups rolled oats", "1/2 cup mixed seeds, such as pumpkin, sunflower and sesame", "1/2 cup honey", "1/3 cup dark brown sugar", "1/3 cup maple syrup", "Pinch of salt", "1 1/2 cups mixed dried fruit, such as raisins, cherries, apricots, papaya, pineapple and cranberries (at least 3 kinds, cut into small pieces if large)", "1 teaspoon ground cardamom or cinnamon"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Line a 9-inch-square baking pan with parchment paper or foil, letting a few inches hang over side of pan. Brush with oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spread oats and seeds on another baking pan and toast in oven just until golden and fragrant, 6 to 8 minutes, shaking pan once."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a saucepan, combine oil, honey, brown sugar, maple syrup and salt. Stir over medium heat until smooth and hot. In a mixing bowl, toss together toasted oats and seeds, dried fruit and cardamom. Pour hot sugar mixture over and stir until well combined."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While mixture is warm, transfer to prepared pan, pressing into pan evenly with an offset spatula."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake until brown, 25 to 30 minutes. Transfer pan to a rack and let cool completely. Using the overhanging foil or paper, lift out of pan and place on a work surface. Cut into bars, about 1 1/2 inches by 3 inches."}]}