{"@context": "http://schema.org", "@type": "Recipe", "name": "Pastrami Hash With Confit Potatoes, Parsley and Shallots", "description": "A dish that calls to the hearts and stomachs of the meat-and-potatoes crowd, breakfast hash is thrillingly easy to cook and deeply satisfying to eat. Because a key ingredient in hash is meat that is already cooked, it’s perfect for leftovers and friendly for home cooks. (So feel free to try the recipe with roast beef instead of the pastrami, or even leftover pork and chicken.) Here, in classic form, the dish also includes potatoes for starch and onions for sweetness. A couple of lightly fried eggs on top will provide a sauce that brings all the flavors together.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2014/03/06/dining/06hash/06hash-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "6 to 8 servings", "recipeCuisine": "", "recipeCategory": "brunch", "keywords": "gluten-free, pastrami, potato, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 32}, "recipeIngredient": ["2 pounds medium-size waxy potatoes like Yukon Gold", "6 cups canola oil", "1 tablespoon olive oil", "3 tablespoons butter, cut into small pieces", "1/4 cup minced shallots", "2 teaspoons minced garlic", "1/3 cup finely chopped parsley", "1/2 pound pastrami, corned beef, roast beef, cooked pork or chicken in bite-size pieces", "Poached or sunny-side-up eggs, for serving", "Hot sauce, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the potatoes in a pot large enough to hold them in a single layer. Pour in canola oil to cover. Turn the heat to medium, bring to a simmer, turn heat to low and simmer until potatoes are just cooked through, 20 to 30 minutes. Lift out with a slotted spoon and set aside to cool, at least 30 minutes or overnight. (Oil can be reused.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Peel potatoes and cut into large dice. In a large nonstick skillet, heat olive oil over medium heat until shimmering. Add potatoes and distribute evenly in pan, pressing down lightly. Cook, undisturbed, 4 to 5 minutes, until browned. With a large spatula, gently turn potatoes over (don’t worry if they break up) and redistribute in pan. Cook 4 minutes, until well crisped. (Do this in two batches if pan is not large enough.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Stir in butter, shallots, garlic, parsley and pastrami or other meat, and cook over medium-low heat, turning occasionally, just until pastrami is heated through and shallots are just soft, about 3 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Serve with eggs on top and hot sauce on the side."}], "link": "https://cooking.nytimes.com/recipes/1013421-pastrami-hash-with-confit-potatoes-parsley-and-shallots"}