{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet and Sour Eggplant, Tomatoes and Chickpeas", "description": "This Lebanese dish is all about summer. Pomegranate molasses makes it both sweet and sour; you can find it in Middle Eastern markets. Serve the dish as a starter, a side or a main dish with grains.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/07/28/science/29recipehealth/29recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves four to six", "recipeCuisine": "middle eastern", "recipeCategory": "dinner, weekday", "keywords": "appetizer, chickpea, eggplant, tomato, healthy, vegan, vegetarian, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 205}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 246, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "34 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "10 grams", "proteinContent": "7 grams", "saturatedFatContent": "1 gram", "sodiumContent": "748 milligrams", "sugarContent": "16 grams", "transFatContent": null}, "recipeIngredient": ["1 large eggplant 1 1/4 to 1 1/2 pounds, halved lengthwise then cut in 1/2-inch slices", "Salt to taste", "3 to 4 tablespoons extra virgin olive oil, as needed", "2 large garlic cloves, minced", "1 1/2 pounds tomatoes, grated or peeled, seeded and chopped", "1 teaspoon sugar", "Freshly ground pepper", "2 tablespoons pomegranate molasses", "1 can chickpeas, drained and rinsed", "2 to 3 tablespoons chopped flat-leaf parsley, or a combination of mint and parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees. Line a baking sheet with foil, and oil it with olive oil. Lay the eggplant slices on top. Salt lightly and brush with olive oil. Place in the oven for 20 minutes until the eggplant is lightly browned and soft to the touch (the surface will be dry). Remove from the heat, and fold over the foil to make a packet around the eggplant slices. Allow them to soften and steam inside the foil for 15 minutes while you proceed with Step 2."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil over medium heat in a large, heavy lidded casserole or skillet. Add the garlic. Cook just until fragrant, about 30 seconds. Stir in the tomatoes, salt to taste, sugar and pepper. Bring to a simmer, and simmer uncovered over medium heat for 10 to 15 minutes, stirring often, until the tomatoes have cooked down and smell very fragrant."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the eggplant, molasses and chickpeas. Cover and simmer for another 20 to 30 minutes, stirring from time to time. The mixture should be thick and the eggplant should be very tender, melting into the mixture. Taste and adjust seasoning. Sprinkle on the parsley and/or mint, and serve. Alternately, allow to cool and serve warm or at room temperature."}], "link": "https://cooking.nytimes.com/recipes/1013763-sweet-and-sour-eggplant-tomatoes-and-chickpeas"}