{"@context": "http://schema.org", "@type": "Recipe", "name": "Asado Negro", "description": "Here, we have a raggedy number out of Venezuela called asado negro. It requires a fat roast of beef that is simmered for a long time in dark caramel, its sweetness tempered by vinegar. The result is sticky and unctuous beneath a cloak of peppers, onions and leeks. It looks mysterious and bold on the plate and at the start of a New York winter can conjure some degree of Latin American humidity and joy.\n\nAsado negro has its primary home in Caracas, where it is often served during the holidays, alongside fried sweet plantains and white rice, with perhaps a tart green salad for contrast. The meat is napped in blackness that comes not from fire or smoke but from the absorption of all colors into one, a color as deep as space itself.\n\nIt is beef the color of a velvet dinner jacket seen across a dark lawn at midnight. It makes mockery of pot roast. And, as we shall see, it is exceedingly simple to make.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2010/12/05/magazine/05food-span/05food-span-articleLarge-v3.jpg", "totalTime": "PT3H45M", "recipeYield": "Serves 6 to 8", "recipeCuisine": "", "recipeCategory": "dinner", "keywords": "gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 95}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 687, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "37 grams", "cholesterolContent": null, "fatContent": "34 grams", "fiberContent": "2 grams", "proteinContent": "48 grams", "saturatedFatContent": "13 grams", "sodiumContent": "1034 milligrams", "sugarContent": "30 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup white sugar", "2 teaspoons brown sugar", "2 cups white-wine vinegar", "1 cup dry red wine", "2 tablespoons canola oil", "2 tablespoons unsalted butter", "4 pounds beef bottom-round roast", "5 cloves garlic, peeled and smashed", "1 large Spanish onion, peeled and thinly sliced", "2 stalks celery, chopped", "2 leeks, white and light-green parts only, washed well and thinly sliced", "2 bay leaves", "1/3 cup Worcestershire sauce", "1 tablespoon soy sauce", "Kosher salt", "freshly ground black pepper", "1 green bell pepper, stemmed, seeded and thinly sliced", "1 red bell pepper, stemmed, seeded and thinly sliced", "2 tablespoons cilantro, well washed and roughly chopped, for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 375 degrees. Combine the white sugar and 1 cup of water in a heavy saucepan and cook, without stirring, over medium-high heat until the sugar dissolves and turns dark caramel, 8 to 10 minutes. Carefully add the brown sugar, vinegar and wine, and cook, stirring, until all the caramel has melted. Set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat a Dutch oven large enough to hold the meat over medium-high heat. When hot, add the canola oil and butter. When these begin to shimmer and foam, sear the roast on all sides. Transfer the meat to a platter and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the garlic, onion, celery, leeks and bay leaves to the Dutch oven and cook over medium-high heat until they have softened and almost begun to brown. Add the Worcestershire and soy sauces and stir to incorporate, then return the meat to the pot and season with salt and pepper. Cover with the bell-pepper slices and pour the caramel sauce over the top. Cover, place in the oven and cook for approximately 2½ hours — basting and turning the meat every 45 minutes — until it is very tender."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove the meat and allow it to stand on a platter, tented in foil, for at least 30 minutes. If the sauce is not syrupy and thick, remove the vegetables (discard the bay leaves) and arrange them around the meat, then place the Dutch oven, uncovered, over medium-high heat and allow the sauce to reduce."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the sauce is ready, slice the meat and return it, along with the vegetables, to the sauce and reheat in the oven or, covered, on the stove. Check the seasoning and garnish with chopped cilantro."}], "link": "https://cooking.nytimes.com/recipes/1013376-asado-negro"}