{"@context": "http://schema.org", "@type": "Recipe", "name": "Fried Winter Squash With Mint", "description": "In Sicily this dish, which I find to be irresistible as a side dish and a snack, is served both hot and at room temperature. If you make it for Thanksgiving and don’t want to be in the kitchen frying squash at the last minute, opt for the room-temperature version. Or fry the squash ahead of time and warm in a low oven. The recipe works equally well with butternut and starchier squash like kabocha.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/11/02/science/01recipehealth/01recipehealth-articleLarge-v3.jpg", "totalTime": "PT15M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "", "keywords": "dairy-free, gluten-free, healthy, high fiber, low cholesterol, low-sodium, nut-free, vegan, vegetarian, extra virgin olive oil, mint leaves, winter squash, fall, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 10}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 121, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "10 grams", "cholesterolContent": null, "fatContent": "9 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "288 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["1/4 cup extra virgin olive oil", "2 garlic cloves, peeled and crushed", "1 1/2 pounds peeled, seeded winter squash, like kabocha or butternut, cut in slices 1/4 inch thick by 2 or 3 inches long", "Salt", "freshly ground pepper", "2 to 3 tablespoons chopped fresh mint, plus additional leaves for garnish", "Pomegranate seeds for garnish"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oil over medium-high heat in a large heavy skillet, preferably cast iron. Add the garlic cloves and cook, stirring, until golden brown. Remove the garlic from the oil and discard."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook the squash slices in the hot oil, adding only 1 layer of slices at a time to the pan. Cook for about 3 minutes, or until squash is lightly browned on the first side, and flip over using a spatula or tongs. Cook until squash is lightly browned on the other side and tender all the way through. Season to taste with salt and pepper and transfer first to paper towels to drain, then to a platter. Repeat until all of the squash is used up. Sprinkle with chopped fresh mint, garnish with whole mint leaves and pomegranate seeds, and serve."}], "link": "https://cooking.nytimes.com/recipes/1013900-fried-winter-squash-with-mint"}