{"@context": "http://schema.org", "@type": "Recipe", "name": "Civet de lievre marine (Marinated hare stew)", "description": "The hare should be marinated for 12 to 24 hours, but no more. If marinated for more than 24 hours, it will lose its freshness. The dish can be prepared several days ahead and reheated just before serving. Use a young hare that weighs no more than six pounds.", "author": {"@type": "Person", "name": "Patricia Wells"}, "image": null, "totalTime": "PT2H30M", "recipeYield": "Eight servings", "recipeCuisine": "french", "recipeCategory": "dinner", "keywords": "fall, main course, mushroom, rabbit, red wine", "aggregateRating": null, "recipeIngredient": ["1 hare, ideally about four pounds, cut into serving-size pieces, reserving the liver for the sauce", "8 ounces lean slab bacon, cubed", "1/4 cup Cognac", "Several branches of parsley", "4 whole cloves garlic", "1 pound fresh mushrooms", "8 ounces small white onions", "3 tablespoons butter", "2 carrots, peeled and thickly sliced", "3 small onions, peeled and quartered", "3 shallots, peeled", "1 branch celery", "1 bay leaf", "1/2 teaspoon thyme", "1/2 teaspoon rosemary", "10 grains whole black pepper", "10 juniper berries", "10 grains whole coriander", "1 bottle red wine, preferably a young Burgundy", "1/2 cup olive oil", "Salt and freshly ground pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the marinade ingredients and pour over the pieces of hare, seasoned with salt and freshly ground pepper. Marinate in the refrigerator for 12 to 24 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove hare from marinade and wipe dry with a paper towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Saute four ounces of the bacon cubes in a large frying pan and drain on paper towels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Strain marinade, discarding herbs and vegetables, and pour into a large, heavy-bottomed casserole with the bacon. Add hare, heat the casserole and add the Cognac. Heat for one minute, them flame with a match. Add parsley and garlic and simmer gently for two hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, clean and quarter mushrooms, and saute in butter for several minutes. Drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch remaining four ounces bacon in boiling water for five minutes, drain, then rinse with cold water and drain again. Saute bacon in a frying pan and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Blanch onions for 10 minutes in boiling water, drain and set aside."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "About 10 minutes before serving, remove the meat from the casserole, arrange on warm platter, cover with foil and place in a warm oven. Strain sauce, discarding the parsley and garlic."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small saucepan, add about one cup of the sauce with the liver, and cook over low heat for several minutes. Place sauce and liver in container of blender or food processor and puree. Combine the puree and the remaining sauce and cook until well blended. Check for seasoning, then pour sauce over the platter of hare."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Just before serving, combine mushrooms, bacon and onions in a frying pan and saute. Arrange around the edge of the platter as a garnish and serve."}], "link": "https://cooking.nytimes.com/recipes/10137-civet-de-lievre-marine-marinated-hare-stew"}