{"@context": "http://schema.org", "@type": "Recipe", "name": "Bosnian Bread", "description": "In 2011, John T. Edge wrote an article about the growing popularity of Bosnian bakeries in St. Louis. This recipe for a simple white bread ran alongside it and came from his wife, Blair Hobbs. She adapted it from <a href=\"http://brandon.multics.org/doc/recipes/bosnian-bread.html\">Jubilee Partners</a>, an organization in Comer, Ga. that hosts refugees new to the United States, and other sources.", "author": {"@type": "Person", "name": "John T. Edge"}, "image": null, "totalTime": "PT1H25M", "recipeYield": "2 loaves", "recipeCuisine": "eastern european", "recipeCategory": "weekday", "keywords": "active dry yeast, bread flour, appetizer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 64}, "recipeIngredient": ["8 cups (42 ounces) bread flour", "1 tablespoon plus 1 teaspoon (16 grams) salt", "1 1/2 teaspoons (6 grams) dry yeast", "Butter, for greasing pans", "Spray oil or vegetable oil"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "With your hands, mix together the flour, salt, yeast and 4 1/2 cups warm water (115 degrees) in a very large bowl until the batter is mixed thoroughly. It will look more like thick cake batter than dough and will be very sticky; do not knead."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover with plastic wrap and let rise at room temperature for 4 to 10 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Butter two 9-inch-by-5-inch metal loaf pans. Quickly stir down the batter, and divide evenly between the pans. Spray or very lightly brush tops of loaves with oil. Let them rest at room temperature for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put the pans into the middle rack of a cold oven, then turn to 500 degrees. After 30 minutes, reduce heat to 300 degrees and bake until risen and light golden, an additional 40 to 45 minutes. Cool loaves thoroughly before serving."}]}