{"@context": "http://schema.org", "@type": "Recipe", "name": "Slow-Baked Beans With Kale", "description": "Beans baked very slowly for several hours develop a creamy texture, while the liquid they cook in, which thickens to a syrup, acquires a caramelized flavor. The kale practically melts in this casserole, going from bitter to sweet. I love using lima beans in this dish because they’re so big and their texture is so luxurious.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2019/01/02/dining/mrs-slow-baked-beans-with-kale/merlin_148148532_eb5ff06b-39a5-48bf-baba-2542dff6874a-articleLarge.jpg", "totalTime": "PT3H45M", "recipeYield": "6 servings", "recipeCuisine": "", "recipeCategory": "dinner, casseroles", "keywords": "healthy, vegetarian, kale, white beans, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 741}, "recipeIngredient": ["1 bunch kale, stemmed and washed in two changes of water", "3 tablespoons extra virgin olive oil", "1 medium onion, chopped", "1 carrot, chopped", "1 rib celery, chopped", "4 garlic cloves, minced", "1 2/3 cups white beans (3/4 pound) or dried lima beans, picked over and soaked for at least four hours and drained", "1 6-ounce can tomato paste, dissolved in 1 cup water", "3 cups additional water", "A bouquet garni consisting of 4 parsley sprigs, 2 thyme sprigs and a bay leaf", "1 teaspoon herbes de Provence", "Salt", "a generous amount of freshly ground pepper", "1/2 cup bread crumbs"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 225 degrees. Meanwhile, bring a large pot of water to a boil, salt generously and add the kale. Blanch for two minutes, then transfer to a bowl of ice water. Drain, squeeze out water and cut into ribbons. Set aside. (I blanch the kale to extract some of the bitterness, but you can skip this step if you wish)."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat 2 tablespoons of the olive oil over medium heat in a large ovenproof casserole. Add the onion, carrots and celery. Cook, stirring often, until the onion is tender, about five minutes. Add the garlic and cook, stirring, until fragrant, 30 seconds to a minute. Add the dissolved tomato paste, and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the drained beans, the remaining water, the bouquet garni, herbes de Provence and salt and pepper.. Stir in the kale, bring to a simmer, cover and place in the oven. Bake three hours until the beans are tender and creamy. Taste and adjust salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Mix together the remaining olive oil and the bread crumbs. Sprinkle the bread crumbs over the beans, and continue to bake another 30 minutes to an hour until the bread crumbs are lightly browned. Remove from the heat and serve; or allow to cool slightly and serve."}]}