{"@context": "http://schema.org", "@type": "Recipe", "name": "Lasagna With Asparagus and Chives", "description": "Lasagna doesn’t always have to be assembled and baked; it can be thrown together quickly, like a regular pasta dish. Use no-boil lasagna noodles for this deconstructed lasagna. Despite the name, they do require boiling here, but they will be lighter than regular lasagna noodles.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2011/06/21/science/22recipehealth/22recipehealth-articleLarge-v2.jpg", "totalTime": "PT20M", "recipeYield": "Serves four", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick, weekday", "keywords": "asparagus, no-boil lasagna noodles, healthy, vegetarian, main course, spring", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 79}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 316, "unsaturatedFatContent": "2 grams", "carbohydrateContent": "48 grams", "cholesterolContent": null, "fatContent": "7 grams", "fiberContent": "4 grams", "proteinContent": "16 grams", "saturatedFatContent": "4 grams", "sodiumContent": "133 milligrams", "sugarContent": "4 grams", "transFatContent": null}, "recipeIngredient": ["1 pound asparagus, trimmed", "1/2 cup ricotta", "1 garlic clove, finely minced or preferably pureed", "2 tablespoons chopped chives or a combination of chives and slivered basil", "1/2 pound no-boil lasagna noodles", "1/4 cup (1 ounce) freshly grated Parmesan or pecorino romano (or a combination)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a rolling boil, salt generously and add the asparagus. Meanwhile, fill a bowl with cold water. Boil thin stalks for three minutes, thicker stalks for four to six minutes until tender. Using tongs, remove the asparagus from the pot and transfer to the bowl of cold water. Drain and cut on the diagonal into 3/4-inch lengths."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the lasagna noodles to the boiling water, and boil until cooked al dente -- firm to the bite. Meanwhile, place the ricotta in a large pasta bowl, and stir in the garlic. When the noodles are done, remove 1/2 cup of the pasta water, and add to the bowl with the ricotta. Mix together well, and add the asparagus, fresh herbs and Parmesan or pecorino to the bowl. Drain the lasagna, and toss with the ricotta mixture. Serve at once."}]}