{"@context": "http://schema.org", "@type": "Recipe", "name": "Oven-Roasted Weekend Beef", "description": "The recipe for the beef is based on a simple and not terribly expensive roast of beef, crusted in a sort of dry rub that is rather more tropical than what you find in most parts of New England, save those inhabited by the great John (Doc) Willoughby, who was the executive editor of Gourmet until that magazine’s demise. Willoughby has championed the intersection of American winter and Caribbean spices for years. This Willoughby-ish mixture — salt and pepper, coriander and cumin, brown sugar and paprika — is wonderful on fire-cooked beef, of course, but it’s still excellent when used in an oven until it goes tight and deepest brown over the meat.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2014/04/03/dining/Oven-Roasted-Weekend-Beef/Oven-Roasted-Weekend-Beef-articleLarge.jpg", "totalTime": "PT1H30M", "recipeYield": "4 servings", "recipeCuisine": "", "recipeCategory": "dinner, roasts", "keywords": "fall, gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 249}, "recipeIngredient": ["2 teaspoons freshly ground black pepper", "2 tablespoons kosher salt", "1 tablespoon sweet Spanish paprika", "1 tablespoon brown sugar", "1 1/2 teaspoons ground cumin", "1 1/2 teaspoons ground coriander", "Red pepper flakes to taste", "1 sirloin tip roast, approximately 3 pounds"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 350 degrees (or light a charcoal fire on one side of a large kettle grill, using a small pillow’s worth of briquettes). Line a baking sheet with aluminum foil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine the dry ingredients in a large bowl. Place the roast in the bowl and rub the spices all over the meat, pressing down so they adhere."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place the roast on the baking sheet and cook for 45 minutes to an hour, until the meat registers an internal temperature of 130 to 135 degrees for medium-rare. Remove from the oven and let sit, loosely tented under foil, for 15 minutes before slicing. (Alternately, when the coals are covered with a fine ash, place the roast on the side of the grill opposite the fire. Cover, cracking the vent open a little, and cook for 40 to 50 minutes, or until the meat has reached an internal temperature of 130 to 135 degrees for medium-rare. Remove from the fire and let sit, loosely tented under foil, for 15 minutes before slicing.)"}], "link": "https://cooking.nytimes.com/recipes/1013006-oven-roasted-weekend-beef"}