{"@context": "http://schema.org", "@type": "Recipe", "name": "Bavarian-Style Soft Pretzels", "description": "These pretzels, called laugenbrezeln, take a bit of planning and time. But they only spend a quarter-hour in the oven, filling the kitchen with a lovely smell, and then you have soft, warm, salty pretzels that you made yourself. What’s that worth? A lot.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": "https://static01.nyt.com/images/2018/09/24/dining/moskin-pretzels-vertical/moskin-pretzels-vertical-articleLarge-v2.jpg", "totalTime": "PT1H30M", "recipeYield": "12 pretzels", "recipeCuisine": "german", "recipeCategory": "project", "keywords": "appetizer, side dish, bread flour, sea salt", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 219}, "recipeIngredient": ["1 tablespoon barley malt syrup or dark brown sugar", "2 tablespoons lard or softened unsalted butter", "2 tablespoons instant yeast", "6 cups (about 30 ounces) bread flour", "1 tablespoon plus 1/2 teaspoon kosher salt", "Food-grade lye, for dipping (see note)", "Coarse sea salt or pretzel salt, for sprinkling (do not substitute kosher salt)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a mixing bowl (or bowl of a mixer), stir together syrup, lard or butter, yeast, 2 cups warm water and half the flour. Add kosher salt and remaining flour and stir just until mixture comes together in a shaggy mass."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Turn out onto counter (or attach dough hook to mixer) and knead for 8 to 10 minutes, until smooth and supple. Cut into 12 pieces and let rest 5 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out each piece into a rope about 22 inches long. (For traditional shape, the ends should be thin and the center fat.) Lift both ends, twist them around each other once, then bring ends back and press them on either side of fat “belly,” at about 4 o’clock and 8 o’clock. Then gently spread out “shoulders” of pretzel. Transfer shaped pretzels to an ungreased baking sheet. (Alternatively, form each piece into a round or oval to make laugenbrötchen, rolls.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Let rest at room temperature for 30 minutes, then refrigerate at least one hour or overnight."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 425 degrees. In a deep bowl, wearing rubber or latex gloves, make a solution of 1/2 cup lye and 10 cups water (or 1 part lye to 20 parts water); pour lye carefully into water to avoid splashing. Dip each pretzel in solution, turning it over for 10 to 15 seconds, and place back on baking sheet."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Sprinkle pretzels with salt. Bake about 15 minutes or until deep brown. Remove to a rack and serve warm."}], "link": "https://cooking.nytimes.com/recipes/1013159-bavarian-style-soft-pretzels"}