{"@context": "http://schema.org", "@type": "Recipe", "name": "Oxtail-Stuffed Peppers", "description": "Timing is everything. I was at Casa Mono, in Manhattan, lapping up every drop of the sauce from a little cazuela of piquillo peppers stuffed with oxtails. The next day I was tasting Ribera del Duero wines (with the restaurant’s wine director, as it happened) and could think of no better dish for them than those meaty, slightly fruity peppers with their alluring hint of bitterness.Andy Nusser, the chef at Casa Mono, provided the recipe, enough to feed the entire town of Peñafiel. I made drastic cuts (four quarts of stock down to two cups, for example) but still had enough for a party. My freezer holds the bonus. Though the oxtails are time consuming, they cook mostly unattended.", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2014/04/02/dining/oxtail-stuffed-peppers/oxtail-stuffed-peppers-articleLarge.jpg", "totalTime": "PT4H30M", "recipeYield": "8 to 12 appetizer or tapa servings", "recipeCuisine": "spanish", "recipeCategory": "project", "keywords": "appetizer, gluten-free, oxtail, piquillo peppers", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 402, "unsaturatedFatContent": "12 grams", "carbohydrateContent": "7 grams", "cholesterolContent": null, "fatContent": "26 grams", "fiberContent": "1 gram", "proteinContent": "30 grams", "saturatedFatContent": "10 grams", "sodiumContent": "671 milligrams", "sugarContent": "3 grams", "transFatContent": null}, "recipeIngredient": ["2 oxtails, about 3 pounds each, cut in 4- to 5-inch sections", "Salt", "black pepper", "3 medium onions, diced", "2 cloves garlic, 1 sliced", "1/4 pound piece Serrano ham, diced", "1 small green bell pepper, cored, seeded and diced", "1 tablespoon flat-leaf parsley, chopped", "1 plum tomato, finely chopped", "1 bay leaf", "Pinch crushed red chili flakes", "1 cup dry red wine", "2 cups beef stock", "2 jars (7 8/10 ounces) piquillo peppers, drained and patted dry, about 24"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Discard the narrow end section of each oxtail. Season the rest with salt and pepper and brown over high heat in a 6-quart casserole or braising pan. Remove. Reduce heat to low. Add 2/3 of the diced onions, the sliced garlic clove and the ham. Sauté until onions are soft."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, by hand or in food processor, finely chop the remaining onion and garlic with the green pepper and the parsley. Mix with the tomato. Add to the pan when the onions are soft, and reduce heat to medium. Cook, stirring, until all vegetables are soft. Stir in the bay leaf, chili flakes, wine and stock. Raise heat and bring to a simmer."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Return oxtails to pan, baste, cover and reduce heat to very low. Cook about 3 hours, turning once, until meat is fork tender. Remove oxtails to cool. Strain liquid and reserve, discarding solids. Finely chop or shred meat and mix with 2/3 cup of the liquid."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Stuff peppers with meat. Pour 1 cup liquid into a shallow baking dish. (The rest can be saved for another use.) Arrange peppers in dish and bake until heated through, 15 minutes."}], "link": "https://cooking.nytimes.com/recipes/1013263-oxtail-stuffed-peppers"}