{"@context": "http://schema.org", "@type": "Recipe", "name": "Risotto With Broccoli", "description": "Sometimes I get bored with broccoli — but then I use it in a risotto, and it’s like a completely new vegetable. The diced stems retain a nice texture that contrasts with the tender flowers. Make sure to slice the flowers thin for the most delicate results.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/01/19/health/19recipehealth_600/19recipehealth_600-articleLarge-v2.jpg", "totalTime": "PT45M", "recipeYield": "Serves 4 to 6", "recipeCuisine": "italian", "recipeCategory": "dinner, weekday, one pot", "keywords": "appetizer, main course, arborio rice, broccoli, gluten-free, healthy, high fiber, low cholesterol, low sugar, nut-free, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 147}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 423, "unsaturatedFatContent": "7 grams", "carbohydrateContent": "59 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "4 grams", "proteinContent": "17 grams", "saturatedFatContent": "3 grams", "sodiumContent": "614 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["2 quarts well-seasoned chicken or vegetable stock, as needed", "2 tablespoons extra virgin olive oil", "1/2 cup minced onion", "1 1/2 cups arborio or carnaroli rice", "1 to 2 garlic cloves (to taste), green shoots removed, minced", "Freshly ground pepper to taste", "1/2 cup dry white wine, such as pinot grigio or sauvignon blanc", "1 pound broccoli (2 good-size stalks), stems peeled and cut in small dice, flowers thinly sliced", "1/2 cup freshly grated Parmesan cheese", "2 tablespoons minced flat-leaf parsley"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Put your stock or broth into a saucepan, and bring it to a simmer over low heat with a ladle nearby or in the pot. Make sure that the stock is well seasoned."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the olive oil over medium heat in a wide, heavy skillet or in a large, wide saucepan. Add the onion and a generous pinch of salt, and cook gently until it is just tender, about three minutes. Do not brown."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the rice and the garlic, and stir until the grains separate and begin to crackle. Add the wine, and stir until it has been absorbed. Begin adding the simmering stock, a couple of ladlefuls (about 1/2 cup) at a time. The stock should just cover the rice and should be bubbling, not too slowly but not too quickly. Cook, stirring often, until it is just about absorbed. Add another ladleful or two of the stock, and continue to cook in this fashion, stirring in more stock when the rice is almost dry. You do not have to stir constantly, but stir often. After 10 minutes, stir in the diced broccoli stems. Continue to add broth and stir the rice for another five minutes. Stir in the thinly sliced flowers. Continue to add broth and stir the rice for another 10 minutes or so. When the rice is tender all the way through but still chewy, it is done. Taste now and adjust seasoning, adding salt and pepper to taste. Add another ladleful of stock to the rice, along with the Parmesan and the parsley, and remove from the heat. The mixture should be creamy (add more stock if it isn’t). Stir for about half a minute, then serve in wide soup bowls or on plates, spreading the risotto in a thin layer rather than a mound."}], "link": "https://cooking.nytimes.com/recipes/1013009-risotto-with-broccoli"}