{"@context": "http://schema.org", "@type": "Recipe", "name": "Naan (Indian Flatbread)", "description": "In spite of its ancient origins and utter simplicity, the tandoor produces startlingly sophisticated results, including smoky flatbreads that puff like pillows, and roasted meats of uncommon succulence. But you can make naan just as easily in an oven.", "author": {"@type": "Person", "name": "Steven Raichlen"}, "image": "https://static01.nyt.com/images/2014/03/19/dining/naan/naan-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "8 pieces", "recipeCuisine": "indian", "recipeCategory": "project", "keywords": "flour, ghee, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 333}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 372, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "61 grams", "cholesterolContent": null, "fatContent": "10 grams", "fiberContent": "2 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "243 milligrams", "sugarContent": "4 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 envelope (2 1/2 teaspoons) dry yeast", "2 tablespoons sugar", "4 1/2 to 5 cups all-purpose flour, more for dusting and rolling", "2 teaspoons salt", "1 teaspoon baking powder", "3 tablespoons milk", "2 tablespoons plain Greek yogurt", "1 large egg, lightly beaten", "2 tablespoons vegetable oil, more for the bowl", "3 tablespoons ghee (Indian-style clarified butter) or melted unsalted butter"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "In a small bowl, combine the yeast, sugar and 1/4 cup warm water (110 to 115 degrees). Let stand until foamy, 5 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place 4 1/2 cups flour, the salt and baking powder in the bowl of a food processor fitted with a dough blade or in mixer with a dough hook. Mix to blend. Add yeast mixture, milk, yogurt, egg, 2 tablespoons vegetable oil and 3/4 cup warm water. Knead dough until smooth and elastic, 2 to 3 minutes in a processor, 5 to 8 minutes in a mixer, 8 to 10 minutes by hand. Dough should be soft but not too sticky. Add flour as needed."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place dough in a large, lightly oiled bowl, turning to coat all sides. Cover bowl with plastic wrap, then a kitchen towel. Let the dough rise in a warm, draft-free spot until doubled, 1 to 1 1/2 hours."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Punch down the dough and divide into 8 equal pieces. Roll them into balls, place them on a lightly floured baking sheet and cover with a slightly damp kitchen towel. Let rise until doubled in size, 40 to 60 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a tandoor, heat it to about 450 degrees. If using the oven, place a pizza stone on the bottom rack and heat oven to 450 degrees. If using a barbecue grill, set it up for direct grilling and heat to medium-high."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Roll out a dough ball on a lightly floured work surface into a disk about 6 inches in diameter. Roll and stretch one end to make a teardrop shape. Brush off any excess flour. Repeat with remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using a tandoor, drape one piece of dough over the round cloth pillow called a gadhi. Press the bread onto the hot clay wall. Cook the naan until the top is puffed, blistered and browned, 1 to 2 minutes. Using a skewer, gently pry the bread off the tandoor wall, taking care not to scratch the clay. Brush the top of the bread with ghee or melted butter, then place in a cloth-lined basket for serving. Repeat with remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using an oven, turn on the broiler. Lay 1 or 2 pieces of dough on the pizza stone. Cook until the bottoms are browned and the tops blister, puff and are lightly toasted, 2 to 4 minutes. Remove from oven, brush tops with ghee or melted butter, and place in a cloth-lined basket for serving. Repeat with remaining dough."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "If using the grill, brush and oil the grate. Lightly brush top of dough with butter and place butter-side down on grate a few at a time (do not crowd the grate). Grill until the bottoms are browned and the tops start to puff and blister, 1 to 2 minutes. Lightly brush the tops with a little butter. Invert bread, and grill the other side until lightly browned, 1 to 2 minutes. Transfer to a cloth-lined basket, brushing tops of each with any remaining butter."}], "link": "https://cooking.nytimes.com/recipes/1013598-naan-indian-flatbread"}