{"@context": "http://schema.org", "@type": "Recipe", "name": "Rye Pretzels", "description": "", "author": {"@type": "Person", "name": "Pete Wells"}, "image": "https://static01.nyt.com/images/2014/05/13/dining/ryepretzel/ryepretzel-articleLarge.jpg", "totalTime": "PT3H", "recipeYield": "", "recipeCuisine": "", "recipeCategory": "", "keywords": "coarse sea salt, rye flour", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 57}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 173, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "33 grams", "cholesterolContent": null, "fatContent": "3 grams", "fiberContent": "4 grams", "proteinContent": "5 grams", "saturatedFatContent": "1 gram", "sodiumContent": "2519 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 (1/4-ounce) package active dry yeast", "1 tablespoon honey", "1 cup whole-grain or dark rye flour", "3 cups all-purpose flour", "1 tablespoon kosher salt", "2 tablespoons unsalted butter, melted, plus more for serving", "1/2 cup baking soda", "Coarse sea salt, for sprinkling", "Mustard, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Combine 1½ cups lukewarm water (110 to 115 degrees), yeast and honey in a large bowl; stir to combine. Add the rye flour, 2¾ cups all-purpose flour and kosher salt; stir again."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Dump the dough onto a lightly floured surface. Knead for 12 to 15 minutes, adding up to ¼ cup all-purpose flour if needed, until the dough is soft and smooth but not sticky. (Tip: to prevent dough from sticking to hands, rub a small amount of melted butter or vegetable oil on them.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly brush a large bowl with some of the melted butter. Shape the dough into a ball, seam side down, and transfer to the bowl; brush the surface of the dough with melted butter, cover with plastic wrap or a towel and let rise in a warm spot for up to 90 minutes, or until doubled in size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Lightly brush two parchment-lined baking sheets with butter. Punch down the dough and place on a lightly floured surface. Cut into 12 pieces. With your hands, roll one piece into a snake with thinly tapered ends, about 16 inches long. (Cover remaining pieces with plastic wrap while working.) Transfer to prepared baking sheet, looping one end, then the other, over the midpoint of the roll, making a pretzel shape. Repeat with remaining dough. Let the pretzels rest 15 to 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Preheat the oven to 450 degrees, placing two racks in and above the center of the oven. Meanwhile, bring 10 cups water to a boil in a large pot. When the pretzels are ready, stir the baking soda into the boiling water. (Note: if you double the recipe, make a fresh pot of the baking-soda wash for each batch.) Gently lift 2 or 3 pretzels, depending on the surface area of your pot, and slide them into the bath, knot side down. Poach for 30 seconds, turn them over and poach 30 seconds more. Using a long-handled mesh strainer, transfer the pretzels to a kitchen-towel-lined sheet tray to drain, then return them to the prepared baking sheets. Sprinkle freely with sea salt. Repeat with remaining pretzels."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bake for 14 to 18 minutes, turning the trays halfway through, until dark brown. Transfer to a cooling rack until just cool enough to eat. Brush the tops with melted butter, if you like. Serve with mustard."}]}