{"@context": "http://schema.org", "@type": "Recipe", "name": "Zucchini and Carrot Fritters With Yogurt-Mint Dip", "description": "These crispy fritters, which Melissa Clark developed for her picky daughter, are also an ideal cocktail accompaniment. Hot, salty and crunchy: They can be devoured in one or two bites. To make them, combine shredded or diced carrots and zucchini, lemon zest and scallion with a light batter of flour, egg, milk, coriander and pepper. Let them rest for a half-hour so the vegetables can soften, then drop the battered vegetables by the spoonful into the oil and fry until golden all over. Sprinkle with salt and serve with a creamy dip of yogurt, mint and garlic, and watch them disappear.", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/04/28/dining/Zucchini-and-Carrot-Fritters/Zucchini-and-Carrot-Fritters-articleLarge.jpg", "totalTime": "PT1H", "recipeYield": "3 dozen fritters", "recipeCuisine": "", "recipeCategory": "", "keywords": "appetizer, side dish, carrot, zucchini, summer, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 323}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 70, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "4 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "0 grams", "proteinContent": "1 gram", "saturatedFatContent": "1 gram", "sodiumContent": "61 milligrams", "sugarContent": "1 gram", "transFatContent": "0 grams"}, "recipeIngredient": ["1 cup all-purpose flour, more as needed", "1 teaspoon baking powder", "1 teaspoon coriander", "3/4 teaspoon kosher salt, more for serving", "1 cup milk, more as needed", "1 large egg", "1/4 teaspoon grated lemon zest", "1/4 teaspoon pepper", "2 large carrots, grated (about 1 1/2 cups)", "1 large zucchini, grated (about 2 cups)", "2 scallions, finely chopped", "1 garlic clove, finely chopped", "1/2 cup plain yogurt", "1 tablespoon chopped mint", "1 tablespoon extra virgin olive oil", "Olive oil, for frying"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the batter for the fritters: in a large bowl, whisk together the flour, baking powder, coriander and 1/2 teaspoon salt. In a separate large bowl, whisk together the milk, egg, lemon zest and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour dry ingredients into wet; whisk until just blended (do not overmix). Batter should be slightly thicker than cream. If it’s too thick, add some milk; if it’s too thin, sprinkle with additional flour. Stir in the carrots, zucchini and scallions. Allow to rest for 30 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "To make the yogurt dip: using a mortar and pestle or the back of a knife, mash together the garlic and 1/4 teaspoon salt. In a small bowl, whisk together the garlic paste, yogurt, mint and 1 tablespoon extra virgin oil. Cover and refrigerate until ready to use."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Fill a wide saucepan with 1 inch of olive oil; heat until the temperature registers 375 degrees on a deep-fry thermometer (or until a small drip of batter browns immediately). Line a cookie sheet with paper towels. Working in batches, drop battered vegetables by the tablespoon into the oil, being sure not to overcrowd the pan. Fry, turning occasionally, until golden all over, about 3 to 4 minutes. Use a slotted spoon to transfer fritters to the cookie sheet to drain. Transfer fritters to a platter or plate; sprinkle with salt and serve with yogurt dip."}], "link": "https://cooking.nytimes.com/recipes/1013317-zucchini-and-carrot-fritters-with-yogurt-mint-dip"}