{"@context": "http://schema.org", "@type": "Recipe", "name": "Sourdough Starter", "description": "This is an adaptation of the instructions for making a starter outlined by Peter Reinhart in his “Artisan Breads Every Day.” It takes a little more or less than a week of mixing flour with liquid – Mr. Reinhart starts with unsweetened pineapple juice (though you could also use orange juice or apple cider), then switches to water – to achieve a vigorous, living starter. Once it is bubbling and fragrant, with a light yeasty-boozy scent, you can use it and feed it daily with a cup of flour and a half-cup of water. Or put the starter in the refrigerator and feed it weekly, always discarding (or using!) a cup of the original when you do. (All measurements are by weight.)", "author": {"@type": "Person", "name": "Oliver Strand"}, "image": "https://static01.nyt.com/images/2016/03/23/dining/23SOURDOUGH1/23SOURDOUGH1-articleLarge.jpg", "totalTime": "P8D", "recipeYield": "2 pizza recipes and leftover starter", "recipeCuisine": "", "recipeCategory": "dinner, lunch, project", "keywords": "flour, unsweetened pineapple juice", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 1089}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 424, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "89 grams", "cholesterolContent": null, "fatContent": "1 gram", "fiberContent": "3 grams", "proteinContent": "12 grams", "saturatedFatContent": "0 grams", "sodiumContent": "6 milligrams", "sugarContent": "2 grams", "transFatContent": null}, "recipeIngredient": ["16 ounces flour", "3 ounces pineapple juice", "10 ounces filtered or spring water"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Make seed culture: Combine 1 ounce of the flour and 2 ounces pineapple juice in a large glass or small nonreactive bowl. Cover tightly with plastic wrap and leave at room temperature, stirring with a wet spoon twice a day. Bubbles should appear after 24 to 36 hours. After 48 hours, add 1 ounce flour and remaining pineapple juice, stirring to incorporate. Re-cover with plastic wrap and leave at room temperature, stirring with a wet spoon twice a day. When it is foamy, in 1 to 4 days, combine 2 ounces flour and 1 ounce filtered or spring water in a medium nonreactive bowl. Add seed culture, stirring to incorporate, and re-cover with plastic wrap. Stir twice a day to aerate."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When mixture has doubled in bulk, in 1 to 2 days, convert it into a starter: Combine 12 ounces flour and 9 ounces filtered or spring water in bowl. Add 4 ounces of seed culture mixture (discard the rest, or use to make a second starter) and mix until fully incorporated. Transfer to a lightly floured surface and knead for 2 minutes. It should have the consistency of bread dough. Transfer to a nonreactive bowl and let rest at room temperature until it doubles in size, about 4 to 8 hours. Knead lightly, then store in container with tight-fitting lid (container must be large enough to let starter triple in bulk). Store in refrigerator."}]}