{"@context": "http://schema.org", "@type": "Recipe", "name": "Grapefruit Fluff", "description": "", "author": {"@type": "Person", "name": "Amanda Hesser"}, "image": "https://static01.nyt.com/images/2014/04/28/dining/Grapefruit-Fluff/Grapefruit-Fluff-articleLarge-v2.jpg", "totalTime": "PT1H15M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "dessert, pink grapefruit, vanilla ice cream", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 38}, "recipeIngredient": ["2 pink grapefruits", "¼ cup brandy or kirsch", "2 egg whites", "Pinch of salt", "½ cup sugar", "Vanilla ice cream"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Halve the grapefruits. Using a small, sharp paring knife or one of those nifty grapefruit knives, remove the grapefruit segments and place them in a bowl. Gently remove the membrane from the grapefruits and discard it. You should be left with 4 hollowed-out grapefruit halves. Reserve them."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Pour the brandy over the grapefruit segments and chill for 1 hour."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When ready to serve, heat the broiler and arrange an oven rack about 6 inches from the heating element. In a mixer fitted with a whisk or by hand, whip the egg whites with a pinch of salt until foamy, then gradually add the sugar, beating until the whites are firm and shiny."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Spoon the grapefruit segments into the grapefruit halves. Put a layer of ice in a baking pan and arrange the grapefruit halves on top. (This helps steady them and also keeps the cool part cool.) Add a large scoop of ice cream to each, then flatten the ice cream to make room for the meringue. Dollop the meringue on top. Place under the broiler and toast until the meringue is hazelnut brown, about 1 minute. Transfer the grapefruits to shallow bowls and serve."}]}