{"@context": "http://schema.org", "@type": "Recipe", "name": "Shrimp, Sugar-Snap Pea and Potato Salad With Mint and Pecorino", "description": "This recipe breaks the taboo of combining seafood and cheese. This salad of blanched shrimp, new potatoes and crisp disks of sugar-snap peas is perfectly adequate. It is vibrant from fresh mint, tangy from red-wine vinegar and mustard in the vinaigrette, sweet from the shrimp and earthy from the potatoes, but a few shards of young pecorino add the saline funk that brings this dish together. The cheese will practically melt into the salad, adding a glossy complexity. (Another young, semifirm sheep’s milk cheese would work. So would aged pecorino, but use less since it’s saltier. ) ", "author": {"@type": "Person", "name": "Melissa Clark"}, "image": "https://static01.nyt.com/images/2014/03/10/dining/10shrimp/10shrimp-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "weekday, salads and dressings", "keywords": "pecorino, shrimp, sugar snap peas", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 74}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 396, "unsaturatedFatContent": "17 grams", "carbohydrateContent": "21 grams", "cholesterolContent": null, "fatContent": "24 grams", "fiberContent": "4 grams", "proteinContent": "24 grams", "saturatedFatContent": "6 grams", "sodiumContent": "945 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3/4 pound sugar-snap peas", "2 tablespoons Dijon mustard", "3 tablespoons red-wine vinegar, plus more for serving", "1 1/4 teaspoons coarse sea salt", "3/4 teaspoon pepper, plus more for serving", "1/2 cup extra virgin olive oil, plus more for serving", "1 pound new fingerling or small yellow potatoes", "1 1/2 pounds large shrimp, peeled", "3/4 cup loosely packed mint leaves", "3/4 cup coarsely grated young pecorino (or 1/2 cup aged)", "Crusty bread, for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Trim and string the peas, then thinly slice them crosswise. Place them in a large bowl. In a small bowl, whisk together the mustard, vinegar, 1/4 teaspoon salt, and pepper to taste. Slowly whisk in the oil."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Cook the potatoes until tender, about 15 minutes. Transfer with a slotted spoon to a cutting board. Add the shrimp to the pot and cook until opaque, 2 minutes. Transfer with a slotted spoon to the bowl of peas."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "While the potatoes are warm, slice them into 1/2-inch rounds, and place them in a small bowl. Gently toss them with 1/2 cup of the vinaigrette, 1 teaspoon salt, and 3/4 teaspoon pepper. Spread them on a large platter to cool."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the shrimp are cool, toss with the peas and remaining vinaigrette. Spoon the mixture over the potatoes. Tear the mint leaves, and scatter the pieces over the salad. Sprinkle with cheese and pepper. Drizzle with oil and add a little vinegar to taste, if needed."}], "link": "https://cooking.nytimes.com/recipes/1013677-shrimp-sugar-snap-pea-and-potato-salad-with-mint-and-pecorino"}