{"@context": "http://schema.org", "@type": "Recipe", "name": "Sweet Potato Steak Fries With Crunchy Spices", "description": "Sweet potato fries in restaurants are usually double-deep-fried; it’s difficult to make them crisp in an oven, but this recipe does the trick at the last minute with brown sugar and spices.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT40M", "recipeYield": "10 servings", "recipeCuisine": "", "recipeCategory": "easy", "keywords": "cumin, paprika, sweet potato, fall, side dish, vegan, vegetarian", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 5}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 171, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "29 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "4 grams", "proteinContent": "2 grams", "saturatedFatContent": "1 gram", "sodiumContent": "333 milligrams", "sugarContent": "7 grams", "transFatContent": null}, "recipeIngredient": ["3 pounds sweet potatoes", "1/4 cup olive oil", "2 teaspoons paprika, sweet, hot or a combination", "1 tablespoon coarse or kosher salt", "1 teaspoon cumin seeds, toasted", "1 teaspoon coriander seeds, toasted", "1 tablespoon dark brown sugar"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the oven to 425 degrees. Cut the skins off the sweet potatoes, squaring off the round sides to make each potato into a large rectangle. Cut into long fries about 1/4-inch thick and 1 inch wide. (If not using potatoes immediately, soak in water for up to 1 day.  Drain and pat dry before cooking.)"}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put two large sheet pans in the oven to heat. Toss the potatoes, and skins if you like, with oil, paprika and 2 teaspoons of the salt. Arrange in one layer on the hot pans. (Don’t use parchment paper; it will make the potatoes soggy.) Roast until tender and starting to brown on the bottom, about 15 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, grind the cumin, coriander and 1 teaspoon salt together. Mix in the brown sugar."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove pans from the oven and raise the heat to 450 degrees, or set to broil. With a spatula, carefully loosen the fries and turn each one over.  Sprinkle with the spice and sugar mixture. Return to the oven and bake just until the fries are blistered and sizzling vigorously, about another 5 minutes.  (If your oven has a convection feature, use it.)  Do not overcook, or the fries will become leathery.  Cool slightly."}]}