{"@context": "http://schema.org", "@type": "Recipe", "name": "Farcidure Grillée (Firm Stuffing)", "description": "", "author": {"@type": "Person", "name": "Elaine Sciolino"}, "image": null, "totalTime": "PT55M", "recipeYield": "4 to 6 servings", "recipeCuisine": "french", "recipeCategory": "", "keywords": "leek, onion, potato, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 194, "unsaturatedFatContent": "4 grams", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "6 grams", "fiberContent": "4 grams", "proteinContent": "6 grams", "saturatedFatContent": "2 grams", "sodiumContent": "514 milligrams", "sugarContent": "2 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds (about 4 medium) Yukon Gold, Idaho or other all-purpose potatoes", "1/3 cup finely chopped leek (white and light green parts only)", "1/4 cup finely chopped onion", "3 tablespoons finely chopped parsley", "4 large leaves and tender stems of Swiss chard, finely chopped", "2 cloves garlic, minced", "Salt", "black pepper", "3 slices bacon, cut crosswise into 1/4-inch pieces"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Finely grate the potatoes into a large bowl. Add the leek, onion, parsley, Swiss chard and garlic. Mix well and season to taste with salt and pepper."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a large (10- to 12-inch) well-seasoned or nonstick skillet over medium heat. Add half the bacon and sauté until the fat is rendered and the bacon is crisp, about 5 minutes. Spread the fat and bacon evenly across the bottom of the pan, and add the potato mixture, patting it down evenly to the edges. Raise heat to high and allow the mixture to cook undisturbed for 1 minute, then reduce heat to medium and continue to cook without stirring for 10 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Gently slide a spatula around the edges of the farcidure to loosen it from the sides and bottom. Remove the pan from the heat, place a large platter or baking sheet on top of the pan, and invert it to transfer the farcidure to the platter."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat oven to 350 degrees. Return the pan to medium heat. Add remaining bacon and sauté until the fat is rendered and the bacon is crisp, about 5 minutes. Slide the farcidure back into the skillet, uncooked side down. Raise heat to high and cook undisturbed for 1 minute, then reduce to medium and cook without stirring for 10 more minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover pan with a lid, baking sheet or foil, and transfer to the oven. Bake until the center is moist and tender, about 10 more minutes. To serve, slide onto a platter and cut into slices. If desired, serve with a salad, or as an accompaniment to a meat or poultry stew."}], "link": "https://cooking.nytimes.com/recipes/1013836-farcidure-grillee-firm-stuffing"}