{"@context": "http://schema.org", "@type": "Recipe", "name": "Spaghetti With Sausage Alla Carbonara", "description": "A few days after a tasting of 2005 Barbarescos, I had dinner at Centolire, Pino Luongo’s Italian restaurant on the Upper East Side. As I cruised the wine list, Mr. Luongo suggested a Barbaresco he had just acquired. Perfect timing.The menu offered several dishes that would seem to complement a Barbaresco, including chicken livers on a bed of fennel, a Tuscan pot roast, and spaghetti with sausage. My husband and I tried them all. The intensity of the chicken livers and beef, however, seemed to point more toward Barolo. The pasta, Mr. Luongo’s variation on the classic carbonara, delivered balance and richness.His approach to cooking is a very grandmotherly “some of this, some of that.” He did provide some measurements, but I felt at ease adjusting them to my taste, like reducing the amount of pepper and increasing the cheese. ", "author": {"@type": "Person", "name": "Florence Fabricant"}, "image": "https://static01.nyt.com/images/2016/12/05/dining/05COOKING-SPAGSAUSAGECARBONARA2/05COOKING-SPAGSAUSAGECARBONARA2-articleLarge.jpg", "totalTime": "PT45M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, weekday, pastas", "keywords": "appetizer, main course, sausage, spaghetti", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 451}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 509, "unsaturatedFatContent": "8 grams", "carbohydrateContent": "60 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "3 grams", "proteinContent": "27 grams", "saturatedFatContent": "6 grams", "sodiumContent": "552 milligrams", "sugarContent": "3 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["1 pound sweet Italian sausage", "1 tablespoon extra virgin olive oil", "1 tablespoon unsalted butter", "1 medium onion, sliced thin", "1 1/2 teaspoons pepper", "2 bay leaves", "1/2 cup dry white wine", "Salt", "1 pound spaghetti", "3 large eggs", "1/4 cup pecorino Romano"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove casings from sausage. Using a knife, a fork or your hands on a cutting board, break meat into small pieces. Heat oil and butter in a large skillet. Add onion and cook on medium-low just until translucent."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add sausage, mashing and breaking it up with a wooden spoon until it is uniformly crumbly and has lost its pinkness. Stir in the pepper and bay leaves. Add wine and cook until it has nearly evaporated, about 2 minutes. Remove skillet from heat and discard bay leaves. Season meat to taste with salt."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of salted water to a boil. Cook spaghetti until al dente, 6 to 7 minutes. Meanwhile, fill a large serving bowl with hot water or warm it in a low oven. Lightly beat the eggs in a small dish. Just before pasta is done, return pan with sausage to low heat. When pasta is done, slowly beat about a tablespoon of pasta water into eggs. Then drain the pasta."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Transfer sausage to warm serving bowl. Pour spaghetti on top and toss it with the sausage, slowly adding the beaten eggs. Add salt to taste and fold in the pecorino."}], "link": "https://cooking.nytimes.com/recipes/1013367-spaghetti-with-sausage-alla-carbonara"}