{"@context": "http://schema.org", "@type": "Recipe", "name": "Ultimate Clambake", "description": "A clambake is one of those absurdly demanding culinary tasks that can still be performed by normal people — that is, nonchefs.\n\nI’ve worked through all of that. And if you follow my “recipe” (which includes phrases I don’t often employ, like “find about 30 rocks, each 6 by 4 inches”), you should have a memorable experience. Few meals are more beautiful than a well-executed clambake. And because demanding culinary tasks are in vogue, at least for a certain hard-working segment of the sustainable-food set, it seems like the right moment for a clambake revival.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": "https://static01.nyt.com/images/2014/04/07/dining/clam/clam-articleLarge-v3.jpg", "totalTime": "PT6H", "recipeYield": "8 to 12 servings", "recipeCuisine": "new england", "recipeCategory": "dinner, project", "keywords": "main course, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 21}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 747, "unsaturatedFatContent": "5 grams", "carbohydrateContent": "63 grams", "cholesterolContent": null, "fatContent": "11 grams", "fiberContent": "5 grams", "proteinContent": "97 grams", "saturatedFatContent": "2 grams", "sodiumContent": "2913 milligrams", "sugarContent": "7 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds waxy potatoes", "Salt", "6 pounds hard-shell clams, preferably littleneck or cherrystone, well scrubbed", "6 pounds mussels, well scrubbed", "8 to 12 ears fresh corn", "8 to 12 small lobsters", "1 cup (2 sticks) butter, for serving", "Lemon wedges for serving"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Before you leave the house, put the potatoes and a few large pinches of salt in a very large pot and add water to cover; bring to a boil and cook until they are about half done, 10 to 15 minutes. Drain and transfer to a container to take with you to beach."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Take all the ingredients to the beach, along with a shovel, a tarp, a few garbage bags, a bucket, some cheesecloth, a box of matches, lots of newspaper, firewood and kindling. Find a spot above the high-water mark and dig a 4-by-2-by-2-foot hole. Build a fire in the hole with newspaper, kindling and some wood. (Keep everything else upwind of the fire.) Feed the fire quickly and steadily with more kindling and wood."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Find about 30 rocks, each 6 by 4 inches or bigger. Start adding the rocks to the fire, a few at a time, slowly over the course of about an hour, while continuing to feed the fire with wood. While the rocks are heating, gather enough seaweed to half-fill 2 or 3 garbage bags."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the rocks are white hot (this should take about an hour), stop adding wood but let the fire continue to burn. Meanwhile, make 8 to 12 cheesecloth packages, each containing a few of the clams, mussels and potatoes. Peel back the husks of the corn but don’t remove them; remove as much of the silk as you can, then fold the husks back into place."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Remove any remaining wood from the fire with a shovel; a bed of coals topped by a layer of white-hot rocks should remain. Immediately dump the seaweed over the rocks, creating a layer at least 2 to 3 inches thick; no rocks should remain exposed or you will burn the food (and maybe the tarp). Sprinkle the seaweed with about a gallon of seawater. Put the cheesecloth packages, corn and lobsters in a single layer on top of the seaweed. Cover the food in an additional layer of seaweed and cover the entire pit with a tarp, weighing the edges of the tarp down with rocks."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook undisturbed for 30 to 40 minutes. Put the butter in a heatproof saucepan. When the seafood is ready, peel back the tarp and put the pan of butter on the fire until it melts. Remove the tarp entirely, transfer the food to serving platters and serve everything with the melted butter, lemon wedges and more salt."}]}