{"@context": "http://schema.org", "@type": "Recipe", "name": "Harissa", "description": "", "author": {"@type": "Person", "name": "Mike Emanuel"}, "image": null, "totalTime": "PT1H10M", "recipeYield": "", "recipeCuisine": "moroccan", "recipeCategory": "condiments", "keywords": "", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 8}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 268, "unsaturatedFatContent": "23 grams", "carbohydrateContent": "5 grams", "cholesterolContent": null, "fatContent": "28 grams", "fiberContent": "2 grams", "proteinContent": "1 gram", "saturatedFatContent": "4 grams", "sodiumContent": "121 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["2 ounces dried red chili, such as Nora or Ancho, stemmed and seeded", "1 fleshy red bell or pimento pepper", "1 teaspoon tomato paste", "1 teaspoon red-wine vinegar", "Salt to taste", "1 cup extra-virgin olive oil", "2 teaspoons coriander seeds, toasted", "2 teaspoons cumin seeds, toasted", "½ teaspoon caraway seeds, toasted", "3 garlic cloves, peeled", "Cayenne pepper to taste"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "On a sheet tray, toast the dried chili peppers in a 350-degree oven until they start to smell good. Be careful not to burn them, as they go from nicely toasted to burned in a matter of seconds. Place in a bowl and cover with hot water, leaving them to rehydrate for about 20 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Grill or broil the bell or pimento pepper until well charred and blistered. Seal in a paper bag for 20 minutes to steam. Scrape the charred skin off the pepper and remove, discarding the seeds and stem. Avoid the temptation to rinse the pepper while cleaning it, as its delicious oils would be lost."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Drain the chilies and place in a blender jar with the roasted pepper, tomato paste, vinegar, a good pinch of salt and about a quarter of the olive oil. Blend to a thick, fairly smooth paste, adding more oil as needed to facilitate blending. Transfer to a medium bowl."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Coarsely grind the toasted spices in a mortar and add to the pepper mixture. Pound the garlic cloves to a paste with a pinch of salt in the mortar and add to the mixture. Slowly mix in the rest of the oil with a spoon, not being overly concerned with creating an even consistency. Taste and adjust with salt and cayenne. The oil will rise and stay somewhat separate from the chili solids, allowing the harissa to be preserved in the fridge for months. Just stir together before using it. The oil itself is a delicious flavoring agent."}]}