{"@context": "http://schema.org", "@type": "Recipe", "name": "Pasta With Fresh Tomato Sauce", "description": "I have been cooking a version of this dish practically since I first encountered \nit in a “60-Minute Gourmet” column, the brainchild of the late Pierre Franey, in \nJanuary 1986. Why Pierre published the recipe in mid-winter is a mystery. To make the sauce my way you chop tomatoes; you put them in fat, whether that’s olive oil, butter or, I suppose, rendered bacon fat; you cook them until they’ve broken down a bit and given up their liquid; and you dress pasta with the resulting sauce. (Pierre peeled the tomatoes first, because that was his style. He was a chef!) With good tomatoes, you can make this sauce in its most basic form — with no more than tomato, oil and salt — and it will be terrific. But you can jazz it up in a variety of ways; butter in place of oil changes its character noticeably. Parmesan is an obvious and welcome addition. Cooking a bit of chopped onion or minced garlic in the butter or oil — with or without rosemary, tarragon or thyme — before adding the tomatoes adds depth. Chopped basil at the end ... well, to me this is practically essential.", "author": {"@type": "Person", "name": "Mark Bittman"}, "image": null, "totalTime": "PT20M", "recipeYield": "4 to 6 servings", "recipeCuisine": "italian", "recipeCategory": "dinner, easy, quick, pastas", "keywords": "appetizer, main course, pasta, tomato, summer", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 63}, "recipeIngredient": ["Salt", "3 to 5 tablespoons butter or olive oil", "1 1/2 pounds tomatoes, roughly chopped", "1 pound linguine or other long pasta", "1/2 cup shredded fresh basil leaves, if desired", "Freshly grated Parmesan, if desired"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to a boil and salt it. Put the butter or oil in a large skillet over medium heat; when the oil is hot or the butter’s foam subsides, add the tomatoes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Cook, stirring occasionally, until the tomatoes break up, about 10 minutes, adding salt and freshly ground black pepper to taste. Meanwhile, cook the pasta until done; drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Toss together pasta and sauce, along with basil and Parmesan, if you like. Taste and adjust the seasoning and serve."}], "link": "https://cooking.nytimes.com/recipes/1013287-pasta-with-fresh-tomato-sauce"}