{"@context": "http://schema.org", "@type": "Recipe", "name": "Steamed Blue Crabs", "description": "For steamed crabs, that beach-town summer standby, the Chesapeake catechism teaches plenty: buy more crabs than you think you need, use more spice, a larger pot. Get wooden mallets. Prepare to eat for a while.\n\nIf you don’t have a crab pot, and most of us don’t, fiddle with the largest stockpot or pasta boiler you have. Set a few clean, empty metal cans upside down on the bottom or invert a colander in there, anything that allows you to have a boiling liquid at the bottom and crabs above it, with none of them swimming around in the soup.", "author": {"@type": "Person", "name": "Sam Sifton"}, "image": "https://static01.nyt.com/images/2010/06/13/magazine/13food-span/13food-span-articleLarge-v3.jpg", "totalTime": "PT30M", "recipeYield": "Serves 4", "recipeCuisine": "", "recipeCategory": "dinner, easy, quick", "keywords": "gluten-free, main course", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 4, "ratingCount": 13}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 145, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "9 grams", "cholesterolContent": null, "fatContent": "2 grams", "fiberContent": "1 gram", "proteinContent": "15 grams", "saturatedFatContent": "0 grams", "sodiumContent": "240 milligrams", "sugarContent": "0 grams", "transFatContent": null}, "recipeIngredient": ["12 ounces beer", "1 cup apple-cider vinegar", "1 dozen large blue crabs", "1/2 cup Chesapeake-style crab seasoning, preferably Old Bay"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Place a steamer pot or any large, heavy pot with a tight-fitting lid on the stove. (In the latter case, improvise a rack on the bottom of the pot that will keep crabs a few inches from the bottom.) Add the beer, vinegar and 1 cup water. Bring to a boil over high heat."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Put a layer of crabs on the rack in the pot. Sprinkle with a generous amount of seasoning, then repeat with another layer, and another, until all 12 crabs are in pot (and well seasoned). Cover and steam over medium-high heat until the crabs are bright red, 25 to 30 minutes. Remove the crabs with tongs. Serve over newspaper, with mallets and picks."}]}