{"@context": "http://schema.org", "@type": "Recipe", "name": "Smashed Red Potatoes With Cabbage", "description": "I set out to make a traditional Irish colcannon here, a mixture of mashed potatoes with cabbage and scallions. But I decided to go with a lighter carbohydrate load, using red boiling potatoes rather than starchier Idaho potatoes. Instead of making a purée of them, after cooking the potatoes in their skins I quarter them and, skin and all, smash them in a hot pan with a potato masher or the back of a spoon.", "author": {"@type": "Person", "name": "Martha Rose Shulman"}, "image": "https://static01.nyt.com/images/2010/11/03/science/03recipehealth/03recipehealth-articleLarge-v2.jpg", "totalTime": "PT1H10M", "recipeYield": "Serves six", "recipeCuisine": "irish", "recipeCategory": "easy", "keywords": "cabbage, red potato, gluten-free, healthy, vegetarian, side dish", "aggregateRating": {"@type": "AggregateRating", "ratingValue": 5, "ratingCount": 173}, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 173, "unsaturatedFatContent": "1 gram", "carbohydrateContent": "30 grams", "cholesterolContent": null, "fatContent": "4 grams", "fiberContent": "5 grams", "proteinContent": "5 grams", "saturatedFatContent": "3 grams", "sodiumContent": "608 milligrams", "sugarContent": "6 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["2 pounds red potatoes, scrubbed", "Salt", "1 pound cabbage (1/2 medium cabbage), quartered, cored and cut in thin shreds across the grain", "2 tablespoons unsalted butter or extra virgin olive oil", "2 heaped tablespoons chopped scallions (about 3 scallions)", "2/3 cup low-fat milk (more as needed)", "Freshly ground pepper", "2 tablespoons minced chives (optional)"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Cover the potatoes with water in a saucepan, add about 1/2 teaspoon of salt and bring to a boil. Reduce the heat to medium, cover partially and cook until tender all the way through when pierced with a knife, about 30 minutes. Do not drain the water, but using a skimmer or a slotted spoon, transfer the potatoes from the pot to a bowl. Cover tightly and allow to sit for five to 10 minutes. Then, using a towel to hold the potatoes steady (because they’re still hot), cut them into quarters."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, bring the water back to a boil, add more salt if desired and add the cabbage. Cook uncovered until tender, five to six minutes. Drain."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Heat the butter or oil over medium heat in a large, heavy nonstick skillet, and add the scallions. Cook, stirring, until they soften, about three minutes. Add the potatoes. Smash the potatoes to a coarse mash in the pan with a potato masher or the back of your spoon. Stir in the hot milk, and mix together well until the potatoes have absorbed all the milk. Stir in the cabbage, and season generously with salt and pepper. Add the chives, stir together until heated through and serve."}], "link": "https://cooking.nytimes.com/recipes/1013334-smashed-red-potatoes-with-cabbage"}