{"@context": "http://schema.org", "@type": "Recipe", "name": "Potato Salad With Pepperoni, Shallots and Vinegar", "description": "Here's a unique twist on the traditional German potato salad adapted from Torrisi Italian Specialties, a now shuttered Manhattan restaurant known for its nuanced approach to traditional Italian-American cuisine. Instead of bacon, this version calls for pepperoni, and shallots instead of onion or scallions. The finely chopped pepperoni is sautéed with a generous pile of chopped shallots, dried oregano and fresh sage to which white wine vinegar is added to make a dressing that coats the potatoes in an addictive salty-spicy-tangy slurry. Don't skip the step that calls for boiling the potatoes with garlic cloves, thyme and peppercorns. It infuses the flesh of the potato with a subtle, herby flavor that's worth the extra effort.", "author": {"@type": "Person", "name": "Julia Moskin"}, "image": null, "totalTime": "PT30M", "recipeYield": "8 to 10 servings", "recipeCuisine": "", "recipeCategory": "quick", "keywords": "gluten-free, pepperoni, potato, side dish", "aggregateRating": null, "nutrition": {"@context": "http://schema.org", "@type": "NutritionInformation", "calories": 312, "unsaturatedFatContent": "9 grams", "carbohydrateContent": "35 grams", "cholesterolContent": null, "fatContent": "16 grams", "fiberContent": "6 grams", "proteinContent": "10 grams", "saturatedFatContent": "4 grams", "sodiumContent": "524 milligrams", "sugarContent": "5 grams", "transFatContent": "0 grams"}, "recipeIngredient": ["3 pounds small red-skinned potatoes, not peeled", "6 garlic cloves, peeled", "10 to 12 sprigs thyme", "1/2 teaspoon black peppercorns", "Salt", "1/4 cup olive oil", "6 sage leaves, fresh or dried", "1 tablespoon dried oregano", "8 ounces pepperoni, finely chopped or ground", "6 large shallots, peeled and thinly sliced", "1/4 cup white wine vinegar", "Ground black pepper"], "recipeInstructions": [{"@context": "http://schema.org", "@type": "HowToStep", "text": "Bring a large pot of water to boil over high heat. Add potatoes, garlic, thyme, peppercorns and 2 tablespoons of salt, then boil until potatoes are just tender, 10 to 15 minutes depending on size."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Meanwhile, heat oil in a large pan over medium heat until shimmering. Add sage and oregano and fry until fragrant, about 30 seconds. Add the pepperoni, lower heat to medium-low, and render fat from the meat for about 2 minutes. Add shallots and cook, stirring occasionally, until tender, 8 to 10 minutes."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "When the potatoes are done, drain them, discard garlic, thyme and peppercorns, and lightly crush potatoes with the back of a fork. Keep warm in a bowl, covered with a kitchen towel."}, {"@context": "http://schema.org", "@type": "HowToStep", "text": "Add the vinegar to the skillet and stir, scraping up any brown bits from the bottom of the pan. Pour mixture over warm potatoes, toss and add salt and pepper as needed. Serve warm."}]}